[{"hadith-eng":"`Umar bought a silk cloak from the market, took it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! \nTake it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Messenger (ﷺ) \n(p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period \nAllah's Messenger (ﷺ) (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Messenger (ﷺ) \n(p.b.u.h) with the cloak and said, \"O Allah's Messenger (ﷺ)! You said that this dress was for those who had \nno share (in the Hereafter); yet you have sent me this cloak.\" Allah's Messenger (ﷺ) said to him, \"Sell it and \nfulfill your needs by it.\"","reference":"Sahih al-Bukhari 948, Book 13, Hadith 1","grade":"","question #":"question #1","question":"What is the Islamic perspective on wearing silk for men, and how does it relate to the concept of the Hereafter?","id":"bukhari-13-1"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.","reference":"Sahih al-Bukhari 949, 950, Book 13, Hadith 2","grade":"","question #":"question #1","question":"What does this narration suggest about the permissibility of music and singing in Islam during special occasions?","id":"bukhari-13-2"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.","reference":"Sahih al-Bukhari 949, 950, Book 13, Hadith 2","grade":"","question #":"question #1","question":"What does this narration suggest about the permissibility of music and singing in Islam during certain occasions?","id":"bukhari-13-3"},{"hadith-eng":"I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first \nday of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the \nname of Allah) and whoever does so, he acted according to our Sunna (traditions).\"","reference":"Sahih al-Bukhari 951, Book 13, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of performing the prayer before slaughtering the sacrifice on Eid ul Adha?","id":"bukhari-13-4"},{"hadith-eng":"Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the \nAnsar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical \ninstruments of Satan in the house of Allah's Messenger (ﷺ) !\" It happened on the `Id day and Allah's Messenger (ﷺ) \nsaid, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"","reference":"Sahih al-Bukhari 952, Book 13, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of celebrating Eid in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-13-5"},{"hadith-eng":"Allah's Messenger (ﷺ) never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some \ndates. Anas also narrated: The Prophet (ﷺ) used to eat odd number of dates.","reference":"Sahih al-Bukhari 953, Book 13, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of eating dates before the Eid prayer?","id":"bukhari-13-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" \nA man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned \nsomething about his neighbors. It seemed that the Prophet (ﷺ) I believed him. Then the same man added, \n\"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet (ﷺ) permitted \nhim to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for \nothers as well.","reference":"Sahih al-Bukhari 954, Book 13, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of performing the sacrifice after the 'Id prayer in Islamic tradition?","id":"bukhari-13-7"},{"hadith-eng":"The Prophet (ﷺ) delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever \noffers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. \nAnd whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi \nBurda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Messenger (ﷺ)! I have slaughtered my sheep before \nthe `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked \nthat my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my \nfood before coming for the prayer.\" The Prophet (ﷺ) said, \"The sheep which you have slaughtered is just \nmutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Messenger (ﷺ)! I have a young she-goat which is \ndearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) \nsaid, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after \nyou.\"","reference":"Sahih al-Bukhari 955, Book 13, Hadith 7","grade":"","question #":"question #1","question":"What are the conditions for a sacrifice to be accepted on the Day of Nahr?","id":"bukhari-13-8"},{"hadith-eng":"The Prophet (ﷺ) used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to \nbegin with was the prayer and after that he would stand in front of the people and the people would \nkeep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. \nKhutba). And after that if he wished to send an army for an expedition, he would do so; or if he \nwanted to give and order, he would do so, and then depart. The people followed this tradition till I \nwent out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. \nWhen we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get \nup on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit \nand delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's \ntradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know \nis better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the \nprayer, so I delivered the Khutba before the prayer.\"","reference":"Sahih al-Bukhari 956, Book 13, Hadith 8","grade":"","question #":"question #1","question":"What was the traditional order of events during the Eid prayers as practiced by the Prophet (ﷺ)?","id":"bukhari-13-9"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer the prayer of `Id-ul-Adha and `Id-ul-Fitr and then deliver the Khutba \nafter the prayer.","reference":"Sahih al-Bukhari 957, Book 13, Hadith 9","grade":"","question #":"question #1","question":"What is the sequence of events during the `Id-ul-Adha and `Id-ul-Fitr prayers as practiced by the Prophet Muhammad (ﷺ)?","id":"bukhari-13-10"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #1","question":"What is the sequence of events during the Eid prayer and sermon according to the practices of the Prophet Muhammad (ﷺ)?","id":"bukhari-13-11"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #1","question":"What is the sequence of events during the `Id prayer as practiced by the Prophet Muhammad (ﷺ)?","id":"bukhari-13-12"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #1","question":"What is the sequence of events during the `Id prayer as practiced by the Prophet (ﷺ)?","id":"bukhari-13-13"},{"hadith-eng":"I offered the `Id prayer with Allah's Messenger (ﷺ), Abu Bakr, `Umar and `Uthman and all of them offered \nthe prayer before delivering the Khutba.","reference":"Sahih al-Bukhari 962, Book 13, Hadith 11","grade":"","question #":"question #1","question":"What is the sequence of the `Id prayer and Khutba as practiced by the Prophet Muhammad (ﷺ) and his companions?","id":"bukhari-13-14"},{"hadith-eng":"Allah's Messenger (ﷺ), Abu Bakr and `Umar! used to offer the two `Id prayers before delivering the Khutba.","reference":"Sahih al-Bukhari 963, Book 13, Hadith 12","grade":"","question #":"question #1","question":"What was the practice of the Prophet Muhammad (ﷺ) and his companions regarding the sequence of the `Id prayers and the Khutba?","id":"bukhari-13-15"},{"hadith-eng":"The Prophet (ﷺ) offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. \nThen he went towards women along with Bilal and ordered them to pay alms and so they started \ngiving their earrings and necklaces (in charity).","reference":"Sahih al-Bukhari 964, Book 13, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of performing a two rak`at prayer on the Day of Id ul Fitr?","id":"bukhari-13-16"},{"hadith-eng":"The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then \nreturn to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), \nand whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his \nfamily and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin \nNiyyar said, \"O Allah's Messenger (ﷺ)! I slaughtered the Nusuk (before the prayer) but I have a young shegoat \nwhich is better than an older sheep.\" The Prophet (ﷺ) I said, \"Sacrifice it in lieu of the first, but it will \nbe not sufficient (as a sacrifice) for anybody else after you.\"","reference":"Sahih al-Bukhari 965, Book 13, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of performing the prayer before slaughtering the sacrifice on a specific day?","id":"bukhari-13-17"},{"hadith-eng":"I was with Ibn `Umar when a spear head pierced the sole of his foot and his foot stuck to the paddle \nof the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the \nnews and came to inquire about his health and said, \"Alas! If we could only know the man who \nwounded you!\" Ibn `Umar said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" \nIbn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry \nthem and you allowed arms to be carried in the Haram even though it was not allowed before.\"","reference":"Sahih al-Bukhari 966, Book 13, Hadith 15","grade":"","question #":"question #1","question":"What are the implications of carrying arms in the Haram according to Islamic teachings?","id":"bukhari-13-18"},{"hadith-eng":"Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" \nIbn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The \nperson who allowed arms to be carried on the day on which it was forbidden to carry them (he meant \nAl-Hajjaj).\"","reference":"Sahih al-Bukhari 967, Book 13, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of adhering to rules and prohibitions in Islam, especially regarding carrying arms?","id":"bukhari-13-19"},{"hadith-eng":"The Prophet (ﷺ) delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we \nshould do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who \ndoes so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just \nmeat that he offered to his family and would not be considered as a sacrifice in any way. My uncle \nAbu Burda bin Niyyar got up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the \nprayer but I have a young she-goat which is better than an older sheep.\" The Prophet (ﷺ) said, \"Slaughter \nit in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"","reference":"Sahih al-Bukhari 968, Book 13, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of performing the prayer before slaughtering the sacrifice on Eid-ul-Adha?","id":"bukhari-13-20"},{"hadith-eng":"The Prophet (ﷺ) said, \"No good deeds done on other days are superior to those done on these (first ten \ndays of Dhul Hijja).\" Then some companions of the Prophet (ﷺ) said, \"Not even Jihad?\" He replied, \"Not \neven Jihad, except that of a man who does it by putting himself and his property in danger (for Allah's \nsake) and does not return with any of those things.\"","reference":"Sahih al-Bukhari 969, Book 13, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of the first ten days of Dhul Hijja in Islam?","id":"bukhari-13-21"},{"hadith-eng":"While we were going from Mina to `Arafat, I asked Anas bin Malik, about Talbiya, \"How did you use \nto say Talbiya in the company of the Prophet?\" Anas said: \"People used to say Talbiya and their \nsaying was not objected to and they used to say Takbir and that was not objected to either. \"","reference":"Sahih al-Bukhari 970, Book 13, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of Talbiya during the pilgrimage to Arafat?","id":"bukhari-13-22"},{"hadith-eng":"We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their \nhouses and menstruating women so that they might stand behind the men and say Takbir along with \nthem and invoke Allah along with them and hope for the blessings of that day and for purification \nfrom sins.","reference":"Sahih al-Bukhari 971, Book 13, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of women participating in the Eid prayer and celebrations?","id":"bukhari-13-23"},{"hadith-eng":"On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of the Prophet (as a Sutra for the prayer) and then he would pray.","reference":"Sahih al-Bukhari 972, Book 13, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of using a sutra during prayer in Islam?","id":"bukhari-13-24"},{"hadith-eng":"The Prophet (ﷺ) used to proceed to the Musalla and an 'Anaza used to be carried before him and planted \nin the Musalla in front of him and he would pray facing it (as a Sutra).","reference":"Sahih al-Bukhari 973, Book 13, Hadith 22","grade":"","question #":"question #1","question":"What is the significance of using a Sutra during prayer in Islam?","id":"bukhari-13-25"},{"hadith-eng":"Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the \nvirgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls \nor virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"","reference":"Sahih al-Bukhari 974, Book 13, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of women, including mature girls and virgins, attending the Eid prayer gathering?","id":"bukhari-13-26"},{"hadith-eng":"I (in my boyhood) went out with the Prophet (ﷺ) on the day of `Id ul Fitr or Id-ul-Adha. The Prophet (ﷺ) \nprayed and then delivered the Khutba and then went towards the women, preached and advised them \nand ordered them to give alms.","reference":"Sahih al-Bukhari 975, Book 13, Hadith 24","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take on the day of Eid according to this narration?","id":"bukhari-13-27"},{"hadith-eng":"The Prophet (ﷺ) went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a \ntwo-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of \nworship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does \nthis concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) \nthen that was a thing which he prepared earlier for his family and it would not be considered as a \nNusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered (the animal before the \nprayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (p.b.u.h) said to \nhim, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"","reference":"Sahih al-Bukhari 976, Book 13, Hadith 25","grade":"","question #":"question #1","question":"What is the significance of performing the Eid prayer before slaughtering the sacrifice on Eid-ul-Adha?","id":"bukhari-13-28"},{"hadith-eng":"Ibn `Abbas was asked whether he had joined the Prophet (ﷺ) in the `Id prayer. He said, \"Yes. And I could \nnot have joined him had I not been young. (The Prophet (ﷺ) came out) till he reached the mark which was \nnear the house of Kathir bin As-Salt, offered the prayer, delivered the Khutba and then went towards \nthe women. Bilal was accompanying him. He preached to them and advised them and ordered them to \ngive alms. I saw the women putting their ornaments with their outstretched hands into Bilal's garment. \nThen the Prophet (ﷺ) along with Bilal returned home.","reference":"Sahih al-Bukhari 977, Book 13, Hadith 26","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take during the `Id prayer according to this narration?","id":"bukhari-13-29"},{"hadith-eng":"`Ata' told me that he had heard Jabir bin `Abdullah saying, \"The Prophet (ﷺ) stood up to offer the prayer of the `Id ul Fitr. He first offered the prayer and then delivered the Khutba. After finishing it he got down (from the pulpit) and went towards the women and advised them while he was leaning on Bilal's hand. Bilal was spreading out his garment where the women were putting their alms.\" I asked `Ata' whether it was the Zakat of `Id ul Fitr. He said, \"No, it was just alms given at that time. Some lady put her finger ring and the others would do the same.\" I said, (to `Ata'), \"Do you think that it is incumbent upon the Imam to give advice to the women (on `Id day)?\" He said, \"No doubt, it is incumbent upon the Imams to do so and why should they not do so?\"","reference":"Sahih al-Bukhari 978, Book 13, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of delivering a Khutba after the `Id prayer?","id":"bukhari-13-30"},{"hadith-eng":"'O Prophet! When the believing women come to you to take the oath of fealty to you . . . (to the end of the verse) (60.12).' After finishing the recitation he said, \"O ladies! Are you fulfilling your covenant?\" None except one woman said, \"Yes.\" Hasan did not know who was that woman. The Prophet (ﷺ) said, \"Then give alms.\" Bilal spread his garment and said, \"Keep on giving alms. Let my father and mother sacrifice their lives for you (ladies).\" So the ladies kept on putting their Fatkhs (big rings) and other kinds of rings in Bilal's garment.\" `Abdur-Razaq said, \" 'Fatkhs' is a big ring which used to be worn in the (Pre-Islamic) period of ignorance.","reference":"Sahih al-Bukhari 979, Book 13, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of delivering the Khutba after the `Id prayer in Islamic tradition?","id":"bukhari-13-31"},{"hadith-eng":"Hafsa bint Seereen said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and \nstayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in \ntwelve holy battles along with the Prophet (ﷺ) and my sister was with her husband in six of them. My \nsister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Messenger (ﷺ)! \nIf a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet (ﷺ) said, \n'Her companion should let her share her veil with her, and the women should participate in the good \ndeeds and in the religious gatherings of the believers.' \" Hafsa added, \"When Um-`Atiya came, I went \nto her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be \nsacrificed for the Prophet (p.b.u.h). (And whenever she mentioned the name of the Prophet (ﷺ) she always \nused to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened \n(or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and \nmenstruating women should come out (on the `Id day). But the menstruating women should keep \naway from the Musalla. And all the women should participate in the good deeds and in the religious \ngatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya, 'Also those who are \nmenstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".","reference":"Sahih al-Bukhari 980, Book 13, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of women participating in religious gatherings and good deeds during `Id?","id":"bukhari-13-32"},{"hadith-eng":"We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature \ngirls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The \nmenstruating women could present themselves at the religious gathering and invocation of Muslims \nbut should keep away from their Musalla.","reference":"Sahih al-Bukhari 981, Book 13, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of including women, including those menstruating, in the Eid gatherings?","id":"bukhari-13-33"},{"hadith-eng":"The Prophet (p.b.u.h) used to Nahr or slaughter sacrifices at the Musalla (on `Id-ul-Adha).","reference":"Sahih al-Bukhari 982, Book 13, Hadith 31","grade":"","question #":"question #1","question":"Where did the Prophet Muhammad (p.b.u.h) perform the act of slaughtering sacrifices during `Id-ul-Adha?","id":"bukhari-13-34"},{"hadith-eng":"On the day of Nahr Allah's Messenger (ﷺ) delivered the Khutba after the `Id prayer and said, \"Anyone who \nprayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) \ntradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just \nmutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Messenger (ﷺ)! By Allah, I \nslaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating \nand drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my \nfamily and neighbors.\" Allah's Messenger (ﷺ) said, \"That was just mutton (not a sacrifice).\" Then Abu Burda \nsaid, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a \nsacrifice for me?\" The Prophet (ﷺ) replied, \"Yes. But it will not be sufficient for anyone else (as a \nsacrifice), after you.\"","reference":"Sahih al-Bukhari 983, Book 13, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of performing the Eid prayer before the act of sacrifice in Islamic tradition?","id":"bukhari-13-35"},{"hadith-eng":"Allah's Messenger (ﷺ) offered the prayer on the day of Nahr and then delivered the Khutba and ordered that \nwhoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter \nanother sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Messenger (ﷺ)! because of my \nneighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a \nyoung she-goat which, in my opinion, is better than two sheep.\" The Prophet (ﷺ) gave him the permission \nfor slaughtering it as a sacrifice.","reference":"Sahih al-Bukhari 984, Book 13, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of performing the sacrifice after the prayer on the day of Nahr?","id":"bukhari-13-36"},{"hadith-eng":"On the day of Nahr the Prophet (ﷺ) offered the prayer and delivered the Khutba and then slaughtered the \nsacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter \nanother animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice \nmentioning Allah's name on it.\"","reference":"Sahih al-Bukhari 985, Book 13, Hadith 34","grade":"","question #":"question #1","question":"What is the significance of performing the prayer and delivering the Khutba before slaughtering the sacrifice on the day of Nahr?","id":"bukhari-13-37"},{"hadith-eng":"On the Day of `Id the Prophet (ﷺ) used to return (after offering the `Id prayer) through a way different \nfrom that by which he went.","reference":"Sahih al-Bukhari 986, Book 13, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of taking different routes when returning from the `Id prayer?","id":"bukhari-13-38"},{"hadith-eng":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","reference":"Sahih al-Bukhari 987, 988, Book 13, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of allowing cultural expressions and celebrations during the days of Eid in Islam?","id":"bukhari-13-39"},{"hadith-eng":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","reference":"Sahih al-Bukhari 987, 988, Book 13, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of allowing cultural expressions during the days of Eid in Islam?","id":"bukhari-13-40"},{"hadith-eng":"The Prophet (ﷺ) went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any \nother prayer before or after it and at that time Bilal was accompanying him.","reference":"Sahih al-Bukhari 989, Book 13, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of performing a two rak`at prayer on the Day of `Id ul Fitr?","id":"bukhari-13-41"},{"hadith-eng":"`Umar bought a silk cloak from the market, took it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! \nTake it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Messenger (ﷺ) \n(p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period \nAllah's Messenger (ﷺ) (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Messenger (ﷺ) \n(p.b.u.h) with the cloak and said, \"O Allah's Messenger (ﷺ)! You said that this dress was for those who had \nno share (in the Hereafter); yet you have sent me this cloak.\" Allah's Messenger (ﷺ) said to him, \"Sell it and \nfulfill your needs by it.\"","reference":"Sahih al-Bukhari 948, Book 13, Hadith 1","grade":"","question #":"question #2","question":"How can one utilize material possessions in a way that aligns with Islamic teachings?","id":"bukhari-13-42"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.","reference":"Sahih al-Bukhari 949, 950, Book 13, Hadith 2","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (p.b.u.h) demonstrate tolerance and understanding in social settings according to this account?","id":"bukhari-13-43"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.","reference":"Sahih al-Bukhari 949, 950, Book 13, Hadith 2","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (p.b.u.h) demonstrate his attitude towards cultural expressions and celebrations in this account?","id":"bukhari-13-44"},{"hadith-eng":"I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first \nday of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the \nname of Allah) and whoever does so, he acted according to our Sunna (traditions).\"","reference":"Sahih al-Bukhari 951, Book 13, Hadith 3","grade":"","question #":"question #2","question":"How does following the sequence of prayer and sacrifice align with the Sunnah of the Prophet?","id":"bukhari-13-45"},{"hadith-eng":"Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the \nAnsar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical \ninstruments of Satan in the house of Allah's Messenger (ﷺ) !\" It happened on the `Id day and Allah's Messenger (ﷺ) \nsaid, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"","reference":"Sahih al-Bukhari 952, Book 13, Hadith 4","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to Abu Bakr's concern about musical instruments during Eid?","id":"bukhari-13-46"},{"hadith-eng":"Allah's Messenger (ﷺ) never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some \ndates. Anas also narrated: The Prophet (ﷺ) used to eat odd number of dates.","reference":"Sahih al-Bukhari 953, Book 13, Hadith 5","grade":"","question #":"question #2","question":"Why might the Prophet (ﷺ) have preferred eating an odd number of dates?","id":"bukhari-13-47"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" \nA man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned \nsomething about his neighbors. It seemed that the Prophet (ﷺ) I believed him. Then the same man added, \n\"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet (ﷺ) permitted \nhim to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for \nothers as well.","reference":"Sahih al-Bukhari 954, Book 13, Hadith 6","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate flexibility and understanding in specific situations regarding religious practices?","id":"bukhari-13-48"},{"hadith-eng":"The Prophet (ﷺ) delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever \noffers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. \nAnd whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi \nBurda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Messenger (ﷺ)! I have slaughtered my sheep before \nthe `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked \nthat my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my \nfood before coming for the prayer.\" The Prophet (ﷺ) said, \"The sheep which you have slaughtered is just \nmutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Messenger (ﷺ)! I have a young she-goat which is \ndearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) \nsaid, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after \nyou.\"","reference":"Sahih al-Bukhari 955, Book 13, Hadith 7","grade":"","question #":"question #2","question":"Why is the timing of the sacrifice important in Islamic rituals?","id":"bukhari-13-49"},{"hadith-eng":"The Prophet (ﷺ) used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to \nbegin with was the prayer and after that he would stand in front of the people and the people would \nkeep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. \nKhutba). And after that if he wished to send an army for an expedition, he would do so; or if he \nwanted to give and order, he would do so, and then depart. The people followed this tradition till I \nwent out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. \nWhen we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get \nup on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit \nand delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's \ntradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know \nis better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the \nprayer, so I delivered the Khutba before the prayer.\"","reference":"Sahih al-Bukhari 956, Book 13, Hadith 8","grade":"","question #":"question #2","question":"How did Marwan's actions differ from the Prophet's tradition during the Eid prayer?","id":"bukhari-13-50"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer the prayer of `Id-ul-Adha and `Id-ul-Fitr and then deliver the Khutba \nafter the prayer.","reference":"Sahih al-Bukhari 957, Book 13, Hadith 9","grade":"","question #":"question #2","question":"What is the significance of delivering a Khutba after the `Id prayers in Islamic tradition?","id":"bukhari-13-51"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #2","question":"What was the role of Bilal during the Prophet's sermon to the women after the Eid prayer?","id":"bukhari-13-52"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #2","question":"What was the role of Bilal during the Prophet's address to the women after the `Id prayer?","id":"bukhari-13-53"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #2","question":"What was the role of Bilal during the Prophet's (ﷺ) address to the women after the `Id prayer?","id":"bukhari-13-54"},{"hadith-eng":"I offered the `Id prayer with Allah's Messenger (ﷺ), Abu Bakr, `Umar and `Uthman and all of them offered \nthe prayer before delivering the Khutba.","reference":"Sahih al-Bukhari 962, Book 13, Hadith 11","grade":"","question #":"question #2","question":"Who were the companions of the Prophet Muhammad (ﷺ) mentioned in the context of the `Id prayer?","id":"bukhari-13-55"},{"hadith-eng":"Allah's Messenger (ﷺ), Abu Bakr and `Umar! used to offer the two `Id prayers before delivering the Khutba.","reference":"Sahih al-Bukhari 963, Book 13, Hadith 12","grade":"","question #":"question #2","question":"How did the early Muslim leaders conduct the `Id prayers in terms of timing and order?","id":"bukhari-13-56"},{"hadith-eng":"The Prophet (ﷺ) offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. \nThen he went towards women along with Bilal and ordered them to pay alms and so they started \ngiving their earrings and necklaces (in charity).","reference":"Sahih al-Bukhari 964, Book 13, Hadith 13","grade":"","question #":"question #2","question":"What actions did the Prophet (ﷺ) take to encourage charity among women after the Id ul Fitr prayer?","id":"bukhari-13-57"},{"hadith-eng":"The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then \nreturn to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), \nand whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his \nfamily and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin \nNiyyar said, \"O Allah's Messenger (ﷺ)! I slaughtered the Nusuk (before the prayer) but I have a young shegoat \nwhich is better than an older sheep.\" The Prophet (ﷺ) I said, \"Sacrifice it in lieu of the first, but it will \nbe not sufficient (as a sacrifice) for anybody else after you.\"","reference":"Sahih al-Bukhari 965, Book 13, Hadith 14","grade":"","question #":"question #2","question":"How does the timing of the sacrifice affect its validity in Islamic tradition?","id":"bukhari-13-58"},{"hadith-eng":"I was with Ibn `Umar when a spear head pierced the sole of his foot and his foot stuck to the paddle \nof the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the \nnews and came to inquire about his health and said, \"Alas! If we could only know the man who \nwounded you!\" Ibn `Umar said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" \nIbn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry \nthem and you allowed arms to be carried in the Haram even though it was not allowed before.\"","reference":"Sahih al-Bukhari 966, Book 13, Hadith 15","grade":"","question #":"question #2","question":"How did Ibn `Umar respond to being injured and what does it reveal about his perspective on responsibility?","id":"bukhari-13-59"},{"hadith-eng":"Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" \nIbn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The \nperson who allowed arms to be carried on the day on which it was forbidden to carry them (he meant \nAl-Hajjaj).\"","reference":"Sahih al-Bukhari 967, Book 13, Hadith 16","grade":"","question #":"question #2","question":"How does the response of Ibn `Umar reflect the importance of accountability and responsibility in Islamic teachings?","id":"bukhari-13-60"},{"hadith-eng":"The Prophet (ﷺ) delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we \nshould do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who \ndoes so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just \nmeat that he offered to his family and would not be considered as a sacrifice in any way. My uncle \nAbu Burda bin Niyyar got up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the \nprayer but I have a young she-goat which is better than an older sheep.\" The Prophet (ﷺ) said, \"Slaughter \nit in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"","reference":"Sahih al-Bukhari 968, Book 13, Hadith 17","grade":"","question #":"question #2","question":"How does the timing of the sacrifice affect its validity according to Islamic teachings?","id":"bukhari-13-61"},{"hadith-eng":"The Prophet (ﷺ) said, \"No good deeds done on other days are superior to those done on these (first ten \ndays of Dhul Hijja).\" Then some companions of the Prophet (ﷺ) said, \"Not even Jihad?\" He replied, \"Not \neven Jihad, except that of a man who does it by putting himself and his property in danger (for Allah's \nsake) and does not return with any of those things.\"","reference":"Sahih al-Bukhari 969, Book 13, Hadith 18","grade":"","question #":"question #2","question":"How do the good deeds performed during the first ten days of Dhul Hijja compare to other acts of worship?","id":"bukhari-13-62"},{"hadith-eng":"While we were going from Mina to `Arafat, I asked Anas bin Malik, about Talbiya, \"How did you use \nto say Talbiya in the company of the Prophet?\" Anas said: \"People used to say Talbiya and their \nsaying was not objected to and they used to say Takbir and that was not objected to either. \"","reference":"Sahih al-Bukhari 970, Book 13, Hadith 19","grade":"","question #":"question #2","question":"How did the companions of the Prophet express their devotion during the pilgrimage?","id":"bukhari-13-63"},{"hadith-eng":"We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their \nhouses and menstruating women so that they might stand behind the men and say Takbir along with \nthem and invoke Allah along with them and hope for the blessings of that day and for purification \nfrom sins.","reference":"Sahih al-Bukhari 971, Book 13, Hadith 20","grade":"","question #":"question #2","question":"How does the inclusion of menstruating women in Eid gatherings reflect on community practices?","id":"bukhari-13-64"},{"hadith-eng":"On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of the Prophet (as a Sutra for the prayer) and then he would pray.","reference":"Sahih al-Bukhari 972, Book 13, Hadith 21","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) perform prayers on the days of `Id-ul-Fitr and `Id-ul-Adha?","id":"bukhari-13-65"},{"hadith-eng":"The Prophet (ﷺ) used to proceed to the Musalla and an 'Anaza used to be carried before him and planted \nin the Musalla in front of him and he would pray facing it (as a Sutra).","reference":"Sahih al-Bukhari 973, Book 13, Hadith 22","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the use of a Sutra in his prayers?","id":"bukhari-13-66"},{"hadith-eng":"Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the \nvirgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls \nor virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"","reference":"Sahih al-Bukhari 974, Book 13, Hadith 23","grade":"","question #":"question #2","question":"How are menstruating women instructed to participate in Eid celebrations according to Islamic teachings?","id":"bukhari-13-67"},{"hadith-eng":"I (in my boyhood) went out with the Prophet (ﷺ) on the day of `Id ul Fitr or Id-ul-Adha. The Prophet (ﷺ) \nprayed and then delivered the Khutba and then went towards the women, preached and advised them \nand ordered them to give alms.","reference":"Sahih al-Bukhari 975, Book 13, Hadith 24","grade":"","question #":"question #2","question":"What is the significance of delivering a Khutba after the Eid prayer?","id":"bukhari-13-68"},{"hadith-eng":"The Prophet (ﷺ) went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a \ntwo-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of \nworship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does \nthis concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) \nthen that was a thing which he prepared earlier for his family and it would not be considered as a \nNusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered (the animal before the \nprayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (p.b.u.h) said to \nhim, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"","reference":"Sahih al-Bukhari 976, Book 13, Hadith 25","grade":"","question #":"question #2","question":"How does the timing of the sacrifice relate to following the Sunnah on Eid-ul-Adha?","id":"bukhari-13-69"},{"hadith-eng":"Ibn `Abbas was asked whether he had joined the Prophet (ﷺ) in the `Id prayer. He said, \"Yes. And I could \nnot have joined him had I not been young. (The Prophet (ﷺ) came out) till he reached the mark which was \nnear the house of Kathir bin As-Salt, offered the prayer, delivered the Khutba and then went towards \nthe women. Bilal was accompanying him. He preached to them and advised them and ordered them to \ngive alms. I saw the women putting their ornaments with their outstretched hands into Bilal's garment. \nThen the Prophet (ﷺ) along with Bilal returned home.","reference":"Sahih al-Bukhari 977, Book 13, Hadith 26","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) engage with women after the `Id prayer in this account?","id":"bukhari-13-70"},{"hadith-eng":"`Ata' told me that he had heard Jabir bin `Abdullah saying, \"The Prophet (ﷺ) stood up to offer the prayer of the `Id ul Fitr. He first offered the prayer and then delivered the Khutba. After finishing it he got down (from the pulpit) and went towards the women and advised them while he was leaning on Bilal's hand. Bilal was spreading out his garment where the women were putting their alms.\" I asked `Ata' whether it was the Zakat of `Id ul Fitr. He said, \"No, it was just alms given at that time. Some lady put her finger ring and the others would do the same.\" I said, (to `Ata'), \"Do you think that it is incumbent upon the Imam to give advice to the women (on `Id day)?\" He said, \"No doubt, it is incumbent upon the Imams to do so and why should they not do so?\"","reference":"Sahih al-Bukhari 978, Book 13, Hadith 27","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) engage with women after the `Id prayer, and what was the purpose of this interaction?","id":"bukhari-13-71"},{"hadith-eng":"'O Prophet! When the believing women come to you to take the oath of fealty to you . . . (to the end of the verse) (60.12).' After finishing the recitation he said, \"O ladies! Are you fulfilling your covenant?\" None except one woman said, \"Yes.\" Hasan did not know who was that woman. The Prophet (ﷺ) said, \"Then give alms.\" Bilal spread his garment and said, \"Keep on giving alms. Let my father and mother sacrifice their lives for you (ladies).\" So the ladies kept on putting their Fatkhs (big rings) and other kinds of rings in Bilal's garment.\" `Abdur-Razaq said, \" 'Fatkhs' is a big ring which used to be worn in the (Pre-Islamic) period of ignorance.","reference":"Sahih al-Bukhari 979, Book 13, Hadith 28","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) engage with women during the `Id prayer according to this narration?","id":"bukhari-13-72"},{"hadith-eng":"Hafsa bint Seereen said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and \nstayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in \ntwelve holy battles along with the Prophet (ﷺ) and my sister was with her husband in six of them. My \nsister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Messenger (ﷺ)! \nIf a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet (ﷺ) said, \n'Her companion should let her share her veil with her, and the women should participate in the good \ndeeds and in the religious gatherings of the believers.' \" Hafsa added, \"When Um-`Atiya came, I went \nto her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be \nsacrificed for the Prophet (p.b.u.h). (And whenever she mentioned the name of the Prophet (ﷺ) she always \nused to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened \n(or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and \nmenstruating women should come out (on the `Id day). But the menstruating women should keep \naway from the Musalla. And all the women should participate in the good deeds and in the religious \ngatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya, 'Also those who are \nmenstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".","reference":"Sahih al-Bukhari 980, Book 13, Hadith 29","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the issue of women without veils attending `Id prayers?","id":"bukhari-13-73"},{"hadith-eng":"We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature \ngirls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The \nmenstruating women could present themselves at the religious gathering and invocation of Muslims \nbut should keep away from their Musalla.","reference":"Sahih al-Bukhari 981, Book 13, Hadith 30","grade":"","question #":"question #2","question":"How should menstruating women participate in religious gatherings during Eid according to Islamic teachings?","id":"bukhari-13-74"},{"hadith-eng":"The Prophet (p.b.u.h) used to Nahr or slaughter sacrifices at the Musalla (on `Id-ul-Adha).","reference":"Sahih al-Bukhari 982, Book 13, Hadith 31","grade":"","question #":"question #2","question":"What is the significance of performing sacrifices on `Id-ul-Adha in Islam?","id":"bukhari-13-75"},{"hadith-eng":"On the day of Nahr Allah's Messenger (ﷺ) delivered the Khutba after the `Id prayer and said, \"Anyone who \nprayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) \ntradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just \nmutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Messenger (ﷺ)! By Allah, I \nslaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating \nand drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my \nfamily and neighbors.\" Allah's Messenger (ﷺ) said, \"That was just mutton (not a sacrifice).\" Then Abu Burda \nsaid, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a \nsacrifice for me?\" The Prophet (ﷺ) replied, \"Yes. But it will not be sufficient for anyone else (as a \nsacrifice), after you.\"","reference":"Sahih al-Bukhari 983, Book 13, Hadith 32","grade":"","question #":"question #2","question":"How does the timing of the sacrifice affect its validity in Islamic rituals?","id":"bukhari-13-76"},{"hadith-eng":"Allah's Messenger (ﷺ) offered the prayer on the day of Nahr and then delivered the Khutba and ordered that \nwhoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter \nanother sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Messenger (ﷺ)! because of my \nneighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a \nyoung she-goat which, in my opinion, is better than two sheep.\" The Prophet (ﷺ) gave him the permission \nfor slaughtering it as a sacrifice.","reference":"Sahih al-Bukhari 984, Book 13, Hadith 33","grade":"","question #":"question #2","question":"How does the hadith illustrate the Prophet's (ﷺ) flexibility in accommodating individual circumstances?","id":"bukhari-13-77"},{"hadith-eng":"On the day of Nahr the Prophet (ﷺ) offered the prayer and delivered the Khutba and then slaughtered the \nsacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter \nanother animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice \nmentioning Allah's name on it.\"","reference":"Sahih al-Bukhari 985, Book 13, Hadith 34","grade":"","question #":"question #2","question":"What should a person do if they have slaughtered their sacrifice before the prescribed time on the day of Nahr?","id":"bukhari-13-78"},{"hadith-eng":"On the Day of `Id the Prophet (ﷺ) used to return (after offering the `Id prayer) through a way different \nfrom that by which he went.","reference":"Sahih al-Bukhari 986, Book 13, Hadith 35","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his practices on the day of `Id?","id":"bukhari-13-79"},{"hadith-eng":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","reference":"Sahih al-Bukhari 987, 988, Book 13, Hadith 36","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate tolerance and understanding towards cultural practices in this narration?","id":"bukhari-13-80"},{"hadith-eng":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","reference":"Sahih al-Bukhari 987, 988, Book 13, Hadith 36","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate tolerance and understanding in social gatherings?","id":"bukhari-13-81"},{"hadith-eng":"The Prophet (ﷺ) went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any \nother prayer before or after it and at that time Bilal was accompanying him.","reference":"Sahih al-Bukhari 989, Book 13, Hadith 37","grade":"","question #":"question #2","question":"Is there any additional prayer recommended before or after the `Id ul Fitr prayer?","id":"bukhari-13-82"},{"hadith-eng":"`Umar bought a silk cloak from the market, took it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! \nTake it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Messenger (ﷺ) \n(p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period \nAllah's Messenger (ﷺ) (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Messenger (ﷺ) \n(p.b.u.h) with the cloak and said, \"O Allah's Messenger (ﷺ)! You said that this dress was for those who had \nno share (in the Hereafter); yet you have sent me this cloak.\" Allah's Messenger (ﷺ) said to him, \"Sell it and \nfulfill your needs by it.\"","reference":"Sahih al-Bukhari 948, Book 13, Hadith 1","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the use of luxury items and their impact on one's spiritual life?","id":"bukhari-13-83"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.","reference":"Sahih al-Bukhari 949, 950, Book 13, Hadith 2","grade":"","question #":"question #3","question":"What role does cultural expression, such as playing with shields and spears, have in Islamic celebrations based on this narration?","id":"bukhari-13-84"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.","reference":"Sahih al-Bukhari 949, 950, Book 13, Hadith 2","grade":"","question #":"question #3","question":"What can be inferred about the role of women in social and cultural activities from this narration?","id":"bukhari-13-85"},{"hadith-eng":"I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first \nday of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the \nname of Allah) and whoever does so, he acted according to our Sunna (traditions).\"","reference":"Sahih al-Bukhari 951, Book 13, Hadith 3","grade":"","question #":"question #3","question":"What are the key practices to be observed on the first day of Eid ul Adha according to Islamic tradition?","id":"bukhari-13-86"},{"hadith-eng":"Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the \nAnsar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical \ninstruments of Satan in the house of Allah's Messenger (ﷺ) !\" It happened on the `Id day and Allah's Messenger (ﷺ) \nsaid, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"","reference":"Sahih al-Bukhari 952, Book 13, Hadith 4","grade":"","question #":"question #3","question":"What can be inferred about the cultural practices of the Ansar during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-13-87"},{"hadith-eng":"Allah's Messenger (ﷺ) never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some \ndates. Anas also narrated: The Prophet (ﷺ) used to eat odd number of dates.","reference":"Sahih al-Bukhari 953, Book 13, Hadith 5","grade":"","question #":"question #3","question":"What are some Sunnah practices to follow on the day of Eid-ul-Fitr?","id":"bukhari-13-88"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" \nA man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned \nsomething about his neighbors. It seemed that the Prophet (ﷺ) I believed him. Then the same man added, \n\"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet (ﷺ) permitted \nhim to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for \nothers as well.","reference":"Sahih al-Bukhari 954, Book 13, Hadith 6","grade":"","question #":"question #3","question":"What considerations might be taken into account when determining exceptions to general religious rules?","id":"bukhari-13-89"},{"hadith-eng":"The Prophet (ﷺ) delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever \noffers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. \nAnd whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi \nBurda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Messenger (ﷺ)! I have slaughtered my sheep before \nthe `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked \nthat my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my \nfood before coming for the prayer.\" The Prophet (ﷺ) said, \"The sheep which you have slaughtered is just \nmutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Messenger (ﷺ)! I have a young she-goat which is \ndearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) \nsaid, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after \nyou.\"","reference":"Sahih al-Bukhari 955, Book 13, Hadith 7","grade":"","question #":"question #3","question":"What exception did the Prophet Muhammad (ﷺ) make for Abu Burda regarding the sacrifice?","id":"bukhari-13-90"},{"hadith-eng":"The Prophet (ﷺ) used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to \nbegin with was the prayer and after that he would stand in front of the people and the people would \nkeep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. \nKhutba). And after that if he wished to send an army for an expedition, he would do so; or if he \nwanted to give and order, he would do so, and then depart. The people followed this tradition till I \nwent out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. \nWhen we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get \nup on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit \nand delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's \ntradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know \nis better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the \nprayer, so I delivered the Khutba before the prayer.\"","reference":"Sahih al-Bukhari 956, Book 13, Hadith 8","grade":"","question #":"question #3","question":"What reasons did Marwan give for changing the order of the Khutba and prayer during Eid?","id":"bukhari-13-91"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer the prayer of `Id-ul-Adha and `Id-ul-Fitr and then deliver the Khutba \nafter the prayer.","reference":"Sahih al-Bukhari 957, Book 13, Hadith 9","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) conduct the `Id prayers and what can be learned from his practice?","id":"bukhari-13-92"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #3","question":"Is it considered necessary for an Imam to address women after the Eid prayer and sermon, and what is the reasoning behind it?","id":"bukhari-13-93"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #3","question":"Is it considered necessary for an Imam to address women after the `Id prayer and Khutba, and what is the reasoning behind it?","id":"bukhari-13-94"},{"hadith-eng":"`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"","reference":"Sahih al-Bukhari 958, 959, 960, 961, Book 13, Hadith 10","grade":"","question #":"question #3","question":"Is it considered necessary for an Imam to address women after the `Id prayer and Khutba, and why?","id":"bukhari-13-95"},{"hadith-eng":"I offered the `Id prayer with Allah's Messenger (ﷺ), Abu Bakr, `Umar and `Uthman and all of them offered \nthe prayer before delivering the Khutba.","reference":"Sahih al-Bukhari 962, Book 13, Hadith 11","grade":"","question #":"question #3","question":"How did the practice of offering the `Id prayer differ from the regular Friday prayer in terms of the sequence of prayer and sermon?","id":"bukhari-13-96"},{"hadith-eng":"Allah's Messenger (ﷺ), Abu Bakr and `Umar! used to offer the two `Id prayers before delivering the Khutba.","reference":"Sahih al-Bukhari 963, Book 13, Hadith 12","grade":"","question #":"question #3","question":"What can be learned about the traditional order of `Id prayers and sermons from the actions of the Prophet and his companions?","id":"bukhari-13-97"},{"hadith-eng":"The Prophet (ﷺ) offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. \nThen he went towards women along with Bilal and ordered them to pay alms and so they started \ngiving their earrings and necklaces (in charity).","reference":"Sahih al-Bukhari 964, Book 13, Hadith 13","grade":"","question #":"question #3","question":"How did the women respond to the Prophet's (ﷺ) call for charity on the Day of Id ul Fitr?","id":"bukhari-13-98"},{"hadith-eng":"The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then \nreturn to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), \nand whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his \nfamily and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin \nNiyyar said, \"O Allah's Messenger (ﷺ)! I slaughtered the Nusuk (before the prayer) but I have a young shegoat \nwhich is better than an older sheep.\" The Prophet (ﷺ) I said, \"Sacrifice it in lieu of the first, but it will \nbe not sufficient (as a sacrifice) for anybody else after you.\"","reference":"Sahih al-Bukhari 965, Book 13, Hadith 14","grade":"","question #":"question #3","question":"What exception did the Prophet Muhammad (p.b.u.h) make for Abu Burda bin Niyyar regarding the sacrifice?","id":"bukhari-13-99"},{"hadith-eng":"I was with Ibn `Umar when a spear head pierced the sole of his foot and his foot stuck to the paddle \nof the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the \nnews and came to inquire about his health and said, \"Alas! If we could only know the man who \nwounded you!\" Ibn `Umar said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" \nIbn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry \nthem and you allowed arms to be carried in the Haram even though it was not allowed before.\"","reference":"Sahih al-Bukhari 966, Book 13, Hadith 15","grade":"","question #":"question #3","question":"What can be learned about the historical context of carrying weapons during Hajj from this incident?","id":"bukhari-13-100"},{"hadith-eng":"Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" \nIbn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The \nperson who allowed arms to be carried on the day on which it was forbidden to carry them (he meant \nAl-Hajjaj).\"","reference":"Sahih al-Bukhari 967, Book 13, Hadith 16","grade":"","question #":"question #3","question":"What can be learned about the consequences of actions that go against Islamic guidelines from this interaction?","id":"bukhari-13-101"},{"hadith-eng":"The Prophet (ﷺ) delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we \nshould do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who \ndoes so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just \nmeat that he offered to his family and would not be considered as a sacrifice in any way. My uncle \nAbu Burda bin Niyyar got up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the \nprayer but I have a young she-goat which is better than an older sheep.\" The Prophet (ﷺ) said, \"Slaughter \nit in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"","reference":"Sahih al-Bukhari 968, Book 13, Hadith 17","grade":"","question #":"question #3","question":"What exception did the Prophet (ﷺ) make for Abu Burda bin Niyyar regarding the sacrifice, and what does it imply?","id":"bukhari-13-102"},{"hadith-eng":"The Prophet (ﷺ) said, \"No good deeds done on other days are superior to those done on these (first ten \ndays of Dhul Hijja).\" Then some companions of the Prophet (ﷺ) said, \"Not even Jihad?\" He replied, \"Not \neven Jihad, except that of a man who does it by putting himself and his property in danger (for Allah's \nsake) and does not return with any of those things.\"","reference":"Sahih al-Bukhari 969, Book 13, Hadith 18","grade":"","question #":"question #3","question":"What exception does the Prophet (ﷺ) make regarding the superiority of good deeds during the first ten days of Dhul Hijja?","id":"bukhari-13-103"},{"hadith-eng":"While we were going from Mina to `Arafat, I asked Anas bin Malik, about Talbiya, \"How did you use \nto say Talbiya in the company of the Prophet?\" Anas said: \"People used to say Talbiya and their \nsaying was not objected to and they used to say Takbir and that was not objected to either. \"","reference":"Sahih al-Bukhari 970, Book 13, Hadith 19","grade":"","question #":"question #3","question":"What is the role of Takbir in the rituals of Hajj according to the companions of the Prophet?","id":"bukhari-13-104"},{"hadith-eng":"We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their \nhouses and menstruating women so that they might stand behind the men and say Takbir along with \nthem and invoke Allah along with them and hope for the blessings of that day and for purification \nfrom sins.","reference":"Sahih al-Bukhari 971, Book 13, Hadith 20","grade":"","question #":"question #3","question":"What are the spiritual benefits associated with attending Eid prayers and celebrations?","id":"bukhari-13-105"},{"hadith-eng":"On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of the Prophet (as a Sutra for the prayer) and then he would pray.","reference":"Sahih al-Bukhari 972, Book 13, Hadith 21","grade":"","question #":"question #3","question":"What is the purpose of planting a spear in front of the prayer area during the Prophet's time?","id":"bukhari-13-106"},{"hadith-eng":"The Prophet (ﷺ) used to proceed to the Musalla and an 'Anaza used to be carried before him and planted \nin the Musalla in front of him and he would pray facing it (as a Sutra).","reference":"Sahih al-Bukhari 973, Book 13, Hadith 22","grade":"","question #":"question #3","question":"What is the purpose of carrying an 'Anaza to the Musalla for the Prophet's prayer?","id":"bukhari-13-107"},{"hadith-eng":"Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the \nvirgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls \nor virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"","reference":"Sahih al-Bukhari 974, Book 13, Hadith 23","grade":"","question #":"question #3","question":"What does this narration imply about the inclusivity of community events in Islam?","id":"bukhari-13-108"},{"hadith-eng":"I (in my boyhood) went out with the Prophet (ﷺ) on the day of `Id ul Fitr or Id-ul-Adha. The Prophet (ﷺ) \nprayed and then delivered the Khutba and then went towards the women, preached and advised them \nand ordered them to give alms.","reference":"Sahih al-Bukhari 975, Book 13, Hadith 24","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) address the women after the Eid prayer, and what did he advise them to do?","id":"bukhari-13-109"},{"hadith-eng":"The Prophet (ﷺ) went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a \ntwo-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of \nworship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does \nthis concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) \nthen that was a thing which he prepared earlier for his family and it would not be considered as a \nNusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered (the animal before the \nprayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (p.b.u.h) said to \nhim, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"","reference":"Sahih al-Bukhari 976, Book 13, Hadith 25","grade":"","question #":"question #3","question":"What exception did the Prophet (ﷺ) make regarding the sacrifice for the man who slaughtered before the prayer?","id":"bukhari-13-110"},{"hadith-eng":"Ibn `Abbas was asked whether he had joined the Prophet (ﷺ) in the `Id prayer. He said, \"Yes. And I could \nnot have joined him had I not been young. (The Prophet (ﷺ) came out) till he reached the mark which was \nnear the house of Kathir bin As-Salt, offered the prayer, delivered the Khutba and then went towards \nthe women. Bilal was accompanying him. He preached to them and advised them and ordered them to \ngive alms. I saw the women putting their ornaments with their outstretched hands into Bilal's garment. \nThen the Prophet (ﷺ) along with Bilal returned home.","reference":"Sahih al-Bukhari 977, Book 13, Hadith 26","grade":"","question #":"question #3","question":"What was the response of the women to the Prophet Muhammad's (ﷺ) advice on giving alms?","id":"bukhari-13-111"},{"hadith-eng":"`Ata' told me that he had heard Jabir bin `Abdullah saying, \"The Prophet (ﷺ) stood up to offer the prayer of the `Id ul Fitr. He first offered the prayer and then delivered the Khutba. After finishing it he got down (from the pulpit) and went towards the women and advised them while he was leaning on Bilal's hand. Bilal was spreading out his garment where the women were putting their alms.\" I asked `Ata' whether it was the Zakat of `Id ul Fitr. He said, \"No, it was just alms given at that time. Some lady put her finger ring and the others would do the same.\" I said, (to `Ata'), \"Do you think that it is incumbent upon the Imam to give advice to the women (on `Id day)?\" He said, \"No doubt, it is incumbent upon the Imams to do so and why should they not do so?\"","reference":"Sahih al-Bukhari 978, Book 13, Hadith 27","grade":"","question #":"question #3","question":"What role did Bilal play during the Prophet's (ﷺ) advice to the women, and how did the women respond?","id":"bukhari-13-112"},{"hadith-eng":"'O Prophet! When the believing women come to you to take the oath of fealty to you . . . (to the end of the verse) (60.12).' After finishing the recitation he said, \"O ladies! Are you fulfilling your covenant?\" None except one woman said, \"Yes.\" Hasan did not know who was that woman. The Prophet (ﷺ) said, \"Then give alms.\" Bilal spread his garment and said, \"Keep on giving alms. Let my father and mother sacrifice their lives for you (ladies).\" So the ladies kept on putting their Fatkhs (big rings) and other kinds of rings in Bilal's garment.\" `Abdur-Razaq said, \" 'Fatkhs' is a big ring which used to be worn in the (Pre-Islamic) period of ignorance.","reference":"Sahih al-Bukhari 979, Book 13, Hadith 28","grade":"","question #":"question #3","question":"What role did charity play in the interaction between the Prophet (ﷺ) and the women during the `Id prayer?","id":"bukhari-13-113"},{"hadith-eng":"Hafsa bint Seereen said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and \nstayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in \ntwelve holy battles along with the Prophet (ﷺ) and my sister was with her husband in six of them. My \nsister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Messenger (ﷺ)! \nIf a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet (ﷺ) said, \n'Her companion should let her share her veil with her, and the women should participate in the good \ndeeds and in the religious gatherings of the believers.' \" Hafsa added, \"When Um-`Atiya came, I went \nto her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be \nsacrificed for the Prophet (p.b.u.h). (And whenever she mentioned the name of the Prophet (ﷺ) she always \nused to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened \n(or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and \nmenstruating women should come out (on the `Id day). But the menstruating women should keep \naway from the Musalla. And all the women should participate in the good deeds and in the religious \ngatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya, 'Also those who are \nmenstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".","reference":"Sahih al-Bukhari 980, Book 13, Hadith 29","grade":"","question #":"question #3","question":"What guidance is given regarding the participation of menstruating women in `Id celebrations?","id":"bukhari-13-114"},{"hadith-eng":"We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature \ngirls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The \nmenstruating women could present themselves at the religious gathering and invocation of Muslims \nbut should keep away from their Musalla.","reference":"Sahih al-Bukhari 981, Book 13, Hadith 30","grade":"","question #":"question #3","question":"What are the guidelines for women in seclusion regarding attending Eid prayers and gatherings?","id":"bukhari-13-115"},{"hadith-eng":"The Prophet (p.b.u.h) used to Nahr or slaughter sacrifices at the Musalla (on `Id-ul-Adha).","reference":"Sahih al-Bukhari 982, Book 13, Hadith 31","grade":"","question #":"question #3","question":"What practices are associated with the celebration of `Id-ul-Adha according to Islamic tradition?","id":"bukhari-13-116"},{"hadith-eng":"On the day of Nahr Allah's Messenger (ﷺ) delivered the Khutba after the `Id prayer and said, \"Anyone who \nprayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) \ntradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just \nmutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Messenger (ﷺ)! By Allah, I \nslaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating \nand drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my \nfamily and neighbors.\" Allah's Messenger (ﷺ) said, \"That was just mutton (not a sacrifice).\" Then Abu Burda \nsaid, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a \nsacrifice for me?\" The Prophet (ﷺ) replied, \"Yes. But it will not be sufficient for anyone else (as a \nsacrifice), after you.\"","reference":"Sahih al-Bukhari 983, Book 13, Hadith 32","grade":"","question #":"question #3","question":"What exceptions, if any, are there in the rules of sacrifice during Eid according to the Prophet's guidance?","id":"bukhari-13-117"},{"hadith-eng":"Allah's Messenger (ﷺ) offered the prayer on the day of Nahr and then delivered the Khutba and ordered that \nwhoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter \nanother sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Messenger (ﷺ)! because of my \nneighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a \nyoung she-goat which, in my opinion, is better than two sheep.\" The Prophet (ﷺ) gave him the permission \nfor slaughtering it as a sacrifice.","reference":"Sahih al-Bukhari 984, Book 13, Hadith 33","grade":"","question #":"question #3","question":"What considerations should be taken into account when selecting an animal for sacrifice?","id":"bukhari-13-118"},{"hadith-eng":"On the day of Nahr the Prophet (ﷺ) offered the prayer and delivered the Khutba and then slaughtered the \nsacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter \nanother animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice \nmentioning Allah's name on it.\"","reference":"Sahih al-Bukhari 985, Book 13, Hadith 34","grade":"","question #":"question #3","question":"Why is it important to mention Allah's name when slaughtering the sacrifice?","id":"bukhari-13-119"},{"hadith-eng":"On the Day of `Id the Prophet (ﷺ) used to return (after offering the `Id prayer) through a way different \nfrom that by which he went.","reference":"Sahih al-Bukhari 986, Book 13, Hadith 35","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) actions regarding the `Id prayer journey?","id":"bukhari-13-120"},{"hadith-eng":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","reference":"Sahih al-Bukhari 987, 988, Book 13, Hadith 36","grade":"","question #":"question #3","question":"What lessons can be learned about the balance between religious observance and cultural activities from this event?","id":"bukhari-13-121"},{"hadith-eng":"On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"","reference":"Sahih al-Bukhari 987, 988, Book 13, Hadith 36","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's (ﷺ) response to Abu Bakr and `Umar regarding the celebration of Eid?","id":"bukhari-13-122"},{"hadith-eng":"The Prophet (ﷺ) went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any \nother prayer before or after it and at that time Bilal was accompanying him.","reference":"Sahih al-Bukhari 989, Book 13, Hadith 37","grade":"","question #":"question #3","question":"Who accompanied the Prophet during the `Id ul Fitr prayer according to the narration?","id":"bukhari-13-123"}]