[{"hadith-eng":"The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and \nstayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer \nperiod we used to offer the full prayer.","reference":"Sahih al-Bukhari 1080, Book 18, Hadith 1","grade":"","question #":"question #1","question":"What is the ruling on shortening prayers during travel according to Islamic teachings?","id":"bukhari-18-1"},{"hadith-eng":"I heard Anas saying, \"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for \nevery prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \n\"We stayed in Mecca for ten days.\"","reference":"Sahih al-Bukhari 1081, Book 18, Hadith 2","grade":"","question #":"question #1","question":"What is the ruling on shortening prayers during travel in Islam?","id":"bukhari-18-2"},{"hadith-eng":"I offered the prayer with the Prophet, Abu Bakr and `Umar at Mina and it was of two rak`at. `Uthman \nin the early days of his caliphate did the same, but later on he started praying the full prayer.","reference":"Sahih al-Bukhari 1082, Book 18, Hadith 3","grade":"","question #":"question #1","question":"How did the practice of shortening prayers during travel evolve among the early caliphs?","id":"bukhari-18-3"},{"hadith-eng":"The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.","reference":"Sahih al-Bukhari 1083, Book 18, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of performing two rak'ahs during the prayer at Mina?","id":"bukhari-18-4"},{"hadith-eng":"We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed \nabout it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I \nprayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr and with `Umar (during \ntheir caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by \nAllah).\"","reference":"Sahih al-Bukhari 1084, Book 18, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of performing two rak'at prayers at Mina according to the companions of the Prophet?","id":"bukhari-18-5"},{"hadith-eng":"The Prophet (ﷺ) and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya \n(O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. \nThe Prophet (ﷺ) ordered his companions to assume the lhram for Umra instead of Hajj, excepting those \nwho had Hadi (sacrifice) with them.","reference":"Sahih al-Bukhari 1085, Book 18, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of reciting Talbiya during Hajj?","id":"bukhari-18-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram \n(i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own \nhusband.)\"","reference":"Sahih al-Bukhari 1086, Book 18, Hadith 7","grade":"","question #":"question #1","question":"What are the guidelines for a woman's travel in Islam regarding the presence of a male guardian?","id":"bukhari-18-7"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram.\"","reference":"Sahih al-Bukhari 1087, Book 18, Hadith 8","grade":"","question #":"question #1","question":"What are the guidelines for a woman's travel in Islam regarding the presence of a Mahram?","id":"bukhari-18-8"},{"hadith-eng":"The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day \nto travel for one day and night except with a Mahram.\"","reference":"Sahih al-Bukhari 1088, Book 18, Hadith 9","grade":"","question #":"question #1","question":"What are the conditions under which a Muslim woman is allowed to travel according to Islamic teachings?","id":"bukhari-18-9"},{"hadith-eng":"offered four rak`at of Zuhr prayer with the Prophet (p.b.u.h) at Medina and two rak`at at Dhul-Hulaifa. \n(i.e. shortened the `Asr prayer).","reference":"Sahih al-Bukhari 1089, Book 18, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of shortening prayers during travel in Islam?","id":"bukhari-18-10"},{"hadith-eng":"\"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was \nkept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what \nmade Aisha pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman did.\"","reference":"Sahih al-Bukhari 1090, Book 18, Hadith 11","grade":"","question #":"question #1","question":"How did the number of rak`at in prayers change for travelers and non-travelers over time?","id":"bukhari-18-11"},{"hadith-eng":"\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"","reference":"Sahih al-Bukhari 1091, 1092, Book 18, Hadith 12","grade":"","question #":"question #1","question":"What is the ruling on combining Maghrib and Isha prayers during travel?","id":"bukhari-18-12"},{"hadith-eng":"\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"","reference":"Sahih al-Bukhari 1091, 1092, Book 18, Hadith 12","grade":"","question #":"question #1","question":"What is the ruling on combining Maghrib and Isha prayers during travel according to Islamic teachings?","id":"bukhari-18-13"},{"hadith-eng":"I saw the Prophet (p.b.u.h) offering the prayer on his mount (Rahila) whatever direction it took.","reference":"Sahih al-Bukhari 1093, Book 18, Hadith 13","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (p.b.u.h) perform prayers while traveling on a mount?","id":"bukhari-18-14"},{"hadith-eng":"The Prophet (ﷺ) used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.","reference":"Sahih al-Bukhari 1094, Book 18, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of facing the Qibla during prayer, and are there exceptions to this rule?","id":"bukhari-18-15"},{"hadith-eng":"Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said \nthat the Prophet (ﷺ) used to do so.","reference":"Sahih al-Bukhari 1095, Book 18, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of performing prayers while traveling in Islam?","id":"bukhari-18-16"},{"hadith-eng":"On traveling, `Abdullah bin `Umar used to offer the prayer on his Mount by signs whatever direction \nit took. `Abdullah said that the Prophet (ﷺ) used to do so.","reference":"Sahih al-Bukhari 1096, Book 18, Hadith 16","grade":"","question #":"question #1","question":"How did Abdullah bin Umar perform prayers while traveling?","id":"bukhari-18-17"},{"hadith-eng":"I saw the Prophet (ﷺ) on his Mount praying Nawafil by nodding his head, whatever direction he faced, but \nAllah's Messenger (ﷺ) never did the same in offering the compulsory prayers.","reference":"Sahih al-Bukhari 1097, Book 18, Hadith 17","grade":"","question #":"question #1","question":"How did the Prophet (ﷺ) perform Nawafil prayers while traveling on a mount?","id":"bukhari-18-18"},{"hadith-eng":"At night \n`Abdullah bin `Umar used to offer the prayer on the back of his animal during the journey and never \ncared about the direction he faced. Ibn `Umar said, \"Allah's Messenger (ﷺ) used to offer the optional prayer \non the back of his Mount facing any direction and also used to pray the witr on it but never offered the \ncompulsory prayer on it.\"","reference":"Sahih al-Bukhari 1098, Book 18, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of the direction faced during optional prayers while traveling?","id":"bukhari-18-19"},{"hadith-eng":"The Prophet (ﷺ) used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the \ncompulsory prayer, he used to dismount and face the Qibla.","reference":"Sahih al-Bukhari 1099, Book 18, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of facing the Qibla during compulsory prayers in Islam?","id":"bukhari-18-20"},{"hadith-eng":"We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- \nTamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the \nQibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" \nHe replied, \"If I had not seen Allah's Messenger (ﷺ) doing it, I would not have done it.\"","reference":"Sahih al-Bukhari 1100, Book 18, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of following the actions of the Prophet Muhammad (ﷺ) even if they differ from common practice?","id":"bukhari-18-21"},{"hadith-eng":"Ibn `Umar went on a journey and said, \"I accompanied the Prophet (ﷺ) and he did not offer optional \nprayers during the journey, and Allah says: 'Verily! In Allah's Messenger (ﷺ) you have a good example to \nfollow.' \" (33.21)","reference":"Sahih al-Bukhari 1101, Book 18, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of following the example of the Prophet Muhammad (ﷺ) during travel?","id":"bukhari-18-22"},{"hadith-eng":"I accompanied Allah's Messenger (ﷺ) and he never offered more than two rak`at during the journey. Abu \nBakr, `Umar and `Uthman used to do the same.","reference":"Sahih al-Bukhari 1102, Book 18, Hadith 22","grade":"","question #":"question #1","question":"What is the practice of offering prayers during travel according to the companions of the Prophet?","id":"bukhari-18-23"},{"hadith-eng":"Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). \nShe said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) took a bath in my house and offered eight \nrak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.","reference":"Sahih al-Bukhari 1103, Book 18, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of the Duha prayer in Islam?","id":"bukhari-18-24"},{"hadith-eng":"Narrated `Abdullah bin Amir that his father had told him that he had seen the Prophet (p.b.u.h) \npraying Nawafil at night on the back of his Mount on a journey, facing whatever direction it took.","reference":"Sahih al-Bukhari 1104, Book 18, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of performing Nawafil prayers during a journey?","id":"bukhari-18-25"},{"hadith-eng":"Ibn `Umar said, \"Allah's Messenger (ﷺ) used to pray the Nawafil on the back of his Mount (carriage) by \nsigns facing any direction.\" Ibn `Umar used to do the same.","reference":"Sahih al-Bukhari 1105, Book 18, Hadith 25","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) perform Nawafil prayers while traveling?","id":"bukhari-18-26"},{"hadith-eng":"The Prophet (ﷺ) used to offer the Maghrib and `Isha' prayers together whenever he was in a hurry on a journey.","reference":"Sahih al-Bukhari 1106, Book 18, Hadith 26","grade":"","question #":"question #1","question":"Under what circumstances is it permissible to combine Maghrib and Isha prayers?","id":"bukhari-18-27"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet (ﷺ) used to offer the Maghrib and the `Isha' prayers together on journeys.","reference":"Sahih al-Bukhari 1107, Book 18, Hadith 27","grade":"","question #":"question #1","question":"What is the ruling on combining prayers during travel in Islam?","id":"bukhari-18-28"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.","reference":"Sahih al-Bukhari 1108, Book 18, Hadith 28","grade":"","question #":"question #1","question":"What is the practice of combining prayers during travel in Islam?","id":"bukhari-18-29"},{"hadith-eng":"Salim told me, \"`Abdullah bin `Umar said, 'I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he \noffered it along with the `Isha prayer whenever he was in a hurry during the journey.' \" Salim said, \n\"Abdullah bin `Umar used to do the same whenever he was in a hurry during the journey. After \nmaking the call for Iqama, for the Maghrib prayer he used to offer three rak`at and then perform \nTaslim. After waiting for a short while, he would pronounce the Iqama for the `Isha' prayer and offer \ntwo rak`at and perform Taslim. He never prayed any Nawafil in between the two prayers or after the \n`Isha' prayers till he got up in the middle of the night (for Tahajjud prayer).\"","reference":"Sahih al-Bukhari 1109, Book 18, Hadith 29","grade":"","question #":"question #1","question":"What is the practice of combining Maghrib and Isha prayers during travel according to Islamic teachings?","id":"bukhari-18-30"},{"hadith-eng":"Whenever the Prophet (ﷺ) started a journey before noon, he used to delay the Zuhr prayer till the time of \n`Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer \nand then ride (for the journey).","reference":"Sahih al-Bukhari 1110, Book 18, Hadith 30","grade":"","question #":"question #1","question":"How did the Prophet (ﷺ) manage his prayer schedule when embarking on a journey before noon?","id":"bukhari-18-31"},{"hadith-eng":"Whenever the Prophet (ﷺ) started the journey before noon, he used to delay the Zuhr prayer till the time \nfor the `Asr prayer and then he would dismount and pray them together; and whenever the sun \ndeclined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).","reference":"Sahih al-Bukhari 1111, Book 18, Hadith 31","grade":"","question #":"question #1","question":"How did the Prophet (ﷺ) manage his prayer schedule during travel?","id":"bukhari-18-32"},{"hadith-eng":"Whenever the Prophet (ﷺ) started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).","reference":"Sahih al-Bukhari 1112, Book 18, Hadith 32","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) manage his prayer schedule when embarking on a journey?","id":"bukhari-18-33"},{"hadith-eng":"Allah's Messenger (ﷺ) prayed in his house while sitting during his illness and the people prayed behind him \nstanding and he pointed to them to sit down. When he had finished the prayer, he said, \"The Imam is \nto be followed and so when he bows you should bow; and when he lifts his head you should also do \nthe same.\"","reference":"Sahih al-Bukhari 1113, Book 18, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of following the Imam during prayer in Islam?","id":"bukhari-18-34"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) fell down from a horse and his right side was either injured or scratched, so \nwe went to inquire about his health. The time for the prayer became due and he offered the prayer \nwhile sitting and we prayed while standing. He said, \"The Imam is to be followed; so if he says \nTakbir, you should also say Takbir, and if he bows you should also bow; and when he lifts his head \nyou should also do the same and if he says: Sami`a l-lahu liman hamidah (Allah hears whoever sends \nhis praises to Him) you should say: Rabbana walakal-Hamd (O our Lord! All the praises are for \nYou.\") (See Hadith No. 656 Vol. 1).","reference":"Sahih al-Bukhari 1114, Book 18, Hadith 34","grade":"","question #":"question #1","question":"What should be done if the Imam is unable to stand during prayer due to injury or illness?","id":"bukhari-18-35"},{"hadith-eng":"(who had piles) I asked Allah's Messenger (ﷺ) about the praying of a man while sitting. He said, \"If he prays \nwhile standing it is better and he who prays while sitting gets half the reward of that who prays \nstanding; and whoever prays while Lying gets half the reward of that who prays while sitting.\"","reference":"Sahih al-Bukhari 1115, Book 18, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of praying while standing compared to sitting or lying down in terms of reward?","id":"bukhari-18-36"},{"hadith-eng":"`Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked \nthe Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray \nstanding; and whoever prays sitting gets half the reward of that who prays while standing; and \nwhoever prays while Lying gets half the reward of that who prays while sitting.' \"","reference":"Sahih al-Bukhari 1116, Book 18, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of praying while standing compared to sitting or lying down in terms of reward?","id":"bukhari-18-37"},{"hadith-eng":"had piles, so I asked the Prophet (ﷺ) about the prayer. He said, \"Pray while standing and if you can't, pray \nwhile sitting and if you cannot do even that, then pray Lying on your side.\"","reference":"Sahih al-Bukhari 1117, Book 18, Hadith 37","grade":"","question #":"question #1","question":"What are the different positions one can adopt during prayer if they are unable to stand?","id":"bukhari-18-38"},{"hadith-eng":"(the mother of the faithful believers) I never saw Allah's Messenger (ﷺ) offering the night prayer while \nsitting except in his old age and then he used to recite while sitting and whenever he wanted to bow he \nwould get up and recite thirty or forty verses (while standing) and then bow.","reference":"Sahih al-Bukhari 1118, Book 18, Hadith 38","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) adapt his night prayer routine as he aged?","id":"bukhari-18-39"},{"hadith-eng":"(the mother of the faithful believers) Allah's Messenger (ﷺ) (in his last days) used to pray sitting. He would \nrecite while sitting, and when thirty or forty verses remained from the recitation he would get up and \nrecite them while standing and then he would bow and prostrate. He used to do the same in the second \nrak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I \nwas asleep, he would lie down.","reference":"Sahih al-Bukhari 1119, Book 18, Hadith 39","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) adapt his prayer routine during his last days?","id":"bukhari-18-40"},{"hadith-eng":"The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and \nstayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer \nperiod we used to offer the full prayer.","reference":"Sahih al-Bukhari 1080, Book 18, Hadith 1","grade":"","question #":"question #2","question":"How long can a traveler shorten their prayers while staying in one place?","id":"bukhari-18-41"},{"hadith-eng":"I heard Anas saying, \"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for \nevery prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \n\"We stayed in Mecca for ten days.\"","reference":"Sahih al-Bukhari 1081, Book 18, Hadith 2","grade":"","question #":"question #2","question":"How long can a traveler shorten their prayers while staying in a different city?","id":"bukhari-18-42"},{"hadith-eng":"I offered the prayer with the Prophet, Abu Bakr and `Umar at Mina and it was of two rak`at. `Uthman \nin the early days of his caliphate did the same, but later on he started praying the full prayer.","reference":"Sahih al-Bukhari 1082, Book 18, Hadith 3","grade":"","question #":"question #2","question":"What is the significance of performing two rak'ahs during the prayer at Mina?","id":"bukhari-18-43"},{"hadith-eng":"The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.","reference":"Sahih al-Bukhari 1083, Book 18, Hadith 4","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) lead the prayer during the peace period at Mina?","id":"bukhari-18-44"},{"hadith-eng":"We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed \nabout it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I \nprayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr and with `Umar (during \ntheir caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by \nAllah).\"","reference":"Sahih al-Bukhari 1084, Book 18, Hadith 5","grade":"","question #":"question #2","question":"How did Abdullah bin Mas'ud react to the change in the number of rak'at prayed at Mina?","id":"bukhari-18-45"},{"hadith-eng":"The Prophet (ﷺ) and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya \n(O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. \nThe Prophet (ﷺ) ordered his companions to assume the lhram for Umra instead of Hajj, excepting those \nwho had Hadi (sacrifice) with them.","reference":"Sahih al-Bukhari 1085, Book 18, Hadith 6","grade":"","question #":"question #2","question":"What instructions did the Prophet give to his companions regarding the Ihram for Umra and Hajj?","id":"bukhari-18-46"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram \n(i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own \nhusband.)\"","reference":"Sahih al-Bukhari 1086, Book 18, Hadith 7","grade":"","question #":"question #2","question":"Why is the presence of a Dhi-Mahram important for a woman traveling for more than three days?","id":"bukhari-18-47"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram.\"","reference":"Sahih al-Bukhari 1087, Book 18, Hadith 8","grade":"","question #":"question #2","question":"How long can a woman travel without a Mahram according to Islamic teachings?","id":"bukhari-18-48"},{"hadith-eng":"The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day \nto travel for one day and night except with a Mahram.\"","reference":"Sahih al-Bukhari 1088, Book 18, Hadith 9","grade":"","question #":"question #2","question":"Who is considered a Mahram in the context of travel for Muslim women?","id":"bukhari-18-49"},{"hadith-eng":"offered four rak`at of Zuhr prayer with the Prophet (p.b.u.h) at Medina and two rak`at at Dhul-Hulaifa. \n(i.e. shortened the `Asr prayer).","reference":"Sahih al-Bukhari 1089, Book 18, Hadith 10","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (p.b.u.h) perform the Zuhr and Asr prayers while traveling?","id":"bukhari-18-50"},{"hadith-eng":"\"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was \nkept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what \nmade Aisha pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman did.\"","reference":"Sahih al-Bukhari 1090, Book 18, Hadith 11","grade":"","question #":"question #2","question":"What was Aisha's practice regarding prayer during travel, and how did it compare to Uthman's?","id":"bukhari-18-51"},{"hadith-eng":"\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"","reference":"Sahih al-Bukhari 1091, 1092, Book 18, Hadith 12","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) manage his prayer schedule when in a hurry during a journey?","id":"bukhari-18-52"},{"hadith-eng":"\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"","reference":"Sahih al-Bukhari 1091, 1092, Book 18, Hadith 12","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) manage his prayer schedule when he was in a hurry during a journey?","id":"bukhari-18-53"},{"hadith-eng":"I saw the Prophet (p.b.u.h) offering the prayer on his mount (Rahila) whatever direction it took.","reference":"Sahih al-Bukhari 1093, Book 18, Hadith 13","grade":"","question #":"question #2","question":"What is the significance of the direction faced during prayer when traveling?","id":"bukhari-18-54"},{"hadith-eng":"The Prophet (ﷺ) used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.","reference":"Sahih al-Bukhari 1094, Book 18, Hadith 14","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) perform Nawafil prayers while traveling?","id":"bukhari-18-55"},{"hadith-eng":"Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said \nthat the Prophet (ﷺ) used to do so.","reference":"Sahih al-Bukhari 1095, Book 18, Hadith 15","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform prayers during a journey?","id":"bukhari-18-56"},{"hadith-eng":"On traveling, `Abdullah bin `Umar used to offer the prayer on his Mount by signs whatever direction \nit took. `Abdullah said that the Prophet (ﷺ) used to do so.","reference":"Sahih al-Bukhari 1096, Book 18, Hadith 16","grade":"","question #":"question #2","question":"What is the significance of offering prayers by signs during travel?","id":"bukhari-18-57"},{"hadith-eng":"I saw the Prophet (ﷺ) on his Mount praying Nawafil by nodding his head, whatever direction he faced, but \nAllah's Messenger (ﷺ) never did the same in offering the compulsory prayers.","reference":"Sahih al-Bukhari 1097, Book 18, Hadith 17","grade":"","question #":"question #2","question":"What is the distinction between the Prophet's (ﷺ) approach to Nawafil and obligatory prayers during travel?","id":"bukhari-18-58"},{"hadith-eng":"At night \n`Abdullah bin `Umar used to offer the prayer on the back of his animal during the journey and never \ncared about the direction he faced. Ibn `Umar said, \"Allah's Messenger (ﷺ) used to offer the optional prayer \non the back of his Mount facing any direction and also used to pray the witr on it but never offered the \ncompulsory prayer on it.\"","reference":"Sahih al-Bukhari 1098, Book 18, Hadith 18","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform optional prayers during a journey?","id":"bukhari-18-59"},{"hadith-eng":"The Prophet (ﷺ) used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the \ncompulsory prayer, he used to dismount and face the Qibla.","reference":"Sahih al-Bukhari 1099, Book 18, Hadith 19","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) manage his prayers while traveling on a mount?","id":"bukhari-18-60"},{"hadith-eng":"We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- \nTamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the \nQibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" \nHe replied, \"If I had not seen Allah's Messenger (ﷺ) doing it, I would not have done it.\"","reference":"Sahih al-Bukhari 1100, Book 18, Hadith 20","grade":"","question #":"question #2","question":"In what circumstances is it permissible to pray in a direction other than the Qibla?","id":"bukhari-18-61"},{"hadith-eng":"Ibn `Umar went on a journey and said, \"I accompanied the Prophet (ﷺ) and he did not offer optional \nprayers during the journey, and Allah says: 'Verily! In Allah's Messenger (ﷺ) you have a good example to \nfollow.' \" (33.21)","reference":"Sahih al-Bukhari 1101, Book 18, Hadith 21","grade":"","question #":"question #2","question":"How does the practice of optional prayers change during a journey according to Islamic teachings?","id":"bukhari-18-62"},{"hadith-eng":"I accompanied Allah's Messenger (ﷺ) and he never offered more than two rak`at during the journey. Abu \nBakr, `Umar and `Uthman used to do the same.","reference":"Sahih al-Bukhari 1102, Book 18, Hadith 22","grade":"","question #":"question #2","question":"How many rak`at did the Prophet Muhammad (ﷺ) perform during a journey?","id":"bukhari-18-63"},{"hadith-eng":"Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). \nShe said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) took a bath in my house and offered eight \nrak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.","reference":"Sahih al-Bukhari 1103, Book 18, Hadith 23","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (p.b.u.h) perform his prayers during the conquest of Mecca?","id":"bukhari-18-64"},{"hadith-eng":"Narrated `Abdullah bin Amir that his father had told him that he had seen the Prophet (p.b.u.h) \npraying Nawafil at night on the back of his Mount on a journey, facing whatever direction it took.","reference":"Sahih al-Bukhari 1104, Book 18, Hadith 24","grade":"","question #":"question #2","question":"How does the direction of prayer affect the performance of Nawafil while traveling?","id":"bukhari-18-65"},{"hadith-eng":"Ibn `Umar said, \"Allah's Messenger (ﷺ) used to pray the Nawafil on the back of his Mount (carriage) by \nsigns facing any direction.\" Ibn `Umar used to do the same.","reference":"Sahih al-Bukhari 1105, Book 18, Hadith 25","grade":"","question #":"question #2","question":"What flexibility is allowed in the direction of prayer during travel according to Islamic teachings?","id":"bukhari-18-66"},{"hadith-eng":"The Prophet (ﷺ) used to offer the Maghrib and `Isha' prayers together whenever he was in a hurry on a journey.","reference":"Sahih al-Bukhari 1106, Book 18, Hadith 26","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) manage his prayer schedule during travel?","id":"bukhari-18-67"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet (ﷺ) used to offer the Maghrib and the `Isha' prayers together on journeys.","reference":"Sahih al-Bukhari 1107, Book 18, Hadith 27","grade":"","question #":"question #2","question":"Which prayers are commonly combined by the Prophet Muhammad (ﷺ) during journeys?","id":"bukhari-18-68"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.","reference":"Sahih al-Bukhari 1108, Book 18, Hadith 28","grade":"","question #":"question #2","question":"Which specific prayers are mentioned to be combined during a journey?","id":"bukhari-18-69"},{"hadith-eng":"Salim told me, \"`Abdullah bin `Umar said, 'I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he \noffered it along with the `Isha prayer whenever he was in a hurry during the journey.' \" Salim said, \n\"Abdullah bin `Umar used to do the same whenever he was in a hurry during the journey. After \nmaking the call for Iqama, for the Maghrib prayer he used to offer three rak`at and then perform \nTaslim. After waiting for a short while, he would pronounce the Iqama for the `Isha' prayer and offer \ntwo rak`at and perform Taslim. He never prayed any Nawafil in between the two prayers or after the \n`Isha' prayers till he got up in the middle of the night (for Tahajjud prayer).\"","reference":"Sahih al-Bukhari 1109, Book 18, Hadith 29","grade":"","question #":"question #2","question":"How did Abdullah bin Umar emulate the Prophet's actions regarding prayer during travel?","id":"bukhari-18-70"},{"hadith-eng":"Whenever the Prophet (ﷺ) started a journey before noon, he used to delay the Zuhr prayer till the time of \n`Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer \nand then ride (for the journey).","reference":"Sahih al-Bukhari 1110, Book 18, Hadith 30","grade":"","question #":"question #2","question":"What was the Prophet's (ﷺ) practice regarding the Zuhr and `Asr prayers when traveling?","id":"bukhari-18-71"},{"hadith-eng":"Whenever the Prophet (ﷺ) started the journey before noon, he used to delay the Zuhr prayer till the time \nfor the `Asr prayer and then he would dismount and pray them together; and whenever the sun \ndeclined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).","reference":"Sahih al-Bukhari 1111, Book 18, Hadith 31","grade":"","question #":"question #2","question":"What is the significance of combining prayers during a journey in Islam?","id":"bukhari-18-72"},{"hadith-eng":"Whenever the Prophet (ﷺ) started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).","reference":"Sahih al-Bukhari 1112, Book 18, Hadith 32","grade":"","question #":"question #2","question":"What is the significance of combining prayers during travel in Islamic practice?","id":"bukhari-18-73"},{"hadith-eng":"Allah's Messenger (ﷺ) prayed in his house while sitting during his illness and the people prayed behind him \nstanding and he pointed to them to sit down. When he had finished the prayer, he said, \"The Imam is \nto be followed and so when he bows you should bow; and when he lifts his head you should also do \nthe same.\"","reference":"Sahih al-Bukhari 1113, Book 18, Hadith 33","grade":"","question #":"question #2","question":"How should the congregation respond to the Imam's actions during prayer?","id":"bukhari-18-74"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) fell down from a horse and his right side was either injured or scratched, so \nwe went to inquire about his health. The time for the prayer became due and he offered the prayer \nwhile sitting and we prayed while standing. He said, \"The Imam is to be followed; so if he says \nTakbir, you should also say Takbir, and if he bows you should also bow; and when he lifts his head \nyou should also do the same and if he says: Sami`a l-lahu liman hamidah (Allah hears whoever sends \nhis praises to Him) you should say: Rabbana walakal-Hamd (O our Lord! All the praises are for \nYou.\") (See Hadith No. 656 Vol. 1).","reference":"Sahih al-Bukhari 1114, Book 18, Hadith 34","grade":"","question #":"question #2","question":"How should followers respond to the Imam's actions during prayer according to Islamic teachings?","id":"bukhari-18-75"},{"hadith-eng":"(who had piles) I asked Allah's Messenger (ﷺ) about the praying of a man while sitting. He said, \"If he prays \nwhile standing it is better and he who prays while sitting gets half the reward of that who prays \nstanding; and whoever prays while Lying gets half the reward of that who prays while sitting.\"","reference":"Sahih al-Bukhari 1115, Book 18, Hadith 35","grade":"","question #":"question #2","question":"How does physical posture during prayer affect the reward one receives?","id":"bukhari-18-76"},{"hadith-eng":"`Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked \nthe Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray \nstanding; and whoever prays sitting gets half the reward of that who prays while standing; and \nwhoever prays while Lying gets half the reward of that who prays while sitting.' \"","reference":"Sahih al-Bukhari 1116, Book 18, Hadith 36","grade":"","question #":"question #2","question":"How does physical posture during prayer affect the reward one receives?","id":"bukhari-18-77"},{"hadith-eng":"had piles, so I asked the Prophet (ﷺ) about the prayer. He said, \"Pray while standing and if you can't, pray \nwhile sitting and if you cannot do even that, then pray Lying on your side.\"","reference":"Sahih al-Bukhari 1117, Book 18, Hadith 37","grade":"","question #":"question #2","question":"How does Islam accommodate individuals with physical ailments in their religious obligations?","id":"bukhari-18-78"},{"hadith-eng":"(the mother of the faithful believers) I never saw Allah's Messenger (ﷺ) offering the night prayer while \nsitting except in his old age and then he used to recite while sitting and whenever he wanted to bow he \nwould get up and recite thirty or forty verses (while standing) and then bow.","reference":"Sahih al-Bukhari 1118, Book 18, Hadith 38","grade":"","question #":"question #2","question":"What is the significance of reciting verses while standing during prayer?","id":"bukhari-18-79"},{"hadith-eng":"(the mother of the faithful believers) Allah's Messenger (ﷺ) (in his last days) used to pray sitting. He would \nrecite while sitting, and when thirty or forty verses remained from the recitation he would get up and \nrecite them while standing and then he would bow and prostrate. He used to do the same in the second \nrak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I \nwas asleep, he would lie down.","reference":"Sahih al-Bukhari 1119, Book 18, Hadith 39","grade":"","question #":"question #2","question":"What can be learned about the Prophet's (ﷺ) interaction with his family after prayer?","id":"bukhari-18-80"},{"hadith-eng":"The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and \nstayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer \nperiod we used to offer the full prayer.","reference":"Sahih al-Bukhari 1080, Book 18, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of the number of days mentioned in relation to shortening prayers during travel?","id":"bukhari-18-81"},{"hadith-eng":"I heard Anas saying, \"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for \nevery prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \n\"We stayed in Mecca for ten days.\"","reference":"Sahih al-Bukhari 1081, Book 18, Hadith 2","grade":"","question #":"question #3","question":"What is the significance of the Prophet's practice of shortening prayers during travel?","id":"bukhari-18-82"},{"hadith-eng":"I offered the prayer with the Prophet, Abu Bakr and `Umar at Mina and it was of two rak`at. `Uthman \nin the early days of his caliphate did the same, but later on he started praying the full prayer.","reference":"Sahih al-Bukhari 1082, Book 18, Hadith 3","grade":"","question #":"question #3","question":"How did the prayer practices differ between the Prophet, Abu Bakr, Umar, and Uthman?","id":"bukhari-18-83"},{"hadith-eng":"The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.","reference":"Sahih al-Bukhari 1083, Book 18, Hadith 4","grade":"","question #":"question #3","question":"What can be learned about the practice of shortening prayers during travel or specific occasions from this event?","id":"bukhari-18-84"},{"hadith-eng":"We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed \nabout it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I \nprayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr and with `Umar (during \ntheir caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by \nAllah).\"","reference":"Sahih al-Bukhari 1084, Book 18, Hadith 5","grade":"","question #":"question #3","question":"What does the statement 'Truly to Allah we belong and truly to Him we shall return' signify in the context of this event?","id":"bukhari-18-85"},{"hadith-eng":"The Prophet (ﷺ) and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya \n(O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. \nThe Prophet (ﷺ) ordered his companions to assume the lhram for Umra instead of Hajj, excepting those \nwho had Hadi (sacrifice) with them.","reference":"Sahih al-Bukhari 1085, Book 18, Hadith 6","grade":"","question #":"question #3","question":"What exceptions did the Prophet make for those who had a sacrifice with them during Hajj?","id":"bukhari-18-86"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram \n(i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own \nhusband.)\"","reference":"Sahih al-Bukhari 1086, Book 18, Hadith 7","grade":"","question #":"question #3","question":"What is the significance of a male guardian in ensuring the safety and security of a woman during travel?","id":"bukhari-18-87"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram.\"","reference":"Sahih al-Bukhari 1087, Book 18, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of having a Mahram accompany a woman during travel in Islamic tradition?","id":"bukhari-18-88"},{"hadith-eng":"The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day \nto travel for one day and night except with a Mahram.\"","reference":"Sahih al-Bukhari 1088, Book 18, Hadith 9","grade":"","question #":"question #3","question":"Why is the presence of a Mahram important for a woman traveling in Islam?","id":"bukhari-18-89"},{"hadith-eng":"offered four rak`at of Zuhr prayer with the Prophet (p.b.u.h) at Medina and two rak`at at Dhul-Hulaifa. \n(i.e. shortened the `Asr prayer).","reference":"Sahih al-Bukhari 1089, Book 18, Hadith 10","grade":"","question #":"question #3","question":"What are the conditions under which a Muslim is allowed to shorten their prayers?","id":"bukhari-18-90"},{"hadith-eng":"\"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was \nkept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what \nmade Aisha pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman did.\"","reference":"Sahih al-Bukhari 1090, Book 18, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of the initial prescription of two rak`at prayers in Islam?","id":"bukhari-18-91"},{"hadith-eng":"\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"","reference":"Sahih al-Bukhari 1091, 1092, Book 18, Hadith 12","grade":"","question #":"question #3","question":"What is the significance of delaying Maghrib prayer in certain circumstances according to Islamic tradition?","id":"bukhari-18-92"},{"hadith-eng":"\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"","reference":"Sahih al-Bukhari 1091, 1092, Book 18, Hadith 12","grade":"","question #":"question #3","question":"What practices did Ibn Umar follow regarding prayer timings during travel, and what was his reasoning?","id":"bukhari-18-93"},{"hadith-eng":"I saw the Prophet (p.b.u.h) offering the prayer on his mount (Rahila) whatever direction it took.","reference":"Sahih al-Bukhari 1093, Book 18, Hadith 13","grade":"","question #":"question #3","question":"How does Islamic practice accommodate prayer during travel?","id":"bukhari-18-94"},{"hadith-eng":"The Prophet (ﷺ) used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.","reference":"Sahih al-Bukhari 1094, Book 18, Hadith 14","grade":"","question #":"question #3","question":"What are the guidelines for offering voluntary prayers when one is not in a position to face the Qibla?","id":"bukhari-18-95"},{"hadith-eng":"Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said \nthat the Prophet (ﷺ) used to do so.","reference":"Sahih al-Bukhari 1095, Book 18, Hadith 15","grade":"","question #":"question #3","question":"What is the practice of offering witr prayer while on a mount according to Islamic tradition?","id":"bukhari-18-96"},{"hadith-eng":"On traveling, `Abdullah bin `Umar used to offer the prayer on his Mount by signs whatever direction \nit took. `Abdullah said that the Prophet (ﷺ) used to do so.","reference":"Sahih al-Bukhari 1096, Book 18, Hadith 16","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) perform prayers while on a journey?","id":"bukhari-18-97"},{"hadith-eng":"I saw the Prophet (ﷺ) on his Mount praying Nawafil by nodding his head, whatever direction he faced, but \nAllah's Messenger (ﷺ) never did the same in offering the compulsory prayers.","reference":"Sahih al-Bukhari 1097, Book 18, Hadith 17","grade":"","question #":"question #3","question":"What flexibility is allowed in the direction faced during Nawafil prayers while traveling?","id":"bukhari-18-98"},{"hadith-eng":"At night \n`Abdullah bin `Umar used to offer the prayer on the back of his animal during the journey and never \ncared about the direction he faced. Ibn `Umar said, \"Allah's Messenger (ﷺ) used to offer the optional prayer \non the back of his Mount facing any direction and also used to pray the witr on it but never offered the \ncompulsory prayer on it.\"","reference":"Sahih al-Bukhari 1098, Book 18, Hadith 18","grade":"","question #":"question #3","question":"What is the distinction between optional and compulsory prayers in terms of direction while traveling?","id":"bukhari-18-99"},{"hadith-eng":"The Prophet (ﷺ) used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the \ncompulsory prayer, he used to dismount and face the Qibla.","reference":"Sahih al-Bukhari 1099, Book 18, Hadith 19","grade":"","question #":"question #3","question":"What is the difference between Nawafil and compulsory prayers in terms of direction and posture?","id":"bukhari-18-100"},{"hadith-eng":"We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- \nTamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the \nQibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" \nHe replied, \"If I had not seen Allah's Messenger (ﷺ) doing it, I would not have done it.\"","reference":"Sahih al-Bukhari 1100, Book 18, Hadith 20","grade":"","question #":"question #3","question":"How does the example of Anas bin Malik illustrate the importance of adhering to the Prophet's practices?","id":"bukhari-18-101"},{"hadith-eng":"Ibn `Umar went on a journey and said, \"I accompanied the Prophet (ﷺ) and he did not offer optional \nprayers during the journey, and Allah says: 'Verily! In Allah's Messenger (ﷺ) you have a good example to \nfollow.' \" (33.21)","reference":"Sahih al-Bukhari 1101, Book 18, Hadith 21","grade":"","question #":"question #3","question":"What guidance does the Quran provide about following the example of the Prophet (ﷺ)?","id":"bukhari-18-102"},{"hadith-eng":"I accompanied Allah's Messenger (ﷺ) and he never offered more than two rak`at during the journey. Abu \nBakr, `Umar and `Uthman used to do the same.","reference":"Sahih al-Bukhari 1102, Book 18, Hadith 22","grade":"","question #":"question #3","question":"What was the common practice of Abu Bakr, `Umar, and `Uthman regarding prayer during travel?","id":"bukhari-18-103"},{"hadith-eng":"Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). \nShe said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) took a bath in my house and offered eight \nrak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.","reference":"Sahih al-Bukhari 1103, Book 18, Hadith 23","grade":"","question #":"question #3","question":"What can be learned about the Prophet's prayer style from the description of his prostration and bowing?","id":"bukhari-18-104"},{"hadith-eng":"Narrated `Abdullah bin Amir that his father had told him that he had seen the Prophet (p.b.u.h) \npraying Nawafil at night on the back of his Mount on a journey, facing whatever direction it took.","reference":"Sahih al-Bukhari 1104, Book 18, Hadith 24","grade":"","question #":"question #3","question":"What can be inferred about the flexibility of prayer practices during travel from this narration?","id":"bukhari-18-105"},{"hadith-eng":"Ibn `Umar said, \"Allah's Messenger (ﷺ) used to pray the Nawafil on the back of his Mount (carriage) by \nsigns facing any direction.\" Ibn `Umar used to do the same.","reference":"Sahih al-Bukhari 1105, Book 18, Hadith 25","grade":"","question #":"question #3","question":"How did Ibn `Umar emulate the Prophet's practice of praying Nawafil on a mount?","id":"bukhari-18-106"},{"hadith-eng":"The Prophet (ﷺ) used to offer the Maghrib and `Isha' prayers together whenever he was in a hurry on a journey.","reference":"Sahih al-Bukhari 1106, Book 18, Hadith 26","grade":"","question #":"question #3","question":"What is the significance of combining prayers in Islam?","id":"bukhari-18-107"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet (ﷺ) used to offer the Maghrib and the `Isha' prayers together on journeys.","reference":"Sahih al-Bukhari 1107, Book 18, Hadith 27","grade":"","question #":"question #3","question":"How does the practice of combining prayers facilitate ease for travelers in Islamic teachings?","id":"bukhari-18-108"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.","reference":"Sahih al-Bukhari 1108, Book 18, Hadith 28","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) manage prayer times while traveling?","id":"bukhari-18-109"},{"hadith-eng":"Salim told me, \"`Abdullah bin `Umar said, 'I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he \noffered it along with the `Isha prayer whenever he was in a hurry during the journey.' \" Salim said, \n\"Abdullah bin `Umar used to do the same whenever he was in a hurry during the journey. After \nmaking the call for Iqama, for the Maghrib prayer he used to offer three rak`at and then perform \nTaslim. After waiting for a short while, he would pronounce the Iqama for the `Isha' prayer and offer \ntwo rak`at and perform Taslim. He never prayed any Nawafil in between the two prayers or after the \n`Isha' prayers till he got up in the middle of the night (for Tahajjud prayer).\"","reference":"Sahih al-Bukhari 1109, Book 18, Hadith 29","grade":"","question #":"question #3","question":"What is the significance of not performing Nawafil prayers between Maghrib and Isha during travel?","id":"bukhari-18-110"},{"hadith-eng":"Whenever the Prophet (ﷺ) started a journey before noon, he used to delay the Zuhr prayer till the time of \n`Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer \nand then ride (for the journey).","reference":"Sahih al-Bukhari 1110, Book 18, Hadith 30","grade":"","question #":"question #3","question":"How did the time of day influence the Prophet's (ﷺ) decision to perform prayers before starting a journey?","id":"bukhari-18-111"},{"hadith-eng":"Whenever the Prophet (ﷺ) started the journey before noon, he used to delay the Zuhr prayer till the time \nfor the `Asr prayer and then he would dismount and pray them together; and whenever the sun \ndeclined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).","reference":"Sahih al-Bukhari 1111, Book 18, Hadith 31","grade":"","question #":"question #3","question":"How does the timing of a journey affect the performance of prayers according to Islamic teachings?","id":"bukhari-18-112"},{"hadith-eng":"Whenever the Prophet (ﷺ) started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).","reference":"Sahih al-Bukhari 1112, Book 18, Hadith 32","grade":"","question #":"question #3","question":"How does the timing of a journey affect the performance of Zuhr prayer according to the Prophet's practice?","id":"bukhari-18-113"},{"hadith-eng":"Allah's Messenger (ﷺ) prayed in his house while sitting during his illness and the people prayed behind him \nstanding and he pointed to them to sit down. When he had finished the prayer, he said, \"The Imam is \nto be followed and so when he bows you should bow; and when he lifts his head you should also do \nthe same.\"","reference":"Sahih al-Bukhari 1113, Book 18, Hadith 33","grade":"","question #":"question #3","question":"What guidance does the Prophet Muhammad (ﷺ) provide regarding the physical posture of followers during prayer when the Imam is sitting?","id":"bukhari-18-114"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) fell down from a horse and his right side was either injured or scratched, so \nwe went to inquire about his health. The time for the prayer became due and he offered the prayer \nwhile sitting and we prayed while standing. He said, \"The Imam is to be followed; so if he says \nTakbir, you should also say Takbir, and if he bows you should also bow; and when he lifts his head \nyou should also do the same and if he says: Sami`a l-lahu liman hamidah (Allah hears whoever sends \nhis praises to Him) you should say: Rabbana walakal-Hamd (O our Lord! All the praises are for \nYou.\") (See Hadith No. 656 Vol. 1).","reference":"Sahih al-Bukhari 1114, Book 18, Hadith 34","grade":"","question #":"question #3","question":"What are the specific phrases to be recited by followers during the prayer when the Imam says certain phrases?","id":"bukhari-18-115"},{"hadith-eng":"(who had piles) I asked Allah's Messenger (ﷺ) about the praying of a man while sitting. He said, \"If he prays \nwhile standing it is better and he who prays while sitting gets half the reward of that who prays \nstanding; and whoever prays while Lying gets half the reward of that who prays while sitting.\"","reference":"Sahih al-Bukhari 1115, Book 18, Hadith 35","grade":"","question #":"question #3","question":"What are the implications of praying while sitting or lying down for those with physical ailments?","id":"bukhari-18-116"},{"hadith-eng":"`Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked \nthe Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray \nstanding; and whoever prays sitting gets half the reward of that who prays while standing; and \nwhoever prays while Lying gets half the reward of that who prays while sitting.' \"","reference":"Sahih al-Bukhari 1116, Book 18, Hadith 36","grade":"","question #":"question #3","question":"What considerations might a person with physical ailments have when performing prayers?","id":"bukhari-18-117"},{"hadith-eng":"had piles, so I asked the Prophet (ﷺ) about the prayer. He said, \"Pray while standing and if you can't, pray \nwhile sitting and if you cannot do even that, then pray Lying on your side.\"","reference":"Sahih al-Bukhari 1117, Book 18, Hadith 37","grade":"","question #":"question #3","question":"What guidance does Islam provide for those who are unable to perform prayers in the usual manner due to health issues?","id":"bukhari-18-118"},{"hadith-eng":"(the mother of the faithful believers) I never saw Allah's Messenger (ﷺ) offering the night prayer while \nsitting except in his old age and then he used to recite while sitting and whenever he wanted to bow he \nwould get up and recite thirty or forty verses (while standing) and then bow.","reference":"Sahih al-Bukhari 1118, Book 18, Hadith 38","grade":"","question #":"question #3","question":"How does the practice of sitting during prayer reflect on the flexibility of Islamic worship?","id":"bukhari-18-119"},{"hadith-eng":"(the mother of the faithful believers) Allah's Messenger (ﷺ) (in his last days) used to pray sitting. He would \nrecite while sitting, and when thirty or forty verses remained from the recitation he would get up and \nrecite them while standing and then he would bow and prostrate. He used to do the same in the second \nrak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I \nwas asleep, he would lie down.","reference":"Sahih al-Bukhari 1119, Book 18, Hadith 39","grade":"","question #":"question #3","question":"What does this narration indicate about the flexibility in the prayer positions for those who are unable to stand?","id":"bukhari-18-120"}]