[{"hadith-eng":"Allah's Messenger (ﷺ) said: Islam is based on (the following) five \n     (principles):1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).2. To offer the (compulsory congregational) prayers dutifully and \n     perfectly.3. To pay Zakat (i.e. obligatory charity) .4. To perform Hajj. (i.e. Pilgrimage to Mecca)5. To observe fast during the month of Ramadan.","reference":"Sahih al-Bukhari 8, Book 2, Hadith 1","grade":"","question #":"question #1","question":"What are the fundamental pillars of Islam that every Muslim must adhere to?","id":"bukhari-2-1"},{"hadith-eng":"The Prophet (ﷺ) said, \"Faith (Belief) consists of more than sixty branches\n     (i.e. parts). And Haya (This term \"Haya\" covers a large number of \n     concepts which are to be taken together; amongst them are self \n     respect, modesty, bashfulness, and scruple, etc.) is a part of \n     faith.\"","reference":"Sahih al-Bukhari 9, Book 2, Hadith 2","grade":"","question #":"question #1","question":"What are the different branches or parts of faith in Islam?","id":"bukhari-2-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with\n     his tongue and hands. And a Muhajir (emigrant) is the one who gives up\n     (abandons) all what Allah has forbidden.\"","reference":"Sahih al-Bukhari 10, Book 2, Hadith 3","grade":"","question #":"question #1","question":"What are the characteristics of a true Muslim in terms of their behavior towards others?","id":"bukhari-2-3"},{"hadith-eng":"Some people asked Allah's Messenger (ﷺ), \"Whose Islam is the best? i.e. (Who\n     is a very good Muslim)?\" He replied, \"One who avoids harming the \n     Muslims with his tongue and hands.\"","reference":"Sahih al-Bukhari 11, Book 2, Hadith 4","grade":"","question #":"question #1","question":"What characteristics define a good Muslim according to Islamic teachings?","id":"bukhari-2-4"},{"hadith-eng":"A man asked the Prophet (ﷺ) , \"What sort of deeds or (what qualities of) \n     Islam are good?\" The Prophet (ﷺ) replied, 'To feed (the poor) and greet \n     those whom you know and those whom you do not Know (See \n     Hadith No. 27).","reference":"Sahih al-Bukhari 12, Book 2, Hadith 5","grade":"","question #":"question #1","question":"What are considered good deeds or qualities in Islam according to the teachings of the Prophet?","id":"bukhari-2-5"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you will have faith till he wishes for his \n     (Muslim) brother what he likes for himself.\"","reference":"Sahih al-Bukhari 13, Book 2, Hadith 6","grade":"","question #":"question #1","question":"What is the relationship between faith and wishing well for others in Islam?","id":"bukhari-2-6"},{"hadith-eng":"\"Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my life is, none of you \n     will have faith till he loves me more than his father and his \n     children.\"","reference":"Sahih al-Bukhari 14, Book 2, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of loving the Prophet Muhammad (ﷺ) in the context of one's faith?","id":"bukhari-2-7"},{"hadith-eng":"The Prophet (ﷺ) said \"None of you will have faith till he loves me more \n     than his father, his children and all mankind.\"","reference":"Sahih al-Bukhari 15, Book 2, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of loving the Prophet Muhammad (ﷺ) in the context of one's faith?","id":"bukhari-2-8"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will have the sweetness (delight) of faith:1. The one to whom Allah and His Apostle becomes dearer than anything \n     else.2. Who loves a person and he loves him only for Allah's sake.3. Who hates to revert to Atheism (disbelief) as he hates to be thrown\n     into the fire.\"","reference":"Sahih al-Bukhari 16, Book 2, Hadith 9","grade":"","question #":"question #1","question":"What are the three qualities that lead to experiencing the sweetness of faith in Islam?","id":"bukhari-2-9"},{"hadith-eng":"The Prophet (ﷺ) said, \"Love for the Ansar is a sign of faith and hatred \n     for the Ansar is a sign of hypocrisy.\"","reference":"Sahih al-Bukhari 17, Book 2, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of loving the Ansar in relation to one's faith?","id":"bukhari-2-10"},{"hadith-eng":"who took part in the battle of Badr and was a Naqib (a person heading \n     a group of six persons), on the night of Al-'Aqaba pledge: Allah's \n     Apostle said while a group of his companions were around him, \"Swear \n     allegiance to me for:1. Not to join anything in worship along with Allah.2. Not to steal.3. Not to commit illegal sexual intercourse.4. Not to kill your children.5. Not to accuse an innocent person (to spread such an accusation \n     among people).6. Not to be disobedient (when ordered) to do good deed.\"The Prophet (ﷺ) added: \"Whoever among you fulfills his pledge will be \n     rewarded by Allah. And whoever indulges in any one of them (except the\n     ascription of partners to Allah) and gets the punishment in this \n     world, that punishment will be an expiation for that sin. And if one \n     indulges in any of them, and Allah conceals his sin, it is up to Him \n     to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit \n     added: \"So we swore allegiance for these.\" (points to Allah's \n     Apostle)","reference":"Sahih al-Bukhari 18, Book 2, Hadith 11","grade":"","question #":"question #1","question":"What are the key elements of the pledge made by the companions to the Prophet Muhammad (ﷺ)?","id":"bukhari-2-11"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A time will soon come when the best property of a Muslim will be sheep which he will take on the top of mountains and the places of rainfall (valleys) so as to flee with his religion from afflictions.\"","reference":"Sahih al-Bukhari 19, Book 2, Hadith 12","grade":"","question #":"question #1","question":"What circumstances might lead a Muslim to seek isolation with their livestock in remote areas?","id":"bukhari-2-12"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) ordered the Muslims to do something, he used \n     to order them deeds which were easy for them to do, (according to \n     their strength and endurance). They said, \"O Allah's Messenger (ﷺ)! We are not \n     like you. Allah  has forgiven your past and future sins.\" So Allah's \n     Apostle became angry and it was apparent on his face. He said, \"I am \n     the most Allah fearing, and know Allah better than all of you do.\"","reference":"Sahih al-Bukhari 20, Book 2, Hadith 13","grade":"","question #":"question #1","question":"Why did the Prophet Muhammad (ﷺ) emphasize performing deeds according to one's strength and endurance?","id":"bukhari-2-13"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will taste the sweetness of faith:1. The one to whom Allah and His Apostle become dearer than anything \n     else.2. Who loves a person and he loves him only for Allah's sake.3. Who hates to revert to disbelief (Atheism) after Allah has brought \n     (saved) him out from it, as he hates to be thrown in fire.\"","reference":"Sahih al-Bukhari 21, Book 2, Hadith 14","grade":"","question #":"question #1","question":"What are the three qualities that lead to experiencing the sweetness of faith in Islam?","id":"bukhari-2-14"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the people of Paradise will enter Paradise and\n     the people of Hell will go to Hell, Allah will order those who have \n     had faith equal to the weight of a grain of mustard seed to be taken \n     out from Hell. So they will be taken out but (by then) they will be \n     blackened (charred). Then they will be put in the river of Haya' \n     (rain) or Hayat (life) (the Narrator is in doubt as to which is the \n     right term), and they will revive like a grain that grows near the \n     bank of a flood channel. Don't you see that it comes out yellow and \n     twisted\"","reference":"Sahih al-Bukhari 22, Book 2, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of having even a small amount of faith in achieving salvation according to Islamic teachings?","id":"bukhari-2-15"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"While I was sleeping I saw (in a dream) some \n     people wearing shirts of which some were reaching up to the breasts \n     only while others were even shorter than that. Umar bin Al-Khattab was\n     shown wearing a shirt that he was dragging.\" The people asked, \"How \n     did you interpret it? (What is its interpretation) O Allah's Messenger (ﷺ)?\"\n     He (the Prophet (ﷺ) ) replied, \"It is the Religion.\"","reference":"Sahih al-Bukhari 23, Book 2, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of dreams in understanding religious concepts in Islam?","id":"bukhari-2-16"},{"hadith-eng":"Once Allah's Messenger (ﷺ) passed by an Ansari (man) who was admonishing\n     his brother regarding Haya'. On that Allah's Messenger (ﷺ) said, \"Leave him \n     as Haya' is a part of faith.\" (SeeHadith 9)","reference":"Sahih al-Bukhari 24, Book 2, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of Haya' (modesty) in Islam?","id":"bukhari-2-17"},{"hadith-eng":"Allah's Messenger (ﷺ) said: \"I have been ordered (by Allah) to fight against\n     the people until they testify that none has the right to be worshipped\n     but Allah and that Muhammad is Allah's Messenger (ﷺ), and offer the prayers \n     perfectly and give the obligatory charity, so if they perform that, \n     then they save their lives and property from me except for Islamic laws\n     and then their reckoning (accounts) will be done by Allah.\"","reference":"Sahih al-Bukhari 25, Book 2, Hadith 18","grade":"","question #":"question #1","question":"What are the conditions under which a person's life and property are protected in Islam?","id":"bukhari-2-18"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked, \"What is the best deed?\" He replied, \"To \n     believe in Allah and His Apostle (Muhammad). The questioner then \n     asked, \"What is the next (in goodness)? He replied, \"To participate in\n     Jihad (religious fighting) in Allah's Cause.\" The questioner again \n     asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj \n     (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is \n     performed with the intention of seeking Allah's pleasure only and not \n     to show off and without committing a sin and in accordance with the \n     traditions of the Prophet).\"","reference":"Sahih al-Bukhari 26, Book 2, Hadith 19","grade":"","question #":"question #1","question":"What are considered the best deeds in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-2-19"},{"hadith-eng":"Allah's Messenger (ﷺ) distributed (Zakat) amongst (a group of) people while \n     I was sitting there but Allah's Messenger (ﷺ) left a man whom I thought the \n     best of the lot. I asked, \"O Allah's Messenger (ﷺ)! Why have you left that \n     person? By Allah I regard him as a faithful believer.\" The Prophet (ﷺ) \n     commented: \"Or merely a Muslim.\" I remained quiet for a while, but \n     could not help repeating my question because of what I knew about him.\n     And then asked Allah's Messenger (ﷺ), \"Why have you left so and so? By \n     Allah! He is a faithful believer.\" The Prophet (ﷺ) again said, \"Or merely \n     a Muslim.\" And I could not help repeating my question because of what \n     I knew about him. Then the Prophet (ﷺ) said, \"O Sa'd! I give to a person \n     while another is dearer to me, for fear that he might be thrown on his\n     face in the Fire by Allah.\"","reference":"Sahih al-Bukhari 27, Book 2, Hadith 20","grade":"","question #":"question #1","question":"What criteria did the Prophet (ﷺ) use when distributing Zakat among people?","id":"bukhari-2-20"},{"hadith-eng":"A person asked Allah's Messenger (ﷺ) . \"What (sort of) deeds in or (what \n     qualities of) Islam are good?\" He replied, \"To feed (the poor) and \n     greet those whom you know and those whom you don't know.\"","reference":"Sahih al-Bukhari 28, Book 2, Hadith 21","grade":"","question #":"question #1","question":"What are considered good deeds or qualities in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-2-21"},{"hadith-eng":"The Prophet (ﷺ) said: \"I was shown the Hell-fire and that the majority of \n     its dwellers were women who were ungrateful.\" It was asked, \"Do they \n     disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied, \n     \"They are ungrateful to their husbands and are ungrateful for the \n     favors and the good (charitable deeds) done to them. If you have \n     always been good (benevolent) to one of them and then she sees \n     something in you (not of her liking), she will say, 'I have never \n     received any good from you.\"","reference":"Sahih al-Bukhari 29, Book 2, Hadith 22","grade":"","question #":"question #1","question":"What are the consequences of being ungrateful according to Islamic teachings?","id":"bukhari-2-22"},{"hadith-eng":"At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave, \n     too, was wearing a similar one. I asked about the reason for it. He \n     replied, \"I abused a person by calling his mother with bad names.\" The\n     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his \n     mother with bad names You still have some characteristics of \n     ignorance. Your slaves are your brothers and Allah has put them under \n     your command. So whoever has a brother under his command should feed \n     him of what he eats and dress him of what he wears. Do not ask them \n     (slaves) to do things beyond their capacity (power) and if you do so, \n     then help them.' \"","reference":"Sahih al-Bukhari 30, Book 2, Hadith 23","grade":"","question #":"question #1","question":"What teachings does Islam provide regarding the treatment of slaves or those under one's command?","id":"bukhari-2-23"},{"hadith-eng":"While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met\n     me and asked, \"Where are you going?\" I replied, \"I am going to help \n     that person.\" He said, \"Go back for I have heard Allah's Messenger (ﷺ) \n     saying, 'When two Muslims fight (meet) each other with their swords, \n     both the murderer as well as the murdered will go to the Hell-fire.' I\n     said, 'O Allah's Messenger (ﷺ)! It is all right for the murderer but what \n     about the murdered one?' Allah's Messenger (ﷺ) replied, \"He surely had the \n     intention to kill his companion.\"","reference":"Sahih al-Bukhari 31, Book 2, Hadith 24","grade":"","question #":"question #1","question":"What are the consequences in Islam for two Muslims who engage in combat with the intention to kill each other?","id":"bukhari-2-24"},{"hadith-eng":"When the following Verse was revealed: \"It is those who believe and \n     confuse not their belief with wrong (worshipping others besides \n     Allah.)\" (6:83), the companions of Allah's Messenger (ﷺ) asked, \"Who is \n     amongst us who had not done injustice (wrong)?\" Allah revealed: \"No \n     doubt, joining others in worship with Allah is a great injustice \n     (wrong) indeed.\" (31.13)","reference":"Sahih al-Bukhari 32, Book 2, Hadith 25","grade":"","question #":"question #1","question":"What is considered a great injustice in the context of belief according to Islamic teachings?","id":"bukhari-2-25"},{"hadith-eng":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three:1. Whenever he speaks, he tells a lie.2. Whenever he promises, he always breaks it (his promise ).3. If you trust him, he proves to be dishonest. (If you keep something\n     as a trust with him, he will not return it.)\"","reference":"Sahih al-Bukhari 33, Book 2, Hadith 26","grade":"","question #":"question #1","question":"What are the characteristics that define a hypocrite according to Islamic teachings?","id":"bukhari-2-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has the following four (characteristics) \n     will be a pure hypocrite and whoever has one of the following four \n     characteristics will have one characteristic of hypocrisy unless and \n     until he gives it up.1. Whenever he is entrusted, he betrays.2. Whenever he speaks, he tells a lie.3. Whenever he makes a covenant, he proves treacherous.4. Whenever he quarrels, he behaves in a very imprudent, evil and \n     insulting manner.\"","reference":"Sahih al-Bukhari 34, Book 2, Hadith 27","grade":"","question #":"question #1","question":"What are the characteristics that define a pure hypocrite according to Islamic teachings?","id":"bukhari-2-27"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever establishes the prayers on the night of\n     Qadr out of sincere faith and hoping to attain Allah's rewards (not to\n     show off) then all his past sins will be forgiven.\"","reference":"Sahih al-Bukhari 35, Book 2, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of observing prayers on the night of Qadr with sincere faith?","id":"bukhari-2-28"},{"hadith-eng":"The Prophet (ﷺ) said, \"The person who participates in (Holy battles) in \n     Allah's cause and nothing compels him to do so except belief in Allah \n     and His Apostles, will be recompensed by Allah either with a reward, \n     or booty (if he survives) or will be admitted to Paradise (if he is \n     killed in the battle as a martyr). Had I not found it difficult for my\n     followers, then I would not remain behind any sariya going for Jihad \n     and I would have loved to be martyred in Allah's cause and then made \n     alive, and then martyred and then made alive, and then again martyred \n     in His cause.\"","reference":"Sahih al-Bukhari 36, Book 2, Hadith 29","grade":"","question #":"question #1","question":"What are the rewards promised for those who participate in battles for Allah's cause with sincere belief?","id":"bukhari-2-29"},{"hadith-eng":"Allah's Messenger (ﷺ) said: \"Whoever establishes prayers during the nights \n     of Ramadan faithfully out of sincere faith and hoping to attain \n     Allah's rewards (not for showing off), all his past sins will be \n     forgiven.\"","reference":"Sahih al-Bukhari 37, Book 2, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of performing prayers during the nights of Ramadan with sincere faith?","id":"bukhari-2-30"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever observes fasts during the month of \n     Ramadan out of sincere faith, and hoping to attain Allah's rewards, \n     then all his past sins will be forgiven.\"","reference":"Sahih al-Bukhari 38, Book 2, Hadith 31","grade":"","question #":"question #1","question":"What are the spiritual benefits of fasting during the month of Ramadan with sincere faith?","id":"bukhari-2-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"Religion is very easy and whoever overburdens \n     himself in his religion will not be able to continue in that way. So \n     you should not be extremists, but try to be near to perfection and \n     receive the good tidings that you will be rewarded; and gain strength \n     by worshipping in the mornings, the afternoons, and during the last hours of the nights.\" (See Fath-ul-Bari, Page \n     102, Vol 1).","reference":"Sahih al-Bukhari 39, Book 2, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of moderation in practicing religion according to Islamic teachings?","id":"bukhari-2-32"},{"hadith-eng":"When the Prophet (ﷺ) came to Medina, he stayed first with his grandfathers\n     or maternal uncles from Ansar. He offered his prayers facing \n     Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he \n     wished that he could pray facing the Ka'ba (at Mecca). The first \n     prayer which he offered facing the Ka'ba was the 'Asr prayer in the \n     company of some people. Then one of those who had offered that prayer \n     with him came out and passed by some people in a mosque who were \n     bowing during their prayers (facing Jerusalem). He said addressing \n     them, \"By Allah, I testify that I have prayed with Allah's Messenger (ﷺ) \n     facing Mecca (Ka'ba).' Hearing that, those people changed their \n     direction towards the Ka'ba immediately. Jews and the people of the \n     scriptures used to be pleased to see the Prophet (ﷺ) facing Jerusalem in \n     prayers but when he changed his direction towards the Ka'ba, during \n     the prayers, they disapproved of it.Al-Bara' added, \"Before we changed our direction towards the Ka'ba \n     (Mecca) in prayers, some Muslims had died or had been killed and we \n     did not know what to say about them (regarding their prayers.) Allah \n     then revealed: And Allah would never make your faith (prayers) to be \n     lost (i.e. the prayers of those Muslims were valid).' \" (2:143).","reference":"Sahih al-Bukhari 40, Book 2, Hadith 33","grade":"","question #":"question #1","question":"What was the significance of the change in the Qibla direction for the Muslim community?","id":"bukhari-2-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"","reference":"Sahih al-Bukhari 41, Book 2, Hadith 34","grade":"","question #":"question #1","question":"What are the spiritual benefits of sincerely embracing Islam?","id":"bukhari-2-34"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If any one of you improve (follows strictly) \n     his Islamic religion then his good deeds will be rewarded ten times to\n     seven hundred times for each good deed and a bad deed will be recorded\n     as it is.\"","reference":"Sahih al-Bukhari 42, Book 2, Hadith 35","grade":"","question #":"question #1","question":"How does the concept of reward and punishment work in Islam for good and bad deeds?","id":"bukhari-2-35"},{"hadith-eng":"Once the Prophet (ﷺ) came while a woman was sitting with me. He said, \"Who\n     is she?\" I replied, \"She is so and so,\" and told him about her \n     (excessive) praying. He said disapprovingly, \"Do (good) deeds which is\n     within your capacity (without being overtaxed) as Allah does not get \n     tired (of giving rewards) but (surely) you will get tired and the best\n     deed (act of Worship) in the sight of Allah is that which is done \n     regularly.\"","reference":"Sahih al-Bukhari 43, Book 2, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of consistency in worship according to Islamic teachings?","id":"bukhari-2-36"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever said \"None has the right to be worshipped \n     but Allah and has in his heart good (faith) equal to the weight of a \n     barley grain will be taken out of Hell. And whoever said: \"None has \n     the right to be worshipped but Allah and has in his heart good (faith)\n     equal to the weight of a wheat grain will be taken out of Hell. And \n     whoever said, \"None has the right to be worshipped but Allah and has \n     in his heart good (faith) equal to the weight of an atom will be taken\n     out of Hell.\"","reference":"Sahih al-Bukhari 44, Book 2, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of having faith in one's heart for salvation from Hell?","id":"bukhari-2-37"},{"hadith-eng":"Once a Jew said to me, \"O the chief of believers! There is a verse in \n     your Holy Book Which is read by all of you (Muslims), and had it been \n     revealed to us, we would have taken that day (on which it was revealed\n     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that \n     verse?\" The Jew replied, \"This day I have perfected your religion For \n     you, completed My favor upon you, And have chosen for you Islam as \n     your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where \n     this verse was revealed to the Prophet. It was Friday and the Prophet (ﷺ) \n     was standing at 'Arafat (i.e. the Day of Hajj)\"","reference":"Sahih al-Bukhari 45, Book 2, Hadith 38","grade":"","question #":"question #1","question":"What significance does the verse 'This day I have perfected your religion for you' hold in Islam?","id":"bukhari-2-38"},{"hadith-eng":"A man from Najd with unkempt hair came to Allah's Messenger (ﷺ) and we heard\r\n     his loud voice but could not understand what he was saying, till he \r\n     came near and then we came to know that he was asking about Islam. \r\n     Allah's Messenger (ﷺ) said, \"You have to offer prayers perfectly five times \r\n     in a day and night (24 hours).\" The man asked, \"Is there any more \r\n     (praying)?\" Allah's Messenger (ﷺ) replied, \"No, but if you want to offer the\r\n     Nawafil prayers (you can).\" Allah's Messenger (ﷺ) further said to him: \"You \r\n     have to observe fasts during the month of Ramadan.\" The man asked, \r\n     \"Is there any more fasting?\" Allah's Messenger (ﷺ) replied, \"No, but if you \r\n     want to observe the Nawafil fasts (you can.)\" Then Allah's Messenger (ﷺ) \r\n     further said to him, \"You have to pay the Zakat (obligatory charity).\"\r\n     The man asked, \"Is there any thing other than the Zakat for me to \r\n     pay?\" Allah's Messenger (ﷺ) replied, \"No, unless you want to give alms of \r\n     your own.\" And then that man retreated saying, \"By Allah! I will \r\n     neither do less nor more than this.\" Allah's Messenger (ﷺ) said, \"If what he\r\n     said is true, then he will be successful (i.e. he will be granted \r\n     Paradise).\"","reference":"Sahih al-Bukhari 46, Book 2, Hadith 39","grade":"","question #":"question #1","question":"What are the obligatory acts of worship in Islam as mentioned in the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-2-39"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(A believer) who accompanies the funeral \n     procession of a Muslim out of sincere faith and hoping to attain \n     Allah's reward and remains with it till the funeral prayer is offered \n     and the burial ceremonies are over, he will return with a reward of \n     two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who \n     offers the funeral prayer only and returns before the burial, will \n     return with the reward of one Qirat only.\"","reference":"Sahih al-Bukhari 47, Book 2, Hadith 40","grade":"","question #":"question #1","question":"What are the rewards associated with participating in a Muslim's funeral procession and burial?","id":"bukhari-2-40"},{"hadith-eng":"The Prophet (ﷺ) said, \"Abusing a Muslim is Fusuq (an evil doing) and \n     killing him is Kufr (disbelief).\"","reference":"Sahih al-Bukhari 48, Book 2, Hadith 41","grade":"","question #":"question #1","question":"What are the consequences of abusing a fellow Muslim in Islamic teachings?","id":"bukhari-2-41"},{"hadith-eng":"\"Allah's Messenger (ﷺ) went out to inform the people about the (date of the)\n     night of decree (Al-Qadr) but there happened a quarrel between two \n     Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about (the \n     date of) the night of Al-Qadr, but as so and so and so and so \n     quarrelled, its knowledge was taken away (I forgot it) and maybe it \n     was better for you. Now look for it in the 7th, the 9th and the 5th \n     (of the last 10 nights of the month of Ramadan).\"","reference":"Sahih al-Bukhari 49, Book 2, Hadith 42","grade":"","question #":"question #1","question":"What impact can disputes among individuals have on the community's spiritual knowledge or blessings?","id":"bukhari-2-42"},{"hadith-eng":"One day while the Prophet (ﷺ) was sitting in the company of some people, \n     (The angel) Gabriel came and asked, \"What is faith?\" Allah's Messenger (ﷺ) \n     replied, 'Faith is to believe in Allah, His angels, (the) meeting with\n     Him, His Apostles, and to believe in Resurrection.\" Then he further \n     asked, \"What is Islam?\" Allah's Messenger (ﷺ) replied, \"To worship Allah \n     Alone and none else, to offer prayers perfectly to pay the compulsory \n     charity (Zakat) and to observe fasts during the month of Ramadan.\"  \n     Then he further asked, \"What is Ihsan (perfection)?\" Allah's Messenger (ﷺ) \n     replied, \"To worship Allah as if you see Him, and if you cannot \n     achieve this state of devotion then you must consider that He is \n     looking at you.\" Then he further asked, \"When will the Hour be \n     established?\" Allah's Messenger (ﷺ) replied, \"The answerer has no better \n     knowledge than the questioner. But I will inform you about its \n     portents.1. When a slave (lady) gives birth to her master.2. When the shepherds of black camels start boasting and competing \n     with others in the construction of higher buildings. And the Hour is \n     one of five things which nobody knows except Allah.The Prophet (ﷺ) then recited: \"Verily, with Allah (Alone) is the knowledge\n     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet (ﷺ) \n     asked his companions to call him back, but they could not see him. \n     Then the Prophet (ﷺ) said, \"That was Gabriel who came to teach the people \n     their religion.\" Abu 'Abdullah said: He (the Prophet) considered all \n     that as a part of faith.","reference":"Sahih al-Bukhari 50, Book 2, Hadith 43","grade":"","question #":"question #1","question":"What are the fundamental beliefs that constitute faith in Islam?","id":"bukhari-2-43"},{"hadith-eng":"I was informed by Abu Sufyan that Heraclius said to him, \"I asked you \n     whether they (followers of Muhammad) were increasing or decreasing. \n     You replied that they were increasing. And in fact, this is the way of\n     true Faith till it is complete in all respects. I further asked you \n     whether there was anybody, who, after embracing his (the Prophets) \n     religion (Islam) became displeased and discarded it. You replied in \n     the negative, and in fact, this is (a sign of) true faith. When its \n     delight enters the heart and mixes with them completely, nobody can be\n     displeased with it.\"","reference":"Sahih al-Bukhari 51, Book 2, Hadith 44","grade":"","question #":"question #1","question":"What are the indicators of true faith according to the conversation between Heraclius and Abu Sufyan?","id":"bukhari-2-44"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, 'Both legal and illegal things are \n     evident but in between them there are doubtful (suspicious) things and\n     most of the people have no knowledge about them. So whoever saves \n     himself from these suspicious things saves his religion and his honor.\n     And whoever indulges in these suspicious things is like a shepherd who\n     grazes (his animals) near the Hima (private pasture) of someone else \n     and at any moment he is liable to get in it. (O people!) Beware! Every\n     king has a Hima and the Hima of Allah on the earth is His illegal \n     (forbidden) things. Beware! There is a piece of flesh in the body if \n     it becomes good (reformed) the whole body becomes good but if it gets \n     spoilt the whole body gets spoilt and that is the heart.","reference":"Sahih al-Bukhari 52, Book 2, Hadith 45","grade":"","question #":"question #1","question":"What is the significance of avoiding doubtful matters in Islam?","id":"bukhari-2-45"},{"hadith-eng":"I used to sit with Ibn 'Abbas and he made me sit on his sitting place.\n     He requested me to stay with him in order that he might give me a \n     share from his property. So I stayed with him for two months. Once he \n     told (me) that when the delegation of the tribe of 'Abdul Qais came to\n     the Prophet, the Prophet (ﷺ) asked them, \"Who are the people (i.e. you)? \n     (Or) who are the delegate?\" They replied, \"We are from the tribe of \n     Rabi'a.\" Then the Prophet (ﷺ) said to them, \"Welcome! O people (or O \n     delegation of 'Abdul Qais)! Neither will you have disgrace nor will \n     you regret.\" They said, \"O Allah's Messenger (ﷺ)! We cannot come to you \n     except in the sacred month and there is the infidel tribe of Mudar \n     intervening between you and us. So please order us to do something \n     good (religious deeds) so that we may inform our people whom we have \n     left behind (at home), and that we may enter Paradise (by acting on \n     them).\" Then they asked about drinks (what is legal and what is \n     illegal). The Prophet (ﷺ) ordered them to do four things and forbade them \n     from four things. He ordered them to believe in Allah Alone and asked \n     them, \"Do you know what is meant by believing in Allah Alone?\" They \n     replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) \n     said, \"It means:1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).2. To offer prayers perfectly3. To pay the Zakat (obligatory charity)4. To observe fast during the month of Ramadan.5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's\n     Cause).Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann \n     Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic\n     drinks were prepared) (The Prophet (ﷺ) mentioned the container of wine and\n     he meant the wine itself). The Prophet (ﷺ) further said (to them): \n     \"Memorize them (these instructions) and convey them to the people whom\n     you have left behind.\"","reference":"Sahih al-Bukhari 53, Book 2, Hadith 46","grade":"","question #":"question #1","question":"What are the fundamental beliefs and practices that the Prophet Muhammad (ﷺ) emphasized to the delegation of 'Abdul Qais?","id":"bukhari-2-46"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The reward of deeds depends upon the intention \n     and every person will get the reward according to what he has \n     intended. So whoever emigrated for Allah and His Apostle, then his \n     emigration was for Allah and His Apostle. And whoever emigrated for \n     worldly benefits or for a woman to marry, his emigration was for what \n     he emigrated for.\"","reference":"Sahih al-Bukhari 54, Book 2, Hadith 47","grade":"","question #":"question #1","question":"How does intention affect the reward of one's actions in Islam?","id":"bukhari-2-47"},{"hadith-eng":"The Prophet (ﷺ) said, \"If a man spends on his family (with the intention \n     of having a reward from Allah) sincerely for Allah's sake then it is a\n     (kind of) alms-giving in reward for him.","reference":"Sahih al-Bukhari 55, Book 2, Hadith 48","grade":"","question #":"question #1","question":"What is the significance of intention when spending on one's family in Islam?","id":"bukhari-2-48"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"You will be rewarded for whatever you spend for\n     Allah's sake even if it were a morsel which you put in your wife's \n     mouth.\"","reference":"Sahih al-Bukhari 56, Book 2, Hadith 49","grade":"","question #":"question #1","question":"What is the significance of spending in the way of Allah in Islam?","id":"bukhari-2-49"},{"hadith-eng":"I gave the pledge of allegiance to Allah's Messenger (ﷺ) for the following:1. offer prayers perfectly2. pay the Zakat (obligatory charity)3. and be sincere and true to every Muslim.","reference":"Sahih al-Bukhari 57, Book 2, Hadith 50","grade":"","question #":"question #1","question":"What are the key components of the pledge of allegiance given to the Prophet Muhammad (ﷺ) by his companions?","id":"bukhari-2-50"},{"hadith-eng":"I heard Jarir bin 'Abdullah (Praising Allah). On the day when \n     Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and \n     thanked and praised Allah and said, \"Be afraid of Allah alone Who has \n     none along with Him to be worshipped.(You should) be calm and quiet \n     till the (new) chief comes to you and he will come to you soon. Ask \n     Allah's forgiveness for your (late) chief because he himself loved to \n     forgive others.\" Jarir added, \"Amma badu (now then), I went to the \n     Prophet and said, 'I give my pledge of allegiance to you for Islam.\" \n     The Prophet (ﷺ) conditioned (my pledge) for me to be sincere and true to \n     every Muslim so I gave my pledge to him for this. By the Lord of this \n     mosque! I am sincere and true to you (Muslims). Then Jarir asked for \n     Allah's forgiveness and came down (from the pulpit).","reference":"Sahih al-Bukhari 58, Book 2, Hadith 51","grade":"","question #":"question #1","question":"What is the significance of being sincere and true to fellow Muslims in Islam?","id":"bukhari-2-51"},{"hadith-eng":"Allah's Messenger (ﷺ) said: Islam is based on (the following) five \n     (principles):1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).2. To offer the (compulsory congregational) prayers dutifully and \n     perfectly.3. To pay Zakat (i.e. obligatory charity) .4. To perform Hajj. (i.e. Pilgrimage to Mecca)5. To observe fast during the month of Ramadan.","reference":"Sahih al-Bukhari 8, Book 2, Hadith 1","grade":"","question #":"question #2","question":"How does the testimony of faith serve as a foundation for Islamic belief?","id":"bukhari-2-52"},{"hadith-eng":"The Prophet (ﷺ) said, \"Faith (Belief) consists of more than sixty branches\n     (i.e. parts). And Haya (This term \"Haya\" covers a large number of \n     concepts which are to be taken together; amongst them are self \n     respect, modesty, bashfulness, and scruple, etc.) is a part of \n     faith.\"","reference":"Sahih al-Bukhari 9, Book 2, Hadith 2","grade":"","question #":"question #2","question":"How is the concept of Haya related to one's faith in Islam?","id":"bukhari-2-53"},{"hadith-eng":"The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with\n     his tongue and hands. And a Muhajir (emigrant) is the one who gives up\n     (abandons) all what Allah has forbidden.\"","reference":"Sahih al-Bukhari 10, Book 2, Hadith 3","grade":"","question #":"question #2","question":"How is the concept of a Muhajir defined in terms of abandoning forbidden actions?","id":"bukhari-2-54"},{"hadith-eng":"Some people asked Allah's Messenger (ﷺ), \"Whose Islam is the best? i.e. (Who\n     is a very good Muslim)?\" He replied, \"One who avoids harming the \n     Muslims with his tongue and hands.\"","reference":"Sahih al-Bukhari 11, Book 2, Hadith 4","grade":"","question #":"question #2","question":"How can a Muslim ensure they are not causing harm to others in their community?","id":"bukhari-2-55"},{"hadith-eng":"A man asked the Prophet (ﷺ) , \"What sort of deeds or (what qualities of) \n     Islam are good?\" The Prophet (ﷺ) replied, 'To feed (the poor) and greet \n     those whom you know and those whom you do not Know (See \n     Hadith No. 27).","reference":"Sahih al-Bukhari 12, Book 2, Hadith 5","grade":"","question #":"question #2","question":"How does Islam encourage interaction with both acquaintances and strangers?","id":"bukhari-2-56"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you will have faith till he wishes for his \n     (Muslim) brother what he likes for himself.\"","reference":"Sahih al-Bukhari 13, Book 2, Hadith 6","grade":"","question #":"question #2","question":"How does one's treatment of others reflect their level of faith in Islam?","id":"bukhari-2-57"},{"hadith-eng":"\"Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my life is, none of you \n     will have faith till he loves me more than his father and his \n     children.\"","reference":"Sahih al-Bukhari 14, Book 2, Hadith 7","grade":"","question #":"question #2","question":"How does the love for the Prophet Muhammad (ﷺ) compare to the love for one's family in Islam?","id":"bukhari-2-58"},{"hadith-eng":"The Prophet (ﷺ) said \"None of you will have faith till he loves me more \n     than his father, his children and all mankind.\"","reference":"Sahih al-Bukhari 15, Book 2, Hadith 8","grade":"","question #":"question #2","question":"How does the love for the Prophet Muhammad (ﷺ) compare to the love for one's family and mankind in Islam?","id":"bukhari-2-59"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will have the sweetness (delight) of faith:1. The one to whom Allah and His Apostle becomes dearer than anything \n     else.2. Who loves a person and he loves him only for Allah's sake.3. Who hates to revert to Atheism (disbelief) as he hates to be thrown\n     into the fire.\"","reference":"Sahih al-Bukhari 16, Book 2, Hadith 9","grade":"","question #":"question #2","question":"How does prioritizing love for Allah and His Messenger influence a believer's faith?","id":"bukhari-2-60"},{"hadith-eng":"The Prophet (ﷺ) said, \"Love for the Ansar is a sign of faith and hatred \n     for the Ansar is a sign of hypocrisy.\"","reference":"Sahih al-Bukhari 17, Book 2, Hadith 10","grade":"","question #":"question #2","question":"How is hatred towards the Ansar linked to hypocrisy in Islam?","id":"bukhari-2-61"},{"hadith-eng":"who took part in the battle of Badr and was a Naqib (a person heading \n     a group of six persons), on the night of Al-'Aqaba pledge: Allah's \n     Apostle said while a group of his companions were around him, \"Swear \n     allegiance to me for:1. Not to join anything in worship along with Allah.2. Not to steal.3. Not to commit illegal sexual intercourse.4. Not to kill your children.5. Not to accuse an innocent person (to spread such an accusation \n     among people).6. Not to be disobedient (when ordered) to do good deed.\"The Prophet (ﷺ) added: \"Whoever among you fulfills his pledge will be \n     rewarded by Allah. And whoever indulges in any one of them (except the\n     ascription of partners to Allah) and gets the punishment in this \n     world, that punishment will be an expiation for that sin. And if one \n     indulges in any of them, and Allah conceals his sin, it is up to Him \n     to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit \n     added: \"So we swore allegiance for these.\" (points to Allah's \n     Apostle)","reference":"Sahih al-Bukhari 18, Book 2, Hadith 11","grade":"","question #":"question #2","question":"How does Islam view the consequences of fulfilling or breaking a pledge?","id":"bukhari-2-62"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A time will soon come when the best property of a Muslim will be sheep which he will take on the top of mountains and the places of rainfall (valleys) so as to flee with his religion from afflictions.\"","reference":"Sahih al-Bukhari 19, Book 2, Hadith 12","grade":"","question #":"question #2","question":"How can seclusion be a means of preserving one's faith during times of trial?","id":"bukhari-2-63"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) ordered the Muslims to do something, he used \n     to order them deeds which were easy for them to do, (according to \n     their strength and endurance). They said, \"O Allah's Messenger (ﷺ)! We are not \n     like you. Allah  has forgiven your past and future sins.\" So Allah's \n     Apostle became angry and it was apparent on his face. He said, \"I am \n     the most Allah fearing, and know Allah better than all of you do.\"","reference":"Sahih al-Bukhari 20, Book 2, Hadith 13","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the companions' comments about his forgiveness from Allah?","id":"bukhari-2-64"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will taste the sweetness of faith:1. The one to whom Allah and His Apostle become dearer than anything \n     else.2. Who loves a person and he loves him only for Allah's sake.3. Who hates to revert to disbelief (Atheism) after Allah has brought \n     (saved) him out from it, as he hates to be thrown in fire.\"","reference":"Sahih al-Bukhari 21, Book 2, Hadith 14","grade":"","question #":"question #2","question":"How does loving Allah and His Messenger more than anything else influence a believer's faith?","id":"bukhari-2-65"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the people of Paradise will enter Paradise and\n     the people of Hell will go to Hell, Allah will order those who have \n     had faith equal to the weight of a grain of mustard seed to be taken \n     out from Hell. So they will be taken out but (by then) they will be \n     blackened (charred). Then they will be put in the river of Haya' \n     (rain) or Hayat (life) (the Narrator is in doubt as to which is the \n     right term), and they will revive like a grain that grows near the \n     bank of a flood channel. Don't you see that it comes out yellow and \n     twisted\"","reference":"Sahih al-Bukhari 22, Book 2, Hadith 15","grade":"","question #":"question #2","question":"How does the concept of purification and revival relate to the afterlife in Islamic belief?","id":"bukhari-2-66"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"While I was sleeping I saw (in a dream) some \n     people wearing shirts of which some were reaching up to the breasts \n     only while others were even shorter than that. Umar bin Al-Khattab was\n     shown wearing a shirt that he was dragging.\" The people asked, \"How \n     did you interpret it? (What is its interpretation) O Allah's Messenger (ﷺ)?\"\n     He (the Prophet (ﷺ) ) replied, \"It is the Religion.\"","reference":"Sahih al-Bukhari 23, Book 2, Hadith 16","grade":"","question #":"question #2","question":"How can clothing be symbolically interpreted in Islamic teachings?","id":"bukhari-2-67"},{"hadith-eng":"Once Allah's Messenger (ﷺ) passed by an Ansari (man) who was admonishing\n     his brother regarding Haya'. On that Allah's Messenger (ﷺ) said, \"Leave him \n     as Haya' is a part of faith.\" (SeeHadith 9)","reference":"Sahih al-Bukhari 24, Book 2, Hadith 17","grade":"","question #":"question #2","question":"How is Haya' related to one's faith in Islamic teachings?","id":"bukhari-2-68"},{"hadith-eng":"Allah's Messenger (ﷺ) said: \"I have been ordered (by Allah) to fight against\n     the people until they testify that none has the right to be worshipped\n     but Allah and that Muhammad is Allah's Messenger (ﷺ), and offer the prayers \n     perfectly and give the obligatory charity, so if they perform that, \n     then they save their lives and property from me except for Islamic laws\n     and then their reckoning (accounts) will be done by Allah.\"","reference":"Sahih al-Bukhari 25, Book 2, Hadith 18","grade":"","question #":"question #2","question":"What is the significance of testifying to the oneness of Allah and the prophethood of Muhammad in Islam?","id":"bukhari-2-69"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked, \"What is the best deed?\" He replied, \"To \n     believe in Allah and His Apostle (Muhammad). The questioner then \n     asked, \"What is the next (in goodness)? He replied, \"To participate in\n     Jihad (religious fighting) in Allah's Cause.\" The questioner again \n     asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj \n     (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is \n     performed with the intention of seeking Allah's pleasure only and not \n     to show off and without committing a sin and in accordance with the \n     traditions of the Prophet).\"","reference":"Sahih al-Bukhari 26, Book 2, Hadith 19","grade":"","question #":"question #2","question":"How is the concept of Jihad understood in terms of its significance and purpose in Islam?","id":"bukhari-2-70"},{"hadith-eng":"Allah's Messenger (ﷺ) distributed (Zakat) amongst (a group of) people while \n     I was sitting there but Allah's Messenger (ﷺ) left a man whom I thought the \n     best of the lot. I asked, \"O Allah's Messenger (ﷺ)! Why have you left that \n     person? By Allah I regard him as a faithful believer.\" The Prophet (ﷺ) \n     commented: \"Or merely a Muslim.\" I remained quiet for a while, but \n     could not help repeating my question because of what I knew about him.\n     And then asked Allah's Messenger (ﷺ), \"Why have you left so and so? By \n     Allah! He is a faithful believer.\" The Prophet (ﷺ) again said, \"Or merely \n     a Muslim.\" And I could not help repeating my question because of what \n     I knew about him. Then the Prophet (ﷺ) said, \"O Sa'd! I give to a person \n     while another is dearer to me, for fear that he might be thrown on his\n     face in the Fire by Allah.\"","reference":"Sahih al-Bukhari 27, Book 2, Hadith 20","grade":"","question #":"question #2","question":"How does the Prophet (ﷺ) differentiate between a faithful believer and a Muslim in this context?","id":"bukhari-2-71"},{"hadith-eng":"A person asked Allah's Messenger (ﷺ) . \"What (sort of) deeds in or (what \n     qualities of) Islam are good?\" He replied, \"To feed (the poor) and \n     greet those whom you know and those whom you don't know.\"","reference":"Sahih al-Bukhari 28, Book 2, Hadith 21","grade":"","question #":"question #2","question":"How does Islam emphasize the importance of feeding the poor and greeting others?","id":"bukhari-2-72"},{"hadith-eng":"The Prophet (ﷺ) said: \"I was shown the Hell-fire and that the majority of \n     its dwellers were women who were ungrateful.\" It was asked, \"Do they \n     disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied, \n     \"They are ungrateful to their husbands and are ungrateful for the \n     favors and the good (charitable deeds) done to them. If you have \n     always been good (benevolent) to one of them and then she sees \n     something in you (not of her liking), she will say, 'I have never \n     received any good from you.\"","reference":"Sahih al-Bukhari 29, Book 2, Hadith 22","grade":"","question #":"question #2","question":"How does ingratitude towards one's spouse affect relationships in Islam?","id":"bukhari-2-73"},{"hadith-eng":"At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave, \n     too, was wearing a similar one. I asked about the reason for it. He \n     replied, \"I abused a person by calling his mother with bad names.\" The\n     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his \n     mother with bad names You still have some characteristics of \n     ignorance. Your slaves are your brothers and Allah has put them under \n     your command. So whoever has a brother under his command should feed \n     him of what he eats and dress him of what he wears. Do not ask them \n     (slaves) to do things beyond their capacity (power) and if you do so, \n     then help them.' \"","reference":"Sahih al-Bukhari 30, Book 2, Hadith 23","grade":"","question #":"question #2","question":"How does Islam address the issue of ignorance and its characteristics in personal behavior?","id":"bukhari-2-74"},{"hadith-eng":"While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met\n     me and asked, \"Where are you going?\" I replied, \"I am going to help \n     that person.\" He said, \"Go back for I have heard Allah's Messenger (ﷺ) \n     saying, 'When two Muslims fight (meet) each other with their swords, \n     both the murderer as well as the murdered will go to the Hell-fire.' I\n     said, 'O Allah's Messenger (ﷺ)! It is all right for the murderer but what \n     about the murdered one?' Allah's Messenger (ﷺ) replied, \"He surely had the \n     intention to kill his companion.\"","reference":"Sahih al-Bukhari 31, Book 2, Hadith 24","grade":"","question #":"question #2","question":"Why is the intention behind an action significant in determining its moral and spiritual consequences in Islam?","id":"bukhari-2-75"},{"hadith-eng":"When the following Verse was revealed: \"It is those who believe and \n     confuse not their belief with wrong (worshipping others besides \n     Allah.)\" (6:83), the companions of Allah's Messenger (ﷺ) asked, \"Who is \n     amongst us who had not done injustice (wrong)?\" Allah revealed: \"No \n     doubt, joining others in worship with Allah is a great injustice \n     (wrong) indeed.\" (31.13)","reference":"Sahih al-Bukhari 32, Book 2, Hadith 25","grade":"","question #":"question #2","question":"How did the companions of the Prophet Muhammad (ﷺ) react to the revelation about belief and injustice?","id":"bukhari-2-76"},{"hadith-eng":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three:1. Whenever he speaks, he tells a lie.2. Whenever he promises, he always breaks it (his promise ).3. If you trust him, he proves to be dishonest. (If you keep something\n     as a trust with him, he will not return it.)\"","reference":"Sahih al-Bukhari 33, Book 2, Hadith 26","grade":"","question #":"question #2","question":"How does dishonesty manifest in the behavior of a hypocrite?","id":"bukhari-2-77"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has the following four (characteristics) \n     will be a pure hypocrite and whoever has one of the following four \n     characteristics will have one characteristic of hypocrisy unless and \n     until he gives it up.1. Whenever he is entrusted, he betrays.2. Whenever he speaks, he tells a lie.3. Whenever he makes a covenant, he proves treacherous.4. Whenever he quarrels, he behaves in a very imprudent, evil and \n     insulting manner.\"","reference":"Sahih al-Bukhari 34, Book 2, Hadith 27","grade":"","question #":"question #2","question":"How can one identify traits of hypocrisy in their behavior and work towards eliminating them?","id":"bukhari-2-78"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever establishes the prayers on the night of\n     Qadr out of sincere faith and hoping to attain Allah's rewards (not to\n     show off) then all his past sins will be forgiven.\"","reference":"Sahih al-Bukhari 35, Book 2, Hadith 28","grade":"","question #":"question #2","question":"How does sincerity and the intention of seeking Allah's rewards impact the forgiveness of past sins?","id":"bukhari-2-79"},{"hadith-eng":"The Prophet (ﷺ) said, \"The person who participates in (Holy battles) in \n     Allah's cause and nothing compels him to do so except belief in Allah \n     and His Apostles, will be recompensed by Allah either with a reward, \n     or booty (if he survives) or will be admitted to Paradise (if he is \n     killed in the battle as a martyr). Had I not found it difficult for my\n     followers, then I would not remain behind any sariya going for Jihad \n     and I would have loved to be martyred in Allah's cause and then made \n     alive, and then martyred and then made alive, and then again martyred \n     in His cause.\"","reference":"Sahih al-Bukhari 36, Book 2, Hadith 29","grade":"","question #":"question #2","question":"How does the concept of martyrdom in Islam relate to the desire for continuous sacrifice in Allah's cause?","id":"bukhari-2-80"},{"hadith-eng":"Allah's Messenger (ﷺ) said: \"Whoever establishes prayers during the nights \n     of Ramadan faithfully out of sincere faith and hoping to attain \n     Allah's rewards (not for showing off), all his past sins will be \n     forgiven.\"","reference":"Sahih al-Bukhari 37, Book 2, Hadith 30","grade":"","question #":"question #2","question":"How does sincerity in worship during Ramadan affect the forgiveness of past sins?","id":"bukhari-2-81"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever observes fasts during the month of \n     Ramadan out of sincere faith, and hoping to attain Allah's rewards, \n     then all his past sins will be forgiven.\"","reference":"Sahih al-Bukhari 38, Book 2, Hadith 31","grade":"","question #":"question #2","question":"How does fasting in Ramadan contribute to the forgiveness of past sins?","id":"bukhari-2-82"},{"hadith-eng":"The Prophet (ﷺ) said, \"Religion is very easy and whoever overburdens \n     himself in his religion will not be able to continue in that way. So \n     you should not be extremists, but try to be near to perfection and \n     receive the good tidings that you will be rewarded; and gain strength \n     by worshipping in the mornings, the afternoons, and during the last hours of the nights.\" (See Fath-ul-Bari, Page \n     102, Vol 1).","reference":"Sahih al-Bukhari 39, Book 2, Hadith 32","grade":"","question #":"question #2","question":"How can one maintain balance and avoid extremism in religious practices?","id":"bukhari-2-83"},{"hadith-eng":"When the Prophet (ﷺ) came to Medina, he stayed first with his grandfathers\n     or maternal uncles from Ansar. He offered his prayers facing \n     Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he \n     wished that he could pray facing the Ka'ba (at Mecca). The first \n     prayer which he offered facing the Ka'ba was the 'Asr prayer in the \n     company of some people. Then one of those who had offered that prayer \n     with him came out and passed by some people in a mosque who were \n     bowing during their prayers (facing Jerusalem). He said addressing \n     them, \"By Allah, I testify that I have prayed with Allah's Messenger (ﷺ) \n     facing Mecca (Ka'ba).' Hearing that, those people changed their \n     direction towards the Ka'ba immediately. Jews and the people of the \n     scriptures used to be pleased to see the Prophet (ﷺ) facing Jerusalem in \n     prayers but when he changed his direction towards the Ka'ba, during \n     the prayers, they disapproved of it.Al-Bara' added, \"Before we changed our direction towards the Ka'ba \n     (Mecca) in prayers, some Muslims had died or had been killed and we \n     did not know what to say about them (regarding their prayers.) Allah \n     then revealed: And Allah would never make your faith (prayers) to be \n     lost (i.e. the prayers of those Muslims were valid).' \" (2:143).","reference":"Sahih al-Bukhari 40, Book 2, Hadith 33","grade":"","question #":"question #2","question":"How did the change in prayer direction affect the relationship between Muslims and the People of the Book?","id":"bukhari-2-84"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"","reference":"Sahih al-Bukhari 41, Book 2, Hadith 34","grade":"","question #":"question #2","question":"How does the concept of reward and punishment work in Islam for good and evil deeds?","id":"bukhari-2-85"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If any one of you improve (follows strictly) \n     his Islamic religion then his good deeds will be rewarded ten times to\n     seven hundred times for each good deed and a bad deed will be recorded\n     as it is.\"","reference":"Sahih al-Bukhari 42, Book 2, Hadith 35","grade":"","question #":"question #2","question":"What is the significance of improving one's adherence to Islamic teachings in terms of rewards?","id":"bukhari-2-86"},{"hadith-eng":"Once the Prophet (ﷺ) came while a woman was sitting with me. He said, \"Who\n     is she?\" I replied, \"She is so and so,\" and told him about her \n     (excessive) praying. He said disapprovingly, \"Do (good) deeds which is\n     within your capacity (without being overtaxed) as Allah does not get \n     tired (of giving rewards) but (surely) you will get tired and the best\n     deed (act of Worship) in the sight of Allah is that which is done \n     regularly.\"","reference":"Sahih al-Bukhari 43, Book 2, Hadith 36","grade":"","question #":"question #2","question":"Why is it important to perform good deeds within one's capacity in Islam?","id":"bukhari-2-87"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever said \"None has the right to be worshipped \n     but Allah and has in his heart good (faith) equal to the weight of a \n     barley grain will be taken out of Hell. And whoever said: \"None has \n     the right to be worshipped but Allah and has in his heart good (faith)\n     equal to the weight of a wheat grain will be taken out of Hell. And \n     whoever said, \"None has the right to be worshipped but Allah and has \n     in his heart good (faith) equal to the weight of an atom will be taken\n     out of Hell.\"","reference":"Sahih al-Bukhari 44, Book 2, Hadith 37","grade":"","question #":"question #2","question":"How does the weight of faith in one's heart affect their fate in the afterlife according to Islamic teachings?","id":"bukhari-2-88"},{"hadith-eng":"Once a Jew said to me, \"O the chief of believers! There is a verse in \n     your Holy Book Which is read by all of you (Muslims), and had it been \n     revealed to us, we would have taken that day (on which it was revealed\n     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that \n     verse?\" The Jew replied, \"This day I have perfected your religion For \n     you, completed My favor upon you, And have chosen for you Islam as \n     your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where \n     this verse was revealed to the Prophet. It was Friday and the Prophet (ﷺ) \n     was standing at 'Arafat (i.e. the Day of Hajj)\"","reference":"Sahih al-Bukhari 45, Book 2, Hadith 38","grade":"","question #":"question #2","question":"How do Muslims commemorate the revelation of significant verses in the Quran?","id":"bukhari-2-89"},{"hadith-eng":"A man from Najd with unkempt hair came to Allah's Messenger (ﷺ) and we heard\r\n     his loud voice but could not understand what he was saying, till he \r\n     came near and then we came to know that he was asking about Islam. \r\n     Allah's Messenger (ﷺ) said, \"You have to offer prayers perfectly five times \r\n     in a day and night (24 hours).\" The man asked, \"Is there any more \r\n     (praying)?\" Allah's Messenger (ﷺ) replied, \"No, but if you want to offer the\r\n     Nawafil prayers (you can).\" Allah's Messenger (ﷺ) further said to him: \"You \r\n     have to observe fasts during the month of Ramadan.\" The man asked, \r\n     \"Is there any more fasting?\" Allah's Messenger (ﷺ) replied, \"No, but if you \r\n     want to observe the Nawafil fasts (you can.)\" Then Allah's Messenger (ﷺ) \r\n     further said to him, \"You have to pay the Zakat (obligatory charity).\"\r\n     The man asked, \"Is there any thing other than the Zakat for me to \r\n     pay?\" Allah's Messenger (ﷺ) replied, \"No, unless you want to give alms of \r\n     your own.\" And then that man retreated saying, \"By Allah! I will \r\n     neither do less nor more than this.\" Allah's Messenger (ﷺ) said, \"If what he\r\n     said is true, then he will be successful (i.e. he will be granted \r\n     Paradise).\"","reference":"Sahih al-Bukhari 46, Book 2, Hadith 39","grade":"","question #":"question #2","question":"How does voluntary worship, such as Nawafil prayers and fasts, complement the obligatory acts in Islam?","id":"bukhari-2-90"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(A believer) who accompanies the funeral \n     procession of a Muslim out of sincere faith and hoping to attain \n     Allah's reward and remains with it till the funeral prayer is offered \n     and the burial ceremonies are over, he will return with a reward of \n     two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who \n     offers the funeral prayer only and returns before the burial, will \n     return with the reward of one Qirat only.\"","reference":"Sahih al-Bukhari 47, Book 2, Hadith 40","grade":"","question #":"question #2","question":"How does the concept of Qirat relate to the rewards for attending a funeral?","id":"bukhari-2-91"},{"hadith-eng":"The Prophet (ﷺ) said, \"Abusing a Muslim is Fusuq (an evil doing) and \n     killing him is Kufr (disbelief).\"","reference":"Sahih al-Bukhari 48, Book 2, Hadith 41","grade":"","question #":"question #2","question":"How is the act of killing a Muslim viewed in terms of faith and belief in Islam?","id":"bukhari-2-92"},{"hadith-eng":"\"Allah's Messenger (ﷺ) went out to inform the people about the (date of the)\n     night of decree (Al-Qadr) but there happened a quarrel between two \n     Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about (the \n     date of) the night of Al-Qadr, but as so and so and so and so \n     quarrelled, its knowledge was taken away (I forgot it) and maybe it \n     was better for you. Now look for it in the 7th, the 9th and the 5th \n     (of the last 10 nights of the month of Ramadan).\"","reference":"Sahih al-Bukhari 49, Book 2, Hadith 42","grade":"","question #":"question #2","question":"Why is the Night of Decree considered significant in the last ten nights of Ramadan?","id":"bukhari-2-93"},{"hadith-eng":"One day while the Prophet (ﷺ) was sitting in the company of some people, \n     (The angel) Gabriel came and asked, \"What is faith?\" Allah's Messenger (ﷺ) \n     replied, 'Faith is to believe in Allah, His angels, (the) meeting with\n     Him, His Apostles, and to believe in Resurrection.\" Then he further \n     asked, \"What is Islam?\" Allah's Messenger (ﷺ) replied, \"To worship Allah \n     Alone and none else, to offer prayers perfectly to pay the compulsory \n     charity (Zakat) and to observe fasts during the month of Ramadan.\"  \n     Then he further asked, \"What is Ihsan (perfection)?\" Allah's Messenger (ﷺ) \n     replied, \"To worship Allah as if you see Him, and if you cannot \n     achieve this state of devotion then you must consider that He is \n     looking at you.\" Then he further asked, \"When will the Hour be \n     established?\" Allah's Messenger (ﷺ) replied, \"The answerer has no better \n     knowledge than the questioner. But I will inform you about its \n     portents.1. When a slave (lady) gives birth to her master.2. When the shepherds of black camels start boasting and competing \n     with others in the construction of higher buildings. And the Hour is \n     one of five things which nobody knows except Allah.The Prophet (ﷺ) then recited: \"Verily, with Allah (Alone) is the knowledge\n     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet (ﷺ) \n     asked his companions to call him back, but they could not see him. \n     Then the Prophet (ﷺ) said, \"That was Gabriel who came to teach the people \n     their religion.\" Abu 'Abdullah said: He (the Prophet) considered all \n     that as a part of faith.","reference":"Sahih al-Bukhari 50, Book 2, Hadith 43","grade":"","question #":"question #2","question":"What are the essential practices that define Islam according to the teachings of the Prophet?","id":"bukhari-2-94"},{"hadith-eng":"I was informed by Abu Sufyan that Heraclius said to him, \"I asked you \n     whether they (followers of Muhammad) were increasing or decreasing. \n     You replied that they were increasing. And in fact, this is the way of\n     true Faith till it is complete in all respects. I further asked you \n     whether there was anybody, who, after embracing his (the Prophets) \n     religion (Islam) became displeased and discarded it. You replied in \n     the negative, and in fact, this is (a sign of) true faith. When its \n     delight enters the heart and mixes with them completely, nobody can be\n     displeased with it.\"","reference":"Sahih al-Bukhari 51, Book 2, Hadith 44","grade":"","question #":"question #2","question":"How does the increase in followers relate to the authenticity of a faith?","id":"bukhari-2-95"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, 'Both legal and illegal things are \n     evident but in between them there are doubtful (suspicious) things and\n     most of the people have no knowledge about them. So whoever saves \n     himself from these suspicious things saves his religion and his honor.\n     And whoever indulges in these suspicious things is like a shepherd who\n     grazes (his animals) near the Hima (private pasture) of someone else \n     and at any moment he is liable to get in it. (O people!) Beware! Every\n     king has a Hima and the Hima of Allah on the earth is His illegal \n     (forbidden) things. Beware! There is a piece of flesh in the body if \n     it becomes good (reformed) the whole body becomes good but if it gets \n     spoilt the whole body gets spoilt and that is the heart.","reference":"Sahih al-Bukhari 52, Book 2, Hadith 45","grade":"","question #":"question #2","question":"How does the condition of the heart affect a person's overall character and actions?","id":"bukhari-2-96"},{"hadith-eng":"I used to sit with Ibn 'Abbas and he made me sit on his sitting place.\n     He requested me to stay with him in order that he might give me a \n     share from his property. So I stayed with him for two months. Once he \n     told (me) that when the delegation of the tribe of 'Abdul Qais came to\n     the Prophet, the Prophet (ﷺ) asked them, \"Who are the people (i.e. you)? \n     (Or) who are the delegate?\" They replied, \"We are from the tribe of \n     Rabi'a.\" Then the Prophet (ﷺ) said to them, \"Welcome! O people (or O \n     delegation of 'Abdul Qais)! Neither will you have disgrace nor will \n     you regret.\" They said, \"O Allah's Messenger (ﷺ)! We cannot come to you \n     except in the sacred month and there is the infidel tribe of Mudar \n     intervening between you and us. So please order us to do something \n     good (religious deeds) so that we may inform our people whom we have \n     left behind (at home), and that we may enter Paradise (by acting on \n     them).\" Then they asked about drinks (what is legal and what is \n     illegal). The Prophet (ﷺ) ordered them to do four things and forbade them \n     from four things. He ordered them to believe in Allah Alone and asked \n     them, \"Do you know what is meant by believing in Allah Alone?\" They \n     replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) \n     said, \"It means:1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).2. To offer prayers perfectly3. To pay the Zakat (obligatory charity)4. To observe fast during the month of Ramadan.5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's\n     Cause).Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann \n     Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic\n     drinks were prepared) (The Prophet (ﷺ) mentioned the container of wine and\n     he meant the wine itself). The Prophet (ﷺ) further said (to them): \n     \"Memorize them (these instructions) and convey them to the people whom\n     you have left behind.\"","reference":"Sahih al-Bukhari 53, Book 2, Hadith 46","grade":"","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) welcome the delegation of 'Abdul Qais and assure them of no disgrace or regret?","id":"bukhari-2-97"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The reward of deeds depends upon the intention \n     and every person will get the reward according to what he has \n     intended. So whoever emigrated for Allah and His Apostle, then his \n     emigration was for Allah and His Apostle. And whoever emigrated for \n     worldly benefits or for a woman to marry, his emigration was for what \n     he emigrated for.\"","reference":"Sahih al-Bukhari 54, Book 2, Hadith 47","grade":"","question #":"question #2","question":"What are the implications of having different intentions for the same action in Islamic teachings?","id":"bukhari-2-98"},{"hadith-eng":"The Prophet (ﷺ) said, \"If a man spends on his family (with the intention \n     of having a reward from Allah) sincerely for Allah's sake then it is a\n     (kind of) alms-giving in reward for him.","reference":"Sahih al-Bukhari 55, Book 2, Hadith 48","grade":"","question #":"question #2","question":"How can spending on family be considered a form of charity in Islamic teachings?","id":"bukhari-2-99"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"You will be rewarded for whatever you spend for\n     Allah's sake even if it were a morsel which you put in your wife's \n     mouth.\"","reference":"Sahih al-Bukhari 56, Book 2, Hadith 49","grade":"","question #":"question #2","question":"How does Islam view the act of providing for one's family as a form of charity?","id":"bukhari-2-100"},{"hadith-eng":"I gave the pledge of allegiance to Allah's Messenger (ﷺ) for the following:1. offer prayers perfectly2. pay the Zakat (obligatory charity)3. and be sincere and true to every Muslim.","reference":"Sahih al-Bukhari 57, Book 2, Hadith 50","grade":"","question #":"question #2","question":"How does sincerity and truthfulness towards fellow Muslims relate to the teachings of Islam?","id":"bukhari-2-101"},{"hadith-eng":"I heard Jarir bin 'Abdullah (Praising Allah). On the day when \n     Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and \n     thanked and praised Allah and said, \"Be afraid of Allah alone Who has \n     none along with Him to be worshipped.(You should) be calm and quiet \n     till the (new) chief comes to you and he will come to you soon. Ask \n     Allah's forgiveness for your (late) chief because he himself loved to \n     forgive others.\" Jarir added, \"Amma badu (now then), I went to the \n     Prophet and said, 'I give my pledge of allegiance to you for Islam.\" \n     The Prophet (ﷺ) conditioned (my pledge) for me to be sincere and true to \n     every Muslim so I gave my pledge to him for this. By the Lord of this \n     mosque! I am sincere and true to you (Muslims). Then Jarir asked for \n     Allah's forgiveness and came down (from the pulpit).","reference":"Sahih al-Bukhari 58, Book 2, Hadith 51","grade":"","question #":"question #2","question":"How should Muslims behave during the transition of leadership according to Islamic teachings?","id":"bukhari-2-102"},{"hadith-eng":"Allah's Messenger (ﷺ) said: Islam is based on (the following) five \n     (principles):1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).2. To offer the (compulsory congregational) prayers dutifully and \n     perfectly.3. To pay Zakat (i.e. obligatory charity) .4. To perform Hajj. (i.e. Pilgrimage to Mecca)5. To observe fast during the month of Ramadan.","reference":"Sahih al-Bukhari 8, Book 2, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of performing Hajj in the life of a Muslim?","id":"bukhari-2-103"},{"hadith-eng":"The Prophet (ﷺ) said, \"Faith (Belief) consists of more than sixty branches\n     (i.e. parts). And Haya (This term \"Haya\" covers a large number of \n     concepts which are to be taken together; amongst them are self \n     respect, modesty, bashfulness, and scruple, etc.) is a part of \n     faith.\"","reference":"Sahih al-Bukhari 9, Book 2, Hadith 2","grade":"","question #":"question #3","question":"Why is modesty considered an important aspect of faith in Islamic teachings?","id":"bukhari-2-104"},{"hadith-eng":"The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with\n     his tongue and hands. And a Muhajir (emigrant) is the one who gives up\n     (abandons) all what Allah has forbidden.\"","reference":"Sahih al-Bukhari 10, Book 2, Hadith 3","grade":"","question #":"question #3","question":"What actions should a Muslim avoid to prevent harm to fellow Muslims?","id":"bukhari-2-105"},{"hadith-eng":"Some people asked Allah's Messenger (ﷺ), \"Whose Islam is the best? i.e. (Who\n     is a very good Muslim)?\" He replied, \"One who avoids harming the \n     Muslims with his tongue and hands.\"","reference":"Sahih al-Bukhari 11, Book 2, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of controlling one's tongue and actions in Islam?","id":"bukhari-2-106"},{"hadith-eng":"A man asked the Prophet (ﷺ) , \"What sort of deeds or (what qualities of) \n     Islam are good?\" The Prophet (ﷺ) replied, 'To feed (the poor) and greet \n     those whom you know and those whom you do not Know (See \n     Hadith No. 27).","reference":"Sahih al-Bukhari 12, Book 2, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of feeding the poor in Islamic teachings?","id":"bukhari-2-107"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you will have faith till he wishes for his \n     (Muslim) brother what he likes for himself.\"","reference":"Sahih al-Bukhari 13, Book 2, Hadith 6","grade":"","question #":"question #3","question":"What is the significance of empathy and selflessness in the Islamic faith?","id":"bukhari-2-108"},{"hadith-eng":"\"Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my life is, none of you \n     will have faith till he loves me more than his father and his \n     children.\"","reference":"Sahih al-Bukhari 14, Book 2, Hadith 7","grade":"","question #":"question #3","question":"What is the relationship between faith and love for the Prophet Muhammad (ﷺ) in Islamic teachings?","id":"bukhari-2-109"},{"hadith-eng":"The Prophet (ﷺ) said \"None of you will have faith till he loves me more \n     than his father, his children and all mankind.\"","reference":"Sahih al-Bukhari 15, Book 2, Hadith 8","grade":"","question #":"question #3","question":"What role does love for the Prophet Muhammad (ﷺ) play in the completion of a Muslim's faith?","id":"bukhari-2-110"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will have the sweetness (delight) of faith:1. The one to whom Allah and His Apostle becomes dearer than anything \n     else.2. Who loves a person and he loves him only for Allah's sake.3. Who hates to revert to Atheism (disbelief) as he hates to be thrown\n     into the fire.\"","reference":"Sahih al-Bukhari 16, Book 2, Hadith 9","grade":"","question #":"question #3","question":"Why is it important to love others for the sake of Allah in Islamic teachings?","id":"bukhari-2-111"},{"hadith-eng":"The Prophet (ﷺ) said, \"Love for the Ansar is a sign of faith and hatred \n     for the Ansar is a sign of hypocrisy.\"","reference":"Sahih al-Bukhari 17, Book 2, Hadith 10","grade":"","question #":"question #3","question":"What does the relationship between love for the Ansar and faith indicate about the values in Islam?","id":"bukhari-2-112"},{"hadith-eng":"who took part in the battle of Badr and was a Naqib (a person heading \n     a group of six persons), on the night of Al-'Aqaba pledge: Allah's \n     Apostle said while a group of his companions were around him, \"Swear \n     allegiance to me for:1. Not to join anything in worship along with Allah.2. Not to steal.3. Not to commit illegal sexual intercourse.4. Not to kill your children.5. Not to accuse an innocent person (to spread such an accusation \n     among people).6. Not to be disobedient (when ordered) to do good deed.\"The Prophet (ﷺ) added: \"Whoever among you fulfills his pledge will be \n     rewarded by Allah. And whoever indulges in any one of them (except the\n     ascription of partners to Allah) and gets the punishment in this \n     world, that punishment will be an expiation for that sin. And if one \n     indulges in any of them, and Allah conceals his sin, it is up to Him \n     to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit \n     added: \"So we swore allegiance for these.\" (points to Allah's \n     Apostle)","reference":"Sahih al-Bukhari 18, Book 2, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of Allah's discretion in forgiving or punishing sins that are concealed in this world?","id":"bukhari-2-113"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A time will soon come when the best property of a Muslim will be sheep which he will take on the top of mountains and the places of rainfall (valleys) so as to flee with his religion from afflictions.\"","reference":"Sahih al-Bukhari 19, Book 2, Hadith 12","grade":"","question #":"question #3","question":"What are the potential benefits of living in solitude with nature for a believer facing religious challenges?","id":"bukhari-2-114"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) ordered the Muslims to do something, he used \n     to order them deeds which were easy for them to do, (according to \n     their strength and endurance). They said, \"O Allah's Messenger (ﷺ)! We are not \n     like you. Allah  has forgiven your past and future sins.\" So Allah's \n     Apostle became angry and it was apparent on his face. He said, \"I am \n     the most Allah fearing, and know Allah better than all of you do.\"","reference":"Sahih al-Bukhari 20, Book 2, Hadith 13","grade":"","question #":"question #3","question":"What does this narration teach about the Prophet Muhammad's (ﷺ) knowledge and fear of Allah compared to others?","id":"bukhari-2-115"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will taste the sweetness of faith:1. The one to whom Allah and His Apostle become dearer than anything \n     else.2. Who loves a person and he loves him only for Allah's sake.3. Who hates to revert to disbelief (Atheism) after Allah has brought \n     (saved) him out from it, as he hates to be thrown in fire.\"","reference":"Sahih al-Bukhari 21, Book 2, Hadith 14","grade":"","question #":"question #3","question":"Why is it important for a believer to hate reverting to disbelief after being saved from it?","id":"bukhari-2-116"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the people of Paradise will enter Paradise and\n     the people of Hell will go to Hell, Allah will order those who have \n     had faith equal to the weight of a grain of mustard seed to be taken \n     out from Hell. So they will be taken out but (by then) they will be \n     blackened (charred). Then they will be put in the river of Haya' \n     (rain) or Hayat (life) (the Narrator is in doubt as to which is the \n     right term), and they will revive like a grain that grows near the \n     bank of a flood channel. Don't you see that it comes out yellow and \n     twisted\"","reference":"Sahih al-Bukhari 22, Book 2, Hadith 15","grade":"","question #":"question #3","question":"What does the imagery of a grain growing near a flood channel symbolize in the context of faith and redemption?","id":"bukhari-2-117"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"While I was sleeping I saw (in a dream) some \n     people wearing shirts of which some were reaching up to the breasts \n     only while others were even shorter than that. Umar bin Al-Khattab was\n     shown wearing a shirt that he was dragging.\" The people asked, \"How \n     did you interpret it? (What is its interpretation) O Allah's Messenger (ﷺ)?\"\n     He (the Prophet (ﷺ) ) replied, \"It is the Religion.\"","reference":"Sahih al-Bukhari 23, Book 2, Hadith 16","grade":"","question #":"question #3","question":"What does the length of a shirt symbolize in the context of religious understanding?","id":"bukhari-2-118"},{"hadith-eng":"Once Allah's Messenger (ﷺ) passed by an Ansari (man) who was admonishing\n     his brother regarding Haya'. On that Allah's Messenger (ﷺ) said, \"Leave him \n     as Haya' is a part of faith.\" (SeeHadith 9)","reference":"Sahih al-Bukhari 24, Book 2, Hadith 17","grade":"","question #":"question #3","question":"Why might someone be advised to leave a person who is practicing Haya' alone?","id":"bukhari-2-119"},{"hadith-eng":"Allah's Messenger (ﷺ) said: \"I have been ordered (by Allah) to fight against\n     the people until they testify that none has the right to be worshipped\n     but Allah and that Muhammad is Allah's Messenger (ﷺ), and offer the prayers \n     perfectly and give the obligatory charity, so if they perform that, \n     then they save their lives and property from me except for Islamic laws\n     and then their reckoning (accounts) will be done by Allah.\"","reference":"Sahih al-Bukhari 25, Book 2, Hadith 18","grade":"","question #":"question #3","question":"How does the performance of prayers and giving of obligatory charity relate to one's accountability before Allah?","id":"bukhari-2-120"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked, \"What is the best deed?\" He replied, \"To \n     believe in Allah and His Apostle (Muhammad). The questioner then \n     asked, \"What is the next (in goodness)? He replied, \"To participate in\n     Jihad (religious fighting) in Allah's Cause.\" The questioner again \n     asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj \n     (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is \n     performed with the intention of seeking Allah's pleasure only and not \n     to show off and without committing a sin and in accordance with the \n     traditions of the Prophet).\"","reference":"Sahih al-Bukhari 26, Book 2, Hadith 19","grade":"","question #":"question #3","question":"What are the conditions for a Hajj to be considered 'Mabrur' and accepted by Allah?","id":"bukhari-2-121"},{"hadith-eng":"Allah's Messenger (ﷺ) distributed (Zakat) amongst (a group of) people while \n     I was sitting there but Allah's Messenger (ﷺ) left a man whom I thought the \n     best of the lot. I asked, \"O Allah's Messenger (ﷺ)! Why have you left that \n     person? By Allah I regard him as a faithful believer.\" The Prophet (ﷺ) \n     commented: \"Or merely a Muslim.\" I remained quiet for a while, but \n     could not help repeating my question because of what I knew about him.\n     And then asked Allah's Messenger (ﷺ), \"Why have you left so and so? By \n     Allah! He is a faithful believer.\" The Prophet (ﷺ) again said, \"Or merely \n     a Muslim.\" And I could not help repeating my question because of what \n     I knew about him. Then the Prophet (ﷺ) said, \"O Sa'd! I give to a person \n     while another is dearer to me, for fear that he might be thrown on his\n     face in the Fire by Allah.\"","reference":"Sahih al-Bukhari 27, Book 2, Hadith 20","grade":"","question #":"question #3","question":"What concern did the Prophet (ﷺ) express about certain individuals potentially facing punishment in the Hereafter?","id":"bukhari-2-122"},{"hadith-eng":"A person asked Allah's Messenger (ﷺ) . \"What (sort of) deeds in or (what \n     qualities of) Islam are good?\" He replied, \"To feed (the poor) and \n     greet those whom you know and those whom you don't know.\"","reference":"Sahih al-Bukhari 28, Book 2, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of greeting both acquaintances and strangers in Islamic teachings?","id":"bukhari-2-123"},{"hadith-eng":"The Prophet (ﷺ) said: \"I was shown the Hell-fire and that the majority of \n     its dwellers were women who were ungrateful.\" It was asked, \"Do they \n     disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied, \n     \"They are ungrateful to their husbands and are ungrateful for the \n     favors and the good (charitable deeds) done to them. If you have \n     always been good (benevolent) to one of them and then she sees \n     something in you (not of her liking), she will say, 'I have never \n     received any good from you.\"","reference":"Sahih al-Bukhari 29, Book 2, Hadith 22","grade":"","question #":"question #3","question":"What is the significance of gratitude in maintaining a harmonious marital relationship in Islam?","id":"bukhari-2-124"},{"hadith-eng":"At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave, \n     too, was wearing a similar one. I asked about the reason for it. He \n     replied, \"I abused a person by calling his mother with bad names.\" The\n     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his \n     mother with bad names You still have some characteristics of \n     ignorance. Your slaves are your brothers and Allah has put them under \n     your command. So whoever has a brother under his command should feed \n     him of what he eats and dress him of what he wears. Do not ask them \n     (slaves) to do things beyond their capacity (power) and if you do so, \n     then help them.' \"","reference":"Sahih al-Bukhari 30, Book 2, Hadith 23","grade":"","question #":"question #3","question":"What guidance does Islam offer on the importance of equality and fairness in clothing and feeding those under one's care?","id":"bukhari-2-125"},{"hadith-eng":"While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met\n     me and asked, \"Where are you going?\" I replied, \"I am going to help \n     that person.\" He said, \"Go back for I have heard Allah's Messenger (ﷺ) \n     saying, 'When two Muslims fight (meet) each other with their swords, \n     both the murderer as well as the murdered will go to the Hell-fire.' I\n     said, 'O Allah's Messenger (ﷺ)! It is all right for the murderer but what \n     about the murdered one?' Allah's Messenger (ﷺ) replied, \"He surely had the \n     intention to kill his companion.\"","reference":"Sahih al-Bukhari 31, Book 2, Hadith 24","grade":"","question #":"question #3","question":"How does Islam view the act of fighting among Muslims, and what are the spiritual repercussions?","id":"bukhari-2-126"},{"hadith-eng":"When the following Verse was revealed: \"It is those who believe and \n     confuse not their belief with wrong (worshipping others besides \n     Allah.)\" (6:83), the companions of Allah's Messenger (ﷺ) asked, \"Who is \n     amongst us who had not done injustice (wrong)?\" Allah revealed: \"No \n     doubt, joining others in worship with Allah is a great injustice \n     (wrong) indeed.\" (31.13)","reference":"Sahih al-Bukhari 32, Book 2, Hadith 25","grade":"","question #":"question #3","question":"What does the Quran say about associating others with Allah in worship?","id":"bukhari-2-127"},{"hadith-eng":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three:1. Whenever he speaks, he tells a lie.2. Whenever he promises, he always breaks it (his promise ).3. If you trust him, he proves to be dishonest. (If you keep something\n     as a trust with him, he will not return it.)\"","reference":"Sahih al-Bukhari 33, Book 2, Hadith 26","grade":"","question #":"question #3","question":"What is the significance of fulfilling promises in Islam?","id":"bukhari-2-128"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has the following four (characteristics) \n     will be a pure hypocrite and whoever has one of the following four \n     characteristics will have one characteristic of hypocrisy unless and \n     until he gives it up.1. Whenever he is entrusted, he betrays.2. Whenever he speaks, he tells a lie.3. Whenever he makes a covenant, he proves treacherous.4. Whenever he quarrels, he behaves in a very imprudent, evil and \n     insulting manner.\"","reference":"Sahih al-Bukhari 34, Book 2, Hadith 27","grade":"","question #":"question #3","question":"What is the significance of trustworthiness and honesty in Islamic character development?","id":"bukhari-2-129"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever establishes the prayers on the night of\n     Qadr out of sincere faith and hoping to attain Allah's rewards (not to\n     show off) then all his past sins will be forgiven.\"","reference":"Sahih al-Bukhari 35, Book 2, Hadith 28","grade":"","question #":"question #3","question":"What are the spiritual benefits of performing acts of worship without the intention of showing off?","id":"bukhari-2-130"},{"hadith-eng":"The Prophet (ﷺ) said, \"The person who participates in (Holy battles) in \n     Allah's cause and nothing compels him to do so except belief in Allah \n     and His Apostles, will be recompensed by Allah either with a reward, \n     or booty (if he survives) or will be admitted to Paradise (if he is \n     killed in the battle as a martyr). Had I not found it difficult for my\n     followers, then I would not remain behind any sariya going for Jihad \n     and I would have loved to be martyred in Allah's cause and then made \n     alive, and then martyred and then made alive, and then again martyred \n     in His cause.\"","reference":"Sahih al-Bukhari 36, Book 2, Hadith 29","grade":"","question #":"question #3","question":"What reasons might the Prophet (ﷺ) have had for not participating in every military expedition despite his desire to do so?","id":"bukhari-2-131"},{"hadith-eng":"Allah's Messenger (ﷺ) said: \"Whoever establishes prayers during the nights \n     of Ramadan faithfully out of sincere faith and hoping to attain \n     Allah's rewards (not for showing off), all his past sins will be \n     forgiven.\"","reference":"Sahih al-Bukhari 37, Book 2, Hadith 30","grade":"","question #":"question #3","question":"What are the spiritual benefits of praying at night during Ramadan according to Islamic teachings?","id":"bukhari-2-132"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever observes fasts during the month of \n     Ramadan out of sincere faith, and hoping to attain Allah's rewards, \n     then all his past sins will be forgiven.\"","reference":"Sahih al-Bukhari 38, Book 2, Hadith 31","grade":"","question #":"question #3","question":"What is the significance of having sincere faith and hope for Allah's rewards while fasting?","id":"bukhari-2-133"},{"hadith-eng":"The Prophet (ﷺ) said, \"Religion is very easy and whoever overburdens \n     himself in his religion will not be able to continue in that way. So \n     you should not be extremists, but try to be near to perfection and \n     receive the good tidings that you will be rewarded; and gain strength \n     by worshipping in the mornings, the afternoons, and during the last hours of the nights.\" (See Fath-ul-Bari, Page \n     102, Vol 1).","reference":"Sahih al-Bukhari 39, Book 2, Hadith 32","grade":"","question #":"question #3","question":"What are the recommended times for worship to gain spiritual strength and rewards?","id":"bukhari-2-134"},{"hadith-eng":"When the Prophet (ﷺ) came to Medina, he stayed first with his grandfathers\n     or maternal uncles from Ansar. He offered his prayers facing \n     Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he \n     wished that he could pray facing the Ka'ba (at Mecca). The first \n     prayer which he offered facing the Ka'ba was the 'Asr prayer in the \n     company of some people. Then one of those who had offered that prayer \n     with him came out and passed by some people in a mosque who were \n     bowing during their prayers (facing Jerusalem). He said addressing \n     them, \"By Allah, I testify that I have prayed with Allah's Messenger (ﷺ) \n     facing Mecca (Ka'ba).' Hearing that, those people changed their \n     direction towards the Ka'ba immediately. Jews and the people of the \n     scriptures used to be pleased to see the Prophet (ﷺ) facing Jerusalem in \n     prayers but when he changed his direction towards the Ka'ba, during \n     the prayers, they disapproved of it.Al-Bara' added, \"Before we changed our direction towards the Ka'ba \n     (Mecca) in prayers, some Muslims had died or had been killed and we \n     did not know what to say about them (regarding their prayers.) Allah \n     then revealed: And Allah would never make your faith (prayers) to be \n     lost (i.e. the prayers of those Muslims were valid).' \" (2:143).","reference":"Sahih al-Bukhari 40, Book 2, Hadith 33","grade":"","question #":"question #3","question":"What assurance did Allah provide regarding the prayers of Muslims who prayed towards Jerusalem before the Qibla change?","id":"bukhari-2-135"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"","reference":"Sahih al-Bukhari 41, Book 2, Hadith 34","grade":"","question #":"question #3","question":"What is the significance of Allah's forgiveness in the context of past sins for new Muslims?","id":"bukhari-2-136"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If any one of you improve (follows strictly) \n     his Islamic religion then his good deeds will be rewarded ten times to\n     seven hundred times for each good deed and a bad deed will be recorded\n     as it is.\"","reference":"Sahih al-Bukhari 42, Book 2, Hadith 35","grade":"","question #":"question #3","question":"How are good deeds multiplied in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-2-137"},{"hadith-eng":"Once the Prophet (ﷺ) came while a woman was sitting with me. He said, \"Who\n     is she?\" I replied, \"She is so and so,\" and told him about her \n     (excessive) praying. He said disapprovingly, \"Do (good) deeds which is\n     within your capacity (without being overtaxed) as Allah does not get \n     tired (of giving rewards) but (surely) you will get tired and the best\n     deed (act of Worship) in the sight of Allah is that which is done \n     regularly.\"","reference":"Sahih al-Bukhari 43, Book 2, Hadith 36","grade":"","question #":"question #3","question":"How does Islam view excessive religious practices that may lead to fatigue?","id":"bukhari-2-138"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever said \"None has the right to be worshipped \n     but Allah and has in his heart good (faith) equal to the weight of a \n     barley grain will be taken out of Hell. And whoever said: \"None has \n     the right to be worshipped but Allah and has in his heart good (faith)\n     equal to the weight of a wheat grain will be taken out of Hell. And \n     whoever said, \"None has the right to be worshipped but Allah and has \n     in his heart good (faith) equal to the weight of an atom will be taken\n     out of Hell.\"","reference":"Sahih al-Bukhari 44, Book 2, Hadith 37","grade":"","question #":"question #3","question":"What does the phrase 'None has the right to be worshipped but Allah' imply about the core beliefs in Islam?","id":"bukhari-2-139"},{"hadith-eng":"Once a Jew said to me, \"O the chief of believers! There is a verse in \n     your Holy Book Which is read by all of you (Muslims), and had it been \n     revealed to us, we would have taken that day (on which it was revealed\n     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that \n     verse?\" The Jew replied, \"This day I have perfected your religion For \n     you, completed My favor upon you, And have chosen for you Islam as \n     your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where \n     this verse was revealed to the Prophet. It was Friday and the Prophet (ﷺ) \n     was standing at 'Arafat (i.e. the Day of Hajj)\"","reference":"Sahih al-Bukhari 45, Book 2, Hadith 38","grade":"","question #":"question #3","question":"What is the historical context of the verse revealed during the Prophet's standing at 'Arafat?","id":"bukhari-2-140"},{"hadith-eng":"A man from Najd with unkempt hair came to Allah's Messenger (ﷺ) and we heard\r\n     his loud voice but could not understand what he was saying, till he \r\n     came near and then we came to know that he was asking about Islam. \r\n     Allah's Messenger (ﷺ) said, \"You have to offer prayers perfectly five times \r\n     in a day and night (24 hours).\" The man asked, \"Is there any more \r\n     (praying)?\" Allah's Messenger (ﷺ) replied, \"No, but if you want to offer the\r\n     Nawafil prayers (you can).\" Allah's Messenger (ﷺ) further said to him: \"You \r\n     have to observe fasts during the month of Ramadan.\" The man asked, \r\n     \"Is there any more fasting?\" Allah's Messenger (ﷺ) replied, \"No, but if you \r\n     want to observe the Nawafil fasts (you can.)\" Then Allah's Messenger (ﷺ) \r\n     further said to him, \"You have to pay the Zakat (obligatory charity).\"\r\n     The man asked, \"Is there any thing other than the Zakat for me to \r\n     pay?\" Allah's Messenger (ﷺ) replied, \"No, unless you want to give alms of \r\n     your own.\" And then that man retreated saying, \"By Allah! I will \r\n     neither do less nor more than this.\" Allah's Messenger (ﷺ) said, \"If what he\r\n     said is true, then he will be successful (i.e. he will be granted \r\n     Paradise).\"","reference":"Sahih al-Bukhari 46, Book 2, Hadith 39","grade":"","question #":"question #3","question":"What is the significance of adhering strictly to the basic obligations of Islam for achieving success in the hereafter?","id":"bukhari-2-141"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(A believer) who accompanies the funeral \n     procession of a Muslim out of sincere faith and hoping to attain \n     Allah's reward and remains with it till the funeral prayer is offered \n     and the burial ceremonies are over, he will return with a reward of \n     two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who \n     offers the funeral prayer only and returns before the burial, will \n     return with the reward of one Qirat only.\"","reference":"Sahih al-Bukhari 47, Book 2, Hadith 40","grade":"","question #":"question #3","question":"What is the significance of sincere faith and intention in attending funeral rites in Islam?","id":"bukhari-2-142"},{"hadith-eng":"The Prophet (ﷺ) said, \"Abusing a Muslim is Fusuq (an evil doing) and \n     killing him is Kufr (disbelief).\"","reference":"Sahih al-Bukhari 48, Book 2, Hadith 41","grade":"","question #":"question #3","question":"What is the distinction between Fusuq and Kufr in the context of interpersonal actions among Muslims?","id":"bukhari-2-143"},{"hadith-eng":"\"Allah's Messenger (ﷺ) went out to inform the people about the (date of the)\n     night of decree (Al-Qadr) but there happened a quarrel between two \n     Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about (the \n     date of) the night of Al-Qadr, but as so and so and so and so \n     quarrelled, its knowledge was taken away (I forgot it) and maybe it \n     was better for you. Now look for it in the 7th, the 9th and the 5th \n     (of the last 10 nights of the month of Ramadan).\"","reference":"Sahih al-Bukhari 49, Book 2, Hadith 42","grade":"","question #":"question #3","question":"How can believers identify the Night of Decree during Ramadan according to Islamic teachings?","id":"bukhari-2-144"},{"hadith-eng":"One day while the Prophet (ﷺ) was sitting in the company of some people, \n     (The angel) Gabriel came and asked, \"What is faith?\" Allah's Messenger (ﷺ) \n     replied, 'Faith is to believe in Allah, His angels, (the) meeting with\n     Him, His Apostles, and to believe in Resurrection.\" Then he further \n     asked, \"What is Islam?\" Allah's Messenger (ﷺ) replied, \"To worship Allah \n     Alone and none else, to offer prayers perfectly to pay the compulsory \n     charity (Zakat) and to observe fasts during the month of Ramadan.\"  \n     Then he further asked, \"What is Ihsan (perfection)?\" Allah's Messenger (ﷺ) \n     replied, \"To worship Allah as if you see Him, and if you cannot \n     achieve this state of devotion then you must consider that He is \n     looking at you.\" Then he further asked, \"When will the Hour be \n     established?\" Allah's Messenger (ﷺ) replied, \"The answerer has no better \n     knowledge than the questioner. But I will inform you about its \n     portents.1. When a slave (lady) gives birth to her master.2. When the shepherds of black camels start boasting and competing \n     with others in the construction of higher buildings. And the Hour is \n     one of five things which nobody knows except Allah.The Prophet (ﷺ) then recited: \"Verily, with Allah (Alone) is the knowledge\n     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet (ﷺ) \n     asked his companions to call him back, but they could not see him. \n     Then the Prophet (ﷺ) said, \"That was Gabriel who came to teach the people \n     their religion.\" Abu 'Abdullah said: He (the Prophet) considered all \n     that as a part of faith.","reference":"Sahih al-Bukhari 50, Book 2, Hadith 43","grade":"","question #":"question #3","question":"How is the concept of Ihsan described in Islamic teachings and what does it signify in terms of worship?","id":"bukhari-2-145"},{"hadith-eng":"I was informed by Abu Sufyan that Heraclius said to him, \"I asked you \n     whether they (followers of Muhammad) were increasing or decreasing. \n     You replied that they were increasing. And in fact, this is the way of\n     true Faith till it is complete in all respects. I further asked you \n     whether there was anybody, who, after embracing his (the Prophets) \n     religion (Islam) became displeased and discarded it. You replied in \n     the negative, and in fact, this is (a sign of) true faith. When its \n     delight enters the heart and mixes with them completely, nobody can be\n     displeased with it.\"","reference":"Sahih al-Bukhari 51, Book 2, Hadith 44","grade":"","question #":"question #3","question":"What impact does the delight of faith have on a believer's heart according to the narration?","id":"bukhari-2-146"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, 'Both legal and illegal things are \n     evident but in between them there are doubtful (suspicious) things and\n     most of the people have no knowledge about them. So whoever saves \n     himself from these suspicious things saves his religion and his honor.\n     And whoever indulges in these suspicious things is like a shepherd who\n     grazes (his animals) near the Hima (private pasture) of someone else \n     and at any moment he is liable to get in it. (O people!) Beware! Every\n     king has a Hima and the Hima of Allah on the earth is His illegal \n     (forbidden) things. Beware! There is a piece of flesh in the body if \n     it becomes good (reformed) the whole body becomes good but if it gets \n     spoilt the whole body gets spoilt and that is the heart.","reference":"Sahih al-Bukhari 52, Book 2, Hadith 45","grade":"","question #":"question #3","question":"What analogy is used to describe the danger of indulging in doubtful matters, and what does it signify?","id":"bukhari-2-147"},{"hadith-eng":"I used to sit with Ibn 'Abbas and he made me sit on his sitting place.\n     He requested me to stay with him in order that he might give me a \n     share from his property. So I stayed with him for two months. Once he \n     told (me) that when the delegation of the tribe of 'Abdul Qais came to\n     the Prophet, the Prophet (ﷺ) asked them, \"Who are the people (i.e. you)? \n     (Or) who are the delegate?\" They replied, \"We are from the tribe of \n     Rabi'a.\" Then the Prophet (ﷺ) said to them, \"Welcome! O people (or O \n     delegation of 'Abdul Qais)! Neither will you have disgrace nor will \n     you regret.\" They said, \"O Allah's Messenger (ﷺ)! We cannot come to you \n     except in the sacred month and there is the infidel tribe of Mudar \n     intervening between you and us. So please order us to do something \n     good (religious deeds) so that we may inform our people whom we have \n     left behind (at home), and that we may enter Paradise (by acting on \n     them).\" Then they asked about drinks (what is legal and what is \n     illegal). The Prophet (ﷺ) ordered them to do four things and forbade them \n     from four things. He ordered them to believe in Allah Alone and asked \n     them, \"Do you know what is meant by believing in Allah Alone?\" They \n     replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) \n     said, \"It means:1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).2. To offer prayers perfectly3. To pay the Zakat (obligatory charity)4. To observe fast during the month of Ramadan.5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's\n     Cause).Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann \n     Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic\n     drinks were prepared) (The Prophet (ﷺ) mentioned the container of wine and\n     he meant the wine itself). The Prophet (ﷺ) further said (to them): \n     \"Memorize them (these instructions) and convey them to the people whom\n     you have left behind.\"","reference":"Sahih al-Bukhari 53, Book 2, Hadith 46","grade":"","question #":"question #3","question":"What were the specific prohibitions related to alcoholic drinks that the Prophet Muhammad (ﷺ) instructed the delegation of 'Abdul Qais to avoid?","id":"bukhari-2-148"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The reward of deeds depends upon the intention \n     and every person will get the reward according to what he has \n     intended. So whoever emigrated for Allah and His Apostle, then his \n     emigration was for Allah and His Apostle. And whoever emigrated for \n     worldly benefits or for a woman to marry, his emigration was for what \n     he emigrated for.\"","reference":"Sahih al-Bukhari 54, Book 2, Hadith 47","grade":"","question #":"question #3","question":"How does the concept of intention influence the outcome of actions such as emigration in Islam?","id":"bukhari-2-149"},{"hadith-eng":"The Prophet (ﷺ) said, \"If a man spends on his family (with the intention \n     of having a reward from Allah) sincerely for Allah's sake then it is a\n     (kind of) alms-giving in reward for him.","reference":"Sahih al-Bukhari 55, Book 2, Hadith 48","grade":"","question #":"question #3","question":"What rewards are associated with spending on family for the sake of Allah?","id":"bukhari-2-150"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"You will be rewarded for whatever you spend for\n     Allah's sake even if it were a morsel which you put in your wife's \n     mouth.\"","reference":"Sahih al-Bukhari 56, Book 2, Hadith 49","grade":"","question #":"question #3","question":"What are the rewards associated with small acts of kindness in Islam?","id":"bukhari-2-151"},{"hadith-eng":"I gave the pledge of allegiance to Allah's Messenger (ﷺ) for the following:1. offer prayers perfectly2. pay the Zakat (obligatory charity)3. and be sincere and true to every Muslim.","reference":"Sahih al-Bukhari 57, Book 2, Hadith 50","grade":"","question #":"question #3","question":"What is the significance of offering prayers and paying Zakat in the life of a Muslim?","id":"bukhari-2-152"},{"hadith-eng":"I heard Jarir bin 'Abdullah (Praising Allah). On the day when \n     Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and \n     thanked and praised Allah and said, \"Be afraid of Allah alone Who has \n     none along with Him to be worshipped.(You should) be calm and quiet \n     till the (new) chief comes to you and he will come to you soon. Ask \n     Allah's forgiveness for your (late) chief because he himself loved to \n     forgive others.\" Jarir added, \"Amma badu (now then), I went to the \n     Prophet and said, 'I give my pledge of allegiance to you for Islam.\" \n     The Prophet (ﷺ) conditioned (my pledge) for me to be sincere and true to \n     every Muslim so I gave my pledge to him for this. By the Lord of this \n     mosque! I am sincere and true to you (Muslims). Then Jarir asked for \n     Allah's forgiveness and came down (from the pulpit).","reference":"Sahih al-Bukhari 58, Book 2, Hadith 51","grade":"","question #":"question #3","question":"What is the importance of seeking forgiveness for others in Islam?","id":"bukhari-2-153"}]