[{"hadith-eng":"`Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the \nfaithful believers , who was his aunt. He said, \"I slept across the bed, and Allah's Messenger (ﷺ) along with \nhis wife slept lengthwise. Allah's Messenger (ﷺ) slept till midnight or slightly before or after it. Then Allah's \nApostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he \nrecited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer \nand performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas \nadded, \"I got up and did the same as Allah's Messenger (ﷺ) had done and then went and stood by his side. \nAllah's Messenger (ﷺ) then put his right hand over my head and caught my right ear and twisted it. He \noffered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at \nand then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two \nlight rak`at and went out and offered the early morning (Fajr) prayer.\"","reference":"Sahih al-Bukhari 1198, Book 21, Hadith 1","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) perform upon waking up in the middle of the night?","id":"bukhari-21-1"},{"hadith-eng":"We used to greet the Prophet (ﷺ) while he was praying and he used to answer our greetings. When we \nreturned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the \nprayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"","reference":"Sahih al-Bukhari 1199, Book 21, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of maintaining focus and avoiding distractions during prayer in Islam?","id":"bukhari-21-2"},{"hadith-eng":"In the lifetime of the Prophet (ﷺ) we used to speak while praying, and one of us would tell his needs to his \ncompanions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were \nordered to remain silent while praying.","reference":"Sahih al-Bukhari 1200, Book 21, Hadith 4","grade":"","question #":"question #1","question":"What changes were made to the conduct of prayer after the revelation of a specific verse in the Quran?","id":"bukhari-21-3"},{"hadith-eng":"The Prophet (ﷺ) went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time \nof the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet (ﷺ) is detained. Will you lead \nthe people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and \nAbu Bakr led the prayer. In the meantime the Prophet (ﷺ) came crossing the rows (of the praying people) \ntill he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither \nduring the prayer but when the people clapped too much, he looked back and saw the Prophet (ﷺ) in the \n(first) row. The Prophet (ﷺ) waved him to remain at his place, but Abu Bakr raised both his hands and \nsent praises to Allah and then retreated and the Prophet (ﷺ) went forward and led the prayer. (See Hadith \nNo. 295 & 296)","reference":"Sahih al-Bukhari 1201, Book 21, Hadith 5","grade":"","question #":"question #1","question":"What actions should be taken if the designated prayer leader is absent when the prayer time arrives?","id":"bukhari-21-4"},{"hadith-eng":"We used to say the greeting, name and greet each other in the prayer. Allah's Messenger (ﷺ) heard it and \nsaid:--\"Say, 'at-tahiyyatu lil-lahi was-salawatu wat-taiyibatu . Assalamu 'Alaika aiyuha-n-Nabiyu warahmatu- \nl-lahi wa-barakatuhu. _ Assalamu alaina wa-'ala 'ibadi-l-lahi as-salihin.. Ashhadu an la ilaha \nilla-l-lah wa ashhadu anna Muhammadan `Abdu hu wa Rasuluh. (All the compliments are for Allah \nand all the prayers and all the good things (are for Allah). Peace be on you, O Prophet, and Allah's \nmercy and blessings (are on you). And peace be on us and on the good (pious) worshipers of Allah. I \ntestify that none has the right to be worshipped but Allah and that Muhammad is His slave and \nApostle.) So, when you have said this, then you have surely sent the greetings to every good (pious) \nworshipper of Allah, whether he be in the Heaven or on the Earth . \"","reference":"Sahih al-Bukhari 1202, Book 21, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of the specific phrases used in the Tashahhud during prayer?","id":"bukhari-21-5"},{"hadith-eng":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.\" (If something \nhappens in the prayer, the men can invite the attention of the Imam by saying \"Sub Han Allah\". And \nwomen, by clapping their hands).","reference":"Sahih al-Bukhari 1203, Book 21, Hadith 7","grade":"","question #":"question #1","question":"What is the prescribed way for men to alert the Imam during prayer if something happens?","id":"bukhari-21-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.","reference":"Sahih al-Bukhari 1204, Book 21, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of saying 'Subhan Allah' in Islamic practice?","id":"bukhari-21-7"},{"hadith-eng":"While Abu Bakr was leading the people in the morning prayer on a \n     Monday, the Prophet (ﷺ) came towards them suddenly having lifted the \n     curtain of 'Aisha's house, and looked at them as they were standing in\n     rows and smiled. Abu Bakr tried to come back thinking that Allah's \n     Apostle wanted to come out for the prayer. The attention of the \n     Muslims was diverted from the prayer because they were delighted to \n     see the Prophet. The Prophet (ﷺ) waved his hand to them to complete their \n     prayer, then he went back into the room and let down the curtain. The \n     Prophet expired on that very day.","reference":"Sahih al-Bukhari 1205, Book 21, Hadith 9","grade":"","question #":"question #1","question":"What significance does the Prophet's smile hold for the companions during the prayer?","id":"bukhari-21-8"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A woman called her son while he was in his \n     hermitage and said, 'O Juraij' He said, 'O Allah, my mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij!' He said again, 'O Allah ! My mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij' He again said, 'O Allah! My mother (is calling \n     me) and (I am offering) my prayer. (What shall I do?)' She said, 'O \n     Allah! Do not let Juraij die till he sees the faces of prostitutes.' A\n     shepherdess used to come by his hermitage for grazing her sheep and \n     she gave birth to a child. She was asked whose child that was, and she\n     replied that it was from Juraij and that he had come out from his \n     hermitage. Juraij said, 'Where is that woman who claims that her child\n     is from me?' (When she was brought to him along with the child), \n     Juraij asked the child, 'O Babus, who is your father?' The child \n     replied, 'The shepherd.' \" (See Hadith No 662. Vol 3).","reference":"Sahih al-Bukhari 1206, Book 21, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of balancing religious duties and familial obligations in Islam?","id":"bukhari-21-9"},{"hadith-eng":"The Prophet (ﷺ) talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then \ndo it once.\"","reference":"Sahih al-Bukhari 1207, Book 21, Hadith 11","grade":"","question #":"question #1","question":"What guidance did the Prophet (ﷺ) provide regarding leveling the earth during prostration?","id":"bukhari-21-10"},{"hadith-eng":"We used to pray with the Prophet (ﷺ) in scorching heat, and if someone of us could not put his face on the \nearth (because of the heat) then he would spread his clothes and prostrate over them.","reference":"Sahih al-Bukhari 1208, Book 21, Hadith 12","grade":"","question #":"question #1","question":"How did the companions of the Prophet (ﷺ) adapt their prayer practices in extreme weather conditions?","id":"bukhari-21-11"},{"hadith-eng":"I used to stretch my legs towards the Qibla of the Prophet (ﷺ) while he was praying; whenever he \nprostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch \nmy legs.","reference":"Sahih al-Bukhari 1209, Book 21, Hadith 13","grade":"","question #":"question #1","question":"What does this narration indicate about the interaction between the Prophet (ﷺ) and his family during prayer?","id":"bukhari-21-12"},{"hadith-eng":"The Prophet (ﷺ) once offered the prayer and said, \"Satan came in front of me and tried to interrupt my \nprayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him \nto one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the \nstatement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any \nother after me.' Then Allah made him (Satan) return with his head down (humiliated).\"","reference":"Sahih al-Bukhari 1210, Book 21, Hadith 14","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) deal with distractions from Satan during prayer?","id":"bukhari-21-13"},{"hadith-eng":"We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was \npraying and the reins of his animal were in his hands and the animal was struggling and he was \nfollowing the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami). A man from \nthe Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his \nprayer, he said, \"I heard your remark. No doubt, I participated with Allah's Messenger (ﷺ) in six or seven or \neight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return \nto its stable, as it would cause me much trouble. \"","reference":"Sahih al-Bukhari 1211, Book 21, Hadith 15","grade":"","question #":"question #1","question":"What can be learned about the balance between religious duties and practical responsibilities from this incident?","id":"bukhari-21-14"},{"hadith-eng":"Once the sun eclipsed and Allah's Messenger (ﷺ) stood up for the prayer and recited a very long Sura and \nwhen bowed for a long while and then raised his head and started reciting another Sura. Then he \nbowed, and after finishing, he prostrated and did the same in the second rak`a and then said, \"These \n(lunar and solar eclipses) are two of the signs of Allah and if you see them, pray till the eclipse is over. \nNo doubt, while standing at this place I saw everything promised to me by Allah and I saw (Paradise) \nand I wanted to pluck a bunch (of grapes) therefrom, at the time when you saw me stepping forward. \nNo doubt, I saw Hell with its different parts destroying each other when you saw me retreating and in \nit I saw `Amr bin Luhai who started the tradition of freeing animals (set them free) in the name of \nidols.\"","reference":"Sahih al-Bukhari 1212, Book 21, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of performing prayer during a solar or lunar eclipse in Islam?","id":"bukhari-21-15"},{"hadith-eng":"The Prophet (ﷺ) saw some sputum on the wall facing the Qibla of the mosque and became furious with \nthe people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he \nshould not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum \nwith his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he \nshould spit to his left.\"","reference":"Sahih al-Bukhari 1213, Book 21, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of maintaining cleanliness and respect in the mosque during prayer?","id":"bukhari-21-16"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whenever anyone of you is in prayer, he is speaking in private to his Lord and so \nhe should neither spit in front of him nor on his right side but to his left side under his left foot.\"","reference":"Sahih al-Bukhari 1214, Book 21, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of maintaining cleanliness and etiquette during prayer?","id":"bukhari-21-17"},{"hadith-eng":"The people used to offer the prayer with the Prophet (ﷺ) with their waist-sheets tied round their necks \nbecause of the shortness of the sheets and the women were ordered not to lift their heads till the men \nhad sat straight.","reference":"Sahih al-Bukhari 1215, Book 21, Hadith 19","grade":"","question #":"question #1","question":"What were the clothing practices of men during prayer in the time of the Prophet (ﷺ)?","id":"bukhari-21-18"},{"hadith-eng":"I used to greet the Prophet (ﷺ) while he was in prayer and he would return my greeting, but when we \nreturned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the \ngreeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"","reference":"Sahih al-Bukhari 1216, Book 21, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of maintaining focus and concentration during prayer in Islam?","id":"bukhari-21-19"},{"hadith-eng":"Allah's Messenger (ﷺ) sent me for some job and when I had finished it I returned and came to the Prophet (ﷺ) \nand greeted him but he did not return my greeting. So I felt so sorry that only Allah knows it and I \nsaid to myself,, 'Perhaps Allah's Messenger (ﷺ) is angry because I did not come quickly, then again I greeted \nhim but he did not reply. I felt even more sorry than I did the first time. Again I greeted him and he \nreturned the greeting and said, \"The thing which prevented me from returning the greeting was that I \nwas praying.\" And at that time he was on his Rahila and his face was not towards the Qibla.","reference":"Sahih al-Bukhari 1217, Book 21, Hadith 21","grade":"","question #":"question #1","question":"What should one do if they feel ignored or slighted by someone in authority, according to Islamic teachings?","id":"bukhari-21-20"},{"hadith-eng":"The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's \nApostle and so he went to them along with some of his companions to affect a reconciliation. Allah's \nApostle was delayed there and the time for the prayer became due. Bilal came to Abu Bakr! and said, \n\"O Abu Bakr! Allah's Messenger (ﷺ) is detained (there) and the time for the prayer is due. Will you lead the \npeople in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu \nBakr went forward and the people said Takbir. In the meantime, Allah's Messenger (ﷺ) came piercing \nthrough the rows till he stood in the (first) row and the people started clapping. Abu Bakr, would \nnever look hither and thither during the prayer but when the people clapped much he looked back and \nsaw Allah's Messenger (ﷺ). The Prophet (ﷺ) beckoned him to carry on. Abu Bakr raised both his hands, praised \nAllah and retreated till he stood in the row and Allah's Messenger (ﷺ) went forward and led the people in the \nprayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you \nstart clapping when something happened to you in the prayer? Clapping is for women. Whenever one \nis confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the \nProphet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I \nbeckoned you to carry on?\" Abu Bakr replied, \"It does not befit the son of Al Quhafa to lead the \nprayer in the presence of Allah's Messenger (ﷺ).","reference":"Sahih al-Bukhari 1218, Book 21, Hadith 22","grade":"","question #":"question #1","question":"What actions should be taken if the designated prayer leader is delayed and the prayer time becomes due?","id":"bukhari-21-21"},{"hadith-eng":"It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira \nfrom the Prophet.)","reference":"Sahih al-Bukhari 1219, Book 21, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of body posture during prayer in Islam?","id":"bukhari-21-22"},{"hadith-eng":"It was forbidden to pray with the hands over one's hips.","reference":"Sahih al-Bukhari 1220, Book 21, Hadith 24","grade":"","question #":"question #1","question":"What is the ruling on the position of hands during prayer in Islam?","id":"bukhari-21-23"},{"hadith-eng":"I offered the `Asr prayer with the Prophet (ﷺ) and after finishing the prayer with Taslim he got up quickly \nand went to some of his wives and then came out. He noticed the signs of astonishment on the faces of \nthe people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of \ngold was Lying in my house and I disliked that it should remain with us throughout the night, and so I \nhave ordered it to be distributed.\"","reference":"Sahih al-Bukhari 1221, Book 21, Hadith 25","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take upon remembering something during prayer?","id":"bukhari-21-24"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the Adhan for the prayer is pronounced, then Satan takes to his heels \npassing wind so that he may not hear the Adhan and when the Mu'adh-dhin finishes, he comes back; \nand when the Iqama is pronounced he again takes to his heels and when it is finished, he again comes \nback and continues reminding the praying person of things that he used not to remember when not in \nprayer till he forgets how much he has prayed.\" Abu Salama bin `Abdur-Rahman said, \"If anyone of \nyou has such a thing (forgetting the number of rak`at he has prayed) he should perform two \nprostrations of Sahu (i.e. forgetfulness) while sitting.\" Abu Salama narrates this from Abu Huraira.","reference":"Sahih al-Bukhari 1222, Book 21, Hadith 26","grade":"","question #":"question #1","question":"What actions does Satan take during the Adhan and Iqama, and how does it affect the person praying?","id":"bukhari-21-25"},{"hadith-eng":"People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of \nthe Prophet) and asked him, \"Which Sura did Allah's Messenger (ﷺ) s recite yesterday in the `Isha' prayer?\" \nHe said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I \nknow. He recited such and such Sura.\"","reference":"Sahih al-Bukhari 1223, Book 21, Hadith 27","grade":"","question #":"question #1","question":"What can be inferred about the importance of attentiveness during prayers from this narration?","id":"bukhari-21-26"},{"hadith-eng":"`Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the \nfaithful believers , who was his aunt. He said, \"I slept across the bed, and Allah's Messenger (ﷺ) along with \nhis wife slept lengthwise. Allah's Messenger (ﷺ) slept till midnight or slightly before or after it. Then Allah's \nApostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he \nrecited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer \nand performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas \nadded, \"I got up and did the same as Allah's Messenger (ﷺ) had done and then went and stood by his side. \nAllah's Messenger (ﷺ) then put his right hand over my head and caught my right ear and twisted it. He \noffered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at \nand then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two \nlight rak`at and went out and offered the early morning (Fajr) prayer.\"","reference":"Sahih al-Bukhari 1198, Book 21, Hadith 1","grade":"","question #":"question #2","question":"How did Abdullah bin Abbas emulate the Prophet Muhammad (ﷺ) during the night prayer?","id":"bukhari-21-27"},{"hadith-eng":"We used to greet the Prophet (ﷺ) while he was praying and he used to answer our greetings. When we \nreturned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the \nprayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"","reference":"Sahih al-Bukhari 1199, Book 21, Hadith 2","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to greetings while engaged in prayer?","id":"bukhari-21-28"},{"hadith-eng":"In the lifetime of the Prophet (ﷺ) we used to speak while praying, and one of us would tell his needs to his \ncompanions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were \nordered to remain silent while praying.","reference":"Sahih al-Bukhari 1200, Book 21, Hadith 4","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) communicate during prayer before a particular Quranic verse was revealed?","id":"bukhari-21-29"},{"hadith-eng":"The Prophet (ﷺ) went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time \nof the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet (ﷺ) is detained. Will you lead \nthe people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and \nAbu Bakr led the prayer. In the meantime the Prophet (ﷺ) came crossing the rows (of the praying people) \ntill he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither \nduring the prayer but when the people clapped too much, he looked back and saw the Prophet (ﷺ) in the \n(first) row. The Prophet (ﷺ) waved him to remain at his place, but Abu Bakr raised both his hands and \nsent praises to Allah and then retreated and the Prophet (ﷺ) went forward and led the prayer. (See Hadith \nNo. 295 & 296)","reference":"Sahih al-Bukhari 1201, Book 21, Hadith 5","grade":"","question #":"question #2","question":"How should a person react if they are leading a prayer and the Prophet or a higher authority arrives?","id":"bukhari-21-30"},{"hadith-eng":"We used to say the greeting, name and greet each other in the prayer. Allah's Messenger (ﷺ) heard it and \nsaid:--\"Say, 'at-tahiyyatu lil-lahi was-salawatu wat-taiyibatu . Assalamu 'Alaika aiyuha-n-Nabiyu warahmatu- \nl-lahi wa-barakatuhu. _ Assalamu alaina wa-'ala 'ibadi-l-lahi as-salihin.. Ashhadu an la ilaha \nilla-l-lah wa ashhadu anna Muhammadan `Abdu hu wa Rasuluh. (All the compliments are for Allah \nand all the prayers and all the good things (are for Allah). Peace be on you, O Prophet, and Allah's \nmercy and blessings (are on you). And peace be on us and on the good (pious) worshipers of Allah. I \ntestify that none has the right to be worshipped but Allah and that Muhammad is His slave and \nApostle.) So, when you have said this, then you have surely sent the greetings to every good (pious) \nworshipper of Allah, whether he be in the Heaven or on the Earth . \"","reference":"Sahih al-Bukhari 1202, Book 21, Hadith 6","grade":"","question #":"question #2","question":"How does the Tashahhud connect the worshippers with the Prophet and other pious servants of Allah?","id":"bukhari-21-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.\" (If something \nhappens in the prayer, the men can invite the attention of the Imam by saying \"Sub Han Allah\". And \nwomen, by clapping their hands).","reference":"Sahih al-Bukhari 1203, Book 21, Hadith 7","grade":"","question #":"question #2","question":"How should women signal the Imam during prayer if there is an issue?","id":"bukhari-21-32"},{"hadith-eng":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.","reference":"Sahih al-Bukhari 1204, Book 21, Hadith 8","grade":"","question #":"question #2","question":"How are men and women advised to express themselves differently during prayer according to Islamic teachings?","id":"bukhari-21-33"},{"hadith-eng":"While Abu Bakr was leading the people in the morning prayer on a \n     Monday, the Prophet (ﷺ) came towards them suddenly having lifted the \n     curtain of 'Aisha's house, and looked at them as they were standing in\n     rows and smiled. Abu Bakr tried to come back thinking that Allah's \n     Apostle wanted to come out for the prayer. The attention of the \n     Muslims was diverted from the prayer because they were delighted to \n     see the Prophet. The Prophet (ﷺ) waved his hand to them to complete their \n     prayer, then he went back into the room and let down the curtain. The \n     Prophet expired on that very day.","reference":"Sahih al-Bukhari 1205, Book 21, Hadith 9","grade":"","question #":"question #2","question":"How did the companions react upon seeing the Prophet during the prayer led by Abu Bakr?","id":"bukhari-21-34"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A woman called her son while he was in his \n     hermitage and said, 'O Juraij' He said, 'O Allah, my mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij!' He said again, 'O Allah ! My mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij' He again said, 'O Allah! My mother (is calling \n     me) and (I am offering) my prayer. (What shall I do?)' She said, 'O \n     Allah! Do not let Juraij die till he sees the faces of prostitutes.' A\n     shepherdess used to come by his hermitage for grazing her sheep and \n     she gave birth to a child. She was asked whose child that was, and she\n     replied that it was from Juraij and that he had come out from his \n     hermitage. Juraij said, 'Where is that woman who claims that her child\n     is from me?' (When she was brought to him along with the child), \n     Juraij asked the child, 'O Babus, who is your father?' The child \n     replied, 'The shepherd.' \" (See Hadith No 662. Vol 3).","reference":"Sahih al-Bukhari 1206, Book 21, Hadith 10","grade":"","question #":"question #2","question":"How can false accusations impact an individual's reputation and what is the Islamic perspective on dealing with such situations?","id":"bukhari-21-35"},{"hadith-eng":"The Prophet (ﷺ) talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then \ndo it once.\"","reference":"Sahih al-Bukhari 1207, Book 21, Hadith 11","grade":"","question #":"question #2","question":"How should one handle the act of leveling the ground while in prayer according to Islamic teachings?","id":"bukhari-21-36"},{"hadith-eng":"We used to pray with the Prophet (ﷺ) in scorching heat, and if someone of us could not put his face on the \nearth (because of the heat) then he would spread his clothes and prostrate over them.","reference":"Sahih al-Bukhari 1208, Book 21, Hadith 12","grade":"","question #":"question #2","question":"What does this narration illustrate about the commitment of the companions to perform prayers despite challenging circumstances?","id":"bukhari-21-37"},{"hadith-eng":"I used to stretch my legs towards the Qibla of the Prophet (ﷺ) while he was praying; whenever he \nprostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch \nmy legs.","reference":"Sahih al-Bukhari 1209, Book 21, Hadith 13","grade":"","question #":"question #2","question":"How does this narration reflect the spatial arrangements and considerations during the Prophet's (ﷺ) prayers?","id":"bukhari-21-38"},{"hadith-eng":"The Prophet (ﷺ) once offered the prayer and said, \"Satan came in front of me and tried to interrupt my \nprayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him \nto one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the \nstatement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any \nother after me.' Then Allah made him (Satan) return with his head down (humiliated).\"","reference":"Sahih al-Bukhari 1210, Book 21, Hadith 14","grade":"","question #":"question #2","question":"What lesson can be learned from the Prophet Muhammad's (ﷺ) remembrance of Prophet Solomon's prayer?","id":"bukhari-21-39"},{"hadith-eng":"We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was \npraying and the reins of his animal were in his hands and the animal was struggling and he was \nfollowing the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami). A man from \nthe Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his \nprayer, he said, \"I heard your remark. No doubt, I participated with Allah's Messenger (ﷺ) in six or seven or \neight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return \nto its stable, as it would cause me much trouble. \"","reference":"Sahih al-Bukhari 1211, Book 21, Hadith 15","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) demonstrate leniency and understanding in their actions?","id":"bukhari-21-40"},{"hadith-eng":"Once the sun eclipsed and Allah's Messenger (ﷺ) stood up for the prayer and recited a very long Sura and \nwhen bowed for a long while and then raised his head and started reciting another Sura. Then he \nbowed, and after finishing, he prostrated and did the same in the second rak`a and then said, \"These \n(lunar and solar eclipses) are two of the signs of Allah and if you see them, pray till the eclipse is over. \nNo doubt, while standing at this place I saw everything promised to me by Allah and I saw (Paradise) \nand I wanted to pluck a bunch (of grapes) therefrom, at the time when you saw me stepping forward. \nNo doubt, I saw Hell with its different parts destroying each other when you saw me retreating and in \nit I saw `Amr bin Luhai who started the tradition of freeing animals (set them free) in the name of \nidols.\"","reference":"Sahih al-Bukhari 1212, Book 21, Hadith 16","grade":"","question #":"question #2","question":"What did the Prophet Muhammad (ﷺ) experience during the eclipse prayer that he shared with his companions?","id":"bukhari-21-41"},{"hadith-eng":"The Prophet (ﷺ) saw some sputum on the wall facing the Qibla of the mosque and became furious with \nthe people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he \nshould not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum \nwith his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he \nshould spit to his left.\"","reference":"Sahih al-Bukhari 1213, Book 21, Hadith 17","grade":"","question #":"question #2","question":"How should one handle the need to spit during prayer according to Islamic teachings?","id":"bukhari-21-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whenever anyone of you is in prayer, he is speaking in private to his Lord and so \nhe should neither spit in front of him nor on his right side but to his left side under his left foot.\"","reference":"Sahih al-Bukhari 1214, Book 21, Hadith 18","grade":"","question #":"question #2","question":"How does one maintain proper conduct while communicating with Allah during prayer?","id":"bukhari-21-43"},{"hadith-eng":"The people used to offer the prayer with the Prophet (ﷺ) with their waist-sheets tied round their necks \nbecause of the shortness of the sheets and the women were ordered not to lift their heads till the men \nhad sat straight.","reference":"Sahih al-Bukhari 1215, Book 21, Hadith 19","grade":"","question #":"question #2","question":"What instructions were given to women regarding their movements during prayer in the presence of men?","id":"bukhari-21-44"},{"hadith-eng":"I used to greet the Prophet (ﷺ) while he was in prayer and he would return my greeting, but when we \nreturned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the \ngreeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"","reference":"Sahih al-Bukhari 1216, Book 21, Hadith 20","grade":"","question #":"question #2","question":"How does the act of greeting someone during prayer affect the prayer according to Islamic teachings?","id":"bukhari-21-45"},{"hadith-eng":"Allah's Messenger (ﷺ) sent me for some job and when I had finished it I returned and came to the Prophet (ﷺ) \nand greeted him but he did not return my greeting. So I felt so sorry that only Allah knows it and I \nsaid to myself,, 'Perhaps Allah's Messenger (ﷺ) is angry because I did not come quickly, then again I greeted \nhim but he did not reply. I felt even more sorry than I did the first time. Again I greeted him and he \nreturned the greeting and said, \"The thing which prevented me from returning the greeting was that I \nwas praying.\" And at that time he was on his Rahila and his face was not towards the Qibla.","reference":"Sahih al-Bukhari 1217, Book 21, Hadith 21","grade":"","question #":"question #2","question":"How does the act of prayer affect social interactions and communication in Islam?","id":"bukhari-21-46"},{"hadith-eng":"The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's \nApostle and so he went to them along with some of his companions to affect a reconciliation. Allah's \nApostle was delayed there and the time for the prayer became due. Bilal came to Abu Bakr! and said, \n\"O Abu Bakr! Allah's Messenger (ﷺ) is detained (there) and the time for the prayer is due. Will you lead the \npeople in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu \nBakr went forward and the people said Takbir. In the meantime, Allah's Messenger (ﷺ) came piercing \nthrough the rows till he stood in the (first) row and the people started clapping. Abu Bakr, would \nnever look hither and thither during the prayer but when the people clapped much he looked back and \nsaw Allah's Messenger (ﷺ). The Prophet (ﷺ) beckoned him to carry on. Abu Bakr raised both his hands, praised \nAllah and retreated till he stood in the row and Allah's Messenger (ﷺ) went forward and led the people in the \nprayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you \nstart clapping when something happened to you in the prayer? Clapping is for women. Whenever one \nis confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the \nProphet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I \nbeckoned you to carry on?\" Abu Bakr replied, \"It does not befit the son of Al Quhafa to lead the \nprayer in the presence of Allah's Messenger (ﷺ).","reference":"Sahih al-Bukhari 1218, Book 21, Hadith 22","grade":"","question #":"question #2","question":"How should one react during prayer if something unusual occurs?","id":"bukhari-21-47"},{"hadith-eng":"It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira \nfrom the Prophet.)","reference":"Sahih al-Bukhari 1219, Book 21, Hadith 23","grade":"","question #":"question #2","question":"Why might certain physical positions be discouraged during Islamic prayer?","id":"bukhari-21-48"},{"hadith-eng":"It was forbidden to pray with the hands over one's hips.","reference":"Sahih al-Bukhari 1220, Book 21, Hadith 24","grade":"","question #":"question #2","question":"Why is it important to follow specific postures and positions during Islamic prayers?","id":"bukhari-21-49"},{"hadith-eng":"I offered the `Asr prayer with the Prophet (ﷺ) and after finishing the prayer with Taslim he got up quickly \nand went to some of his wives and then came out. He noticed the signs of astonishment on the faces of \nthe people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of \ngold was Lying in my house and I disliked that it should remain with us throughout the night, and so I \nhave ordered it to be distributed.\"","reference":"Sahih al-Bukhari 1221, Book 21, Hadith 25","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) demonstrate his concern for not keeping wealth overnight?","id":"bukhari-21-50"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the Adhan for the prayer is pronounced, then Satan takes to his heels \npassing wind so that he may not hear the Adhan and when the Mu'adh-dhin finishes, he comes back; \nand when the Iqama is pronounced he again takes to his heels and when it is finished, he again comes \nback and continues reminding the praying person of things that he used not to remember when not in \nprayer till he forgets how much he has prayed.\" Abu Salama bin `Abdur-Rahman said, \"If anyone of \nyou has such a thing (forgetting the number of rak`at he has prayed) he should perform two \nprostrations of Sahu (i.e. forgetfulness) while sitting.\" Abu Salama narrates this from Abu Huraira.","reference":"Sahih al-Bukhari 1222, Book 21, Hadith 26","grade":"","question #":"question #2","question":"How can a person address forgetfulness during prayer according to Islamic teachings?","id":"bukhari-21-51"},{"hadith-eng":"People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of \nthe Prophet) and asked him, \"Which Sura did Allah's Messenger (ﷺ) s recite yesterday in the `Isha' prayer?\" \nHe said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I \nknow. He recited such and such Sura.\"","reference":"Sahih al-Bukhari 1223, Book 21, Hadith 27","grade":"","question #":"question #2","question":"How does this narration highlight the significance of remembering and recalling the recitations in prayers?","id":"bukhari-21-52"},{"hadith-eng":"`Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the \nfaithful believers , who was his aunt. He said, \"I slept across the bed, and Allah's Messenger (ﷺ) along with \nhis wife slept lengthwise. Allah's Messenger (ﷺ) slept till midnight or slightly before or after it. Then Allah's \nApostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he \nrecited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer \nand performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas \nadded, \"I got up and did the same as Allah's Messenger (ﷺ) had done and then went and stood by his side. \nAllah's Messenger (ﷺ) then put his right hand over my head and caught my right ear and twisted it. He \noffered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at \nand then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two \nlight rak`at and went out and offered the early morning (Fajr) prayer.\"","reference":"Sahih al-Bukhari 1198, Book 21, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of performing witr prayer according to this narration?","id":"bukhari-21-53"},{"hadith-eng":"We used to greet the Prophet (ﷺ) while he was praying and he used to answer our greetings. When we \nreturned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the \nprayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"","reference":"Sahih al-Bukhari 1199, Book 21, Hadith 2","grade":"","question #":"question #3","question":"What changes occurred in the Prophet's practice of responding to greetings during prayer after returning from An-Najashi?","id":"bukhari-21-54"},{"hadith-eng":"In the lifetime of the Prophet (ﷺ) we used to speak while praying, and one of us would tell his needs to his \ncompanions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were \nordered to remain silent while praying.","reference":"Sahih al-Bukhari 1200, Book 21, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of maintaining silence during prayer in Islam?","id":"bukhari-21-55"},{"hadith-eng":"The Prophet (ﷺ) went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time \nof the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet (ﷺ) is detained. Will you lead \nthe people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and \nAbu Bakr led the prayer. In the meantime the Prophet (ﷺ) came crossing the rows (of the praying people) \ntill he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither \nduring the prayer but when the people clapped too much, he looked back and saw the Prophet (ﷺ) in the \n(first) row. The Prophet (ﷺ) waved him to remain at his place, but Abu Bakr raised both his hands and \nsent praises to Allah and then retreated and the Prophet (ﷺ) went forward and led the prayer. (See Hadith \nNo. 295 & 296)","reference":"Sahih al-Bukhari 1201, Book 21, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of maintaining focus and not looking around during prayer?","id":"bukhari-21-56"},{"hadith-eng":"We used to say the greeting, name and greet each other in the prayer. Allah's Messenger (ﷺ) heard it and \nsaid:--\"Say, 'at-tahiyyatu lil-lahi was-salawatu wat-taiyibatu . Assalamu 'Alaika aiyuha-n-Nabiyu warahmatu- \nl-lahi wa-barakatuhu. _ Assalamu alaina wa-'ala 'ibadi-l-lahi as-salihin.. Ashhadu an la ilaha \nilla-l-lah wa ashhadu anna Muhammadan `Abdu hu wa Rasuluh. (All the compliments are for Allah \nand all the prayers and all the good things (are for Allah). Peace be on you, O Prophet, and Allah's \nmercy and blessings (are on you). And peace be on us and on the good (pious) worshipers of Allah. I \ntestify that none has the right to be worshipped but Allah and that Muhammad is His slave and \nApostle.) So, when you have said this, then you have surely sent the greetings to every good (pious) \nworshipper of Allah, whether he be in the Heaven or on the Earth . \"","reference":"Sahih al-Bukhari 1202, Book 21, Hadith 6","grade":"","question #":"question #3","question":"What is the impact of reciting the Tashahhud on the unity of the Muslim community across different realms?","id":"bukhari-21-57"},{"hadith-eng":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.\" (If something \nhappens in the prayer, the men can invite the attention of the Imam by saying \"Sub Han Allah\". And \nwomen, by clapping their hands).","reference":"Sahih al-Bukhari 1203, Book 21, Hadith 7","grade":"","question #":"question #3","question":"What are the differences in the roles of men and women in maintaining the order of prayer according to Islamic teachings?","id":"bukhari-21-58"},{"hadith-eng":"The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.","reference":"Sahih al-Bukhari 1204, Book 21, Hadith 8","grade":"","question #":"question #3","question":"What are the prescribed ways for women to signal during prayer in Islam?","id":"bukhari-21-59"},{"hadith-eng":"While Abu Bakr was leading the people in the morning prayer on a \n     Monday, the Prophet (ﷺ) came towards them suddenly having lifted the \n     curtain of 'Aisha's house, and looked at them as they were standing in\n     rows and smiled. Abu Bakr tried to come back thinking that Allah's \n     Apostle wanted to come out for the prayer. The attention of the \n     Muslims was diverted from the prayer because they were delighted to \n     see the Prophet. The Prophet (ﷺ) waved his hand to them to complete their \n     prayer, then he went back into the room and let down the curtain. The \n     Prophet expired on that very day.","reference":"Sahih al-Bukhari 1205, Book 21, Hadith 9","grade":"","question #":"question #3","question":"What actions did the Prophet take when he observed the prayer being led by Abu Bakr?","id":"bukhari-21-60"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A woman called her son while he was in his \n     hermitage and said, 'O Juraij' He said, 'O Allah, my mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij!' He said again, 'O Allah ! My mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij' He again said, 'O Allah! My mother (is calling \n     me) and (I am offering) my prayer. (What shall I do?)' She said, 'O \n     Allah! Do not let Juraij die till he sees the faces of prostitutes.' A\n     shepherdess used to come by his hermitage for grazing her sheep and \n     she gave birth to a child. She was asked whose child that was, and she\n     replied that it was from Juraij and that he had come out from his \n     hermitage. Juraij said, 'Where is that woman who claims that her child\n     is from me?' (When she was brought to him along with the child), \n     Juraij asked the child, 'O Babus, who is your father?' The child \n     replied, 'The shepherd.' \" (See Hadith No 662. Vol 3).","reference":"Sahih al-Bukhari 1206, Book 21, Hadith 10","grade":"","question #":"question #3","question":"What lessons can be learned from the story of Juraij regarding the power of a mother's supplication?","id":"bukhari-21-61"},{"hadith-eng":"The Prophet (ﷺ) talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then \ndo it once.\"","reference":"Sahih al-Bukhari 1207, Book 21, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of minimizing actions during prayer as taught by the Prophet (ﷺ)?","id":"bukhari-21-62"},{"hadith-eng":"We used to pray with the Prophet (ﷺ) in scorching heat, and if someone of us could not put his face on the \nearth (because of the heat) then he would spread his clothes and prostrate over them.","reference":"Sahih al-Bukhari 1208, Book 21, Hadith 12","grade":"","question #":"question #3","question":"What methods were used by the companions to perform prostration when the ground was too hot?","id":"bukhari-21-63"},{"hadith-eng":"I used to stretch my legs towards the Qibla of the Prophet (ﷺ) while he was praying; whenever he \nprostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch \nmy legs.","reference":"Sahih al-Bukhari 1209, Book 21, Hadith 13","grade":"","question #":"question #3","question":"What can be inferred about the flexibility and adaptability in prayer settings from this narration?","id":"bukhari-21-64"},{"hadith-eng":"The Prophet (ﷺ) once offered the prayer and said, \"Satan came in front of me and tried to interrupt my \nprayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him \nto one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the \nstatement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any \nother after me.' Then Allah made him (Satan) return with his head down (humiliated).\"","reference":"Sahih al-Bukhari 1210, Book 21, Hadith 14","grade":"","question #":"question #3","question":"What does this narration teach about the power and protection granted by Allah against Satanic influences?","id":"bukhari-21-65"},{"hadith-eng":"We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was \npraying and the reins of his animal were in his hands and the animal was struggling and he was \nfollowing the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami). A man from \nthe Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his \nprayer, he said, \"I heard your remark. No doubt, I participated with Allah's Messenger (ﷺ) in six or seven or \neight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return \nto its stable, as it would cause me much trouble. \"","reference":"Sahih al-Bukhari 1211, Book 21, Hadith 15","grade":"","question #":"question #3","question":"What does this narration reveal about the attitudes of the Khawarij towards other Muslims?","id":"bukhari-21-66"},{"hadith-eng":"Once the sun eclipsed and Allah's Messenger (ﷺ) stood up for the prayer and recited a very long Sura and \nwhen bowed for a long while and then raised his head and started reciting another Sura. Then he \nbowed, and after finishing, he prostrated and did the same in the second rak`a and then said, \"These \n(lunar and solar eclipses) are two of the signs of Allah and if you see them, pray till the eclipse is over. \nNo doubt, while standing at this place I saw everything promised to me by Allah and I saw (Paradise) \nand I wanted to pluck a bunch (of grapes) therefrom, at the time when you saw me stepping forward. \nNo doubt, I saw Hell with its different parts destroying each other when you saw me retreating and in \nit I saw `Amr bin Luhai who started the tradition of freeing animals (set them free) in the name of \nidols.\"","reference":"Sahih al-Bukhari 1212, Book 21, Hadith 16","grade":"","question #":"question #3","question":"Who was `Amr bin Luhai and what was his role in pre-Islamic traditions?","id":"bukhari-21-67"},{"hadith-eng":"The Prophet (ﷺ) saw some sputum on the wall facing the Qibla of the mosque and became furious with \nthe people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he \nshould not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum \nwith his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he \nshould spit to his left.\"","reference":"Sahih al-Bukhari 1213, Book 21, Hadith 17","grade":"","question #":"question #3","question":"What does the reaction of the Prophet (ﷺ) to seeing sputum in the mosque teach about the importance of etiquette in places of worship?","id":"bukhari-21-68"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whenever anyone of you is in prayer, he is speaking in private to his Lord and so \nhe should neither spit in front of him nor on his right side but to his left side under his left foot.\"","reference":"Sahih al-Bukhari 1214, Book 21, Hadith 18","grade":"","question #":"question #3","question":"What are the recommended actions if one needs to spit during prayer?","id":"bukhari-21-69"},{"hadith-eng":"The people used to offer the prayer with the Prophet (ﷺ) with their waist-sheets tied round their necks \nbecause of the shortness of the sheets and the women were ordered not to lift their heads till the men \nhad sat straight.","reference":"Sahih al-Bukhari 1215, Book 21, Hadith 19","grade":"","question #":"question #3","question":"How did the shortness of clothing affect the way people dressed for prayer in early Islamic times?","id":"bukhari-21-70"},{"hadith-eng":"I used to greet the Prophet (ﷺ) while he was in prayer and he would return my greeting, but when we \nreturned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the \ngreeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"","reference":"Sahih al-Bukhari 1216, Book 21, Hadith 20","grade":"","question #":"question #3","question":"What changes in practice regarding greetings during prayer are highlighted in this narration?","id":"bukhari-21-71"},{"hadith-eng":"Allah's Messenger (ﷺ) sent me for some job and when I had finished it I returned and came to the Prophet (ﷺ) \nand greeted him but he did not return my greeting. So I felt so sorry that only Allah knows it and I \nsaid to myself,, 'Perhaps Allah's Messenger (ﷺ) is angry because I did not come quickly, then again I greeted \nhim but he did not reply. I felt even more sorry than I did the first time. Again I greeted him and he \nreturned the greeting and said, \"The thing which prevented me from returning the greeting was that I \nwas praying.\" And at that time he was on his Rahila and his face was not towards the Qibla.","reference":"Sahih al-Bukhari 1217, Book 21, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of facing the Qibla during prayer, and are there exceptions to this rule?","id":"bukhari-21-72"},{"hadith-eng":"The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's \nApostle and so he went to them along with some of his companions to affect a reconciliation. Allah's \nApostle was delayed there and the time for the prayer became due. Bilal came to Abu Bakr! and said, \n\"O Abu Bakr! Allah's Messenger (ﷺ) is detained (there) and the time for the prayer is due. Will you lead the \npeople in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu \nBakr went forward and the people said Takbir. In the meantime, Allah's Messenger (ﷺ) came piercing \nthrough the rows till he stood in the (first) row and the people started clapping. Abu Bakr, would \nnever look hither and thither during the prayer but when the people clapped much he looked back and \nsaw Allah's Messenger (ﷺ). The Prophet (ﷺ) beckoned him to carry on. Abu Bakr raised both his hands, praised \nAllah and retreated till he stood in the row and Allah's Messenger (ﷺ) went forward and led the people in the \nprayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you \nstart clapping when something happened to you in the prayer? Clapping is for women. Whenever one \nis confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the \nProphet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I \nbeckoned you to carry on?\" Abu Bakr replied, \"It does not befit the son of Al Quhafa to lead the \nprayer in the presence of Allah's Messenger (ﷺ).","reference":"Sahih al-Bukhari 1218, Book 21, Hadith 22","grade":"","question #":"question #3","question":"What is the significance of humility and respect in leadership roles within a religious context?","id":"bukhari-21-73"},{"hadith-eng":"It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira \nfrom the Prophet.)","reference":"Sahih al-Bukhari 1219, Book 21, Hadith 23","grade":"","question #":"question #3","question":"How does maintaining proper posture in prayer reflect one's respect and devotion?","id":"bukhari-21-74"},{"hadith-eng":"It was forbidden to pray with the hands over one's hips.","reference":"Sahih al-Bukhari 1220, Book 21, Hadith 24","grade":"","question #":"question #3","question":"What are some actions that are considered inappropriate during prayer according to Islamic teachings?","id":"bukhari-21-75"},{"hadith-eng":"I offered the `Asr prayer with the Prophet (ﷺ) and after finishing the prayer with Taslim he got up quickly \nand went to some of his wives and then came out. He noticed the signs of astonishment on the faces of \nthe people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of \ngold was Lying in my house and I disliked that it should remain with us throughout the night, and so I \nhave ordered it to be distributed.\"","reference":"Sahih al-Bukhari 1221, Book 21, Hadith 25","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) priorities regarding wealth and charity?","id":"bukhari-21-76"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the Adhan for the prayer is pronounced, then Satan takes to his heels \npassing wind so that he may not hear the Adhan and when the Mu'adh-dhin finishes, he comes back; \nand when the Iqama is pronounced he again takes to his heels and when it is finished, he again comes \nback and continues reminding the praying person of things that he used not to remember when not in \nprayer till he forgets how much he has prayed.\" Abu Salama bin `Abdur-Rahman said, \"If anyone of \nyou has such a thing (forgetting the number of rak`at he has prayed) he should perform two \nprostrations of Sahu (i.e. forgetfulness) while sitting.\" Abu Salama narrates this from Abu Huraira.","reference":"Sahih al-Bukhari 1222, Book 21, Hadith 26","grade":"","question #":"question #3","question":"What is the significance of performing the prostrations of forgetfulness in prayer?","id":"bukhari-21-77"},{"hadith-eng":"People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of \nthe Prophet) and asked him, \"Which Sura did Allah's Messenger (ﷺ) s recite yesterday in the `Isha' prayer?\" \nHe said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I \nknow. He recited such and such Sura.\"","reference":"Sahih al-Bukhari 1223, Book 21, Hadith 27","grade":"","question #":"question #3","question":"What does this narration suggest about the role of individual responsibility in learning and retaining religious knowledge?","id":"bukhari-21-78"}]