[{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it \nand the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except \nParadise.\"","reference":"Sahih al-Bukhari 1773, Book 26, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of performing `Umra in terms of expiation for sins?","id":"bukhari-26-1"},{"hadith-eng":"`Ikrima bin Khalid asked Ibn `Umar about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar also said, 'The Prophet (ﷺ) had performed `Umra before performing Hajj.'\"Narrated `Ikrima bin Khalid:\"I asked Ibn `Umar the same (as above).\"","reference":"Sahih al-Bukhari 1774, Book 26, Hadith 2","grade":"","question #":"question #1","question":"Is it permissible to perform `Umra before Hajj according to Islamic teachings?","id":"bukhari-26-2"},{"hadith-eng":"Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1775, 1776, Book 26, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of verifying information about the Prophet's actions before accepting it as truth?","id":"bukhari-26-3"},{"hadith-eng":"Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1775, 1776, Book 26, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of verifying information about the Prophet's actions in Islamic tradition?","id":"bukhari-26-4"},{"hadith-eng":"I asked `Aisha (whether the Prophet (ﷺ) had performed `Umra in Rajab). She replied, \"Allah's Messenger (ﷺ) \nnever performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1777, Book 26, Hadith 4","grade":"","question #":"question #1","question":"Did the Prophet Muhammad (ﷺ) perform `Umra during the month of Rajab?","id":"bukhari-26-5"},{"hadith-eng":"I asked Anas how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times. 1. `Umra of \nHudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- \nQa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the \nwar booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he \nperform Hajj?\" He (Anas) replied, \"Once. \"","reference":"Sahih al-Bukhari 1778, Book 26, Hadith 5","grade":"","question #":"question #1","question":"How many times did the Prophet Muhammad (ﷺ) perform `Umra and what were the circumstances of each `Umra?","id":"bukhari-26-6"},{"hadith-eng":"I asked Anas (about the Prophet's `Umra) and he replied, \"The Prophet (ﷺ) performed `Umra when the \npagans made him return, and Umra of al-Hudaibiya (the next year), and another `Umra in Dhi-l-Qa'da, \nand another `Umra in combination with his Hajj.\"","reference":"Sahih al-Bukhari 1779, Book 26, Hadith 6","grade":"","question #":"question #1","question":"How many times did the Prophet Muhammad (ﷺ) perform `Umra according to Anas?","id":"bukhari-26-7"},{"hadith-eng":"The Prophet (ﷺ) performed four `Umra (three) in Dhi-l-Qa'da except the (one) `Umra which he performed \nwith his Hajj: His `Umra from Al-hudaibiya, and the one of the following year, and the one from Al- \nJr'rana where he distributed the booty (of the battle) of Hunain, and another `Umra with his Hajj.","reference":"Sahih al-Bukhari 1780, Book 26, Hadith 7","grade":"","question #":"question #1","question":"How many times did the Prophet Muhammad (ﷺ) perform `Umra and during which occasions?","id":"bukhari-26-8"},{"hadith-eng":"I asked Masruq, `Ata' and Mujahid (about the `Umra of Allah's Messenger (ﷺ)). They said, \"Allah's Messenger (ﷺ) \nhad performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib saying, \n\"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"","reference":"Sahih al-Bukhari 1781, Book 26, Hadith 8","grade":"","question #":"question #1","question":"How many times did the Prophet Muhammad (ﷺ) perform 'Umra before performing Hajj?","id":"bukhari-26-9"},{"hadith-eng":"I heard Ibn `Abbas saying, \"Allah's Messenger (ﷺ) asked an Ansari woman (Ibn `Abbas named her but `Ata' \nforgot her name), 'What prevented you from performing Hajj with us?' She replied, 'We have a camel \nand the father of so-and-so and his son (i.e. her husband and her son) rode it and left one camel for us \nto use for irrigation.' He said (to her), 'Perform `Umra when Ramadan comes, for `Umra in Ramadan \nis equal to Hajj (in reward),' or said something similar.\"","reference":"Sahih al-Bukhari 1782, Book 26, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of performing Umra during Ramadan in terms of reward?","id":"bukhari-26-10"},{"hadith-eng":"We set out along with Allah's Messenger (ﷺ) shortly before the appearance of the new moon (crescent) of the \nmonth of Dhi-l-Hijja and he said to us, \"Whoever wants to assume Ihram for Hajj may do so; and \nwhoever wants to assume Ihram for `Umra may do so. Hadn't I brought the Hadi (animal for \nsacrificing) (with me), I would have assumed Ihram for `Umra.\" (`Aisha added,): So some of us \nassumed Ihram for `Umra while the others for Hajj. I was amongst those who assumed Ihram for \n`Umra. The day of `Arafat approached and I was still menstruating. I complained to the Prophet (ﷺ) \n(about that) and he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for \nHajj;.\" When it was the night of Hasba, he sent `Abdur Rahman with me to at-Tan`im and I assumed \nIhram for `Umra (and performed it) in lieu of my missed `Umra.","reference":"Sahih al-Bukhari 1783, Book 26, Hadith 10","grade":"","question #":"question #1","question":"What are the different intentions a pilgrim can have when assuming Ihram during the month of Dhi-l-Hijja?","id":"bukhari-26-11"},{"hadith-eng":"`Abdur-Rahman bin Abu Bakr told me that the Prophet (ﷺ) had ordered him to let `Aisha ride behind him \nand to make her perform `Umra from at-Tan`im.","reference":"Sahih al-Bukhari 1784, Book 26, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of performing 'Umra from at-Tan'im in Islamic tradition?","id":"bukhari-26-12"},{"hadith-eng":"The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha had \nthe Hadi with them. `Ali had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have \nassumed Ihram with an intention like that of Allah's Messenger (ﷺ) has assumed it.\" The Prophet (ﷺ) ordered his \ncompanions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the \nKa`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the \nexception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private \norgans of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The \nProphet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I \ndid not have the Hadi with me I would have finished my Ihram.\" `Aisha got her menses and \nperformed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her \nmenses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Messenger (ﷺ)! You (people) \nare returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur \nRahman bin Abu Bakr to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the \nmonth of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet (ﷺ) at Al-`Aqaba (Jamrat-ul 'Aqaba) \nwhile the latter was stoning it and said, \"O Allah's Messenger (ﷺ)! Is this permissible only for you?\" The \nProphet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before \nHajj.\"","reference":"Sahih al-Bukhari 1785, Book 26, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of performing both Hajj and Umrah during the month of Dhi-l-Hijja?","id":"bukhari-26-13"},{"hadith-eng":"We set out with Allah's Messenger (ﷺ) shortly before the appearance of the new moon of Dhi-l-Hijja and he \nsaid, \"Whoever wants to assume Ihram for `Umra may do so, and whoever wants to assume Ihram for \nHajj may do so. Had not I brought the Hadi with me, I would have assumed Ihram for `Umra.\" Some \nof the people assumed Ihram for `Umra while others for Hajj. I was amongst those who had assumed \nIhram for `Umra. I got my menses before entering Mecca, and was menstruating till the day of \n`Arafat. I complained to Allah's Messenger (ﷺ) about it, he said, \"Abandon your `Umra, undo and comb your \nhair, and assume Ihram for Hajj.\" So, I did that accordingly. When it was the night of Hasba (day of \ndeparture from Mina), the Prophet (ﷺ) sent `Abdur Rahman with me to at-Tan`im. \nThe sub-narrator adds: He (`Abdur-Rahman) let her ride behind him. And she assumed Ihram for \n`Umra in lieu of the abandoned one. Aisha completed her Hajj and `Umra, and no Hadi, Sadaqa \n(charity), or fasting was obligatory for her.","reference":"Sahih al-Bukhari 1786, Book 26, Hadith 13","grade":"","question #":"question #1","question":"What should a woman do if she gets her menses before completing her Umrah during Hajj?","id":"bukhari-26-14"},{"hadith-eng":"That `Aisha said, \"O Allah's Messenger (ﷺ)! The people are returning after performing the two Nusuks (i.e. \nHajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your \nmenses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch \na place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you \nwill undergo while performing it).","reference":"Sahih al-Bukhari 1787, Book 26, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of performing Umrah after becoming clean from menses in Islamic teachings?","id":"bukhari-26-15"},{"hadith-eng":"We set out assuming the Ihram for Hajj in the months of Hajj towards the sacred precincts of Hajj. We \ndismounted at Sarif and the Prophet (ﷺ) said to his companions, \"Whoever has not got the Hadi with him \nand likes to make it as `Umra, he should do it, but he who has got the Hadi with him should not do it.\" \nThe Prophet (ﷺ) and some of his wealthy companions had the Hadi with them, so they did not finish \nIhram after performing the `Umra. The Prophet (ﷺ) came to me while I was weeping. He asked me the \nreason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the \n`Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is \nno harm in it as you are one of the daughters of Adam and the same is written for you as for others. \nSo, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, \nI carried on till we departed from Mina and halted at Al-Mahassab. The Prophet (ﷺ) called `Abdur- \nRahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and \nafter both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at \nmidnight and the Prophet (ﷺ) asked us, \"Have you finished?\" I replied in the affirmative. He announced \nthe departure and the people set out for the journey and some of them had performed the Tawaf of the \nKa`ba before the morning prayer, and after that the Prophet (ﷺ) set out for Medina.","reference":"Sahih al-Bukhari 1788, Book 26, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of having the Hadi during Hajj and how does it affect the performance of Umrah?","id":"bukhari-26-16"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) while he was at Ji'rana. The man was wearing a cloak which had traces of \nKhaluq or Sufra (a kind of perfume). The man asked (the Prophet (ﷺ) ), 'What do you order me to perform \nin my `Umra?' So, Allah inspired the Prophet (ﷺ) divinely and he was screened by a place of cloth. I \nwished to see the Prophet (ﷺ) being divinely inspired. `Umar said to me, 'Come! Will you be pleased to \nlook at the Prophet (ﷺ) while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner \nof the cloth and I looked at the Prophet (ﷺ) who was snoring. (The sub-narrator thought that he said: The \nsnoring was like that of a camel). When that state was over, the Prophet (ﷺ) asked, \"Where is the \nquestioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your \nbody and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. \nthe Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"","reference":"Sahih al-Bukhari 1789, Book 26, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of divine inspiration in guiding the Prophet's responses to questions?","id":"bukhari-26-17"},{"hadith-eng":"While I was a youngster, I asked `Aisha the wife of the Prophet. \"What about the meaning of the \nStatement of Allah; \n\"Verily! (the mountains) As-Safa and Al Marwa, are among the symbols of Allah. So, it is not \nharmful if those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them? (2.158) I understand (from that) that there is no harm if somebody does not \nperform the Tawaf between them.\" `Aisha replied, \"No, for if it were as you are saying, then the \nrecitation would have been like this: 'It is not harmful not to perform Tawaf between them.' This verse \nwas revealed in connection with the Ansar who used to assume the Ihram for the idol Manat which \nwas put beside a place called Qudaid and those people thought it not right to perform the Tawaf of As- \nSafa and Al-Marwa. When Islam came, they asked Allah's Messenger (ﷺ) about that, and Allah revealed:-- \n\"Verily! (the mountains) As-Safa and Al-Marwa Are among the symbols of Allah. So, it is not \nharmful of those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them.\" (2.158) Sufyan and Abu Muawiya added from Hisham (from `Aisha): \"The \nHajj or `Umra of the person who does not perform the going (Tawaf) between As-Safa and Al-Marwa \nis incomplete in Allah's sight.","reference":"Sahih al-Bukhari 1790, Book 26, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of performing Tawaf between As-Safa and Al-Marwa during Hajj or Umrah?","id":"bukhari-26-18"},{"hadith-eng":"`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"","reference":"Sahih al-Bukhari 1791, 1792, Book 26, Hadith 18","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) perform during his `Umra in Mecca?","id":"bukhari-26-19"},{"hadith-eng":"`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"","reference":"Sahih al-Bukhari 1791, 1792, Book 26, Hadith 18","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) perform during `Umra in Mecca?","id":"bukhari-26-20"},{"hadith-eng":"We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","reference":"Sahih al-Bukhari 1793, 1794, Book 26, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of performing Tawaf between As-Safa and Al-Marwa during Hajj or Umrah?","id":"bukhari-26-21"},{"hadith-eng":"We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","reference":"Sahih al-Bukhari 1793, 1794, Book 26, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of completing the Tawaf between As-Safa and Al-Marwa during Hajj or Umrah?","id":"bukhari-26-22"},{"hadith-eng":"I came to the Prophet (ﷺ) at Al-Batha' while his camel was kneeling down and he asked me, \"Have you \nintended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have \nyou assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. \nHe said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- \nMarwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between \nAs-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. \nLater I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of \n`Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till \nyou finish from Hajj, if you follow the Prophet (ﷺ) then he did not finish his Ihram till the Hadi (sacrifice) \nhad reached its place of slaughtering (Hajj-al-Qiran).","reference":"Sahih al-Bukhari 1795, Book 26, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of assuming Ihram with the same intention as the Prophet during Hajj?","id":"bukhari-26-23"},{"hadith-eng":"`Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed \nby Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, \nand at that time we were traveling with light luggage; we had a few riding animals and a little food \nration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had \npassed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- \nMarwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"","reference":"Sahih al-Bukhari 1796, Book 26, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of performing Tawaf and Sa'i during Umrah according to Islamic tradition?","id":"bukhari-26-24"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to say Takbir thrice at \nevery elevation of the ground and then would say, \"None has the right to be worshipped but Allah; He \nis One and has no partner. All the kingdoms is for Him, and all the praises are for Him, and He is \nOmnipotent. We are returning with repentance, worshipping, prostrating, and praising our Lord. He \nhas kept up His promise and made His slave victorious, and He Alone defeated all the clans of (nonbelievers).","reference":"Sahih al-Bukhari 1797, Book 26, Hadith 22","grade":"","question #":"question #1","question":"What phrases did the Prophet Muhammad (ﷺ) recite upon returning from a journey such as Ghazwa, Hajj, or `Umra?","id":"bukhari-26-25"},{"hadith-eng":"When the Prophet (ﷺ) arrived at Mecca, some boys of the tribe of Bani `Abdul Muttalib went to receive \nhim, and the Prophet (ﷺ) made one of them ride in front of him and the other behind him.","reference":"Sahih al-Bukhari 1798, Book 26, Hadith 23","grade":"","question #":"question #1","question":"What significance does the Prophet's interaction with the children of Bani Abdul Muttalib hold in Islamic tradition?","id":"bukhari-26-26"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) left for Mecca, he used to pray in the mosque of Ash-Shajra, and when he \nreturned (to Medina), he used to pray in the middle of the valley of Dhul-Hulaifa and used to pass the \nnight there till morning.","reference":"Sahih al-Bukhari 1799, Book 26, Hadith 24","grade":"","question #":"question #1","question":"What were the specific practices of the Prophet Muhammad (ﷺ) when traveling to and from Mecca?","id":"bukhari-26-27"},{"hadith-eng":"The Prophet (ﷺ) never returned to his family from a journey at night. He used to return either in the \nmorning or in the afternoon.","reference":"Sahih al-Bukhari 1800, Book 26, Hadith 25","grade":"","question #":"question #1","question":"What can be learned about the Prophet's (ﷺ) travel habits and consideration for his family?","id":"bukhari-26-28"},{"hadith-eng":"The Prophet (ﷺ) forbade going to one's family at night (on arrival from a journey).","reference":"Sahih al-Bukhari 1801, Book 26, Hadith 26","grade":"","question #":"question #1","question":"What guidance did the Prophet (ﷺ) provide regarding the timing of returning to one's family after a journey?","id":"bukhari-26-29"},{"hadith-eng":"Anas said, \"Whenever Allah's Messenger (ﷺ) returned from a journey, he, on seeing the high places of \nMedina, would make his she-camel proceed faster; and if it were another animal, even then he used to \nmake it proceed faster.\" \nNarrated Humaid that the Prophet (ﷺ) used to make it proceed faster out of his love for Medina.Narrated Anas:As above, but mentioned \"the walls of Medina\" instead of \"the high places of Medina.\" Al-Harith bin `Umar agrees with Anas.","reference":"Sahih al-Bukhari 1802, Book 26, Hadith 27","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take upon returning to Medina from a journey?","id":"bukhari-26-30"},{"hadith-eng":"I heard Al-Bara' saying, \"The above Verse was revealed regarding us, for the Ansar on returning from \nHajj never entered their houses through the proper doors but from behind. One of the Ansar came and \nentered through the door and he was taunted for it. Therefore, the following was revealed: -- \n\"It is not righteousness That you enter the houses from the back, But the righteous man is He who \nfears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through \nthe proper doors.\" (2.189)","reference":"Sahih al-Bukhari 1803, Book 26, Hadith 28","grade":"","question #":"question #1","question":"What cultural practices were addressed by the revelation of the verse mentioned in the narration?","id":"bukhari-26-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping \nproperly. So, when one's needs are fulfilled, one should return quickly to one's family.\"","reference":"Sahih al-Bukhari 1804, Book 26, Hadith 29","grade":"","question #":"question #1","question":"What are the challenges associated with traveling according to Islamic teachings?","id":"bukhari-26-32"},{"hadith-eng":"I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was \nseriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered \nthe Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet (ﷺ) had to hasten \nwhen traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and \nthe `Isha prayers together).","reference":"Sahih al-Bukhari 1805, Book 26, Hadith 30","grade":"","question #":"question #1","question":"What is the ruling on combining prayers during travel in Islam?","id":"bukhari-26-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it \nand the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except \nParadise.\"","reference":"Sahih al-Bukhari 1773, Book 26, Hadith 1","grade":"","question #":"question #2","question":"What is the ultimate reward for a Hajj that is accepted by Allah?","id":"bukhari-26-34"},{"hadith-eng":"`Ikrima bin Khalid asked Ibn `Umar about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar also said, 'The Prophet (ﷺ) had performed `Umra before performing Hajj.'\"Narrated `Ikrima bin Khalid:\"I asked Ibn `Umar the same (as above).\"","reference":"Sahih al-Bukhari 1774, Book 26, Hadith 2","grade":"","question #":"question #2","question":"What was the practice of the Prophet Muhammad (ﷺ) regarding the sequence of `Umra and Hajj?","id":"bukhari-26-35"},{"hadith-eng":"Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1775, 1776, Book 26, Hadith 3","grade":"","question #":"question #2","question":"How did Aisha, the Mother of the Believers, contribute to the understanding of the Prophet's practices?","id":"bukhari-26-36"},{"hadith-eng":"I asked `Aisha (whether the Prophet (ﷺ) had performed `Umra in Rajab). She replied, \"Allah's Messenger (ﷺ) \nnever performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1777, Book 26, Hadith 4","grade":"","question #":"question #2","question":"What is the significance of verifying historical events in Islamic tradition?","id":"bukhari-26-37"},{"hadith-eng":"I asked Anas how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times. 1. `Umra of \nHudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- \nQa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the \nwar booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he \nperform Hajj?\" He (Anas) replied, \"Once. \"","reference":"Sahih al-Bukhari 1778, Book 26, Hadith 5","grade":"","question #":"question #2","question":"What is the significance of the `Umra performed by the Prophet Muhammad (ﷺ) during the peace treaty with the pagans?","id":"bukhari-26-38"},{"hadith-eng":"I asked Anas (about the Prophet's `Umra) and he replied, \"The Prophet (ﷺ) performed `Umra when the \npagans made him return, and Umra of al-Hudaibiya (the next year), and another `Umra in Dhi-l-Qa'da, \nand another `Umra in combination with his Hajj.\"","reference":"Sahih al-Bukhari 1779, Book 26, Hadith 6","grade":"","question #":"question #2","question":"What significant events are associated with the Prophet's `Umra performances?","id":"bukhari-26-39"},{"hadith-eng":"The Prophet (ﷺ) performed four `Umra (three) in Dhi-l-Qa'da except the (one) `Umra which he performed \nwith his Hajj: His `Umra from Al-hudaibiya, and the one of the following year, and the one from Al- \nJr'rana where he distributed the booty (of the battle) of Hunain, and another `Umra with his Hajj.","reference":"Sahih al-Bukhari 1780, Book 26, Hadith 7","grade":"","question #":"question #2","question":"What is the significance of performing `Umra during the month of Dhi-l-Qa'da?","id":"bukhari-26-40"},{"hadith-eng":"I asked Masruq, `Ata' and Mujahid (about the `Umra of Allah's Messenger (ﷺ)). They said, \"Allah's Messenger (ﷺ) \nhad performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib saying, \n\"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"","reference":"Sahih al-Bukhari 1781, Book 26, Hadith 8","grade":"","question #":"question #2","question":"In which Islamic month did the Prophet Muhammad (ﷺ) perform 'Umra before his Hajj?","id":"bukhari-26-41"},{"hadith-eng":"I heard Ibn `Abbas saying, \"Allah's Messenger (ﷺ) asked an Ansari woman (Ibn `Abbas named her but `Ata' \nforgot her name), 'What prevented you from performing Hajj with us?' She replied, 'We have a camel \nand the father of so-and-so and his son (i.e. her husband and her son) rode it and left one camel for us \nto use for irrigation.' He said (to her), 'Perform `Umra when Ramadan comes, for `Umra in Ramadan \nis equal to Hajj (in reward),' or said something similar.\"","reference":"Sahih al-Bukhari 1782, Book 26, Hadith 9","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address the concerns of those unable to perform Hajj?","id":"bukhari-26-42"},{"hadith-eng":"We set out along with Allah's Messenger (ﷺ) shortly before the appearance of the new moon (crescent) of the \nmonth of Dhi-l-Hijja and he said to us, \"Whoever wants to assume Ihram for Hajj may do so; and \nwhoever wants to assume Ihram for `Umra may do so. Hadn't I brought the Hadi (animal for \nsacrificing) (with me), I would have assumed Ihram for `Umra.\" (`Aisha added,): So some of us \nassumed Ihram for `Umra while the others for Hajj. I was amongst those who assumed Ihram for \n`Umra. The day of `Arafat approached and I was still menstruating. I complained to the Prophet (ﷺ) \n(about that) and he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for \nHajj;.\" When it was the night of Hasba, he sent `Abdur Rahman with me to at-Tan`im and I assumed \nIhram for `Umra (and performed it) in lieu of my missed `Umra.","reference":"Sahih al-Bukhari 1783, Book 26, Hadith 10","grade":"","question #":"question #2","question":"How should a woman in menstruation proceed with her pilgrimage rituals according to Islamic teachings?","id":"bukhari-26-43"},{"hadith-eng":"`Abdur-Rahman bin Abu Bakr told me that the Prophet (ﷺ) had ordered him to let `Aisha ride behind him \nand to make her perform `Umra from at-Tan`im.","reference":"Sahih al-Bukhari 1784, Book 26, Hadith 11","grade":"","question #":"question #2","question":"What does this narration indicate about the relationship between the Prophet Muhammad (ﷺ) and Aisha?","id":"bukhari-26-44"},{"hadith-eng":"The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha had \nthe Hadi with them. `Ali had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have \nassumed Ihram with an intention like that of Allah's Messenger (ﷺ) has assumed it.\" The Prophet (ﷺ) ordered his \ncompanions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the \nKa`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the \nexception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private \norgans of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The \nProphet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I \ndid not have the Hadi with me I would have finished my Ihram.\" `Aisha got her menses and \nperformed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her \nmenses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Messenger (ﷺ)! You (people) \nare returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur \nRahman bin Abu Bakr to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the \nmonth of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet (ﷺ) at Al-`Aqaba (Jamrat-ul 'Aqaba) \nwhile the latter was stoning it and said, \"O Allah's Messenger (ﷺ)! Is this permissible only for you?\" The \nProphet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before \nHajj.\"","reference":"Sahih al-Bukhari 1785, Book 26, Hadith 12","grade":"","question #":"question #2","question":"How does the presence of the Hadi affect the completion of Ihram rituals during Hajj?","id":"bukhari-26-45"},{"hadith-eng":"We set out with Allah's Messenger (ﷺ) shortly before the appearance of the new moon of Dhi-l-Hijja and he \nsaid, \"Whoever wants to assume Ihram for `Umra may do so, and whoever wants to assume Ihram for \nHajj may do so. Had not I brought the Hadi with me, I would have assumed Ihram for `Umra.\" Some \nof the people assumed Ihram for `Umra while others for Hajj. I was amongst those who had assumed \nIhram for `Umra. I got my menses before entering Mecca, and was menstruating till the day of \n`Arafat. I complained to Allah's Messenger (ﷺ) about it, he said, \"Abandon your `Umra, undo and comb your \nhair, and assume Ihram for Hajj.\" So, I did that accordingly. When it was the night of Hasba (day of \ndeparture from Mina), the Prophet (ﷺ) sent `Abdur Rahman with me to at-Tan`im. \nThe sub-narrator adds: He (`Abdur-Rahman) let her ride behind him. And she assumed Ihram for \n`Umra in lieu of the abandoned one. Aisha completed her Hajj and `Umra, and no Hadi, Sadaqa \n(charity), or fasting was obligatory for her.","reference":"Sahih al-Bukhari 1786, Book 26, Hadith 13","grade":"","question #":"question #2","question":"What are the options for assuming Ihram when setting out for Hajj or Umrah?","id":"bukhari-26-46"},{"hadith-eng":"That `Aisha said, \"O Allah's Messenger (ﷺ)! The people are returning after performing the two Nusuks (i.e. \nHajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your \nmenses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch \na place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you \nwill undergo while performing it).","reference":"Sahih al-Bukhari 1787, Book 26, Hadith 14","grade":"","question #":"question #2","question":"How does the reward for performing Umrah relate to the expenses or hardships faced during the pilgrimage?","id":"bukhari-26-47"},{"hadith-eng":"We set out assuming the Ihram for Hajj in the months of Hajj towards the sacred precincts of Hajj. We \ndismounted at Sarif and the Prophet (ﷺ) said to his companions, \"Whoever has not got the Hadi with him \nand likes to make it as `Umra, he should do it, but he who has got the Hadi with him should not do it.\" \nThe Prophet (ﷺ) and some of his wealthy companions had the Hadi with them, so they did not finish \nIhram after performing the `Umra. The Prophet (ﷺ) came to me while I was weeping. He asked me the \nreason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the \n`Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is \nno harm in it as you are one of the daughters of Adam and the same is written for you as for others. \nSo, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, \nI carried on till we departed from Mina and halted at Al-Mahassab. The Prophet (ﷺ) called `Abdur- \nRahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and \nafter both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at \nmidnight and the Prophet (ﷺ) asked us, \"Have you finished?\" I replied in the affirmative. He announced \nthe departure and the people set out for the journey and some of them had performed the Tawaf of the \nKa`ba before the morning prayer, and after that the Prophet (ﷺ) set out for Medina.","reference":"Sahih al-Bukhari 1788, Book 26, Hadith 15","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address the concerns of those who are unable to perform certain rituals due to natural reasons?","id":"bukhari-26-48"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) while he was at Ji'rana. The man was wearing a cloak which had traces of \nKhaluq or Sufra (a kind of perfume). The man asked (the Prophet (ﷺ) ), 'What do you order me to perform \nin my `Umra?' So, Allah inspired the Prophet (ﷺ) divinely and he was screened by a place of cloth. I \nwished to see the Prophet (ﷺ) being divinely inspired. `Umar said to me, 'Come! Will you be pleased to \nlook at the Prophet (ﷺ) while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner \nof the cloth and I looked at the Prophet (ﷺ) who was snoring. (The sub-narrator thought that he said: The \nsnoring was like that of a camel). When that state was over, the Prophet (ﷺ) asked, \"Where is the \nquestioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your \nbody and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. \nthe Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"","reference":"Sahih al-Bukhari 1789, Book 26, Hadith 16","grade":"","question #":"question #2","question":"What are the steps involved in performing Umra according to the Prophet's guidance?","id":"bukhari-26-49"},{"hadith-eng":"While I was a youngster, I asked `Aisha the wife of the Prophet. \"What about the meaning of the \nStatement of Allah; \n\"Verily! (the mountains) As-Safa and Al Marwa, are among the symbols of Allah. So, it is not \nharmful if those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them? (2.158) I understand (from that) that there is no harm if somebody does not \nperform the Tawaf between them.\" `Aisha replied, \"No, for if it were as you are saying, then the \nrecitation would have been like this: 'It is not harmful not to perform Tawaf between them.' This verse \nwas revealed in connection with the Ansar who used to assume the Ihram for the idol Manat which \nwas put beside a place called Qudaid and those people thought it not right to perform the Tawaf of As- \nSafa and Al-Marwa. When Islam came, they asked Allah's Messenger (ﷺ) about that, and Allah revealed:-- \n\"Verily! (the mountains) As-Safa and Al-Marwa Are among the symbols of Allah. So, it is not \nharmful of those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them.\" (2.158) Sufyan and Abu Muawiya added from Hisham (from `Aisha): \"The \nHajj or `Umra of the person who does not perform the going (Tawaf) between As-Safa and Al-Marwa \nis incomplete in Allah's sight.","reference":"Sahih al-Bukhari 1790, Book 26, Hadith 17","grade":"","question #":"question #2","question":"How did the revelation of the verse regarding As-Safa and Al-Marwa address the concerns of the Ansar?","id":"bukhari-26-50"},{"hadith-eng":"`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"","reference":"Sahih al-Bukhari 1791, 1792, Book 26, Hadith 18","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) protect him during his `Umra in Mecca?","id":"bukhari-26-51"},{"hadith-eng":"`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"","reference":"Sahih al-Bukhari 1791, 1792, Book 26, Hadith 18","grade":"","question #":"question #2","question":"How did the companions protect the Prophet Muhammad (ﷺ) during his `Umra?","id":"bukhari-26-52"},{"hadith-eng":"We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","reference":"Sahih al-Bukhari 1793, 1794, Book 26, Hadith 19","grade":"","question #":"question #2","question":"What are the steps involved in completing the Tawaf ritual according to Islamic tradition?","id":"bukhari-26-53"},{"hadith-eng":"We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","reference":"Sahih al-Bukhari 1793, 1794, Book 26, Hadith 19","grade":"","question #":"question #2","question":"What actions did the Prophet Muhammad (ﷺ) perform upon arriving at Mecca according to this narration?","id":"bukhari-26-54"},{"hadith-eng":"I came to the Prophet (ﷺ) at Al-Batha' while his camel was kneeling down and he asked me, \"Have you \nintended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have \nyou assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. \nHe said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- \nMarwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between \nAs-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. \nLater I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of \n`Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till \nyou finish from Hajj, if you follow the Prophet (ﷺ) then he did not finish his Ihram till the Hadi (sacrifice) \nhad reached its place of slaughtering (Hajj-al-Qiran).","reference":"Sahih al-Bukhari 1795, Book 26, Hadith 20","grade":"","question #":"question #2","question":"What actions are involved in performing Tawaf and Sai during Hajj?","id":"bukhari-26-55"},{"hadith-eng":"`Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed \nby Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, \nand at that time we were traveling with light luggage; we had a few riding animals and a little food \nration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had \npassed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- \nMarwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"","reference":"Sahih al-Bukhari 1796, Book 26, Hadith 21","grade":"","question #":"question #2","question":"How did early Muslims manage their travel and resources during the pilgrimage?","id":"bukhari-26-56"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to say Takbir thrice at \nevery elevation of the ground and then would say, \"None has the right to be worshipped but Allah; He \nis One and has no partner. All the kingdoms is for Him, and all the praises are for Him, and He is \nOmnipotent. We are returning with repentance, worshipping, prostrating, and praising our Lord. He \nhas kept up His promise and made His slave victorious, and He Alone defeated all the clans of (nonbelievers).","reference":"Sahih al-Bukhari 1797, Book 26, Hadith 22","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) express gratitude and praise to Allah after returning from significant journeys?","id":"bukhari-26-57"},{"hadith-eng":"When the Prophet (ﷺ) arrived at Mecca, some boys of the tribe of Bani `Abdul Muttalib went to receive \nhim, and the Prophet (ﷺ) made one of them ride in front of him and the other behind him.","reference":"Sahih al-Bukhari 1798, Book 26, Hadith 23","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate kindness and inclusivity towards children during his travels?","id":"bukhari-26-58"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) left for Mecca, he used to pray in the mosque of Ash-Shajra, and when he \nreturned (to Medina), he used to pray in the middle of the valley of Dhul-Hulaifa and used to pass the \nnight there till morning.","reference":"Sahih al-Bukhari 1799, Book 26, Hadith 24","grade":"","question #":"question #2","question":"What significance does the mosque of Ash-Shajra hold in the journey of the Prophet Muhammad (ﷺ)?","id":"bukhari-26-59"},{"hadith-eng":"The Prophet (ﷺ) never returned to his family from a journey at night. He used to return either in the \nmorning or in the afternoon.","reference":"Sahih al-Bukhari 1800, Book 26, Hadith 25","grade":"","question #":"question #2","question":"Why might it be significant to avoid returning home from a journey at night?","id":"bukhari-26-60"},{"hadith-eng":"The Prophet (ﷺ) forbade going to one's family at night (on arrival from a journey).","reference":"Sahih al-Bukhari 1801, Book 26, Hadith 26","grade":"","question #":"question #2","question":"Why might it be discouraged to arrive at one's family during the night after traveling?","id":"bukhari-26-61"},{"hadith-eng":"Anas said, \"Whenever Allah's Messenger (ﷺ) returned from a journey, he, on seeing the high places of \nMedina, would make his she-camel proceed faster; and if it were another animal, even then he used to \nmake it proceed faster.\" \nNarrated Humaid that the Prophet (ﷺ) used to make it proceed faster out of his love for Medina.Narrated Anas:As above, but mentioned \"the walls of Medina\" instead of \"the high places of Medina.\" Al-Harith bin `Umar agrees with Anas.","reference":"Sahih al-Bukhari 1802, Book 26, Hadith 27","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) express his love for the city of Medina?","id":"bukhari-26-62"},{"hadith-eng":"I heard Al-Bara' saying, \"The above Verse was revealed regarding us, for the Ansar on returning from \nHajj never entered their houses through the proper doors but from behind. One of the Ansar came and \nentered through the door and he was taunted for it. Therefore, the following was revealed: -- \n\"It is not righteousness That you enter the houses from the back, But the righteous man is He who \nfears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through \nthe proper doors.\" (2.189)","reference":"Sahih al-Bukhari 1803, Book 26, Hadith 28","grade":"","question #":"question #2","question":"How does the Quran guide believers in distinguishing between cultural customs and acts of righteousness?","id":"bukhari-26-63"},{"hadith-eng":"The Prophet (ﷺ) said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping \nproperly. So, when one's needs are fulfilled, one should return quickly to one's family.\"","reference":"Sahih al-Bukhari 1804, Book 26, Hadith 29","grade":"","question #":"question #2","question":"Why is it recommended to return to one's family quickly after fulfilling travel needs?","id":"bukhari-26-64"},{"hadith-eng":"I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was \nseriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered \nthe Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet (ﷺ) had to hasten \nwhen traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and \nthe `Isha prayers together).","reference":"Sahih al-Bukhari 1805, Book 26, Hadith 30","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) manage his prayer schedule while traveling?","id":"bukhari-26-65"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it \nand the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except \nParadise.\"","reference":"Sahih al-Bukhari 1773, Book 26, Hadith 1","grade":"","question #":"question #3","question":"How does the performance of `Umra and Hajj relate to the concept of forgiveness and reward in Islam?","id":"bukhari-26-66"},{"hadith-eng":"`Ikrima bin Khalid asked Ibn `Umar about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar also said, 'The Prophet (ﷺ) had performed `Umra before performing Hajj.'\"Narrated `Ikrima bin Khalid:\"I asked Ibn `Umar the same (as above).\"","reference":"Sahih al-Bukhari 1774, Book 26, Hadith 2","grade":"","question #":"question #3","question":"How did Ibn `Umar respond to questions about the order of performing `Umra and Hajj?","id":"bukhari-26-67"},{"hadith-eng":"Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1775, 1776, Book 26, Hadith 3","grade":"","question #":"question #3","question":"What can be learned from the interaction between Urwa, Abdullah bin Umar, and Aisha regarding the performance of Umra by the Prophet?","id":"bukhari-26-68"},{"hadith-eng":"Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1775, 1776, Book 26, Hadith 3","grade":"","question #":"question #3","question":"What role does oral testimony play in the transmission of Islamic knowledge and history?","id":"bukhari-26-69"},{"hadith-eng":"I asked `Aisha (whether the Prophet (ﷺ) had performed `Umra in Rajab). She replied, \"Allah's Messenger (ﷺ) \nnever performed any `Umra in Rajab.\"","reference":"Sahih al-Bukhari 1777, Book 26, Hadith 4","grade":"","question #":"question #3","question":"How does Aisha's testimony contribute to our understanding of the Prophet's actions?","id":"bukhari-26-70"},{"hadith-eng":"I asked Anas how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times. 1. `Umra of \nHudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- \nQa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the \nwar booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he \nperform Hajj?\" He (Anas) replied, \"Once. \"","reference":"Sahih al-Bukhari 1778, Book 26, Hadith 5","grade":"","question #":"question #3","question":"How many times did the Prophet Muhammad (ﷺ) perform Hajj according to Anas?","id":"bukhari-26-71"},{"hadith-eng":"I asked Anas (about the Prophet's `Umra) and he replied, \"The Prophet (ﷺ) performed `Umra when the \npagans made him return, and Umra of al-Hudaibiya (the next year), and another `Umra in Dhi-l-Qa'da, \nand another `Umra in combination with his Hajj.\"","reference":"Sahih al-Bukhari 1779, Book 26, Hadith 6","grade":"","question #":"question #3","question":"What is the significance of performing `Umra in combination with Hajj?","id":"bukhari-26-72"},{"hadith-eng":"The Prophet (ﷺ) performed four `Umra (three) in Dhi-l-Qa'da except the (one) `Umra which he performed \nwith his Hajj: His `Umra from Al-hudaibiya, and the one of the following year, and the one from Al- \nJr'rana where he distributed the booty (of the battle) of Hunain, and another `Umra with his Hajj.","reference":"Sahih al-Bukhari 1780, Book 26, Hadith 7","grade":"","question #":"question #3","question":"What historical events are associated with the Prophet's `Umra performances?","id":"bukhari-26-73"},{"hadith-eng":"I asked Masruq, `Ata' and Mujahid (about the `Umra of Allah's Messenger (ﷺ)). They said, \"Allah's Messenger (ﷺ) \nhad performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib saying, \n\"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"","reference":"Sahih al-Bukhari 1781, Book 26, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of performing 'Umra before Hajj in the life of the Prophet Muhammad (ﷺ)?","id":"bukhari-26-74"},{"hadith-eng":"I heard Ibn `Abbas saying, \"Allah's Messenger (ﷺ) asked an Ansari woman (Ibn `Abbas named her but `Ata' \nforgot her name), 'What prevented you from performing Hajj with us?' She replied, 'We have a camel \nand the father of so-and-so and his son (i.e. her husband and her son) rode it and left one camel for us \nto use for irrigation.' He said (to her), 'Perform `Umra when Ramadan comes, for `Umra in Ramadan \nis equal to Hajj (in reward),' or said something similar.\"","reference":"Sahih al-Bukhari 1782, Book 26, Hadith 9","grade":"","question #":"question #3","question":"What alternatives are suggested for those who cannot perform Hajj due to logistical constraints?","id":"bukhari-26-75"},{"hadith-eng":"We set out along with Allah's Messenger (ﷺ) shortly before the appearance of the new moon (crescent) of the \nmonth of Dhi-l-Hijja and he said to us, \"Whoever wants to assume Ihram for Hajj may do so; and \nwhoever wants to assume Ihram for `Umra may do so. Hadn't I brought the Hadi (animal for \nsacrificing) (with me), I would have assumed Ihram for `Umra.\" (`Aisha added,): So some of us \nassumed Ihram for `Umra while the others for Hajj. I was amongst those who assumed Ihram for \n`Umra. The day of `Arafat approached and I was still menstruating. I complained to the Prophet (ﷺ) \n(about that) and he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for \nHajj;.\" When it was the night of Hasba, he sent `Abdur Rahman with me to at-Tan`im and I assumed \nIhram for `Umra (and performed it) in lieu of my missed `Umra.","reference":"Sahih al-Bukhari 1783, Book 26, Hadith 10","grade":"","question #":"question #3","question":"What is the significance of performing `Umra in lieu of a missed `Umra during Hajj?","id":"bukhari-26-76"},{"hadith-eng":"`Abdur-Rahman bin Abu Bakr told me that the Prophet (ﷺ) had ordered him to let `Aisha ride behind him \nand to make her perform `Umra from at-Tan`im.","reference":"Sahih al-Bukhari 1784, Book 26, Hadith 11","grade":"","question #":"question #3","question":"How does this narration reflect the Prophet's guidance on performing religious duties?","id":"bukhari-26-77"},{"hadith-eng":"The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha had \nthe Hadi with them. `Ali had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have \nassumed Ihram with an intention like that of Allah's Messenger (ﷺ) has assumed it.\" The Prophet (ﷺ) ordered his \ncompanions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the \nKa`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the \nexception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private \norgans of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The \nProphet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I \ndid not have the Hadi with me I would have finished my Ihram.\" `Aisha got her menses and \nperformed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her \nmenses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Messenger (ﷺ)! You (people) \nare returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur \nRahman bin Abu Bakr to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the \nmonth of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet (ﷺ) at Al-`Aqaba (Jamrat-ul 'Aqaba) \nwhile the latter was stoning it and said, \"O Allah's Messenger (ﷺ)! Is this permissible only for you?\" The \nProphet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before \nHajj.\"","reference":"Sahih al-Bukhari 1785, Book 26, Hadith 12","grade":"","question #":"question #3","question":"What provisions are made for women who experience menses during the Hajj rituals?","id":"bukhari-26-78"},{"hadith-eng":"We set out with Allah's Messenger (ﷺ) shortly before the appearance of the new moon of Dhi-l-Hijja and he \nsaid, \"Whoever wants to assume Ihram for `Umra may do so, and whoever wants to assume Ihram for \nHajj may do so. Had not I brought the Hadi with me, I would have assumed Ihram for `Umra.\" Some \nof the people assumed Ihram for `Umra while others for Hajj. I was amongst those who had assumed \nIhram for `Umra. I got my menses before entering Mecca, and was menstruating till the day of \n`Arafat. I complained to Allah's Messenger (ﷺ) about it, he said, \"Abandon your `Umra, undo and comb your \nhair, and assume Ihram for Hajj.\" So, I did that accordingly. When it was the night of Hasba (day of \ndeparture from Mina), the Prophet (ﷺ) sent `Abdur Rahman with me to at-Tan`im. \nThe sub-narrator adds: He (`Abdur-Rahman) let her ride behind him. And she assumed Ihram for \n`Umra in lieu of the abandoned one. Aisha completed her Hajj and `Umra, and no Hadi, Sadaqa \n(charity), or fasting was obligatory for her.","reference":"Sahih al-Bukhari 1786, Book 26, Hadith 13","grade":"","question #":"question #3","question":"Is any form of compensation required if a woman has to abandon her Umrah due to menstruation?","id":"bukhari-26-79"},{"hadith-eng":"That `Aisha said, \"O Allah's Messenger (ﷺ)! The people are returning after performing the two Nusuks (i.e. \nHajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your \nmenses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch \na place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you \nwill undergo while performing it).","reference":"Sahih al-Bukhari 1787, Book 26, Hadith 14","grade":"","question #":"question #3","question":"What guidance is provided for women who experience menses during Hajj or Umrah?","id":"bukhari-26-80"},{"hadith-eng":"We set out assuming the Ihram for Hajj in the months of Hajj towards the sacred precincts of Hajj. We \ndismounted at Sarif and the Prophet (ﷺ) said to his companions, \"Whoever has not got the Hadi with him \nand likes to make it as `Umra, he should do it, but he who has got the Hadi with him should not do it.\" \nThe Prophet (ﷺ) and some of his wealthy companions had the Hadi with them, so they did not finish \nIhram after performing the `Umra. The Prophet (ﷺ) came to me while I was weeping. He asked me the \nreason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the \n`Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is \nno harm in it as you are one of the daughters of Adam and the same is written for you as for others. \nSo, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, \nI carried on till we departed from Mina and halted at Al-Mahassab. The Prophet (ﷺ) called `Abdur- \nRahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and \nafter both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at \nmidnight and the Prophet (ﷺ) asked us, \"Have you finished?\" I replied in the affirmative. He announced \nthe departure and the people set out for the journey and some of them had performed the Tawaf of the \nKa`ba before the morning prayer, and after that the Prophet (ﷺ) set out for Medina.","reference":"Sahih al-Bukhari 1788, Book 26, Hadith 15","grade":"","question #":"question #3","question":"What steps did the Prophet (ﷺ) suggest for someone who could not perform Umrah initially due to specific circumstances?","id":"bukhari-26-81"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) while he was at Ji'rana. The man was wearing a cloak which had traces of \nKhaluq or Sufra (a kind of perfume). The man asked (the Prophet (ﷺ) ), 'What do you order me to perform \nin my `Umra?' So, Allah inspired the Prophet (ﷺ) divinely and he was screened by a place of cloth. I \nwished to see the Prophet (ﷺ) being divinely inspired. `Umar said to me, 'Come! Will you be pleased to \nlook at the Prophet (ﷺ) while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner \nof the cloth and I looked at the Prophet (ﷺ) who was snoring. (The sub-narrator thought that he said: The \nsnoring was like that of a camel). When that state was over, the Prophet (ﷺ) asked, \"Where is the \nquestioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your \nbody and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. \nthe Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"","reference":"Sahih al-Bukhari 1789, Book 26, Hadith 16","grade":"","question #":"question #3","question":"How should one prepare themselves physically before performing Umra?","id":"bukhari-26-82"},{"hadith-eng":"While I was a youngster, I asked `Aisha the wife of the Prophet. \"What about the meaning of the \nStatement of Allah; \n\"Verily! (the mountains) As-Safa and Al Marwa, are among the symbols of Allah. So, it is not \nharmful if those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them? (2.158) I understand (from that) that there is no harm if somebody does not \nperform the Tawaf between them.\" `Aisha replied, \"No, for if it were as you are saying, then the \nrecitation would have been like this: 'It is not harmful not to perform Tawaf between them.' This verse \nwas revealed in connection with the Ansar who used to assume the Ihram for the idol Manat which \nwas put beside a place called Qudaid and those people thought it not right to perform the Tawaf of As- \nSafa and Al-Marwa. When Islam came, they asked Allah's Messenger (ﷺ) about that, and Allah revealed:-- \n\"Verily! (the mountains) As-Safa and Al-Marwa Are among the symbols of Allah. So, it is not \nharmful of those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them.\" (2.158) Sufyan and Abu Muawiya added from Hisham (from `Aisha): \"The \nHajj or `Umra of the person who does not perform the going (Tawaf) between As-Safa and Al-Marwa \nis incomplete in Allah's sight.","reference":"Sahih al-Bukhari 1790, Book 26, Hadith 17","grade":"","question #":"question #3","question":"What does the verse about As-Safa and Al-Marwa indicate about the completeness of Hajj or Umrah?","id":"bukhari-26-83"},{"hadith-eng":"`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"","reference":"Sahih al-Bukhari 1791, 1792, Book 26, Hadith 18","grade":"","question #":"question #3","question":"What promise did the Prophet Muhammad (ﷺ) convey to Khadija regarding her place in Paradise?","id":"bukhari-26-84"},{"hadith-eng":"We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","reference":"Sahih al-Bukhari 1793, 1794, Book 26, Hadith 19","grade":"","question #":"question #3","question":"Why is it important to follow the example of the Prophet Muhammad (ﷺ) in performing religious rituals?","id":"bukhari-26-85"},{"hadith-eng":"We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"","reference":"Sahih al-Bukhari 1793, 1794, Book 26, Hadith 19","grade":"","question #":"question #3","question":"What are the implications of not completing the Tawaf between As-Safa and Al-Marwa before engaging in marital relations during pilgrimage?","id":"bukhari-26-86"},{"hadith-eng":"I came to the Prophet (ﷺ) at Al-Batha' while his camel was kneeling down and he asked me, \"Have you \nintended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have \nyou assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. \nHe said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- \nMarwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between \nAs-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. \nLater I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of \n`Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till \nyou finish from Hajj, if you follow the Prophet (ﷺ) then he did not finish his Ihram till the Hadi (sacrifice) \nhad reached its place of slaughtering (Hajj-al-Qiran).","reference":"Sahih al-Bukhari 1795, Book 26, Hadith 20","grade":"","question #":"question #3","question":"How did the practice of Ihram change during the caliphate of Umar in relation to the Holy Book and the Prophet's actions?","id":"bukhari-26-87"},{"hadith-eng":"`Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed \nby Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, \nand at that time we were traveling with light luggage; we had a few riding animals and a little food \nration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had \npassed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- \nMarwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"","reference":"Sahih al-Bukhari 1796, Book 26, Hadith 21","grade":"","question #":"question #3","question":"What is the process of transitioning from Umrah to Hajj in the same journey?","id":"bukhari-26-88"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to say Takbir thrice at \nevery elevation of the ground and then would say, \"None has the right to be worshipped but Allah; He \nis One and has no partner. All the kingdoms is for Him, and all the praises are for Him, and He is \nOmnipotent. We are returning with repentance, worshipping, prostrating, and praising our Lord. He \nhas kept up His promise and made His slave victorious, and He Alone defeated all the clans of (nonbelievers).","reference":"Sahih al-Bukhari 1797, Book 26, Hadith 22","grade":"","question #":"question #3","question":"What significance does the act of saying Takbir at elevations hold in Islamic tradition during travel?","id":"bukhari-26-89"},{"hadith-eng":"When the Prophet (ﷺ) arrived at Mecca, some boys of the tribe of Bani `Abdul Muttalib went to receive \nhim, and the Prophet (ﷺ) made one of them ride in front of him and the other behind him.","reference":"Sahih al-Bukhari 1798, Book 26, Hadith 23","grade":"","question #":"question #3","question":"What can be learned from the Prophet's actions regarding the treatment of family members and relatives?","id":"bukhari-26-90"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) left for Mecca, he used to pray in the mosque of Ash-Shajra, and when he \nreturned (to Medina), he used to pray in the middle of the valley of Dhul-Hulaifa and used to pass the \nnight there till morning.","reference":"Sahih al-Bukhari 1799, Book 26, Hadith 24","grade":"","question #":"question #3","question":"Why did the Prophet Muhammad (ﷺ) choose to spend the night in the valley of Dhul-Hulaifa during his travels?","id":"bukhari-26-91"},{"hadith-eng":"The Prophet (ﷺ) never returned to his family from a journey at night. He used to return either in the \nmorning or in the afternoon.","reference":"Sahih al-Bukhari 1800, Book 26, Hadith 25","grade":"","question #":"question #3","question":"How does the timing of returning from a journey reflect on family dynamics and well-being?","id":"bukhari-26-92"},{"hadith-eng":"The Prophet (ﷺ) forbade going to one's family at night (on arrival from a journey).","reference":"Sahih al-Bukhari 1801, Book 26, Hadith 26","grade":"","question #":"question #3","question":"What are the potential implications of arriving home at night on family dynamics according to Islamic teachings?","id":"bukhari-26-93"},{"hadith-eng":"Anas said, \"Whenever Allah's Messenger (ﷺ) returned from a journey, he, on seeing the high places of \nMedina, would make his she-camel proceed faster; and if it were another animal, even then he used to \nmake it proceed faster.\" \nNarrated Humaid that the Prophet (ﷺ) used to make it proceed faster out of his love for Medina.Narrated Anas:As above, but mentioned \"the walls of Medina\" instead of \"the high places of Medina.\" Al-Harith bin `Umar agrees with Anas.","reference":"Sahih al-Bukhari 1802, Book 26, Hadith 27","grade":"","question #":"question #3","question":"What significance did the city of Medina hold for the Prophet (ﷺ) according to the companions?","id":"bukhari-26-94"},{"hadith-eng":"I heard Al-Bara' saying, \"The above Verse was revealed regarding us, for the Ansar on returning from \nHajj never entered their houses through the proper doors but from behind. One of the Ansar came and \nentered through the door and he was taunted for it. Therefore, the following was revealed: -- \n\"It is not righteousness That you enter the houses from the back, But the righteous man is He who \nfears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through \nthe proper doors.\" (2.189)","reference":"Sahih al-Bukhari 1803, Book 26, Hadith 28","grade":"","question #":"question #3","question":"What is the significance of entering houses through the proper doors in the context of righteousness and obedience to Allah?","id":"bukhari-26-95"},{"hadith-eng":"The Prophet (ﷺ) said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping \nproperly. So, when one's needs are fulfilled, one should return quickly to one's family.\"","reference":"Sahih al-Bukhari 1804, Book 26, Hadith 29","grade":"","question #":"question #3","question":"How does traveling affect a person's daily routine and well-being?","id":"bukhari-26-96"},{"hadith-eng":"I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was \nseriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered \nthe Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet (ﷺ) had to hasten \nwhen traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and \nthe `Isha prayers together).","reference":"Sahih al-Bukhari 1805, Book 26, Hadith 30","grade":"","question #":"question #3","question":"What circumstances allow for the combination of Maghrib and Isha prayers according to Islamic teachings?","id":"bukhari-26-97"}]