[{"hadith-eng":"My father set out (for Mecca) in the year of Al-Hudaibiya, and his companions assumed Ihram, but he \ndid not. At that time the Prophet (ﷺ) was informed that an enemy wanted to attack him, so the Prophet (ﷺ) \nproceeded onwards. While my father was among his companions, some of them laughed among \nthemselves. (My father said), \"I looked up and saw an onager. I attacked, stabbed and caught it. I then \nsought my companions' help but they refused to help me. (Later) we all ate its meat. We were afraid \nthat we might be left behind (separated) from the Prophet (ﷺ) so I went in search of the Prophet (ﷺ) and made \nmy horse to run at a galloping speed at times and let it go slow at an ordinary speed at other times till I \nmet a man from the tribe of Bani Ghifar at midnight. I asked him, \"Where did you leave the Prophet (ﷺ) \n?\" He replied, \"I left him at Ta'hun and he had the intention of having the midday rest at As-Suqya. I \nfollowed the trace and joined the Prophet (ﷺ) and said, 'O Allah's Messenger (ﷺ)! Your people (companions) \nsend you their compliments, and (ask for) Allah's Blessings upon you. They are afraid lest they may \nbe left behind; so please wait for them.' I added, 'O Allah's Messenger (ﷺ)! I hunted an onager and some of \nits meat is with me. The Prophet (ﷺ) told the people to eat it though all of them were in the state of \nIhram.\"","reference":"Sahih al-Bukhari 1821, Book 28, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of Ihram in the context of hunting and eating meat during a journey?","id":"bukhari-28-1"},{"hadith-eng":"That his father said \"We proceeded with the Prophet (ﷺ) in the year of Al-Hudaibiya and his companions \nassumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on \ntowards them. My companions saw an onager and some of them started laughing among themselves. I \nlooked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my \ncompanions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I \nfollowed Allah's Messenger (ﷺ) lest we should be left behind. At times I urged my horse to run at a galloping \nspeed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani \nGhifar at midnight. I asked him where he had left Allah's Messenger (ﷺ) . The man replied that he had left \nthe Prophet (ﷺ) at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. \nSo, I followed Allah's Messenger (ﷺ) till I reached him and said, \"O Allah's Messenger (ﷺ)! I have been sent by my \ncompanions who send you their greetings and compliments and ask for Allah's Mercy and Blessings \nupon you. They were afraid lest the enemy might intervene between you and them; so please wait for \nthem.\" So he did. Then I said, \"O Allah's Messenger (ﷺ)! We have hunted an onager and have some of it (i.e. \nits meat) left over.\" Allah's Messenger (ﷺ) told his companions to eat the meat although all of them were in a \nstate of Ihram.\"","reference":"Sahih al-Bukhari 1822, Book 28, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of the Prophet's decision to allow his companions to eat the hunted onager while in a state of Ihram?","id":"bukhari-28-2"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) at a place called Al-Qaha (which is at a distance of three \nstages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in \nthe company of the Prophet (ﷺ) at a place called Al-Qaha and some of us had assumed Ihram while the \nothers had not. I noticed that some of my companions were watching something, so I looked up and \nsaw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked \nthem to pick it up for me) but they said, \"We will not help you by any means as we are in a state of \nIhram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and \nslaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \n\"Do not eat it.\" So, I went to the Prophet (ﷺ) who was ahead of us and asked him about it, He replied, \"Eat \nit as it is Halal (i.e. it is legal to eat it).","reference":"Sahih al-Bukhari 1823, Book 28, Hadith 3","grade":"","question #":"question #1","question":"What is the ruling on eating game meat while in a state of Ihram?","id":"bukhari-28-3"},{"hadith-eng":"That his father had told him that Allah's Messenger (ﷺ) set out for Hajj and so did his companions. He sent a \nbatch of his companions by another route and Abu Qatada was one of them. The Prophet (ﷺ) said to them, \n\"Proceed along the seashore till we meet all together.\" So, they took the route of the seashore, and \nwhen they started all of them assumed Ihram except Abu Qatada. While they were proceeding on, his \ncompanions saw a group of onagers. Abu Qatada chased the onagers and attacked and wounded a sheonager. \nThey got down and ate some of its meat and said to each other: \"How do we eat the meat of \nthe game while we are in a state of Ihram?\" So, we (they) carried the rest of the she-onager's meat, and \nwhen they met Allah's Messenger (ﷺ) they asked, saying, \"O Allah's Messenger (ﷺ)! We assumed Ihram with the \nexception of Abu Qatada and we saw (a group) of onagers. Abu Qatada attacked them and wounded a \nshe-onager from them. Then we got down and ate from its meat. Later, we said, (to each other), 'How \ndo we eat the meat of the game and we are in a state of Ihram?' So, we carried the rest of its meat. The \nProphet asked, \"Did anyone of you order Abu Qatada to attack it or point at it?\" They replied in the \nnegative. He said, \"Then eat what is left of its meat.\"","reference":"Sahih al-Bukhari 1824, Book 28, Hadith 4","grade":"","question #":"question #1","question":"What is the ruling on consuming game meat while in a state of Ihram?","id":"bukhari-28-4"},{"hadith-eng":"From As-Sa'b bin Jath-thama Al-Laithi that the latter presented an onager to Allah's Messenger (ﷺ) while he \nwas at Al-Abwa' or at Waddan, and he refused it. On noticing the signs of some unpleasant feeling of \ndisappointment on his (As-Sab's) face, the Prophet (ﷺ) said to him, \"I have only returned it because I am \nMuhrim.\"","reference":"Sahih al-Bukhari 1825, Book 28, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of the Prophet's refusal to accept a gift while in the state of Ihram?","id":"bukhari-28-5"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not sinful of a Muhrim to kill five kinds of animals.\"","reference":"Sahih al-Bukhari 1826, Book 28, Hadith 6","grade":"","question #":"question #1","question":"What are the exceptions for a Muhrim regarding the killing of certain animals during Ihram?","id":"bukhari-28-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"A Muhrim can kill (five kinds of animals.)\"","reference":"Sahih al-Bukhari 1827, Book 28, Hadith 7","grade":"","question #":"question #1","question":"What are the specific animals that a Muhrim is permitted to kill during Ihram?","id":"bukhari-28-7"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the \nkite, the mouse, the scorpion and the rabid dog.\"","reference":"Sahih al-Bukhari 1828, Book 28, Hadith 8","grade":"","question #":"question #1","question":"What are the exceptions to the prohibition of killing animals during the state of Ihram?","id":"bukhari-28-8"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). \nThese are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"","reference":"Sahih al-Bukhari 1829, Book 28, Hadith 9","grade":"","question #":"question #1","question":"What types of animals are considered harmful and can be killed in the Haram according to Islamic teachings?","id":"bukhari-28-9"},{"hadith-eng":"While we were in the company of the Prophet (ﷺ) in a cave at Mina, when Surat-wal-Mursalat were \nrevealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. \nSuddenly a snake sprang at us and the Prophet (ﷺ) said (ordered us): \"Kill it.\" We ran to kill it but it \nescaped quickly. The Prophet (ﷺ) said, \"It has escaped your evil and you too have escaped its evil.\"","reference":"Sahih al-Bukhari 1830, Book 28, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of the Prophet's instruction to kill the snake in this context?","id":"bukhari-28-10"},{"hadith-eng":"Allah's Messenger (ﷺ) called the salamander a bad animal, but I did not hear him ordering it to be killed.\"","reference":"Sahih al-Bukhari 1831, Book 28, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of labeling certain animals as bad in Islamic teachings?","id":"bukhari-28-11"},{"hadith-eng":"Abu Shuraih, Al-`Adawi said that he had said to `Amr bin Sa`id when he was sending the troops to \nMecca (to fight `Abdullah bin Az-Zubair), \"O Chief! Allow me to tell you what Allah's Messenger (ﷺ) said \non the day following the Conquest of Mecca. My ears heard that and my heart understood it \nthoroughly and I saw with my own eyes the Prophet (ﷺ) when he, after Glorifying and Praising Allah, \nstarted saying, 'Allah, not the people, made Mecca a sanctuary, so anybody who has belief in Allah \nand the Last Day should neither shed blood in it, nor should he cut down its trees. If anybody tells \n(argues) that fighting in it is permissible on the basis that Allah's Messenger (ﷺ) did fight in Mecca, say to \nhim, 'Allah allowed His Apostle and did not allow you.' \"Allah allowed me only for a few hours on \nthat day (of the conquest) and today its sanctity is valid as it was before. So, those who are present \nshould inform those who are absent (concerning this fact.\" Abu Shuraih was asked, \"What did `Amr \nreply?\" He said, (`Amr said) 'O Abu Shuraih! I know better than you in this respect Mecca does not \ngive protection to a sinner, a murderer or a thief.\"","reference":"Sahih al-Bukhari 1832, Book 28, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of Mecca being designated as a sanctuary in Islam?","id":"bukhari-28-12"},{"hadith-eng":"\"The Prophet (ﷺ) said, 'Allah has made Mecca, a sanctuary, so it was a sanctuary before me and will \ncontinue to be a sanctuary after me. It was made legal for me (i.e. I was allowed to fight in it) for a \nfew hours of a day. It is not allowed to uproot its shrubs or to cut its trees, or to chase (or disturb) its \ngame, or to pick up its luqata (fallen things) except by a person who would announce that (what he has \nfound) publicly.' Al-`Abbas said, 'O Allah's Messenger (ﷺ)! Except Al-Idhkhir (a kind of grass) (for it is \nused) by our goldsmiths and for our graves.' The Prophet (ﷺ) then said, 'Except Al-Idhkhir.' \" `Ikrima said, \n'Do you know what \"chasing or disturbing\" the game means? It means driving it out of the shade to \noccupy its place.\"","reference":"Sahih al-Bukhari 1833, Book 28, Hadith 13","grade":"","question #":"question #1","question":"What are the rules and restrictions regarding the sanctuary status of Mecca?","id":"bukhari-28-13"},{"hadith-eng":"On the day of the conquest of Mecca, the Prophet (ﷺ) said, \"There is no more emigration (from Mecca) \nbut Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No \ndoubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth \nand will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting \nwas not permissible in it for anyone before me, and even for me it was allowed only for a portion of a \nday. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be \nuprooted and its game should not be chased; and its luqata (fallen things) should not be picked up \nexcept by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" \nAl-`Abbas said, \"O Allah's Messenger (ﷺ)! Except Al-Idhkhir, (for it is used by their blacksmiths and for \ntheir domestic purposes).\" So, the Prophet (ﷺ) said, \"Except Al-Idhkhir.\"","reference":"Sahih al-Bukhari 1834, Book 28, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of Mecca being a sanctuary and its sanctity according to Islamic teachings?","id":"bukhari-28-14"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped while he was in a state of Ihram.","reference":"Sahih al-Bukhari 1835, Book 28, Hadith 15","grade":"","question #":"question #1","question":"What is the ruling on cupping while in a state of Ihram during Hajj or Umrah?","id":"bukhari-28-15"},{"hadith-eng":"The Prophet, while in the state of Ihram, was cupped at the middle of his head at Liha-Jamal.","reference":"Sahih al-Bukhari 1836, Book 28, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of cupping in Islamic tradition, especially during the state of Ihram?","id":"bukhari-28-16"},{"hadith-eng":"The Prophet (ﷺ) married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage \nwere held).","reference":"Sahih al-Bukhari 1837, Book 28, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of performing marriage ceremonies while in the state of Ihram?","id":"bukhari-28-17"},{"hadith-eng":"A person stood up and asked, \"O Allah's: Apostle! What clothes may be worn in the state of Ihram?\" \nThe Prophet (ﷺ) replied, \"Do not wear a shirt or trousers, or any headgear (e.g. a turban), or a hooded \ncloak; but if somebody has no shoes he can wear leather stockings provided they are cut short off the \nankles, and also, do not wear anything perfumed with Wars or saffron, and the Muhrima (a woman in \nthe state of Ihram) should not cover her face, or wear gloves.\"","reference":"Sahih al-Bukhari 1838, Book 28, Hadith 18","grade":"","question #":"question #1","question":"What are the clothing restrictions for men in the state of Ihram during Hajj or Umrah?","id":"bukhari-28-18"},{"hadith-eng":"A man was crushed to death by his she-camel and was brought to Allah's Messenger (ﷺ) who said, \"Give him \na bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will \nbe resurrected reciting Talbiya.\"","reference":"Sahih al-Bukhari 1839, Book 28, Hadith 19","grade":"","question #":"question #1","question":"What are the specific burial instructions for a person who dies while in the state of Ihram?","id":"bukhari-28-19"},{"hadith-eng":"`Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a \nMuhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin \n`Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of \nthe well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I \nam `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Messenger (ﷺ) \nused to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of \ncloth and lowered it till his head appeared before me, and then told somebody to pour water on his \nhead. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing \nthem from back to front and from front to back and said, \"I saw the Prophet (ﷺ) doing like this.\"","reference":"Sahih al-Bukhari 1840, Book 28, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of following the Prophet's actions during the state of Ihram?","id":"bukhari-28-20"},{"hadith-eng":"I heard the Prophet (ﷺ) delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he \ncould wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below \nthe ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he \ncould wear trousers.\"","reference":"Sahih al-Bukhari 1841, Book 28, Hadith 21","grade":"","question #":"question #1","question":"What alternatives are permissible for a Muhrim if traditional pilgrimage attire is unavailable?","id":"bukhari-28-21"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked what sort of clothes a Muhrim should wear. He replied, \"He should not \nwear a shirt, turbans, trousers, a hooded cloak, or a dress perfumed with saffron or Wars; and if \nslippers are not available he can wear Khuffs (socks made from thick fabric or leather) but he should \ncut them so that they reach below the ankles.","reference":"Sahih al-Bukhari 1842, Book 28, Hadith 22","grade":"","question #":"question #1","question":"What types of clothing are prohibited for a Muhrim during Ihram?","id":"bukhari-28-22"},{"hadith-eng":"The Prophet (ﷺ) delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, \nand whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"","reference":"Sahih al-Bukhari 1843, Book 28, Hadith 23","grade":"","question #":"question #1","question":"What alternatives are permissible for pilgrims who cannot find an Izar during Hajj?","id":"bukhari-28-23"},{"hadith-eng":"The Prophet (ﷺ) assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca \nrefused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca \nany arms but sheathed.","reference":"Sahih al-Bukhari 1844, Book 28, Hadith 24","grade":"","question #":"question #1","question":"What conditions were placed on the Prophet (ﷺ) by the people of Mecca for entering the city during his Umra?","id":"bukhari-28-24"},{"hadith-eng":"The Prophet (ﷺ) fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, \nand Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit \nare for those people and also for those who come through these Mawaqit (from places other than the \nabove-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these \nMawaqit can assume Ihram from the place where they start; even the people of Mecca can assume \nIhram from Mecca.","reference":"Sahih al-Bukhari 1845, Book 28, Hadith 25","grade":"","question #":"question #1","question":"What are the designated Mawaqit for assuming Ihram for people coming from different regions?","id":"bukhari-28-25"},{"hadith-eng":"Allah's Messenger (ﷺ) entered Mecca in the year of its Conquest wearing an Arabian helmet on his head and \nwhen the Prophet (ﷺ) took it off, a person came and said, \"Ibn Khatal is holding the covering of the Ka`ba \n(taking refuge in the Ka`ba).\" The Prophet (ﷺ) said, \"Kill him.\"","reference":"Sahih al-Bukhari 1846, Book 28, Hadith 26","grade":"","question #":"question #1","question":"What was the significance of the Prophet Muhammad's (ﷺ) actions upon entering Mecca during its conquest?","id":"bukhari-28-26"},{"hadith-eng":"While I was with Allah's Messenger (ﷺ) there came to him a man wearing a cloak having a trace of yellowish \nperfume or a similar thing on it. `Umar used to say to me, \"Would you like to see the Prophet (ﷺ) at the \ntime when he is inspired divinely?\" So, it happened that he was inspired (then) and when the \ninspiration was over the Prophet (ﷺ) said (to that man), \"Do in your `Umra the same as you do in your \nHajj.\"","reference":"Sahih al-Bukhari 1847, Book 28, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of divine inspiration in the life of the Prophet Muhammad (ﷺ)?","id":"bukhari-28-27"},{"hadith-eng":"A man bit the hand of another man but in that process the latter broke one incisor tooth of the former, and the Prophet (ﷺ) forgave the latter.","reference":"Sahih al-Bukhari 1848, Book 28, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of forgiveness in resolving disputes according to Islamic teachings?","id":"bukhari-28-28"},{"hadith-eng":"While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"","reference":"Sahih al-Bukhari 1849, Book 28, Hadith 29","grade":"","question #":"question #1","question":"What are the Islamic burial practices for someone who dies in the state of Ihram?","id":"bukhari-28-29"},{"hadith-eng":"While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"","reference":"Sahih al-Bukhari 1850, Book 28, Hadith 30","grade":"","question #":"question #1","question":"What are the Islamic burial practices for someone who dies in a state of Ihram?","id":"bukhari-28-30"},{"hadith-eng":"A man was in the company of the Prophet (ﷺ) and his she-camel crushed his neck while he was in a state \nof Ihram and he died Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in his two \ngarments; neither perfume him nor cover his head, for he will be resurrected on the Day of \nResurrection, reciting Talbiya.\"","reference":"Sahih al-Bukhari 1851, Book 28, Hadith 31","grade":"","question #":"question #1","question":"What are the burial procedures for a person who dies in the state of Ihram?","id":"bukhari-28-31"},{"hadith-eng":"A woman from the tribe of Juhaina came to the Prophet (ﷺ) and said, \"My mother had vowed to perform \nHajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet (ﷺ) \nreplied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or \nnot? So, pay Allah's debt as He has more right to be paid.\"","reference":"Sahih al-Bukhari 1852, Book 28, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of fulfilling vows made to Allah, especially after someone's death?","id":"bukhari-28-32"},{"hadith-eng":"A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet (ﷺ) ) and said, \n\"O Allah's Messenger (ﷺ)! My father has come under Allah's obligation of performing Hajj but he is a very \nold man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his \nbehalf?\" The Prophet (ﷺ) replied in the affirmative.","reference":"Sahih al-Bukhari 1853, Book 28, Hadith 33","grade":"","question #":"question #1","question":"Can someone perform Hajj on behalf of another person who is unable to do so due to old age or illness?","id":"bukhari-28-33"},{"hadith-eng":"Al-Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al-Fadl \nstarted looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She \nsaid, \"My father has come under Allah's obligation of performing Hajj but he is a very old man and \ncannot sit properly on his Mount. Shall I perform Hajj on his behalf? The Prophet (ﷺ) replied in the \naffirmative. That happened during Hajjat-al-Wada` of the Prophet (ﷺ) .","reference":"Sahih al-Bukhari 1854, Book 28, Hadith 34","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding lowering one's gaze and modesty?","id":"bukhari-28-34"},{"hadith-eng":"Al Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet (ﷺ) replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet (ﷺ).","reference":"Sahih al-Bukhari 1855, Book 28, Hadith 35","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding performing Hajj on behalf of someone who is unable to do so due to old age or infirmity?","id":"bukhari-28-35"},{"hadith-eng":"The Prophet (ﷺ) sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.","reference":"Sahih al-Bukhari 1856, Book 28, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of sending someone with luggage during the Hajj pilgrimage?","id":"bukhari-28-36"},{"hadith-eng":"I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Messenger (ﷺ) was \npraying at Mina. I passed in front of a part of the first row and then dismounted from it, and the \nanimal started grazing. I aligned with the people behind Allah's Messenger (ﷺ) (The sub-narrator added that \nhappened in Mina during the Prophet's Hajjat-al-Wada`.)","reference":"Sahih al-Bukhari 1857, Book 28, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of reaching puberty in Islamic practices and responsibilities?","id":"bukhari-28-37"},{"hadith-eng":"(While in the company of my parents) I was made to perform Hajj with Allah's Messenger (ﷺ) and I was a \nseven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)","reference":"Sahih al-Bukhari 1858, Book 28, Hadith 38","grade":"","question #":"question #1","question":"At what age is it permissible for a child to perform Hajj according to Islamic teachings?","id":"bukhari-28-38"},{"hadith-eng":"I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid that he had performed Hajj (while \ncarried) with the belongings of the Prophet.","reference":"Sahih al-Bukhari 1859, Book 28, Hadith 39","grade":"","question #":"question #1","question":"Who was As-Sa'ib bin Yazid and what is his significance in Islamic history?","id":"bukhari-28-39"},{"hadith-eng":"Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet(ﷺ)to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.","reference":"Sahih al-Bukhari 1860, Book 28, Hadith 40","grade":"","question #":"question #1","question":"What measures did 'Umar take to ensure the safety of the Prophet's wives during Hajj?","id":"bukhari-28-40"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! Shouldn't we participate in Holy battles and Jihad along with you?\" He \nreplied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" \n`Aisha added: Ever since I heard that from Allah's Messenger (ﷺ) I have determined not to miss Hajj.","reference":"Sahih al-Bukhari 1861, Book 28, Hadith 41","grade":"","question #":"question #1","question":"What is considered the most superior form of Jihad for women according to Islamic teachings?","id":"bukhari-28-41"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with \nwhom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit \nher except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Messenger (ﷺ)! I intend to \ngo to such and such an army and my wife wants to perform Hajj.\" The Prophet (ﷺ) said (to him), \"Go \nalong with her (to Hajj).","reference":"Sahih al-Bukhari 1862, Book 28, Hadith 42","grade":"","question #":"question #1","question":"What are the guidelines for a woman traveling according to Islamic teachings?","id":"bukhari-28-42"},{"hadith-eng":"When the Prophet (ﷺ) returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid \nyou to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he \nperformed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet (ﷺ) said \n(to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in \nreward).","reference":"Sahih al-Bukhari 1863, Book 28, Hadith 43","grade":"","question #":"question #1","question":"What is the significance of performing Umra during the month of Ramadan in terms of reward?","id":"bukhari-28-43"},{"hadith-eng":"Abu Sa`id who participated in twelve Ghazawat with the Prophet (ﷺ) said, \"I heard four things from \nAllah's Messenger (ﷺ) (or I narrate them from the Prophet (ﷺ) ) which won my admiration and appreciation. \nThey are: \n-1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. \n-2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. \n-3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the \nmorning prayer till the sun rises. \n-4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in \nMedina), and Masjid-al-Aqsa (in Jerusalem).","reference":"Sahih al-Bukhari 1864, Book 28, Hadith 44","grade":"","question #":"question #1","question":"What are the guidelines for women traveling without a mahram according to Islamic teachings?","id":"bukhari-28-44"},{"hadith-eng":"The Prophet (ﷺ) saw an old man walking, supported by his two sons, and asked about him. The people \ninformed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old \nman's torturing himself,\" and ordered him to ride.","reference":"Sahih al-Bukhari 1865, Book 28, Hadith 45","grade":"","question #":"question #1","question":"What is the Islamic perspective on self-imposed hardship in fulfilling religious vows?","id":"bukhari-28-45"},{"hadith-eng":"My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet (ﷺ) about \nit. So, I did and the Prophet (ﷺ) said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:","reference":"Sahih al-Bukhari 1866, Book 28, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of fulfilling vows in Islam, especially those related to pilgrimage?","id":"bukhari-28-46"},{"hadith-eng":"My father set out (for Mecca) in the year of Al-Hudaibiya, and his companions assumed Ihram, but he \ndid not. At that time the Prophet (ﷺ) was informed that an enemy wanted to attack him, so the Prophet (ﷺ) \nproceeded onwards. While my father was among his companions, some of them laughed among \nthemselves. (My father said), \"I looked up and saw an onager. I attacked, stabbed and caught it. I then \nsought my companions' help but they refused to help me. (Later) we all ate its meat. We were afraid \nthat we might be left behind (separated) from the Prophet (ﷺ) so I went in search of the Prophet (ﷺ) and made \nmy horse to run at a galloping speed at times and let it go slow at an ordinary speed at other times till I \nmet a man from the tribe of Bani Ghifar at midnight. I asked him, \"Where did you leave the Prophet (ﷺ) \n?\" He replied, \"I left him at Ta'hun and he had the intention of having the midday rest at As-Suqya. I \nfollowed the trace and joined the Prophet (ﷺ) and said, 'O Allah's Messenger (ﷺ)! Your people (companions) \nsend you their compliments, and (ask for) Allah's Blessings upon you. They are afraid lest they may \nbe left behind; so please wait for them.' I added, 'O Allah's Messenger (ﷺ)! I hunted an onager and some of \nits meat is with me. The Prophet (ﷺ) told the people to eat it though all of them were in the state of \nIhram.\"","reference":"Sahih al-Bukhari 1821, Book 28, Hadith 1","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) handle the situation when they feared being left behind during a journey?","id":"bukhari-28-47"},{"hadith-eng":"That his father said \"We proceeded with the Prophet (ﷺ) in the year of Al-Hudaibiya and his companions \nassumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on \ntowards them. My companions saw an onager and some of them started laughing among themselves. I \nlooked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my \ncompanions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I \nfollowed Allah's Messenger (ﷺ) lest we should be left behind. At times I urged my horse to run at a galloping \nspeed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani \nGhifar at midnight. I asked him where he had left Allah's Messenger (ﷺ) . The man replied that he had left \nthe Prophet (ﷺ) at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. \nSo, I followed Allah's Messenger (ﷺ) till I reached him and said, \"O Allah's Messenger (ﷺ)! I have been sent by my \ncompanions who send you their greetings and compliments and ask for Allah's Mercy and Blessings \nupon you. They were afraid lest the enemy might intervene between you and them; so please wait for \nthem.\" So he did. Then I said, \"O Allah's Messenger (ﷺ)! We have hunted an onager and have some of it (i.e. \nits meat) left over.\" Allah's Messenger (ﷺ) told his companions to eat the meat although all of them were in a \nstate of Ihram.\"","reference":"Sahih al-Bukhari 1822, Book 28, Hadith 2","grade":"","question #":"question #2","question":"How does the hadith illustrate the companions' respect and concern for the Prophet's safety during their journey?","id":"bukhari-28-48"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) at a place called Al-Qaha (which is at a distance of three \nstages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in \nthe company of the Prophet (ﷺ) at a place called Al-Qaha and some of us had assumed Ihram while the \nothers had not. I noticed that some of my companions were watching something, so I looked up and \nsaw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked \nthem to pick it up for me) but they said, \"We will not help you by any means as we are in a state of \nIhram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and \nslaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \n\"Do not eat it.\" So, I went to the Prophet (ﷺ) who was ahead of us and asked him about it, He replied, \"Eat \nit as it is Halal (i.e. it is legal to eat it).","reference":"Sahih al-Bukhari 1823, Book 28, Hadith 3","grade":"","question #":"question #2","question":"How should one seek guidance when there is a difference of opinion among companions regarding a religious matter?","id":"bukhari-28-49"},{"hadith-eng":"That his father had told him that Allah's Messenger (ﷺ) set out for Hajj and so did his companions. He sent a \nbatch of his companions by another route and Abu Qatada was one of them. The Prophet (ﷺ) said to them, \n\"Proceed along the seashore till we meet all together.\" So, they took the route of the seashore, and \nwhen they started all of them assumed Ihram except Abu Qatada. While they were proceeding on, his \ncompanions saw a group of onagers. Abu Qatada chased the onagers and attacked and wounded a sheonager. \nThey got down and ate some of its meat and said to each other: \"How do we eat the meat of \nthe game while we are in a state of Ihram?\" So, we (they) carried the rest of the she-onager's meat, and \nwhen they met Allah's Messenger (ﷺ) they asked, saying, \"O Allah's Messenger (ﷺ)! We assumed Ihram with the \nexception of Abu Qatada and we saw (a group) of onagers. Abu Qatada attacked them and wounded a \nshe-onager from them. Then we got down and ate from its meat. Later, we said, (to each other), 'How \ndo we eat the meat of the game and we are in a state of Ihram?' So, we carried the rest of its meat. The \nProphet asked, \"Did anyone of you order Abu Qatada to attack it or point at it?\" They replied in the \nnegative. He said, \"Then eat what is left of its meat.\"","reference":"Sahih al-Bukhari 1824, Book 28, Hadith 4","grade":"","question #":"question #2","question":"Under what circumstances is it permissible to eat meat hunted by someone not in Ihram during Hajj?","id":"bukhari-28-50"},{"hadith-eng":"From As-Sa'b bin Jath-thama Al-Laithi that the latter presented an onager to Allah's Messenger (ﷺ) while he \nwas at Al-Abwa' or at Waddan, and he refused it. On noticing the signs of some unpleasant feeling of \ndisappointment on his (As-Sab's) face, the Prophet (ﷺ) said to him, \"I have only returned it because I am \nMuhrim.\"","reference":"Sahih al-Bukhari 1825, Book 28, Hadith 5","grade":"","question #":"question #2","question":"How should one handle situations where a religious obligation conflicts with social expectations?","id":"bukhari-28-51"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not sinful of a Muhrim to kill five kinds of animals.\"","reference":"Sahih al-Bukhari 1826, Book 28, Hadith 6","grade":"","question #":"question #2","question":"Which animals are permissible for a Muhrim to kill without incurring sin?","id":"bukhari-28-52"},{"hadith-eng":"The Prophet (ﷺ) said, \"A Muhrim can kill (five kinds of animals.)\"","reference":"Sahih al-Bukhari 1827, Book 28, Hadith 7","grade":"","question #":"question #2","question":"What is the significance of allowing a Muhrim to kill certain animals while in the state of Ihram?","id":"bukhari-28-53"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the \nkite, the mouse, the scorpion and the rabid dog.\"","reference":"Sahih al-Bukhari 1828, Book 28, Hadith 8","grade":"","question #":"question #2","question":"Which animals are considered harmful and permissible to kill according to Islamic teachings?","id":"bukhari-28-54"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). \nThese are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"","reference":"Sahih al-Bukhari 1829, Book 28, Hadith 9","grade":"","question #":"question #2","question":"Why might certain animals be permitted to be killed in the Haram despite the general prohibition against killing?","id":"bukhari-28-55"},{"hadith-eng":"While we were in the company of the Prophet (ﷺ) in a cave at Mina, when Surat-wal-Mursalat were \nrevealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. \nSuddenly a snake sprang at us and the Prophet (ﷺ) said (ordered us): \"Kill it.\" We ran to kill it but it \nescaped quickly. The Prophet (ﷺ) said, \"It has escaped your evil and you too have escaped its evil.\"","reference":"Sahih al-Bukhari 1830, Book 28, Hadith 10","grade":"","question #":"question #2","question":"How does the interaction with the snake illustrate the concept of mutual harm avoidance in Islamic teachings?","id":"bukhari-28-56"},{"hadith-eng":"Allah's Messenger (ﷺ) called the salamander a bad animal, but I did not hear him ordering it to be killed.\"","reference":"Sahih al-Bukhari 1831, Book 28, Hadith 11","grade":"","question #":"question #2","question":"How should Muslims approach animals that are considered harmful or undesirable in Islam?","id":"bukhari-28-57"},{"hadith-eng":"Abu Shuraih, Al-`Adawi said that he had said to `Amr bin Sa`id when he was sending the troops to \nMecca (to fight `Abdullah bin Az-Zubair), \"O Chief! Allow me to tell you what Allah's Messenger (ﷺ) said \non the day following the Conquest of Mecca. My ears heard that and my heart understood it \nthoroughly and I saw with my own eyes the Prophet (ﷺ) when he, after Glorifying and Praising Allah, \nstarted saying, 'Allah, not the people, made Mecca a sanctuary, so anybody who has belief in Allah \nand the Last Day should neither shed blood in it, nor should he cut down its trees. If anybody tells \n(argues) that fighting in it is permissible on the basis that Allah's Messenger (ﷺ) did fight in Mecca, say to \nhim, 'Allah allowed His Apostle and did not allow you.' \"Allah allowed me only for a few hours on \nthat day (of the conquest) and today its sanctity is valid as it was before. So, those who are present \nshould inform those who are absent (concerning this fact.\" Abu Shuraih was asked, \"What did `Amr \nreply?\" He said, (`Amr said) 'O Abu Shuraih! I know better than you in this respect Mecca does not \ngive protection to a sinner, a murderer or a thief.\"","reference":"Sahih al-Bukhari 1832, Book 28, Hadith 12","grade":"","question #":"question #2","question":"Why is it important to maintain the sanctity of Mecca according to Islamic teachings?","id":"bukhari-28-58"},{"hadith-eng":"\"The Prophet (ﷺ) said, 'Allah has made Mecca, a sanctuary, so it was a sanctuary before me and will \ncontinue to be a sanctuary after me. It was made legal for me (i.e. I was allowed to fight in it) for a \nfew hours of a day. It is not allowed to uproot its shrubs or to cut its trees, or to chase (or disturb) its \ngame, or to pick up its luqata (fallen things) except by a person who would announce that (what he has \nfound) publicly.' Al-`Abbas said, 'O Allah's Messenger (ﷺ)! Except Al-Idhkhir (a kind of grass) (for it is \nused) by our goldsmiths and for our graves.' The Prophet (ﷺ) then said, 'Except Al-Idhkhir.' \" `Ikrima said, \n'Do you know what \"chasing or disturbing\" the game means? It means driving it out of the shade to \noccupy its place.\"","reference":"Sahih al-Bukhari 1833, Book 28, Hadith 13","grade":"","question #":"question #2","question":"Why was the Prophet Muhammad (ﷺ) allowed to fight in Mecca for a limited time?","id":"bukhari-28-59"},{"hadith-eng":"On the day of the conquest of Mecca, the Prophet (ﷺ) said, \"There is no more emigration (from Mecca) \nbut Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No \ndoubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth \nand will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting \nwas not permissible in it for anyone before me, and even for me it was allowed only for a portion of a \nday. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be \nuprooted and its game should not be chased; and its luqata (fallen things) should not be picked up \nexcept by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" \nAl-`Abbas said, \"O Allah's Messenger (ﷺ)! Except Al-Idhkhir, (for it is used by their blacksmiths and for \ntheir domestic purposes).\" So, the Prophet (ﷺ) said, \"Except Al-Idhkhir.\"","reference":"Sahih al-Bukhari 1834, Book 28, Hadith 14","grade":"","question #":"question #2","question":"What are the rules regarding the treatment of natural resources and wildlife in Mecca as mentioned in the teachings?","id":"bukhari-28-60"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped while he was in a state of Ihram.","reference":"Sahih al-Bukhari 1835, Book 28, Hadith 15","grade":"","question #":"question #2","question":"How does the practice of cupping relate to the state of Ihram in Islamic tradition?","id":"bukhari-28-61"},{"hadith-eng":"The Prophet, while in the state of Ihram, was cupped at the middle of his head at Liha-Jamal.","reference":"Sahih al-Bukhari 1836, Book 28, Hadith 16","grade":"","question #":"question #2","question":"How does the practice of cupping relate to the health and well-being of individuals in Islamic teachings?","id":"bukhari-28-62"},{"hadith-eng":"The Prophet (ﷺ) married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage \nwere held).","reference":"Sahih al-Bukhari 1837, Book 28, Hadith 17","grade":"","question #":"question #2","question":"What are the rules and restrictions associated with Ihram during Hajj or Umrah?","id":"bukhari-28-63"},{"hadith-eng":"A person stood up and asked, \"O Allah's: Apostle! What clothes may be worn in the state of Ihram?\" \nThe Prophet (ﷺ) replied, \"Do not wear a shirt or trousers, or any headgear (e.g. a turban), or a hooded \ncloak; but if somebody has no shoes he can wear leather stockings provided they are cut short off the \nankles, and also, do not wear anything perfumed with Wars or saffron, and the Muhrima (a woman in \nthe state of Ihram) should not cover her face, or wear gloves.\"","reference":"Sahih al-Bukhari 1838, Book 28, Hadith 18","grade":"","question #":"question #2","question":"What alternatives are allowed if someone in Ihram does not have shoes?","id":"bukhari-28-64"},{"hadith-eng":"A man was crushed to death by his she-camel and was brought to Allah's Messenger (ﷺ) who said, \"Give him \na bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will \nbe resurrected reciting Talbiya.\"","reference":"Sahih al-Bukhari 1839, Book 28, Hadith 19","grade":"","question #":"question #2","question":"How does the state of Ihram affect the burial rites of a deceased person?","id":"bukhari-28-65"},{"hadith-eng":"`Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a \nMuhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin \n`Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of \nthe well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I \nam `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Messenger (ﷺ) \nused to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of \ncloth and lowered it till his head appeared before me, and then told somebody to pour water on his \nhead. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing \nthem from back to front and from front to back and said, \"I saw the Prophet (ﷺ) doing like this.\"","reference":"Sahih al-Bukhari 1840, Book 28, Hadith 20","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) wash his head while in the state of Ihram?","id":"bukhari-28-66"},{"hadith-eng":"I heard the Prophet (ﷺ) delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he \ncould wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below \nthe ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he \ncould wear trousers.\"","reference":"Sahih al-Bukhari 1841, Book 28, Hadith 21","grade":"","question #":"question #2","question":"How should a Muhrim modify Khuffs if slippers are not available during pilgrimage?","id":"bukhari-28-67"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked what sort of clothes a Muhrim should wear. He replied, \"He should not \nwear a shirt, turbans, trousers, a hooded cloak, or a dress perfumed with saffron or Wars; and if \nslippers are not available he can wear Khuffs (socks made from thick fabric or leather) but he should \ncut them so that they reach below the ankles.","reference":"Sahih al-Bukhari 1842, Book 28, Hadith 22","grade":"","question #":"question #2","question":"What should a Muhrim do if slippers are not available during Ihram?","id":"bukhari-28-68"},{"hadith-eng":"The Prophet (ﷺ) delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, \nand whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"","reference":"Sahih al-Bukhari 1843, Book 28, Hadith 23","grade":"","question #":"question #2","question":"What guidance did the Prophet (ﷺ) provide regarding footwear for those unable to find shoes during Hajj?","id":"bukhari-28-69"},{"hadith-eng":"The Prophet (ﷺ) assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca \nrefused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca \nany arms but sheathed.","reference":"Sahih al-Bukhari 1844, Book 28, Hadith 24","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) demonstrate patience and diplomacy when faced with opposition from the people of Mecca?","id":"bukhari-28-70"},{"hadith-eng":"The Prophet (ﷺ) fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, \nand Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit \nare for those people and also for those who come through these Mawaqit (from places other than the \nabove-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these \nMawaqit can assume Ihram from the place where they start; even the people of Mecca can assume \nIhram from Mecca.","reference":"Sahih al-Bukhari 1845, Book 28, Hadith 25","grade":"","question #":"question #2","question":"How do the Mawaqit apply to people living within these boundaries when intending to perform Hajj or Umra?","id":"bukhari-28-71"},{"hadith-eng":"Allah's Messenger (ﷺ) entered Mecca in the year of its Conquest wearing an Arabian helmet on his head and \nwhen the Prophet (ﷺ) took it off, a person came and said, \"Ibn Khatal is holding the covering of the Ka`ba \n(taking refuge in the Ka`ba).\" The Prophet (ﷺ) said, \"Kill him.\"","reference":"Sahih al-Bukhari 1846, Book 28, Hadith 26","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to individuals seeking refuge in the Ka'ba during the conquest of Mecca?","id":"bukhari-28-72"},{"hadith-eng":"While I was with Allah's Messenger (ﷺ) there came to him a man wearing a cloak having a trace of yellowish \nperfume or a similar thing on it. `Umar used to say to me, \"Would you like to see the Prophet (ﷺ) at the \ntime when he is inspired divinely?\" So, it happened that he was inspired (then) and when the \ninspiration was over the Prophet (ﷺ) said (to that man), \"Do in your `Umra the same as you do in your \nHajj.\"","reference":"Sahih al-Bukhari 1847, Book 28, Hadith 27","grade":"","question #":"question #2","question":"How should the rituals of 'Umra be performed in comparison to Hajj according to Islamic teachings?","id":"bukhari-28-73"},{"hadith-eng":"A man bit the hand of another man but in that process the latter broke one incisor tooth of the former, and the Prophet (ﷺ) forgave the latter.","reference":"Sahih al-Bukhari 1848, Book 28, Hadith 28","grade":"","question #":"question #2","question":"How does Islam address the issue of personal injury and compensation?","id":"bukhari-28-74"},{"hadith-eng":"While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"","reference":"Sahih al-Bukhari 1849, Book 28, Hadith 29","grade":"","question #":"question #2","question":"Why is it significant that a person who dies in Ihram is resurrected reciting Talbiya?","id":"bukhari-28-75"},{"hadith-eng":"While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"","reference":"Sahih al-Bukhari 1850, Book 28, Hadith 30","grade":"","question #":"question #2","question":"Why is it significant that a person in Ihram is not perfumed or has their head covered after death?","id":"bukhari-28-76"},{"hadith-eng":"A man was in the company of the Prophet (ﷺ) and his she-camel crushed his neck while he was in a state \nof Ihram and he died Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in his two \ngarments; neither perfume him nor cover his head, for he will be resurrected on the Day of \nResurrection, reciting Talbiya.\"","reference":"Sahih al-Bukhari 1851, Book 28, Hadith 31","grade":"","question #":"question #2","question":"Why is it important not to use perfume or cover the head of a deceased in Ihram?","id":"bukhari-28-77"},{"hadith-eng":"A woman from the tribe of Juhaina came to the Prophet (ﷺ) and said, \"My mother had vowed to perform \nHajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet (ﷺ) \nreplied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or \nnot? So, pay Allah's debt as He has more right to be paid.\"","reference":"Sahih al-Bukhari 1852, Book 28, Hadith 32","grade":"","question #":"question #2","question":"How does the concept of paying debts relate to fulfilling religious obligations on behalf of deceased family members?","id":"bukhari-28-78"},{"hadith-eng":"A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet (ﷺ) ) and said, \n\"O Allah's Messenger (ﷺ)! My father has come under Allah's obligation of performing Hajj but he is a very \nold man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his \nbehalf?\" The Prophet (ﷺ) replied in the affirmative.","reference":"Sahih al-Bukhari 1853, Book 28, Hadith 33","grade":"","question #":"question #2","question":"What are the conditions under which a person can fulfill the Hajj obligation for someone else?","id":"bukhari-28-79"},{"hadith-eng":"Al-Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al-Fadl \nstarted looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She \nsaid, \"My father has come under Allah's obligation of performing Hajj but he is a very old man and \ncannot sit properly on his Mount. Shall I perform Hajj on his behalf? The Prophet (ﷺ) replied in the \naffirmative. That happened during Hajjat-al-Wada` of the Prophet (ﷺ) .","reference":"Sahih al-Bukhari 1854, Book 28, Hadith 34","grade":"","question #":"question #2","question":"Is it permissible to perform Hajj on behalf of someone who is unable to do so themselves?","id":"bukhari-28-80"},{"hadith-eng":"Al Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet (ﷺ) replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet (ﷺ).","reference":"Sahih al-Bukhari 1855, Book 28, Hadith 35","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address situations where individuals are distracted by others during important religious events?","id":"bukhari-28-81"},{"hadith-eng":"The Prophet (ﷺ) sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.","reference":"Sahih al-Bukhari 1856, Book 28, Hadith 36","grade":"","question #":"question #2","question":"What role did Ibn `Abbas play in assisting the Prophet (ﷺ) during the Hajj journey?","id":"bukhari-28-82"},{"hadith-eng":"I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Messenger (ﷺ) was \npraying at Mina. I passed in front of a part of the first row and then dismounted from it, and the \nanimal started grazing. I aligned with the people behind Allah's Messenger (ﷺ) (The sub-narrator added that \nhappened in Mina during the Prophet's Hajjat-al-Wada`.)","reference":"Sahih al-Bukhari 1857, Book 28, Hadith 37","grade":"","question #":"question #2","question":"How should one behave when passing in front of people during prayer?","id":"bukhari-28-83"},{"hadith-eng":"(While in the company of my parents) I was made to perform Hajj with Allah's Messenger (ﷺ) and I was a \nseven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)","reference":"Sahih al-Bukhari 1858, Book 28, Hadith 38","grade":"","question #":"question #2","question":"What is the significance of performing Hajj at a young age in Islam?","id":"bukhari-28-84"},{"hadith-eng":"I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid that he had performed Hajj (while \ncarried) with the belongings of the Prophet.","reference":"Sahih al-Bukhari 1859, Book 28, Hadith 39","grade":"","question #":"question #2","question":"What does the hadith imply about the practice of Hajj during the time of the Prophet?","id":"bukhari-28-85"},{"hadith-eng":"Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet(ﷺ)to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.","reference":"Sahih al-Bukhari 1860, Book 28, Hadith 40","grade":"","question #":"question #2","question":"Who were the companions chosen by 'Umar to accompany the Prophet's wives on Hajj?","id":"bukhari-28-86"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! Shouldn't we participate in Holy battles and Jihad along with you?\" He \nreplied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" \n`Aisha added: Ever since I heard that from Allah's Messenger (ﷺ) I have determined not to miss Hajj.","reference":"Sahih al-Bukhari 1861, Book 28, Hadith 41","grade":"","question #":"question #2","question":"How did Aisha's understanding of Jihad influence her commitment to performing Hajj?","id":"bukhari-28-87"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with \nwhom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit \nher except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Messenger (ﷺ)! I intend to \ngo to such and such an army and my wife wants to perform Hajj.\" The Prophet (ﷺ) said (to him), \"Go \nalong with her (to Hajj).","reference":"Sahih al-Bukhari 1862, Book 28, Hadith 42","grade":"","question #":"question #2","question":"Why is the presence of a Dhu-Mahram important when a woman is traveling or receiving visitors?","id":"bukhari-28-88"},{"hadith-eng":"When the Prophet (ﷺ) returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid \nyou to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he \nperformed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet (ﷺ) said \n(to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in \nreward).","reference":"Sahih al-Bukhari 1863, Book 28, Hadith 43","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address the concerns of those unable to perform Hajj due to personal circumstances?","id":"bukhari-28-89"},{"hadith-eng":"Abu Sa`id who participated in twelve Ghazawat with the Prophet (ﷺ) said, \"I heard four things from \nAllah's Messenger (ﷺ) (or I narrate them from the Prophet (ﷺ) ) which won my admiration and appreciation. \nThey are: \n-1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. \n-2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. \n-3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the \nmorning prayer till the sun rises. \n-4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in \nMedina), and Masjid-al-Aqsa (in Jerusalem).","reference":"Sahih al-Bukhari 1864, Book 28, Hadith 44","grade":"","question #":"question #2","question":"Which days are fasting prohibited in Islam and why?","id":"bukhari-28-90"},{"hadith-eng":"The Prophet (ﷺ) saw an old man walking, supported by his two sons, and asked about him. The people \ninformed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old \nman's torturing himself,\" and ordered him to ride.","reference":"Sahih al-Bukhari 1865, Book 28, Hadith 45","grade":"","question #":"question #2","question":"How does Islam view the balance between fulfilling vows and maintaining personal well-being?","id":"bukhari-28-91"},{"hadith-eng":"My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet (ﷺ) about \nit. So, I did and the Prophet (ﷺ) said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:","reference":"Sahih al-Bukhari 1866, Book 28, Hadith 46","grade":"","question #":"question #2","question":"How does Islamic teaching accommodate physical limitations when fulfilling religious vows?","id":"bukhari-28-92"},{"hadith-eng":"My father set out (for Mecca) in the year of Al-Hudaibiya, and his companions assumed Ihram, but he \ndid not. At that time the Prophet (ﷺ) was informed that an enemy wanted to attack him, so the Prophet (ﷺ) \nproceeded onwards. While my father was among his companions, some of them laughed among \nthemselves. (My father said), \"I looked up and saw an onager. I attacked, stabbed and caught it. I then \nsought my companions' help but they refused to help me. (Later) we all ate its meat. We were afraid \nthat we might be left behind (separated) from the Prophet (ﷺ) so I went in search of the Prophet (ﷺ) and made \nmy horse to run at a galloping speed at times and let it go slow at an ordinary speed at other times till I \nmet a man from the tribe of Bani Ghifar at midnight. I asked him, \"Where did you leave the Prophet (ﷺ) \n?\" He replied, \"I left him at Ta'hun and he had the intention of having the midday rest at As-Suqya. I \nfollowed the trace and joined the Prophet (ﷺ) and said, 'O Allah's Messenger (ﷺ)! Your people (companions) \nsend you their compliments, and (ask for) Allah's Blessings upon you. They are afraid lest they may \nbe left behind; so please wait for them.' I added, 'O Allah's Messenger (ﷺ)! I hunted an onager and some of \nits meat is with me. The Prophet (ﷺ) told the people to eat it though all of them were in the state of \nIhram.\"","reference":"Sahih al-Bukhari 1821, Book 28, Hadith 1","grade":"","question #":"question #3","question":"What does this narration teach about the Prophet's (ﷺ) guidance regarding consuming hunted meat while in Ihram?","id":"bukhari-28-93"},{"hadith-eng":"That his father said \"We proceeded with the Prophet (ﷺ) in the year of Al-Hudaibiya and his companions \nassumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on \ntowards them. My companions saw an onager and some of them started laughing among themselves. I \nlooked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my \ncompanions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I \nfollowed Allah's Messenger (ﷺ) lest we should be left behind. At times I urged my horse to run at a galloping \nspeed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani \nGhifar at midnight. I asked him where he had left Allah's Messenger (ﷺ) . The man replied that he had left \nthe Prophet (ﷺ) at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. \nSo, I followed Allah's Messenger (ﷺ) till I reached him and said, \"O Allah's Messenger (ﷺ)! I have been sent by my \ncompanions who send you their greetings and compliments and ask for Allah's Mercy and Blessings \nupon you. They were afraid lest the enemy might intervene between you and them; so please wait for \nthem.\" So he did. Then I said, \"O Allah's Messenger (ﷺ)! We have hunted an onager and have some of it (i.e. \nits meat) left over.\" Allah's Messenger (ﷺ) told his companions to eat the meat although all of them were in a \nstate of Ihram.\"","reference":"Sahih al-Bukhari 1822, Book 28, Hadith 2","grade":"","question #":"question #3","question":"What does this narration reveal about the rules of Ihram and exceptions related to hunting and consuming meat?","id":"bukhari-28-94"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) at a place called Al-Qaha (which is at a distance of three \nstages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in \nthe company of the Prophet (ﷺ) at a place called Al-Qaha and some of us had assumed Ihram while the \nothers had not. I noticed that some of my companions were watching something, so I looked up and \nsaw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked \nthem to pick it up for me) but they said, \"We will not help you by any means as we are in a state of \nIhram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and \nslaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \n\"Do not eat it.\" So, I went to the Prophet (ﷺ) who was ahead of us and asked him about it, He replied, \"Eat \nit as it is Halal (i.e. it is legal to eat it).","reference":"Sahih al-Bukhari 1823, Book 28, Hadith 3","grade":"","question #":"question #3","question":"What actions are permissible for a person in Ihram when encountering a situation involving hunting or game?","id":"bukhari-28-95"},{"hadith-eng":"That his father had told him that Allah's Messenger (ﷺ) set out for Hajj and so did his companions. He sent a \nbatch of his companions by another route and Abu Qatada was one of them. The Prophet (ﷺ) said to them, \n\"Proceed along the seashore till we meet all together.\" So, they took the route of the seashore, and \nwhen they started all of them assumed Ihram except Abu Qatada. While they were proceeding on, his \ncompanions saw a group of onagers. Abu Qatada chased the onagers and attacked and wounded a sheonager. \nThey got down and ate some of its meat and said to each other: \"How do we eat the meat of \nthe game while we are in a state of Ihram?\" So, we (they) carried the rest of the she-onager's meat, and \nwhen they met Allah's Messenger (ﷺ) they asked, saying, \"O Allah's Messenger (ﷺ)! We assumed Ihram with the \nexception of Abu Qatada and we saw (a group) of onagers. Abu Qatada attacked them and wounded a \nshe-onager from them. Then we got down and ate from its meat. Later, we said, (to each other), 'How \ndo we eat the meat of the game and we are in a state of Ihram?' So, we carried the rest of its meat. The \nProphet asked, \"Did anyone of you order Abu Qatada to attack it or point at it?\" They replied in the \nnegative. He said, \"Then eat what is left of its meat.\"","reference":"Sahih al-Bukhari 1824, Book 28, Hadith 4","grade":"","question #":"question #3","question":"What considerations should be taken when hunting animals during a pilgrimage?","id":"bukhari-28-96"},{"hadith-eng":"From As-Sa'b bin Jath-thama Al-Laithi that the latter presented an onager to Allah's Messenger (ﷺ) while he \nwas at Al-Abwa' or at Waddan, and he refused it. On noticing the signs of some unpleasant feeling of \ndisappointment on his (As-Sab's) face, the Prophet (ﷺ) said to him, \"I have only returned it because I am \nMuhrim.\"","reference":"Sahih al-Bukhari 1825, Book 28, Hadith 5","grade":"","question #":"question #3","question":"What are the implications of being in the state of Ihram for a Muslim during Hajj or Umrah?","id":"bukhari-28-97"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not sinful of a Muhrim to kill five kinds of animals.\"","reference":"Sahih al-Bukhari 1826, Book 28, Hadith 6","grade":"","question #":"question #3","question":"How does Islamic law address the issue of killing animals while in the state of Ihram?","id":"bukhari-28-98"},{"hadith-eng":"The Prophet (ﷺ) said, \"A Muhrim can kill (five kinds of animals.)\"","reference":"Sahih al-Bukhari 1827, Book 28, Hadith 7","grade":"","question #":"question #3","question":"How does the state of Ihram affect the actions a Muslim can take regarding wildlife?","id":"bukhari-28-99"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the \nkite, the mouse, the scorpion and the rabid dog.\"","reference":"Sahih al-Bukhari 1828, Book 28, Hadith 8","grade":"","question #":"question #3","question":"How does Islamic law address the issue of dealing with dangerous or harmful animals during pilgrimage?","id":"bukhari-28-100"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). \nThese are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"","reference":"Sahih al-Bukhari 1829, Book 28, Hadith 9","grade":"","question #":"question #3","question":"What is the significance of the Haram in Islam, and how does it relate to the treatment of animals?","id":"bukhari-28-101"},{"hadith-eng":"While we were in the company of the Prophet (ﷺ) in a cave at Mina, when Surat-wal-Mursalat were \nrevealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. \nSuddenly a snake sprang at us and the Prophet (ﷺ) said (ordered us): \"Kill it.\" We ran to kill it but it \nescaped quickly. The Prophet (ﷺ) said, \"It has escaped your evil and you too have escaped its evil.\"","reference":"Sahih al-Bukhari 1830, Book 28, Hadith 10","grade":"","question #":"question #3","question":"What can be learned from the Prophet's reaction to the snake about dealing with potential dangers?","id":"bukhari-28-102"},{"hadith-eng":"Allah's Messenger (ﷺ) called the salamander a bad animal, but I did not hear him ordering it to be killed.\"","reference":"Sahih al-Bukhari 1831, Book 28, Hadith 11","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the treatment of animals that are not explicitly ordered to be killed?","id":"bukhari-28-103"},{"hadith-eng":"Abu Shuraih, Al-`Adawi said that he had said to `Amr bin Sa`id when he was sending the troops to \nMecca (to fight `Abdullah bin Az-Zubair), \"O Chief! Allow me to tell you what Allah's Messenger (ﷺ) said \non the day following the Conquest of Mecca. My ears heard that and my heart understood it \nthoroughly and I saw with my own eyes the Prophet (ﷺ) when he, after Glorifying and Praising Allah, \nstarted saying, 'Allah, not the people, made Mecca a sanctuary, so anybody who has belief in Allah \nand the Last Day should neither shed blood in it, nor should he cut down its trees. If anybody tells \n(argues) that fighting in it is permissible on the basis that Allah's Messenger (ﷺ) did fight in Mecca, say to \nhim, 'Allah allowed His Apostle and did not allow you.' \"Allah allowed me only for a few hours on \nthat day (of the conquest) and today its sanctity is valid as it was before. So, those who are present \nshould inform those who are absent (concerning this fact.\" Abu Shuraih was asked, \"What did `Amr \nreply?\" He said, (`Amr said) 'O Abu Shuraih! I know better than you in this respect Mecca does not \ngive protection to a sinner, a murderer or a thief.\"","reference":"Sahih al-Bukhari 1832, Book 28, Hadith 12","grade":"","question #":"question #3","question":"What are the exceptions, if any, to the prohibition of fighting in Mecca?","id":"bukhari-28-104"},{"hadith-eng":"\"The Prophet (ﷺ) said, 'Allah has made Mecca, a sanctuary, so it was a sanctuary before me and will \ncontinue to be a sanctuary after me. It was made legal for me (i.e. I was allowed to fight in it) for a \nfew hours of a day. It is not allowed to uproot its shrubs or to cut its trees, or to chase (or disturb) its \ngame, or to pick up its luqata (fallen things) except by a person who would announce that (what he has \nfound) publicly.' Al-`Abbas said, 'O Allah's Messenger (ﷺ)! Except Al-Idhkhir (a kind of grass) (for it is \nused) by our goldsmiths and for our graves.' The Prophet (ﷺ) then said, 'Except Al-Idhkhir.' \" `Ikrima said, \n'Do you know what \"chasing or disturbing\" the game means? It means driving it out of the shade to \noccupy its place.\"","reference":"Sahih al-Bukhari 1833, Book 28, Hadith 13","grade":"","question #":"question #3","question":"What exceptions are made for the use of natural resources in Mecca, such as Al-Idhkhir grass?","id":"bukhari-28-105"},{"hadith-eng":"On the day of the conquest of Mecca, the Prophet (ﷺ) said, \"There is no more emigration (from Mecca) \nbut Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No \ndoubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth \nand will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting \nwas not permissible in it for anyone before me, and even for me it was allowed only for a portion of a \nday. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be \nuprooted and its game should not be chased; and its luqata (fallen things) should not be picked up \nexcept by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" \nAl-`Abbas said, \"O Allah's Messenger (ﷺ)! Except Al-Idhkhir, (for it is used by their blacksmiths and for \ntheir domestic purposes).\" So, the Prophet (ﷺ) said, \"Except Al-Idhkhir.\"","reference":"Sahih al-Bukhari 1834, Book 28, Hadith 14","grade":"","question #":"question #3","question":"How does the concept of Jihad relate to the intentions and actions of Muslims after the conquest of Mecca?","id":"bukhari-28-106"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped while he was in a state of Ihram.","reference":"Sahih al-Bukhari 1835, Book 28, Hadith 15","grade":"","question #":"question #3","question":"What are the permissible medical treatments during Ihram according to Islamic teachings?","id":"bukhari-28-107"},{"hadith-eng":"The Prophet, while in the state of Ihram, was cupped at the middle of his head at Liha-Jamal.","reference":"Sahih al-Bukhari 1836, Book 28, Hadith 16","grade":"","question #":"question #3","question":"What are the guidelines for performing medical treatments like cupping while in the state of Ihram?","id":"bukhari-28-108"},{"hadith-eng":"The Prophet (ﷺ) married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage \nwere held).","reference":"Sahih al-Bukhari 1837, Book 28, Hadith 17","grade":"","question #":"question #3","question":"How does the state of Ihram affect personal and social activities such as marriage?","id":"bukhari-28-109"},{"hadith-eng":"A person stood up and asked, \"O Allah's: Apostle! What clothes may be worn in the state of Ihram?\" \nThe Prophet (ﷺ) replied, \"Do not wear a shirt or trousers, or any headgear (e.g. a turban), or a hooded \ncloak; but if somebody has no shoes he can wear leather stockings provided they are cut short off the \nankles, and also, do not wear anything perfumed with Wars or saffron, and the Muhrima (a woman in \nthe state of Ihram) should not cover her face, or wear gloves.\"","reference":"Sahih al-Bukhari 1838, Book 28, Hadith 18","grade":"","question #":"question #3","question":"What are the guidelines for women regarding face covering and gloves while in the state of Ihram?","id":"bukhari-28-110"},{"hadith-eng":"A man was crushed to death by his she-camel and was brought to Allah's Messenger (ﷺ) who said, \"Give him \na bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will \nbe resurrected reciting Talbiya.\"","reference":"Sahih al-Bukhari 1839, Book 28, Hadith 19","grade":"","question #":"question #3","question":"What is the significance of being resurrected reciting Talbiya for someone who dies in Ihram?","id":"bukhari-28-111"},{"hadith-eng":"`Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a \nMuhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin \n`Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of \nthe well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I \nam `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Messenger (ﷺ) \nused to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of \ncloth and lowered it till his head appeared before me, and then told somebody to pour water on his \nhead. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing \nthem from back to front and from front to back and said, \"I saw the Prophet (ﷺ) doing like this.\"","reference":"Sahih al-Bukhari 1840, Book 28, Hadith 20","grade":"","question #":"question #3","question":"What can be learned from the differing opinions of companions regarding religious practices?","id":"bukhari-28-112"},{"hadith-eng":"I heard the Prophet (ﷺ) delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he \ncould wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below \nthe ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he \ncould wear trousers.\"","reference":"Sahih al-Bukhari 1841, Book 28, Hadith 21","grade":"","question #":"question #3","question":"What guidance is provided for a Muhrim regarding clothing if an Izar is not available?","id":"bukhari-28-113"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked what sort of clothes a Muhrim should wear. He replied, \"He should not \nwear a shirt, turbans, trousers, a hooded cloak, or a dress perfumed with saffron or Wars; and if \nslippers are not available he can wear Khuffs (socks made from thick fabric or leather) but he should \ncut them so that they reach below the ankles.","reference":"Sahih al-Bukhari 1842, Book 28, Hadith 22","grade":"","question #":"question #3","question":"Why is it important for a Muhrim to avoid wearing clothes perfumed with saffron or Wars?","id":"bukhari-28-114"},{"hadith-eng":"The Prophet (ﷺ) delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, \nand whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"","reference":"Sahih al-Bukhari 1843, Book 28, Hadith 23","grade":"","question #":"question #3","question":"How does the Prophet's (ﷺ) sermon at `Arafat address the issue of clothing for pilgrims?","id":"bukhari-28-115"},{"hadith-eng":"The Prophet (ﷺ) assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca \nrefused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca \nany arms but sheathed.","reference":"Sahih al-Bukhari 1844, Book 28, Hadith 24","grade":"","question #":"question #3","question":"What significance does the month of Dhul-Qa'da hold in the context of performing Umra?","id":"bukhari-28-116"},{"hadith-eng":"The Prophet (ﷺ) fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, \nand Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit \nare for those people and also for those who come through these Mawaqit (from places other than the \nabove-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these \nMawaqit can assume Ihram from the place where they start; even the people of Mecca can assume \nIhram from Mecca.","reference":"Sahih al-Bukhari 1845, Book 28, Hadith 25","grade":"","question #":"question #3","question":"Where should the people of Mecca assume Ihram when performing Hajj or Umra?","id":"bukhari-28-117"},{"hadith-eng":"Allah's Messenger (ﷺ) entered Mecca in the year of its Conquest wearing an Arabian helmet on his head and \nwhen the Prophet (ﷺ) took it off, a person came and said, \"Ibn Khatal is holding the covering of the Ka`ba \n(taking refuge in the Ka`ba).\" The Prophet (ﷺ) said, \"Kill him.\"","reference":"Sahih al-Bukhari 1846, Book 28, Hadith 26","grade":"","question #":"question #3","question":"What does the incident involving Ibn Khatal during the conquest of Mecca reveal about the Prophet's (ﷺ) stance on justice and accountability?","id":"bukhari-28-118"},{"hadith-eng":"While I was with Allah's Messenger (ﷺ) there came to him a man wearing a cloak having a trace of yellowish \nperfume or a similar thing on it. `Umar used to say to me, \"Would you like to see the Prophet (ﷺ) at the \ntime when he is inspired divinely?\" So, it happened that he was inspired (then) and when the \ninspiration was over the Prophet (ﷺ) said (to that man), \"Do in your `Umra the same as you do in your \nHajj.\"","reference":"Sahih al-Bukhari 1847, Book 28, Hadith 27","grade":"","question #":"question #3","question":"What role does the presence of companions play in witnessing the moments of divine inspiration received by the Prophet (ﷺ)?","id":"bukhari-28-119"},{"hadith-eng":"A man bit the hand of another man but in that process the latter broke one incisor tooth of the former, and the Prophet (ﷺ) forgave the latter.","reference":"Sahih al-Bukhari 1848, Book 28, Hadith 28","grade":"","question #":"question #3","question":"What lessons can be learned about conflict resolution from the actions of the Prophet Muhammad (ﷺ)?","id":"bukhari-28-120"},{"hadith-eng":"While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"","reference":"Sahih al-Bukhari 1849, Book 28, Hadith 29","grade":"","question #":"question #3","question":"What is the significance of using water and Sidr in the washing of a deceased person in Islam?","id":"bukhari-28-121"},{"hadith-eng":"While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"","reference":"Sahih al-Bukhari 1850, Book 28, Hadith 30","grade":"","question #":"question #3","question":"What is the significance of reciting Talbiya during Hajj and its connection to the Day of Resurrection?","id":"bukhari-28-122"},{"hadith-eng":"A man was in the company of the Prophet (ﷺ) and his she-camel crushed his neck while he was in a state \nof Ihram and he died Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in his two \ngarments; neither perfume him nor cover his head, for he will be resurrected on the Day of \nResurrection, reciting Talbiya.\"","reference":"Sahih al-Bukhari 1851, Book 28, Hadith 31","grade":"","question #":"question #3","question":"What significance does the recitation of Talbiya have for someone who dies in Ihram?","id":"bukhari-28-123"},{"hadith-eng":"A woman from the tribe of Juhaina came to the Prophet (ﷺ) and said, \"My mother had vowed to perform \nHajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet (ﷺ) \nreplied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or \nnot? So, pay Allah's debt as He has more right to be paid.\"","reference":"Sahih al-Bukhari 1852, Book 28, Hadith 32","grade":"","question #":"question #3","question":"What are the responsibilities of a person towards the unfulfilled religious duties of their deceased relatives?","id":"bukhari-28-124"},{"hadith-eng":"A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet (ﷺ) ) and said, \n\"O Allah's Messenger (ﷺ)! My father has come under Allah's obligation of performing Hajj but he is a very \nold man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his \nbehalf?\" The Prophet (ﷺ) replied in the affirmative.","reference":"Sahih al-Bukhari 1853, Book 28, Hadith 33","grade":"","question #":"question #3","question":"How does Islam address the obligations of elderly or incapacitated individuals in performing religious duties?","id":"bukhari-28-125"},{"hadith-eng":"Al-Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al-Fadl \nstarted looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She \nsaid, \"My father has come under Allah's obligation of performing Hajj but he is a very old man and \ncannot sit properly on his Mount. Shall I perform Hajj on his behalf? The Prophet (ﷺ) replied in the \naffirmative. That happened during Hajjat-al-Wada` of the Prophet (ﷺ) .","reference":"Sahih al-Bukhari 1854, Book 28, Hadith 34","grade":"","question #":"question #3","question":"What are the conditions under which a person can perform Hajj on behalf of another?","id":"bukhari-28-126"},{"hadith-eng":"Al Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet (ﷺ) replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet (ﷺ).","reference":"Sahih al-Bukhari 1855, Book 28, Hadith 35","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's (ﷺ) interaction with Al Fadl and the woman from the tribe of Khath'am during Hajjat-ul-Wada'?","id":"bukhari-28-127"},{"hadith-eng":"The Prophet (ﷺ) sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.","reference":"Sahih al-Bukhari 1856, Book 28, Hadith 36","grade":"","question #":"question #3","question":"What is the importance of the location Al-Muzdalifa in the context of Hajj rituals?","id":"bukhari-28-128"},{"hadith-eng":"I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Messenger (ﷺ) was \npraying at Mina. I passed in front of a part of the first row and then dismounted from it, and the \nanimal started grazing. I aligned with the people behind Allah's Messenger (ﷺ) (The sub-narrator added that \nhappened in Mina during the Prophet's Hajjat-al-Wada`.)","reference":"Sahih al-Bukhari 1857, Book 28, Hadith 37","grade":"","question #":"question #3","question":"What can be learned from the actions of companions during the Prophet's farewell pilgrimage?","id":"bukhari-28-129"},{"hadith-eng":"(While in the company of my parents) I was made to perform Hajj with Allah's Messenger (ﷺ) and I was a \nseven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)","reference":"Sahih al-Bukhari 1858, Book 28, Hadith 38","grade":"","question #":"question #3","question":"How does accompanying parents during Hajj impact a child's religious upbringing?","id":"bukhari-28-130"},{"hadith-eng":"I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid that he had performed Hajj (while \ncarried) with the belongings of the Prophet.","reference":"Sahih al-Bukhari 1859, Book 28, Hadith 39","grade":"","question #":"question #3","question":"How does the narration reflect the connection between the companions and the Prophet's belongings?","id":"bukhari-28-131"},{"hadith-eng":"Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet(ﷺ)to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.","reference":"Sahih al-Bukhari 1860, Book 28, Hadith 40","grade":"","question #":"question #3","question":"What does this event tell us about the responsibilities of leadership in ensuring the well-being of others?","id":"bukhari-28-132"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! Shouldn't we participate in Holy battles and Jihad along with you?\" He \nreplied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" \n`Aisha added: Ever since I heard that from Allah's Messenger (ﷺ) I have determined not to miss Hajj.","reference":"Sahih al-Bukhari 1861, Book 28, Hadith 41","grade":"","question #":"question #3","question":"What is the significance of an accepted Hajj in the context of spiritual striving for women?","id":"bukhari-28-133"},{"hadith-eng":"The Prophet (ﷺ) said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with \nwhom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit \nher except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Messenger (ﷺ)! I intend to \ngo to such and such an army and my wife wants to perform Hajj.\" The Prophet (ﷺ) said (to him), \"Go \nalong with her (to Hajj).","reference":"Sahih al-Bukhari 1862, Book 28, Hadith 42","grade":"","question #":"question #3","question":"What should a husband prioritize if his wife wishes to perform Hajj while he has other commitments?","id":"bukhari-28-134"},{"hadith-eng":"When the Prophet (ﷺ) returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid \nyou to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he \nperformed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet (ﷺ) said \n(to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in \nreward).","reference":"Sahih al-Bukhari 1863, Book 28, Hadith 43","grade":"","question #":"question #3","question":"What alternatives does Islam provide for those who are unable to perform Hajj due to financial or logistical constraints?","id":"bukhari-28-135"},{"hadith-eng":"Abu Sa`id who participated in twelve Ghazawat with the Prophet (ﷺ) said, \"I heard four things from \nAllah's Messenger (ﷺ) (or I narrate them from the Prophet (ﷺ) ) which won my admiration and appreciation. \nThey are: \n-1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. \n-2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. \n-3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the \nmorning prayer till the sun rises. \n-4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in \nMedina), and Masjid-al-Aqsa (in Jerusalem).","reference":"Sahih al-Bukhari 1864, Book 28, Hadith 44","grade":"","question #":"question #3","question":"What are the specific times when prayer is not allowed in Islam?","id":"bukhari-28-136"},{"hadith-eng":"The Prophet (ﷺ) saw an old man walking, supported by his two sons, and asked about him. The people \ninformed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old \nman's torturing himself,\" and ordered him to ride.","reference":"Sahih al-Bukhari 1865, Book 28, Hadith 45","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the modification of vows that may cause harm or undue hardship?","id":"bukhari-28-137"},{"hadith-eng":"My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet (ﷺ) about \nit. So, I did and the Prophet (ﷺ) said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:","reference":"Sahih al-Bukhari 1866, Book 28, Hadith 46","grade":"","question #":"question #3","question":"What guidance does Islam provide for those who make vows that may be difficult to fulfill?","id":"bukhari-28-138"}]