[{"hadith-eng":"The Prophet (ﷺ) said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no \nheresy should be innovated nor any sin should be committed in it, and whoever innovates in it an \nheresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the \npeople.\" (See Hadith No. 409, Vol 9).","reference":"Sahih al-Bukhari 1867, Book 29, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of Medina being designated as a sanctuary in Islam?","id":"bukhari-29-1"},{"hadith-eng":"The Prophet (ﷺ) came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to \nme the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished \nfor a reward from Allah for giving up their land freely). So, the Prophet (ﷺ) ordered the graves of the \npagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms \nwere fixed in the direction of the Qibla of the mosque.","reference":"Sahih al-Bukhari 1868, Book 29, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of offering land for the construction of a mosque without seeking monetary compensation?","id":"bukhari-29-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet (ﷺ) \nwent to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" \nbut looking around, he added, \"No, you are inside the sanctuary.\"","reference":"Sahih al-Bukhari 1869, Book 29, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of Medina being declared a sanctuary by the Prophet Muhammad (ﷺ)?","id":"bukhari-29-3"},{"hadith-eng":"We have nothing except the Book of Allah and this written paper from the Prophet (wherein is \nwritten:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever \ninnovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the \ncurse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of \nworship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured \n(respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of \nAllah, the angels, and all the people, and none of his compulsory or optional good deeds of worship \nwill be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters \nwithout their permission incurs the curse of Allah, the angels, and all the people, and none of his \ncompulsory or optional good deeds of worship will be accepted.","reference":"Sahih al-Bukhari 1870, Book 29, Hadith 4","grade":"","question #":"question #1","question":"What are the consequences of innovating or committing sins in the sanctuary of Medina?","id":"bukhari-29-4"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"I was ordered to migrate to a town which will swallow (conquer) other towns \nand is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the \nimpurities of iron.","reference":"Sahih al-Bukhari 1871, Book 29, Hadith 5","grade":"","question #":"question #1","question":"What significance does the city of Medina hold in Islamic history according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-29-5"},{"hadith-eng":"We came with the Prophet (ﷺ) from Tabuk, and when we reached near Medina, the Prophet (ﷺ) said, \"This is \nTabah.\"","reference":"Sahih al-Bukhari 1872, Book 29, Hadith 6","grade":"","question #":"question #1","question":"What significance does the city of Medina hold in Islamic tradition?","id":"bukhari-29-6"},{"hadith-eng":"If I saw deers grazing in Medina, I would not chase them, for Allah's Messenger (ﷺ) said, \"(Medina) is a \nsanctuary between its two mountains.\"","reference":"Sahih al-Bukhari 1873, Book 29, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of Medina being declared a sanctuary in Islamic teachings?","id":"bukhari-29-7"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"The people will leave Medina in spite of the best state it will have, \nand none except the wild birds and the beasts of prey will live in it, and the last persons who will die \nwill be two shepherds from the tribe of Muzaina, who will be driving their sheep towards Medina, but \nwill find nobody in it, and when they reach the valley of Thaniyat-al-Wada`, they will fall down on \ntheir faces dead.\"","reference":"Sahih al-Bukhari 1874, Book 29, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of Medina in Islamic eschatology?","id":"bukhari-29-8"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Yemen will be conquered and some people will migrate (from \nMedina) and will urge their families, and those who will obey them to migrate (to Yemen) although \nMedina will be better for them; if they but knew. Sham will also be conquered and some people will \nmigrate (from Medina) and will urge their families and those who will obey them, to migrate (to \nSham) although Medina will be better for them; if they but knew. 'Iraq will be conquered and some \npeople will migrate (from Medina) and will urge their families and those who will obey them to \nmigrate (to 'Iraq) although Medina will be better for them; if they but knew.\"","reference":"Sahih al-Bukhari 1875, Book 29, Hadith 9","grade":"","question #":"question #1","question":"What are the implications of migration from Medina to other regions like Yemen, Sham, and Iraq in Islamic history?","id":"bukhari-29-9"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back \nto its hole (when in danger).","reference":"Sahih al-Bukhari 1876, Book 29, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of Medina in the context of Islamic belief and faith?","id":"bukhari-29-10"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"None plots against the people of Medina but that he will be dissolved \n(destroyed) like the salt is dissolved in water.\"","reference":"Sahih al-Bukhari 1877, Book 29, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of Medina in Islam that plotting against its people is severely warned against?","id":"bukhari-29-11"},{"hadith-eng":"Once the Prophet (ﷺ) stood at the top of a (looked out from upon one) castle amongst the castles (or the \nhigh buildings) of Medina and said, \"Do you see what I see? (No doubt) I see the spots where \nafflictions will take place among your houses (and these afflictions will be) as numerous as the spots \nwhere raindrops fall.\"","reference":"Sahih al-Bukhari 1878, Book 29, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of the Prophet's ability to foresee future events in Islamic teachings?","id":"bukhari-29-12"},{"hadith-eng":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate guarding them.\"","reference":"Sahih al-Bukhari 1879, Book 29, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of Medina in Islamic eschatology concerning the protection from Al-Masih Ad-Dajjal?","id":"bukhari-29-13"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There are angels guarding the entrances (or roads) of Medina, neither plague \nnor Ad-Dajjal will be able to enter it.\"","reference":"Sahih al-Bukhari 1880, Book 29, Hadith 14","grade":"","question #":"question #1","question":"What protection does Medina have against plague and Ad-Dajjal according to Islamic teachings?","id":"bukhari-29-14"},{"hadith-eng":"The Prophet (ﷺ) said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, \nand there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in \nrows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three \nearthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"","reference":"Sahih al-Bukhari 1881, Book 29, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of Mecca and Medina in the context of protection from Ad-Dajjal?","id":"bukhari-29-15"},{"hadith-eng":"Allah's Messenger (ﷺ) told us a long narrative about Ad-Dajjal, and among the many things he mentioned, \nwas his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of \nMedina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or \none of the best men will come up to him and say, 'I testify that you are the same Dajjal whose \ndescription was given to us by Allah's Messenger (ﷺ) .' Ad-Dajjal will say to the people, 'If I kill this man \nand bring him back to life again, will you doubt my claim?' They will say, 'No.' Then Ad-Dajjal will \nkill that man and bring him back to life. That man will say, 'Now I know your reality better than \nbefore.' Ad-Dajjal will say, 'I want to kill him but I cannot.' \"","reference":"Sahih al-Bukhari 1882, Book 29, Hadith 16","grade":"","question #":"question #1","question":"What are the characteristics and actions of Ad-Dajjal as described in Islamic teachings?","id":"bukhari-29-16"},{"hadith-eng":"A bedouin came to the Prophet (ﷺ) and gave a pledge of allegiance for embracing Islam. The next day he \ncame with fever and said (to the Prophet (ﷺ) ), \"Please cancel my pledge (of embracing Islam and of \nemigrating to Medina).\" The Prophet (ﷺ) refused (that request) three times and said, \"Medina is like a \nfurnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"","reference":"Sahih al-Bukhari 1883, Book 29, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of Medina in shaping the character of its inhabitants according to Islamic teachings?","id":"bukhari-29-17"},{"hadith-eng":"When the Prophet (ﷺ) went out for (the battle of) Uhud, some of his companions (hypocrites) returned \n(home). A party of the believers remarked that they would kill those (hypocrites) who had returned, \nbut another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then \nwhat is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) \nThe Prophet (ﷺ) said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"","reference":"Sahih al-Bukhari 1884, Book 29, Hadith 18","grade":"","question #":"question #1","question":"What was the reaction of the companions when some hypocrites returned home during the battle of Uhud?","id":"bukhari-29-18"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"","reference":"Sahih al-Bukhari 1885, Book 29, Hadith 19","grade":"","question #":"question #1","question":"What significance does Medina hold in terms of blessings compared to Mecca?","id":"bukhari-29-19"},{"hadith-eng":"Whenever the Prophet (ﷺ) returned from a journey and observed the walls of Medina, he would make his \nMount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love \nfor Medina.","reference":"Sahih al-Bukhari 1886, Book 29, Hadith 20","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take upon returning to Medina from a journey?","id":"bukhari-29-20"},{"hadith-eng":"(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (ﷺ) \ndisliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will \nbe rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old \nplaces.","reference":"Sahih al-Bukhari 1887, Book 29, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of being rewarded for one's footsteps when going to the mosque?","id":"bukhari-29-21"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is a garden from the gardens of Paradise between my house and my pulpit, \nand my pulpit is on my Lake Fount (Al-Kauthar).","reference":"Sahih al-Bukhari 1888, Book 29, Hadith 22","grade":"","question #":"question #1","question":"What is the significance of the area between the Prophet's house and pulpit in Islamic tradition?","id":"bukhari-29-22"},{"hadith-eng":"When Allah's Messenger (ﷺ) reached Medina, Abu Bakr and Bilal became ill. When Abu Bakr's fever got \nworse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is \nnearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that \nI could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling \ngrass). Would that one day I could Drink the water of the Majanna, and Would that (The two \nmountains) Shama and Tafil would appear to me!\" The Prophet (ﷺ) said, \"O Allah! Curse Shaiba bin \nRabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of \nepidemics.\" Allah's Messenger (ﷺ) then said, \"O Allah! Make us love Medina as we love Mecca or even \nmore than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and \nmake the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha added: When \nwe reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of \nMedina) used to flow with impure colored water.","reference":"Sahih al-Bukhari 1889, Book 29, Hadith 23","grade":"","question #":"question #1","question":"What challenges did the early Muslims face upon their arrival in Medina?","id":"bukhari-29-23"},{"hadith-eng":"`Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your \nApostle.\"","reference":"Sahih al-Bukhari 1890, Book 29, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of seeking martyrdom in Islam?","id":"bukhari-29-24"},{"hadith-eng":"The Prophet (ﷺ) said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no \nheresy should be innovated nor any sin should be committed in it, and whoever innovates in it an \nheresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the \npeople.\" (See Hadith No. 409, Vol 9).","reference":"Sahih al-Bukhari 1867, Book 29, Hadith 1","grade":"","question #":"question #2","question":"What are the consequences of innovating heresy or committing sins in Medina according to Islamic teachings?","id":"bukhari-29-25"},{"hadith-eng":"The Prophet (ﷺ) came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to \nme the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished \nfor a reward from Allah for giving up their land freely). So, the Prophet (ﷺ) ordered the graves of the \npagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms \nwere fixed in the direction of the Qibla of the mosque.","reference":"Sahih al-Bukhari 1868, Book 29, Hadith 2","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle the presence of pagan graves when establishing a mosque?","id":"bukhari-29-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet (ﷺ) \nwent to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" \nbut looking around, he added, \"No, you are inside the sanctuary.\"","reference":"Sahih al-Bukhari 1869, Book 29, Hadith 3","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the concerns of the Bani Haritha tribe regarding their location in relation to the sanctuary?","id":"bukhari-29-27"},{"hadith-eng":"We have nothing except the Book of Allah and this written paper from the Prophet (wherein is \nwritten:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever \ninnovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the \ncurse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of \nworship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured \n(respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of \nAllah, the angels, and all the people, and none of his compulsory or optional good deeds of worship \nwill be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters \nwithout their permission incurs the curse of Allah, the angels, and all the people, and none of his \ncompulsory or optional good deeds of worship will be accepted.","reference":"Sahih al-Bukhari 1870, Book 29, Hadith 4","grade":"","question #":"question #2","question":"How is the protection granted by a Muslim to be regarded by other Muslims?","id":"bukhari-29-28"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"I was ordered to migrate to a town which will swallow (conquer) other towns \nand is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the \nimpurities of iron.","reference":"Sahih al-Bukhari 1871, Book 29, Hadith 5","grade":"","question #":"question #2","question":"How does the metaphor of a furnace relate to the purification of a community in Islamic teachings?","id":"bukhari-29-29"},{"hadith-eng":"We came with the Prophet (ﷺ) from Tabuk, and when we reached near Medina, the Prophet (ﷺ) said, \"This is \nTabah.\"","reference":"Sahih al-Bukhari 1872, Book 29, Hadith 6","grade":"","question #":"question #2","question":"What can be learned about the Prophet Muhammad's (ﷺ) travels from the journey to Tabuk?","id":"bukhari-29-30"},{"hadith-eng":"If I saw deers grazing in Medina, I would not chase them, for Allah's Messenger (ﷺ) said, \"(Medina) is a \nsanctuary between its two mountains.\"","reference":"Sahih al-Bukhari 1873, Book 29, Hadith 7","grade":"","question #":"question #2","question":"How does the concept of a sanctuary affect the treatment of wildlife in Medina?","id":"bukhari-29-31"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"The people will leave Medina in spite of the best state it will have, \nand none except the wild birds and the beasts of prey will live in it, and the last persons who will die \nwill be two shepherds from the tribe of Muzaina, who will be driving their sheep towards Medina, but \nwill find nobody in it, and when they reach the valley of Thaniyat-al-Wada`, they will fall down on \ntheir faces dead.\"","reference":"Sahih al-Bukhari 1874, Book 29, Hadith 8","grade":"","question #":"question #2","question":"What does the hadith imply about the future state of Medina and its inhabitants?","id":"bukhari-29-32"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Yemen will be conquered and some people will migrate (from \nMedina) and will urge their families, and those who will obey them to migrate (to Yemen) although \nMedina will be better for them; if they but knew. Sham will also be conquered and some people will \nmigrate (from Medina) and will urge their families and those who will obey them, to migrate (to \nSham) although Medina will be better for them; if they but knew. 'Iraq will be conquered and some \npeople will migrate (from Medina) and will urge their families and those who will obey them to \nmigrate (to 'Iraq) although Medina will be better for them; if they but knew.\"","reference":"Sahih al-Bukhari 1875, Book 29, Hadith 9","grade":"","question #":"question #2","question":"Why might Medina be considered better than other regions for Muslims, according to Islamic teachings?","id":"bukhari-29-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back \nto its hole (when in danger).","reference":"Sahih al-Bukhari 1876, Book 29, Hadith 10","grade":"","question #":"question #2","question":"How is the concept of belief described in terms of its movement or return in this narration?","id":"bukhari-29-34"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"None plots against the people of Medina but that he will be dissolved \n(destroyed) like the salt is dissolved in water.\"","reference":"Sahih al-Bukhari 1877, Book 29, Hadith 11","grade":"","question #":"question #2","question":"What are the consequences mentioned for those who plot against the people of Medina?","id":"bukhari-29-35"},{"hadith-eng":"Once the Prophet (ﷺ) stood at the top of a (looked out from upon one) castle amongst the castles (or the \nhigh buildings) of Medina and said, \"Do you see what I see? (No doubt) I see the spots where \nafflictions will take place among your houses (and these afflictions will be) as numerous as the spots \nwhere raindrops fall.\"","reference":"Sahih al-Bukhari 1878, Book 29, Hadith 12","grade":"","question #":"question #2","question":"How are afflictions and trials perceived in the context of Islamic eschatology?","id":"bukhari-29-36"},{"hadith-eng":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate guarding them.\"","reference":"Sahih al-Bukhari 1879, Book 29, Hadith 13","grade":"","question #":"question #2","question":"How is the city of Medina protected from the terror of Al-Masih Ad-Dajjal according to Islamic teachings?","id":"bukhari-29-37"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There are angels guarding the entrances (or roads) of Medina, neither plague \nnor Ad-Dajjal will be able to enter it.\"","reference":"Sahih al-Bukhari 1880, Book 29, Hadith 14","grade":"","question #":"question #2","question":"What role do angels play in safeguarding certain locations in Islamic belief?","id":"bukhari-29-38"},{"hadith-eng":"The Prophet (ﷺ) said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, \nand there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in \nrows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three \nearthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"","reference":"Sahih al-Bukhari 1881, Book 29, Hadith 15","grade":"","question #":"question #2","question":"How do angels play a role in safeguarding certain cities from Ad-Dajjal?","id":"bukhari-29-39"},{"hadith-eng":"Allah's Messenger (ﷺ) told us a long narrative about Ad-Dajjal, and among the many things he mentioned, \nwas his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of \nMedina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or \none of the best men will come up to him and say, 'I testify that you are the same Dajjal whose \ndescription was given to us by Allah's Messenger (ﷺ) .' Ad-Dajjal will say to the people, 'If I kill this man \nand bring him back to life again, will you doubt my claim?' They will say, 'No.' Then Ad-Dajjal will \nkill that man and bring him back to life. That man will say, 'Now I know your reality better than \nbefore.' Ad-Dajjal will say, 'I want to kill him but I cannot.' \"","reference":"Sahih al-Bukhari 1882, Book 29, Hadith 16","grade":"","question #":"question #2","question":"How is the city of Medina protected from Ad-Dajjal according to Islamic tradition?","id":"bukhari-29-40"},{"hadith-eng":"A bedouin came to the Prophet (ﷺ) and gave a pledge of allegiance for embracing Islam. The next day he \ncame with fever and said (to the Prophet (ﷺ) ), \"Please cancel my pledge (of embracing Islam and of \nemigrating to Medina).\" The Prophet (ﷺ) refused (that request) three times and said, \"Medina is like a \nfurnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"","reference":"Sahih al-Bukhari 1883, Book 29, Hadith 17","grade":"","question #":"question #2","question":"How does the concept of a city expelling impurities relate to the spiritual development of individuals in Islam?","id":"bukhari-29-41"},{"hadith-eng":"When the Prophet (ﷺ) went out for (the battle of) Uhud, some of his companions (hypocrites) returned \n(home). A party of the believers remarked that they would kill those (hypocrites) who had returned, \nbut another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then \nwhat is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) \nThe Prophet (ﷺ) said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"","reference":"Sahih al-Bukhari 1884, Book 29, Hadith 18","grade":"","question #":"question #2","question":"How does the Quran address the division among believers regarding the treatment of hypocrites?","id":"bukhari-29-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"","reference":"Sahih al-Bukhari 1885, Book 29, Hadith 19","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) express his supplication for the city of Medina?","id":"bukhari-29-43"},{"hadith-eng":"Whenever the Prophet (ﷺ) returned from a journey and observed the walls of Medina, he would make his \nMount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love \nfor Medina.","reference":"Sahih al-Bukhari 1886, Book 29, Hadith 20","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) express his affection for the city of Medina?","id":"bukhari-29-44"},{"hadith-eng":"(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (ﷺ) \ndisliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will \nbe rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old \nplaces.","reference":"Sahih al-Bukhari 1887, Book 29, Hadith 21","grade":"","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) discourage the people of Bani Salama from relocating closer to the mosque?","id":"bukhari-29-45"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is a garden from the gardens of Paradise between my house and my pulpit, \nand my pulpit is on my Lake Fount (Al-Kauthar).","reference":"Sahih al-Bukhari 1888, Book 29, Hadith 22","grade":"","question #":"question #2","question":"How is the concept of Paradise represented in the physical locations associated with the Prophet Muhammad?","id":"bukhari-29-46"},{"hadith-eng":"When Allah's Messenger (ﷺ) reached Medina, Abu Bakr and Bilal became ill. When Abu Bakr's fever got \nworse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is \nnearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that \nI could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling \ngrass). Would that one day I could Drink the water of the Majanna, and Would that (The two \nmountains) Shama and Tafil would appear to me!\" The Prophet (ﷺ) said, \"O Allah! Curse Shaiba bin \nRabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of \nepidemics.\" Allah's Messenger (ﷺ) then said, \"O Allah! Make us love Medina as we love Mecca or even \nmore than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and \nmake the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha added: When \nwe reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of \nMedina) used to flow with impure colored water.","reference":"Sahih al-Bukhari 1889, Book 29, Hadith 23","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) pray for the well-being of Medina and its inhabitants?","id":"bukhari-29-47"},{"hadith-eng":"`Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your \nApostle.\"","reference":"Sahih al-Bukhari 1890, Book 29, Hadith 24","grade":"","question #":"question #2","question":"Why might a person desire to die in a specific location, such as the city of the Prophet?","id":"bukhari-29-48"},{"hadith-eng":"The Prophet (ﷺ) said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no \nheresy should be innovated nor any sin should be committed in it, and whoever innovates in it an \nheresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the \npeople.\" (See Hadith No. 409, Vol 9).","reference":"Sahih al-Bukhari 1867, Book 29, Hadith 1","grade":"","question #":"question #3","question":"How does Islam view the protection of natural resources, such as trees, in sacred places like Medina?","id":"bukhari-29-49"},{"hadith-eng":"The Prophet (ﷺ) came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to \nme the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished \nfor a reward from Allah for giving up their land freely). So, the Prophet (ﷺ) ordered the graves of the \npagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms \nwere fixed in the direction of the Qibla of the mosque.","reference":"Sahih al-Bukhari 1868, Book 29, Hadith 2","grade":"","question #":"question #3","question":"What was the purpose of using cut date-palm trees in the construction of the mosque's Qibla direction?","id":"bukhari-29-50"},{"hadith-eng":"The Prophet (ﷺ) said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet (ﷺ) \nwent to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" \nbut looking around, he added, \"No, you are inside the sanctuary.\"","reference":"Sahih al-Bukhari 1869, Book 29, Hadith 3","grade":"","question #":"question #3","question":"What geographical features define the boundaries of the sanctuary of Medina according to the Prophet Muhammad (ﷺ)?","id":"bukhari-29-51"},{"hadith-eng":"We have nothing except the Book of Allah and this written paper from the Prophet (wherein is \nwritten:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever \ninnovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the \ncurse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of \nworship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured \n(respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of \nAllah, the angels, and all the people, and none of his compulsory or optional good deeds of worship \nwill be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters \nwithout their permission incurs the curse of Allah, the angels, and all the people, and none of his \ncompulsory or optional good deeds of worship will be accepted.","reference":"Sahih al-Bukhari 1870, Book 29, Hadith 4","grade":"","question #":"question #3","question":"What are the implications of befriending others without the permission of one's manumitters in Islam?","id":"bukhari-29-52"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"I was ordered to migrate to a town which will swallow (conquer) other towns \nand is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the \nimpurities of iron.","reference":"Sahih al-Bukhari 1871, Book 29, Hadith 5","grade":"","question #":"question #3","question":"What was the significance of the migration to Medina for the early Muslim community?","id":"bukhari-29-53"},{"hadith-eng":"We came with the Prophet (ﷺ) from Tabuk, and when we reached near Medina, the Prophet (ﷺ) said, \"This is \nTabah.\"","reference":"Sahih al-Bukhari 1872, Book 29, Hadith 6","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) react upon nearing Medina after a journey?","id":"bukhari-29-54"},{"hadith-eng":"If I saw deers grazing in Medina, I would not chase them, for Allah's Messenger (ﷺ) said, \"(Medina) is a \nsanctuary between its two mountains.\"","reference":"Sahih al-Bukhari 1873, Book 29, Hadith 7","grade":"","question #":"question #3","question":"What are the geographical boundaries of the sanctuary of Medina as mentioned in Islamic tradition?","id":"bukhari-29-55"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"The people will leave Medina in spite of the best state it will have, \nand none except the wild birds and the beasts of prey will live in it, and the last persons who will die \nwill be two shepherds from the tribe of Muzaina, who will be driving their sheep towards Medina, but \nwill find nobody in it, and when they reach the valley of Thaniyat-al-Wada`, they will fall down on \ntheir faces dead.\"","reference":"Sahih al-Bukhari 1874, Book 29, Hadith 8","grade":"","question #":"question #3","question":"Who are the last people mentioned in the hadith to die in Medina, and what is their significance?","id":"bukhari-29-56"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Yemen will be conquered and some people will migrate (from \nMedina) and will urge their families, and those who will obey them to migrate (to Yemen) although \nMedina will be better for them; if they but knew. Sham will also be conquered and some people will \nmigrate (from Medina) and will urge their families and those who will obey them, to migrate (to \nSham) although Medina will be better for them; if they but knew. 'Iraq will be conquered and some \npeople will migrate (from Medina) and will urge their families and those who will obey them to \nmigrate (to 'Iraq) although Medina will be better for them; if they but knew.\"","reference":"Sahih al-Bukhari 1875, Book 29, Hadith 9","grade":"","question #":"question #3","question":"What factors might influence people to migrate from a place of religious significance despite its virtues?","id":"bukhari-29-57"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back \nto its hole (when in danger).","reference":"Sahih al-Bukhari 1876, Book 29, Hadith 10","grade":"","question #":"question #3","question":"What analogy is used to describe the return of belief to Medina, and what does it imply about the nature of faith?","id":"bukhari-29-58"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"None plots against the people of Medina but that he will be dissolved \n(destroyed) like the salt is dissolved in water.\"","reference":"Sahih al-Bukhari 1877, Book 29, Hadith 11","grade":"","question #":"question #3","question":"How does the metaphor of salt dissolving in water relate to the fate of those who plot against Medina?","id":"bukhari-29-59"},{"hadith-eng":"Once the Prophet (ﷺ) stood at the top of a (looked out from upon one) castle amongst the castles (or the \nhigh buildings) of Medina and said, \"Do you see what I see? (No doubt) I see the spots where \nafflictions will take place among your houses (and these afflictions will be) as numerous as the spots \nwhere raindrops fall.\"","reference":"Sahih al-Bukhari 1878, Book 29, Hadith 12","grade":"","question #":"question #3","question":"What lessons can be drawn from the Prophet's warning about future afflictions in Medina?","id":"bukhari-29-60"},{"hadith-eng":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate guarding them.\"","reference":"Sahih al-Bukhari 1879, Book 29, Hadith 13","grade":"","question #":"question #3","question":"What role do angels play in safeguarding Medina during the time of Al-Masih Ad-Dajjal?","id":"bukhari-29-61"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There are angels guarding the entrances (or roads) of Medina, neither plague \nnor Ad-Dajjal will be able to enter it.\"","reference":"Sahih al-Bukhari 1880, Book 29, Hadith 14","grade":"","question #":"question #3","question":"How is the city of Medina uniquely protected in Islamic eschatology?","id":"bukhari-29-62"},{"hadith-eng":"The Prophet (ﷺ) said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, \nand there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in \nrows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three \nearthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"","reference":"Sahih al-Bukhari 1881, Book 29, Hadith 15","grade":"","question #":"question #3","question":"What events are described to occur in Medina during the time of Ad-Dajjal's presence?","id":"bukhari-29-63"},{"hadith-eng":"Allah's Messenger (ﷺ) told us a long narrative about Ad-Dajjal, and among the many things he mentioned, \nwas his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of \nMedina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or \none of the best men will come up to him and say, 'I testify that you are the same Dajjal whose \ndescription was given to us by Allah's Messenger (ﷺ) .' Ad-Dajjal will say to the people, 'If I kill this man \nand bring him back to life again, will you doubt my claim?' They will say, 'No.' Then Ad-Dajjal will \nkill that man and bring him back to life. That man will say, 'Now I know your reality better than \nbefore.' Ad-Dajjal will say, 'I want to kill him but I cannot.' \"","reference":"Sahih al-Bukhari 1882, Book 29, Hadith 16","grade":"","question #":"question #3","question":"What is the significance of the testimony of the best man regarding Ad-Dajjal's identity?","id":"bukhari-29-64"},{"hadith-eng":"A bedouin came to the Prophet (ﷺ) and gave a pledge of allegiance for embracing Islam. The next day he \ncame with fever and said (to the Prophet (ﷺ) ), \"Please cancel my pledge (of embracing Islam and of \nemigrating to Medina).\" The Prophet (ﷺ) refused (that request) three times and said, \"Medina is like a \nfurnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"","reference":"Sahih al-Bukhari 1883, Book 29, Hadith 17","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's response to the bedouin's request to cancel his pledge of allegiance?","id":"bukhari-29-65"},{"hadith-eng":"When the Prophet (ﷺ) went out for (the battle of) Uhud, some of his companions (hypocrites) returned \n(home). A party of the believers remarked that they would kill those (hypocrites) who had returned, \nbut another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then \nwhat is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) \nThe Prophet (ﷺ) said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"","reference":"Sahih al-Bukhari 1884, Book 29, Hadith 18","grade":"","question #":"question #3","question":"What analogy did the Prophet (ﷺ) use to describe how Medina deals with bad persons?","id":"bukhari-29-66"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"","reference":"Sahih al-Bukhari 1885, Book 29, Hadith 19","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) affection for Medina from his prayer for its blessings?","id":"bukhari-29-67"},{"hadith-eng":"Whenever the Prophet (ﷺ) returned from a journey and observed the walls of Medina, he would make his \nMount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love \nfor Medina.","reference":"Sahih al-Bukhari 1886, Book 29, Hadith 20","grade":"","question #":"question #3","question":"What significance does Medina hold in the life of the Prophet (ﷺ) as demonstrated by his actions upon returning from travel?","id":"bukhari-29-68"},{"hadith-eng":"(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (ﷺ) \ndisliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will \nbe rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old \nplaces.","reference":"Sahih al-Bukhari 1887, Book 29, Hadith 21","grade":"","question #":"question #3","question":"How does the intention behind one's actions influence the reward in Islamic teachings?","id":"bukhari-29-69"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is a garden from the gardens of Paradise between my house and my pulpit, \nand my pulpit is on my Lake Fount (Al-Kauthar).","reference":"Sahih al-Bukhari 1888, Book 29, Hadith 22","grade":"","question #":"question #3","question":"What is the importance of Al-Kauthar in Islamic eschatology?","id":"bukhari-29-70"},{"hadith-eng":"When Allah's Messenger (ﷺ) reached Medina, Abu Bakr and Bilal became ill. When Abu Bakr's fever got \nworse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is \nnearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that \nI could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling \ngrass). Would that one day I could Drink the water of the Majanna, and Would that (The two \nmountains) Shama and Tafil would appear to me!\" The Prophet (ﷺ) said, \"O Allah! Curse Shaiba bin \nRabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of \nepidemics.\" Allah's Messenger (ﷺ) then said, \"O Allah! Make us love Medina as we love Mecca or even \nmore than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and \nmake the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha added: When \nwe reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of \nMedina) used to flow with impure colored water.","reference":"Sahih al-Bukhari 1889, Book 29, Hadith 23","grade":"","question #":"question #3","question":"What significance do the poetic verses recited by Abu Bakr and Bilal hold in the context of their illness?","id":"bukhari-29-71"},{"hadith-eng":"`Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your \nApostle.\"","reference":"Sahih al-Bukhari 1890, Book 29, Hadith 24","grade":"","question #":"question #3","question":"How does the intention of martyrdom reflect one's dedication to the cause of Allah?","id":"bukhari-29-72"}]