[{"hadith-eng":"The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the \ntwo charitable persons, (the second being the owner).","reference":"Sahih al-Bukhari 2260, Book 37, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of honesty in the role of a treasurer in Islam?","id":"bukhari-37-1"},{"hadith-eng":"I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they \nwant employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it \nearnestly.\"","reference":"Sahih al-Bukhari 2261, Book 37, Hadith 2","grade":"","question #":"question #1","question":"What is the Islamic perspective on seeking positions of authority or employment?","id":"bukhari-37-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \n\"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of \nMecca for some Qirats.\"","reference":"Sahih al-Bukhari 2262, Book 37, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of prophets having experience as shepherds in their lives?","id":"bukhari-37-3"},{"hadith-eng":"The Prophet (ﷺ) and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of \nBani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to \nabide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) \nand Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to \nthe Cave of Thaur after three days. So, he brought them their two riding camels after three days and \nboth of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili \nguide who guided them below Mecca along the road leading to the sea-shore.","reference":"Sahih al-Bukhari 2263, Book 37, Hadith 4","grade":"","question #":"question #1","question":"What qualities should a guide possess to be trusted with important tasks?","id":"bukhari-37-4"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as \nan expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and \nAbu Bakr gave him their two riding camels and took a promise from him to bring their riding camels \nin the morning of the third day to the Cave of Thaur.","reference":"Sahih al-Bukhari 2264, Book 37, Hadith 5","grade":"","question #":"question #1","question":"What role did the guide from the tribe of Bani-Ad-Dil play in the journey of the Prophet and Abu Bakr?","id":"bukhari-37-5"},{"hadith-eng":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).","reference":"Sahih al-Bukhari 2265, 2266, Book 37, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of personal responsibility in disputes according to Islamic teachings?","id":"bukhari-37-6"},{"hadith-eng":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).","reference":"Sahih al-Bukhari 2265, 2266, Book 37, Hadith 6","grade":"","question #":"question #1","question":"What lesson can be learned about personal responsibility and consequences from the incident involving the biting of a finger?","id":"bukhari-37-7"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall \nwhich was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the \nwall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or \nSa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if \nyou had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to \nbuy food . \"","reference":"Sahih al-Bukhari 2267, Book 37, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of the story of Moses and Al-Khadir in Islamic teachings?","id":"bukhari-37-8"},{"hadith-eng":"The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and \nChristians) is like the example of a man who employed some laborers and asked them, 'Who will \nwork for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He \nthen asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians \naccepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two \nQirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why \nshould we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They \nreplied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'","reference":"Sahih al-Bukhari 2268, Book 37, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of the different wages given to the Jews, Christians, and Muslims in this parable?","id":"bukhari-37-9"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a \nman who employed some laborers to whom he said, 'Who will work for me up to midday for one \nQirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the \nwork up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr \nprayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more \nand are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They \nreplied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"","reference":"Sahih al-Bukhari 2269, Book 37, Hadith 9","grade":"","question #":"question #1","question":"What does this narration illustrate about the distribution of divine rewards among different religious communities?","id":"bukhari-37-10"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of \nResurrection: \n-1. One who makes a covenant in My Name, but proves treacherous; \n-2. One who sells a free person and eats his price; and \n-3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"","reference":"Sahih al-Bukhari 2270, Book 37, Hadith 10","grade":"","question #":"question #1","question":"What are the consequences for those who break covenants made in the name of Allah?","id":"bukhari-37-11"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night for specific wages. They worked till \nmidday and then said, 'We do not need your money which you have fixed for us and let whatever we \nhave done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and \ntake your full wages.' But they refused and went away. The man employed another batch after them \nand said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first \nbatch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be \nannulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the \nrest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another \nbatch to work for the rest of the day and they worked for the rest of the day till the sunset, and they \nreceived the wages of the two former batches. So, that was the example of those people (Muslims) and \nthe example of this light (guidance) which they have accepted willingly.","reference":"Sahih al-Bukhari 2271, Book 37, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of perseverance and commitment in fulfilling one's duties according to Islamic teachings?","id":"bukhari-37-12"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together \ntill they reached a cave at night and entered it. A big rock rolled down the mountain and closed the \nmouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke \nAllah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one \nof them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with \nmilk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I \nmilked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide \nmy family with the milk before them. I waited for them and the bowl of milk was in my hand and I \nkept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! \nIf I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, \nthe rock shifted a little but they could not get out.\" \nThe Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people \nto me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a \nfamine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that \nshe would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is \nillegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have \nsexual intercourse with her and left her though she was the dearest of all the people to me, and also I \nleft the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the \npresent calamity.' So, the rock shifted a little more but still they could not get out from there.\" \nThe Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their \nwages with the exception of one man who did not take his wages and went away. I invested his wages \nand I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay \nme my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O \nAllah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove \nthem away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the \npresent suffering.' So, that rock shifted completely and they got out walking.","reference":"Sahih al-Bukhari 2272, Book 37, Hadith 12","grade":"","question #":"question #1","question":"How can invoking Allah with sincere intentions and righteous deeds help in overcoming difficult situations?","id":"bukhari-37-13"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as \nporters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand \nDirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying \n(some of us) .","reference":"Sahih al-Bukhari 2273, Book 37, Hadith 13","grade":"","question #":"question #1","question":"How did the companions of the Prophet (ﷺ) respond to his orders regarding charity?","id":"bukhari-37-14"},{"hadith-eng":"Ibn `Abbas said, \"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no \ntownsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the \nmeaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \n\"He should not work as a broker for him.\"","reference":"Sahih al-Bukhari 2274, Book 37, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of the prohibition against meeting caravans on the way in Islamic trade practices?","id":"bukhari-37-15"},{"hadith-eng":"I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my \nwork, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in \nMuhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I \nbe dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and \noffspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who \ndisbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)","reference":"Sahih al-Bukhari 2275, Book 37, Hadith 15","grade":"","question #":"question #1","question":"What challenges did early Muslims face in maintaining their faith while dealing with non-believers?","id":"bukhari-37-16"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at \nnight). They asked the latter to treat them as their guests but they refused. The chief of that tribe was \nthen bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some \nof them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at \nnight, it may be that some of them might possess something (as treatment),\" They went to the group of \nthe companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a \nscorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" \nOne of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as \nyour guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees \nto pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are \nfor the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a \nchain, and got up and started walking, showing no signs of sickness. \nThey paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide \ntheir earnings among themselves, but the one who performed the recitation said, \"Do not divide them \ntill we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to \nAllah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- \nFatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you \nhave earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon.","reference":"Sahih al-Bukhari 2276, Book 37, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of using Surah Al-Fatiha as a form of Ruqya in Islamic tradition?","id":"bukhari-37-17"},{"hadith-eng":"When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of \nfoodstuff and he interceded with his masters to reduce his taxes.","reference":"Sahih al-Bukhari 2277, Book 37, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of compensating someone for their services in Islamic teachings?","id":"bukhari-37-18"},{"hadith-eng":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.","reference":"Sahih al-Bukhari 2278, Book 37, Hadith 18","grade":"","question #":"question #1","question":"What does this narration teach about the importance of compensating workers for their services?","id":"bukhari-37-19"},{"hadith-eng":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable \nhe would not have paid him.","reference":"Sahih al-Bukhari 2279, Book 37, Hadith 19","grade":"","question #":"question #1","question":"What does the act of paying wages for cupping indicate about the permissibility of the practice in Islam?","id":"bukhari-37-20"},{"hadith-eng":"The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .","reference":"Sahih al-Bukhari 2280, Book 37, Hadith 20","grade":"","question #":"question #1","question":"What does this narration teach about the Prophet's practice regarding compensating workers?","id":"bukhari-37-21"},{"hadith-eng":"The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) \nordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters \nto reduce his taxes:","reference":"Sahih al-Bukhari 2281, Book 37, Hadith 21","grade":"","question #":"question #1","question":"What does this narration indicate about the Prophet's (ﷺ) attitude towards fair compensation for services rendered?","id":"bukhari-37-22"},{"hadith-eng":"Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken \nby a soothsayer.","reference":"Sahih al-Bukhari 2282, Book 37, Hadith 22","grade":"","question #":"question #1","question":"What types of earnings are considered unlawful in Islam according to this teaching?","id":"bukhari-37-23"},{"hadith-eng":"The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).","reference":"Sahih al-Bukhari 2283, Book 37, Hadith 23","grade":"","question #":"question #1","question":"What is the Islamic stance on earning money through immoral means?","id":"bukhari-37-24"},{"hadith-eng":"The Prophet (ﷺ) forbade taking a price for animal copulation.","reference":"Sahih al-Bukhari 2284, Book 37, Hadith 24","grade":"","question #":"question #1","question":"What is the Islamic ruling on charging fees for animal breeding services?","id":"bukhari-37-25"},{"hadith-eng":"\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).","reference":"Sahih al-Bukhari 2285, 2286, Book 37, Hadith 25","grade":"","question #":"question #1","question":"What was the arrangement made by the Prophet Muhammad (ﷺ) regarding the land of Khaibar and its cultivation?","id":"bukhari-37-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the \ntwo charitable persons, (the second being the owner).","reference":"Sahih al-Bukhari 2260, Book 37, Hadith 1","grade":"","question #":"question #2","question":"How is the act of giving willingly linked to charity in Islamic teachings?","id":"bukhari-37-27"},{"hadith-eng":"I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they \nwant employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it \nearnestly.\"","reference":"Sahih al-Bukhari 2261, Book 37, Hadith 2","grade":"","question #":"question #2","question":"Why might it be discouraged to appoint someone who earnestly seeks a position in Islam?","id":"bukhari-37-28"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \n\"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of \nMecca for some Qirats.\"","reference":"Sahih al-Bukhari 2262, Book 37, Hadith 3","grade":"","question #":"question #2","question":"How does shepherding relate to the qualities required for prophethood?","id":"bukhari-37-29"},{"hadith-eng":"The Prophet (ﷺ) and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of \nBani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to \nabide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) \nand Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to \nthe Cave of Thaur after three days. So, he brought them their two riding camels after three days and \nboth of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili \nguide who guided them below Mecca along the road leading to the sea-shore.","reference":"Sahih al-Bukhari 2263, Book 37, Hadith 4","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) and Abu Bakr demonstrate trust in their guide during their journey?","id":"bukhari-37-30"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as \nan expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and \nAbu Bakr gave him their two riding camels and took a promise from him to bring their riding camels \nin the morning of the third day to the Cave of Thaur.","reference":"Sahih al-Bukhari 2264, Book 37, Hadith 5","grade":"","question #":"question #2","question":"How did the Prophet and Abu Bakr ensure their safe travel during their migration?","id":"bukhari-37-31"},{"hadith-eng":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).","reference":"Sahih al-Bukhari 2265, 2266, Book 37, Hadith 6","grade":"","question #":"question #2","question":"How does Islamic jurisprudence address cases of self-inflicted harm during a conflict?","id":"bukhari-37-32"},{"hadith-eng":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).","reference":"Sahih al-Bukhari 2265, 2266, Book 37, Hadith 6","grade":"","question #":"question #2","question":"How does Islamic jurisprudence address disputes involving physical altercations and injuries?","id":"bukhari-37-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall \nwhich was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the \nwall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or \nSa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if \nyou had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to \nbuy food . \"","reference":"Sahih al-Bukhari 2267, Book 37, Hadith 7","grade":"","question #":"question #2","question":"How does the interaction between Moses and Al-Khadir illustrate the concept of divine wisdom?","id":"bukhari-37-34"},{"hadith-eng":"The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and \nChristians) is like the example of a man who employed some laborers and asked them, 'Who will \nwork for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He \nthen asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians \naccepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two \nQirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why \nshould we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They \nreplied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'","reference":"Sahih al-Bukhari 2268, Book 37, Hadith 8","grade":"","question #":"question #2","question":"How does this narration illustrate the concept of divine blessing and distribution of rewards?","id":"bukhari-37-35"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a \nman who employed some laborers to whom he said, 'Who will work for me up to midday for one \nQirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the \nwork up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr \nprayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more \nand are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They \nreplied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"","reference":"Sahih al-Bukhari 2269, Book 37, Hadith 9","grade":"","question #":"question #2","question":"How does this narration explain the concept of divine justice and mercy in rewarding human efforts?","id":"bukhari-37-36"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of \nResurrection: \n-1. One who makes a covenant in My Name, but proves treacherous; \n-2. One who sells a free person and eats his price; and \n-3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"","reference":"Sahih al-Bukhari 2270, Book 37, Hadith 10","grade":"","question #":"question #2","question":"How does Islam view the act of selling a free person and consuming the proceeds?","id":"bukhari-37-37"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night for specific wages. They worked till \nmidday and then said, 'We do not need your money which you have fixed for us and let whatever we \nhave done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and \ntake your full wages.' But they refused and went away. The man employed another batch after them \nand said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first \nbatch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be \nannulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the \nrest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another \nbatch to work for the rest of the day and they worked for the rest of the day till the sunset, and they \nreceived the wages of the two former batches. So, that was the example of those people (Muslims) and \nthe example of this light (guidance) which they have accepted willingly.","reference":"Sahih al-Bukhari 2271, Book 37, Hadith 11","grade":"","question #":"question #2","question":"How does the concept of reward and compensation relate to the efforts and dedication of individuals in religious contexts?","id":"bukhari-37-38"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together \ntill they reached a cave at night and entered it. A big rock rolled down the mountain and closed the \nmouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke \nAllah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one \nof them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with \nmilk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I \nmilked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide \nmy family with the milk before them. I waited for them and the bowl of milk was in my hand and I \nkept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! \nIf I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, \nthe rock shifted a little but they could not get out.\" \nThe Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people \nto me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a \nfamine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that \nshe would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is \nillegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have \nsexual intercourse with her and left her though she was the dearest of all the people to me, and also I \nleft the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the \npresent calamity.' So, the rock shifted a little more but still they could not get out from there.\" \nThe Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their \nwages with the exception of one man who did not take his wages and went away. I invested his wages \nand I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay \nme my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O \nAllah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove \nthem away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the \npresent suffering.' So, that rock shifted completely and they got out walking.","reference":"Sahih al-Bukhari 2272, Book 37, Hadith 12","grade":"","question #":"question #2","question":"What role does prioritizing the needs of parents play in Islamic teachings?","id":"bukhari-37-39"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as \nporters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand \nDirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying \n(some of us) .","reference":"Sahih al-Bukhari 2273, Book 37, Hadith 13","grade":"","question #":"question #2","question":"What actions did the companions take to fulfill the command of giving in charity?","id":"bukhari-37-40"},{"hadith-eng":"Ibn `Abbas said, \"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no \ntownsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the \nmeaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \n\"He should not work as a broker for him.\"","reference":"Sahih al-Bukhari 2274, Book 37, Hadith 14","grade":"","question #":"question #2","question":"Why is it discouraged for a townsman to act as a broker for a bedouin in Islamic commerce?","id":"bukhari-37-41"},{"hadith-eng":"I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my \nwork, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in \nMuhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I \nbe dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and \noffspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who \ndisbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)","reference":"Sahih al-Bukhari 2275, Book 37, Hadith 15","grade":"","question #":"question #2","question":"How does the Quran address the disbelief in resurrection and the afterlife?","id":"bukhari-37-42"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at \nnight). They asked the latter to treat them as their guests but they refused. The chief of that tribe was \nthen bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some \nof them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at \nnight, it may be that some of them might possess something (as treatment),\" They went to the group of \nthe companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a \nscorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" \nOne of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as \nyour guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees \nto pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are \nfor the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a \nchain, and got up and started walking, showing no signs of sickness. \nThey paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide \ntheir earnings among themselves, but the one who performed the recitation said, \"Do not divide them \ntill we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to \nAllah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- \nFatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you \nhave earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon.","reference":"Sahih al-Bukhari 2276, Book 37, Hadith 16","grade":"","question #":"question #2","question":"How does the concept of hospitality and compensation appear in the interactions between the companions and the Arab tribe?","id":"bukhari-37-43"},{"hadith-eng":"When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of \nfoodstuff and he interceded with his masters to reduce his taxes.","reference":"Sahih al-Bukhari 2277, Book 37, Hadith 17","grade":"","question #":"question #2","question":"How does Islam view the act of interceding on behalf of others to ease their burdens?","id":"bukhari-37-44"},{"hadith-eng":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.","reference":"Sahih al-Bukhari 2278, Book 37, Hadith 18","grade":"","question #":"question #2","question":"How does this narration illustrate the Prophet's approach to fair treatment in business transactions?","id":"bukhari-37-45"},{"hadith-eng":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable \nhe would not have paid him.","reference":"Sahih al-Bukhari 2279, Book 37, Hadith 19","grade":"","question #":"question #2","question":"How does the Prophet's action of paying for services reflect on the importance of fair compensation in Islam?","id":"bukhari-37-46"},{"hadith-eng":"The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .","reference":"Sahih al-Bukhari 2280, Book 37, Hadith 20","grade":"","question #":"question #2","question":"How does this narration reflect the Prophet's attitude towards fair treatment of laborers?","id":"bukhari-37-47"},{"hadith-eng":"The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) \nordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters \nto reduce his taxes:","reference":"Sahih al-Bukhari 2281, Book 37, Hadith 21","grade":"","question #":"question #2","question":"How does this narration reflect the Prophet's (ﷺ) concern for the welfare of slaves and their treatment?","id":"bukhari-37-48"},{"hadith-eng":"Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken \nby a soothsayer.","reference":"Sahih al-Bukhari 2282, Book 37, Hadith 22","grade":"","question #":"question #2","question":"Why is the price of a dog considered illegal in Islamic teachings?","id":"bukhari-37-49"},{"hadith-eng":"The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).","reference":"Sahih al-Bukhari 2283, Book 37, Hadith 23","grade":"","question #":"question #2","question":"How does Islam view the exploitation of individuals for financial gain?","id":"bukhari-37-50"},{"hadith-eng":"The Prophet (ﷺ) forbade taking a price for animal copulation.","reference":"Sahih al-Bukhari 2284, Book 37, Hadith 24","grade":"","question #":"question #2","question":"Why might certain transactions be prohibited in Islamic teachings?","id":"bukhari-37-51"},{"hadith-eng":"\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).","reference":"Sahih al-Bukhari 2285, 2286, Book 37, Hadith 25","grade":"","question #":"question #2","question":"What was the stance of the Prophet Muhammad (ﷺ) on renting farms according to the narration?","id":"bukhari-37-52"},{"hadith-eng":"\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).","reference":"Sahih al-Bukhari 2285, 2286, Book 37, Hadith 25","grade":"","question #":"question #2","question":"What was the stance of the Prophet Muhammad (ﷺ) on renting farms?","id":"bukhari-37-53"},{"hadith-eng":"The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the \ntwo charitable persons, (the second being the owner).","reference":"Sahih al-Bukhari 2260, Book 37, Hadith 1","grade":"","question #":"question #3","question":"Who are considered the two charitable persons in the context of managing wealth?","id":"bukhari-37-54"},{"hadith-eng":"I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they \nwant employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it \nearnestly.\"","reference":"Sahih al-Bukhari 2261, Book 37, Hadith 2","grade":"","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) approach the selection of individuals for employment or positions of responsibility?","id":"bukhari-37-55"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \n\"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of \nMecca for some Qirats.\"","reference":"Sahih al-Bukhari 2262, Book 37, Hadith 3","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet Muhammad's (ﷺ) experience as a shepherd in Mecca?","id":"bukhari-37-56"},{"hadith-eng":"The Prophet (ﷺ) and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of \nBani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to \nabide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) \nand Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to \nthe Cave of Thaur after three days. So, he brought them their two riding camels after three days and \nboth of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili \nguide who guided them below Mecca along the road leading to the sea-shore.","reference":"Sahih al-Bukhari 2263, Book 37, Hadith 4","grade":"","question #":"question #3","question":"What role did the guide play in the journey of the Prophet (ﷺ) and Abu Bakr from Mecca?","id":"bukhari-37-57"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as \nan expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and \nAbu Bakr gave him their two riding camels and took a promise from him to bring their riding camels \nin the morning of the third day to the Cave of Thaur.","reference":"Sahih al-Bukhari 2264, Book 37, Hadith 5","grade":"","question #":"question #3","question":"What significance does the Cave of Thaur hold in the context of the Prophet's migration?","id":"bukhari-37-58"},{"hadith-eng":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).","reference":"Sahih al-Bukhari 2265, 2266, Book 37, Hadith 6","grade":"","question #":"question #3","question":"What can be learned about the Prophet Muhammad's (ﷺ) approach to resolving conflicts from this incident?","id":"bukhari-37-59"},{"hadith-eng":"I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).","reference":"Sahih al-Bukhari 2265, 2266, Book 37, Hadith 6","grade":"","question #":"question #3","question":"What does the Prophet's response to the complaint reveal about expectations of fairness and justice in Islam?","id":"bukhari-37-60"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall \nwhich was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the \nwall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or \nSa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if \nyou had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to \nbuy food . \"","reference":"Sahih al-Bukhari 2267, Book 37, Hadith 7","grade":"","question #":"question #3","question":"What lessons can be learned from the actions of Al-Khadir in the context of helping others without seeking compensation?","id":"bukhari-37-61"},{"hadith-eng":"The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and \nChristians) is like the example of a man who employed some laborers and asked them, 'Who will \nwork for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He \nthen asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians \naccepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two \nQirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why \nshould we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They \nreplied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'","reference":"Sahih al-Bukhari 2268, Book 37, Hadith 8","grade":"","question #":"question #3","question":"What lessons can be drawn about fairness and divine justice from the laborers' reactions in the parable?","id":"bukhari-37-62"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a \nman who employed some laborers to whom he said, 'Who will work for me up to midday for one \nQirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the \nwork up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr \nprayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more \nand are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They \nreplied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"","reference":"Sahih al-Bukhari 2269, Book 37, Hadith 9","grade":"","question #":"question #3","question":"What lesson can be drawn about the nature of Allah's blessings and His discretion in bestowing them?","id":"bukhari-37-63"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of \nResurrection: \n-1. One who makes a covenant in My Name, but proves treacherous; \n-2. One who sells a free person and eats his price; and \n-3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"","reference":"Sahih al-Bukhari 2270, Book 37, Hadith 10","grade":"","question #":"question #3","question":"What is the Islamic perspective on the rights of laborers and the importance of paying them for their work?","id":"bukhari-37-64"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night for specific wages. They worked till \nmidday and then said, 'We do not need your money which you have fixed for us and let whatever we \nhave done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and \ntake your full wages.' But they refused and went away. The man employed another batch after them \nand said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first \nbatch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be \nannulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the \nrest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another \nbatch to work for the rest of the day and they worked for the rest of the day till the sunset, and they \nreceived the wages of the two former batches. So, that was the example of those people (Muslims) and \nthe example of this light (guidance) which they have accepted willingly.","reference":"Sahih al-Bukhari 2271, Book 37, Hadith 11","grade":"","question #":"question #3","question":"What lessons can be drawn about the acceptance of guidance and its impact on receiving rewards in Islam?","id":"bukhari-37-65"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together \ntill they reached a cave at night and entered it. A big rock rolled down the mountain and closed the \nmouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke \nAllah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one \nof them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with \nmilk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I \nmilked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide \nmy family with the milk before them. I waited for them and the bowl of milk was in my hand and I \nkept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! \nIf I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, \nthe rock shifted a little but they could not get out.\" \nThe Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people \nto me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a \nfamine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that \nshe would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is \nillegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have \nsexual intercourse with her and left her though she was the dearest of all the people to me, and also I \nleft the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the \npresent calamity.' So, the rock shifted a little more but still they could not get out from there.\" \nThe Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their \nwages with the exception of one man who did not take his wages and went away. I invested his wages \nand I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay \nme my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O \nAllah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove \nthem away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the \npresent suffering.' So, that rock shifted completely and they got out walking.","reference":"Sahih al-Bukhari 2272, Book 37, Hadith 12","grade":"","question #":"question #3","question":"How does Islam view the importance of fulfilling promises and obligations towards others?","id":"bukhari-37-66"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as \nporters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand \nDirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying \n(some of us) .","reference":"Sahih al-Bukhari 2273, Book 37, Hadith 13","grade":"","question #":"question #3","question":"How did the financial status of some companions change over time according to the narration?","id":"bukhari-37-67"},{"hadith-eng":"Ibn `Abbas said, \"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no \ntownsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the \nmeaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \n\"He should not work as a broker for him.\"","reference":"Sahih al-Bukhari 2274, Book 37, Hadith 14","grade":"","question #":"question #3","question":"How does the prohibition of certain brokerage practices reflect on fairness in trade according to Islamic teachings?","id":"bukhari-37-68"},{"hadith-eng":"I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my \nwork, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in \nMuhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I \nbe dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and \noffspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who \ndisbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)","reference":"Sahih al-Bukhari 2275, Book 37, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of patience and steadfastness in the face of financial injustice according to Islamic teachings?","id":"bukhari-37-69"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at \nnight). They asked the latter to treat them as their guests but they refused. The chief of that tribe was \nthen bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some \nof them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at \nnight, it may be that some of them might possess something (as treatment),\" They went to the group of \nthe companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a \nscorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" \nOne of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as \nyour guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees \nto pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are \nfor the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a \nchain, and got up and started walking, showing no signs of sickness. \nThey paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide \ntheir earnings among themselves, but the one who performed the recitation said, \"Do not divide them \ntill we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to \nAllah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- \nFatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you \nhave earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon.","reference":"Sahih al-Bukhari 2276, Book 37, Hadith 16","grade":"","question #":"question #3","question":"What role does seeking the Prophet's approval play in the actions of the companions regarding their earnings from Ruqya?","id":"bukhari-37-70"},{"hadith-eng":"When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of \nfoodstuff and he interceded with his masters to reduce his taxes.","reference":"Sahih al-Bukhari 2277, Book 37, Hadith 17","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to fair treatment and justice from this incident?","id":"bukhari-37-71"},{"hadith-eng":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.","reference":"Sahih al-Bukhari 2278, Book 37, Hadith 18","grade":"","question #":"question #3","question":"What can be learned about the ethical conduct of the Prophet in terms of fulfilling financial obligations?","id":"bukhari-37-72"},{"hadith-eng":"When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable \nhe would not have paid him.","reference":"Sahih al-Bukhari 2279, Book 37, Hadith 19","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's stance on cupping from his decision to pay the practitioner?","id":"bukhari-37-73"},{"hadith-eng":"The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .","reference":"Sahih al-Bukhari 2280, Book 37, Hadith 20","grade":"","question #":"question #3","question":"What can be learned about the importance of paying wages promptly from this narration?","id":"bukhari-37-74"},{"hadith-eng":"The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) \nordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters \nto reduce his taxes:","reference":"Sahih al-Bukhari 2281, Book 37, Hadith 21","grade":"","question #":"question #3","question":"What can be inferred about the economic practices during the Prophet's (ﷺ) time from this narration?","id":"bukhari-37-75"},{"hadith-eng":"Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken \nby a soothsayer.","reference":"Sahih al-Bukhari 2282, Book 37, Hadith 22","grade":"","question #":"question #3","question":"What is the Islamic stance on the earnings of a soothsayer?","id":"bukhari-37-76"},{"hadith-eng":"The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).","reference":"Sahih al-Bukhari 2283, Book 37, Hadith 23","grade":"","question #":"question #3","question":"What are the ethical considerations in Islam regarding the treatment of slave girls?","id":"bukhari-37-77"},{"hadith-eng":"The Prophet (ﷺ) forbade taking a price for animal copulation.","reference":"Sahih al-Bukhari 2284, Book 37, Hadith 24","grade":"","question #":"question #3","question":"How does Islamic law address ethical considerations in business dealings?","id":"bukhari-37-78"},{"hadith-eng":"\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).","reference":"Sahih al-Bukhari 2285, 2286, Book 37, Hadith 25","grade":"","question #":"question #3","question":"How did the policy regarding the land of Khaibar change during the time of Umar?","id":"bukhari-37-79"},{"hadith-eng":"\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).","reference":"Sahih al-Bukhari 2285, 2286, Book 37, Hadith 25","grade":"","question #":"question #3","question":"How did the policy regarding the Jews in Khaibar change during the caliphate of Umar?","id":"bukhari-37-80"}]