[{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not \naccepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is \n'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"","reference":"Sahih al-Bukhari 135, Book 4, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of performing ablution before prayer in Islam?","id":"bukhari-4-1"},{"hadith-eng":"Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I \nheard the Prophet (ﷺ) saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- \nMuhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so \n(i.e. by performing ablution regularly).' \"","reference":"Sahih al-Bukhari 136, Book 4, Hadith 2","grade":"","question #":"question #1","question":"What significance does ablution hold for Muslims on the Day of Resurrection?","id":"bukhari-4-2"},{"hadith-eng":"My uncle asked Allah's Messenger (ﷺ) about a person who imagined to have passed wind during the prayer. \nAllah' Apostle replied: \"He should not leave his prayers unless he hears sound or smells something.\"","reference":"Sahih al-Bukhari 137, Book 4, Hadith 3","grade":"","question #":"question #1","question":"What should a person do if they are uncertain about breaking their wudu during prayer?","id":"bukhari-4-3"},{"hadith-eng":"Ibn `Abbas said, \"The Prophet (ﷺ) slept till he snored and then prayed (or probably lay till his breath \nsounds were heard and then got up and prayed).\" Ibn `Abbas added: \"I stayed overnight in the house \nof my aunt, Maimuna, the Prophet (ﷺ) slept for a part of the night, (See Fath-al-Bari page 249, Vol. 1), \nand late in the night, he got up and performed ablution from a hanging water skin, a light (perfect) \nablution and stood up for the prayer. I, too, performed a similar ablution, then I went and stood on his \nleft. He drew me to his right and prayed as much as Allah wished, and again lay and slept till his \nbreath sounds were heard. Later on the Mu'adh-dhin (call maker for the prayer) came to him and \ninformed him that it was time for Prayer. The Prophet (ﷺ) went with him for the prayer without \nperforming a new ablution.\" (Sufyan said to `Amr that some people said, \"The eyes of Allah's Messenger (ﷺ) \nsleep but his heart does not sleep.\" `Amr replied, \"I heard `Ubaid bin `Umar saying that the dreams of \nProphets were Divine Inspiration, and then he recited the verse: 'I (Abraham) see in a dream, (O my \nson) that I offer you in sacrifice (to Allah).\" (37.102) (See Hadith No. 183)","reference":"Sahih al-Bukhari 138, Book 4, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of performing ablution before prayer in Islam?","id":"bukhari-4-4"},{"hadith-eng":"Allah's Messenger (ﷺ) proceeded from `Arafat till when he reached the mountain pass, he dismounted, \nurinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the \nprayer, O Allah's Messenger (ﷺ)?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he \nreached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama \nwas pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its \nplace. Then the Iqama was pronounced for the `Isha' prayer which the Prophet (ﷺ) led and no prayer was \noffered in between the two . prayers (`Isha' and Maghrib).","reference":"Sahih al-Bukhari 139, Book 4, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of performing ablution before prayer in Islam?","id":"bukhari-4-5"},{"hadith-eng":"Ibn `Abbas performed ablution and washed his face (in the following way): He ladled out a handful of \nwater, rinsed his mouth and washed his nose with it by putting in water and then blowing it out. He \nthen, took another handful (of water) and did like this (gesturing) joining both hands, and washed his \nface, took another handful of water and washed his right forearm. He again took another handful of \nwater and washed his left forearm, and passed wet hands over his head and took another handful of \nwater and poured it over his right foot (up to his ankles) and washed it thoroughly and similarly took \nanother handful of water and washed thoroughly his left foot (up to the ankles) and said, \"I saw \nAllah's Messenger (ﷺ) performing ablution in this way.\"","reference":"Sahih al-Bukhari 140, Book 4, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of following the Prophet's method in performing ablution?","id":"bukhari-4-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you on having sexual relations with his wife said (and he must say it \nbefore starting) 'In the name of Allah. O Allah! Protect us from Satan and also protect what you \nbestow upon us (i.e. the coming offspring) from Satan, and if it is destined that they should have a \nchild then, Satan will never be able to harm that offspring.\"","reference":"Sahih al-Bukhari 141, Book 4, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of invoking Allah's name before engaging in marital relations?","id":"bukhari-4-7"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu \nbika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked \nthings (evil deeds and evil spirits).","reference":"Sahih al-Bukhari 142, Book 4, Hadith 8","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) recite before entering the restroom?","id":"bukhari-4-8"},{"hadith-eng":"Once the Prophet (ﷺ) entered a lavatory and I placed water for his ablution. He asked, \"Who placed it?\" \nHe was informed accordingly and so he said, \"O Allah! Make him (Ibn `Abbas) a learned scholar in \nreligion (Islam).","reference":"Sahih al-Bukhari 143, Book 4, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of making supplications for others in Islam?","id":"bukhari-4-9"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you goes to an open space for answering the call of nature he \nshould neither face nor turn his back towards the Qibla; he should either face the east or the west.\"","reference":"Sahih al-Bukhari 144, Book 4, Hadith 10","grade":"","question #":"question #1","question":"What are the guidelines for positioning oneself when answering the call of nature in Islam?","id":"bukhari-4-10"},{"hadith-eng":"People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or \nBaitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's \nApostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but \nthere was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).","reference":"Sahih al-Bukhari 145, Book 4, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of facing or not facing certain directions while answering the call of nature in Islamic teachings?","id":"bukhari-4-11"},{"hadith-eng":"The wives of the Prophet (ﷺ) used to go to Al-Manasi, a vast open place (near Baqi` at Medina) to answer \nthe call of nature at night. `Umar used to say to the Prophet (ﷺ) \"Let your wives be veiled,\" but Allah's \nApostle did not do so. One night Sauda bint Zam`a the wife of the Prophet (ﷺ) went out at `Isha' time and \nshe was a tall lady. `Umar addressed her and said, \"I have recognized you, O Sauda.\" He said so, as he \ndesired eagerly that the verses of Al-Hijab (the observing of veils by the Muslim women) may be \nrevealed. So Allah revealed the verses of \"Al-Hijab\" (A complete body cover excluding the eyes).","reference":"Sahih al-Bukhari 146, Book 4, Hadith 12","grade":"","question #":"question #1","question":"What was Umar's concern regarding the wives of the Prophet and how did it influence the revelation of the verses of Al-Hijab?","id":"bukhari-4-12"},{"hadith-eng":"The Prophet (ﷺ) said to his wives, \"You are allowed to go out to answer the call of nature. \"","reference":"Sahih al-Bukhari 147, Book 4, Hadith 13","grade":"","question #":"question #1","question":"What guidance did the Prophet provide to his wives regarding answering the call of nature?","id":"bukhari-4-13"},{"hadith-eng":"I went up to the roof of Hafsa's house for some job and I saw Allah's Messenger (ﷺ) answering the call of \nnature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back \ntowards the Qibla. (See Hadith No. 147).","reference":"Sahih al-Bukhari 148, Book 4, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of the direction faced during answering the call of nature in Islamic teachings?","id":"bukhari-4-14"},{"hadith-eng":"Once I went up the roof of our house and saw Allah's Messenger (ﷺ) answering the call of nature while \nsitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).","reference":"Sahih al-Bukhari 149, Book 4, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of the direction faced during answering the call of nature in Islamic tradition?","id":"bukhari-4-15"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to \naccompany him with a tumbler full of water. (Hisham commented, \"So that he might wash his private \nparts with it.)\"","reference":"Sahih al-Bukhari 150, Book 4, Hadith 16","grade":"","question #":"question #1","question":"What practices did the Prophet Muhammad (ﷺ) follow for personal hygiene after answering the call of nature?","id":"bukhari-4-16"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy from us used to \ngo behind him with a tumbler full of water.","reference":"Sahih al-Bukhari 151, Book 4, Hadith 17","grade":"","question #":"question #1","question":"What practices were followed by the companions of the Prophet when he went to answer the call of nature?","id":"bukhari-4-17"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to carry a \ntumbler full of water (for cleaning the private parts) and a short spear (or stick).","reference":"Sahih al-Bukhari 152, Book 4, Hadith 18","grade":"","question #":"question #1","question":"What practices did the Prophet Muhammad (ﷺ) follow for personal hygiene after answering the call of nature?","id":"bukhari-4-18"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whenever anyone of you drinks water, he should not breathe in the drinking \nutensil, and whenever anyone of you goes to a lavatory, he should neither touch his penis nor clean his \nprivate parts with his right hand.\"","reference":"Sahih al-Bukhari 153, Book 4, Hadith 19","grade":"","question #":"question #1","question":"What are the etiquettes of drinking water in Islam?","id":"bukhari-4-19"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whenever anyone of you makes water he should not hold his penis or clean his \nprivate parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"","reference":"Sahih al-Bukhari 154, Book 4, Hadith 20","grade":"","question #":"question #1","question":"What are the etiquettes prescribed for personal hygiene in Islam?","id":"bukhari-4-20"},{"hadith-eng":"I followed the Prophet (ﷺ) while he was going out to answer the call of nature. He used not to look this \nway or that. So, when I approached near him he said to me, \"Fetch for me some stones for ' cleaning \nthe privates parts (or said something similar), and do not bring a bone or a piece of dung.\" So I \nbrought the stones in the corner of my garment and placed them by his side and I then went away from \nhim. When he finished (from answering the call of nature) he used, them .","reference":"Sahih al-Bukhari 155, Book 4, Hadith 21","grade":"","question #":"question #1","question":"What materials are recommended for cleaning oneself after answering the call of nature in Islamic teachings?","id":"bukhari-4-21"},{"hadith-eng":"The Prophet (ﷺ) went out to answer the call of nature and asked me to bring three stones. I found two \nstones and searched for the third but could not find it. So took a dried piece of dung and brought it to \nhim. He took the two stones and threw away the dung and said, \"This is a filthy thing.\"","reference":"Sahih al-Bukhari 156, Book 4, Hadith 22","grade":"","question #":"question #1","question":"What materials are considered appropriate for cleaning oneself after answering the call of nature in Islamic teachings?","id":"bukhari-4-22"},{"hadith-eng":"The Prophet (ﷺ) performed ablution by washing the body parts only once.","reference":"Sahih al-Bukhari 157, Book 4, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of performing ablution by washing each body part only once in Islamic practice?","id":"bukhari-4-23"},{"hadith-eng":"The Prophet (ﷺ) performed ablution by washing the body parts twice.","reference":"Sahih al-Bukhari 158, Book 4, Hadith 24","grade":"","question #":"question #1","question":"How many times did the Prophet wash each body part during ablution?","id":"bukhari-4-24"},{"hadith-eng":"(the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler \r\n     of water (and when it was brought) he poured water over his hands and \r\n     washed them thrice and then put his right hand in the water container \r\n     and rinsed his mouth, washed his nose by putting water in it and then \r\n     blowing it out. then he washed his face and forearms up to the \r\n     elbows thrice, passed his wet hands over his head and washed his feet \r\n     up to the ankles thrice. Then he said, \"Allah's Messenger (ﷺ) said 'If \r\n     anyone performs ablution like that of mine and offers a two-rak'at \r\n     prayer during which he does not think of anything else (not related to\r\n     the present prayer) then his past sins will be forgiven.' \"","reference":"Sahih al-Bukhari 159, Book 4, Hadith 25","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by 'Uthman bin 'Affan?","id":"bukhari-4-25"},{"hadith-eng":"This verse is: \"Verily, those\n     who conceal the clear signs and the guidance which we have sent \n     down...)\" (2:159). I heard the Prophet (ﷺ) saying, 'If a man performs \n     ablution perfectly and then offers the compulsory congregational \n     prayer, Allah will forgive his sins committed between that (prayer) \n     and the (next) prayer till he offers it.","reference":"Sahih al-Bukhari 160, Book 4, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of performing ablution perfectly before prayer in Islam?","id":"bukhari-4-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever performs ablution should clean his nose with water by putting the water \nin it and then blowing it out, and whoever cleans his private parts with stones should do it with odd \nnumber of stones.\"","reference":"Sahih al-Bukhari 161, Book 4, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of using an odd number of stones for cleaning oneself in Islamic practice?","id":"bukhari-4-27"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you performs ablution he should put water in his nose and then \nblow it out and whoever cleans his private parts with stones should do so with odd numbers. And \nwhoever wakes up from his sleep should wash his hands before putting them in the water for ablution, \nbecause nobody knows where his hands were during sleep.\"","reference":"Sahih al-Bukhari 162, Book 4, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of using odd numbers when cleaning oneself with stones in Islamic practice?","id":"bukhari-4-28"},{"hadith-eng":"The Prophet (ﷺ) remained behind us on a journey. He joined us while we were performing ablution for the \n`Asr prayer which was overdue and we were just passing wet hands over our feet (not washing them \nthoroughly) so he addressed us in a loud voice saying twice , \"Save your heels from the fire.\"","reference":"Sahih al-Bukhari 163, Book 4, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of properly performing ablution in Islam?","id":"bukhari-4-29"},{"hadith-eng":"(the freed slave of `Uthman bin `Affan) I saw `Uthman bin `Affan asking (for a tumbler of water) to \nperform ablution (and when it was brought) he poured water from it over his hands and washed them \nthrice and then put his right hand in the water container and rinsed his mouth and washed his nose by \nputting water in it and then blowing it out. Then he washed his face thrice and (then) forearms up to \nthe elbows thrice, then passed his wet hands over his head and then washed each foot thrice. After that \n`Uthman said, \"I saw the Prophet (ﷺ) performing ablution like this of mine, and he said, 'If anyone \nperforms ablution like that of mine and offers a two-rak`at prayer during which he does not think of \nanything else (not related to the present prayer) then his past sins will be forgiven. '","reference":"Sahih al-Bukhari 164, Book 4, Hadith 30","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by Uthman bin Affan?","id":"bukhari-4-30"},{"hadith-eng":"I heard Abu Huraira saying as he passed by us while the people were performing ablution from a \nutensil containing water, \"Perform ablution perfectly and thoroughly for Abul-Qasim (the Prophet) \nsaid, 'Save your heels from the Hell-fire.' \"","reference":"Sahih al-Bukhari 165, Book 4, Hadith 31","grade":"","question #":"question #1","question":"What is the significance of performing ablution thoroughly in Islam?","id":"bukhari-4-31"},{"hadith-eng":"I asked `Abdullah bin `Umar, \"O Abu `Abdur-Rahman! I saw you doing four things which I never \nsaw being done by anyone of you companions?\" `Abdullah bin `Umar said, \"What are those, O Ibn \nJuraij?\" I said, \"I never saw you touching any corner of the Ka`ba except these (two) facing south \n(Yemen) and I saw you wearing shoes made of tanned leather and dyeing your hair with Hinna (a kind \nof red dye). I also noticed that whenever you were in Mecca, the people assume Ihram on seeing the \nnew moon crescent (1st of Dhul-Hijja) while you did not assume the Ihlal (Ihram) -(Ihram is also \ncalled Ihlal which means 'Loud calling' because a Muhrim has to recite Talbiya aloud when assuming \nthe state of Ihram) - till the 8th of Dhul-Hijja (Day of Tarwiya). `Abdullah replied, \"Regarding the \ncorners of Ka`ba, I never saw Allah's Messenger (ﷺ) touching except those facing south (Yemen) and \nregarding the tanned leather shoes, no doubt I saw Allah's Messenger (ﷺ) wearing non-hairy shoes and he \nused to perform ablution while wearing the shoes (i.e. wash his feet and then put on the shoes). So I \nlove to wear similar shoes. And about the dyeing of hair with Hinna; no doubt I saw Allah's Messenger (ﷺ) \ndyeing his hair with it and that is why I like to dye (my hair with it). Regarding Ihlal, I did not see \nAllah's Messenger (ﷺ) assuming Ihlal till he set out for Hajj (on the 8th of Dhul-Hijja).","reference":"Sahih al-Bukhari 166, Book 4, Hadith 32","grade":"","question #":"question #1","question":"What are the specific practices related to the Ka'ba that were observed by Abdullah bin Umar and why?","id":"bukhari-4-32"},{"hadith-eng":"That the Prophet (ﷺ) at the time of washing his deceased daughter had said to them, \"Start from the right \nside beginning with those parts which are washed in ablution.\"","reference":"Sahih al-Bukhari 167, Book 4, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of starting from the right side when performing the washing of a deceased body in Islamic rituals?","id":"bukhari-4-33"},{"hadith-eng":"The Prophet (ﷺ) used to like to start from the right side on wearing shoes, combing his hair and cleaning \nor washing himself and on doing anything else.","reference":"Sahih al-Bukhari 168, Book 4, Hadith 34","grade":"","question #":"question #1","question":"What is the significance of starting actions from the right side in Islamic tradition?","id":"bukhari-4-34"},{"hadith-eng":"saw Allah's Messenger (ﷺ) when the `Asr prayer was due and the people searched for water to perform \nablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's \nApostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the \nwater springing out from underneath his fingers till all of them performed the ablution (it was one of \nthe miracles of the Prophet).","reference":"Sahih al-Bukhari 169, Book 4, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of miracles in the life of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-35"},{"hadith-eng":"I said to `Abida, \"I have some of the hair of the Prophet (ﷺ) which I got from Anas or from his family.\" \n`Abida replied. \"No doubt if I had a single hair of that it would have been dearer to me than the whole \nworld and whatever is in it.\"","reference":"Sahih al-Bukhari 170, Book 4, Hadith 36","grade":"","question #":"question #1","question":"What significance do personal relics of the Prophet Muhammad (ﷺ) hold for his followers?","id":"bukhari-4-36"},{"hadith-eng":"When Allah's Messenger (ﷺ) got his head shaved, Abu- Talha was the first to take some of his hair.","reference":"Sahih al-Bukhari 171, Book 4, Hadith 37","grade":"","question #":"question #1","question":"What significance does the hair of the Prophet Muhammad (ﷺ) hold in Islamic tradition?","id":"bukhari-4-37"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a dog drinks from the utensil of anyone of you it is essential to wash it seven \ntimes.\"","reference":"Sahih al-Bukhari 172, Book 4, Hadith 38","grade":"","question #":"question #1","question":"What is the prescribed method for purifying a utensil that a dog has drunk from?","id":"bukhari-4-38"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man saw a dog eating mud from (the severity of) \n     thirst. So, that man took a shoe (and filled it) with water and kept \n     on pouring the water for the dog till it quenched its thirst. So Allah\n     approved of his deed and made him to enter Paradise.\"","reference":"Sahih al-Bukhari 173, Book 4, Hadith 39","grade":"","question #":"question #1","question":"What is the significance of showing kindness to animals in Islam?","id":"bukhari-4-39"},{"hadith-eng":"My father said. \"During the lifetime of Allah's \n     Apostle, the dogs used to urinate, and pass through the mosques (come \n     and go), nevertheless they never used to sprinkle water on it (urine \n     of the dog.)\"","reference":"Sahih al-Bukhari 174, Book 4, Hadith 40","grade":"","question #":"question #1","question":"What was the practice regarding the presence of dogs in mosques during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-40"},{"hadith-eng":"I asked the Prophet (about the hunting dogs) and he replied, \"If you let loose (with Allah's name) your \ntamed dog after a game and it hunts it, you may eat it, but if the dog eats of (that game) then do not eat \nit because the dog has hunted it for itself.\" I further said, \"Sometimes I send my dog for hunting and \nfind another dog with it. He said, \"Do not eat the game for you have mentioned Allah's name only on \nsending your dog and not the other dog.\"","reference":"Sahih al-Bukhari 175, Book 4, Hadith 41","grade":"","question #":"question #1","question":"What are the conditions for consuming game hunted by trained dogs in Islamic law?","id":"bukhari-4-41"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A person is considered in prayer as long as he is waiting for the prayer in the \nmosque as long as he does not do Hadath.\" A non-Arab man asked, \"O Abu Huraira! What is \nHadath?\" I replied, \"It is the passing of wind (from the anus) (that is one of the types of Hadath).","reference":"Sahih al-Bukhari 176, Book 4, Hadith 42","grade":"","question #":"question #1","question":"What is the significance of waiting in the mosque for prayer in Islam?","id":"bukhari-4-42"},{"hadith-eng":"My uncle said: The Prophet (ﷺ) said, \"One should not leave his prayer unless he hears sound or smells \nsomething.\"","reference":"Sahih al-Bukhari 177, Book 4, Hadith 43","grade":"","question #":"question #1","question":"What are the conditions under which a person should leave their prayer according to Islamic teachings?","id":"bukhari-4-43"},{"hadith-eng":"I used to get emotional urethral discharges frequently and felt shy to ask Allah's Messenger (ﷺ) about it. So I \nrequested Al-Miqdad bin Al-Aswad to ask (the Prophet (ﷺ) ) about it. Al-Miqdad asked him and he \nreplied, \"One has to perform ablution (after it).\"","reference":"Sahih al-Bukhari 178, Book 4, Hadith 44","grade":"","question #":"question #1","question":"What is the ruling on performing ablution after experiencing emotional urethral discharges?","id":"bukhari-4-44"},{"hadith-eng":"I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman \nreplied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" \n`Uthman added, \"I heard it from Allah's Messenger (ﷺ).\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b \nabout it and they, too, gave the same reply. (This order was canceled later on and taking a bath \nbecame necessary for such cases).","reference":"Sahih al-Bukhari 179, Book 4, Hadith 45","grade":"","question #":"question #1","question":"What was the initial ruling regarding purification after engaging in intercourse without discharge?","id":"bukhari-4-45"},{"hadith-eng":"Allah's Messenger (ﷺ) sent for a Ansari man who came with water dropping from his head. The Prophet (ﷺ) said, \n\"Perhaps we have forced you to hurry up, haven't we?\" The Ansari replied, \"Yes.\" Allah's Messenger (ﷺ) \nfurther said, \"If you are forced to hurry up (during intercourse) or you do not discharge then ablution \nis due on you (This order was canceled later on, i.e. one has to take a bath).","reference":"Sahih al-Bukhari 180, Book 4, Hadith 46","grade":"","question #":"question #1","question":"What was the initial ruling regarding ablution after being hurried during intercourse?","id":"bukhari-4-46"},{"hadith-eng":"\"When Allah's Messenger (ﷺ) departed from `Arafat, he turned towards a mountain pass where he answered \nthe call of nature. (After he had finished) I poured water and he performed ablution and then I said to \nhim, \"O Allah's Messenger (ﷺ)! Will you offer the prayer?\" He replied, \"The Musalla (place of the prayer) is \nahead of you (in Al-Muzdalifa).","reference":"Sahih al-Bukhari 181, Book 4, Hadith 47","grade":"","question #":"question #1","question":"What is the significance of performing ablution after answering the call of nature in Islam?","id":"bukhari-4-47"},{"hadith-eng":"I was in the company of Allah's Messenger (ﷺ) on one of the journeys and he went out to answer the call of \nnature (and after he finished) I poured water and he performed ablution; he washed his face, forearms \nand passed his wet hand over his head and over the two Khuff (socks made from thick fabric or \nleather).","reference":"Sahih al-Bukhari 182, Book 4, Hadith 48","grade":"","question #":"question #1","question":"What is the procedure for performing ablution while traveling according to Islamic teachings?","id":"bukhari-4-48"},{"hadith-eng":"That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay \non the bed (cushion transversally) while Allah's Messenger (ﷺ) and his wife lay in the lengthwise direction of \nthe cushion. Allah's Messenger (ﷺ) slept till the middle of the night, either a bit before or a bit after it and \nthen woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten \nverses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution \nfrom it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the \nProphet had done. Then I went and stood by his side. He placed his right hand on my head and caught \nmy right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at \nand then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he \nlay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet (ﷺ) got up, offered a \ntwo light rak`at prayer and went out and led the Fajr prayer.","reference":"Sahih al-Bukhari 183, Book 4, Hadith 49","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) perform upon waking up in the middle of the night?","id":"bukhari-4-49"},{"hadith-eng":"I came to `Aisha the wife of the Prophet (ﷺ) during the solar eclipse. The people were standing and \noffering the prayer and she was also praying. I asked her, \"What is wrong with the people?\" She \nbeckoned with her hand towards the sky and said, \"Subhan Allah.\" I asked her, \"Is there a sign?\" She \npointed out, \"Yes.\" So I, too, stood for the prayer till I fell unconscious and later on I poured water on \nmy head. After the prayer, Allah's Messenger (ﷺ) praised and glorified Allah and said, \"Just now I have seen \nsomething which I never saw before at this place of mine, including Paradise and Hell. I have been \ninspired (and have understood) that you will be put to trials in your graves and these trials will be like \nthe trials of Ad-Dajjal, or nearly like it (the sub narrator is not sure of what Asma' said). Angels will \ncome to every one of you and ask, 'What do you know about this man?' A believer will reply, 'He is \nMuhammad, Allah's Messenger (ﷺ) , and he came to us with self-evident truth and guidance. So we accepted \nhis teaching, believed and followed him.' Then the angels will say to him to sleep in peace as they \nhave come to know that he was a believer. On the other hand a hypocrite or a doubtful person will \nreply, 'I do not know but heard the people saying something and so I said the same.' \"","reference":"Sahih al-Bukhari 184, Book 4, Hadith 50","grade":"","question #":"question #1","question":"What is the significance of the solar eclipse in Islamic tradition and how did the Prophet (ﷺ) respond to it?","id":"bukhari-4-50"},{"hadith-eng":"A person asked `Abdullah bin Zaid who was the grandfather of `Amr bin Yahya, \"Can you show me \nhow Allah's Messenger (ﷺ) used to perform ablution?\" `Abdullah bin Zaid replied in the affirmative and \nasked for water. He poured it on his hands and washed them twice, then he rinsed his mouth thrice and \nwashed his nose with water thrice by putting water in it and blowing it out. He washed his face thrice \nand after that he washed his forearms up to the elbows twice and then passed his wet hands over his \nhead from its front to its back and vice versa (beginning from the front and taking them to the back of \nhis head up to the nape of the neck and then brought them to the front again from where he had \nstarted) and washed his feet (up to the ankles).","reference":"Sahih al-Bukhari 185, Book 4, Hadith 51","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet Muhammad (ﷺ)?","id":"bukhari-4-51"},{"hadith-eng":"My father saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. \n`Abdullah bin Zaid asked for earthenware pot containing water and in front of them performed \nablution like that of the Prophet (ﷺ) . He poured water from the pot over his hand and washed his hands \nthrice and then he put his hands in the pot and rinsed his mouth and washed his nose by putting water \nin it and then blowing it out with three handfuls of water. Again he put his hand in the water and \nwashed his face thrice and washed his forearms up to the elbows twice; and then put his hands in the \nwater and then passed them over his head by bringing them to the front and then to the rear of the \nhead once, and then he washed his feet up to the ankles.","reference":"Sahih al-Bukhari 186, Book 4, Hadith 52","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet?","id":"bukhari-4-52"},{"hadith-eng":"Allah's Messenger (ﷺ) came to us at noon and water for ablution was brought to him. After he had performed \nablution, the remaining water was taken by the people and they started smearing their bodies with it \n(as a blessed thing). The Prophet (ﷺ) offered two rak`at of the Zuhr prayer and then two rak`at of the `Asr \nprayer while a short spear (or stick) was there (as a Sutra) in front of him.","reference":"Sahih al-Bukhari 187, Book 4, Hadith 53","grade":"","question #":"question #1","question":"What significance does the remaining water from the Prophet's ablution hold for the people?","id":"bukhari-4-53"},{"hadith-eng":"The \nProphet asked for a tumbler containing water and washed both his hands and face in it and then threw \na mouthful of water in the tumbler and said to both of us (Abu Musa and Bilal), \"Drink from the \ntumbler and pour some of its water on your faces and chests.\"","reference":"Sahih al-Bukhari 188, Book 4, Hadith 54","grade":"","question #":"question #1","question":"What is the significance of using water that the Prophet (ﷺ) has used for washing in Islamic tradition?","id":"bukhari-4-54"},{"hadith-eng":"Mahmud bin Ar-Rabi` who was the person on whose face the Prophet (ﷺ) had ejected a mouthful of water \nfrom his family's well while he was a boy, and `Urwa (on the authority of Al-Miswar and others) who \ntestified each other, said, \"Whenever the Prophet (ﷺ) , performed ablution, his companions were nearly \nfighting for the remains of the water.\"","reference":"Sahih al-Bukhari 189, Book 4, Hadith 55","grade":"","question #":"question #1","question":"What significance did the companions of the Prophet place on the water used by him for ablution?","id":"bukhari-4-55"},{"hadith-eng":"My aunt took me to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! This son of my sister has got a disease \nin his legs.\" So he passed his hands on my head and prayed for Allah's blessings for me; then he \nperformed ablution and I drank from the remaining water. I stood behind him and saw the seal of \nProphethood between his shoulders, and it was like the \"Zir-al-Hijla\" (means the button of a small \ntent, but some said 'egg of a partridge.' etc.)","reference":"Sahih al-Bukhari 190, Book 4, Hadith 56","grade":"","question #":"question #1","question":"What significance does the seal of Prophethood hold in Islamic tradition?","id":"bukhari-4-56"},{"hadith-eng":"(on the authority of his father) `Abdullah bin Zaid poured water on his hands from a utensil containing \nwater and washed them and then with one handful of water he rinsed his mouth and cleaned his nose \nby putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and \nforearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, \nand washed his feet up to the ankles and said, \"This is the ablution of Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 191, Book 4, Hadith 57","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet Muhammad (ﷺ)?","id":"bukhari-4-57"},{"hadith-eng":"My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the \nProphet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in \nfront of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in \nthe pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice \nwith three handfuls of water Again he put his hand in the water and washed his face thrice. After that \nhe put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand \nin the water and passed wet hands over his head by bringing them to the front and then to the back and \nonce more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet (ﷺ) in narration 191 above) had passed his wet hands on the head once only.","reference":"Sahih al-Bukhari 192, Book 4, Hadith 58","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet?","id":"bukhari-4-58"},{"hadith-eng":"\"During the lifetime of Allah's Messenger (ﷺ) men and women used to perform ablution together.\"","reference":"Sahih al-Bukhari 193, Book 4, Hadith 59","grade":"","question #":"question #1","question":"What does the practice of men and women performing ablution together indicate about gender interactions in early Islamic society?","id":"bukhari-4-59"},{"hadith-eng":"Allah's Messenger (ﷺ) came to visit me while I was sick and unconscious. He performed ablution and \nsprinkled the remaining water on me and I became conscious and said, \"O Allah's Messenger (ﷺ)! To whom \nwill my inheritance go as I have neither ascendants nor descendants?\" Then the Divine verses \nregarding Fara'id (inheritance) were revealed.","reference":"Sahih al-Bukhari 194, Book 4, Hadith 60","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take when visiting a sick person according to this narration?","id":"bukhari-4-60"},{"hadith-eng":"It was the time for prayer, and those whose houses were near got up and went to their people (to \nperform ablution), and there remained some people (sitting). Then a painted stove pot (Mikhdab) \ncontaining water was brought to Allah's Messenger (ﷺ)s The pot was small, not broad enough for one to \nspread one's hand in; yet all the people performed ablution. (The sub narrator said, \"We asked Anas, \n'How many persons were you?' Anas replied 'We were eighty or more\"). (It was one of the miracles of \nAllah's Messenger (ﷺ)).","reference":"Sahih al-Bukhari 195, Book 4, Hadith 61","grade":"","question #":"question #1","question":"What does this event demonstrate about the miracles associated with the Prophet Muhammad (ﷺ)?","id":"bukhari-4-61"},{"hadith-eng":"Once the Prophet (ﷺ) asked for a tumbler containing water. He washed his hands and face in it and also \nthrew a mouthful of water in it.","reference":"Sahih al-Bukhari 196, Book 4, Hadith 62","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) perform with the water in the tumbler?","id":"bukhari-4-62"},{"hadith-eng":"Once Allah's Messenger (ﷺ) came to us and we brought out water for him in a brass pot. He performed \nablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet \nhands lightly over the head from front to rear and brought them to front again and washed his feet (up \nto the ankles).","reference":"Sahih al-Bukhari 197, Book 4, Hadith 63","grade":"","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet Muhammad (ﷺ)?","id":"bukhari-4-63"},{"hadith-eng":"When the ailment of the Prophet (ﷺ) became aggravated and his disease became severe, he asked his \nwives to permit him to be nursed (treated) in my house. So they gave him the permission. Then the \nProphet came (to my house) with the support of two men, and his legs were dragging on the ground, \nbetween `Abbas, and another man.\" 'Ubaidullah (the sub narrator) said, \"I informed `Abdullah bin \n`Abbas of what `Aisha said. Ibn `Abbas said: 'Do you know who was the other man?' I replied in the \nnegative. Ibn `Abbas said, 'He was `Ali (bin Abi Talib).\" `Aisha further said, \"When the Prophet (ﷺ) came \nto my house and his sickness became aggravated he ordered us to pour seven skins full of water on \nhim, so that he might give some advice to the people. So he was seated in a Mikhdab (brass tub) \nbelonging to Hafsa, the wife of the Prophet. Then, all of us started pouring water on him from the \nwater skins till he beckoned to us to stop and that we have done (what he wanted us to do). After that \nhe went out to the people.\"","reference":"Sahih al-Bukhari 198, Book 4, Hadith 64","grade":"","question #":"question #1","question":"What does the hadith reveal about the Prophet's preference for being nursed during his illness?","id":"bukhari-4-64"},{"hadith-eng":"(on the authority of his father) My uncle used to perform ablution extravagantly and once he asked \r\n`Abdullah bin Zaid to tell him how he had seen the Prophet (ﷺ) performing ablution. He asked for an \r\nearthenware pot containing water, and poured water from it on his hands and washed them thrice, and \r\nthen put his hand in the earthenware pot and rinsed his mouth and washed his nose by putting water in \r\nit and then blowing it out thrice with one handful of water; he again put his hand in the water and \r\ntook a handful of water and washed his face thrice, then washed his hands up to the elbows twice, and \r\ntook water with his hand, and passed it over his head from front to back and then from back to front, \r\nand then washed his feet (up to the ankles) and said, \"I saw the Prophet (ﷺ) performing ablution in that \r\nway.\"","reference":"Sahih al-Bukhari 199, Book 4, Hadith 65","grade":"","question #":"question #1","question":"What is the significance of following the Prophet's method in performing ablution?","id":"bukhari-4-65"},{"hadith-eng":"Anas said, \"The Prophet (ﷺ) asked for water and a tumbler with a broad base and no so deep, containing a \nsmall quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' \nnoticed the water springing out from amongst his fingers.\" Anas added, ' estimated that the people \nwho performed ablution with it numbered between seventy to eighty.\"","reference":"Sahih al-Bukhari 200, Book 4, Hadith 66","grade":"","question #":"question #1","question":"What does this event demonstrate about the miracles associated with the Prophet Muhammad (ﷺ)?","id":"bukhari-4-66"},{"hadith-eng":"The Prophet (ﷺ) used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and \nused to perform ablution with one Mudd of water.","reference":"Sahih al-Bukhari 201, Book 4, Hadith 67","grade":"","question #":"question #1","question":"What does this narration teach about the Prophet's (ﷺ) practice of water conservation during ablution and bathing?","id":"bukhari-4-67"},{"hadith-eng":"Sa`d bin Abi Waqqas said, \"The Prophet (ﷺ) passed wet hands over his Khuffs (socks made from thick \nfabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and \nadded, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about \nit.\"","reference":"Sahih al-Bukhari 202, Book 4, Hadith 68","grade":"","question #":"question #1","question":"What is the significance of accepting the testimony of reliable narrators in Islamic tradition?","id":"bukhari-4-68"},{"hadith-eng":"Once Allah's Messenger (ﷺ) went out to answer the call of nature and I followed him with a tumbler \ncontaining water, and when he finished, I poured water and he performed ablution and passed wet \nhands over his Khuffs (socks made from thick fabric or leather).","reference":"Sahih al-Bukhari 203, Book 4, Hadith 69","grade":"","question #":"question #1","question":"What is the significance of performing ablution after answering the call of nature in Islam?","id":"bukhari-4-69"},{"hadith-eng":"My father said, \"I saw the Prophet (ﷺ) passing wet hands over his Khuffs (socks made from thick fabric or \nleather).\"","reference":"Sahih al-Bukhari 204, Book 4, Hadith 70","grade":"","question #":"question #1","question":"What is the significance of wiping over socks in Islamic practice?","id":"bukhari-4-70"},{"hadith-eng":"My father said, \"I saw the Prophet (ﷺ) passing wet hands over his turban and Khuffs (socks made from \nthick fabric or leather).","reference":"Sahih al-Bukhari 205, Book 4, Hadith 71","grade":"","question #":"question #1","question":"What is the significance of wiping over the turban and Khuffs during ablution in Islamic practice?","id":"bukhari-4-71"},{"hadith-eng":"My father said, \"Once I was in the company of the Prophet (ﷺ) on a journey and I dashed to take off his \r\nKhuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them \r\nafter performing ablution. So he passed wet hands over them.","reference":"Sahih al-Bukhari 206, Book 4, Hadith 72","grade":"","question #":"question #1","question":"What is the significance of wiping over socks during ablution in Islamic practice?","id":"bukhari-4-72"},{"hadith-eng":"Allah's Messenger (ﷺ) ate a piece of cooked mutton from the shoulder region and prayed without repeating \nablution.","reference":"Sahih al-Bukhari 207, Book 4, Hadith 73","grade":"","question #":"question #1","question":"What is the significance of performing ablution before prayer in Islamic practice?","id":"bukhari-4-73"},{"hadith-eng":"My father said, \"I saw Allah's Messenger (ﷺ) taking a piece of (cooked) mutton from the shoulder region and \nthen he was called for prayer. He put his knife down and prayed without repeating ablution.\"","reference":"Sahih al-Bukhari 208, Book 4, Hadith 74","grade":"","question #":"question #1","question":"What is the ruling on performing ablution after eating cooked meat before prayer?","id":"bukhari-4-74"},{"hadith-eng":"In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached Sahba, a place near \r\nKhaibar, where Allah's Messenger (ﷺ) offered the `Asr prayer and asked for food. Nothing but saweeq  \r\nwas brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet (ﷺ) got up \r\nfor the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he \r\nthen prayed without repeating the ablution.","reference":"Sahih al-Bukhari 209, Book 4, Hadith 75","grade":"","question #":"question #1","question":"What is the significance of rinsing the mouth before prayer in Islamic practice?","id":"bukhari-4-75"},{"hadith-eng":"The Prophet (ﷺ) ate (a piece of) mutton from the shoulder region and then prayed without repeating the \nablution.","reference":"Sahih al-Bukhari 210, Book 4, Hadith 76","grade":"","question #":"question #1","question":"What is the ruling on performing ablution after eating mutton according to Islamic teachings?","id":"bukhari-4-76"},{"hadith-eng":"Allah's Messenger (ﷺ) drank milk, rinsed his mouth and said, \"It has fat.\"","reference":"Sahih al-Bukhari 211, Book 4, Hadith 77","grade":"","question #":"question #1","question":"What is the significance of rinsing the mouth after consuming milk in Islamic practice?","id":"bukhari-4-77"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his \nslumber is over because in praying while drowsy one does not know whether one is asking for \nforgiveness or for a bad thing for oneself.\"","reference":"Sahih al-Bukhari 212, Book 4, Hadith 78","grade":"","question #":"question #1","question":"What should a person do if they feel drowsy during prayer?","id":"bukhari-4-78"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you feels drowsy while praying, he should sleep till he understands \nwhat he is saying (reciting).","reference":"Sahih al-Bukhari 213, Book 4, Hadith 79","grade":"","question #":"question #1","question":"What should a person do if they feel drowsy during prayer?","id":"bukhari-4-79"},{"hadith-eng":"Anas said, \"The Prophet (ﷺ) used to perform ablution for every prayer.\" I asked Anas, \"What did you used to \r\ndo?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"","reference":"Sahih al-Bukhari 214, Book 4, Hadith 80","grade":"","question #":"question #1","question":"What was the Prophet's practice regarding ablution before prayers?","id":"bukhari-4-80"},{"hadith-eng":"In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached As-Sahba' where \r\nAllah's Messenger (ﷺ) led the `Asr prayer and asked for the food. Nothing but saweeq was brought and \r\nwe ate it and drank (water). The Prophet (ﷺ) got up for the (Maghrib) Prayer, rinsed his mouth with water \r\nand then led the prayer without repeating the ablution.","reference":"Sahih al-Bukhari 215, Book 4, Hadith 81","grade":"","question #":"question #1","question":"What is the significance of rinsing the mouth before prayer in Islamic practice?","id":"bukhari-4-81"},{"hadith-eng":"Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices \nof two persons who were being tortured in their graves. The Prophet (ﷺ) said, \"These two persons are \nbeing tortured not for a major sin (to avoid).\" The Prophet (ﷺ) then added, \"Yes! (they are being tortured \nfor a major sin). Indeed, one of them never saved himself from being soiled with his urine while the \nother used to go about with calumnies (to make enmity between friends). The Prophet (ﷺ) then asked for a \ngreen leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why \nhe had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"","reference":"Sahih al-Bukhari 216, Book 4, Hadith 82","grade":"","question #":"question #1","question":"What actions can lead to punishment in the grave according to Islamic teachings?","id":"bukhari-4-82"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to answer the call of nature, I used to bring water with which he used to \nclean his private parts.","reference":"Sahih al-Bukhari 217, Book 4, Hadith 83","grade":"","question #":"question #1","question":"What practices did the Prophet (ﷺ) follow for personal hygiene after answering the call of nature?","id":"bukhari-4-83"},{"hadith-eng":"The Prophet (ﷺ) once passed by two graves and said, \"These two persons are being tortured not for a \nmajor sin (to avoid). One of them never saved himself from being soiled with his urine, while the \nother used to go about with calumnies (to make enmity between friends).\" The Prophet (ﷺ) then took a \ngreen leaf of a date-palm tree, split it into (pieces) and fixed one on each grave. They said, \"O Allah's \nApostle! Why have you done so?\" He replied, \"I hope that their punishment might be lessened till \nthese (the pieces of the leaf) become dry.\" (See the footnote of Hadith 215).","reference":"Sahih al-Bukhari 218, Book 4, Hadith 84","grade":"","question #":"question #1","question":"What are the consequences of neglecting cleanliness in Islam, particularly in relation to urine?","id":"bukhari-4-84"},{"hadith-eng":"The Prophet (ﷺ) saw a Bedouin making water in the mosque and told the people not to disturb him. When \nhe finished, the Prophet (ﷺ) asked for some water and poured it over (the urine).","reference":"Sahih al-Bukhari 219, Book 4, Hadith 85","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) demonstrate patience and wisdom in dealing with unexpected situations in the mosque?","id":"bukhari-4-85"},{"hadith-eng":"A Bedouin stood up and started making water in the mosque. The people caught him but the Prophet (ﷺ) \nordered them to leave him and to pour a bucket or a tumbler of water over the place where he had \npassed the urine. The Prophet (ﷺ) then said, \"You have been sent to make things easy and not to make \nthem difficult.\"","reference":"Sahih al-Bukhari 220, Book 4, Hadith 86","grade":"","question #":"question #1","question":"How should one handle situations where someone unknowingly makes a mistake in a sacred place?","id":"bukhari-4-86"},{"hadith-eng":"The Prophet (ﷺ) said as above (219).","reference":"Sahih al-Bukhari 221, Book 4, Hadith 87","grade":"","question #":"question #1","question":"What is the significance of Anas bin Malik in the context of hadith narration?","id":"bukhari-4-87"},{"hadith-eng":"(the mother of faithful believers) A child was brought to Allah's Messenger (ﷺ) and it urinated on the \ngarment of the Prophet. The Prophet (ﷺ) asked for water and poured it over the soiled place.","reference":"Sahih al-Bukhari 222, Book 4, Hadith 88","grade":"","question #":"question #1","question":"How should one clean a garment that has been soiled by a child's urine according to Islamic teachings?","id":"bukhari-4-88"},{"hadith-eng":"I brought my young son, who had not started eating (ordinary food) to Allah's Messenger (ﷺ) who took him \nand made him sit in his lap. The child urinated on the garment of the Prophet, so he asked for water \nand poured it over the soiled (area) and did not wash it.","reference":"Sahih al-Bukhari 223, Book 4, Hadith 89","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle situations involving children's natural actions, such as urination?","id":"bukhari-4-89"},{"hadith-eng":"Once the Prophet (ﷺ) went to the dumps of some people and passed urine while standing. He then asked \nfor water and so I brought it to him and he performed ablution.","reference":"Sahih al-Bukhari 224, Book 4, Hadith 90","grade":"","question #":"question #1","question":"What are the circumstances under which the Prophet (ﷺ) performed ablution after urinating?","id":"bukhari-4-90"},{"hadith-eng":"The Prophet (ﷺ) and I walked till we reached the dumps of some people. He stood, as any one of you \nstands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him \nand stood near his back till he finished.","reference":"Sahih al-Bukhari 225, Book 4, Hadith 91","grade":"","question #":"question #1","question":"What etiquettes did the Prophet (ﷺ) demonstrate when relieving oneself in public spaces?","id":"bukhari-4-91"},{"hadith-eng":"Abu Musa Al-Ash`ari used to lay great stress on the question of urination and he used to say, \"If \nanyone from Bani Israel happened to soil his clothes with urine, he used to cut that portion away.\" \nHearing that, Hudhaifa said to Abu Wail, \"I wish he (Abu Musa) didn't (lay great stress on that \nmatter).\" Hudhaifa added, \"Allah's Messenger (ﷺ) went to the dumps of some people and urinated while \nstanding.\"","reference":"Sahih al-Bukhari 226, Book 4, Hadith 92","grade":"","question #":"question #1","question":"What are the different views on the importance of cleanliness and purity in Islam?","id":"bukhari-4-92"},{"hadith-eng":"A woman came to the Prophet (ﷺ) and said, \"If anyone of us gets menses in her clothes then what should \nshe do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it \nin order to remove the traces of blood and then pour water over it. Then she can pray in it.\"","reference":"Sahih al-Bukhari 227, Book 4, Hadith 93","grade":"","question #":"question #1","question":"What steps should be taken to clean menstrual blood from clothing according to Islamic teachings?","id":"bukhari-4-93"},{"hadith-eng":"Fatima bint Abi Hubaish came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ) I get persistent bleeding \nfrom the uterus and do not become clean. Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied, \"No, \nbecause it is from a blood vessel and not the menses. So when your real menses begins give up your \nprayers and when it has finished wash off the blood (take a bath) and offer your prayers.\" Hisham (the \nsub narrator) narrated that his father had also said, (the Prophet (ﷺ) told her): \"Perform ablution for every \nprayer till the time of the next period comes.\"","reference":"Sahih al-Bukhari 228, Book 4, Hadith 94","grade":"","question #":"question #1","question":"What guidance is provided for women experiencing non-menstrual bleeding regarding their prayers?","id":"bukhari-4-94"},{"hadith-eng":"I used to wash the traces of Janaba (semen) from the clothes of the Prophet (ﷺ) and he used to go for \nprayers while traces of water were still on it (water spots were still visible).","reference":"Sahih al-Bukhari 229, Book 4, Hadith 95","grade":"","question #":"question #1","question":"What is the significance of cleanliness in Islam, especially in relation to prayer?","id":"bukhari-4-95"},{"hadith-eng":"I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of \nAllah's Messenger (ﷺ) and he would go for the prayer while water spots were still visible. \"","reference":"Sahih al-Bukhari 230, Book 4, Hadith 96","grade":"","question #":"question #1","question":"What is the significance of cleanliness in Islam, especially concerning clothing for prayer?","id":"bukhari-4-96"},{"hadith-eng":"I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \n\"I used to wash it off the clothes of Allah's Messenger (ﷺ) and he would go for the prayers while water spots \nwere still visible on them.","reference":"Sahih al-Bukhari 231, Book 4, Hadith 97","grade":"","question #":"question #1","question":"What is the significance of cleanliness in Islam, especially concerning clothing?","id":"bukhari-4-97"},{"hadith-eng":"I used \nto wash the semen off the clothes of the\nProphet (ﷺ) and even then I used to notice\none or more spots on them.","reference":"Sahih al-Bukhari 232, Book 4, Hadith 98","grade":"","question #":"question #1","question":"What does this narration indicate about the cleanliness requirements for prayer in Islam?","id":"bukhari-4-98"},{"hadith-eng":"Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So \nthe Prophet (ﷺ) ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a \nmedicine). So they went as directed and after they became healthy, they killed the shepherd of the \nProphet and drove away all the camels. The news reached the Prophet (ﷺ) early in the morning and he \nsent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their \nhands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were \nput in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \n\"Those people committed theft and murder, became infidels after embracing Islam and fought against \nAllah and His Apostle .\"","reference":"Sahih al-Bukhari 233, Book 4, Hadith 99","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take against those who committed theft and murder after embracing Islam?","id":"bukhari-4-99"},{"hadith-eng":"Prior to the construction of the mosque, the Prophet (ﷺ) offered the prayers at sheep-folds.","reference":"Sahih al-Bukhari 234, Book 4, Hadith 100","grade":"","question #":"question #1","question":"Where did the Prophet Muhammad (ﷺ) perform prayers before the mosque was constructed?","id":"bukhari-4-100"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked regarding ghee (cooking butter) in which a mouse had fallen. He said, \n\"Take out the mouse and throw away the ghee around it and use the rest.\"","reference":"Sahih al-Bukhari 235, Book 4, Hadith 101","grade":"","question #":"question #1","question":"What should be done if a contaminant falls into food according to Islamic teachings?","id":"bukhari-4-101"},{"hadith-eng":"The Prophet (ﷺ) was asked regarding ghee in which a mouse had fallen. He said, \"Take out the mouse and \nthrow away the ghee around it (and use the rest.)\"","reference":"Sahih al-Bukhari 236, Book 4, Hadith 102","grade":"","question #":"question #1","question":"What should be done if a contaminant falls into food according to Islamic teachings?","id":"bukhari-4-102"},{"hadith-eng":"The Prophet (ﷺ) said, \"A wound which a Muslim receives in Allah's cause will appear on the Day of \nResurrection as it was at the time of infliction; blood will be flowing from the wound and its color will \nbe that of the blood but will smell like musk.\"","reference":"Sahih al-Bukhari 237, Book 4, Hadith 103","grade":"","question #":"question #1","question":"What is the significance of wounds received in the cause of Allah on the Day of Resurrection?","id":"bukhari-4-103"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (people to come in the world) but (will be) the \nforemost (on the Day of Resurrection).\"","reference":"Sahih al-Bukhari 238, Book 4, Hadith 104","grade":"","question #":"question #1","question":"What does it mean for Muslims to be the last in the world but foremost on the Day of Resurrection?","id":"bukhari-4-104"},{"hadith-eng":"\"You should not pass urine in stagnant water which is not flowing then (you may need to) wash in it.\"","reference":"Sahih al-Bukhari 239, Book 4, Hadith 105","grade":"","question #":"question #1","question":"What are the implications of urinating in stagnant water according to Islamic teachings?","id":"bukhari-4-105"},{"hadith-eng":"While Allah's Messenger (ﷺ) was prostrating (as stated below).Narrated `Abdullah bin Mas`ud:Once the Prophet (ﷺ) was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his \ncompanions. One of them said to the others, \"Who amongst you will bring the Abdominal contents \n(intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he \nprostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet (ﷺ) prostrated \nand then placed it on his back between his shoulders. I was watching but could not do any thing. I \nwish I had some people with me to hold out against them. They started laughing and falling on one \nanother. Allah's Messenger (ﷺ) was in prostration and he did not lift his head up till Fatima (Prophet's \ndaughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head \nand said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the \nProphet invoked Allah against them as they had a conviction that the prayers and invocations were \naccepted in this city (Mecca). The Prophet (ﷺ) said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba \nbin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned \nthe seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies \nof those persons who were counted by Allah's Messenger (ﷺ) in the Qalib (one of the wells) of Badr.","reference":"Sahih al-Bukhari 240, Book 4, Hadith 106","grade":"","question #":"question #1","question":"What actions did the companions of Abu Jahl take against the Prophet Muhammad (ﷺ) during his prayer at the Ka'ba?","id":"bukhari-4-106"},{"hadith-eng":"The Prophet (ﷺ) once spat in his clothes.","reference":"Sahih al-Bukhari 241, Book 4, Hadith 107","grade":"","question #":"question #1","question":"What are the etiquettes and practices related to cleanliness in Islam?","id":"bukhari-4-107"},{"hadith-eng":"The Prophet (ﷺ) said, \"All drinks that produce intoxication are Haram (forbidden to drink).","reference":"Sahih al-Bukhari 242, Book 4, Hadith 108","grade":"","question #":"question #1","question":"What is the Islamic ruling on consuming intoxicating drinks?","id":"bukhari-4-108"},{"hadith-eng":"Sahl bin Sa`d As-Sa`idi, was asked by the people, \"With what was the wound of the Prophet (ﷺ) treated? \nSahl replied, \"None remains among the people living who knows that better than I. `Ali [??] used to \nbring water in his shield and Fatima used to wash the blood off his face. Then straw mat was burnt \nand the wound was filled with it.\"","reference":"Sahih al-Bukhari 243, Book 4, Hadith 109","grade":"","question #":"question #1","question":"What methods were used to treat the wounds of the Prophet Muhammad (ﷺ) during his time?","id":"bukhari-4-109"},{"hadith-eng":"My father said, \"I came to the Prophet (ﷺ) and saw him carrying a Siwak in his hand and cleansing his \nteeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"","reference":"Sahih al-Bukhari 244, Book 4, Hadith 110","grade":"","question #":"question #1","question":"What is the significance of using a Siwak in Islamic practice?","id":"bukhari-4-110"},{"hadith-eng":"Whenever the Prophet (ﷺ) got up at night, he used to clean his mouth with Siwak.","reference":"Sahih al-Bukhari 245, Book 4, Hadith 111","grade":"","question #":"question #1","question":"What is the significance of using Siwak in maintaining oral hygiene in Islam?","id":"bukhari-4-111"},{"hadith-eng":"The Prophet (ﷺ) said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"","reference":"Sahih al-Bukhari 246, Book 4, Hadith 112","grade":"","question #":"question #1","question":"What is the significance of respecting elders in Islamic teachings?","id":"bukhari-4-112"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your \nright side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu \nbikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all \nmy affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is \nno fleeing from You, and there is no place of protection and safety except with You O Allah! I believe \nin Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You \nhave sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let \nthe aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet (ﷺ) and when I \nreached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You \nhave revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet (ﷺ) said, \"No, (but say): \n'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"","reference":"Sahih al-Bukhari 247, Book 4, Hadith 113","grade":"","question #":"question #1","question":"What is the significance of performing ablution before going to bed according to Islamic teachings?","id":"bukhari-4-113"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not \naccepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is \n'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"","reference":"Sahih al-Bukhari 135, Book 4, Hadith 1","grade":"","question #":"question #2","question":"How does the concept of 'Hadath' affect the validity of a person's prayer?","id":"bukhari-4-114"},{"hadith-eng":"Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I \nheard the Prophet (ﷺ) saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- \nMuhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so \n(i.e. by performing ablution regularly).' \"","reference":"Sahih al-Bukhari 136, Book 4, Hadith 2","grade":"","question #":"question #2","question":"How can Muslims enhance their spiritual radiance according to Islamic teachings?","id":"bukhari-4-115"},{"hadith-eng":"My uncle asked Allah's Messenger (ﷺ) about a person who imagined to have passed wind during the prayer. \nAllah' Apostle replied: \"He should not leave his prayers unless he hears sound or smells something.\"","reference":"Sahih al-Bukhari 137, Book 4, Hadith 3","grade":"","question #":"question #2","question":"How does one determine whether they have invalidated their prayer due to passing wind?","id":"bukhari-4-116"},{"hadith-eng":"Ibn `Abbas said, \"The Prophet (ﷺ) slept till he snored and then prayed (or probably lay till his breath \nsounds were heard and then got up and prayed).\" Ibn `Abbas added: \"I stayed overnight in the house \nof my aunt, Maimuna, the Prophet (ﷺ) slept for a part of the night, (See Fath-al-Bari page 249, Vol. 1), \nand late in the night, he got up and performed ablution from a hanging water skin, a light (perfect) \nablution and stood up for the prayer. I, too, performed a similar ablution, then I went and stood on his \nleft. He drew me to his right and prayed as much as Allah wished, and again lay and slept till his \nbreath sounds were heard. Later on the Mu'adh-dhin (call maker for the prayer) came to him and \ninformed him that it was time for Prayer. The Prophet (ﷺ) went with him for the prayer without \nperforming a new ablution.\" (Sufyan said to `Amr that some people said, \"The eyes of Allah's Messenger (ﷺ) \nsleep but his heart does not sleep.\" `Amr replied, \"I heard `Ubaid bin `Umar saying that the dreams of \nProphets were Divine Inspiration, and then he recited the verse: 'I (Abraham) see in a dream, (O my \nson) that I offer you in sacrifice (to Allah).\" (37.102) (See Hadith No. 183)","reference":"Sahih al-Bukhari 138, Book 4, Hadith 4","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the practice of night prayer?","id":"bukhari-4-117"},{"hadith-eng":"Allah's Messenger (ﷺ) proceeded from `Arafat till when he reached the mountain pass, he dismounted, \nurinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the \nprayer, O Allah's Messenger (ﷺ)?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he \nreached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama \nwas pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its \nplace. Then the Iqama was pronounced for the `Isha' prayer which the Prophet (ﷺ) led and no prayer was \noffered in between the two . prayers (`Isha' and Maghrib).","reference":"Sahih al-Bukhari 139, Book 4, Hadith 5","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the timing and sequence of Maghrib and Isha prayers during the journey from Arafat to Al-Muzdalifa?","id":"bukhari-4-118"},{"hadith-eng":"Ibn `Abbas performed ablution and washed his face (in the following way): He ladled out a handful of \nwater, rinsed his mouth and washed his nose with it by putting in water and then blowing it out. He \nthen, took another handful (of water) and did like this (gesturing) joining both hands, and washed his \nface, took another handful of water and washed his right forearm. He again took another handful of \nwater and washed his left forearm, and passed wet hands over his head and took another handful of \nwater and poured it over his right foot (up to his ankles) and washed it thoroughly and similarly took \nanother handful of water and washed thoroughly his left foot (up to the ankles) and said, \"I saw \nAllah's Messenger (ﷺ) performing ablution in this way.\"","reference":"Sahih al-Bukhari 140, Book 4, Hadith 6","grade":"","question #":"question #2","question":"How does one perform ablution according to the Sunnah of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-119"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you on having sexual relations with his wife said (and he must say it \nbefore starting) 'In the name of Allah. O Allah! Protect us from Satan and also protect what you \nbestow upon us (i.e. the coming offspring) from Satan, and if it is destined that they should have a \nchild then, Satan will never be able to harm that offspring.\"","reference":"Sahih al-Bukhari 141, Book 4, Hadith 7","grade":"","question #":"question #2","question":"How can one seek protection for their offspring from Satan according to Islamic teachings?","id":"bukhari-4-120"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu \nbika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked \nthings (evil deeds and evil spirits).","reference":"Sahih al-Bukhari 142, Book 4, Hadith 8","grade":"","question #":"question #2","question":"Why is it important to seek refuge in Allah from evil spirits and deeds?","id":"bukhari-4-121"},{"hadith-eng":"Once the Prophet (ﷺ) entered a lavatory and I placed water for his ablution. He asked, \"Who placed it?\" \nHe was informed accordingly and so he said, \"O Allah! Make him (Ibn `Abbas) a learned scholar in \nreligion (Islam).","reference":"Sahih al-Bukhari 143, Book 4, Hadith 9","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate appreciation for good deeds in this narration?","id":"bukhari-4-122"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you goes to an open space for answering the call of nature he \nshould neither face nor turn his back towards the Qibla; he should either face the east or the west.\"","reference":"Sahih al-Bukhari 144, Book 4, Hadith 10","grade":"","question #":"question #2","question":"Why is it important to avoid facing or turning one's back towards the Qibla during certain activities?","id":"bukhari-4-123"},{"hadith-eng":"People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or \nBaitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's \nApostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but \nthere was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).","reference":"Sahih al-Bukhari 145, Book 4, Hadith 11","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain modesty and privacy while answering the call of nature?","id":"bukhari-4-124"},{"hadith-eng":"The wives of the Prophet (ﷺ) used to go to Al-Manasi, a vast open place (near Baqi` at Medina) to answer \nthe call of nature at night. `Umar used to say to the Prophet (ﷺ) \"Let your wives be veiled,\" but Allah's \nApostle did not do so. One night Sauda bint Zam`a the wife of the Prophet (ﷺ) went out at `Isha' time and \nshe was a tall lady. `Umar addressed her and said, \"I have recognized you, O Sauda.\" He said so, as he \ndesired eagerly that the verses of Al-Hijab (the observing of veils by the Muslim women) may be \nrevealed. So Allah revealed the verses of \"Al-Hijab\" (A complete body cover excluding the eyes).","reference":"Sahih al-Bukhari 146, Book 4, Hadith 12","grade":"","question #":"question #2","question":"What does the interaction between Umar and Sauda bint Zam'a reveal about the social norms and practices regarding modesty during the Prophet's time?","id":"bukhari-4-125"},{"hadith-eng":"The Prophet (ﷺ) said to his wives, \"You are allowed to go out to answer the call of nature. \"","reference":"Sahih al-Bukhari 147, Book 4, Hadith 13","grade":"","question #":"question #2","question":"How does Islamic teaching address the issue of privacy and modesty in daily activities?","id":"bukhari-4-126"},{"hadith-eng":"I went up to the roof of Hafsa's house for some job and I saw Allah's Messenger (ﷺ) answering the call of \nnature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back \ntowards the Qibla. (See Hadith No. 147).","reference":"Sahih al-Bukhari 148, Book 4, Hadith 14","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle the situation of answering the call of nature in relation to the Qibla?","id":"bukhari-4-127"},{"hadith-eng":"Once I went up the roof of our house and saw Allah's Messenger (ﷺ) answering the call of nature while \nsitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).","reference":"Sahih al-Bukhari 149, Book 4, Hadith 15","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) observe and report his actions in daily life?","id":"bukhari-4-128"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to \naccompany him with a tumbler full of water. (Hisham commented, \"So that he might wash his private \nparts with it.)\"","reference":"Sahih al-Bukhari 150, Book 4, Hadith 16","grade":"","question #":"question #2","question":"What role did companions play in assisting the Prophet Muhammad (ﷺ) with his personal needs?","id":"bukhari-4-129"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy from us used to \ngo behind him with a tumbler full of water.","reference":"Sahih al-Bukhari 151, Book 4, Hadith 17","grade":"","question #":"question #2","question":"How did the companions assist the Prophet in maintaining cleanliness and hygiene?","id":"bukhari-4-130"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to carry a \ntumbler full of water (for cleaning the private parts) and a short spear (or stick).","reference":"Sahih al-Bukhari 152, Book 4, Hadith 18","grade":"","question #":"question #2","question":"What items were used by the Prophet Muhammad (ﷺ) for cleanliness after using the restroom?","id":"bukhari-4-131"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whenever anyone of you drinks water, he should not breathe in the drinking \nutensil, and whenever anyone of you goes to a lavatory, he should neither touch his penis nor clean his \nprivate parts with his right hand.\"","reference":"Sahih al-Bukhari 153, Book 4, Hadith 19","grade":"","question #":"question #2","question":"Why is it advised not to breathe into the drinking utensil while drinking water?","id":"bukhari-4-132"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whenever anyone of you makes water he should not hold his penis or clean his \nprivate parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"","reference":"Sahih al-Bukhari 154, Book 4, Hadith 20","grade":"","question #":"question #2","question":"Why is it advised not to use the right hand for certain actions in Islamic teachings?","id":"bukhari-4-133"},{"hadith-eng":"I followed the Prophet (ﷺ) while he was going out to answer the call of nature. He used not to look this \nway or that. So, when I approached near him he said to me, \"Fetch for me some stones for ' cleaning \nthe privates parts (or said something similar), and do not bring a bone or a piece of dung.\" So I \nbrought the stones in the corner of my garment and placed them by his side and I then went away from \nhim. When he finished (from answering the call of nature) he used, them .","reference":"Sahih al-Bukhari 155, Book 4, Hadith 21","grade":"","question #":"question #2","question":"Why are bones and dung not suitable for use in cleaning after relieving oneself according to Islamic tradition?","id":"bukhari-4-134"},{"hadith-eng":"The Prophet (ﷺ) went out to answer the call of nature and asked me to bring three stones. I found two \nstones and searched for the third but could not find it. So took a dried piece of dung and brought it to \nhim. He took the two stones and threw away the dung and said, \"This is a filthy thing.\"","reference":"Sahih al-Bukhari 156, Book 4, Hadith 22","grade":"","question #":"question #2","question":"Why is it important to avoid using certain items for purification in Islam?","id":"bukhari-4-135"},{"hadith-eng":"The Prophet (ﷺ) performed ablution by washing the body parts only once.","reference":"Sahih al-Bukhari 157, Book 4, Hadith 23","grade":"","question #":"question #2","question":"How does the method of performing ablution reflect the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-136"},{"hadith-eng":"The Prophet (ﷺ) performed ablution by washing the body parts twice.","reference":"Sahih al-Bukhari 158, Book 4, Hadith 24","grade":"","question #":"question #2","question":"What is the significance of performing ablution in Islam?","id":"bukhari-4-137"},{"hadith-eng":"(the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler \r\n     of water (and when it was brought) he poured water over his hands and \r\n     washed them thrice and then put his right hand in the water container \r\n     and rinsed his mouth, washed his nose by putting water in it and then \r\n     blowing it out. then he washed his face and forearms up to the \r\n     elbows thrice, passed his wet hands over his head and washed his feet \r\n     up to the ankles thrice. Then he said, \"Allah's Messenger (ﷺ) said 'If \r\n     anyone performs ablution like that of mine and offers a two-rak'at \r\n     prayer during which he does not think of anything else (not related to\r\n     the present prayer) then his past sins will be forgiven.' \"","reference":"Sahih al-Bukhari 159, Book 4, Hadith 25","grade":"","question #":"question #2","question":"How does performing a two-rak'at prayer with full concentration affect one's past sins?","id":"bukhari-4-138"},{"hadith-eng":"This verse is: \"Verily, those\n     who conceal the clear signs and the guidance which we have sent \n     down...)\" (2:159). I heard the Prophet (ﷺ) saying, 'If a man performs \n     ablution perfectly and then offers the compulsory congregational \n     prayer, Allah will forgive his sins committed between that (prayer) \n     and the (next) prayer till he offers it.","reference":"Sahih al-Bukhari 160, Book 4, Hadith 26","grade":"","question #":"question #2","question":"How does attending congregational prayer contribute to the forgiveness of sins?","id":"bukhari-4-139"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever performs ablution should clean his nose with water by putting the water \nin it and then blowing it out, and whoever cleans his private parts with stones should do it with odd \nnumber of stones.\"","reference":"Sahih al-Bukhari 161, Book 4, Hadith 27","grade":"","question #":"question #2","question":"How is the process of cleaning the nose with water during ablution performed according to Islamic teachings?","id":"bukhari-4-140"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you performs ablution he should put water in his nose and then \nblow it out and whoever cleans his private parts with stones should do so with odd numbers. And \nwhoever wakes up from his sleep should wash his hands before putting them in the water for ablution, \nbecause nobody knows where his hands were during sleep.\"","reference":"Sahih al-Bukhari 162, Book 4, Hadith 28","grade":"","question #":"question #2","question":"Why is it recommended to wash hands after waking up before performing ablution?","id":"bukhari-4-141"},{"hadith-eng":"The Prophet (ﷺ) remained behind us on a journey. He joined us while we were performing ablution for the \n`Asr prayer which was overdue and we were just passing wet hands over our feet (not washing them \nthoroughly) so he addressed us in a loud voice saying twice , \"Save your heels from the fire.\"","reference":"Sahih al-Bukhari 163, Book 4, Hadith 29","grade":"","question #":"question #2","question":"Why is it important to wash the feet thoroughly during ablution?","id":"bukhari-4-142"},{"hadith-eng":"(the freed slave of `Uthman bin `Affan) I saw `Uthman bin `Affan asking (for a tumbler of water) to \nperform ablution (and when it was brought) he poured water from it over his hands and washed them \nthrice and then put his right hand in the water container and rinsed his mouth and washed his nose by \nputting water in it and then blowing it out. Then he washed his face thrice and (then) forearms up to \nthe elbows thrice, then passed his wet hands over his head and then washed each foot thrice. After that \n`Uthman said, \"I saw the Prophet (ﷺ) performing ablution like this of mine, and he said, 'If anyone \nperforms ablution like that of mine and offers a two-rak`at prayer during which he does not think of \nanything else (not related to the present prayer) then his past sins will be forgiven. '","reference":"Sahih al-Bukhari 164, Book 4, Hadith 30","grade":"","question #":"question #2","question":"How does performing a two-rak'at prayer with full concentration affect one's past sins?","id":"bukhari-4-143"},{"hadith-eng":"I heard Abu Huraira saying as he passed by us while the people were performing ablution from a \nutensil containing water, \"Perform ablution perfectly and thoroughly for Abul-Qasim (the Prophet) \nsaid, 'Save your heels from the Hell-fire.' \"","reference":"Sahih al-Bukhari 165, Book 4, Hadith 31","grade":"","question #":"question #2","question":"How does proper ablution relate to the concept of salvation from Hell-fire?","id":"bukhari-4-144"},{"hadith-eng":"I asked `Abdullah bin `Umar, \"O Abu `Abdur-Rahman! I saw you doing four things which I never \nsaw being done by anyone of you companions?\" `Abdullah bin `Umar said, \"What are those, O Ibn \nJuraij?\" I said, \"I never saw you touching any corner of the Ka`ba except these (two) facing south \n(Yemen) and I saw you wearing shoes made of tanned leather and dyeing your hair with Hinna (a kind \nof red dye). I also noticed that whenever you were in Mecca, the people assume Ihram on seeing the \nnew moon crescent (1st of Dhul-Hijja) while you did not assume the Ihlal (Ihram) -(Ihram is also \ncalled Ihlal which means 'Loud calling' because a Muhrim has to recite Talbiya aloud when assuming \nthe state of Ihram) - till the 8th of Dhul-Hijja (Day of Tarwiya). `Abdullah replied, \"Regarding the \ncorners of Ka`ba, I never saw Allah's Messenger (ﷺ) touching except those facing south (Yemen) and \nregarding the tanned leather shoes, no doubt I saw Allah's Messenger (ﷺ) wearing non-hairy shoes and he \nused to perform ablution while wearing the shoes (i.e. wash his feet and then put on the shoes). So I \nlove to wear similar shoes. And about the dyeing of hair with Hinna; no doubt I saw Allah's Messenger (ﷺ) \ndyeing his hair with it and that is why I like to dye (my hair with it). Regarding Ihlal, I did not see \nAllah's Messenger (ﷺ) assuming Ihlal till he set out for Hajj (on the 8th of Dhul-Hijja).","reference":"Sahih al-Bukhari 166, Book 4, Hadith 32","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) influence the personal grooming habits of his companions?","id":"bukhari-4-145"},{"hadith-eng":"That the Prophet (ﷺ) at the time of washing his deceased daughter had said to them, \"Start from the right \nside beginning with those parts which are washed in ablution.\"","reference":"Sahih al-Bukhari 167, Book 4, Hadith 33","grade":"","question #":"question #2","question":"How does the practice of washing the deceased relate to the ablution process in Islam?","id":"bukhari-4-146"},{"hadith-eng":"The Prophet (ﷺ) used to like to start from the right side on wearing shoes, combing his hair and cleaning \nor washing himself and on doing anything else.","reference":"Sahih al-Bukhari 168, Book 4, Hadith 34","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his preference for using the right side in daily activities?","id":"bukhari-4-147"},{"hadith-eng":"saw Allah's Messenger (ﷺ) when the `Asr prayer was due and the people searched for water to perform \nablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's \nApostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the \nwater springing out from underneath his fingers till all of them performed the ablution (it was one of \nthe miracles of the Prophet).","reference":"Sahih al-Bukhari 169, Book 4, Hadith 35","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the needs of his companions in times of scarcity?","id":"bukhari-4-148"},{"hadith-eng":"I said to `Abida, \"I have some of the hair of the Prophet (ﷺ) which I got from Anas or from his family.\" \n`Abida replied. \"No doubt if I had a single hair of that it would have been dearer to me than the whole \nworld and whatever is in it.\"","reference":"Sahih al-Bukhari 170, Book 4, Hadith 36","grade":"","question #":"question #2","question":"How do Muslims express their reverence for the Prophet Muhammad (ﷺ) through physical objects associated with him?","id":"bukhari-4-149"},{"hadith-eng":"When Allah's Messenger (ﷺ) got his head shaved, Abu- Talha was the first to take some of his hair.","reference":"Sahih al-Bukhari 171, Book 4, Hadith 37","grade":"","question #":"question #2","question":"Who was the first person to take some of the Prophet's hair after his head was shaved?","id":"bukhari-4-150"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a dog drinks from the utensil of anyone of you it is essential to wash it seven \ntimes.\"","reference":"Sahih al-Bukhari 172, Book 4, Hadith 38","grade":"","question #":"question #2","question":"How many times should a utensil be washed if a dog drinks from it according to Islamic teachings?","id":"bukhari-4-151"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man saw a dog eating mud from (the severity of) \n     thirst. So, that man took a shoe (and filled it) with water and kept \n     on pouring the water for the dog till it quenched its thirst. So Allah\n     approved of his deed and made him to enter Paradise.\"","reference":"Sahih al-Bukhari 173, Book 4, Hadith 39","grade":"","question #":"question #2","question":"How can acts of compassion lead to spiritual rewards in Islamic teachings?","id":"bukhari-4-152"},{"hadith-eng":"My father said. \"During the lifetime of Allah's \n     Apostle, the dogs used to urinate, and pass through the mosques (come \n     and go), nevertheless they never used to sprinkle water on it (urine \n     of the dog.)\"","reference":"Sahih al-Bukhari 174, Book 4, Hadith 40","grade":"","question #":"question #2","question":"How was the issue of cleanliness addressed in mosques when dogs were present during the Prophet's time?","id":"bukhari-4-153"},{"hadith-eng":"I asked the Prophet (about the hunting dogs) and he replied, \"If you let loose (with Allah's name) your \ntamed dog after a game and it hunts it, you may eat it, but if the dog eats of (that game) then do not eat \nit because the dog has hunted it for itself.\" I further said, \"Sometimes I send my dog for hunting and \nfind another dog with it. He said, \"Do not eat the game for you have mentioned Allah's name only on \nsending your dog and not the other dog.\"","reference":"Sahih al-Bukhari 175, Book 4, Hadith 41","grade":"","question #":"question #2","question":"Why is it important to mention Allah's name when sending a hunting dog?","id":"bukhari-4-154"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A person is considered in prayer as long as he is waiting for the prayer in the \nmosque as long as he does not do Hadath.\" A non-Arab man asked, \"O Abu Huraira! What is \nHadath?\" I replied, \"It is the passing of wind (from the anus) (that is one of the types of Hadath).","reference":"Sahih al-Bukhari 176, Book 4, Hadith 42","grade":"","question #":"question #2","question":"How is the state of being in prayer affected by physical actions or conditions?","id":"bukhari-4-155"},{"hadith-eng":"My uncle said: The Prophet (ﷺ) said, \"One should not leave his prayer unless he hears sound or smells \nsomething.\"","reference":"Sahih al-Bukhari 177, Book 4, Hadith 43","grade":"","question #":"question #2","question":"How does one determine the validity of their prayer in the context of doubts about purity?","id":"bukhari-4-156"},{"hadith-eng":"I used to get emotional urethral discharges frequently and felt shy to ask Allah's Messenger (ﷺ) about it. So I \nrequested Al-Miqdad bin Al-Aswad to ask (the Prophet (ﷺ) ) about it. Al-Miqdad asked him and he \nreplied, \"One has to perform ablution (after it).\"","reference":"Sahih al-Bukhari 178, Book 4, Hadith 44","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) seek guidance on personal matters they felt shy about?","id":"bukhari-4-157"},{"hadith-eng":"I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman \nreplied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" \n`Uthman added, \"I heard it from Allah's Messenger (ﷺ).\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b \nabout it and they, too, gave the same reply. (This order was canceled later on and taking a bath \nbecame necessary for such cases).","reference":"Sahih al-Bukhari 179, Book 4, Hadith 45","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) respond to questions about purification in specific situations?","id":"bukhari-4-158"},{"hadith-eng":"Allah's Messenger (ﷺ) sent for a Ansari man who came with water dropping from his head. The Prophet (ﷺ) said, \n\"Perhaps we have forced you to hurry up, haven't we?\" The Ansari replied, \"Yes.\" Allah's Messenger (ﷺ) \nfurther said, \"If you are forced to hurry up (during intercourse) or you do not discharge then ablution \nis due on you (This order was canceled later on, i.e. one has to take a bath).","reference":"Sahih al-Bukhari 180, Book 4, Hadith 46","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the situation when someone was hurried during an intimate moment?","id":"bukhari-4-159"},{"hadith-eng":"\"When Allah's Messenger (ﷺ) departed from `Arafat, he turned towards a mountain pass where he answered \nthe call of nature. (After he had finished) I poured water and he performed ablution and then I said to \nhim, \"O Allah's Messenger (ﷺ)! Will you offer the prayer?\" He replied, \"The Musalla (place of the prayer) is \nahead of you (in Al-Muzdalifa).","reference":"Sahih al-Bukhari 181, Book 4, Hadith 47","grade":"","question #":"question #2","question":"Why might a specific location be designated for prayer during a pilgrimage?","id":"bukhari-4-160"},{"hadith-eng":"I was in the company of Allah's Messenger (ﷺ) on one of the journeys and he went out to answer the call of \nnature (and after he finished) I poured water and he performed ablution; he washed his face, forearms \nand passed his wet hand over his head and over the two Khuff (socks made from thick fabric or \nleather).","reference":"Sahih al-Bukhari 182, Book 4, Hadith 48","grade":"","question #":"question #2","question":"How does one perform ablution when wearing Khuff (leather socks)?","id":"bukhari-4-161"},{"hadith-eng":"That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay \non the bed (cushion transversally) while Allah's Messenger (ﷺ) and his wife lay in the lengthwise direction of \nthe cushion. Allah's Messenger (ﷺ) slept till the middle of the night, either a bit before or a bit after it and \nthen woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten \nverses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution \nfrom it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the \nProphet had done. Then I went and stood by his side. He placed his right hand on my head and caught \nmy right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at \nand then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he \nlay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet (ﷺ) got up, offered a \ntwo light rak`at prayer and went out and led the Fajr prayer.","reference":"Sahih al-Bukhari 183, Book 4, Hadith 49","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform his night prayers, and what was the sequence of rak`at he followed?","id":"bukhari-4-162"},{"hadith-eng":"I came to `Aisha the wife of the Prophet (ﷺ) during the solar eclipse. The people were standing and \noffering the prayer and she was also praying. I asked her, \"What is wrong with the people?\" She \nbeckoned with her hand towards the sky and said, \"Subhan Allah.\" I asked her, \"Is there a sign?\" She \npointed out, \"Yes.\" So I, too, stood for the prayer till I fell unconscious and later on I poured water on \nmy head. After the prayer, Allah's Messenger (ﷺ) praised and glorified Allah and said, \"Just now I have seen \nsomething which I never saw before at this place of mine, including Paradise and Hell. I have been \ninspired (and have understood) that you will be put to trials in your graves and these trials will be like \nthe trials of Ad-Dajjal, or nearly like it (the sub narrator is not sure of what Asma' said). Angels will \ncome to every one of you and ask, 'What do you know about this man?' A believer will reply, 'He is \nMuhammad, Allah's Messenger (ﷺ) , and he came to us with self-evident truth and guidance. So we accepted \nhis teaching, believed and followed him.' Then the angels will say to him to sleep in peace as they \nhave come to know that he was a believer. On the other hand a hypocrite or a doubtful person will \nreply, 'I do not know but heard the people saying something and so I said the same.' \"","reference":"Sahih al-Bukhari 184, Book 4, Hadith 50","grade":"","question #":"question #2","question":"How are believers and hypocrites differentiated during trials in the grave according to Islamic teachings?","id":"bukhari-4-163"},{"hadith-eng":"A person asked `Abdullah bin Zaid who was the grandfather of `Amr bin Yahya, \"Can you show me \nhow Allah's Messenger (ﷺ) used to perform ablution?\" `Abdullah bin Zaid replied in the affirmative and \nasked for water. He poured it on his hands and washed them twice, then he rinsed his mouth thrice and \nwashed his nose with water thrice by putting water in it and blowing it out. He washed his face thrice \nand after that he washed his forearms up to the elbows twice and then passed his wet hands over his \nhead from its front to its back and vice versa (beginning from the front and taking them to the back of \nhis head up to the nape of the neck and then brought them to the front again from where he had \nstarted) and washed his feet (up to the ankles).","reference":"Sahih al-Bukhari 185, Book 4, Hadith 51","grade":"","question #":"question #2","question":"How many times should each part of the body be washed during ablution according to the Sunnah?","id":"bukhari-4-164"},{"hadith-eng":"My father saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. \n`Abdullah bin Zaid asked for earthenware pot containing water and in front of them performed \nablution like that of the Prophet (ﷺ) . He poured water from the pot over his hand and washed his hands \nthrice and then he put his hands in the pot and rinsed his mouth and washed his nose by putting water \nin it and then blowing it out with three handfuls of water. Again he put his hand in the water and \nwashed his face thrice and washed his forearms up to the elbows twice; and then put his hands in the \nwater and then passed them over his head by bringing them to the front and then to the rear of the \nhead once, and then he washed his feet up to the ankles.","reference":"Sahih al-Bukhari 186, Book 4, Hadith 52","grade":"","question #":"question #2","question":"How did the companions of the Prophet ensure the accuracy of his practices in daily rituals?","id":"bukhari-4-165"},{"hadith-eng":"Allah's Messenger (ﷺ) came to us at noon and water for ablution was brought to him. After he had performed \nablution, the remaining water was taken by the people and they started smearing their bodies with it \n(as a blessed thing). The Prophet (ﷺ) offered two rak`at of the Zuhr prayer and then two rak`at of the `Asr \nprayer while a short spear (or stick) was there (as a Sutra) in front of him.","reference":"Sahih al-Bukhari 187, Book 4, Hadith 53","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform the Zuhr and Asr prayers in terms of rak'ahs?","id":"bukhari-4-166"},{"hadith-eng":"The \nProphet asked for a tumbler containing water and washed both his hands and face in it and then threw \na mouthful of water in the tumbler and said to both of us (Abu Musa and Bilal), \"Drink from the \ntumbler and pour some of its water on your faces and chests.\"","reference":"Sahih al-Bukhari 188, Book 4, Hadith 54","grade":"","question #":"question #2","question":"How does the act of washing one's face and hands relate to spiritual or physical purification in Islam?","id":"bukhari-4-167"},{"hadith-eng":"Mahmud bin Ar-Rabi` who was the person on whose face the Prophet (ﷺ) had ejected a mouthful of water \nfrom his family's well while he was a boy, and `Urwa (on the authority of Al-Miswar and others) who \ntestified each other, said, \"Whenever the Prophet (ﷺ) , performed ablution, his companions were nearly \nfighting for the remains of the water.\"","reference":"Sahih al-Bukhari 189, Book 4, Hadith 55","grade":"","question #":"question #2","question":"How did the companions of the Prophet demonstrate their reverence for him during his lifetime?","id":"bukhari-4-168"},{"hadith-eng":"My aunt took me to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! This son of my sister has got a disease \nin his legs.\" So he passed his hands on my head and prayed for Allah's blessings for me; then he \nperformed ablution and I drank from the remaining water. I stood behind him and saw the seal of \nProphethood between his shoulders, and it was like the \"Zir-al-Hijla\" (means the button of a small \ntent, but some said 'egg of a partridge.' etc.)","reference":"Sahih al-Bukhari 190, Book 4, Hadith 56","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to requests for healing and blessings?","id":"bukhari-4-169"},{"hadith-eng":"(on the authority of his father) `Abdullah bin Zaid poured water on his hands from a utensil containing \nwater and washed them and then with one handful of water he rinsed his mouth and cleaned his nose \nby putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and \nforearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, \nand washed his feet up to the ankles and said, \"This is the ablution of Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 191, Book 4, Hadith 57","grade":"","question #":"question #2","question":"How many times should one rinse the mouth and clean the nose during ablution?","id":"bukhari-4-170"},{"hadith-eng":"My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the \nProphet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in \nfront of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in \nthe pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice \nwith three handfuls of water Again he put his hand in the water and washed his face thrice. After that \nhe put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand \nin the water and passed wet hands over his head by bringing them to the front and then to the back and \nonce more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet (ﷺ) in narration 191 above) had passed his wet hands on the head once only.","reference":"Sahih al-Bukhari 192, Book 4, Hadith 58","grade":"","question #":"question #2","question":"How many times should each part of the body be washed during ablution according to the Prophet's practice?","id":"bukhari-4-171"},{"hadith-eng":"\"During the lifetime of Allah's Messenger (ﷺ) men and women used to perform ablution together.\"","reference":"Sahih al-Bukhari 193, Book 4, Hadith 59","grade":"","question #":"question #2","question":"How does the practice of performing ablution together reflect the communal aspects of worship in Islam?","id":"bukhari-4-172"},{"hadith-eng":"Allah's Messenger (ﷺ) came to visit me while I was sick and unconscious. He performed ablution and \nsprinkled the remaining water on me and I became conscious and said, \"O Allah's Messenger (ﷺ)! To whom \nwill my inheritance go as I have neither ascendants nor descendants?\" Then the Divine verses \nregarding Fara'id (inheritance) were revealed.","reference":"Sahih al-Bukhari 194, Book 4, Hadith 60","grade":"","question #":"question #2","question":"How did the revelation of the verses regarding inheritance come about in this context?","id":"bukhari-4-173"},{"hadith-eng":"It was the time for prayer, and those whose houses were near got up and went to their people (to \nperform ablution), and there remained some people (sitting). Then a painted stove pot (Mikhdab) \ncontaining water was brought to Allah's Messenger (ﷺ)s The pot was small, not broad enough for one to \nspread one's hand in; yet all the people performed ablution. (The sub narrator said, \"We asked Anas, \n'How many persons were you?' Anas replied 'We were eighty or more\"). (It was one of the miracles of \nAllah's Messenger (ﷺ)).","reference":"Sahih al-Bukhari 195, Book 4, Hadith 61","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) manage to perform ablution with limited resources?","id":"bukhari-4-174"},{"hadith-eng":"Once the Prophet (ﷺ) asked for a tumbler containing water. He washed his hands and face in it and also \nthrew a mouthful of water in it.","reference":"Sahih al-Bukhari 196, Book 4, Hadith 62","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) use water for purification?","id":"bukhari-4-175"},{"hadith-eng":"Once Allah's Messenger (ﷺ) came to us and we brought out water for him in a brass pot. He performed \nablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet \nhands lightly over the head from front to rear and brought them to front again and washed his feet (up \nto the ankles).","reference":"Sahih al-Bukhari 197, Book 4, Hadith 63","grade":"","question #":"question #2","question":"How many times did the Prophet Muhammad (ﷺ) wash his face during ablution?","id":"bukhari-4-176"},{"hadith-eng":"When the ailment of the Prophet (ﷺ) became aggravated and his disease became severe, he asked his \nwives to permit him to be nursed (treated) in my house. So they gave him the permission. Then the \nProphet came (to my house) with the support of two men, and his legs were dragging on the ground, \nbetween `Abbas, and another man.\" 'Ubaidullah (the sub narrator) said, \"I informed `Abdullah bin \n`Abbas of what `Aisha said. Ibn `Abbas said: 'Do you know who was the other man?' I replied in the \nnegative. Ibn `Abbas said, 'He was `Ali (bin Abi Talib).\" `Aisha further said, \"When the Prophet (ﷺ) came \nto my house and his sickness became aggravated he ordered us to pour seven skins full of water on \nhim, so that he might give some advice to the people. So he was seated in a Mikhdab (brass tub) \nbelonging to Hafsa, the wife of the Prophet. Then, all of us started pouring water on him from the \nwater skins till he beckoned to us to stop and that we have done (what he wanted us to do). After that \nhe went out to the people.\"","reference":"Sahih al-Bukhari 198, Book 4, Hadith 64","grade":"","question #":"question #2","question":"How did the Prophet's companions assist him during his illness according to the narration?","id":"bukhari-4-177"},{"hadith-eng":"(on the authority of his father) My uncle used to perform ablution extravagantly and once he asked \r\n`Abdullah bin Zaid to tell him how he had seen the Prophet (ﷺ) performing ablution. He asked for an \r\nearthenware pot containing water, and poured water from it on his hands and washed them thrice, and \r\nthen put his hand in the earthenware pot and rinsed his mouth and washed his nose by putting water in \r\nit and then blowing it out thrice with one handful of water; he again put his hand in the water and \r\ntook a handful of water and washed his face thrice, then washed his hands up to the elbows twice, and \r\ntook water with his hand, and passed it over his head from front to back and then from back to front, \r\nand then washed his feet (up to the ankles) and said, \"I saw the Prophet (ﷺ) performing ablution in that \r\nway.\"","reference":"Sahih al-Bukhari 199, Book 4, Hadith 65","grade":"","question #":"question #2","question":"How does one perform ablution according to the Sunnah of the Prophet?","id":"bukhari-4-178"},{"hadith-eng":"Anas said, \"The Prophet (ﷺ) asked for water and a tumbler with a broad base and no so deep, containing a \nsmall quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' \nnoticed the water springing out from amongst his fingers.\" Anas added, ' estimated that the people \nwho performed ablution with it numbered between seventy to eighty.\"","reference":"Sahih al-Bukhari 200, Book 4, Hadith 66","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) witness and describe the miracles performed by him?","id":"bukhari-4-179"},{"hadith-eng":"The Prophet (ﷺ) used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and \nused to perform ablution with one Mudd of water.","reference":"Sahih al-Bukhari 201, Book 4, Hadith 67","grade":"","question #":"question #2","question":"How much water did the Prophet (ﷺ) use for ablution and bathing according to this narration?","id":"bukhari-4-180"},{"hadith-eng":"Sa`d bin Abi Waqqas said, \"The Prophet (ﷺ) passed wet hands over his Khuffs (socks made from thick \nfabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and \nadded, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about \nit.\"","reference":"Sahih al-Bukhari 202, Book 4, Hadith 68","grade":"","question #":"question #2","question":"How does the practice of wiping over socks relate to the rules of ablution in Islam?","id":"bukhari-4-181"},{"hadith-eng":"Once Allah's Messenger (ﷺ) went out to answer the call of nature and I followed him with a tumbler \ncontaining water, and when he finished, I poured water and he performed ablution and passed wet \nhands over his Khuffs (socks made from thick fabric or leather).","reference":"Sahih al-Bukhari 203, Book 4, Hadith 69","grade":"","question #":"question #2","question":"How does the practice of wiping over socks during ablution reflect Islamic teachings on cleanliness and convenience?","id":"bukhari-4-182"},{"hadith-eng":"My father said, \"I saw the Prophet (ﷺ) passing wet hands over his Khuffs (socks made from thick fabric or \nleather).\"","reference":"Sahih al-Bukhari 204, Book 4, Hadith 70","grade":"","question #":"question #2","question":"How does the practice of wiping over socks relate to the rules of ablution in Islam?","id":"bukhari-4-183"},{"hadith-eng":"My father said, \"I saw the Prophet (ﷺ) passing wet hands over his turban and Khuffs (socks made from \nthick fabric or leather).","reference":"Sahih al-Bukhari 205, Book 4, Hadith 71","grade":"","question #":"question #2","question":"How does the practice of wiping over Khuffs facilitate ease in performing ablution for Muslims?","id":"bukhari-4-184"},{"hadith-eng":"My father said, \"Once I was in the company of the Prophet (ﷺ) on a journey and I dashed to take off his \r\nKhuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them \r\nafter performing ablution. So he passed wet hands over them.","reference":"Sahih al-Bukhari 206, Book 4, Hadith 72","grade":"","question #":"question #2","question":"How does the practice of wiping over socks relate to the rules of ablution while traveling?","id":"bukhari-4-185"},{"hadith-eng":"Allah's Messenger (ﷺ) ate a piece of cooked mutton from the shoulder region and prayed without repeating \nablution.","reference":"Sahih al-Bukhari 207, Book 4, Hadith 73","grade":"","question #":"question #2","question":"How does the consumption of certain foods affect the requirement for ablution before prayer?","id":"bukhari-4-186"},{"hadith-eng":"My father said, \"I saw Allah's Messenger (ﷺ) taking a piece of (cooked) mutton from the shoulder region and \nthen he was called for prayer. He put his knife down and prayed without repeating ablution.\"","reference":"Sahih al-Bukhari 208, Book 4, Hadith 74","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to being called for prayer while eating?","id":"bukhari-4-187"},{"hadith-eng":"In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached Sahba, a place near \r\nKhaibar, where Allah's Messenger (ﷺ) offered the `Asr prayer and asked for food. Nothing but saweeq  \r\nwas brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet (ﷺ) got up \r\nfor the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he \r\nthen prayed without repeating the ablution.","reference":"Sahih al-Bukhari 209, Book 4, Hadith 75","grade":"","question #":"question #2","question":"How does the consumption of food affect the validity of ablution before prayer?","id":"bukhari-4-188"},{"hadith-eng":"The Prophet (ﷺ) ate (a piece of) mutton from the shoulder region and then prayed without repeating the \nablution.","reference":"Sahih al-Bukhari 210, Book 4, Hadith 76","grade":"","question #":"question #2","question":"How does the consumption of certain foods affect the validity of one's ablution in Islam?","id":"bukhari-4-189"},{"hadith-eng":"Allah's Messenger (ﷺ) drank milk, rinsed his mouth and said, \"It has fat.\"","reference":"Sahih al-Bukhari 211, Book 4, Hadith 77","grade":"","question #":"question #2","question":"How does the consumption of milk relate to dietary guidelines in Islam?","id":"bukhari-4-190"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his \nslumber is over because in praying while drowsy one does not know whether one is asking for \nforgiveness or for a bad thing for oneself.\"","reference":"Sahih al-Bukhari 212, Book 4, Hadith 78","grade":"","question #":"question #2","question":"Why is it important to be fully alert and conscious while performing prayers?","id":"bukhari-4-191"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you feels drowsy while praying, he should sleep till he understands \nwhat he is saying (reciting).","reference":"Sahih al-Bukhari 213, Book 4, Hadith 79","grade":"","question #":"question #2","question":"Why is it important to be fully attentive and aware while performing prayers?","id":"bukhari-4-192"},{"hadith-eng":"Anas said, \"The Prophet (ﷺ) used to perform ablution for every prayer.\" I asked Anas, \"What did you used to \r\ndo?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"","reference":"Sahih al-Bukhari 214, Book 4, Hadith 80","grade":"","question #":"question #2","question":"How did the companions of the Prophet manage their ablution for multiple prayers?","id":"bukhari-4-193"},{"hadith-eng":"In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached As-Sahba' where \r\nAllah's Messenger (ﷺ) led the `Asr prayer and asked for the food. Nothing but saweeq was brought and \r\nwe ate it and drank (water). The Prophet (ﷺ) got up for the (Maghrib) Prayer, rinsed his mouth with water \r\nand then led the prayer without repeating the ablution.","reference":"Sahih al-Bukhari 215, Book 4, Hadith 81","grade":"","question #":"question #2","question":"How does the consumption of food affect the validity of ablution before prayer?","id":"bukhari-4-194"},{"hadith-eng":"Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices \nof two persons who were being tortured in their graves. The Prophet (ﷺ) said, \"These two persons are \nbeing tortured not for a major sin (to avoid).\" The Prophet (ﷺ) then added, \"Yes! (they are being tortured \nfor a major sin). Indeed, one of them never saved himself from being soiled with his urine while the \nother used to go about with calumnies (to make enmity between friends). The Prophet (ﷺ) then asked for a \ngreen leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why \nhe had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"","reference":"Sahih al-Bukhari 216, Book 4, Hadith 82","grade":"","question #":"question #2","question":"How does Islam view the act of spreading calumnies and its consequences?","id":"bukhari-4-195"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to answer the call of nature, I used to bring water with which he used to \nclean his private parts.","reference":"Sahih al-Bukhari 217, Book 4, Hadith 83","grade":"","question #":"question #2","question":"How did Anas bin Malik assist the Prophet (ﷺ) in maintaining cleanliness?","id":"bukhari-4-196"},{"hadith-eng":"The Prophet (ﷺ) once passed by two graves and said, \"These two persons are being tortured not for a \nmajor sin (to avoid). One of them never saved himself from being soiled with his urine, while the \nother used to go about with calumnies (to make enmity between friends).\" The Prophet (ﷺ) then took a \ngreen leaf of a date-palm tree, split it into (pieces) and fixed one on each grave. They said, \"O Allah's \nApostle! Why have you done so?\" He replied, \"I hope that their punishment might be lessened till \nthese (the pieces of the leaf) become dry.\" (See the footnote of Hadith 215).","reference":"Sahih al-Bukhari 218, Book 4, Hadith 84","grade":"","question #":"question #2","question":"How does spreading calumnies affect relationships and what are its spiritual consequences?","id":"bukhari-4-197"},{"hadith-eng":"The Prophet (ﷺ) saw a Bedouin making water in the mosque and told the people not to disturb him. When \nhe finished, the Prophet (ﷺ) asked for some water and poured it over (the urine).","reference":"Sahih al-Bukhari 219, Book 4, Hadith 85","grade":"","question #":"question #2","question":"What actions did the Prophet (ﷺ) take to maintain cleanliness and respect in the mosque environment?","id":"bukhari-4-198"},{"hadith-eng":"A Bedouin stood up and started making water in the mosque. The people caught him but the Prophet (ﷺ) \nordered them to leave him and to pour a bucket or a tumbler of water over the place where he had \npassed the urine. The Prophet (ﷺ) then said, \"You have been sent to make things easy and not to make \nthem difficult.\"","reference":"Sahih al-Bukhari 220, Book 4, Hadith 86","grade":"","question #":"question #2","question":"What is the significance of showing leniency and understanding in correcting others' mistakes?","id":"bukhari-4-199"},{"hadith-eng":"The Prophet (ﷺ) said as above (219).","reference":"Sahih al-Bukhari 221, Book 4, Hadith 87","grade":"","question #":"question #2","question":"How does the repetition of a hadith by different narrators affect its authenticity?","id":"bukhari-4-200"},{"hadith-eng":"(the mother of faithful believers) A child was brought to Allah's Messenger (ﷺ) and it urinated on the \ngarment of the Prophet. The Prophet (ﷺ) asked for water and poured it over the soiled place.","reference":"Sahih al-Bukhari 222, Book 4, Hadith 88","grade":"","question #":"question #2","question":"What does the Prophet's action teach about handling impurities in Islam?","id":"bukhari-4-201"},{"hadith-eng":"I brought my young son, who had not started eating (ordinary food) to Allah's Messenger (ﷺ) who took him \nand made him sit in his lap. The child urinated on the garment of the Prophet, so he asked for water \nand poured it over the soiled (area) and did not wash it.","reference":"Sahih al-Bukhari 223, Book 4, Hadith 89","grade":"","question #":"question #2","question":"What does this incident teach about the Prophet's (ﷺ) approach to cleanliness and purification?","id":"bukhari-4-202"},{"hadith-eng":"Once the Prophet (ﷺ) went to the dumps of some people and passed urine while standing. He then asked \nfor water and so I brought it to him and he performed ablution.","reference":"Sahih al-Bukhari 224, Book 4, Hadith 90","grade":"","question #":"question #2","question":"What does this narration indicate about the permissibility of urinating while standing?","id":"bukhari-4-203"},{"hadith-eng":"The Prophet (ﷺ) and I walked till we reached the dumps of some people. He stood, as any one of you \nstands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him \nand stood near his back till he finished.","reference":"Sahih al-Bukhari 225, Book 4, Hadith 91","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) maintain privacy and modesty during personal activities?","id":"bukhari-4-204"},{"hadith-eng":"Abu Musa Al-Ash`ari used to lay great stress on the question of urination and he used to say, \"If \nanyone from Bani Israel happened to soil his clothes with urine, he used to cut that portion away.\" \nHearing that, Hudhaifa said to Abu Wail, \"I wish he (Abu Musa) didn't (lay great stress on that \nmatter).\" Hudhaifa added, \"Allah's Messenger (ﷺ) went to the dumps of some people and urinated while \nstanding.\"","reference":"Sahih al-Bukhari 226, Book 4, Hadith 92","grade":"","question #":"question #2","question":"How did the practices of Bani Israel regarding cleanliness differ from those of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-205"},{"hadith-eng":"A woman came to the Prophet (ﷺ) and said, \"If anyone of us gets menses in her clothes then what should \nshe do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it \nin order to remove the traces of blood and then pour water over it. Then she can pray in it.\"","reference":"Sahih al-Bukhari 227, Book 4, Hadith 93","grade":"","question #":"question #2","question":"How does Islam address the issue of cleanliness and purity in relation to prayer?","id":"bukhari-4-206"},{"hadith-eng":"Fatima bint Abi Hubaish came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ) I get persistent bleeding \nfrom the uterus and do not become clean. Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied, \"No, \nbecause it is from a blood vessel and not the menses. So when your real menses begins give up your \nprayers and when it has finished wash off the blood (take a bath) and offer your prayers.\" Hisham (the \nsub narrator) narrated that his father had also said, (the Prophet (ﷺ) told her): \"Perform ablution for every \nprayer till the time of the next period comes.\"","reference":"Sahih al-Bukhari 228, Book 4, Hadith 94","grade":"","question #":"question #2","question":"How should a woman distinguish between menstrual and non-menstrual bleeding in terms of religious duties?","id":"bukhari-4-207"},{"hadith-eng":"I used to wash the traces of Janaba (semen) from the clothes of the Prophet (ﷺ) and he used to go for \nprayers while traces of water were still on it (water spots were still visible).","reference":"Sahih al-Bukhari 229, Book 4, Hadith 95","grade":"","question #":"question #2","question":"How does Islamic teaching address the handling of impurities on clothing before prayer?","id":"bukhari-4-208"},{"hadith-eng":"I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of \nAllah's Messenger (ﷺ) and he would go for the prayer while water spots were still visible. \"","reference":"Sahih al-Bukhari 230, Book 4, Hadith 96","grade":"","question #":"question #2","question":"How did Aisha describe the Prophet's practice regarding clothes soiled with impurities?","id":"bukhari-4-209"},{"hadith-eng":"I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \n\"I used to wash it off the clothes of Allah's Messenger (ﷺ) and he would go for the prayers while water spots \nwere still visible on them.","reference":"Sahih al-Bukhari 231, Book 4, Hadith 97","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations when his clothes were soiled?","id":"bukhari-4-210"},{"hadith-eng":"I used \nto wash the semen off the clothes of the\nProphet (ﷺ) and even then I used to notice\none or more spots on them.","reference":"Sahih al-Bukhari 232, Book 4, Hadith 98","grade":"","question #":"question #2","question":"How does this narration reflect the practices of personal hygiene during the time of the Prophet (ﷺ)?","id":"bukhari-4-211"},{"hadith-eng":"Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So \nthe Prophet (ﷺ) ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a \nmedicine). So they went as directed and after they became healthy, they killed the shepherd of the \nProphet and drove away all the camels. The news reached the Prophet (ﷺ) early in the morning and he \nsent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their \nhands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were \nput in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \n\"Those people committed theft and murder, became infidels after embracing Islam and fought against \nAllah and His Apostle .\"","reference":"Sahih al-Bukhari 233, Book 4, Hadith 99","grade":"","question #":"question #2","question":"What was the prescribed treatment for the people of `Ukl or `Uraina tribe when they fell ill in Medina?","id":"bukhari-4-212"},{"hadith-eng":"Prior to the construction of the mosque, the Prophet (ﷺ) offered the prayers at sheep-folds.","reference":"Sahih al-Bukhari 234, Book 4, Hadith 100","grade":"","question #":"question #2","question":"What significance do sheep-folds hold in the early practices of Islamic prayer?","id":"bukhari-4-213"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked regarding ghee (cooking butter) in which a mouse had fallen. He said, \n\"Take out the mouse and throw away the ghee around it and use the rest.\"","reference":"Sahih al-Bukhari 235, Book 4, Hadith 101","grade":"","question #":"question #2","question":"How does Islamic law address the issue of food purity and cleanliness?","id":"bukhari-4-214"},{"hadith-eng":"The Prophet (ﷺ) was asked regarding ghee in which a mouse had fallen. He said, \"Take out the mouse and \nthrow away the ghee around it (and use the rest.)\"","reference":"Sahih al-Bukhari 236, Book 4, Hadith 102","grade":"","question #":"question #2","question":"How does Islamic law address the issue of purity and cleanliness in food consumption?","id":"bukhari-4-215"},{"hadith-eng":"The Prophet (ﷺ) said, \"A wound which a Muslim receives in Allah's cause will appear on the Day of \nResurrection as it was at the time of infliction; blood will be flowing from the wound and its color will \nbe that of the blood but will smell like musk.\"","reference":"Sahih al-Bukhari 237, Book 4, Hadith 103","grade":"","question #":"question #2","question":"How are the wounds of a Muslim who fought in Allah's cause described in terms of appearance and fragrance?","id":"bukhari-4-216"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (people to come in the world) but (will be) the \nforemost (on the Day of Resurrection).\"","reference":"Sahih al-Bukhari 238, Book 4, Hadith 104","grade":"","question #":"question #2","question":"How does the concept of being foremost on the Day of Resurrection reflect on the status of Muslims in the hereafter?","id":"bukhari-4-217"},{"hadith-eng":"\"You should not pass urine in stagnant water which is not flowing then (you may need to) wash in it.\"","reference":"Sahih al-Bukhari 239, Book 4, Hadith 105","grade":"","question #":"question #2","question":"Why is it important to avoid contaminating water sources in Islam?","id":"bukhari-4-218"},{"hadith-eng":"While Allah's Messenger (ﷺ) was prostrating (as stated below).Narrated `Abdullah bin Mas`ud:Once the Prophet (ﷺ) was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his \ncompanions. One of them said to the others, \"Who amongst you will bring the Abdominal contents \n(intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he \nprostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet (ﷺ) prostrated \nand then placed it on his back between his shoulders. I was watching but could not do any thing. I \nwish I had some people with me to hold out against them. They started laughing and falling on one \nanother. Allah's Messenger (ﷺ) was in prostration and he did not lift his head up till Fatima (Prophet's \ndaughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head \nand said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the \nProphet invoked Allah against them as they had a conviction that the prayers and invocations were \naccepted in this city (Mecca). The Prophet (ﷺ) said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba \nbin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned \nthe seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies \nof those persons who were counted by Allah's Messenger (ﷺ) in the Qalib (one of the wells) of Badr.","reference":"Sahih al-Bukhari 240, Book 4, Hadith 106","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the actions of Abu Jahl and his companions?","id":"bukhari-4-219"},{"hadith-eng":"The Prophet (ﷺ) once spat in his clothes.","reference":"Sahih al-Bukhari 241, Book 4, Hadith 107","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate humility and simplicity in his daily life?","id":"bukhari-4-220"},{"hadith-eng":"The Prophet (ﷺ) said, \"All drinks that produce intoxication are Haram (forbidden to drink).","reference":"Sahih al-Bukhari 242, Book 4, Hadith 108","grade":"","question #":"question #2","question":"Why are intoxicating substances considered forbidden in Islam?","id":"bukhari-4-221"},{"hadith-eng":"Sahl bin Sa`d As-Sa`idi, was asked by the people, \"With what was the wound of the Prophet (ﷺ) treated? \nSahl replied, \"None remains among the people living who knows that better than I. `Ali [??] used to \nbring water in his shield and Fatima used to wash the blood off his face. Then straw mat was burnt \nand the wound was filled with it.\"","reference":"Sahih al-Bukhari 243, Book 4, Hadith 109","grade":"","question #":"question #2","question":"Who were involved in caring for the Prophet Muhammad (ﷺ) when he was wounded?","id":"bukhari-4-222"},{"hadith-eng":"My father said, \"I came to the Prophet (ﷺ) and saw him carrying a Siwak in his hand and cleansing his \nteeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"","reference":"Sahih al-Bukhari 244, Book 4, Hadith 110","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate personal hygiene?","id":"bukhari-4-223"},{"hadith-eng":"Whenever the Prophet (ﷺ) got up at night, he used to clean his mouth with Siwak.","reference":"Sahih al-Bukhari 245, Book 4, Hadith 111","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate Siwak into his nightly routine?","id":"bukhari-4-224"},{"hadith-eng":"The Prophet (ﷺ) said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"","reference":"Sahih al-Bukhari 246, Book 4, Hadith 112","grade":"","question #":"question #2","question":"How does the use of Siwak relate to the practices of personal hygiene in Islam?","id":"bukhari-4-225"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your \nright side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu \nbikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all \nmy affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is \nno fleeing from You, and there is no place of protection and safety except with You O Allah! I believe \nin Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You \nhave sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let \nthe aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet (ﷺ) and when I \nreached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You \nhave revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet (ﷺ) said, \"No, (but say): \n'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"","reference":"Sahih al-Bukhari 247, Book 4, Hadith 113","grade":"","question #":"question #2","question":"How does entrusting one's affairs to Allah before sleep reflect a believer's faith and reliance on Him?","id":"bukhari-4-226"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not \naccepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is \n'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"","reference":"Sahih al-Bukhari 135, Book 4, Hadith 1","grade":"","question #":"question #3","question":"Why is it important to understand the conditions that invalidate prayer in Islamic teachings?","id":"bukhari-4-227"},{"hadith-eng":"Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I \nheard the Prophet (ﷺ) saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- \nMuhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so \n(i.e. by performing ablution regularly).' \"","reference":"Sahih al-Bukhari 136, Book 4, Hadith 2","grade":"","question #":"question #3","question":"What is the meaning of the term 'Al-Ghurr-ul-Muhajjalun' in Islamic eschatology?","id":"bukhari-4-228"},{"hadith-eng":"My uncle asked Allah's Messenger (ﷺ) about a person who imagined to have passed wind during the prayer. \nAllah' Apostle replied: \"He should not leave his prayers unless he hears sound or smells something.\"","reference":"Sahih al-Bukhari 137, Book 4, Hadith 3","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding doubts about purity during prayer?","id":"bukhari-4-229"},{"hadith-eng":"Ibn `Abbas said, \"The Prophet (ﷺ) slept till he snored and then prayed (or probably lay till his breath \nsounds were heard and then got up and prayed).\" Ibn `Abbas added: \"I stayed overnight in the house \nof my aunt, Maimuna, the Prophet (ﷺ) slept for a part of the night, (See Fath-al-Bari page 249, Vol. 1), \nand late in the night, he got up and performed ablution from a hanging water skin, a light (perfect) \nablution and stood up for the prayer. I, too, performed a similar ablution, then I went and stood on his \nleft. He drew me to his right and prayed as much as Allah wished, and again lay and slept till his \nbreath sounds were heard. Later on the Mu'adh-dhin (call maker for the prayer) came to him and \ninformed him that it was time for Prayer. The Prophet (ﷺ) went with him for the prayer without \nperforming a new ablution.\" (Sufyan said to `Amr that some people said, \"The eyes of Allah's Messenger (ﷺ) \nsleep but his heart does not sleep.\" `Amr replied, \"I heard `Ubaid bin `Umar saying that the dreams of \nProphets were Divine Inspiration, and then he recited the verse: 'I (Abraham) see in a dream, (O my \nson) that I offer you in sacrifice (to Allah).\" (37.102) (See Hadith No. 183)","reference":"Sahih al-Bukhari 138, Book 4, Hadith 4","grade":"","question #":"question #3","question":"What does the hadith imply about the nature of the Prophet's (ﷺ) sleep and its relation to divine inspiration?","id":"bukhari-4-230"},{"hadith-eng":"Allah's Messenger (ﷺ) proceeded from `Arafat till when he reached the mountain pass, he dismounted, \nurinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the \nprayer, O Allah's Messenger (ﷺ)?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he \nreached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama \nwas pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its \nplace. Then the Iqama was pronounced for the `Isha' prayer which the Prophet (ﷺ) led and no prayer was \noffered in between the two . prayers (`Isha' and Maghrib).","reference":"Sahih al-Bukhari 139, Book 4, Hadith 5","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) actions regarding the importance of performing ablution correctly?","id":"bukhari-4-231"},{"hadith-eng":"Ibn `Abbas performed ablution and washed his face (in the following way): He ladled out a handful of \nwater, rinsed his mouth and washed his nose with it by putting in water and then blowing it out. He \nthen, took another handful (of water) and did like this (gesturing) joining both hands, and washed his \nface, took another handful of water and washed his right forearm. He again took another handful of \nwater and washed his left forearm, and passed wet hands over his head and took another handful of \nwater and poured it over his right foot (up to his ankles) and washed it thoroughly and similarly took \nanother handful of water and washed thoroughly his left foot (up to the ankles) and said, \"I saw \nAllah's Messenger (ﷺ) performing ablution in this way.\"","reference":"Sahih al-Bukhari 140, Book 4, Hadith 6","grade":"","question #":"question #3","question":"What are the steps involved in performing ablution as demonstrated by Ibn `Abbas?","id":"bukhari-4-232"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you on having sexual relations with his wife said (and he must say it \nbefore starting) 'In the name of Allah. O Allah! Protect us from Satan and also protect what you \nbestow upon us (i.e. the coming offspring) from Satan, and if it is destined that they should have a \nchild then, Satan will never be able to harm that offspring.\"","reference":"Sahih al-Bukhari 141, Book 4, Hadith 7","grade":"","question #":"question #3","question":"What is the impact of a specific supplication on the protection of future children from harm?","id":"bukhari-4-233"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu \nbika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked \nthings (evil deeds and evil spirits).","reference":"Sahih al-Bukhari 142, Book 4, Hadith 8","grade":"","question #":"question #3","question":"How can one protect themselves from offensive and wicked things according to Islamic teachings?","id":"bukhari-4-234"},{"hadith-eng":"Once the Prophet (ﷺ) entered a lavatory and I placed water for his ablution. He asked, \"Who placed it?\" \nHe was informed accordingly and so he said, \"O Allah! Make him (Ibn `Abbas) a learned scholar in \nreligion (Islam).","reference":"Sahih al-Bukhari 143, Book 4, Hadith 9","grade":"","question #":"question #3","question":"What can be learned about the relationship between the Prophet Muhammad (ﷺ) and his companions from this event?","id":"bukhari-4-235"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you goes to an open space for answering the call of nature he \nshould neither face nor turn his back towards the Qibla; he should either face the east or the west.\"","reference":"Sahih al-Bukhari 144, Book 4, Hadith 10","grade":"","question #":"question #3","question":"How does Islamic etiquette address the direction one should face when using the restroom?","id":"bukhari-4-236"},{"hadith-eng":"People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or \nBaitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's \nApostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but \nthere was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).","reference":"Sahih al-Bukhari 145, Book 4, Hadith 11","grade":"","question #":"question #3","question":"What can be inferred about the practices of the Prophet Muhammad (ﷺ) from the observation of Abdullah bin Umar?","id":"bukhari-4-237"},{"hadith-eng":"The wives of the Prophet (ﷺ) used to go to Al-Manasi, a vast open place (near Baqi` at Medina) to answer \nthe call of nature at night. `Umar used to say to the Prophet (ﷺ) \"Let your wives be veiled,\" but Allah's \nApostle did not do so. One night Sauda bint Zam`a the wife of the Prophet (ﷺ) went out at `Isha' time and \nshe was a tall lady. `Umar addressed her and said, \"I have recognized you, O Sauda.\" He said so, as he \ndesired eagerly that the verses of Al-Hijab (the observing of veils by the Muslim women) may be \nrevealed. So Allah revealed the verses of \"Al-Hijab\" (A complete body cover excluding the eyes).","reference":"Sahih al-Bukhari 146, Book 4, Hadith 12","grade":"","question #":"question #3","question":"How did the practice of veiling among Muslim women come to be established according to Islamic tradition?","id":"bukhari-4-238"},{"hadith-eng":"The Prophet (ﷺ) said to his wives, \"You are allowed to go out to answer the call of nature. \"","reference":"Sahih al-Bukhari 147, Book 4, Hadith 13","grade":"","question #":"question #3","question":"What are the considerations for women in Islam when it comes to fulfilling natural needs outside the home?","id":"bukhari-4-239"},{"hadith-eng":"I went up to the roof of Hafsa's house for some job and I saw Allah's Messenger (ﷺ) answering the call of \nnature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back \ntowards the Qibla. (See Hadith No. 147).","reference":"Sahih al-Bukhari 148, Book 4, Hadith 14","grade":"","question #":"question #3","question":"What can be learned from the actions of the Prophet (ﷺ) regarding modesty and privacy?","id":"bukhari-4-240"},{"hadith-eng":"Once I went up the roof of our house and saw Allah's Messenger (ﷺ) answering the call of nature while \nsitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).","reference":"Sahih al-Bukhari 149, Book 4, Hadith 15","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) practices from the observations of his companions?","id":"bukhari-4-241"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to \naccompany him with a tumbler full of water. (Hisham commented, \"So that he might wash his private \nparts with it.)\"","reference":"Sahih al-Bukhari 150, Book 4, Hadith 16","grade":"","question #":"question #3","question":"How important is cleanliness in Islam, as demonstrated by the actions of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-242"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy from us used to \ngo behind him with a tumbler full of water.","reference":"Sahih al-Bukhari 151, Book 4, Hadith 17","grade":"","question #":"question #3","question":"What can be learned about the importance of cleanliness in Islam from the actions of the Prophet's companions?","id":"bukhari-4-243"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to carry a \ntumbler full of water (for cleaning the private parts) and a short spear (or stick).","reference":"Sahih al-Bukhari 152, Book 4, Hadith 18","grade":"","question #":"question #3","question":"How did the companions assist the Prophet Muhammad (ﷺ) in maintaining cleanliness?","id":"bukhari-4-244"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whenever anyone of you drinks water, he should not breathe in the drinking \nutensil, and whenever anyone of you goes to a lavatory, he should neither touch his penis nor clean his \nprivate parts with his right hand.\"","reference":"Sahih al-Bukhari 153, Book 4, Hadith 19","grade":"","question #":"question #3","question":"What are the guidelines for maintaining cleanliness and hygiene in the lavatory according to Islamic teachings?","id":"bukhari-4-245"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whenever anyone of you makes water he should not hold his penis or clean his \nprivate parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"","reference":"Sahih al-Bukhari 154, Book 4, Hadith 20","grade":"","question #":"question #3","question":"What is the significance of not breathing into a drinking utensil according to Islamic guidance?","id":"bukhari-4-246"},{"hadith-eng":"I followed the Prophet (ﷺ) while he was going out to answer the call of nature. He used not to look this \nway or that. So, when I approached near him he said to me, \"Fetch for me some stones for ' cleaning \nthe privates parts (or said something similar), and do not bring a bone or a piece of dung.\" So I \nbrought the stones in the corner of my garment and placed them by his side and I then went away from \nhim. When he finished (from answering the call of nature) he used, them .","reference":"Sahih al-Bukhari 155, Book 4, Hadith 21","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) demonstrate modesty and privacy when attending to personal needs?","id":"bukhari-4-247"},{"hadith-eng":"The Prophet (ﷺ) went out to answer the call of nature and asked me to bring three stones. I found two \nstones and searched for the third but could not find it. So took a dried piece of dung and brought it to \nhim. He took the two stones and threw away the dung and said, \"This is a filthy thing.\"","reference":"Sahih al-Bukhari 156, Book 4, Hadith 22","grade":"","question #":"question #3","question":"What does this narration teach about the cleanliness and purity in Islamic practices?","id":"bukhari-4-248"},{"hadith-eng":"The Prophet (ﷺ) performed ablution by washing the body parts only once.","reference":"Sahih al-Bukhari 157, Book 4, Hadith 23","grade":"","question #":"question #3","question":"What are the different methods of performing ablution as practiced by the Prophet (ﷺ)?","id":"bukhari-4-249"},{"hadith-eng":"The Prophet (ﷺ) performed ablution by washing the body parts twice.","reference":"Sahih al-Bukhari 158, Book 4, Hadith 24","grade":"","question #":"question #3","question":"What are the steps involved in performing ablution according to the Prophet's practice?","id":"bukhari-4-250"},{"hadith-eng":"(the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler \r\n     of water (and when it was brought) he poured water over his hands and \r\n     washed them thrice and then put his right hand in the water container \r\n     and rinsed his mouth, washed his nose by putting water in it and then \r\n     blowing it out. then he washed his face and forearms up to the \r\n     elbows thrice, passed his wet hands over his head and washed his feet \r\n     up to the ankles thrice. Then he said, \"Allah's Messenger (ﷺ) said 'If \r\n     anyone performs ablution like that of mine and offers a two-rak'at \r\n     prayer during which he does not think of anything else (not related to\r\n     the present prayer) then his past sins will be forgiven.' \"","reference":"Sahih al-Bukhari 159, Book 4, Hadith 25","grade":"","question #":"question #3","question":"What is the significance of performing ablution and prayer in seeking forgiveness for past sins?","id":"bukhari-4-251"},{"hadith-eng":"This verse is: \"Verily, those\n     who conceal the clear signs and the guidance which we have sent \n     down...)\" (2:159). I heard the Prophet (ﷺ) saying, 'If a man performs \n     ablution perfectly and then offers the compulsory congregational \n     prayer, Allah will forgive his sins committed between that (prayer) \n     and the (next) prayer till he offers it.","reference":"Sahih al-Bukhari 160, Book 4, Hadith 26","grade":"","question #":"question #3","question":"What is the impact of regular prayer on a person's spiritual purification and forgiveness of sins?","id":"bukhari-4-252"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever performs ablution should clean his nose with water by putting the water \nin it and then blowing it out, and whoever cleans his private parts with stones should do it with odd \nnumber of stones.\"","reference":"Sahih al-Bukhari 161, Book 4, Hadith 27","grade":"","question #":"question #3","question":"What are the recommended practices for personal hygiene in Islam as mentioned in this context?","id":"bukhari-4-253"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you performs ablution he should put water in his nose and then \nblow it out and whoever cleans his private parts with stones should do so with odd numbers. And \nwhoever wakes up from his sleep should wash his hands before putting them in the water for ablution, \nbecause nobody knows where his hands were during sleep.\"","reference":"Sahih al-Bukhari 162, Book 4, Hadith 28","grade":"","question #":"question #3","question":"What are the steps involved in performing ablution according to Islamic teachings?","id":"bukhari-4-254"},{"hadith-eng":"The Prophet (ﷺ) remained behind us on a journey. He joined us while we were performing ablution for the \n`Asr prayer which was overdue and we were just passing wet hands over our feet (not washing them \nthoroughly) so he addressed us in a loud voice saying twice , \"Save your heels from the fire.\"","reference":"Sahih al-Bukhari 163, Book 4, Hadith 29","grade":"","question #":"question #3","question":"What are the consequences of neglecting proper ablution according to Islamic teachings?","id":"bukhari-4-255"},{"hadith-eng":"(the freed slave of `Uthman bin `Affan) I saw `Uthman bin `Affan asking (for a tumbler of water) to \nperform ablution (and when it was brought) he poured water from it over his hands and washed them \nthrice and then put his right hand in the water container and rinsed his mouth and washed his nose by \nputting water in it and then blowing it out. Then he washed his face thrice and (then) forearms up to \nthe elbows thrice, then passed his wet hands over his head and then washed each foot thrice. After that \n`Uthman said, \"I saw the Prophet (ﷺ) performing ablution like this of mine, and he said, 'If anyone \nperforms ablution like that of mine and offers a two-rak`at prayer during which he does not think of \nanything else (not related to the present prayer) then his past sins will be forgiven. '","reference":"Sahih al-Bukhari 164, Book 4, Hadith 30","grade":"","question #":"question #3","question":"What is the significance of following the Prophet's method of ablution in seeking forgiveness?","id":"bukhari-4-256"},{"hadith-eng":"I heard Abu Huraira saying as he passed by us while the people were performing ablution from a \nutensil containing water, \"Perform ablution perfectly and thoroughly for Abul-Qasim (the Prophet) \nsaid, 'Save your heels from the Hell-fire.' \"","reference":"Sahih al-Bukhari 165, Book 4, Hadith 31","grade":"","question #":"question #3","question":"What did the Prophet Muhammad (peace be upon him) emphasize about the importance of washing the heels during ablution?","id":"bukhari-4-257"},{"hadith-eng":"I asked `Abdullah bin `Umar, \"O Abu `Abdur-Rahman! I saw you doing four things which I never \nsaw being done by anyone of you companions?\" `Abdullah bin `Umar said, \"What are those, O Ibn \nJuraij?\" I said, \"I never saw you touching any corner of the Ka`ba except these (two) facing south \n(Yemen) and I saw you wearing shoes made of tanned leather and dyeing your hair with Hinna (a kind \nof red dye). I also noticed that whenever you were in Mecca, the people assume Ihram on seeing the \nnew moon crescent (1st of Dhul-Hijja) while you did not assume the Ihlal (Ihram) -(Ihram is also \ncalled Ihlal which means 'Loud calling' because a Muhrim has to recite Talbiya aloud when assuming \nthe state of Ihram) - till the 8th of Dhul-Hijja (Day of Tarwiya). `Abdullah replied, \"Regarding the \ncorners of Ka`ba, I never saw Allah's Messenger (ﷺ) touching except those facing south (Yemen) and \nregarding the tanned leather shoes, no doubt I saw Allah's Messenger (ﷺ) wearing non-hairy shoes and he \nused to perform ablution while wearing the shoes (i.e. wash his feet and then put on the shoes). So I \nlove to wear similar shoes. And about the dyeing of hair with Hinna; no doubt I saw Allah's Messenger (ﷺ) \ndyeing his hair with it and that is why I like to dye (my hair with it). Regarding Ihlal, I did not see \nAllah's Messenger (ﷺ) assuming Ihlal till he set out for Hajj (on the 8th of Dhul-Hijja).","reference":"Sahih al-Bukhari 166, Book 4, Hadith 32","grade":"","question #":"question #3","question":"What is the significance of the timing of assuming Ihram during Hajj according to Abdullah bin Umar's observation?","id":"bukhari-4-258"},{"hadith-eng":"That the Prophet (ﷺ) at the time of washing his deceased daughter had said to them, \"Start from the right \nside beginning with those parts which are washed in ablution.\"","reference":"Sahih al-Bukhari 167, Book 4, Hadith 33","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the washing of his deceased daughter?","id":"bukhari-4-259"},{"hadith-eng":"The Prophet (ﷺ) used to like to start from the right side on wearing shoes, combing his hair and cleaning \nor washing himself and on doing anything else.","reference":"Sahih al-Bukhari 168, Book 4, Hadith 34","grade":"","question #":"question #3","question":"In what aspects of personal grooming and cleanliness did the Prophet (ﷺ) prefer to start with the right side?","id":"bukhari-4-260"},{"hadith-eng":"saw Allah's Messenger (ﷺ) when the `Asr prayer was due and the people searched for water to perform \nablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's \nApostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the \nwater springing out from underneath his fingers till all of them performed the ablution (it was one of \nthe miracles of the Prophet).","reference":"Sahih al-Bukhari 169, Book 4, Hadith 35","grade":"","question #":"question #3","question":"What role does faith play in witnessing and believing in the miracles of the Prophet Muhammad (ﷺ)?","id":"bukhari-4-261"},{"hadith-eng":"I said to `Abida, \"I have some of the hair of the Prophet (ﷺ) which I got from Anas or from his family.\" \n`Abida replied. \"No doubt if I had a single hair of that it would have been dearer to me than the whole \nworld and whatever is in it.\"","reference":"Sahih al-Bukhari 170, Book 4, Hadith 36","grade":"","question #":"question #3","question":"What value might a single hair of the Prophet Muhammad (ﷺ) have compared to worldly possessions?","id":"bukhari-4-262"},{"hadith-eng":"When Allah's Messenger (ﷺ) got his head shaved, Abu- Talha was the first to take some of his hair.","reference":"Sahih al-Bukhari 171, Book 4, Hadith 37","grade":"","question #":"question #3","question":"What actions did the companions of the Prophet (ﷺ) take when he got his head shaved?","id":"bukhari-4-263"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a dog drinks from the utensil of anyone of you it is essential to wash it seven \ntimes.\"","reference":"Sahih al-Bukhari 172, Book 4, Hadith 38","grade":"","question #":"question #3","question":"What are the implications of cleanliness and purification in Islamic practice when it comes to interactions with animals?","id":"bukhari-4-264"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man saw a dog eating mud from (the severity of) \n     thirst. So, that man took a shoe (and filled it) with water and kept \n     on pouring the water for the dog till it quenched its thirst. So Allah\n     approved of his deed and made him to enter Paradise.\"","reference":"Sahih al-Bukhari 173, Book 4, Hadith 39","grade":"","question #":"question #3","question":"What lessons can be learned about the relationship between humans and animals from this story?","id":"bukhari-4-265"},{"hadith-eng":"My father said. \"During the lifetime of Allah's \n     Apostle, the dogs used to urinate, and pass through the mosques (come \n     and go), nevertheless they never used to sprinkle water on it (urine \n     of the dog.)\"","reference":"Sahih al-Bukhari 174, Book 4, Hadith 40","grade":"","question #":"question #3","question":"What does this narration imply about the ritual purity requirements concerning animal impurities in mosques?","id":"bukhari-4-266"},{"hadith-eng":"I asked the Prophet (about the hunting dogs) and he replied, \"If you let loose (with Allah's name) your \ntamed dog after a game and it hunts it, you may eat it, but if the dog eats of (that game) then do not eat \nit because the dog has hunted it for itself.\" I further said, \"Sometimes I send my dog for hunting and \nfind another dog with it. He said, \"Do not eat the game for you have mentioned Allah's name only on \nsending your dog and not the other dog.\"","reference":"Sahih al-Bukhari 175, Book 4, Hadith 41","grade":"","question #":"question #3","question":"What should be done if a hunting dog eats from the game it has caught?","id":"bukhari-4-267"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A person is considered in prayer as long as he is waiting for the prayer in the \nmosque as long as he does not do Hadath.\" A non-Arab man asked, \"O Abu Huraira! What is \nHadath?\" I replied, \"It is the passing of wind (from the anus) (that is one of the types of Hadath).","reference":"Sahih al-Bukhari 176, Book 4, Hadith 42","grade":"","question #":"question #3","question":"What is the meaning and implication of 'Hadath' in Islamic jurisprudence?","id":"bukhari-4-268"},{"hadith-eng":"My uncle said: The Prophet (ﷺ) said, \"One should not leave his prayer unless he hears sound or smells \nsomething.\"","reference":"Sahih al-Bukhari 177, Book 4, Hadith 43","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding doubts about breaking wudu during prayer?","id":"bukhari-4-269"},{"hadith-eng":"I used to get emotional urethral discharges frequently and felt shy to ask Allah's Messenger (ﷺ) about it. So I \nrequested Al-Miqdad bin Al-Aswad to ask (the Prophet (ﷺ) ) about it. Al-Miqdad asked him and he \nreplied, \"One has to perform ablution (after it).\"","reference":"Sahih al-Bukhari 178, Book 4, Hadith 44","grade":"","question #":"question #3","question":"What role did intermediaries play in conveying questions to the Prophet (ﷺ) when individuals felt hesitant to ask directly?","id":"bukhari-4-270"},{"hadith-eng":"I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman \nreplied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" \n`Uthman added, \"I heard it from Allah's Messenger (ﷺ).\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b \nabout it and they, too, gave the same reply. (This order was canceled later on and taking a bath \nbecame necessary for such cases).","reference":"Sahih al-Bukhari 179, Book 4, Hadith 45","grade":"","question #":"question #3","question":"What changes occurred in the rulings related to purification after certain actions?","id":"bukhari-4-271"},{"hadith-eng":"Allah's Messenger (ﷺ) sent for a Ansari man who came with water dropping from his head. The Prophet (ﷺ) said, \n\"Perhaps we have forced you to hurry up, haven't we?\" The Ansari replied, \"Yes.\" Allah's Messenger (ﷺ) \nfurther said, \"If you are forced to hurry up (during intercourse) or you do not discharge then ablution \nis due on you (This order was canceled later on, i.e. one has to take a bath).","reference":"Sahih al-Bukhari 180, Book 4, Hadith 46","grade":"","question #":"question #3","question":"What change occurred in the ruling about purification after intercourse according to this narration?","id":"bukhari-4-272"},{"hadith-eng":"\"When Allah's Messenger (ﷺ) departed from `Arafat, he turned towards a mountain pass where he answered \nthe call of nature. (After he had finished) I poured water and he performed ablution and then I said to \nhim, \"O Allah's Messenger (ﷺ)! Will you offer the prayer?\" He replied, \"The Musalla (place of the prayer) is \nahead of you (in Al-Muzdalifa).","reference":"Sahih al-Bukhari 181, Book 4, Hadith 47","grade":"","question #":"question #3","question":"How does the practice of ablution relate to the preparation for prayer in Islamic tradition?","id":"bukhari-4-273"},{"hadith-eng":"I was in the company of Allah's Messenger (ﷺ) on one of the journeys and he went out to answer the call of \nnature (and after he finished) I poured water and he performed ablution; he washed his face, forearms \nand passed his wet hand over his head and over the two Khuff (socks made from thick fabric or \nleather).","reference":"Sahih al-Bukhari 182, Book 4, Hadith 48","grade":"","question #":"question #3","question":"What are the steps involved in performing ablution as demonstrated by the Prophet Muhammad (ﷺ)?","id":"bukhari-4-274"},{"hadith-eng":"That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay \non the bed (cushion transversally) while Allah's Messenger (ﷺ) and his wife lay in the lengthwise direction of \nthe cushion. Allah's Messenger (ﷺ) slept till the middle of the night, either a bit before or a bit after it and \nthen woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten \nverses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution \nfrom it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the \nProphet had done. Then I went and stood by his side. He placed his right hand on my head and caught \nmy right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at \nand then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he \nlay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet (ﷺ) got up, offered a \ntwo light rak`at prayer and went out and led the Fajr prayer.","reference":"Sahih al-Bukhari 183, Book 4, Hadith 49","grade":"","question #":"question #3","question":"What can be learned from the Prophet Muhammad's (ﷺ) practice of performing ablution and prayer during the night?","id":"bukhari-4-275"},{"hadith-eng":"I came to `Aisha the wife of the Prophet (ﷺ) during the solar eclipse. The people were standing and \noffering the prayer and she was also praying. I asked her, \"What is wrong with the people?\" She \nbeckoned with her hand towards the sky and said, \"Subhan Allah.\" I asked her, \"Is there a sign?\" She \npointed out, \"Yes.\" So I, too, stood for the prayer till I fell unconscious and later on I poured water on \nmy head. After the prayer, Allah's Messenger (ﷺ) praised and glorified Allah and said, \"Just now I have seen \nsomething which I never saw before at this place of mine, including Paradise and Hell. I have been \ninspired (and have understood) that you will be put to trials in your graves and these trials will be like \nthe trials of Ad-Dajjal, or nearly like it (the sub narrator is not sure of what Asma' said). Angels will \ncome to every one of you and ask, 'What do you know about this man?' A believer will reply, 'He is \nMuhammad, Allah's Messenger (ﷺ) , and he came to us with self-evident truth and guidance. So we accepted \nhis teaching, believed and followed him.' Then the angels will say to him to sleep in peace as they \nhave come to know that he was a believer. On the other hand a hypocrite or a doubtful person will \nreply, 'I do not know but heard the people saying something and so I said the same.' \"","reference":"Sahih al-Bukhari 184, Book 4, Hadith 50","grade":"","question #":"question #3","question":"What role do angels play in questioning individuals in their graves about their faith?","id":"bukhari-4-276"},{"hadith-eng":"A person asked `Abdullah bin Zaid who was the grandfather of `Amr bin Yahya, \"Can you show me \nhow Allah's Messenger (ﷺ) used to perform ablution?\" `Abdullah bin Zaid replied in the affirmative and \nasked for water. He poured it on his hands and washed them twice, then he rinsed his mouth thrice and \nwashed his nose with water thrice by putting water in it and blowing it out. He washed his face thrice \nand after that he washed his forearms up to the elbows twice and then passed his wet hands over his \nhead from its front to its back and vice versa (beginning from the front and taking them to the back of \nhis head up to the nape of the neck and then brought them to the front again from where he had \nstarted) and washed his feet (up to the ankles).","reference":"Sahih al-Bukhari 185, Book 4, Hadith 51","grade":"","question #":"question #3","question":"What is the significance of washing the forearms up to the elbows in the process of ablution?","id":"bukhari-4-277"},{"hadith-eng":"My father saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. \n`Abdullah bin Zaid asked for earthenware pot containing water and in front of them performed \nablution like that of the Prophet (ﷺ) . He poured water from the pot over his hand and washed his hands \nthrice and then he put his hands in the pot and rinsed his mouth and washed his nose by putting water \nin it and then blowing it out with three handfuls of water. Again he put his hand in the water and \nwashed his face thrice and washed his forearms up to the elbows twice; and then put his hands in the \nwater and then passed them over his head by bringing them to the front and then to the rear of the \nhead once, and then he washed his feet up to the ankles.","reference":"Sahih al-Bukhari 186, Book 4, Hadith 52","grade":"","question #":"question #3","question":"What is the significance of washing each part of the body multiple times during ablution?","id":"bukhari-4-278"},{"hadith-eng":"Allah's Messenger (ﷺ) came to us at noon and water for ablution was brought to him. After he had performed \nablution, the remaining water was taken by the people and they started smearing their bodies with it \n(as a blessed thing). The Prophet (ﷺ) offered two rak`at of the Zuhr prayer and then two rak`at of the `Asr \nprayer while a short spear (or stick) was there (as a Sutra) in front of him.","reference":"Sahih al-Bukhari 187, Book 4, Hadith 53","grade":"","question #":"question #3","question":"What is the purpose of using a sutra during prayer according to Islamic tradition?","id":"bukhari-4-279"},{"hadith-eng":"The \nProphet asked for a tumbler containing water and washed both his hands and face in it and then threw \na mouthful of water in the tumbler and said to both of us (Abu Musa and Bilal), \"Drink from the \ntumbler and pour some of its water on your faces and chests.\"","reference":"Sahih al-Bukhari 188, Book 4, Hadith 54","grade":"","question #":"question #3","question":"What is the importance of following the Prophet's (ﷺ) instructions in daily practices for Muslims?","id":"bukhari-4-280"},{"hadith-eng":"Mahmud bin Ar-Rabi` who was the person on whose face the Prophet (ﷺ) had ejected a mouthful of water \nfrom his family's well while he was a boy, and `Urwa (on the authority of Al-Miswar and others) who \ntestified each other, said, \"Whenever the Prophet (ﷺ) , performed ablution, his companions were nearly \nfighting for the remains of the water.\"","reference":"Sahih al-Bukhari 189, Book 4, Hadith 55","grade":"","question #":"question #3","question":"What does the eagerness of the Prophet's companions for the remains of his ablution water indicate about their beliefs?","id":"bukhari-4-281"},{"hadith-eng":"My aunt took me to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! This son of my sister has got a disease \nin his legs.\" So he passed his hands on my head and prayed for Allah's blessings for me; then he \nperformed ablution and I drank from the remaining water. I stood behind him and saw the seal of \nProphethood between his shoulders, and it was like the \"Zir-al-Hijla\" (means the button of a small \ntent, but some said 'egg of a partridge.' etc.)","reference":"Sahih al-Bukhari 190, Book 4, Hadith 56","grade":"","question #":"question #3","question":"What is the importance of drinking the remaining water after the Prophet's ablution in this context?","id":"bukhari-4-282"},{"hadith-eng":"(on the authority of his father) `Abdullah bin Zaid poured water on his hands from a utensil containing \nwater and washed them and then with one handful of water he rinsed his mouth and cleaned his nose \nby putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and \nforearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, \nand washed his feet up to the ankles and said, \"This is the ablution of Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 191, Book 4, Hadith 57","grade":"","question #":"question #3","question":"What is the significance of washing the forearms up to the elbows in the process of ablution?","id":"bukhari-4-283"},{"hadith-eng":"My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the \nProphet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in \nfront of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in \nthe pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice \nwith three handfuls of water Again he put his hand in the water and washed his face thrice. After that \nhe put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand \nin the water and passed wet hands over his head by bringing them to the front and then to the back and \nonce more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet (ﷺ) in narration 191 above) had passed his wet hands on the head once only.","reference":"Sahih al-Bukhari 192, Book 4, Hadith 58","grade":"","question #":"question #3","question":"What is the significance of washing the forearms up to the elbows in the process of ablution?","id":"bukhari-4-284"},{"hadith-eng":"\"During the lifetime of Allah's Messenger (ﷺ) men and women used to perform ablution together.\"","reference":"Sahih al-Bukhari 193, Book 4, Hadith 59","grade":"","question #":"question #3","question":"What can be inferred about the norms of modesty and privacy from the practice of men and women performing ablution together during the Prophet's time?","id":"bukhari-4-285"},{"hadith-eng":"Allah's Messenger (ﷺ) came to visit me while I was sick and unconscious. He performed ablution and \nsprinkled the remaining water on me and I became conscious and said, \"O Allah's Messenger (ﷺ)! To whom \nwill my inheritance go as I have neither ascendants nor descendants?\" Then the Divine verses \nregarding Fara'id (inheritance) were revealed.","reference":"Sahih al-Bukhari 194, Book 4, Hadith 60","grade":"","question #":"question #3","question":"What is the significance of the Prophet's (ﷺ) actions in restoring consciousness to a sick person?","id":"bukhari-4-286"},{"hadith-eng":"It was the time for prayer, and those whose houses were near got up and went to their people (to \nperform ablution), and there remained some people (sitting). Then a painted stove pot (Mikhdab) \ncontaining water was brought to Allah's Messenger (ﷺ)s The pot was small, not broad enough for one to \nspread one's hand in; yet all the people performed ablution. (The sub narrator said, \"We asked Anas, \n'How many persons were you?' Anas replied 'We were eighty or more\"). (It was one of the miracles of \nAllah's Messenger (ﷺ)).","reference":"Sahih al-Bukhari 195, Book 4, Hadith 61","grade":"","question #":"question #3","question":"What can be learned about the communal practices of the early Muslim community during prayer times?","id":"bukhari-4-287"},{"hadith-eng":"Once the Prophet (ﷺ) asked for a tumbler containing water. He washed his hands and face in it and also \nthrew a mouthful of water in it.","reference":"Sahih al-Bukhari 196, Book 4, Hadith 62","grade":"","question #":"question #3","question":"What significance does washing hands and face hold in Islamic practices?","id":"bukhari-4-288"},{"hadith-eng":"Once Allah's Messenger (ﷺ) came to us and we brought out water for him in a brass pot. He performed \nablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet \nhands lightly over the head from front to rear and brought them to front again and washed his feet (up \nto the ankles).","reference":"Sahih al-Bukhari 197, Book 4, Hadith 63","grade":"","question #":"question #3","question":"What is the significance of passing wet hands over the head during ablution?","id":"bukhari-4-289"},{"hadith-eng":"When the ailment of the Prophet (ﷺ) became aggravated and his disease became severe, he asked his \nwives to permit him to be nursed (treated) in my house. So they gave him the permission. Then the \nProphet came (to my house) with the support of two men, and his legs were dragging on the ground, \nbetween `Abbas, and another man.\" 'Ubaidullah (the sub narrator) said, \"I informed `Abdullah bin \n`Abbas of what `Aisha said. Ibn `Abbas said: 'Do you know who was the other man?' I replied in the \nnegative. Ibn `Abbas said, 'He was `Ali (bin Abi Talib).\" `Aisha further said, \"When the Prophet (ﷺ) came \nto my house and his sickness became aggravated he ordered us to pour seven skins full of water on \nhim, so that he might give some advice to the people. So he was seated in a Mikhdab (brass tub) \nbelonging to Hafsa, the wife of the Prophet. Then, all of us started pouring water on him from the \nwater skins till he beckoned to us to stop and that we have done (what he wanted us to do). After that \nhe went out to the people.\"","reference":"Sahih al-Bukhari 198, Book 4, Hadith 64","grade":"","question #":"question #3","question":"What significance does the act of pouring water on the Prophet hold in this narration?","id":"bukhari-4-290"},{"hadith-eng":"(on the authority of his father) My uncle used to perform ablution extravagantly and once he asked \r\n`Abdullah bin Zaid to tell him how he had seen the Prophet (ﷺ) performing ablution. He asked for an \r\nearthenware pot containing water, and poured water from it on his hands and washed them thrice, and \r\nthen put his hand in the earthenware pot and rinsed his mouth and washed his nose by putting water in \r\nit and then blowing it out thrice with one handful of water; he again put his hand in the water and \r\ntook a handful of water and washed his face thrice, then washed his hands up to the elbows twice, and \r\ntook water with his hand, and passed it over his head from front to back and then from back to front, \r\nand then washed his feet (up to the ankles) and said, \"I saw the Prophet (ﷺ) performing ablution in that \r\nway.\"","reference":"Sahih al-Bukhari 199, Book 4, Hadith 65","grade":"","question #":"question #3","question":"What are the steps involved in performing ablution as demonstrated by the Prophet?","id":"bukhari-4-291"},{"hadith-eng":"Anas said, \"The Prophet (ﷺ) asked for water and a tumbler with a broad base and no so deep, containing a \nsmall quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' \nnoticed the water springing out from amongst his fingers.\" Anas added, ' estimated that the people \nwho performed ablution with it numbered between seventy to eighty.\"","reference":"Sahih al-Bukhari 200, Book 4, Hadith 66","grade":"","question #":"question #3","question":"What significance does the miracle of water flowing from the Prophet's fingers hold in Islamic tradition?","id":"bukhari-4-292"},{"hadith-eng":"The Prophet (ﷺ) used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and \nused to perform ablution with one Mudd of water.","reference":"Sahih al-Bukhari 201, Book 4, Hadith 67","grade":"","question #":"question #3","question":"What can be learned about the simplicity and moderation in the Prophet's (ﷺ) lifestyle from this narration?","id":"bukhari-4-293"},{"hadith-eng":"Sa`d bin Abi Waqqas said, \"The Prophet (ﷺ) passed wet hands over his Khuffs (socks made from thick \nfabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and \nadded, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about \nit.\"","reference":"Sahih al-Bukhari 202, Book 4, Hadith 68","grade":"","question #":"question #3","question":"Why is it important to verify the authenticity of a hadith through trusted sources?","id":"bukhari-4-294"},{"hadith-eng":"Once Allah's Messenger (ﷺ) went out to answer the call of nature and I followed him with a tumbler \ncontaining water, and when he finished, I poured water and he performed ablution and passed wet \nhands over his Khuffs (socks made from thick fabric or leather).","reference":"Sahih al-Bukhari 203, Book 4, Hadith 69","grade":"","question #":"question #3","question":"What are the conditions under which a Muslim can wipe over their socks instead of washing their feet during ablution?","id":"bukhari-4-295"},{"hadith-eng":"My father said, \"I saw the Prophet (ﷺ) passing wet hands over his Khuffs (socks made from thick fabric or \nleather).\"","reference":"Sahih al-Bukhari 204, Book 4, Hadith 70","grade":"","question #":"question #3","question":"What materials are considered permissible for socks when performing the act of wiping over them during ablution?","id":"bukhari-4-296"},{"hadith-eng":"My father said, \"I saw the Prophet (ﷺ) passing wet hands over his turban and Khuffs (socks made from \nthick fabric or leather).","reference":"Sahih al-Bukhari 205, Book 4, Hadith 71","grade":"","question #":"question #3","question":"What are the conditions under which a Muslim can wipe over their Khuffs instead of washing their feet during ablution?","id":"bukhari-4-297"},{"hadith-eng":"My father said, \"Once I was in the company of the Prophet (ﷺ) on a journey and I dashed to take off his \r\nKhuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them \r\nafter performing ablution. So he passed wet hands over them.","reference":"Sahih al-Bukhari 206, Book 4, Hadith 72","grade":"","question #":"question #3","question":"What conditions must be met for a person to wipe over their socks instead of washing their feet during ablution?","id":"bukhari-4-298"},{"hadith-eng":"Allah's Messenger (ﷺ) ate a piece of cooked mutton from the shoulder region and prayed without repeating \nablution.","reference":"Sahih al-Bukhari 207, Book 4, Hadith 73","grade":"","question #":"question #3","question":"What are the conditions under which ablution is not required before performing prayer?","id":"bukhari-4-299"},{"hadith-eng":"My father said, \"I saw Allah's Messenger (ﷺ) taking a piece of (cooked) mutton from the shoulder region and \nthen he was called for prayer. He put his knife down and prayed without repeating ablution.\"","reference":"Sahih al-Bukhari 208, Book 4, Hadith 74","grade":"","question #":"question #3","question":"What does this narration indicate about the necessity of repeating ablution after eating?","id":"bukhari-4-300"},{"hadith-eng":"In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached Sahba, a place near \r\nKhaibar, where Allah's Messenger (ﷺ) offered the `Asr prayer and asked for food. Nothing but saweeq  \r\nwas brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet (ﷺ) got up \r\nfor the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he \r\nthen prayed without repeating the ablution.","reference":"Sahih al-Bukhari 209, Book 4, Hadith 75","grade":"","question #":"question #3","question":"What can be learned from the Prophet's actions regarding the necessity of repeating ablution after eating?","id":"bukhari-4-301"},{"hadith-eng":"The Prophet (ﷺ) ate (a piece of) mutton from the shoulder region and then prayed without repeating the \nablution.","reference":"Sahih al-Bukhari 210, Book 4, Hadith 76","grade":"","question #":"question #3","question":"What actions are required before performing prayer if one has eaten meat, based on Islamic jurisprudence?","id":"bukhari-4-302"},{"hadith-eng":"Allah's Messenger (ﷺ) drank milk, rinsed his mouth and said, \"It has fat.\"","reference":"Sahih al-Bukhari 211, Book 4, Hadith 77","grade":"","question #":"question #3","question":"What can be inferred about the properties of milk from the actions of the Prophet (ﷺ)?","id":"bukhari-4-303"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his \nslumber is over because in praying while drowsy one does not know whether one is asking for \nforgiveness or for a bad thing for oneself.\"","reference":"Sahih al-Bukhari 212, Book 4, Hadith 78","grade":"","question #":"question #3","question":"What are the potential consequences of praying while drowsy?","id":"bukhari-4-304"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you feels drowsy while praying, he should sleep till he understands \nwhat he is saying (reciting).","reference":"Sahih al-Bukhari 213, Book 4, Hadith 79","grade":"","question #":"question #3","question":"How does sleep affect one's ability to concentrate during prayer?","id":"bukhari-4-305"},{"hadith-eng":"Anas said, \"The Prophet (ﷺ) used to perform ablution for every prayer.\" I asked Anas, \"What did you used to \r\ndo?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"","reference":"Sahih al-Bukhari 214, Book 4, Hadith 80","grade":"","question #":"question #3","question":"What is the significance of maintaining ablution in Islamic prayer practices?","id":"bukhari-4-306"},{"hadith-eng":"In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached As-Sahba' where \r\nAllah's Messenger (ﷺ) led the `Asr prayer and asked for the food. Nothing but saweeq was brought and \r\nwe ate it and drank (water). The Prophet (ﷺ) got up for the (Maghrib) Prayer, rinsed his mouth with water \r\nand then led the prayer without repeating the ablution.","reference":"Sahih al-Bukhari 215, Book 4, Hadith 81","grade":"","question #":"question #3","question":"What can be learned about the Prophet's actions regarding ablution and prayer from this event?","id":"bukhari-4-307"},{"hadith-eng":"Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices \nof two persons who were being tortured in their graves. The Prophet (ﷺ) said, \"These two persons are \nbeing tortured not for a major sin (to avoid).\" The Prophet (ﷺ) then added, \"Yes! (they are being tortured \nfor a major sin). Indeed, one of them never saved himself from being soiled with his urine while the \nother used to go about with calumnies (to make enmity between friends). The Prophet (ﷺ) then asked for a \ngreen leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why \nhe had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"","reference":"Sahih al-Bukhari 216, Book 4, Hadith 82","grade":"","question #":"question #3","question":"What significance does the Prophet's action of placing a green leaf on graves hold in Islamic tradition?","id":"bukhari-4-308"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to answer the call of nature, I used to bring water with which he used to \nclean his private parts.","reference":"Sahih al-Bukhari 217, Book 4, Hadith 83","grade":"","question #":"question #3","question":"What is the significance of using water for purification in Islamic teachings?","id":"bukhari-4-309"},{"hadith-eng":"The Prophet (ﷺ) once passed by two graves and said, \"These two persons are being tortured not for a \nmajor sin (to avoid). One of them never saved himself from being soiled with his urine, while the \nother used to go about with calumnies (to make enmity between friends).\" The Prophet (ﷺ) then took a \ngreen leaf of a date-palm tree, split it into (pieces) and fixed one on each grave. They said, \"O Allah's \nApostle! Why have you done so?\" He replied, \"I hope that their punishment might be lessened till \nthese (the pieces of the leaf) become dry.\" (See the footnote of Hadith 215).","reference":"Sahih al-Bukhari 218, Book 4, Hadith 84","grade":"","question #":"question #3","question":"What is the significance of the Prophet's action with the date-palm leaf in relation to the punishment of the deceased?","id":"bukhari-4-310"},{"hadith-eng":"The Prophet (ﷺ) saw a Bedouin making water in the mosque and told the people not to disturb him. When \nhe finished, the Prophet (ﷺ) asked for some water and poured it over (the urine).","reference":"Sahih al-Bukhari 219, Book 4, Hadith 85","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to educating others through his response to the Bedouin's actions?","id":"bukhari-4-311"},{"hadith-eng":"A Bedouin stood up and started making water in the mosque. The people caught him but the Prophet (ﷺ) \nordered them to leave him and to pour a bucket or a tumbler of water over the place where he had \npassed the urine. The Prophet (ﷺ) then said, \"You have been sent to make things easy and not to make \nthem difficult.\"","reference":"Sahih al-Bukhari 220, Book 4, Hadith 86","grade":"","question #":"question #3","question":"How does the principle of making things easy relate to the broader teachings of Islam?","id":"bukhari-4-312"},{"hadith-eng":"The Prophet (ﷺ) said as above (219).","reference":"Sahih al-Bukhari 221, Book 4, Hadith 87","grade":"","question #":"question #3","question":"What is the role of Sahih al-Bukhari in the compilation and preservation of hadiths?","id":"bukhari-4-313"},{"hadith-eng":"(the mother of faithful believers) A child was brought to Allah's Messenger (ﷺ) and it urinated on the \ngarment of the Prophet. The Prophet (ﷺ) asked for water and poured it over the soiled place.","reference":"Sahih al-Bukhari 222, Book 4, Hadith 88","grade":"","question #":"question #3","question":"What is the significance of using water for purification in Islamic practices?","id":"bukhari-4-314"},{"hadith-eng":"I brought my young son, who had not started eating (ordinary food) to Allah's Messenger (ﷺ) who took him \nand made him sit in his lap. The child urinated on the garment of the Prophet, so he asked for water \nand poured it over the soiled (area) and did not wash it.","reference":"Sahih al-Bukhari 223, Book 4, Hadith 89","grade":"","question #":"question #3","question":"How should one deal with impurities on clothing according to Islamic teachings?","id":"bukhari-4-315"},{"hadith-eng":"Once the Prophet (ﷺ) went to the dumps of some people and passed urine while standing. He then asked \nfor water and so I brought it to him and he performed ablution.","reference":"Sahih al-Bukhari 224, Book 4, Hadith 90","grade":"","question #":"question #3","question":"How does this narration illustrate the Prophet's (ﷺ) practice of cleanliness and purification?","id":"bukhari-4-316"},{"hadith-eng":"The Prophet (ﷺ) and I walked till we reached the dumps of some people. He stood, as any one of you \nstands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him \nand stood near his back till he finished.","reference":"Sahih al-Bukhari 225, Book 4, Hadith 91","grade":"","question #":"question #3","question":"What can be learned about the companionship and obedience of the Prophet's (ﷺ) companions from this incident?","id":"bukhari-4-317"},{"hadith-eng":"Abu Musa Al-Ash`ari used to lay great stress on the question of urination and he used to say, \"If \nanyone from Bani Israel happened to soil his clothes with urine, he used to cut that portion away.\" \nHearing that, Hudhaifa said to Abu Wail, \"I wish he (Abu Musa) didn't (lay great stress on that \nmatter).\" Hudhaifa added, \"Allah's Messenger (ﷺ) went to the dumps of some people and urinated while \nstanding.\"","reference":"Sahih al-Bukhari 226, Book 4, Hadith 92","grade":"","question #":"question #3","question":"What is the significance of the Prophet Muhammad (ﷺ) urinating while standing in Islamic teachings?","id":"bukhari-4-318"},{"hadith-eng":"A woman came to the Prophet (ﷺ) and said, \"If anyone of us gets menses in her clothes then what should \nshe do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it \nin order to remove the traces of blood and then pour water over it. Then she can pray in it.\"","reference":"Sahih al-Bukhari 227, Book 4, Hadith 93","grade":"","question #":"question #3","question":"What is the significance of removing traces of impurities before performing prayers in Islam?","id":"bukhari-4-319"},{"hadith-eng":"Fatima bint Abi Hubaish came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ) I get persistent bleeding \nfrom the uterus and do not become clean. Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied, \"No, \nbecause it is from a blood vessel and not the menses. So when your real menses begins give up your \nprayers and when it has finished wash off the blood (take a bath) and offer your prayers.\" Hisham (the \nsub narrator) narrated that his father had also said, (the Prophet (ﷺ) told her): \"Perform ablution for every \nprayer till the time of the next period comes.\"","reference":"Sahih al-Bukhari 228, Book 4, Hadith 94","grade":"","question #":"question #3","question":"What is the significance of performing ablution for each prayer during non-menstrual bleeding?","id":"bukhari-4-320"},{"hadith-eng":"I used to wash the traces of Janaba (semen) from the clothes of the Prophet (ﷺ) and he used to go for \nprayers while traces of water were still on it (water spots were still visible).","reference":"Sahih al-Bukhari 229, Book 4, Hadith 95","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) practices regarding cleanliness and prayer preparation?","id":"bukhari-4-321"},{"hadith-eng":"I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of \nAllah's Messenger (ﷺ) and he would go for the prayer while water spots were still visible. \"","reference":"Sahih al-Bukhari 230, Book 4, Hadith 96","grade":"","question #":"question #3","question":"What can be inferred about the permissibility of praying in clothes that have been cleaned but still show water spots?","id":"bukhari-4-322"},{"hadith-eng":"I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \n\"I used to wash it off the clothes of Allah's Messenger (ﷺ) and he would go for the prayers while water spots \nwere still visible on them.","reference":"Sahih al-Bukhari 231, Book 4, Hadith 97","grade":"","question #":"question #3","question":"What can be inferred about the permissibility of praying in clothes with visible water spots after washing impurities?","id":"bukhari-4-323"},{"hadith-eng":"I used \nto wash the semen off the clothes of the\nProphet (ﷺ) and even then I used to notice\none or more spots on them.","reference":"Sahih al-Bukhari 232, Book 4, Hadith 98","grade":"","question #":"question #3","question":"What can be inferred about the handling of impurities on clothing from this narration?","id":"bukhari-4-324"},{"hadith-eng":"Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So \nthe Prophet (ﷺ) ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a \nmedicine). So they went as directed and after they became healthy, they killed the shepherd of the \nProphet and drove away all the camels. The news reached the Prophet (ﷺ) early in the morning and he \nsent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their \nhands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were \nput in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \n\"Those people committed theft and murder, became infidels after embracing Islam and fought against \nAllah and His Apostle .\"","reference":"Sahih al-Bukhari 233, Book 4, Hadith 99","grade":"","question #":"question #3","question":"How does Islamic law address the issue of apostasy and rebellion against the Prophet and Allah?","id":"bukhari-4-325"},{"hadith-eng":"Prior to the construction of the mosque, the Prophet (ﷺ) offered the prayers at sheep-folds.","reference":"Sahih al-Bukhari 234, Book 4, Hadith 100","grade":"","question #":"question #3","question":"How did the early Muslims adapt their prayer practices before having a dedicated mosque?","id":"bukhari-4-326"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked regarding ghee (cooking butter) in which a mouse had fallen. He said, \n\"Take out the mouse and throw away the ghee around it and use the rest.\"","reference":"Sahih al-Bukhari 235, Book 4, Hadith 101","grade":"","question #":"question #3","question":"What is the significance of removing impurities from food in Islam?","id":"bukhari-4-327"},{"hadith-eng":"The Prophet (ﷺ) was asked regarding ghee in which a mouse had fallen. He said, \"Take out the mouse and \nthrow away the ghee around it (and use the rest.)\"","reference":"Sahih al-Bukhari 236, Book 4, Hadith 102","grade":"","question #":"question #3","question":"What is the significance of removing impurities from food in Islamic dietary laws?","id":"bukhari-4-328"},{"hadith-eng":"The Prophet (ﷺ) said, \"A wound which a Muslim receives in Allah's cause will appear on the Day of \nResurrection as it was at the time of infliction; blood will be flowing from the wound and its color will \nbe that of the blood but will smell like musk.\"","reference":"Sahih al-Bukhari 237, Book 4, Hadith 103","grade":"","question #":"question #3","question":"What does the hadith imply about the reward for those who are injured while striving in the path of Allah?","id":"bukhari-4-329"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (people to come in the world) but (will be) the \nforemost (on the Day of Resurrection).\"","reference":"Sahih al-Bukhari 238, Book 4, Hadith 104","grade":"","question #":"question #3","question":"What significance does the Day of Resurrection hold in Islamic belief according to this teaching?","id":"bukhari-4-330"},{"hadith-eng":"\"You should not pass urine in stagnant water which is not flowing then (you may need to) wash in it.\"","reference":"Sahih al-Bukhari 239, Book 4, Hadith 105","grade":"","question #":"question #3","question":"What are the potential consequences of using contaminated water for purification purposes?","id":"bukhari-4-331"},{"hadith-eng":"While Allah's Messenger (ﷺ) was prostrating (as stated below).Narrated `Abdullah bin Mas`ud:Once the Prophet (ﷺ) was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his \ncompanions. One of them said to the others, \"Who amongst you will bring the Abdominal contents \n(intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he \nprostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet (ﷺ) prostrated \nand then placed it on his back between his shoulders. I was watching but could not do any thing. I \nwish I had some people with me to hold out against them. They started laughing and falling on one \nanother. Allah's Messenger (ﷺ) was in prostration and he did not lift his head up till Fatima (Prophet's \ndaughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head \nand said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the \nProphet invoked Allah against them as they had a conviction that the prayers and invocations were \naccepted in this city (Mecca). The Prophet (ﷺ) said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba \nbin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned \nthe seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies \nof those persons who were counted by Allah's Messenger (ﷺ) in the Qalib (one of the wells) of Badr.","reference":"Sahih al-Bukhari 240, Book 4, Hadith 106","grade":"","question #":"question #3","question":"What was the significance of the Prophet's invocation against the Quraish in the context of this event?","id":"bukhari-4-332"},{"hadith-eng":"The Prophet (ﷺ) once spat in his clothes.","reference":"Sahih al-Bukhari 241, Book 4, Hadith 107","grade":"","question #":"question #3","question":"What lessons can be learned from the actions of the Prophet (ﷺ) regarding personal hygiene?","id":"bukhari-4-333"},{"hadith-eng":"The Prophet (ﷺ) said, \"All drinks that produce intoxication are Haram (forbidden to drink).","reference":"Sahih al-Bukhari 242, Book 4, Hadith 108","grade":"","question #":"question #3","question":"How does Islam define intoxicating drinks in terms of their permissibility?","id":"bukhari-4-334"},{"hadith-eng":"Sahl bin Sa`d As-Sa`idi, was asked by the people, \"With what was the wound of the Prophet (ﷺ) treated? \nSahl replied, \"None remains among the people living who knows that better than I. `Ali [??] used to \nbring water in his shield and Fatima used to wash the blood off his face. Then straw mat was burnt \nand the wound was filled with it.\"","reference":"Sahih al-Bukhari 243, Book 4, Hadith 109","grade":"","question #":"question #3","question":"What role did Ali and Fatima play in tending to the Prophet Muhammad (ﷺ) during his injury?","id":"bukhari-4-335"},{"hadith-eng":"My father said, \"I came to the Prophet (ﷺ) and saw him carrying a Siwak in his hand and cleansing his \nteeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"","reference":"Sahih al-Bukhari 244, Book 4, Hadith 110","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) actions regarding oral cleanliness?","id":"bukhari-4-336"},{"hadith-eng":"Whenever the Prophet (ﷺ) got up at night, he used to clean his mouth with Siwak.","reference":"Sahih al-Bukhari 245, Book 4, Hadith 111","grade":"","question #":"question #3","question":"What practices are recommended for Muslims to follow when waking up at night according to Islamic teachings?","id":"bukhari-4-337"},{"hadith-eng":"The Prophet (ﷺ) said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"","reference":"Sahih al-Bukhari 246, Book 4, Hadith 112","grade":"","question #":"question #3","question":"What can be learned about decision-making and guidance from dreams in Islamic tradition?","id":"bukhari-4-338"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your \nright side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu \nbikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all \nmy affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is \nno fleeing from You, and there is no place of protection and safety except with You O Allah! I believe \nin Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You \nhave sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let \nthe aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet (ﷺ) and when I \nreached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You \nhave revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet (ﷺ) said, \"No, (but say): \n'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"","reference":"Sahih al-Bukhari 247, Book 4, Hadith 113","grade":"","question #":"question #3","question":"Why is it important to recite specific supplications before sleeping in Islam?","id":"bukhari-4-339"}]