[{"hadith-eng":"While I was in the company of the Prophet (ﷺ) in one of his Ghazawat, he asked, \"What is wrong with \nyour camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, \nI took the camel to him in the morning and he paid me its price.","reference":"Sahih al-Bukhari 2385, Book 43, Hadith 1","grade":"","question #":"question #1","question":"What can be learned about the Prophet Muhammad's (ﷺ) interactions and transactions with his companions?","id":"bukhari-43-1"},{"hadith-eng":"When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from \nAswad that `Aisha had said, \"The Prophet (ﷺ) bought some foodstuff on credit from a Jew and mortgaged \nan iron armor to him.\"","reference":"Sahih al-Bukhari 2386, Book 43, Hadith 2","grade":"","question #":"question #1","question":"What does this narration indicate about the permissibility of engaging in credit transactions in Islam?","id":"bukhari-43-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes the money of the people with the intention of repaying it, Allah will \nrepay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"","reference":"Sahih al-Bukhari 2387, Book 43, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of intention when borrowing money from others?","id":"bukhari-43-3"},{"hadith-eng":"Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not \nlike to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains \nof it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar \nwhich I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have \nlittle reward in the Hereafter except those who spend their money here and there (in Allah's Cause), \nand they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a \nvoice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his \nreturn I said, \"O Allah's Messenger (ﷺ)! (What was) that noise which I heard?\" He said, \"Did you hear \nanything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers \ndies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such \nthings (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"","reference":"Sahih al-Bukhari 2388, Book 43, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of spending wealth in the cause of Allah according to Islamic teachings?","id":"bukhari-43-4"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If I had gold equal to the mountain of Uhud, it would not please me that it \nshould remain with me for more than three days, except an amount which I would keep for repaying \ndebts.\"","reference":"Sahih al-Bukhari 2389, Book 43, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of wealth in Islam and how should it be managed according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-43-5"},{"hadith-eng":"A man demanded his debts from Allah's Messenger (ﷺ) in such a rude manner that the companions of the \nProphet intended to harm him, but the Prophet (ﷺ) said, \"Leave him, no doubt, for he (the creditor) has the \nright to demand it (harshly). Buy a camel and give it to him.\" They said, \"The camel that is available \nis older than the camel he demands. \"The Prophet (ﷺ) said, \"Buy it and give it to him, for the best among \nyou are those who repay their debts handsomely. \"","reference":"Sahih al-Bukhari 2390, Book 43, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of repaying debts in a generous manner in Islam?","id":"bukhari-43-6"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your \nlife time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and \n(used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I \nheard the same (Hadith) from the Prophet.\"","reference":"Sahih al-Bukhari 2391, Book 43, Hadith 7","grade":"","question #":"question #1","question":"What actions can lead to forgiveness of sins according to Islamic teachings?","id":"bukhari-43-7"},{"hadith-eng":"A man came to the Prophet (ﷺ) and demanded a camel (the Prophet (ﷺ) owed him). Allah's Messenger (ﷺ) told his \ncompanions to give him (a camel). They said, \"We do not find except an older camel (than what he \ndemands). (The Prophet (ﷺ) ordered them to give him that camel). The man said, \"You have paid me in \nfull and may Allah also pay you in full.\" Allah's Messenger (ﷺ) said, \"Give him, for the best amongst the \npeople is he who repays his debts in the most handsome manner.\"","reference":"Sahih al-Bukhari 2392, Book 43, Hadith 8","grade":"","question #":"question #1","question":"What qualities make a person the best in terms of repaying debts?","id":"bukhari-43-8"},{"hadith-eng":"The Prophet (ﷺ) owed a camel of a certain age to a man who came to demand it back. The Prophet (ﷺ) \nordered his companions to give him. They looked for a camel of the same age but found nothing but a \ncamel one year older. The Prophet (ﷺ) told them to give it to him. The man said, \"You have paid me in \nfull, and may Allah pay you in full.\" The Prophet (ﷺ) said, \"The best amongst you is he who pays his \ndebts in the most handsome manner.\"","reference":"Sahih al-Bukhari 2393, Book 43, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of fulfilling debts in Islam according to the teachings of the Prophet (ﷺ)?","id":"bukhari-43-9"},{"hadith-eng":"I went to the Prophet (ﷺ) while he was in the Mosque. (Mas`ar thinks, that Jabir went in the forenoon.) \nAfter the Prophet (ﷺ) told me to pray two rak`at, he repaid me the debt he owed me and gave me an extra \namount.","reference":"Sahih al-Bukhari 2394, Book 43, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of performing two rak'ahs upon entering a mosque?","id":"bukhari-43-10"},{"hadith-eng":"My father was martyred on the day (of the battle) of Uhud, and he was in debt. His creditors \ndemanded their rights persistently. I went to the Prophet (and informed him about it). He told them to \ntake the fruits of my garden and exempt my father from the debts but they refused to do so. So, the \nProphet did not give them my garden and told me that he would come to me the next morning. He \ncame to us early in the morning and wandered among the date-palms and invoked Allah to bless their \nfruits. I then plucked the dates and paid the creditors, and there remained some of the dates for us.","reference":"Sahih al-Bukhari 2395, Book 43, Hadith 11","grade":"","question #":"question #1","question":"How can the invocation of blessings impact the yield of crops in Islamic teachings?","id":"bukhari-43-11"},{"hadith-eng":"When my father died he owed a Jew thirty Awsuq (of dates). I requested him to give me respite for \nrepaying but he refused. I requested Allah's Messenger (ﷺ) to intercede with the Jew. Allah's Messenger (ﷺ) went to \nthe Jew and asked him to accept the fruits of my trees in place of the debt but the Jew refused. Allah's \nApostle entered the garden of the date-palms, wandering among the trees and ordered me (saying), \n\"Pluck (the fruits) and give him his due.\" So, I plucked the fruits for him after the departure of Allah's \nApostle and gave his thirty Awsuq, and still had seventeen Awsuq extra for myself. Jabir said: I went \nto Allah's Messenger (ﷺ) to inform of what had happened, but found him praying the `Asr prayer. After the \nprayer I told him about the extra fruits which remained. Allah's Messenger (ﷺ) told me to inform (`Umar) Ibn \nAl-Khattab about it. When I went to `Umar and told him about it, `Umar said, \"When Allah's Messenger (ﷺ) \nwalked in your garden, I was sure that Allah would definitely bless it.\"","reference":"Sahih al-Bukhari 2396, Book 43, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of seeking intercession from the Prophet in resolving financial disputes?","id":"bukhari-43-12"},{"hadith-eng":"Allah's Messenger (ﷺ) used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all \nsins, and from being in debt.\" Someone said, O Allah's Messenger (ﷺ)! (I see you) very often you seek refuge \nwith Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and \nbreaks his promises when he promises.\"","reference":"Sahih al-Bukhari 2397, Book 43, Hadith 13","grade":"","question #":"question #1","question":"What are the spiritual and moral dangers associated with being in debt according to Islamic teachings?","id":"bukhari-43-13"},{"hadith-eng":"The Prophet (ﷺ) said, \"If someone leaves some property, it will be for the inheritors, and if he leaves some \nweak offspring, it will be for us to support them.\"","reference":"Sahih al-Bukhari 2398, Book 43, Hadith 14","grade":"","question #":"question #1","question":"What is the Islamic perspective on the distribution of a deceased person's property?","id":"bukhari-43-14"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am closer to the believers than their selves in this world and in the Hereafter, and \nif you like, you can read Allah's Statement: \"The Prophet (ﷺ) is closer to the believers than their own \nselves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors \n(from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they \nshould come to me as I am the guardian of the deceased.\"","reference":"Sahih al-Bukhari 2399, Book 43, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of the Prophet's closeness to the believers in both this world and the Hereafter?","id":"bukhari-43-15"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"","reference":"Sahih al-Bukhari 2400, Book 43, Hadith 16","grade":"","question #":"question #1","question":"What is considered an injustice when it comes to repaying debts according to Islamic teachings?","id":"bukhari-43-16"},{"hadith-eng":"A man came to the Prophet (ﷺ) and demanded his debts and used harsh words. The companions of the \nProphet wanted to harm him, but the Prophet (ﷺ) said, \"Leave him, as the creditor (owner of the right) has \nthe right to speak.\"","reference":"Sahih al-Bukhari 2401, Book 43, Hadith 17","grade":"","question #":"question #1","question":"What rights does a creditor have when demanding repayment of a debt in Islam?","id":"bukhari-43-17"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a man finds his very things with a bankrupt, he has more right to take them \nback than anyone else.\"","reference":"Sahih al-Bukhari 2402, Book 43, Hadith 18","grade":"","question #":"question #1","question":"What rights does a person have over their belongings if they find them with someone who is bankrupt?","id":"bukhari-43-18"},{"hadith-eng":"A man pledged that his slave would be manumitted after his death. The Prophet (ﷺ) asked, \"Who will buy \nthe slave from me?\" Nu'aim bin `Abdullah bought the slave and the Prophet (ﷺ) took its price and gave it \nto the owner.","reference":"Sahih al-Bukhari 2403, Book 43, Hadith 19","grade":"","question #":"question #1","question":"What is the Islamic ruling on manumitting a slave after the owner's death?","id":"bukhari-43-19"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned an Israeli man who asked another Israeli to lend him money, and the latter gave it to him for a fixed period. (Abu Hurairah mentioned the rest of narration) [See  chapter: Kafala in loans and debts. Hadith 2291]","reference":"Sahih al-Bukhari 2404, Book 43, Hadith 20","grade":"","question #":"question #1","question":"What are the ethical considerations in lending and borrowing money according to Islamic teachings?","id":"bukhari-43-20"},{"hadith-eng":"When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.","reference":"Sahih al-Bukhari 2405, 2406, Book 43, Hadith 21","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) assist in resolving debts left by a deceased person?","id":"bukhari-43-21"},{"hadith-eng":"When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.","reference":"Sahih al-Bukhari 2405, 2406, Book 43, Hadith 21","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) assist in resolving debts and what was the outcome of his intervention?","id":"bukhari-43-22"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am often betrayed in bargaining.\" The Prophet (ﷺ) advised him, \n\"When you buy something, say (to the seller), 'No deception.\" The man used to say so afterwards.","reference":"Sahih al-Bukhari 2407, Book 43, Hadith 22","grade":"","question #":"question #1","question":"What advice did the Prophet give to someone who frequently experiences deception in business transactions?","id":"bukhari-43-23"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your \ndaughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men \n(begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, \n(2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by \nextravagance).","reference":"Sahih al-Bukhari 2408, Book 43, Hadith 23","grade":"","question #":"question #1","question":"What are the actions that Allah has forbidden according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-43-24"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian, and responsible for what is in his \ncustody. The ruler is a guardian of his subjects and responsible for them; a husband is a guardian of \nhis family and is responsible for it; a lady is a guardian of her husband's house and is responsible for \nit, and a servant is a guardian of his master's property and is responsible for it.\" I heard that from \nAllah's Messenger (ﷺ) and I think that the Prophet (ﷺ) also said, \"A man is a guardian of is father's property and \nis responsible for it, so all of you are guardians and responsible for your wards and things under your \ncare.\"","reference":"Sahih al-Bukhari 2409, Book 43, Hadith 24","grade":"","question #":"question #1","question":"What are the responsibilities of a ruler towards their subjects in Islam?","id":"bukhari-43-25"},{"hadith-eng":"While I was in the company of the Prophet (ﷺ) in one of his Ghazawat, he asked, \"What is wrong with \nyour camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, \nI took the camel to him in the morning and he paid me its price.","reference":"Sahih al-Bukhari 2385, Book 43, Hadith 1","grade":"","question #":"question #2","question":"How does this narration illustrate the principles of honesty and fairness in trade?","id":"bukhari-43-26"},{"hadith-eng":"When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from \nAswad that `Aisha had said, \"The Prophet (ﷺ) bought some foodstuff on credit from a Jew and mortgaged \nan iron armor to him.\"","reference":"Sahih al-Bukhari 2386, Book 43, Hadith 2","grade":"","question #":"question #2","question":"How does this narration illustrate the practice of mortgaging in Islamic financial transactions?","id":"bukhari-43-27"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes the money of the people with the intention of repaying it, Allah will \nrepay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"","reference":"Sahih al-Bukhari 2387, Book 43, Hadith 3","grade":"","question #":"question #2","question":"How does one's intention affect the outcome of financial transactions according to Islamic teachings?","id":"bukhari-43-28"},{"hadith-eng":"Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not \nlike to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains \nof it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar \nwhich I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have \nlittle reward in the Hereafter except those who spend their money here and there (in Allah's Cause), \nand they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a \nvoice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his \nreturn I said, \"O Allah's Messenger (ﷺ)! (What was) that noise which I heard?\" He said, \"Did you hear \nanything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers \ndies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such \nthings (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"","reference":"Sahih al-Bukhari 2388, Book 43, Hadith 4","grade":"","question #":"question #2","question":"How does the concept of wealth and its use relate to one's reward in the Hereafter?","id":"bukhari-43-29"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If I had gold equal to the mountain of Uhud, it would not please me that it \nshould remain with me for more than three days, except an amount which I would keep for repaying \ndebts.\"","reference":"Sahih al-Bukhari 2389, Book 43, Hadith 5","grade":"","question #":"question #2","question":"How does the concept of debt repayment reflect on a Muslim's financial responsibilities and priorities?","id":"bukhari-43-30"},{"hadith-eng":"A man demanded his debts from Allah's Messenger (ﷺ) in such a rude manner that the companions of the \nProphet intended to harm him, but the Prophet (ﷺ) said, \"Leave him, no doubt, for he (the creditor) has the \nright to demand it (harshly). Buy a camel and give it to him.\" They said, \"The camel that is available \nis older than the camel he demands. \"The Prophet (ﷺ) said, \"Buy it and give it to him, for the best among \nyou are those who repay their debts handsomely. \"","reference":"Sahih al-Bukhari 2390, Book 43, Hadith 6","grade":"","question #":"question #2","question":"How should one respond to a creditor who demands repayment in a harsh manner?","id":"bukhari-43-31"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your \nlife time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and \n(used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I \nheard the same (Hadith) from the Prophet.\"","reference":"Sahih al-Bukhari 2391, Book 43, Hadith 7","grade":"","question #":"question #2","question":"How does Islam view the treatment of debtors, especially those who are poor?","id":"bukhari-43-32"},{"hadith-eng":"A man came to the Prophet (ﷺ) and demanded a camel (the Prophet (ﷺ) owed him). Allah's Messenger (ﷺ) told his \ncompanions to give him (a camel). They said, \"We do not find except an older camel (than what he \ndemands). (The Prophet (ﷺ) ordered them to give him that camel). The man said, \"You have paid me in \nfull and may Allah also pay you in full.\" Allah's Messenger (ﷺ) said, \"Give him, for the best amongst the \npeople is he who repays his debts in the most handsome manner.\"","reference":"Sahih al-Bukhari 2392, Book 43, Hadith 8","grade":"","question #":"question #2","question":"How should one handle a situation where the exact repayment is not available?","id":"bukhari-43-33"},{"hadith-eng":"The Prophet (ﷺ) owed a camel of a certain age to a man who came to demand it back. The Prophet (ﷺ) \nordered his companions to give him. They looked for a camel of the same age but found nothing but a \ncamel one year older. The Prophet (ﷺ) told them to give it to him. The man said, \"You have paid me in \nfull, and may Allah pay you in full.\" The Prophet (ﷺ) said, \"The best amongst you is he who pays his \ndebts in the most handsome manner.\"","reference":"Sahih al-Bukhari 2393, Book 43, Hadith 9","grade":"","question #":"question #2","question":"How does the Prophet (ﷺ) exemplify the importance of generosity and fairness in transactions?","id":"bukhari-43-34"},{"hadith-eng":"I went to the Prophet (ﷺ) while he was in the Mosque. (Mas`ar thinks, that Jabir went in the forenoon.) \nAfter the Prophet (ﷺ) told me to pray two rak`at, he repaid me the debt he owed me and gave me an extra \namount.","reference":"Sahih al-Bukhari 2394, Book 43, Hadith 10","grade":"","question #":"question #2","question":"How does Islam view the repayment of debts and the importance of fulfilling financial obligations?","id":"bukhari-43-35"},{"hadith-eng":"My father was martyred on the day (of the battle) of Uhud, and he was in debt. His creditors \ndemanded their rights persistently. I went to the Prophet (and informed him about it). He told them to \ntake the fruits of my garden and exempt my father from the debts but they refused to do so. So, the \nProphet did not give them my garden and told me that he would come to me the next morning. He \ncame to us early in the morning and wandered among the date-palms and invoked Allah to bless their \nfruits. I then plucked the dates and paid the creditors, and there remained some of the dates for us.","reference":"Sahih al-Bukhari 2395, Book 43, Hadith 11","grade":"","question #":"question #2","question":"What is the significance of the Prophet's involvement in resolving financial debts in Islamic tradition?","id":"bukhari-43-36"},{"hadith-eng":"When my father died he owed a Jew thirty Awsuq (of dates). I requested him to give me respite for \nrepaying but he refused. I requested Allah's Messenger (ﷺ) to intercede with the Jew. Allah's Messenger (ﷺ) went to \nthe Jew and asked him to accept the fruits of my trees in place of the debt but the Jew refused. Allah's \nApostle entered the garden of the date-palms, wandering among the trees and ordered me (saying), \n\"Pluck (the fruits) and give him his due.\" So, I plucked the fruits for him after the departure of Allah's \nApostle and gave his thirty Awsuq, and still had seventeen Awsuq extra for myself. Jabir said: I went \nto Allah's Messenger (ﷺ) to inform of what had happened, but found him praying the `Asr prayer. After the \nprayer I told him about the extra fruits which remained. Allah's Messenger (ﷺ) told me to inform (`Umar) Ibn \nAl-Khattab about it. When I went to `Umar and told him about it, `Umar said, \"When Allah's Messenger (ﷺ) \nwalked in your garden, I was sure that Allah would definitely bless it.\"","reference":"Sahih al-Bukhari 2396, Book 43, Hadith 12","grade":"","question #":"question #2","question":"How can divine blessings manifest in resolving debts and financial matters?","id":"bukhari-43-37"},{"hadith-eng":"Allah's Messenger (ﷺ) used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all \nsins, and from being in debt.\" Someone said, O Allah's Messenger (ﷺ)! (I see you) very often you seek refuge \nwith Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and \nbreaks his promises when he promises.\"","reference":"Sahih al-Bukhari 2397, Book 43, Hadith 13","grade":"","question #":"question #2","question":"Why is seeking refuge from debt emphasized in the prayers of the Prophet Muhammad (ﷺ)?","id":"bukhari-43-38"},{"hadith-eng":"The Prophet (ﷺ) said, \"If someone leaves some property, it will be for the inheritors, and if he leaves some \nweak offspring, it will be for us to support them.\"","reference":"Sahih al-Bukhari 2398, Book 43, Hadith 14","grade":"","question #":"question #2","question":"How does Islam address the care of weak or vulnerable offspring after the death of a parent?","id":"bukhari-43-39"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am closer to the believers than their selves in this world and in the Hereafter, and \nif you like, you can read Allah's Statement: \"The Prophet (ﷺ) is closer to the believers than their own \nselves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors \n(from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they \nshould come to me as I am the guardian of the deceased.\"","reference":"Sahih al-Bukhari 2399, Book 43, Hadith 15","grade":"","question #":"question #2","question":"How does the Prophet's role as a guardian manifest in the context of a believer's debts and needy offspring?","id":"bukhari-43-40"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"","reference":"Sahih al-Bukhari 2400, Book 43, Hadith 16","grade":"","question #":"question #2","question":"How does wealth impact the obligation of repaying debts in Islam?","id":"bukhari-43-41"},{"hadith-eng":"A man came to the Prophet (ﷺ) and demanded his debts and used harsh words. The companions of the \nProphet wanted to harm him, but the Prophet (ﷺ) said, \"Leave him, as the creditor (owner of the right) has \nthe right to speak.\"","reference":"Sahih al-Bukhari 2401, Book 43, Hadith 17","grade":"","question #":"question #2","question":"How should one respond to harsh words or demands from others according to Islamic teachings?","id":"bukhari-43-42"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a man finds his very things with a bankrupt, he has more right to take them \nback than anyone else.\"","reference":"Sahih al-Bukhari 2402, Book 43, Hadith 18","grade":"","question #":"question #2","question":"How does Islamic law address the issue of reclaiming property from a bankrupt individual?","id":"bukhari-43-43"},{"hadith-eng":"A man pledged that his slave would be manumitted after his death. The Prophet (ﷺ) asked, \"Who will buy \nthe slave from me?\" Nu'aim bin `Abdullah bought the slave and the Prophet (ﷺ) took its price and gave it \nto the owner.","reference":"Sahih al-Bukhari 2403, Book 43, Hadith 19","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle the situation of a pledged slave in this narration?","id":"bukhari-43-44"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned an Israeli man who asked another Israeli to lend him money, and the latter gave it to him for a fixed period. (Abu Hurairah mentioned the rest of narration) [See  chapter: Kafala in loans and debts. Hadith 2291]","reference":"Sahih al-Bukhari 2404, Book 43, Hadith 20","grade":"","question #":"question #2","question":"How does the story of the Israeli man illustrate the importance of fulfilling financial obligations?","id":"bukhari-43-45"},{"hadith-eng":"When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.","reference":"Sahih al-Bukhari 2405, 2406, Book 43, Hadith 21","grade":"","question #":"question #2","question":"What actions did the Prophet Muhammad (ﷺ) take to help a tired camel during a journey?","id":"bukhari-43-46"},{"hadith-eng":"When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.","reference":"Sahih al-Bukhari 2405, 2406, Book 43, Hadith 21","grade":"","question #":"question #2","question":"What considerations might influence a person's decision to marry a virgin or a matron, according to Islamic teachings?","id":"bukhari-43-47"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am often betrayed in bargaining.\" The Prophet (ﷺ) advised him, \n\"When you buy something, say (to the seller), 'No deception.\" The man used to say so afterwards.","reference":"Sahih al-Bukhari 2407, Book 43, Hadith 22","grade":"","question #":"question #2","question":"How can one protect themselves from being deceived in buying and selling according to Islamic teachings?","id":"bukhari-43-48"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your \ndaughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men \n(begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, \n(2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by \nextravagance).","reference":"Sahih al-Bukhari 2408, Book 43, Hadith 23","grade":"","question #":"question #2","question":"What behaviors are disliked by Allah as mentioned in the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-43-49"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian, and responsible for what is in his \ncustody. The ruler is a guardian of his subjects and responsible for them; a husband is a guardian of \nhis family and is responsible for it; a lady is a guardian of her husband's house and is responsible for \nit, and a servant is a guardian of his master's property and is responsible for it.\" I heard that from \nAllah's Messenger (ﷺ) and I think that the Prophet (ﷺ) also said, \"A man is a guardian of is father's property and \nis responsible for it, so all of you are guardians and responsible for your wards and things under your \ncare.\"","reference":"Sahih al-Bukhari 2409, Book 43, Hadith 24","grade":"","question #":"question #2","question":"How does Islam define the role of a husband in relation to his family?","id":"bukhari-43-50"},{"hadith-eng":"While I was in the company of the Prophet (ﷺ) in one of his Ghazawat, he asked, \"What is wrong with \nyour camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, \nI took the camel to him in the morning and he paid me its price.","reference":"Sahih al-Bukhari 2385, Book 43, Hadith 1","grade":"","question #":"question #3","question":"What does this incident reveal about the relationship between the Prophet Muhammad (ﷺ) and his companions during expeditions?","id":"bukhari-43-51"},{"hadith-eng":"When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from \nAswad that `Aisha had said, \"The Prophet (ﷺ) bought some foodstuff on credit from a Jew and mortgaged \nan iron armor to him.\"","reference":"Sahih al-Bukhari 2386, Book 43, Hadith 2","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's interactions with people of other faiths from this narration?","id":"bukhari-43-52"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes the money of the people with the intention of repaying it, Allah will \nrepay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"","reference":"Sahih al-Bukhari 2387, Book 43, Hadith 3","grade":"","question #":"question #3","question":"What are the consequences of taking money with the intention of not repaying it in Islam?","id":"bukhari-43-53"},{"hadith-eng":"Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not \nlike to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains \nof it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar \nwhich I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have \nlittle reward in the Hereafter except those who spend their money here and there (in Allah's Cause), \nand they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a \nvoice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his \nreturn I said, \"O Allah's Messenger (ﷺ)! (What was) that noise which I heard?\" He said, \"Did you hear \nanything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers \ndies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such \nthings (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"","reference":"Sahih al-Bukhari 2388, Book 43, Hadith 4","grade":"","question #":"question #3","question":"What assurance is given to those who worship Allah alone regarding their entry into Paradise?","id":"bukhari-43-54"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If I had gold equal to the mountain of Uhud, it would not please me that it \nshould remain with me for more than three days, except an amount which I would keep for repaying \ndebts.\"","reference":"Sahih al-Bukhari 2389, Book 43, Hadith 5","grade":"","question #":"question #3","question":"What lessons can be learned about the temporary nature of material possessions from the Prophet Muhammad's (ﷺ) perspective on wealth?","id":"bukhari-43-55"},{"hadith-eng":"A man demanded his debts from Allah's Messenger (ﷺ) in such a rude manner that the companions of the \nProphet intended to harm him, but the Prophet (ﷺ) said, \"Leave him, no doubt, for he (the creditor) has the \nright to demand it (harshly). Buy a camel and give it to him.\" They said, \"The camel that is available \nis older than the camel he demands. \"The Prophet (ﷺ) said, \"Buy it and give it to him, for the best among \nyou are those who repay their debts handsomely. \"","reference":"Sahih al-Bukhari 2390, Book 43, Hadith 6","grade":"","question #":"question #3","question":"What qualities are highlighted as important for a person who is repaying debts?","id":"bukhari-43-56"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your \nlife time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and \n(used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I \nheard the same (Hadith) from the Prophet.\"","reference":"Sahih al-Bukhari 2391, Book 43, Hadith 7","grade":"","question #":"question #3","question":"What is the significance of leniency and compassion in business transactions in Islam?","id":"bukhari-43-57"},{"hadith-eng":"A man came to the Prophet (ﷺ) and demanded a camel (the Prophet (ﷺ) owed him). Allah's Messenger (ﷺ) told his \ncompanions to give him (a camel). They said, \"We do not find except an older camel (than what he \ndemands). (The Prophet (ﷺ) ordered them to give him that camel). The man said, \"You have paid me in \nfull and may Allah also pay you in full.\" Allah's Messenger (ﷺ) said, \"Give him, for the best amongst the \npeople is he who repays his debts in the most handsome manner.\"","reference":"Sahih al-Bukhari 2392, Book 43, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of fulfilling one's obligations in Islam?","id":"bukhari-43-58"},{"hadith-eng":"The Prophet (ﷺ) owed a camel of a certain age to a man who came to demand it back. The Prophet (ﷺ) \nordered his companions to give him. They looked for a camel of the same age but found nothing but a \ncamel one year older. The Prophet (ﷺ) told them to give it to him. The man said, \"You have paid me in \nfull, and may Allah pay you in full.\" The Prophet (ﷺ) said, \"The best amongst you is he who pays his \ndebts in the most handsome manner.\"","reference":"Sahih al-Bukhari 2393, Book 43, Hadith 9","grade":"","question #":"question #3","question":"What qualities make a person the best in terms of settling debts according to Islamic teachings?","id":"bukhari-43-59"},{"hadith-eng":"I went to the Prophet (ﷺ) while he was in the Mosque. (Mas`ar thinks, that Jabir went in the forenoon.) \nAfter the Prophet (ﷺ) told me to pray two rak`at, he repaid me the debt he owed me and gave me an extra \namount.","reference":"Sahih al-Bukhari 2394, Book 43, Hadith 10","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) character in terms of generosity and fairness from this incident?","id":"bukhari-43-60"},{"hadith-eng":"My father was martyred on the day (of the battle) of Uhud, and he was in debt. His creditors \ndemanded their rights persistently. I went to the Prophet (and informed him about it). He told them to \ntake the fruits of my garden and exempt my father from the debts but they refused to do so. So, the \nProphet did not give them my garden and told me that he would come to me the next morning. He \ncame to us early in the morning and wandered among the date-palms and invoked Allah to bless their \nfruits. I then plucked the dates and paid the creditors, and there remained some of the dates for us.","reference":"Sahih al-Bukhari 2395, Book 43, Hadith 11","grade":"","question #":"question #3","question":"How does Islam address the issue of debt and the rights of creditors?","id":"bukhari-43-61"},{"hadith-eng":"When my father died he owed a Jew thirty Awsuq (of dates). I requested him to give me respite for \nrepaying but he refused. I requested Allah's Messenger (ﷺ) to intercede with the Jew. Allah's Messenger (ﷺ) went to \nthe Jew and asked him to accept the fruits of my trees in place of the debt but the Jew refused. Allah's \nApostle entered the garden of the date-palms, wandering among the trees and ordered me (saying), \n\"Pluck (the fruits) and give him his due.\" So, I plucked the fruits for him after the departure of Allah's \nApostle and gave his thirty Awsuq, and still had seventeen Awsuq extra for myself. Jabir said: I went \nto Allah's Messenger (ﷺ) to inform of what had happened, but found him praying the `Asr prayer. After the \nprayer I told him about the extra fruits which remained. Allah's Messenger (ﷺ) told me to inform (`Umar) Ibn \nAl-Khattab about it. When I went to `Umar and told him about it, `Umar said, \"When Allah's Messenger (ﷺ) \nwalked in your garden, I was sure that Allah would definitely bless it.\"","reference":"Sahih al-Bukhari 2396, Book 43, Hadith 12","grade":"","question #":"question #3","question":"What role does faith play in expecting blessings when the Prophet is involved in a situation?","id":"bukhari-43-62"},{"hadith-eng":"Allah's Messenger (ﷺ) used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all \nsins, and from being in debt.\" Someone said, O Allah's Messenger (ﷺ)! (I see you) very often you seek refuge \nwith Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and \nbreaks his promises when he promises.\"","reference":"Sahih al-Bukhari 2397, Book 43, Hadith 13","grade":"","question #":"question #3","question":"How can being in debt affect a person's honesty and reliability in fulfilling promises?","id":"bukhari-43-63"},{"hadith-eng":"The Prophet (ﷺ) said, \"If someone leaves some property, it will be for the inheritors, and if he leaves some \nweak offspring, it will be for us to support them.\"","reference":"Sahih al-Bukhari 2398, Book 43, Hadith 14","grade":"","question #":"question #3","question":"What responsibilities do Muslims have towards orphans and those in need within their community?","id":"bukhari-43-64"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am closer to the believers than their selves in this world and in the Hereafter, and \nif you like, you can read Allah's Statement: \"The Prophet (ﷺ) is closer to the believers than their own \nselves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors \n(from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they \nshould come to me as I am the guardian of the deceased.\"","reference":"Sahih al-Bukhari 2399, Book 43, Hadith 15","grade":"","question #":"question #3","question":"What does the Quranic verse 'The Prophet is closer to the believers than their own selves' imply about the relationship between the Prophet and the believers?","id":"bukhari-43-65"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"","reference":"Sahih al-Bukhari 2400, Book 43, Hadith 16","grade":"","question #":"question #3","question":"What are the ethical implications of delaying debt repayment in Islamic jurisprudence?","id":"bukhari-43-66"},{"hadith-eng":"A man came to the Prophet (ﷺ) and demanded his debts and used harsh words. The companions of the \nProphet wanted to harm him, but the Prophet (ﷺ) said, \"Leave him, as the creditor (owner of the right) has \nthe right to speak.\"","reference":"Sahih al-Bukhari 2401, Book 43, Hadith 17","grade":"","question #":"question #3","question":"What is the significance of patience and restraint in dealing with financial disputes in Islam?","id":"bukhari-43-67"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a man finds his very things with a bankrupt, he has more right to take them \nback than anyone else.\"","reference":"Sahih al-Bukhari 2402, Book 43, Hadith 18","grade":"","question #":"question #3","question":"What principles can be derived about ownership and financial responsibility from this teaching?","id":"bukhari-43-68"},{"hadith-eng":"A man pledged that his slave would be manumitted after his death. The Prophet (ﷺ) asked, \"Who will buy \nthe slave from me?\" Nu'aim bin `Abdullah bought the slave and the Prophet (ﷺ) took its price and gave it \nto the owner.","reference":"Sahih al-Bukhari 2403, Book 43, Hadith 19","grade":"","question #":"question #3","question":"What is the significance of selling a slave and distributing the price to the owner in Islamic teachings?","id":"bukhari-43-69"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned an Israeli man who asked another Israeli to lend him money, and the latter gave it to him for a fixed period. (Abu Hurairah mentioned the rest of narration) [See  chapter: Kafala in loans and debts. Hadith 2291]","reference":"Sahih al-Bukhari 2404, Book 43, Hadith 20","grade":"","question #":"question #3","question":"What lessons can be learned about trust and accountability from the interaction between the two Israeli men?","id":"bukhari-43-70"},{"hadith-eng":"When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.","reference":"Sahih al-Bukhari 2405, 2406, Book 43, Hadith 21","grade":"","question #":"question #3","question":"What considerations might influence the decision to marry a matron instead of a virgin in Islamic tradition?","id":"bukhari-43-71"},{"hadith-eng":"When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.","reference":"Sahih al-Bukhari 2405, 2406, Book 43, Hadith 21","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet Muhammad's (ﷺ) interaction with animals, as demonstrated in this narration?","id":"bukhari-43-72"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am often betrayed in bargaining.\" The Prophet (ﷺ) advised him, \n\"When you buy something, say (to the seller), 'No deception.\" The man used to say so afterwards.","reference":"Sahih al-Bukhari 2407, Book 43, Hadith 22","grade":"","question #":"question #3","question":"What phrase did the Prophet recommend using to prevent deception in trade?","id":"bukhari-43-73"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your \ndaughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men \n(begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, \n(2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by \nextravagance).","reference":"Sahih al-Bukhari 2408, Book 43, Hadith 23","grade":"","question #":"question #3","question":"How does Islam view the act of wasting wealth and engaging in vain talk?","id":"bukhari-43-74"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian, and responsible for what is in his \ncustody. The ruler is a guardian of his subjects and responsible for them; a husband is a guardian of \nhis family and is responsible for it; a lady is a guardian of her husband's house and is responsible for \nit, and a servant is a guardian of his master's property and is responsible for it.\" I heard that from \nAllah's Messenger (ﷺ) and I think that the Prophet (ﷺ) also said, \"A man is a guardian of is father's property and \nis responsible for it, so all of you are guardians and responsible for your wards and things under your \ncare.\"","reference":"Sahih al-Bukhari 2409, Book 43, Hadith 24","grade":"","question #":"question #3","question":"What responsibilities does a servant have towards their master's property according to Islamic teachings?","id":"bukhari-43-75"}]