[{"hadith-eng":"I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), \nhe said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, \nso I again went to the Prophet (ﷺ) who said, \"Make public announcement for another year.\" I did, but \nnone turned up to claim it. I went to him for the third time and he said, \"Keep the container and the \nstring which is used for its tying and count the money it contains and if its owner comes, give it to \nhim; otherwise, utilize it.\" \nThe sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't \nknow whether Ubai made the announcement for three years or just one year.' \"","reference":"Sahih al-Bukhari 2426, Book 45, Hadith 1","grade":"","question #":"question #1","question":"What steps should be taken when finding lost property according to Islamic teachings?","id":"bukhari-45-1"},{"hadith-eng":"A bedouin went to the Prophet (ﷺ) and asked him about picking up a lost thing. The Prophet (ﷺ) said, \"Make \npublic announcement about it for one year. Remember the description of its container and the string \nwith which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); \notherwise, utilize it.\" He said, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" The Prophet (ﷺ) said, \"It is \nfor you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost \ncamel?\" On that the face of the Prophet (ﷺ) became red (with anger) and said, \"You have nothing to do \nwith it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"","reference":"Sahih al-Bukhari 2427, Book 45, Hadith 2","grade":"","question #":"question #1","question":"What is the procedure for dealing with lost property according to Islamic teachings?","id":"bukhari-45-2"},{"hadith-eng":"Yazid Maula Al-Munba'ith heard Zaid bin Khalid al-Juham saying, \"The Prophet (ﷺ) was asked about \nLuqata. He said, 'Remember the description of its container and the string it is tied with, and announce \nit publicly for one year.' \" Yazid added, \"If nobody claims then the person who has found it can spend \nit, and it is regarded as a trust entrusted to him.\" Yahya said, \"I do not know whether the last sentences \nwere said by the Prophet (ﷺ) or by Yazid.\" Zaid further said, \"The Prophet (ﷺ) was asked, 'What about a lost \nsheep?' The Prophet (ﷺ) said, 'Take it, for it is for you or for your brother (i.e. its owner) or for the wolf.\" \nYazid added that it should also be announced publicly. The man then asked the Prophet (ﷺ) about a lost \ncamel. The Prophet (ﷺ) said, \"Leave it, as it has its feet, water container (reservoir), and it will reach a \nplace of water and eat trees till its owner finds it.\"","reference":"Sahih al-Bukhari 2428, Book 45, Hadith 3","grade":"","question #":"question #1","question":"What steps should be taken when finding a lost item to ensure it is returned to its rightful owner?","id":"bukhari-45-3"},{"hadith-eng":"A man came and asked Allah's Messenger (ﷺ) about picking a lost thing. The Prophet (ﷺ) said, \"Remember the \ndescription of its container and the string it is tied with, and make public announcement about it for \none year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then \nasked, \"What about a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, for your brother (i.e. its owner), or \nfor the wolf.\" He further asked, \"What about a lost camel?\" The Prophet (ﷺ) said, \"It is none of your \nconcern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat \nthe trees till its owner finds it.\"","reference":"Sahih al-Bukhari 2429, Book 45, Hadith 4","grade":"","question #":"question #1","question":"What steps should be taken when finding a lost item to ensure its rightful owner can reclaim it?","id":"bukhari-45-4"},{"hadith-eng":"Abu Hurairah (ra) said, \"Allah's Messenger (ﷺ) mentioned an Israeli man.\" Abu Hurairah then told the whole narration). (At the end of the narration it was mentioned that the creditor) went out to the sea, hoping that a boat might have brought his money. Suddenly he saw a piece of wood and he took it to his house to use as firewood. When he sawed it, he found his money and a letter in it. [See hadith No. 2291 for details]","reference":"Sahih al-Bukhari 2430, Book 45, Hadith 5","grade":"","question #":"question #1","question":"What lesson can be learned about trust and honesty from the story of the Israeli man and the creditor?","id":"bukhari-45-5"},{"hadith-eng":"The Prophet (ﷺ) passed a date fallen on the way and said, \"Were I not afraid that it may be from a Sadaqa \n(charitable gifts), I would have eaten it.\"","reference":"Sahih al-Bukhari 2431, Book 45, Hadith 6","grade":"","question #":"question #1","question":"What does this narration teach about the Prophet's (ﷺ) caution in consuming items that might belong to charity?","id":"bukhari-45-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"Sometimes when I return home and find a date fallen on my bed, I pick it up in order to eat it, but I fear that it might be from a Sadaqa, so I throw it.\"","reference":"Sahih al-Bukhari 2432, Book 45, Hadith 7","grade":"","question #":"question #1","question":"What does this narration teach about the importance of avoiding consuming items that may belong to charity?","id":"bukhari-45-7"},{"hadith-eng":"Allah's Messenger (ﷺ) also said, \"It (i.e., Makkah's) thorny bushes should not be uprooted and its game should not be chased, and picking up its fallen things is illegal except by  him who makes public announcement about it, and its grass should not be cut.\" 'Abbas said, \"O Allah's Messenger ! Except Idhkhir (a kind of grass).\" The Prophet (ﷺ) said, \"Except Idhkhir.\"","reference":"Sahih al-Bukhari 2433, Book 45, Hadith 8","grade":"","question #":"question #1","question":"What are the restrictions on uprooting plants and hunting animals in Makkah according to Islamic teachings?","id":"bukhari-45-8"},{"hadith-eng":"When Allah gave victory to His Apostle over the people of Mecca, Allah's Messenger (ﷺ) stood up among \nthe people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given \nauthority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and \nwas made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should \nnot be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed \nexcept for one who makes public announcement for it, and he whose relative is murdered has the \noption either to accept a compensation for it or to retaliate.\" Al-`Abbas said, \"Except Al-Idhkhir, for \nwe use it in our graves and houses.\" Allah's Messenger (ﷺ) said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, \nstood up and said, \"O Allah's Messenger (ﷺ)! Get it written for me.\" Allah's Messenger (ﷺ) said, \"Write it for Abu \nShah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's \nApostle?\" He replied, \"The speech which he had heard from Allah's Messenger (ﷺ) .\"","reference":"Sahih al-Bukhari 2434, Book 45, Hadith 9","grade":"","question #":"question #1","question":"What are the rules regarding fighting and violence in Mecca according to Islamic teachings?","id":"bukhari-45-9"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"An animal should not be milked without the permission of its owner. Does any \nof you like that somebody comes to his store and breaks his container and takes away his food? The \nudders of the animals are the stores of their owners where their provision is kept, so nobody should \nmilk the animals of somebody else, without the permission of its owner.\"","reference":"Sahih al-Bukhari 2435, Book 45, Hadith 10","grade":"","question #":"question #1","question":"Why is it important to seek the owner's permission before using their property?","id":"bukhari-45-10"},{"hadith-eng":"A man asked Allah's Messenger (ﷺ) about the Luqata. He said, \"Make public announcement of it for one \nyear, then remember the description of its container and the string it is tied with, utilize the money, \nand if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Messenger (ﷺ)! What \nabout a lost sheep?\" Allah's Messenger (ﷺ) said, \"Take it, for it is for you, for your brother, or for the wolf.\" \nThe man asked, \"O Allah's Messenger (ﷺ)! What about a lost camel?\" Allah's Messenger (ﷺ) got angry and his \ncheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, \ntill its owner finds it.\"","reference":"Sahih al-Bukhari 2436, Book 45, Hadith 11","grade":"","question #":"question #1","question":"What is the procedure for dealing with found property according to Islamic teachings?","id":"bukhari-45-11"},{"hadith-eng":"While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. \nOne of them told me to drop it but I refused to do so and said that I would give it to its owner if I \nfound him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I \nasked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of \nthe Prophet (ﷺ) and took it to the Prophet (ﷺ) who said to me, 'Make public announcement about it for one \nyear.' So, I announced it for one year and went to the Prophet (ﷺ) who said, 'Announce it publicly for \nanother year.' So, I announced it for another year. I went to him again and he said, \"Announce for an \nother year.\" So I announced for still another year. I went to the Prophet (ﷺ) for the fourth time, and he \nsaid, 'Remember the amount of money, the description of its container and the string it is tied with, \nand if the owner comes, give it to him; otherwise, utilize it.' \"","reference":"Sahih al-Bukhari 2437, Book 45, Hadith 12","grade":"","question #":"question #1","question":"What steps should be taken when finding lost property according to Islamic teachings?","id":"bukhari-45-12"},{"hadith-eng":"A bedouin asked the Prophet (ﷺ) about the Luqata. The Prophet (ﷺ) said, \"Make public announcement about it \nfor one year and if then somebody comes and describes the container of the Luqata and the string it \nwas tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet (ﷺ) about a lost camel. The \nface of the Prophet (ﷺ) become red and he said, \"You have o concern with it as it has its water reservoir \nand feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked \nthe Prophet (ﷺ) about a lost sheep. The Prophet (ﷺ) said, \"It is for you, for your brother, or for the wolf.\"","reference":"Sahih al-Bukhari 2438, Book 45, Hadith 14","grade":"","question #":"question #1","question":"What is the procedure for dealing with found property according to Islamic teachings?","id":"bukhari-45-13"},{"hadith-eng":"While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant \nhe was. He replied that he was the servant of a man from Quraish, and then he mentioned his name \nand I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \n\"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of \none of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. \nHe removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk \nfor Allah's Messenger (ﷺ) in a pot and closed its mouth with a piece of cloth and poured water over it till it \nbecame cold. I took it to the Prophet (ﷺ) and said, \"Drink, O Allah's Messenger (ﷺ)!\" He drank it till I was \npleased.","reference":"Sahih al-Bukhari 2439, Book 45, Hadith 15","grade":"","question #":"question #1","question":"What actions demonstrate care and respect when handling food or drink for someone else?","id":"bukhari-45-14"},{"hadith-eng":"I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), \nhe said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, \nso I again went to the Prophet (ﷺ) who said, \"Make public announcement for another year.\" I did, but \nnone turned up to claim it. I went to him for the third time and he said, \"Keep the container and the \nstring which is used for its tying and count the money it contains and if its owner comes, give it to \nhim; otherwise, utilize it.\" \nThe sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't \nknow whether Ubai made the announcement for three years or just one year.' \"","reference":"Sahih al-Bukhari 2426, Book 45, Hadith 1","grade":"","question #":"question #2","question":"How long should one make a public announcement for lost property before claiming it?","id":"bukhari-45-15"},{"hadith-eng":"A bedouin went to the Prophet (ﷺ) and asked him about picking up a lost thing. The Prophet (ﷺ) said, \"Make \npublic announcement about it for one year. Remember the description of its container and the string \nwith which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); \notherwise, utilize it.\" He said, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" The Prophet (ﷺ) said, \"It is \nfor you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost \ncamel?\" On that the face of the Prophet (ﷺ) became red (with anger) and said, \"You have nothing to do \nwith it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"","reference":"Sahih al-Bukhari 2427, Book 45, Hadith 2","grade":"","question #":"question #2","question":"How should one handle finding a lost sheep or camel in Islam?","id":"bukhari-45-16"},{"hadith-eng":"Yazid Maula Al-Munba'ith heard Zaid bin Khalid al-Juham saying, \"The Prophet (ﷺ) was asked about \nLuqata. He said, 'Remember the description of its container and the string it is tied with, and announce \nit publicly for one year.' \" Yazid added, \"If nobody claims then the person who has found it can spend \nit, and it is regarded as a trust entrusted to him.\" Yahya said, \"I do not know whether the last sentences \nwere said by the Prophet (ﷺ) or by Yazid.\" Zaid further said, \"The Prophet (ﷺ) was asked, 'What about a lost \nsheep?' The Prophet (ﷺ) said, 'Take it, for it is for you or for your brother (i.e. its owner) or for the wolf.\" \nYazid added that it should also be announced publicly. The man then asked the Prophet (ﷺ) about a lost \ncamel. The Prophet (ﷺ) said, \"Leave it, as it has its feet, water container (reservoir), and it will reach a \nplace of water and eat trees till its owner finds it.\"","reference":"Sahih al-Bukhari 2428, Book 45, Hadith 3","grade":"","question #":"question #2","question":"How should one handle a lost sheep according to Islamic teachings?","id":"bukhari-45-17"},{"hadith-eng":"A man came and asked Allah's Messenger (ﷺ) about picking a lost thing. The Prophet (ﷺ) said, \"Remember the \ndescription of its container and the string it is tied with, and make public announcement about it for \none year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then \nasked, \"What about a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, for your brother (i.e. its owner), or \nfor the wolf.\" He further asked, \"What about a lost camel?\" The Prophet (ﷺ) said, \"It is none of your \nconcern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat \nthe trees till its owner finds it.\"","reference":"Sahih al-Bukhari 2429, Book 45, Hadith 4","grade":"","question #":"question #2","question":"How should one handle a lost sheep according to Islamic teachings?","id":"bukhari-45-18"},{"hadith-eng":"Abu Hurairah (ra) said, \"Allah's Messenger (ﷺ) mentioned an Israeli man.\" Abu Hurairah then told the whole narration). (At the end of the narration it was mentioned that the creditor) went out to the sea, hoping that a boat might have brought his money. Suddenly he saw a piece of wood and he took it to his house to use as firewood. When he sawed it, he found his money and a letter in it. [See hadith No. 2291 for details]","reference":"Sahih al-Bukhari 2430, Book 45, Hadith 5","grade":"","question #":"question #2","question":"How does the story illustrate the concept of divine intervention in fulfilling promises?","id":"bukhari-45-19"},{"hadith-eng":"The Prophet (ﷺ) passed a date fallen on the way and said, \"Were I not afraid that it may be from a Sadaqa \n(charitable gifts), I would have eaten it.\"","reference":"Sahih al-Bukhari 2431, Book 45, Hadith 6","grade":"","question #":"question #2","question":"How does this narration reflect the importance of ensuring the rightful ownership of what one consumes?","id":"bukhari-45-20"},{"hadith-eng":"The Prophet (ﷺ) said, \"Sometimes when I return home and find a date fallen on my bed, I pick it up in order to eat it, but I fear that it might be from a Sadaqa, so I throw it.\"","reference":"Sahih al-Bukhari 2432, Book 45, Hadith 7","grade":"","question #":"question #2","question":"How does this narration illustrate the Prophet's (ﷺ) caution in ensuring the lawful consumption of food?","id":"bukhari-45-21"},{"hadith-eng":"Allah's Messenger (ﷺ) also said, \"It (i.e., Makkah's) thorny bushes should not be uprooted and its game should not be chased, and picking up its fallen things is illegal except by  him who makes public announcement about it, and its grass should not be cut.\" 'Abbas said, \"O Allah's Messenger ! Except Idhkhir (a kind of grass).\" The Prophet (ﷺ) said, \"Except Idhkhir.\"","reference":"Sahih al-Bukhari 2433, Book 45, Hadith 8","grade":"","question #":"question #2","question":"Why is it important to make a public announcement when picking up fallen items in Makkah?","id":"bukhari-45-22"},{"hadith-eng":"When Allah gave victory to His Apostle over the people of Mecca, Allah's Messenger (ﷺ) stood up among \nthe people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given \nauthority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and \nwas made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should \nnot be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed \nexcept for one who makes public announcement for it, and he whose relative is murdered has the \noption either to accept a compensation for it or to retaliate.\" Al-`Abbas said, \"Except Al-Idhkhir, for \nwe use it in our graves and houses.\" Allah's Messenger (ﷺ) said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, \nstood up and said, \"O Allah's Messenger (ﷺ)! Get it written for me.\" Allah's Messenger (ﷺ) said, \"Write it for Abu \nShah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's \nApostle?\" He replied, \"The speech which he had heard from Allah's Messenger (ﷺ) .\"","reference":"Sahih al-Bukhari 2434, Book 45, Hadith 9","grade":"","question #":"question #2","question":"What exceptions are made for the use of natural resources in Mecca, such as Al-Idhkhir?","id":"bukhari-45-23"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"An animal should not be milked without the permission of its owner. Does any \nof you like that somebody comes to his store and breaks his container and takes away his food? The \nudders of the animals are the stores of their owners where their provision is kept, so nobody should \nmilk the animals of somebody else, without the permission of its owner.\"","reference":"Sahih al-Bukhari 2435, Book 45, Hadith 10","grade":"","question #":"question #2","question":"What analogy is used to describe the importance of respecting others' property in this context?","id":"bukhari-45-24"},{"hadith-eng":"A man asked Allah's Messenger (ﷺ) about the Luqata. He said, \"Make public announcement of it for one \nyear, then remember the description of its container and the string it is tied with, utilize the money, \nand if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Messenger (ﷺ)! What \nabout a lost sheep?\" Allah's Messenger (ﷺ) said, \"Take it, for it is for you, for your brother, or for the wolf.\" \nThe man asked, \"O Allah's Messenger (ﷺ)! What about a lost camel?\" Allah's Messenger (ﷺ) got angry and his \ncheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, \ntill its owner finds it.\"","reference":"Sahih al-Bukhari 2436, Book 45, Hadith 11","grade":"","question #":"question #2","question":"How should one handle a lost sheep or camel based on the guidance of the Prophet Muhammad (ﷺ)?","id":"bukhari-45-25"},{"hadith-eng":"While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. \nOne of them told me to drop it but I refused to do so and said that I would give it to its owner if I \nfound him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I \nasked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of \nthe Prophet (ﷺ) and took it to the Prophet (ﷺ) who said to me, 'Make public announcement about it for one \nyear.' So, I announced it for one year and went to the Prophet (ﷺ) who said, 'Announce it publicly for \nanother year.' So, I announced it for another year. I went to him again and he said, \"Announce for an \nother year.\" So I announced for still another year. I went to the Prophet (ﷺ) for the fourth time, and he \nsaid, 'Remember the amount of money, the description of its container and the string it is tied with, \nand if the owner comes, give it to him; otherwise, utilize it.' \"","reference":"Sahih al-Bukhari 2437, Book 45, Hadith 12","grade":"","question #":"question #2","question":"How long should one announce the discovery of lost property before utilizing it if the owner does not claim it?","id":"bukhari-45-26"},{"hadith-eng":"A bedouin asked the Prophet (ﷺ) about the Luqata. The Prophet (ﷺ) said, \"Make public announcement about it \nfor one year and if then somebody comes and describes the container of the Luqata and the string it \nwas tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet (ﷺ) about a lost camel. The \nface of the Prophet (ﷺ) become red and he said, \"You have o concern with it as it has its water reservoir \nand feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked \nthe Prophet (ﷺ) about a lost sheep. The Prophet (ﷺ) said, \"It is for you, for your brother, or for the wolf.\"","reference":"Sahih al-Bukhari 2438, Book 45, Hadith 14","grade":"","question #":"question #2","question":"How should one handle a lost camel based on the guidance provided by the Prophet (ﷺ)?","id":"bukhari-45-27"},{"hadith-eng":"While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant \nhe was. He replied that he was the servant of a man from Quraish, and then he mentioned his name \nand I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \n\"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of \none of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. \nHe removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk \nfor Allah's Messenger (ﷺ) in a pot and closed its mouth with a piece of cloth and poured water over it till it \nbecame cold. I took it to the Prophet (ﷺ) and said, \"Drink, O Allah's Messenger (ﷺ)!\" He drank it till I was \npleased.","reference":"Sahih al-Bukhari 2439, Book 45, Hadith 15","grade":"","question #":"question #2","question":"How can one ensure cleanliness and hygiene when preparing milk or other consumables?","id":"bukhari-45-28"},{"hadith-eng":"I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), \nhe said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, \nso I again went to the Prophet (ﷺ) who said, \"Make public announcement for another year.\" I did, but \nnone turned up to claim it. I went to him for the third time and he said, \"Keep the container and the \nstring which is used for its tying and count the money it contains and if its owner comes, give it to \nhim; otherwise, utilize it.\" \nThe sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't \nknow whether Ubai made the announcement for three years or just one year.' \"","reference":"Sahih al-Bukhari 2426, Book 45, Hadith 1","grade":"","question #":"question #3","question":"What should be done with the found property if the owner does not claim it after the announcement period?","id":"bukhari-45-29"},{"hadith-eng":"A bedouin went to the Prophet (ﷺ) and asked him about picking up a lost thing. The Prophet (ﷺ) said, \"Make \npublic announcement about it for one year. Remember the description of its container and the string \nwith which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); \notherwise, utilize it.\" He said, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" The Prophet (ﷺ) said, \"It is \nfor you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost \ncamel?\" On that the face of the Prophet (ﷺ) became red (with anger) and said, \"You have nothing to do \nwith it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"","reference":"Sahih al-Bukhari 2427, Book 45, Hadith 2","grade":"","question #":"question #3","question":"What are the ethical considerations when claiming ownership of a found item in Islam?","id":"bukhari-45-30"},{"hadith-eng":"Yazid Maula Al-Munba'ith heard Zaid bin Khalid al-Juham saying, \"The Prophet (ﷺ) was asked about \nLuqata. He said, 'Remember the description of its container and the string it is tied with, and announce \nit publicly for one year.' \" Yazid added, \"If nobody claims then the person who has found it can spend \nit, and it is regarded as a trust entrusted to him.\" Yahya said, \"I do not know whether the last sentences \nwere said by the Prophet (ﷺ) or by Yazid.\" Zaid further said, \"The Prophet (ﷺ) was asked, 'What about a lost \nsheep?' The Prophet (ﷺ) said, 'Take it, for it is for you or for your brother (i.e. its owner) or for the wolf.\" \nYazid added that it should also be announced publicly. The man then asked the Prophet (ﷺ) about a lost \ncamel. The Prophet (ﷺ) said, \"Leave it, as it has its feet, water container (reservoir), and it will reach a \nplace of water and eat trees till its owner finds it.\"","reference":"Sahih al-Bukhari 2428, Book 45, Hadith 3","grade":"","question #":"question #3","question":"What is the guidance on dealing with a lost camel in Islam?","id":"bukhari-45-31"},{"hadith-eng":"A man came and asked Allah's Messenger (ﷺ) about picking a lost thing. The Prophet (ﷺ) said, \"Remember the \ndescription of its container and the string it is tied with, and make public announcement about it for \none year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then \nasked, \"What about a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, for your brother (i.e. its owner), or \nfor the wolf.\" He further asked, \"What about a lost camel?\" The Prophet (ﷺ) said, \"It is none of your \nconcern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat \nthe trees till its owner finds it.\"","reference":"Sahih al-Bukhari 2429, Book 45, Hadith 4","grade":"","question #":"question #3","question":"Why is it advised not to interfere with a lost camel, and what are its natural survival abilities?","id":"bukhari-45-32"},{"hadith-eng":"Abu Hurairah (ra) said, \"Allah's Messenger (ﷺ) mentioned an Israeli man.\" Abu Hurairah then told the whole narration). (At the end of the narration it was mentioned that the creditor) went out to the sea, hoping that a boat might have brought his money. Suddenly he saw a piece of wood and he took it to his house to use as firewood. When he sawed it, he found his money and a letter in it. [See hadith No. 2291 for details]","reference":"Sahih al-Bukhari 2430, Book 45, Hadith 5","grade":"","question #":"question #3","question":"What significance does the piece of wood hold in the story of the Israeli man and the creditor?","id":"bukhari-45-33"},{"hadith-eng":"The Prophet (ﷺ) passed a date fallen on the way and said, \"Were I not afraid that it may be from a Sadaqa \n(charitable gifts), I would have eaten it.\"","reference":"Sahih al-Bukhari 2431, Book 45, Hadith 6","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) attitude towards consuming potentially doubtful items?","id":"bukhari-45-34"},{"hadith-eng":"The Prophet (ﷺ) said, \"Sometimes when I return home and find a date fallen on my bed, I pick it up in order to eat it, but I fear that it might be from a Sadaqa, so I throw it.\"","reference":"Sahih al-Bukhari 2432, Book 45, Hadith 7","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to handling doubts regarding the source of food?","id":"bukhari-45-35"},{"hadith-eng":"Allah's Messenger (ﷺ) also said, \"It (i.e., Makkah's) thorny bushes should not be uprooted and its game should not be chased, and picking up its fallen things is illegal except by  him who makes public announcement about it, and its grass should not be cut.\" 'Abbas said, \"O Allah's Messenger ! Except Idhkhir (a kind of grass).\" The Prophet (ﷺ) said, \"Except Idhkhir.\"","reference":"Sahih al-Bukhari 2433, Book 45, Hadith 8","grade":"","question #":"question #3","question":"What exception did the Prophet Muhammad (ﷺ) make regarding the cutting of grass in Makkah?","id":"bukhari-45-36"},{"hadith-eng":"When Allah gave victory to His Apostle over the people of Mecca, Allah's Messenger (ﷺ) stood up among \nthe people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given \nauthority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and \nwas made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should \nnot be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed \nexcept for one who makes public announcement for it, and he whose relative is murdered has the \noption either to accept a compensation for it or to retaliate.\" Al-`Abbas said, \"Except Al-Idhkhir, for \nwe use it in our graves and houses.\" Allah's Messenger (ﷺ) said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, \nstood up and said, \"O Allah's Messenger (ﷺ)! Get it written for me.\" Allah's Messenger (ﷺ) said, \"Write it for Abu \nShah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's \nApostle?\" He replied, \"The speech which he had heard from Allah's Messenger (ﷺ) .\"","reference":"Sahih al-Bukhari 2434, Book 45, Hadith 9","grade":"","question #":"question #3","question":"How does the concept of compensation or retaliation apply in cases of murder according to this teaching?","id":"bukhari-45-37"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"An animal should not be milked without the permission of its owner. Does any \nof you like that somebody comes to his store and breaks his container and takes away his food? The \nudders of the animals are the stores of their owners where their provision is kept, so nobody should \nmilk the animals of somebody else, without the permission of its owner.\"","reference":"Sahih al-Bukhari 2435, Book 45, Hadith 10","grade":"","question #":"question #3","question":"How does this teaching emphasize the concept of ownership and personal rights in Islam?","id":"bukhari-45-38"},{"hadith-eng":"A man asked Allah's Messenger (ﷺ) about the Luqata. He said, \"Make public announcement of it for one \nyear, then remember the description of its container and the string it is tied with, utilize the money, \nand if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Messenger (ﷺ)! What \nabout a lost sheep?\" Allah's Messenger (ﷺ) said, \"Take it, for it is for you, for your brother, or for the wolf.\" \nThe man asked, \"O Allah's Messenger (ﷺ)! What about a lost camel?\" Allah's Messenger (ﷺ) got angry and his \ncheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, \ntill its owner finds it.\"","reference":"Sahih al-Bukhari 2436, Book 45, Hadith 11","grade":"","question #":"question #3","question":"What are the ethical considerations in utilizing found money if the owner does not claim it within a year?","id":"bukhari-45-39"},{"hadith-eng":"While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. \nOne of them told me to drop it but I refused to do so and said that I would give it to its owner if I \nfound him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I \nasked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of \nthe Prophet (ﷺ) and took it to the Prophet (ﷺ) who said to me, 'Make public announcement about it for one \nyear.' So, I announced it for one year and went to the Prophet (ﷺ) who said, 'Announce it publicly for \nanother year.' So, I announced it for another year. I went to him again and he said, \"Announce for an \nother year.\" So I announced for still another year. I went to the Prophet (ﷺ) for the fourth time, and he \nsaid, 'Remember the amount of money, the description of its container and the string it is tied with, \nand if the owner comes, give it to him; otherwise, utilize it.' \"","reference":"Sahih al-Bukhari 2437, Book 45, Hadith 12","grade":"","question #":"question #3","question":"What details should be remembered about found property in case the owner comes to claim it?","id":"bukhari-45-40"},{"hadith-eng":"A bedouin asked the Prophet (ﷺ) about the Luqata. The Prophet (ﷺ) said, \"Make public announcement about it \nfor one year and if then somebody comes and describes the container of the Luqata and the string it \nwas tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet (ﷺ) about a lost camel. The \nface of the Prophet (ﷺ) become red and he said, \"You have o concern with it as it has its water reservoir \nand feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked \nthe Prophet (ﷺ) about a lost sheep. The Prophet (ﷺ) said, \"It is for you, for your brother, or for the wolf.\"","reference":"Sahih al-Bukhari 2438, Book 45, Hadith 14","grade":"","question #":"question #3","question":"What are the possible outcomes for a lost sheep as mentioned in the teachings of the Prophet (ﷺ)?","id":"bukhari-45-41"},{"hadith-eng":"While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant \nhe was. He replied that he was the servant of a man from Quraish, and then he mentioned his name \nand I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \n\"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of \none of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. \nHe removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk \nfor Allah's Messenger (ﷺ) in a pot and closed its mouth with a piece of cloth and poured water over it till it \nbecame cold. I took it to the Prophet (ﷺ) and said, \"Drink, O Allah's Messenger (ﷺ)!\" He drank it till I was \npleased.","reference":"Sahih al-Bukhari 2439, Book 45, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of serving others with sincerity and ensuring their satisfaction?","id":"bukhari-45-42"}]