[{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the believers pass safely over (the bridge across) Hell, they will be \nstopped at a bridge in between Hell and Paradise where they will retaliate upon each other for the \ninjustices done among them in the world, and when they get purified of all their sins, they will be \nadmitted into Paradise. By Him in Whose Hands the life of Muhammad is everybody will recognize \nhis dwelling in Paradise better than he recognizes his dwelling in this world.\"","reference":"Sahih al-Bukhari 2440, Book 46, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of the bridge between Hell and Paradise in Islamic eschatology?","id":"bukhari-46-1"},{"hadith-eng":"While I was walking with Ibn `Umar holding his hand, a man came in front of us and asked, \"What \nhave you heard from Allah's Messenger (ﷺ) about An-Najwa?\" Ibn `Umar said, \"I heard Allah's Messenger (ﷺ) \nsaying, 'Allah will bring a believer near Him and shelter him with His Screen and ask him: Did you \ncommit such-and-such sins? He will say: Yes, my Lord. Allah will keep on asking him till he will \nconfess all his sins and will think that he is ruined. Allah will say: 'I did screen your sins in the world \nand I forgive them for you today', and then he will be given the book of his good deeds. Regarding \ninfidels and hypocrites (their evil acts will be exposed publicly) and the witnesses will say: These are \nthe people who lied against their Lord. Behold! The Curse of Allah is upon the wrongdoers.\" (11.18)","reference":"Sahih al-Bukhari 2441, Book 46, Hadith 2","grade":"","question #":"question #1","question":"How does Allah's mercy manifest in the process of questioning a believer about their sins?","id":"bukhari-46-2"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim, so he should not oppress him, nor \nshould he hand him over to an oppressor. Whoever fulfilled the needs of his brother, Allah will fulfill \nhis needs; whoever brought his (Muslim) brother out of a discomfort, Allah will bring him out of the \ndiscomforts of the Day of Resurrection, and whoever screened a Muslim, Allah will screen him on the \nDay of Resurrection . \"","reference":"Sahih al-Bukhari 2442, Book 46, Hadith 3","grade":"","question #":"question #1","question":"What are the responsibilities of a Muslim towards their fellow Muslims in terms of oppression and support?","id":"bukhari-46-3"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"","reference":"Sahih al-Bukhari 2443, Book 46, Hadith 4","grade":"","question #":"question #1","question":"How can one assist a person who is committing oppression?","id":"bukhari-46-4"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one. People \nasked, \"O Allah's Messenger (ﷺ)! It is all right to help him if he is oppressed, but how should we help him if \nhe is an oppressor?\" The Prophet (ﷺ) said, \"By preventing him from oppressing others.\"","reference":"Sahih al-Bukhari 2444, Book 46, Hadith 5","grade":"","question #":"question #1","question":"How can one assist a person who is committing oppression according to Islamic teachings?","id":"bukhari-46-5"},{"hadith-eng":"I heard Al-Bara' bin `Azib saying, \"The Prophet (ﷺ) orders us to do seven things and prohibited us from \ndoing seven other things.\" Then Al-Bara' mentioned the following:-- \n(1) To pay a visit to the sick (inquiring about his health), \n(2) to follow funeral processions, \n(3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), \n(4) to return greetings, \n(5) to help the oppressed, \n(6) to accept invitations, \n(7) to help others to fulfill their oaths. (See Hadith No. 753, Vol. 7)","reference":"Sahih al-Bukhari 2445, Book 46, Hadith 6","grade":"","question #":"question #1","question":"What are some of the actions encouraged by the Prophet (ﷺ) to promote social welfare and community support?","id":"bukhari-46-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each \nother.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced (while saying that).","reference":"Sahih al-Bukhari 2446, Book 46, Hadith 7","grade":"","question #":"question #1","question":"How does the relationship between believers resemble a building in terms of mutual support?","id":"bukhari-46-7"},{"hadith-eng":"The Prophet (ﷺ) said, \"Oppression will be a darkness on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 2447, Book 46, Hadith 8","grade":"","question #":"question #1","question":"What are the consequences of oppression in the hereafter according to Islamic teachings?","id":"bukhari-46-8"},{"hadith-eng":"The Prophet (ﷺ) sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no \nscreen between his invocation and Allah.\"","reference":"Sahih al-Bukhari 2448, Book 46, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of the curse of the oppressed in Islamic teachings?","id":"bukhari-46-9"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever has oppressed another person concerning his reputation or anything \nelse, he should beg him to forgive him before the Day of Resurrection when there will be no money \n(to compensate for wrong deeds), but if he has good deeds, those good deeds will be taken from him \naccording to his oppression which he has done, and if he has no good deeds, the sins of the oppressed \nperson will be loaded on him.\"","reference":"Sahih al-Bukhari 2449, Book 46, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of seeking forgiveness from those we have wronged before the Day of Resurrection?","id":"bukhari-46-10"},{"hadith-eng":"Regarding the explanation of the following verse:-- \"If a wife fears Cruelty or desertion On her \nhusband's part.\" (4.128) A man may dislike his wife and intend to divorce her, so she says to him, \"I \ngive up my rights, so do not divorce me.\" The above verse was revealed concerning such a case.","reference":"Sahih al-Bukhari 2450, Book 46, Hadith 11","grade":"","question #":"question #1","question":"What options are available for a wife who fears cruelty or desertion from her husband according to Islamic teachings?","id":"bukhari-46-11"},{"hadith-eng":"A drink (milk mixed with water) was brought to Allah's Messenger (ﷺ) who drank some of it. A boy was \nsitting to his right, and some old men to his left. Allah's Messenger (ﷺ) said to the boy, \"Do you allow me to \ngive the rest of the drink to these people?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference \nto anyone over me to drink the rest of it from which you have drunk.\" Allah's Messenger (ﷺ) then handed the \nbowl (of drink) to the boy. (See Hadith No. 541).","reference":"Sahih al-Bukhari 2451, Book 46, Hadith 12","grade":"","question #":"question #1","question":"What does this narration teach about the etiquette of sharing and giving preference to others?","id":"bukhari-46-12"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever usurps the land of somebody unjustly, his neck will be encircled with \nit down the seven earths (on the Day of Resurrection). \"","reference":"Sahih al-Bukhari 2452, Book 46, Hadith 13","grade":"","question #":"question #1","question":"What are the consequences of unjustly taking someone else's land according to Islamic teachings?","id":"bukhari-46-13"},{"hadith-eng":"That there was a dispute between him and some people (about a piece of land). When he told `Aisha \nabout it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet (ﷺ) said, 'Whoever \nusurps even one span of the land of somebody, his neck will be encircled with it down the seven \nearths.\"","reference":"Sahih al-Bukhari 2453, Book 46, Hadith 14","grade":"","question #":"question #1","question":"What are the consequences of unjustly taking someone else's land according to Islamic teachings?","id":"bukhari-46-14"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven \nearths on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 2454, Book 46, Hadith 15","grade":"","question #":"question #1","question":"What are the consequences of unjustly taking someone else's land according to Islamic teachings?","id":"bukhari-46-15"},{"hadith-eng":"\"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az- \nZubair used to give us dates. Ibn `Umar used to pass by and say, \"The Prophet (ﷺ) forbade us to eat two \ndates at a time, unless one takes the permission of one's companions.\"","reference":"Sahih al-Bukhari 2455, Book 46, Hadith 16","grade":"","question #":"question #1","question":"What guidance did the Prophet (ﷺ) provide regarding the consumption of dates in a group setting?","id":"bukhari-46-16"},{"hadith-eng":"There was an Ansari man called Abu Shu'aib who had a slave butcher. Abu Shu'aib said to him, \n\"Prepare a meal sufficient for five persons so that I might invite the Prophet (ﷺ) besides other four \npersons.\" Abu Shu'aib had seen the signs of hunger on the face of the Prophet (ﷺ) and so he invited him. \nAnother man who was not invited, followed the Prophet. The Prophet (ﷺ) said to Abu Shu'aib, \"This man \nhas followed us. Do you allow him to share the meal?\" Abu Shu'aib said, \"Yes.\"","reference":"Sahih al-Bukhari 2456, Book 46, Hadith 17","grade":"","question #":"question #1","question":"What can be learned about hospitality and generosity from the actions of Abu Shu'aib?","id":"bukhari-46-17"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most hated person in the sight of Allah is the most quarrelsome person.\"","reference":"Sahih al-Bukhari 2457, Book 46, Hadith 18","grade":"","question #":"question #1","question":"What characteristics make a person disliked by Allah according to Islamic teachings?","id":"bukhari-46-18"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling. He \ncame out and said, \"I am only a human being, and opponents come to me (to settle their problems); \nmaybe someone amongst you can present his case more eloquently than the other, whereby I may \nconsider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by \nmistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day \nof Resurrection).","reference":"Sahih al-Bukhari 2458, Book 46, Hadith 19","grade":"","question #":"question #1","question":"What does this narration teach about the limitations of human judgment in resolving disputes?","id":"bukhari-46-19"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has \none of the following four characteristics will have one characteristic of hypocrisy until he gives it up. \nThese are: (1 ) Whenever he talks, he tells a lie; (2) whenever he makes a promise, he breaks it; (3) \nwhenever he makes a covenant he proves treacherous; (4) and whenever he quarrels, he behaves \nimpudently in an evil insulting manner.\" (See Hadith No. 33 Vol. 1)","reference":"Sahih al-Bukhari 2459, Book 46, Hadith 20","grade":"","question #":"question #1","question":"What are the characteristics that define a hypocrite according to Islamic teachings?","id":"bukhari-46-20"},{"hadith-eng":"Hind bint `Utba (Abu Sufyan's wife) came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is \nthere any harm if I spend something from his property for our children?\" He said, there is no harm for \nyou if you feed them from it justly and reasonably (with no extravagance).","reference":"Sahih al-Bukhari 2460, Book 46, Hadith 21","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the use of a spouse's wealth for family needs?","id":"bukhari-46-21"},{"hadith-eng":"We said to the Prophet, \"You send us out and it happens that we have to stay with people who do not entertain us. What do you think about it? He said to us, \"If you stay with some people and they entertain you as they should for a guest, accept their hospitality, but if they don't, take the right of \r\nthe guest from them.\"","reference":"Sahih al-Bukhari 2461, Book 46, Hadith 22","grade":"","question #":"question #1","question":"What is the expected behavior towards guests in Islam when they visit?","id":"bukhari-46-22"},{"hadith-eng":"When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani \nSa`ida. I said to Abu Bakr, \"Let us go.\" So, we come to them (i.e. to Ansar) at the shed of Bani Sa`ida. \n(See Hadith No. 19, Vol. 5 for details)","reference":"Sahih al-Bukhari 2462, Book 46, Hadith 23","grade":"","question #":"question #1","question":"What was the significance of the gathering of the Ansar in the shed of Bani Sa`ida after the Prophet's death?","id":"bukhari-46-23"},{"hadith-eng":"Abu Huraira said, \"Allah's Messenger (ﷺ) said, 'No one should prevent his neighbor from fixing a wooden \npeg in his wall.\" Abu Huraira said (to his companions), \"Why do I find you averse to it? By Allah, I \ncertainly will narrate it to you.\"","reference":"Sahih al-Bukhari 2463, Book 46, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of allowing neighbors to use shared resources or property in Islam?","id":"bukhari-46-24"},{"hadith-eng":"I was the butler of the people in the house of Abu Talha, and in those days drinks were prepared from \ndates. Allah's Messenger (ﷺ) ordered somebody to announce that alcoholic drinks had been prohibited. Abu \nTalha ordered me to go out and spill the wine. I went out and spilled it, and it flowed in the streets of \nMedina. Some people said, \"Some people were killed and wine was still in their stomachs.\" On that \nthe Divine revelation came:-- \"On those who believe And do good deeds There is no blame For what \nthey ate (in the past).\" (5.93)","reference":"Sahih al-Bukhari 2464, Book 46, Hadith 25","grade":"","question #":"question #1","question":"What was the reaction of the companions when the prohibition of alcohol was announced?","id":"bukhari-46-25"},{"hadith-eng":"The Prophet (ﷺ) said, \"Beware! Avoid sitting on he roads (ways).\" The people said, \"There is no way out \nof it as these are our sitting places where we have talks.\" The Prophet (ﷺ) said, \"If you must sit there, then \nobserve the rights of the way.\" They asked, \"What are the rights of the way?\" He said, \"They are the \nlowering of your gazes (on seeing what is illegal to look at), refraining from harming people, returning \ngreetings, advocating good and forbidding evil.\"","reference":"Sahih al-Bukhari 2465, Book 46, Hadith 26","grade":"","question #":"question #1","question":"What are the rights of the way that should be observed when sitting in public places?","id":"bukhari-46-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man felt very thirsty while he was on the way, there he came across a well. He \nwent down the well, quenched his thirst and came out. Meanwhile he saw a dog panting and licking \nmud because of excessive thirst. He said to himself, \"This dog is suffering from thirst as I did.\" So, he \nwent down the well again and filled his shoe with water and watered it. Allah thanked him for that \ndeed and forgave him. The people said, \"O Allah's Messenger (ﷺ)! Is there a reward for us in serving the \nanimals?\" He replied: \"Yes, there is a reward for serving any animate (living being).\" (See Hadith No. \n551)","reference":"Sahih al-Bukhari 2466, Book 46, Hadith 27","grade":"","question #":"question #1","question":"What lesson can be learned about compassion and empathy from the story of the man and the dog?","id":"bukhari-46-27"},{"hadith-eng":"Once the Prophet (ﷺ) stood at the top of one of the castles (or higher buildings) of Medina and said, \"Do \nyou see what I see? No doubt I am seeing the spots of afflictions amongst your houses as numerous as \nthe spots where raindrops fall (during a heavy rain). (See Hadith No. 102)","reference":"Sahih al-Bukhari 2467, Book 46, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of the Prophet's ability to foresee future afflictions in the community?","id":"bukhari-46-28"},{"hadith-eng":"I had been eager to ask `Umar about the two ladies from among the wives of the Prophet (ﷺ) regarding \nwhom Allah said (in the Qur'an saying): If you two (wives of the Prophet (ﷺ) namely Aisha and Hafsa) \nturn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes) \n(66.4), till performed the Hajj along with `Umar (and on our way back from Hajj) he went aside (to \nanswer the call of nature) and I also went aside along with him carrying a tumbler of water. When he \nhad answered the call of nature and returned. I poured water on his hands from the tumbler and he \nperformed ablution. I said, \"O Chief of the believers! ' Who were the two ladies from among the wives \nof the Prophet (ﷺ) to whom Allah said: \n'If you two return in repentance (66.4)? He said, \"I am astonished at your question, O Ibn `Abbas. \nThey were Aisha and Hafsa.\" \nThen `Umar went on relating the narration and said. \"I and an Ansari neighbor of mine from Bani \nUmaiya bin Zaid who used to live in `Awali Al-Medina, used to visit the Prophet (ﷺ) in turns. He used to \ngo one day, and I another day. When I went I would bring him the news of what had happened that \nday regarding the instructions and orders and when he went, he used to do the same for me. We, the \npeople of Quraish, used to have authority over women, but when we came to live with the Ansar, we \nnoticed that the Ansari women had the upper hand over their men, so our women started acquiring the \nhabits of the Ansari women. Once I shouted at my wife and she paid me back in my coin and I \ndisliked that she should answer me back. She said, 'Why do you take it ill that I retort upon you? By \nAllah, the wives of the Prophet (ﷺ) retort upon him, and some of them may not speak with him for the \nwhole day till night.' What she said scared me and I said to her, 'Whoever amongst them does so, will \nbe a great loser.' Then I dressed myself and went to Hafsa and asked her, 'Does any of you keep \nAllah's Messenger (ﷺ) angry all the day long till night?' She replied in the affirmative. I said, 'She is a ruined \nlosing person (and will never have success)! Doesn't she fear that Allah may get angry for the anger of \nAllah's Messenger (ﷺ) and thus she will be ruined? Don't ask Allah's Messenger (ﷺ) too many things, and don't \nretort upon him in any case, and don't desert him. Demand from me whatever you like, and don't be \ntempted to imitate your neighbor (i.e. `Aisha) in her behavior towards the Prophet), for she (i.e. Aisha) \nis more beautiful than you, and more beloved to Allah's Messenger (ﷺ). \nIn those days it was rumored that Ghassan, (a tribe living in Sham) was getting prepared their horses \nto invade us. My companion went (to the Prophet (ﷺ) on the day of his turn, went and returned to us at \nnight and knocked at my door violently, asking whether I was sleeping. I was scared (by the hard \nknocking) and came out to him. He said that a great thing had happened. I asked him: What is it? \nHave Ghassan come? He replied that it was worse and more serious than that, and added that Allah's \nApostle had divorced all his wives. I said, Hafsa is a ruined loser! I expected that would happen some \nday.' So I dressed myself and offered the Fajr prayer with the Prophet. Then the Prophet (ﷺ) entered an \nupper room and stayed there alone. I went to Hafsa and found her weeping. I asked her, 'Why are you \nweeping? Didn't I warn you? Have Allah's Messenger (ﷺ) divorced you all?' She replied, 'I don't know. He is \nthere in the upper room.' I then went out and came to the pulpit and found a group of people around it \nand some of them were weeping. \nThen I sat with them for some time, but could not endure the situation. So I went to the upper room \nwhere the Prophet (ﷺ) was and requested to a black slave of his: \"Will you get the permission of (Allah's \nApostle) for `Umar (to enter)? The slave went in, talked to the Prophet (ﷺ) about it and came out saying, 'I \nmentioned you to him but he did not reply.' So, I went and sat with the people who were sitting by the \npulpit, but I could not bear the situation, so I went to the slave again and said: \"Will you get he \npermission for `Umar? He went in and brought the same reply as before. When I was leaving, behold, \nthe slave called me saying, \"Allah's Messenger (ﷺ) has granted you permission.\" So, I entered upon the \nProphet and saw him lying on a mat without wedding on it, and the mat had left its mark on the body \nof the Prophet, and he was leaning on a leather pillow stuffed with palm fires. I greeted him and while \nstill standing, I said: \"Have you divorced your wives?' He raised his eyes to me and replied in the \nnegative. \nAnd then while still standing, I said chatting: \"Will you heed what I say, 'O Allah's Messenger (ﷺ)! We, the \npeople of Quraish used to have the upper hand over our women (wives), and when we came to the \npeople whose women had the upper hand over them...\" \n`Umar told the whole story (about his wife). \"On that the Prophet (ﷺ) smiled.\" `Umar further said, \"I then \nsaid, 'I went to Hafsa and said to her: Do not be tempted to imitate your companion (`Aisha) for she is \nmore beautiful than you and more beloved to the Prophet.' The Prophet (ﷺ) smiled again. When I saw him \nsmiling, I sat down and cast a glance at the room, and by Allah, I couldn't see anything of importance \nbut three hides. I said (to Allah's Messenger (ﷺ)) \"Invoke Allah to make your followers prosperous for the \nPersians and the Byzantines have been made prosperous and given worldly luxuries, though they do \nnot worship Allah?' The Prophet (ﷺ) was leaning then (and on hearing my speech he sat straight) and said, \n'O Ibn Al-Khattab! Do you have any doubt (that the Hereafter is better than this world)? These people \nhave been given rewards of their good deeds in this world only.' I asked the Prophet (ﷺ) . 'Please ask \nAllah's forgiveness for me. \nThe Prophet (ﷺ) did not go to his wives because of the secret which Hafsa had disclosed to `Aisha, and he \nsaid that he would not go to his wives for one month as he was angry with them when Allah \nadmonished him (for his oath that he would not approach Maria). When twenty-nine days had passed, \nthe Prophet (ﷺ) went to Aisha first of all. She said to him, 'You took an oath that you would not come to \nus for one month, and today only twenty-nine days have passed, as I have been counting them day by \nday.' The Prophet (ﷺ) said, 'The month is also of twenty-nine days.' That month consisted of twenty-nine \ndays. `Aisha said, 'When the Divine revelation of Choice was revealed, the Prophet (ﷺ) started with me, \nsaying to me, 'I am telling you something, but you need not hurry to give the reply till you can consult \nyour parents.\" `Aisha knew that her parents would not advise her to part with the Prophet (ﷺ) . \nThe Prophet (ﷺ) said that Allah had said: 'O Prophet! Say To your wives; If you desire The life of this \nworld And its glitter, ... then come! I will make a provision for you and set you free In a handsome \nmanner. But if you seek Allah And His Apostle, and The Home of the Hereafter, then Verily, Allah \nhas prepared For the good-doers amongst you A great reward.' (33.28) `Aisha said, 'Am I to consult \nmy parents about this? I indeed prefer Allah, His Apostle, and the Home of the Hereafter.' After that \nthe Prophet (ﷺ) gave the choice to his other wives and they also gave the same reply as `Aisha did.\"","reference":"Sahih al-Bukhari 2468, Book 46, Hadith 29","grade":"","question #":"question #1","question":"What lessons can be learned about marital relationships and communication from the interactions between the Prophet's wives and the Prophet Muhammad (ﷺ)?","id":"bukhari-46-29"},{"hadith-eng":"Allah's Messenger (ﷺ) took an oath that he would not go to his wives for one month as his foot had been \nsprained. He stayed in an upper room when `Umar went to him and said, \"Have you divorced your \nwives?\" He said, \"No, but I have taken an oath that I would not go to them for one month.\" The \nProphet stayed there for twenty-nine days, and then came down and went to his wives.","reference":"Sahih al-Bukhari 2469, Book 46, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of taking oaths in Islam and how should they be handled?","id":"bukhari-46-30"},{"hadith-eng":"The Prophet (ﷺ) entered the Mosque, and I too went there after tying the camel at the pavement of the \nMosque. I said (to the Prophet (ﷺ) ), \"This is your camel.\" He came out and started examining the camel \nand said, \"Both the camel and its price are for you.\"","reference":"Sahih al-Bukhari 2470, Book 46, Hadith 31","grade":"","question #":"question #1","question":"What does this incident teach about the generosity of the Prophet Muhammad (ﷺ)?","id":"bukhari-46-31"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) coming (or the Prophet (ﷺ) came) to the dumps of some people and urinated there \nwhile standing .","reference":"Sahih al-Bukhari 2471, Book 46, Hadith 32","grade":"","question #":"question #1","question":"What are the circumstances under which the Prophet Muhammad (ﷺ) urinated while standing?","id":"bukhari-46-32"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"While a man was on the way, he found a thorny branch of a tree there on the \nway and removed it. Allah thanked him for that deed and forgave him.\"","reference":"Sahih al-Bukhari 2472, Book 46, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of removing obstacles from the path in Islam?","id":"bukhari-46-33"},{"hadith-eng":"The Prophet (ﷺ) judged that seven cubits should be left as a public way when there was a dispute about \nthe land.","reference":"Sahih al-Bukhari 2473, Book 46, Hadith 34","grade":"","question #":"question #1","question":"What is the significance of leaving a public way in resolving land disputes in Islamic jurisprudence?","id":"bukhari-46-34"},{"hadith-eng":"The Prophet (ﷺ) forbade robbery (taking away what belongs to others without their permission), and also \nforbade mutilation (or maiming) of bodies.","reference":"Sahih al-Bukhari 2474, Book 46, Hadith 35","grade":"","question #":"question #1","question":"What actions are prohibited in Islam regarding the treatment of others' property?","id":"bukhari-46-35"},{"hadith-eng":"The Prophet (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at \nthe time, he is doing it, and when a drinker of an alcoholic liquor drinks it, then he is not a believer at \nthe time of drinking it, and when a thief steals, then he is not a believer at the time of stealing, and \nwhen a robber robs, and the people look at him, then he is not a believer at the time of doing robbery.","reference":"Sahih al-Bukhari 2475, Book 46, Hadith 36","grade":"","question #":"question #1","question":"What is the relationship between committing major sins and one's state of faith in Islam?","id":"bukhari-46-36"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established until the son of Mary (i.e. Jesus) descends \namongst you as a just ruler, he will break the cross, kill the pigs, and abolish the Jizya tax. Money will \nbe in abundance so that nobody will accept it (as charitable gifts).","reference":"Sahih al-Bukhari 2476, Book 46, Hadith 37","grade":"","question #":"question #1","question":"What are the signs mentioned in Islamic teachings that indicate the approach of the Hour?","id":"bukhari-46-37"},{"hadith-eng":"On the day of Khaibar the Prophet (ﷺ) saw fires being lighted. He asked, \"Why are these fires being \nlighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and \nthrow away their contents.\" The people said, \"Shall we throw away their contents and wash the pots \n(rather than break them)?\" He said, \"Wash them.\"","reference":"Sahih al-Bukhari 2477, Book 46, Hadith 38","grade":"","question #":"question #1","question":"What was the Prophet's response to the consumption of donkey meat during the Battle of Khaibar?","id":"bukhari-46-38"},{"hadith-eng":"The Prophet (ﷺ) entered Mecca and (at that time) there were three hundred-and-sixty idols around the \nKa`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has \ncome and Falsehood (disbelief) has vanished.\"","reference":"Sahih al-Bukhari 2478, Book 46, Hadith 39","grade":"","question #":"question #1","question":"What significance does the act of destroying idols hold in the context of Islamic teachings?","id":"bukhari-46-39"},{"hadith-eng":"Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet (ﷺ) \ntore that curtain and she turned it into two cushions which remained in the house for the Prophet (ﷺ) to sit \non.","reference":"Sahih al-Bukhari 2479, Book 46, Hadith 40","grade":"","question #":"question #1","question":"What is the Islamic perspective on using items with images of living beings in the household?","id":"bukhari-46-40"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Whoever is killed while protecting his property then he is a martyr.\"","reference":"Sahih al-Bukhari 2480, Book 46, Hadith 41","grade":"","question #":"question #1","question":"What is the status of a person who dies while defending their property in Islam?","id":"bukhari-46-41"},{"hadith-eng":"While the Prophet (ﷺ) was with one of his wives, one of the mothers of the believers (i.e. one of his \nwives) sent a wooden bowl containing food with a servant. The wife (in whose house he was sitting) \nstroke the bowl with her hand and broke it. The Prophet (ﷺ) collected the shattered pieces and put the food \nback in it and said, \"Eat.\" He kept the servant and the bowl till he had eaten the food. Then the \nProphet gave another unbroken. bowl to the servant and kept the broken one.","reference":"Sahih al-Bukhari 2481, Book 46, Hadith 42","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle conflicts or disputes among his wives?","id":"bukhari-46-42"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There was an Israeli man called Juraij, while he was praying, his mother came \nand called him, but he did not respond to her call. He said (to himself) whether he should continue the \nprayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do \nnot let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said \nthat she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. \nShe then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and \nlater she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and \nbroke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the \nprayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby \nreplied that his father was the shepherd. The people said that they would build for him a hermitage of \ngold but Juraij asked them to make it of mud only.\"","reference":"Sahih al-Bukhari 2482, Book 46, Hadith 43","grade":"","question #":"question #1","question":"What are the consequences of prioritizing religious duties over familial responsibilities?","id":"bukhari-46-43"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the believers pass safely over (the bridge across) Hell, they will be \nstopped at a bridge in between Hell and Paradise where they will retaliate upon each other for the \ninjustices done among them in the world, and when they get purified of all their sins, they will be \nadmitted into Paradise. By Him in Whose Hands the life of Muhammad is everybody will recognize \nhis dwelling in Paradise better than he recognizes his dwelling in this world.\"","reference":"Sahih al-Bukhari 2440, Book 46, Hadith 1","grade":"","question #":"question #2","question":"How are injustices among believers addressed before entering Paradise according to Islamic teachings?","id":"bukhari-46-44"},{"hadith-eng":"While I was walking with Ibn `Umar holding his hand, a man came in front of us and asked, \"What \nhave you heard from Allah's Messenger (ﷺ) about An-Najwa?\" Ibn `Umar said, \"I heard Allah's Messenger (ﷺ) \nsaying, 'Allah will bring a believer near Him and shelter him with His Screen and ask him: Did you \ncommit such-and-such sins? He will say: Yes, my Lord. Allah will keep on asking him till he will \nconfess all his sins and will think that he is ruined. Allah will say: 'I did screen your sins in the world \nand I forgive them for you today', and then he will be given the book of his good deeds. Regarding \ninfidels and hypocrites (their evil acts will be exposed publicly) and the witnesses will say: These are \nthe people who lied against their Lord. Behold! The Curse of Allah is upon the wrongdoers.\" (11.18)","reference":"Sahih al-Bukhari 2441, Book 46, Hadith 2","grade":"","question #":"question #2","question":"What is the significance of Allah screening a believer's sins in the world and forgiving them in the Hereafter?","id":"bukhari-46-45"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim, so he should not oppress him, nor \nshould he hand him over to an oppressor. Whoever fulfilled the needs of his brother, Allah will fulfill \nhis needs; whoever brought his (Muslim) brother out of a discomfort, Allah will bring him out of the \ndiscomforts of the Day of Resurrection, and whoever screened a Muslim, Allah will screen him on the \nDay of Resurrection . \"","reference":"Sahih al-Bukhari 2442, Book 46, Hadith 3","grade":"","question #":"question #2","question":"How does fulfilling the needs of others relate to one's own needs being fulfilled by Allah?","id":"bukhari-46-46"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"","reference":"Sahih al-Bukhari 2443, Book 46, Hadith 4","grade":"","question #":"question #2","question":"What are the ways to support someone who is being oppressed?","id":"bukhari-46-47"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one. People \nasked, \"O Allah's Messenger (ﷺ)! It is all right to help him if he is oppressed, but how should we help him if \nhe is an oppressor?\" The Prophet (ﷺ) said, \"By preventing him from oppressing others.\"","reference":"Sahih al-Bukhari 2444, Book 46, Hadith 5","grade":"","question #":"question #2","question":"What is the significance of helping both the oppressor and the oppressed in Islam?","id":"bukhari-46-48"},{"hadith-eng":"I heard Al-Bara' bin `Azib saying, \"The Prophet (ﷺ) orders us to do seven things and prohibited us from \ndoing seven other things.\" Then Al-Bara' mentioned the following:-- \n(1) To pay a visit to the sick (inquiring about his health), \n(2) to follow funeral processions, \n(3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), \n(4) to return greetings, \n(5) to help the oppressed, \n(6) to accept invitations, \n(7) to help others to fulfill their oaths. (See Hadith No. 753, Vol. 7)","reference":"Sahih al-Bukhari 2445, Book 46, Hadith 6","grade":"","question #":"question #2","question":"How does Islam emphasize the importance of responding to others' needs and maintaining social bonds?","id":"bukhari-46-49"},{"hadith-eng":"The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each \nother.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced (while saying that).","reference":"Sahih al-Bukhari 2446, Book 46, Hadith 7","grade":"","question #":"question #2","question":"What is the significance of unity and cooperation among believers in Islam?","id":"bukhari-46-50"},{"hadith-eng":"The Prophet (ﷺ) said, \"Oppression will be a darkness on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 2447, Book 46, Hadith 8","grade":"","question #":"question #2","question":"How is oppression viewed in the context of Islamic justice and accountability?","id":"bukhari-46-51"},{"hadith-eng":"The Prophet (ﷺ) sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no \nscreen between his invocation and Allah.\"","reference":"Sahih al-Bukhari 2448, Book 46, Hadith 9","grade":"","question #":"question #2","question":"Why is it important to be cautious of the supplications made by those who are oppressed?","id":"bukhari-46-52"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever has oppressed another person concerning his reputation or anything \nelse, he should beg him to forgive him before the Day of Resurrection when there will be no money \n(to compensate for wrong deeds), but if he has good deeds, those good deeds will be taken from him \naccording to his oppression which he has done, and if he has no good deeds, the sins of the oppressed \nperson will be loaded on him.\"","reference":"Sahih al-Bukhari 2449, Book 46, Hadith 10","grade":"","question #":"question #2","question":"How are good deeds and sins transferred between individuals on the Day of Judgment according to Islamic teachings?","id":"bukhari-46-53"},{"hadith-eng":"Regarding the explanation of the following verse:-- \"If a wife fears Cruelty or desertion On her \nhusband's part.\" (4.128) A man may dislike his wife and intend to divorce her, so she says to him, \"I \ngive up my rights, so do not divorce me.\" The above verse was revealed concerning such a case.","reference":"Sahih al-Bukhari 2450, Book 46, Hadith 11","grade":"","question #":"question #2","question":"How does Islam address situations where a husband intends to divorce his wife due to dislike?","id":"bukhari-46-54"},{"hadith-eng":"A drink (milk mixed with water) was brought to Allah's Messenger (ﷺ) who drank some of it. A boy was \nsitting to his right, and some old men to his left. Allah's Messenger (ﷺ) said to the boy, \"Do you allow me to \ngive the rest of the drink to these people?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference \nto anyone over me to drink the rest of it from which you have drunk.\" Allah's Messenger (ﷺ) then handed the \nbowl (of drink) to the boy. (See Hadith No. 541).","reference":"Sahih al-Bukhari 2451, Book 46, Hadith 12","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate respect for the rights of individuals in this situation?","id":"bukhari-46-55"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever usurps the land of somebody unjustly, his neck will be encircled with \nit down the seven earths (on the Day of Resurrection). \"","reference":"Sahih al-Bukhari 2452, Book 46, Hadith 13","grade":"","question #":"question #2","question":"How does Islam view the act of usurping land from others?","id":"bukhari-46-56"},{"hadith-eng":"That there was a dispute between him and some people (about a piece of land). When he told `Aisha \nabout it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet (ﷺ) said, 'Whoever \nusurps even one span of the land of somebody, his neck will be encircled with it down the seven \nearths.\"","reference":"Sahih al-Bukhari 2453, Book 46, Hadith 14","grade":"","question #":"question #2","question":"How does Islam view the act of usurping land from others?","id":"bukhari-46-57"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven \nearths on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 2454, Book 46, Hadith 15","grade":"","question #":"question #2","question":"How does Islam view the act of taking land from others without justice?","id":"bukhari-46-58"},{"hadith-eng":"\"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az- \nZubair used to give us dates. Ibn `Umar used to pass by and say, \"The Prophet (ﷺ) forbade us to eat two \ndates at a time, unless one takes the permission of one's companions.\"","reference":"Sahih al-Bukhari 2455, Book 46, Hadith 16","grade":"","question #":"question #2","question":"Why is it important to seek permission from companions when sharing food according to Islamic teachings?","id":"bukhari-46-59"},{"hadith-eng":"There was an Ansari man called Abu Shu'aib who had a slave butcher. Abu Shu'aib said to him, \n\"Prepare a meal sufficient for five persons so that I might invite the Prophet (ﷺ) besides other four \npersons.\" Abu Shu'aib had seen the signs of hunger on the face of the Prophet (ﷺ) and so he invited him. \nAnother man who was not invited, followed the Prophet. The Prophet (ﷺ) said to Abu Shu'aib, \"This man \nhas followed us. Do you allow him to share the meal?\" Abu Shu'aib said, \"Yes.\"","reference":"Sahih al-Bukhari 2456, Book 46, Hadith 17","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate consideration for others in social gatherings?","id":"bukhari-46-60"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most hated person in the sight of Allah is the most quarrelsome person.\"","reference":"Sahih al-Bukhari 2457, Book 46, Hadith 18","grade":"","question #":"question #2","question":"How does being quarrelsome affect one's standing in the sight of Allah?","id":"bukhari-46-61"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling. He \ncame out and said, \"I am only a human being, and opponents come to me (to settle their problems); \nmaybe someone amongst you can present his case more eloquently than the other, whereby I may \nconsider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by \nmistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day \nof Resurrection).","reference":"Sahih al-Bukhari 2458, Book 46, Hadith 19","grade":"","question #":"question #2","question":"How does this narration emphasize the importance of honesty and integrity in legal matters?","id":"bukhari-46-62"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has \none of the following four characteristics will have one characteristic of hypocrisy until he gives it up. \nThese are: (1 ) Whenever he talks, he tells a lie; (2) whenever he makes a promise, he breaks it; (3) \nwhenever he makes a covenant he proves treacherous; (4) and whenever he quarrels, he behaves \nimpudently in an evil insulting manner.\" (See Hadith No. 33 Vol. 1)","reference":"Sahih al-Bukhari 2459, Book 46, Hadith 20","grade":"","question #":"question #2","question":"How does breaking promises relate to the concept of hypocrisy in Islam?","id":"bukhari-46-63"},{"hadith-eng":"Hind bint `Utba (Abu Sufyan's wife) came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is \nthere any harm if I spend something from his property for our children?\" He said, there is no harm for \nyou if you feed them from it justly and reasonably (with no extravagance).","reference":"Sahih al-Bukhari 2460, Book 46, Hadith 21","grade":"","question #":"question #2","question":"How does Islam address issues of financial responsibility and fairness within a marriage?","id":"bukhari-46-64"},{"hadith-eng":"We said to the Prophet, \"You send us out and it happens that we have to stay with people who do not entertain us. What do you think about it? He said to us, \"If you stay with some people and they entertain you as they should for a guest, accept their hospitality, but if they don't, take the right of \r\nthe guest from them.\"","reference":"Sahih al-Bukhari 2461, Book 46, Hadith 22","grade":"","question #":"question #2","question":"How should one respond if they are not treated hospitably by their hosts?","id":"bukhari-46-65"},{"hadith-eng":"When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani \nSa`ida. I said to Abu Bakr, \"Let us go.\" So, we come to them (i.e. to Ansar) at the shed of Bani Sa`ida. \n(See Hadith No. 19, Vol. 5 for details)","reference":"Sahih al-Bukhari 2462, Book 46, Hadith 23","grade":"","question #":"question #2","question":"What role did Abu Bakr and Umar play in the events following the Prophet's passing?","id":"bukhari-46-66"},{"hadith-eng":"Abu Huraira said, \"Allah's Messenger (ﷺ) said, 'No one should prevent his neighbor from fixing a wooden \npeg in his wall.\" Abu Huraira said (to his companions), \"Why do I find you averse to it? By Allah, I \ncertainly will narrate it to you.\"","reference":"Sahih al-Bukhari 2463, Book 46, Hadith 24","grade":"","question #":"question #2","question":"How does Islam encourage cooperation and good relations between neighbors?","id":"bukhari-46-67"},{"hadith-eng":"I was the butler of the people in the house of Abu Talha, and in those days drinks were prepared from \ndates. Allah's Messenger (ﷺ) ordered somebody to announce that alcoholic drinks had been prohibited. Abu \nTalha ordered me to go out and spill the wine. I went out and spilled it, and it flowed in the streets of \nMedina. Some people said, \"Some people were killed and wine was still in their stomachs.\" On that \nthe Divine revelation came:-- \"On those who believe And do good deeds There is no blame For what \nthey ate (in the past).\" (5.93)","reference":"Sahih al-Bukhari 2464, Book 46, Hadith 25","grade":"","question #":"question #2","question":"How did the revelation address concerns about those who consumed alcohol before its prohibition?","id":"bukhari-46-68"},{"hadith-eng":"The Prophet (ﷺ) said, \"Beware! Avoid sitting on he roads (ways).\" The people said, \"There is no way out \nof it as these are our sitting places where we have talks.\" The Prophet (ﷺ) said, \"If you must sit there, then \nobserve the rights of the way.\" They asked, \"What are the rights of the way?\" He said, \"They are the \nlowering of your gazes (on seeing what is illegal to look at), refraining from harming people, returning \ngreetings, advocating good and forbidding evil.\"","reference":"Sahih al-Bukhari 2465, Book 46, Hadith 26","grade":"","question #":"question #2","question":"How can one practice advocating good and forbidding evil in everyday social interactions?","id":"bukhari-46-69"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man felt very thirsty while he was on the way, there he came across a well. He \nwent down the well, quenched his thirst and came out. Meanwhile he saw a dog panting and licking \nmud because of excessive thirst. He said to himself, \"This dog is suffering from thirst as I did.\" So, he \nwent down the well again and filled his shoe with water and watered it. Allah thanked him for that \ndeed and forgave him. The people said, \"O Allah's Messenger (ﷺ)! Is there a reward for us in serving the \nanimals?\" He replied: \"Yes, there is a reward for serving any animate (living being).\" (See Hadith No. \n551)","reference":"Sahih al-Bukhari 2466, Book 46, Hadith 27","grade":"","question #":"question #2","question":"How does Islam view the act of kindness towards animals and other living beings?","id":"bukhari-46-70"},{"hadith-eng":"Once the Prophet (ﷺ) stood at the top of one of the castles (or higher buildings) of Medina and said, \"Do \nyou see what I see? No doubt I am seeing the spots of afflictions amongst your houses as numerous as \nthe spots where raindrops fall (during a heavy rain). (See Hadith No. 102)","reference":"Sahih al-Bukhari 2467, Book 46, Hadith 28","grade":"","question #":"question #2","question":"How can the metaphor of raindrops be used to understand the spread of afflictions in society?","id":"bukhari-46-71"},{"hadith-eng":"I had been eager to ask `Umar about the two ladies from among the wives of the Prophet (ﷺ) regarding \nwhom Allah said (in the Qur'an saying): If you two (wives of the Prophet (ﷺ) namely Aisha and Hafsa) \nturn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes) \n(66.4), till performed the Hajj along with `Umar (and on our way back from Hajj) he went aside (to \nanswer the call of nature) and I also went aside along with him carrying a tumbler of water. When he \nhad answered the call of nature and returned. I poured water on his hands from the tumbler and he \nperformed ablution. I said, \"O Chief of the believers! ' Who were the two ladies from among the wives \nof the Prophet (ﷺ) to whom Allah said: \n'If you two return in repentance (66.4)? He said, \"I am astonished at your question, O Ibn `Abbas. \nThey were Aisha and Hafsa.\" \nThen `Umar went on relating the narration and said. \"I and an Ansari neighbor of mine from Bani \nUmaiya bin Zaid who used to live in `Awali Al-Medina, used to visit the Prophet (ﷺ) in turns. He used to \ngo one day, and I another day. When I went I would bring him the news of what had happened that \nday regarding the instructions and orders and when he went, he used to do the same for me. We, the \npeople of Quraish, used to have authority over women, but when we came to live with the Ansar, we \nnoticed that the Ansari women had the upper hand over their men, so our women started acquiring the \nhabits of the Ansari women. Once I shouted at my wife and she paid me back in my coin and I \ndisliked that she should answer me back. She said, 'Why do you take it ill that I retort upon you? By \nAllah, the wives of the Prophet (ﷺ) retort upon him, and some of them may not speak with him for the \nwhole day till night.' What she said scared me and I said to her, 'Whoever amongst them does so, will \nbe a great loser.' Then I dressed myself and went to Hafsa and asked her, 'Does any of you keep \nAllah's Messenger (ﷺ) angry all the day long till night?' She replied in the affirmative. I said, 'She is a ruined \nlosing person (and will never have success)! Doesn't she fear that Allah may get angry for the anger of \nAllah's Messenger (ﷺ) and thus she will be ruined? Don't ask Allah's Messenger (ﷺ) too many things, and don't \nretort upon him in any case, and don't desert him. Demand from me whatever you like, and don't be \ntempted to imitate your neighbor (i.e. `Aisha) in her behavior towards the Prophet), for she (i.e. Aisha) \nis more beautiful than you, and more beloved to Allah's Messenger (ﷺ). \nIn those days it was rumored that Ghassan, (a tribe living in Sham) was getting prepared their horses \nto invade us. My companion went (to the Prophet (ﷺ) on the day of his turn, went and returned to us at \nnight and knocked at my door violently, asking whether I was sleeping. I was scared (by the hard \nknocking) and came out to him. He said that a great thing had happened. I asked him: What is it? \nHave Ghassan come? He replied that it was worse and more serious than that, and added that Allah's \nApostle had divorced all his wives. I said, Hafsa is a ruined loser! I expected that would happen some \nday.' So I dressed myself and offered the Fajr prayer with the Prophet. Then the Prophet (ﷺ) entered an \nupper room and stayed there alone. I went to Hafsa and found her weeping. I asked her, 'Why are you \nweeping? Didn't I warn you? Have Allah's Messenger (ﷺ) divorced you all?' She replied, 'I don't know. He is \nthere in the upper room.' I then went out and came to the pulpit and found a group of people around it \nand some of them were weeping. \nThen I sat with them for some time, but could not endure the situation. So I went to the upper room \nwhere the Prophet (ﷺ) was and requested to a black slave of his: \"Will you get the permission of (Allah's \nApostle) for `Umar (to enter)? The slave went in, talked to the Prophet (ﷺ) about it and came out saying, 'I \nmentioned you to him but he did not reply.' So, I went and sat with the people who were sitting by the \npulpit, but I could not bear the situation, so I went to the slave again and said: \"Will you get he \npermission for `Umar? He went in and brought the same reply as before. When I was leaving, behold, \nthe slave called me saying, \"Allah's Messenger (ﷺ) has granted you permission.\" So, I entered upon the \nProphet and saw him lying on a mat without wedding on it, and the mat had left its mark on the body \nof the Prophet, and he was leaning on a leather pillow stuffed with palm fires. I greeted him and while \nstill standing, I said: \"Have you divorced your wives?' He raised his eyes to me and replied in the \nnegative. \nAnd then while still standing, I said chatting: \"Will you heed what I say, 'O Allah's Messenger (ﷺ)! We, the \npeople of Quraish used to have the upper hand over our women (wives), and when we came to the \npeople whose women had the upper hand over them...\" \n`Umar told the whole story (about his wife). \"On that the Prophet (ﷺ) smiled.\" `Umar further said, \"I then \nsaid, 'I went to Hafsa and said to her: Do not be tempted to imitate your companion (`Aisha) for she is \nmore beautiful than you and more beloved to the Prophet.' The Prophet (ﷺ) smiled again. When I saw him \nsmiling, I sat down and cast a glance at the room, and by Allah, I couldn't see anything of importance \nbut three hides. I said (to Allah's Messenger (ﷺ)) \"Invoke Allah to make your followers prosperous for the \nPersians and the Byzantines have been made prosperous and given worldly luxuries, though they do \nnot worship Allah?' The Prophet (ﷺ) was leaning then (and on hearing my speech he sat straight) and said, \n'O Ibn Al-Khattab! Do you have any doubt (that the Hereafter is better than this world)? These people \nhave been given rewards of their good deeds in this world only.' I asked the Prophet (ﷺ) . 'Please ask \nAllah's forgiveness for me. \nThe Prophet (ﷺ) did not go to his wives because of the secret which Hafsa had disclosed to `Aisha, and he \nsaid that he would not go to his wives for one month as he was angry with them when Allah \nadmonished him (for his oath that he would not approach Maria). When twenty-nine days had passed, \nthe Prophet (ﷺ) went to Aisha first of all. She said to him, 'You took an oath that you would not come to \nus for one month, and today only twenty-nine days have passed, as I have been counting them day by \nday.' The Prophet (ﷺ) said, 'The month is also of twenty-nine days.' That month consisted of twenty-nine \ndays. `Aisha said, 'When the Divine revelation of Choice was revealed, the Prophet (ﷺ) started with me, \nsaying to me, 'I am telling you something, but you need not hurry to give the reply till you can consult \nyour parents.\" `Aisha knew that her parents would not advise her to part with the Prophet (ﷺ) . \nThe Prophet (ﷺ) said that Allah had said: 'O Prophet! Say To your wives; If you desire The life of this \nworld And its glitter, ... then come! I will make a provision for you and set you free In a handsome \nmanner. But if you seek Allah And His Apostle, and The Home of the Hereafter, then Verily, Allah \nhas prepared For the good-doers amongst you A great reward.' (33.28) `Aisha said, 'Am I to consult \nmy parents about this? I indeed prefer Allah, His Apostle, and the Home of the Hereafter.' After that \nthe Prophet (ﷺ) gave the choice to his other wives and they also gave the same reply as `Aisha did.\"","reference":"Sahih al-Bukhari 2468, Book 46, Hadith 29","grade":"","question #":"question #2","question":"How did the cultural differences between the Quraish and the Ansar influence the behavior of women in Medina during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-46-72"},{"hadith-eng":"Allah's Messenger (ﷺ) took an oath that he would not go to his wives for one month as his foot had been \nsprained. He stayed in an upper room when `Umar went to him and said, \"Have you divorced your \nwives?\" He said, \"No, but I have taken an oath that I would not go to them for one month.\" The \nProphet stayed there for twenty-nine days, and then came down and went to his wives.","reference":"Sahih al-Bukhari 2469, Book 46, Hadith 30","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) manage personal conflicts with his wives according to Islamic teachings?","id":"bukhari-46-73"},{"hadith-eng":"The Prophet (ﷺ) entered the Mosque, and I too went there after tying the camel at the pavement of the \nMosque. I said (to the Prophet (ﷺ) ), \"This is your camel.\" He came out and started examining the camel \nand said, \"Both the camel and its price are for you.\"","reference":"Sahih al-Bukhari 2470, Book 46, Hadith 31","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his appreciation for gifts or offerings?","id":"bukhari-46-74"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) coming (or the Prophet (ﷺ) came) to the dumps of some people and urinated there \nwhile standing .","reference":"Sahih al-Bukhari 2471, Book 46, Hadith 32","grade":"","question #":"question #2","question":"How does the behavior of the Prophet (ﷺ) in this situation inform Islamic etiquette regarding cleanliness?","id":"bukhari-46-75"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"While a man was on the way, he found a thorny branch of a tree there on the \nway and removed it. Allah thanked him for that deed and forgave him.\"","reference":"Sahih al-Bukhari 2472, Book 46, Hadith 33","grade":"","question #":"question #2","question":"How does performing small good deeds impact one's forgiveness from Allah?","id":"bukhari-46-76"},{"hadith-eng":"The Prophet (ﷺ) judged that seven cubits should be left as a public way when there was a dispute about \nthe land.","reference":"Sahih al-Bukhari 2473, Book 46, Hadith 34","grade":"","question #":"question #2","question":"How does Islamic law address the issue of land disputes between individuals?","id":"bukhari-46-77"},{"hadith-eng":"The Prophet (ﷺ) forbade robbery (taking away what belongs to others without their permission), and also \nforbade mutilation (or maiming) of bodies.","reference":"Sahih al-Bukhari 2474, Book 46, Hadith 35","grade":"","question #":"question #2","question":"What is the Islamic stance on the mutilation or maiming of bodies?","id":"bukhari-46-78"},{"hadith-eng":"The Prophet (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at \nthe time, he is doing it, and when a drinker of an alcoholic liquor drinks it, then he is not a believer at \nthe time of drinking it, and when a thief steals, then he is not a believer at the time of stealing, and \nwhen a robber robs, and the people look at him, then he is not a believer at the time of doing robbery.","reference":"Sahih al-Bukhari 2475, Book 46, Hadith 36","grade":"","question #":"question #2","question":"How does engaging in sinful acts like theft or adultery affect a person's belief according to Islamic teachings?","id":"bukhari-46-79"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established until the son of Mary (i.e. Jesus) descends \namongst you as a just ruler, he will break the cross, kill the pigs, and abolish the Jizya tax. Money will \nbe in abundance so that nobody will accept it (as charitable gifts).","reference":"Sahih al-Bukhari 2476, Book 46, Hadith 37","grade":"","question #":"question #2","question":"What role is Jesus expected to play upon his return according to Islamic eschatology?","id":"bukhari-46-80"},{"hadith-eng":"On the day of Khaibar the Prophet (ﷺ) saw fires being lighted. He asked, \"Why are these fires being \nlighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and \nthrow away their contents.\" The people said, \"Shall we throw away their contents and wash the pots \n(rather than break them)?\" He said, \"Wash them.\"","reference":"Sahih al-Bukhari 2477, Book 46, Hadith 38","grade":"","question #":"question #2","question":"How did the Prophet instruct the people to handle the pots used for cooking prohibited meat?","id":"bukhari-46-81"},{"hadith-eng":"The Prophet (ﷺ) entered Mecca and (at that time) there were three hundred-and-sixty idols around the \nKa`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has \ncome and Falsehood (disbelief) has vanished.\"","reference":"Sahih al-Bukhari 2478, Book 46, Hadith 39","grade":"","question #":"question #2","question":"How does the recitation of specific verses from the Quran relate to the actions of the Prophet in Mecca?","id":"bukhari-46-82"},{"hadith-eng":"Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet (ﷺ) \ntore that curtain and she turned it into two cushions which remained in the house for the Prophet (ﷺ) to sit \non.","reference":"Sahih al-Bukhari 2479, Book 46, Hadith 40","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to household items that contained images?","id":"bukhari-46-83"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Whoever is killed while protecting his property then he is a martyr.\"","reference":"Sahih al-Bukhari 2480, Book 46, Hadith 41","grade":"","question #":"question #2","question":"How does Islam view the act of protecting one's possessions in the face of aggression?","id":"bukhari-46-84"},{"hadith-eng":"While the Prophet (ﷺ) was with one of his wives, one of the mothers of the believers (i.e. one of his \nwives) sent a wooden bowl containing food with a servant. The wife (in whose house he was sitting) \nstroke the bowl with her hand and broke it. The Prophet (ﷺ) collected the shattered pieces and put the food \nback in it and said, \"Eat.\" He kept the servant and the bowl till he had eaten the food. Then the \nProphet gave another unbroken. bowl to the servant and kept the broken one.","reference":"Sahih al-Bukhari 2481, Book 46, Hadith 42","grade":"","question #":"question #2","question":"What can be learned from the Prophet's (ﷺ) reaction to the breaking of the bowl in terms of patience and forgiveness?","id":"bukhari-46-85"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There was an Israeli man called Juraij, while he was praying, his mother came \nand called him, but he did not respond to her call. He said (to himself) whether he should continue the \nprayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do \nnot let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said \nthat she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. \nShe then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and \nlater she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and \nbroke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the \nprayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby \nreplied that his father was the shepherd. The people said that they would build for him a hermitage of \ngold but Juraij asked them to make it of mud only.\"","reference":"Sahih al-Bukhari 2482, Book 46, Hadith 43","grade":"","question #":"question #2","question":"How can false accusations impact an individual's reputation and what steps can be taken to address them?","id":"bukhari-46-86"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the believers pass safely over (the bridge across) Hell, they will be \nstopped at a bridge in between Hell and Paradise where they will retaliate upon each other for the \ninjustices done among them in the world, and when they get purified of all their sins, they will be \nadmitted into Paradise. By Him in Whose Hands the life of Muhammad is everybody will recognize \nhis dwelling in Paradise better than he recognizes his dwelling in this world.\"","reference":"Sahih al-Bukhari 2440, Book 46, Hadith 1","grade":"","question #":"question #3","question":"How does the recognition of one's dwelling in Paradise compare to their recognition of their home in this world?","id":"bukhari-46-87"},{"hadith-eng":"While I was walking with Ibn `Umar holding his hand, a man came in front of us and asked, \"What \nhave you heard from Allah's Messenger (ﷺ) about An-Najwa?\" Ibn `Umar said, \"I heard Allah's Messenger (ﷺ) \nsaying, 'Allah will bring a believer near Him and shelter him with His Screen and ask him: Did you \ncommit such-and-such sins? He will say: Yes, my Lord. Allah will keep on asking him till he will \nconfess all his sins and will think that he is ruined. Allah will say: 'I did screen your sins in the world \nand I forgive them for you today', and then he will be given the book of his good deeds. Regarding \ninfidels and hypocrites (their evil acts will be exposed publicly) and the witnesses will say: These are \nthe people who lied against their Lord. Behold! The Curse of Allah is upon the wrongdoers.\" (11.18)","reference":"Sahih al-Bukhari 2441, Book 46, Hadith 2","grade":"","question #":"question #3","question":"How are the deeds of infidels and hypocrites treated differently from those of believers on the Day of Judgment?","id":"bukhari-46-88"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim, so he should not oppress him, nor \nshould he hand him over to an oppressor. Whoever fulfilled the needs of his brother, Allah will fulfill \nhis needs; whoever brought his (Muslim) brother out of a discomfort, Allah will bring him out of the \ndiscomforts of the Day of Resurrection, and whoever screened a Muslim, Allah will screen him on the \nDay of Resurrection . \"","reference":"Sahih al-Bukhari 2442, Book 46, Hadith 3","grade":"","question #":"question #3","question":"What is the significance of screening a fellow Muslim and its impact on the Day of Resurrection?","id":"bukhari-46-89"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"","reference":"Sahih al-Bukhari 2443, Book 46, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of helping others in Islam, regardless of their situation?","id":"bukhari-46-90"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one. People \nasked, \"O Allah's Messenger (ﷺ)! It is all right to help him if he is oppressed, but how should we help him if \nhe is an oppressor?\" The Prophet (ﷺ) said, \"By preventing him from oppressing others.\"","reference":"Sahih al-Bukhari 2444, Book 46, Hadith 5","grade":"","question #":"question #3","question":"What actions can be taken to prevent someone from oppressing others in an Islamic context?","id":"bukhari-46-91"},{"hadith-eng":"I heard Al-Bara' bin `Azib saying, \"The Prophet (ﷺ) orders us to do seven things and prohibited us from \ndoing seven other things.\" Then Al-Bara' mentioned the following:-- \n(1) To pay a visit to the sick (inquiring about his health), \n(2) to follow funeral processions, \n(3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), \n(4) to return greetings, \n(5) to help the oppressed, \n(6) to accept invitations, \n(7) to help others to fulfill their oaths. (See Hadith No. 753, Vol. 7)","reference":"Sahih al-Bukhari 2445, Book 46, Hadith 6","grade":"","question #":"question #3","question":"What are some of the prohibitions mentioned by the Prophet (ﷺ) that Muslims should avoid?","id":"bukhari-46-92"},{"hadith-eng":"The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each \nother.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced (while saying that).","reference":"Sahih al-Bukhari 2446, Book 46, Hadith 7","grade":"","question #":"question #3","question":"How can the metaphor of interlaced fingers illustrate the concept of solidarity among Muslims?","id":"bukhari-46-93"},{"hadith-eng":"The Prophet (ﷺ) said, \"Oppression will be a darkness on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 2447, Book 46, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of darkness as a metaphor for oppression in Islamic eschatology?","id":"bukhari-46-94"},{"hadith-eng":"The Prophet (ﷺ) sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no \nscreen between his invocation and Allah.\"","reference":"Sahih al-Bukhari 2448, Book 46, Hadith 9","grade":"","question #":"question #3","question":"How does the concept of a direct connection between the oppressed and Allah influence Islamic justice?","id":"bukhari-46-95"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever has oppressed another person concerning his reputation or anything \nelse, he should beg him to forgive him before the Day of Resurrection when there will be no money \n(to compensate for wrong deeds), but if he has good deeds, those good deeds will be taken from him \naccording to his oppression which he has done, and if he has no good deeds, the sins of the oppressed \nperson will be loaded on him.\"","reference":"Sahih al-Bukhari 2449, Book 46, Hadith 10","grade":"","question #":"question #3","question":"What are the consequences of not seeking forgiveness for oppressing others in this life?","id":"bukhari-46-96"},{"hadith-eng":"Regarding the explanation of the following verse:-- \"If a wife fears Cruelty or desertion On her \nhusband's part.\" (4.128) A man may dislike his wife and intend to divorce her, so she says to him, \"I \ngive up my rights, so do not divorce me.\" The above verse was revealed concerning such a case.","reference":"Sahih al-Bukhari 2450, Book 46, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of mutual agreement in marital disputes as per Islamic guidance?","id":"bukhari-46-97"},{"hadith-eng":"A drink (milk mixed with water) was brought to Allah's Messenger (ﷺ) who drank some of it. A boy was \nsitting to his right, and some old men to his left. Allah's Messenger (ﷺ) said to the boy, \"Do you allow me to \ngive the rest of the drink to these people?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference \nto anyone over me to drink the rest of it from which you have drunk.\" Allah's Messenger (ﷺ) then handed the \nbowl (of drink) to the boy. (See Hadith No. 541).","reference":"Sahih al-Bukhari 2451, Book 46, Hadith 12","grade":"","question #":"question #3","question":"What can be learned about the importance of seeking permission before giving away someone's right in this context?","id":"bukhari-46-98"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever usurps the land of somebody unjustly, his neck will be encircled with \nit down the seven earths (on the Day of Resurrection). \"","reference":"Sahih al-Bukhari 2452, Book 46, Hadith 13","grade":"","question #":"question #3","question":"What is the significance of the punishment described for those who unjustly seize land in the afterlife?","id":"bukhari-46-99"},{"hadith-eng":"That there was a dispute between him and some people (about a piece of land). When he told `Aisha \nabout it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet (ﷺ) said, 'Whoever \nusurps even one span of the land of somebody, his neck will be encircled with it down the seven \nearths.\"","reference":"Sahih al-Bukhari 2453, Book 46, Hadith 14","grade":"","question #":"question #3","question":"What advice did Aisha give regarding disputes over land ownership?","id":"bukhari-46-100"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven \nearths on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 2454, Book 46, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of the concept of 'sinking down the seven earths' in Islamic eschatology?","id":"bukhari-46-101"},{"hadith-eng":"\"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az- \nZubair used to give us dates. Ibn `Umar used to pass by and say, \"The Prophet (ﷺ) forbade us to eat two \ndates at a time, unless one takes the permission of one's companions.\"","reference":"Sahih al-Bukhari 2455, Book 46, Hadith 16","grade":"","question #":"question #3","question":"How does the practice of sharing and seeking permission reflect on social etiquette in Islam?","id":"bukhari-46-102"},{"hadith-eng":"There was an Ansari man called Abu Shu'aib who had a slave butcher. Abu Shu'aib said to him, \n\"Prepare a meal sufficient for five persons so that I might invite the Prophet (ﷺ) besides other four \npersons.\" Abu Shu'aib had seen the signs of hunger on the face of the Prophet (ﷺ) and so he invited him. \nAnother man who was not invited, followed the Prophet. The Prophet (ﷺ) said to Abu Shu'aib, \"This man \nhas followed us. Do you allow him to share the meal?\" Abu Shu'aib said, \"Yes.\"","reference":"Sahih al-Bukhari 2456, Book 46, Hadith 17","grade":"","question #":"question #3","question":"What is the significance of seeking permission before including an uninvited guest in a meal?","id":"bukhari-46-103"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most hated person in the sight of Allah is the most quarrelsome person.\"","reference":"Sahih al-Bukhari 2457, Book 46, Hadith 18","grade":"","question #":"question #3","question":"What are the consequences of being argumentative in Islam?","id":"bukhari-46-104"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling. He \ncame out and said, \"I am only a human being, and opponents come to me (to settle their problems); \nmaybe someone amongst you can present his case more eloquently than the other, whereby I may \nconsider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by \nmistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day \nof Resurrection).","reference":"Sahih al-Bukhari 2458, Book 46, Hadith 19","grade":"","question #":"question #3","question":"What are the consequences of unjustly taking another's rights according to this narration?","id":"bukhari-46-105"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has \none of the following four characteristics will have one characteristic of hypocrisy until he gives it up. \nThese are: (1 ) Whenever he talks, he tells a lie; (2) whenever he makes a promise, he breaks it; (3) \nwhenever he makes a covenant he proves treacherous; (4) and whenever he quarrels, he behaves \nimpudently in an evil insulting manner.\" (See Hadith No. 33 Vol. 1)","reference":"Sahih al-Bukhari 2459, Book 46, Hadith 20","grade":"","question #":"question #3","question":"What is the significance of truthfulness in speech in avoiding hypocrisy?","id":"bukhari-46-106"},{"hadith-eng":"Hind bint `Utba (Abu Sufyan's wife) came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is \nthere any harm if I spend something from his property for our children?\" He said, there is no harm for \nyou if you feed them from it justly and reasonably (with no extravagance).","reference":"Sahih al-Bukhari 2460, Book 46, Hadith 21","grade":"","question #":"question #3","question":"What are the ethical considerations in Islam when managing family finances, especially in cases of perceived miserliness?","id":"bukhari-46-107"},{"hadith-eng":"We said to the Prophet, \"You send us out and it happens that we have to stay with people who do not entertain us. What do you think about it? He said to us, \"If you stay with some people and they entertain you as they should for a guest, accept their hospitality, but if they don't, take the right of \r\nthe guest from them.\"","reference":"Sahih al-Bukhari 2461, Book 46, Hadith 22","grade":"","question #":"question #3","question":"What rights do guests have when staying with others according to Islamic teachings?","id":"bukhari-46-108"},{"hadith-eng":"When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani \nSa`ida. I said to Abu Bakr, \"Let us go.\" So, we come to them (i.e. to Ansar) at the shed of Bani Sa`ida. \n(See Hadith No. 19, Vol. 5 for details)","reference":"Sahih al-Bukhari 2462, Book 46, Hadith 23","grade":"","question #":"question #3","question":"How did the early Muslim community address leadership succession after the Prophet's death?","id":"bukhari-46-109"},{"hadith-eng":"Abu Huraira said, \"Allah's Messenger (ﷺ) said, 'No one should prevent his neighbor from fixing a wooden \npeg in his wall.\" Abu Huraira said (to his companions), \"Why do I find you averse to it? By Allah, I \ncertainly will narrate it to you.\"","reference":"Sahih al-Bukhari 2463, Book 46, Hadith 24","grade":"","question #":"question #3","question":"What can be inferred about the importance of community support and sharing in Islamic teachings?","id":"bukhari-46-110"},{"hadith-eng":"I was the butler of the people in the house of Abu Talha, and in those days drinks were prepared from \ndates. Allah's Messenger (ﷺ) ordered somebody to announce that alcoholic drinks had been prohibited. Abu \nTalha ordered me to go out and spill the wine. I went out and spilled it, and it flowed in the streets of \nMedina. Some people said, \"Some people were killed and wine was still in their stomachs.\" On that \nthe Divine revelation came:-- \"On those who believe And do good deeds There is no blame For what \nthey ate (in the past).\" (5.93)","reference":"Sahih al-Bukhari 2464, Book 46, Hadith 25","grade":"","question #":"question #3","question":"What actions were taken by the companions to comply with the new prohibition of alcohol?","id":"bukhari-46-111"},{"hadith-eng":"The Prophet (ﷺ) said, \"Beware! Avoid sitting on he roads (ways).\" The people said, \"There is no way out \nof it as these are our sitting places where we have talks.\" The Prophet (ﷺ) said, \"If you must sit there, then \nobserve the rights of the way.\" They asked, \"What are the rights of the way?\" He said, \"They are the \nlowering of your gazes (on seeing what is illegal to look at), refraining from harming people, returning \ngreetings, advocating good and forbidding evil.\"","reference":"Sahih al-Bukhari 2465, Book 46, Hadith 26","grade":"","question #":"question #3","question":"Why is it important to lower one's gaze and refrain from harming others in public settings?","id":"bukhari-46-112"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man felt very thirsty while he was on the way, there he came across a well. He \nwent down the well, quenched his thirst and came out. Meanwhile he saw a dog panting and licking \nmud because of excessive thirst. He said to himself, \"This dog is suffering from thirst as I did.\" So, he \nwent down the well again and filled his shoe with water and watered it. Allah thanked him for that \ndeed and forgave him. The people said, \"O Allah's Messenger (ﷺ)! Is there a reward for us in serving the \nanimals?\" He replied: \"Yes, there is a reward for serving any animate (living being).\" (See Hadith No. \n551)","reference":"Sahih al-Bukhari 2466, Book 46, Hadith 27","grade":"","question #":"question #3","question":"What is the significance of receiving a reward for serving any living being in Islamic teachings?","id":"bukhari-46-113"},{"hadith-eng":"Once the Prophet (ﷺ) stood at the top of one of the castles (or higher buildings) of Medina and said, \"Do \nyou see what I see? No doubt I am seeing the spots of afflictions amongst your houses as numerous as \nthe spots where raindrops fall (during a heavy rain). (See Hadith No. 102)","reference":"Sahih al-Bukhari 2467, Book 46, Hadith 28","grade":"","question #":"question #3","question":"What lessons can be drawn from the Prophet's warning about the prevalence of afflictions in Medina?","id":"bukhari-46-114"},{"hadith-eng":"I had been eager to ask `Umar about the two ladies from among the wives of the Prophet (ﷺ) regarding \nwhom Allah said (in the Qur'an saying): If you two (wives of the Prophet (ﷺ) namely Aisha and Hafsa) \nturn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes) \n(66.4), till performed the Hajj along with `Umar (and on our way back from Hajj) he went aside (to \nanswer the call of nature) and I also went aside along with him carrying a tumbler of water. When he \nhad answered the call of nature and returned. I poured water on his hands from the tumbler and he \nperformed ablution. I said, \"O Chief of the believers! ' Who were the two ladies from among the wives \nof the Prophet (ﷺ) to whom Allah said: \n'If you two return in repentance (66.4)? He said, \"I am astonished at your question, O Ibn `Abbas. \nThey were Aisha and Hafsa.\" \nThen `Umar went on relating the narration and said. \"I and an Ansari neighbor of mine from Bani \nUmaiya bin Zaid who used to live in `Awali Al-Medina, used to visit the Prophet (ﷺ) in turns. He used to \ngo one day, and I another day. When I went I would bring him the news of what had happened that \nday regarding the instructions and orders and when he went, he used to do the same for me. We, the \npeople of Quraish, used to have authority over women, but when we came to live with the Ansar, we \nnoticed that the Ansari women had the upper hand over their men, so our women started acquiring the \nhabits of the Ansari women. Once I shouted at my wife and she paid me back in my coin and I \ndisliked that she should answer me back. She said, 'Why do you take it ill that I retort upon you? By \nAllah, the wives of the Prophet (ﷺ) retort upon him, and some of them may not speak with him for the \nwhole day till night.' What she said scared me and I said to her, 'Whoever amongst them does so, will \nbe a great loser.' Then I dressed myself and went to Hafsa and asked her, 'Does any of you keep \nAllah's Messenger (ﷺ) angry all the day long till night?' She replied in the affirmative. I said, 'She is a ruined \nlosing person (and will never have success)! Doesn't she fear that Allah may get angry for the anger of \nAllah's Messenger (ﷺ) and thus she will be ruined? Don't ask Allah's Messenger (ﷺ) too many things, and don't \nretort upon him in any case, and don't desert him. Demand from me whatever you like, and don't be \ntempted to imitate your neighbor (i.e. `Aisha) in her behavior towards the Prophet), for she (i.e. Aisha) \nis more beautiful than you, and more beloved to Allah's Messenger (ﷺ). \nIn those days it was rumored that Ghassan, (a tribe living in Sham) was getting prepared their horses \nto invade us. My companion went (to the Prophet (ﷺ) on the day of his turn, went and returned to us at \nnight and knocked at my door violently, asking whether I was sleeping. I was scared (by the hard \nknocking) and came out to him. He said that a great thing had happened. I asked him: What is it? \nHave Ghassan come? He replied that it was worse and more serious than that, and added that Allah's \nApostle had divorced all his wives. I said, Hafsa is a ruined loser! I expected that would happen some \nday.' So I dressed myself and offered the Fajr prayer with the Prophet. Then the Prophet (ﷺ) entered an \nupper room and stayed there alone. I went to Hafsa and found her weeping. I asked her, 'Why are you \nweeping? Didn't I warn you? Have Allah's Messenger (ﷺ) divorced you all?' She replied, 'I don't know. He is \nthere in the upper room.' I then went out and came to the pulpit and found a group of people around it \nand some of them were weeping. \nThen I sat with them for some time, but could not endure the situation. So I went to the upper room \nwhere the Prophet (ﷺ) was and requested to a black slave of his: \"Will you get the permission of (Allah's \nApostle) for `Umar (to enter)? The slave went in, talked to the Prophet (ﷺ) about it and came out saying, 'I \nmentioned you to him but he did not reply.' So, I went and sat with the people who were sitting by the \npulpit, but I could not bear the situation, so I went to the slave again and said: \"Will you get he \npermission for `Umar? He went in and brought the same reply as before. When I was leaving, behold, \nthe slave called me saying, \"Allah's Messenger (ﷺ) has granted you permission.\" So, I entered upon the \nProphet and saw him lying on a mat without wedding on it, and the mat had left its mark on the body \nof the Prophet, and he was leaning on a leather pillow stuffed with palm fires. I greeted him and while \nstill standing, I said: \"Have you divorced your wives?' He raised his eyes to me and replied in the \nnegative. \nAnd then while still standing, I said chatting: \"Will you heed what I say, 'O Allah's Messenger (ﷺ)! We, the \npeople of Quraish used to have the upper hand over our women (wives), and when we came to the \npeople whose women had the upper hand over them...\" \n`Umar told the whole story (about his wife). \"On that the Prophet (ﷺ) smiled.\" `Umar further said, \"I then \nsaid, 'I went to Hafsa and said to her: Do not be tempted to imitate your companion (`Aisha) for she is \nmore beautiful than you and more beloved to the Prophet.' The Prophet (ﷺ) smiled again. When I saw him \nsmiling, I sat down and cast a glance at the room, and by Allah, I couldn't see anything of importance \nbut three hides. I said (to Allah's Messenger (ﷺ)) \"Invoke Allah to make your followers prosperous for the \nPersians and the Byzantines have been made prosperous and given worldly luxuries, though they do \nnot worship Allah?' The Prophet (ﷺ) was leaning then (and on hearing my speech he sat straight) and said, \n'O Ibn Al-Khattab! Do you have any doubt (that the Hereafter is better than this world)? These people \nhave been given rewards of their good deeds in this world only.' I asked the Prophet (ﷺ) . 'Please ask \nAllah's forgiveness for me. \nThe Prophet (ﷺ) did not go to his wives because of the secret which Hafsa had disclosed to `Aisha, and he \nsaid that he would not go to his wives for one month as he was angry with them when Allah \nadmonished him (for his oath that he would not approach Maria). When twenty-nine days had passed, \nthe Prophet (ﷺ) went to Aisha first of all. She said to him, 'You took an oath that you would not come to \nus for one month, and today only twenty-nine days have passed, as I have been counting them day by \nday.' The Prophet (ﷺ) said, 'The month is also of twenty-nine days.' That month consisted of twenty-nine \ndays. `Aisha said, 'When the Divine revelation of Choice was revealed, the Prophet (ﷺ) started with me, \nsaying to me, 'I am telling you something, but you need not hurry to give the reply till you can consult \nyour parents.\" `Aisha knew that her parents would not advise her to part with the Prophet (ﷺ) . \nThe Prophet (ﷺ) said that Allah had said: 'O Prophet! Say To your wives; If you desire The life of this \nworld And its glitter, ... then come! I will make a provision for you and set you free In a handsome \nmanner. But if you seek Allah And His Apostle, and The Home of the Hereafter, then Verily, Allah \nhas prepared For the good-doers amongst you A great reward.' (33.28) `Aisha said, 'Am I to consult \nmy parents about this? I indeed prefer Allah, His Apostle, and the Home of the Hereafter.' After that \nthe Prophet (ﷺ) gave the choice to his other wives and they also gave the same reply as `Aisha did.\"","reference":"Sahih al-Bukhari 2468, Book 46, Hadith 29","grade":"","question #":"question #3","question":"What does the hadith reveal about the Prophet Muhammad's (ﷺ) approach to conflict resolution and forgiveness within his household?","id":"bukhari-46-115"},{"hadith-eng":"Allah's Messenger (ﷺ) took an oath that he would not go to his wives for one month as his foot had been \nsprained. He stayed in an upper room when `Umar went to him and said, \"Have you divorced your \nwives?\" He said, \"No, but I have taken an oath that I would not go to them for one month.\" The \nProphet stayed there for twenty-nine days, and then came down and went to his wives.","reference":"Sahih al-Bukhari 2469, Book 46, Hadith 30","grade":"","question #":"question #3","question":"What can be learned from the Prophet's actions regarding the duration and fulfillment of oaths?","id":"bukhari-46-116"},{"hadith-eng":"The Prophet (ﷺ) entered the Mosque, and I too went there after tying the camel at the pavement of the \nMosque. I said (to the Prophet (ﷺ) ), \"This is your camel.\" He came out and started examining the camel \nand said, \"Both the camel and its price are for you.\"","reference":"Sahih al-Bukhari 2470, Book 46, Hadith 31","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) interaction with his companions from this event?","id":"bukhari-46-117"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) coming (or the Prophet (ﷺ) came) to the dumps of some people and urinated there \nwhile standing .","reference":"Sahih al-Bukhari 2471, Book 46, Hadith 32","grade":"","question #":"question #3","question":"What can be learned about the flexibility of Islamic practices from the actions of the Prophet (ﷺ) in this scenario?","id":"bukhari-46-118"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"While a man was on the way, he found a thorny branch of a tree there on the \nway and removed it. Allah thanked him for that deed and forgave him.\"","reference":"Sahih al-Bukhari 2472, Book 46, Hadith 33","grade":"","question #":"question #3","question":"What actions can lead to Allah's gratitude and forgiveness according to Islamic teachings?","id":"bukhari-46-119"},{"hadith-eng":"The Prophet (ﷺ) judged that seven cubits should be left as a public way when there was a dispute about \nthe land.","reference":"Sahih al-Bukhari 2473, Book 46, Hadith 34","grade":"","question #":"question #3","question":"What is the role of public pathways in community planning according to Islamic teachings?","id":"bukhari-46-120"},{"hadith-eng":"The Prophet (ﷺ) forbade robbery (taking away what belongs to others without their permission), and also \nforbade mutilation (or maiming) of bodies.","reference":"Sahih al-Bukhari 2474, Book 46, Hadith 35","grade":"","question #":"question #3","question":"How does Islam view the act of robbery and its implications on society?","id":"bukhari-46-121"},{"hadith-eng":"The Prophet (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at \nthe time, he is doing it, and when a drinker of an alcoholic liquor drinks it, then he is not a believer at \nthe time of drinking it, and when a thief steals, then he is not a believer at the time of stealing, and \nwhen a robber robs, and the people look at him, then he is not a believer at the time of doing robbery.","reference":"Sahih al-Bukhari 2475, Book 46, Hadith 36","grade":"","question #":"question #3","question":"What are the implications of committing sins such as drinking alcohol or robbery on a person's status as a believer?","id":"bukhari-46-122"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established until the son of Mary (i.e. Jesus) descends \namongst you as a just ruler, he will break the cross, kill the pigs, and abolish the Jizya tax. Money will \nbe in abundance so that nobody will accept it (as charitable gifts).","reference":"Sahih al-Bukhari 2476, Book 46, Hadith 37","grade":"","question #":"question #3","question":"How will the economic conditions change with the return of Jesus as described in Islamic tradition?","id":"bukhari-46-123"},{"hadith-eng":"On the day of Khaibar the Prophet (ﷺ) saw fires being lighted. He asked, \"Why are these fires being \nlighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and \nthrow away their contents.\" The people said, \"Shall we throw away their contents and wash the pots \n(rather than break them)?\" He said, \"Wash them.\"","reference":"Sahih al-Bukhari 2477, Book 46, Hadith 38","grade":"","question #":"question #3","question":"What does this incident teach about the handling of utensils that have been used for cooking prohibited food?","id":"bukhari-46-124"},{"hadith-eng":"The Prophet (ﷺ) entered Mecca and (at that time) there were three hundred-and-sixty idols around the \nKa`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has \ncome and Falsehood (disbelief) has vanished.\"","reference":"Sahih al-Bukhari 2478, Book 46, Hadith 39","grade":"","question #":"question #3","question":"What does the event of the Prophet entering Mecca and removing idols symbolize in the broader narrative of Islam's establishment?","id":"bukhari-46-125"},{"hadith-eng":"Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet (ﷺ) \ntore that curtain and she turned it into two cushions which remained in the house for the Prophet (ﷺ) to sit \non.","reference":"Sahih al-Bukhari 2479, Book 46, Hadith 40","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to modifying or repurposing items in the home?","id":"bukhari-46-126"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Whoever is killed while protecting his property then he is a martyr.\"","reference":"Sahih al-Bukhari 2480, Book 46, Hadith 41","grade":"","question #":"question #3","question":"What are the circumstances under which a person is considered a martyr in Islamic teachings?","id":"bukhari-46-127"},{"hadith-eng":"While the Prophet (ﷺ) was with one of his wives, one of the mothers of the believers (i.e. one of his \nwives) sent a wooden bowl containing food with a servant. The wife (in whose house he was sitting) \nstroke the bowl with her hand and broke it. The Prophet (ﷺ) collected the shattered pieces and put the food \nback in it and said, \"Eat.\" He kept the servant and the bowl till he had eaten the food. Then the \nProphet gave another unbroken. bowl to the servant and kept the broken one.","reference":"Sahih al-Bukhari 2481, Book 46, Hadith 42","grade":"","question #":"question #3","question":"How does the Prophet's (ﷺ) behavior in this incident reflect his approach to maintaining harmony in the household?","id":"bukhari-46-128"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There was an Israeli man called Juraij, while he was praying, his mother came \nand called him, but he did not respond to her call. He said (to himself) whether he should continue the \nprayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do \nnot let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said \nthat she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. \nShe then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and \nlater she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and \nbroke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the \nprayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby \nreplied that his father was the shepherd. The people said that they would build for him a hermitage of \ngold but Juraij asked them to make it of mud only.\"","reference":"Sahih al-Bukhari 2482, Book 46, Hadith 43","grade":"","question #":"question #3","question":"What role does divine intervention play in revealing the truth in difficult situations?","id":"bukhari-46-129"}]