[{"hadith-eng":"\"Allah's Messenger (ﷺ) sent an army towards the east coast and appointed Abu 'Ubaida bin Al-Jarrah as their \nchief, and the army consisted of three-hundred men including myself. We marched on till we reached \na place where our food was about to finish. Abu- 'Ubaida ordered us to collect all the journey food and \nit was collected. My (our) journey food was dates. Abu 'Ubaida kept on giving us our daily ration in \nsmall amounts from it, till it was exhausted. The share of everyone of us used to be one date only.\" I \nsaid, \"How could one date benefit you?\" Jabir replied, \"We came to know its value when even that too \nfinished.\" Jabir added, \"When we reached the sea-shore, we saw a huge fish which was like a small \nmountain. The army ate from it for eighteen days. Then Abu 'Ubaida ordered that two of its ribs be \nfixed and they were fixed in the ground. Then he ordered that a she-camel be ridden and it passed \nunder the two ribs (forming an arch) without touching them.\"","reference":"Sahih al-Bukhari 2483, Book 47, Hadith 1","grade":"","question #":"question #1","question":"What challenges did the army face during their expedition under the leadership of Abu 'Ubaida bin Al-Jarrah?","id":"bukhari-47-1"},{"hadith-eng":"Once (on a journey) our provisions diminished and the people were reduced to poverty. They went to the Prophet (ﷺ) \r\nand asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him \r\nabout it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the \r\nProphet and said, \"O Allah's Messenger (ﷺ)! How would they survive after slaughtering their camels?\" \r\nAllah's Messenger (ﷺ) ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A \r\nleather sheet was spread and all the food was collected and heaped over it. Allah's Messenger (ﷺ) \r\nstood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and \r\nthey started taking from it till all of them got what was sufficient for them. Allah's Messenger (ﷺ) then said, \r\n\"I testify that None has the right to be worshipped but Allah, and I am His Messenger.\"","reference":"Sahih al-Bukhari 2484, Book 47, Hadith 2","grade":"","question #":"question #1","question":"What lesson can be learned about resourcefulness and problem-solving in times of scarcity?","id":"bukhari-47-2"},{"hadith-eng":"We used to offer the `Asr prayer with the Prophet (ﷺ) and slaughter a camel, the meat of which would be \ndivided in ten parts. We would eat the cooked meat before sunset.","reference":"Sahih al-Bukhari 2485, Book 47, Hadith 3","grade":"","question #":"question #1","question":"What does this narration indicate about the timing of the `Asr prayer during the Prophet's time?","id":"bukhari-47-3"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the \nfood of their families in Medina ran short, they would collect all their remaining food in one sheet and \nthen distribute it among themselves equally by measuring it with a bowl. So, these people are from \nme, and I am from them.\"","reference":"Sahih al-Bukhari 2486, Book 47, Hadith 4","grade":"","question #":"question #1","question":"What can be learned about the importance of sharing and solidarity in times of scarcity from the actions of the Ash'ari tribe?","id":"bukhari-47-4"},{"hadith-eng":"that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's \nApostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.","reference":"Sahih al-Bukhari 2487, Book 47, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of documenting the laws of Zakat in Islam?","id":"bukhari-47-5"},{"hadith-eng":"My grandfather said, \"We were in the company of the Prophet (ﷺ) at Dhul-Hulaifa. The people felt \nhungry and captured some camels and sheep (as booty). The Prophet (ﷺ) was behind the people. They \nhurried and slaughtered the animals and put their meat in pots and started cooking it. (When the \nProphet came) he ordered the pots to be upset and then he distributed the animals (of the booty), \nregarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they \nwere exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah \nstopped the camel with it. The Prophet (ﷺ) said, \"Some of these animals are like wild animals, so if you \nlose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before \ndistributing them among the soldiers my grandfather said, \"We may meet the enemies in the future \nand have no knives; can we slaughter the animals with reeds?\" The Prophet (ﷺ) said, \"Use whatever \ncauses blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering \nthem. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones \n(i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not \nimitate for they are infidels).","reference":"Sahih al-Bukhari 2488, Book 47, Hadith 6","grade":"","question #":"question #1","question":"What guidance did the Prophet (ﷺ) provide regarding the distribution of captured animals as booty?","id":"bukhari-47-6"},{"hadith-eng":"The Prophet (ﷺ) decreed that one should not eat two dates together at a time unless he gets the permission \nfrom his companions (sharing the meal with him).","reference":"Sahih al-Bukhari 2489, Book 47, Hadith 7","grade":"","question #":"question #1","question":"What etiquette should be observed when sharing food with others?","id":"bukhari-47-7"},{"hadith-eng":"\"While at Medina we were struck with famine. Ibn Az-Zubair used to provide us with dates as our \nfood. Ibn `Umar used to pass by us and say, \"Don't eat two dates together at a time as the Prophet (ﷺ) has \nforbidden eating two dates together at a time (in a gathering) unless one takes the permission of one's \ncompanion brother.\"","reference":"Sahih al-Bukhari 2490, Book 47, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of seeking permission from companions when sharing food?","id":"bukhari-47-8"},{"hadith-eng":"Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'If one manumits his share of a jointly possessed slave, and can \nafford the price of the other shares according to the adequate price of the slave, the slave will be \ncompletely manumitted; otherwise he will be partially manumitted.' \" (Aiyub, a sub-narrator is not \nsure whether the saying \" ... otherwise he will be partially manumitted\" was said by Nafi` or the \nProphet.)","reference":"Sahih al-Bukhari 2491, Book 47, Hadith 9","grade":"","question #":"question #1","question":"What is the process of manumitting a jointly owned slave according to Islamic teachings?","id":"bukhari-47-9"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him \nto get that slave manumitted completely by paying the remaining price, and if he does not have \nsufficient money to manumit him, then the price of the slave should be estimated justly, and he is to \nbe allowed to work and earn the amount that will manumit him (without overburdening him)\".","reference":"Sahih al-Bukhari 2492, Book 47, Hadith 10","grade":"","question #":"question #1","question":"What are the responsibilities of a person who owns a share of a jointly possessed slave in terms of manumission?","id":"bukhari-47-10"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of the person abiding by Allah's order and restrictions in comparison \nto those who violate them is like the example of those persons who drew lots for their seats in a boat. \nSome of them got seats in the upper part, and the others in the lower. When the latter needed water, \nthey had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our \nshare of the ship (and get water) saving those who are above us from troubling them. So, if the people \nin the upper part left the others do what they had suggested, all the people of the ship would be \ndestroyed, but if they prevented them, both parties would be safe.\"","reference":"Sahih al-Bukhari 2493, Book 47, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of collective responsibility in maintaining societal order according to Islamic teachings?","id":"bukhari-47-11"},{"hadith-eng":"That he had asked `Aisha about the meaning of the Statement of Allah: \"If you fear that you shall not \nBe able to deal justly With the orphan girls, then Marry (Other) women of your choice Two or three or \nfour.\" (4.3) \nShe said, \"O my nephew! This is about the orphan girl who lives with her guardian and shares his \nproperty. Her wealth and beauty may tempt him to marry her without giving her an adequate Mahr \n(bridal-money) which might have been given by another suitor. So, such guardians were forbidden to \nmarry such orphan girls unless they treated them justly and gave them the most suitable Mahr; \notherwise they were ordered to marry any other woman.\" `Aisha further said, \"After that verse the \npeople again asked the Prophet (about the marriage with orphan 'girls), so Allah revealed the \nfollowing verses:-- 'They ask your instruction Concerning the women. Say: Allah Instructs you about \nthem And about what is Recited unto you In the Book, concerning The orphan girls to whom You \ngive not the prescribed portions and yet whom you Desire to marry...\" (4.127) \nWhat is meant by Allah's Saying:-- 'And about what is Recited unto you is the former verse which \ngoes:-- 'If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (other) \nwomen of your choice.' (4.3) `Aisha said, \"Allah's saying in the other verse:--'Yet whom you desire to \nmarry' (4.127) means the desire of the guardian to marry an orphan girl under his supervision when \nshe has not much property or beauty (in which case he should treat her justly). The guardians were \nforbidden to marry their orphan girls possessing property and beauty without being just to them, as \nthey generally refrain from marrying them (when they are neither beautiful nor wealthy).","reference":"Sahih al-Bukhari 2494, Book 47, Hadith 12","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the treatment and marriage of orphan girls under a guardian's care?","id":"bukhari-47-12"},{"hadith-eng":"The Prophet (ﷺ) established the right of Shu'fa (i.e. Preemption) in joint properties; but when the land is \ndivided and the ways are demarcated, then there is no pre-emption.","reference":"Sahih al-Bukhari 2495, Book 47, Hadith 13","grade":"","question #":"question #1","question":"What is the concept of preemption in joint properties in Islamic law?","id":"bukhari-47-13"},{"hadith-eng":"The Prophet (ﷺ) said, \"The right of preemption is valid in every joint property, but when the land is \ndivided and the way is demarcated, then there is no right of pre-emption.\"","reference":"Sahih al-Bukhari 2496, Book 47, Hadith 14","grade":"","question #":"question #1","question":"What is the concept of preemption in joint property ownership in Islamic law?","id":"bukhari-47-14"},{"hadith-eng":"I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine \nbought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked \nabout it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet (ﷺ) \nand asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"","reference":"Sahih al-Bukhari 2497, 2498, Book 47, Hadith 15","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding transactions involving both cash and credit?","id":"bukhari-47-15"},{"hadith-eng":"Allah's Messenger (ﷺ) rented the land of Khaibar to the Jews on the condition that they would work on it and \ncultivate it and take half of its yield.","reference":"Sahih al-Bukhari 2499, Book 47, Hadith 16","grade":"","question #":"question #1","question":"What are the conditions under which land can be rented to non-Muslims in Islamic law?","id":"bukhari-47-16"},{"hadith-eng":"that Allah's Messenger (ﷺ) gave him some sheep to distribute among his companions in order to sacrifice \nthem and a kid was left. He told the Prophet (ﷺ) about it and the Prophet (ﷺ) said to him, \"Sacrifice it on your \nbehalf.\"","reference":"Sahih al-Bukhari 2500, Book 47, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of distributing sacrificial animals among companions in Islam?","id":"bukhari-47-17"},{"hadith-eng":"that his mother Zainab bint Humaid took him to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take the \npledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his \nhand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated \nthat he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn \n`Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet (ﷺ) invoked \nAllah to bless you.\" So, he would be their partner, and very often he would win a camel's load and \nsend it home.","reference":"Sahih al-Bukhari 2501, 2502, Book 47, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of the Prophet's invocation for blessings on a young child in Islamic tradition?","id":"bukhari-47-18"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share o a jointly possessed slave, it is imperative on him to \nmanumit the slave completely if he has sufficient money to pay the rest of its price which is to be \nestimated justly. He should pay his partners their shares and release him (the freed one).","reference":"Sahih al-Bukhari 2503, Book 47, Hadith 19","grade":"","question #":"question #1","question":"What are the financial responsibilities of a person who partially owns a slave and decides to free their share?","id":"bukhari-47-19"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to \nmanumit the slave completely if he has sufficient money. Otherwise he should look for some work for \nthe slave (to earn what would enable him to emancipate himself), without overburdening him with \nwork.\"","reference":"Sahih al-Bukhari 2504, Book 47, Hadith 20","grade":"","question #":"question #1","question":"What are the responsibilities of a person who owns a share of a jointly possessed slave in terms of emancipation?","id":"bukhari-47-20"},{"hadith-eng":"The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.","reference":"Sahih al-Bukhari 2505, 2506, Book 47, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of changing the intention of Ihram from Hajj to Umrah during the pilgrimage?","id":"bukhari-47-21"},{"hadith-eng":"The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.","reference":"Sahih al-Bukhari 2505, 2506, Book 47, Hadith 21","grade":"","question #":"question #1","question":"What was the significance of changing the intention of Ihram from Hajj to Umrah during the Prophet's time?","id":"bukhari-47-22"},{"hadith-eng":"My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the \ncompany of the Prophet (ﷺ) and had some camels and sheep (of the booty). The people hurried (in \nslaughtering the animals) and put their meat in the pots and started cooking. Allah's Messenger (ﷺ) came and \nordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. \nOne of the camels fled and the people had only a few horses, so they got worried. (The camel was \nchased and) a man slopped the camel by throwing an arrow at it. Allah's Messenger (ﷺ) said, 'Some of these \nanimals are untamed like wild animals, so if anyone of them went out of your control, then you should \ntreat it as you have done now.' \" My grandfather said, \"O Allah's Messenger (ﷺ)! We fear that we may meet \nour enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet (ﷺ) \nsaid, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is \nslaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or \nfingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used \nby Ethiopians for slaughtering. (See Hadith 668)","reference":"Sahih al-Bukhari 2507, Book 47, Hadith 22","grade":"","question #":"question #1","question":"What guidelines did the Prophet Muhammad (ﷺ) provide for slaughtering animals in the absence of knives?","id":"bukhari-47-23"},{"hadith-eng":"\"Allah's Messenger (ﷺ) sent an army towards the east coast and appointed Abu 'Ubaida bin Al-Jarrah as their \nchief, and the army consisted of three-hundred men including myself. We marched on till we reached \na place where our food was about to finish. Abu- 'Ubaida ordered us to collect all the journey food and \nit was collected. My (our) journey food was dates. Abu 'Ubaida kept on giving us our daily ration in \nsmall amounts from it, till it was exhausted. The share of everyone of us used to be one date only.\" I \nsaid, \"How could one date benefit you?\" Jabir replied, \"We came to know its value when even that too \nfinished.\" Jabir added, \"When we reached the sea-shore, we saw a huge fish which was like a small \nmountain. The army ate from it for eighteen days. Then Abu 'Ubaida ordered that two of its ribs be \nfixed and they were fixed in the ground. Then he ordered that a she-camel be ridden and it passed \nunder the two ribs (forming an arch) without touching them.\"","reference":"Sahih al-Bukhari 2483, Book 47, Hadith 1","grade":"","question #":"question #2","question":"How did the army manage their food supplies when they were about to finish during the expedition?","id":"bukhari-47-24"},{"hadith-eng":"Once (on a journey) our provisions diminished and the people were reduced to poverty. They went to the Prophet (ﷺ) \r\nand asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him \r\nabout it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the \r\nProphet and said, \"O Allah's Messenger (ﷺ)! How would they survive after slaughtering their camels?\" \r\nAllah's Messenger (ﷺ) ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A \r\nleather sheet was spread and all the food was collected and heaped over it. Allah's Messenger (ﷺ) \r\nstood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and \r\nthey started taking from it till all of them got what was sufficient for them. Allah's Messenger (ﷺ) then said, \r\n\"I testify that None has the right to be worshipped but Allah, and I am His Messenger.\"","reference":"Sahih al-Bukhari 2484, Book 47, Hadith 2","grade":"","question #":"question #2","question":"How does the invocation of blessings play a role in addressing communal needs?","id":"bukhari-47-25"},{"hadith-eng":"We used to offer the `Asr prayer with the Prophet (ﷺ) and slaughter a camel, the meat of which would be \ndivided in ten parts. We would eat the cooked meat before sunset.","reference":"Sahih al-Bukhari 2485, Book 47, Hadith 3","grade":"","question #":"question #2","question":"How was the division and consumption of meat organized among the companions after slaughtering a camel?","id":"bukhari-47-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the \nfood of their families in Medina ran short, they would collect all their remaining food in one sheet and \nthen distribute it among themselves equally by measuring it with a bowl. So, these people are from \nme, and I am from them.\"","reference":"Sahih al-Bukhari 2486, Book 47, Hadith 4","grade":"","question #":"question #2","question":"How does the practice of distributing food equally reflect the values of community and brotherhood in Islam?","id":"bukhari-47-27"},{"hadith-eng":"that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's \nApostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.","reference":"Sahih al-Bukhari 2487, Book 47, Hadith 5","grade":"","question #":"question #2","question":"How is Zakat calculated for partners possessing joint property?","id":"bukhari-47-28"},{"hadith-eng":"My grandfather said, \"We were in the company of the Prophet (ﷺ) at Dhul-Hulaifa. The people felt \nhungry and captured some camels and sheep (as booty). The Prophet (ﷺ) was behind the people. They \nhurried and slaughtered the animals and put their meat in pots and started cooking it. (When the \nProphet came) he ordered the pots to be upset and then he distributed the animals (of the booty), \nregarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they \nwere exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah \nstopped the camel with it. The Prophet (ﷺ) said, \"Some of these animals are like wild animals, so if you \nlose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before \ndistributing them among the soldiers my grandfather said, \"We may meet the enemies in the future \nand have no knives; can we slaughter the animals with reeds?\" The Prophet (ﷺ) said, \"Use whatever \ncauses blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering \nthem. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones \n(i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not \nimitate for they are infidels).","reference":"Sahih al-Bukhari 2488, Book 47, Hadith 6","grade":"","question #":"question #2","question":"How should one handle a runaway animal according to the teachings of the Prophet (ﷺ)?","id":"bukhari-47-29"},{"hadith-eng":"The Prophet (ﷺ) decreed that one should not eat two dates together at a time unless he gets the permission \nfrom his companions (sharing the meal with him).","reference":"Sahih al-Bukhari 2489, Book 47, Hadith 7","grade":"","question #":"question #2","question":"Why is it important to seek permission from companions when taking more than one's share of food?","id":"bukhari-47-30"},{"hadith-eng":"\"While at Medina we were struck with famine. Ibn Az-Zubair used to provide us with dates as our \nfood. Ibn `Umar used to pass by us and say, \"Don't eat two dates together at a time as the Prophet (ﷺ) has \nforbidden eating two dates together at a time (in a gathering) unless one takes the permission of one's \ncompanion brother.\"","reference":"Sahih al-Bukhari 2490, Book 47, Hadith 8","grade":"","question #":"question #2","question":"Why might it be important to avoid eating two dates at once in a communal setting?","id":"bukhari-47-31"},{"hadith-eng":"Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'If one manumits his share of a jointly possessed slave, and can \nafford the price of the other shares according to the adequate price of the slave, the slave will be \ncompletely manumitted; otherwise he will be partially manumitted.' \" (Aiyub, a sub-narrator is not \nsure whether the saying \" ... otherwise he will be partially manumitted\" was said by Nafi` or the \nProphet.)","reference":"Sahih al-Bukhari 2491, Book 47, Hadith 9","grade":"","question #":"question #2","question":"How does the ability to afford the price of other shares affect the manumission of a slave?","id":"bukhari-47-32"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him \nto get that slave manumitted completely by paying the remaining price, and if he does not have \nsufficient money to manumit him, then the price of the slave should be estimated justly, and he is to \nbe allowed to work and earn the amount that will manumit him (without overburdening him)\".","reference":"Sahih al-Bukhari 2492, Book 47, Hadith 10","grade":"","question #":"question #2","question":"How should the price of a slave be estimated if the owner cannot afford to manumit him completely?","id":"bukhari-47-33"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of the person abiding by Allah's order and restrictions in comparison \nto those who violate them is like the example of those persons who drew lots for their seats in a boat. \nSome of them got seats in the upper part, and the others in the lower. When the latter needed water, \nthey had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our \nshare of the ship (and get water) saving those who are above us from troubling them. So, if the people \nin the upper part left the others do what they had suggested, all the people of the ship would be \ndestroyed, but if they prevented them, both parties would be safe.\"","reference":"Sahih al-Bukhari 2493, Book 47, Hadith 11","grade":"","question #":"question #2","question":"How can the actions of a few individuals impact the well-being of a larger community?","id":"bukhari-47-34"},{"hadith-eng":"That he had asked `Aisha about the meaning of the Statement of Allah: \"If you fear that you shall not \nBe able to deal justly With the orphan girls, then Marry (Other) women of your choice Two or three or \nfour.\" (4.3) \nShe said, \"O my nephew! This is about the orphan girl who lives with her guardian and shares his \nproperty. Her wealth and beauty may tempt him to marry her without giving her an adequate Mahr \n(bridal-money) which might have been given by another suitor. So, such guardians were forbidden to \nmarry such orphan girls unless they treated them justly and gave them the most suitable Mahr; \notherwise they were ordered to marry any other woman.\" `Aisha further said, \"After that verse the \npeople again asked the Prophet (about the marriage with orphan 'girls), so Allah revealed the \nfollowing verses:-- 'They ask your instruction Concerning the women. Say: Allah Instructs you about \nthem And about what is Recited unto you In the Book, concerning The orphan girls to whom You \ngive not the prescribed portions and yet whom you Desire to marry...\" (4.127) \nWhat is meant by Allah's Saying:-- 'And about what is Recited unto you is the former verse which \ngoes:-- 'If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (other) \nwomen of your choice.' (4.3) `Aisha said, \"Allah's saying in the other verse:--'Yet whom you desire to \nmarry' (4.127) means the desire of the guardian to marry an orphan girl under his supervision when \nshe has not much property or beauty (in which case he should treat her justly). The guardians were \nforbidden to marry their orphan girls possessing property and beauty without being just to them, as \nthey generally refrain from marrying them (when they are neither beautiful nor wealthy).","reference":"Sahih al-Bukhari 2494, Book 47, Hadith 12","grade":"","question #":"question #2","question":"How does the Quran address the issue of justice and fairness in the marriage of orphan girls?","id":"bukhari-47-35"},{"hadith-eng":"The Prophet (ﷺ) established the right of Shu'fa (i.e. Preemption) in joint properties; but when the land is \ndivided and the ways are demarcated, then there is no pre-emption.","reference":"Sahih al-Bukhari 2495, Book 47, Hadith 13","grade":"","question #":"question #2","question":"How does the division of land and demarcation of ways affect the right of preemption?","id":"bukhari-47-36"},{"hadith-eng":"The Prophet (ﷺ) said, \"The right of preemption is valid in every joint property, but when the land is \ndivided and the way is demarcated, then there is no right of pre-emption.\"","reference":"Sahih al-Bukhari 2496, Book 47, Hadith 14","grade":"","question #":"question #2","question":"How does the division of land affect the right of preemption in Islamic jurisprudence?","id":"bukhari-47-37"},{"hadith-eng":"I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine \nbought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked \nabout it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet (ﷺ) \nand asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"","reference":"Sahih al-Bukhari 2497, 2498, Book 47, Hadith 15","grade":"","question #":"question #2","question":"How should one handle financial transactions to ensure they align with Islamic principles?","id":"bukhari-47-38"},{"hadith-eng":"Allah's Messenger (ﷺ) rented the land of Khaibar to the Jews on the condition that they would work on it and \ncultivate it and take half of its yield.","reference":"Sahih al-Bukhari 2499, Book 47, Hadith 16","grade":"","question #":"question #2","question":"How does Islamic law address agricultural partnerships and profit-sharing agreements?","id":"bukhari-47-39"},{"hadith-eng":"that Allah's Messenger (ﷺ) gave him some sheep to distribute among his companions in order to sacrifice \nthem and a kid was left. He told the Prophet (ﷺ) about it and the Prophet (ﷺ) said to him, \"Sacrifice it on your \nbehalf.\"","reference":"Sahih al-Bukhari 2500, Book 47, Hadith 17","grade":"","question #":"question #2","question":"How should one handle leftover sacrificial animals according to Islamic teachings?","id":"bukhari-47-40"},{"hadith-eng":"that his mother Zainab bint Humaid took him to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take the \npledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his \nhand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated \nthat he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn \n`Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet (ﷺ) invoked \nAllah to bless you.\" So, he would be their partner, and very often he would win a camel's load and \nsend it home.","reference":"Sahih al-Bukhari 2501, 2502, Book 47, Hadith 18","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate wisdom in deciding when a person is ready to take a pledge of allegiance?","id":"bukhari-47-41"},{"hadith-eng":"that his mother Zainab bint Humaid took him to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take the \npledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his \nhand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated \nthat he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn \n`Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet (ﷺ) invoked \nAllah to bless you.\" So, he would be their partner, and very often he would win a camel's load and \nsend it home.","reference":"Sahih al-Bukhari 2501, 2502, Book 47, Hadith 18","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate wisdom in deciding when a person is ready for certain responsibilities?","id":"bukhari-47-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share o a jointly possessed slave, it is imperative on him to \nmanumit the slave completely if he has sufficient money to pay the rest of its price which is to be \nestimated justly. He should pay his partners their shares and release him (the freed one).","reference":"Sahih al-Bukhari 2503, Book 47, Hadith 19","grade":"","question #":"question #2","question":"How should the value of a jointly owned slave be determined if one owner wishes to free their share?","id":"bukhari-47-43"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to \nmanumit the slave completely if he has sufficient money. Otherwise he should look for some work for \nthe slave (to earn what would enable him to emancipate himself), without overburdening him with \nwork.\"","reference":"Sahih al-Bukhari 2504, Book 47, Hadith 20","grade":"","question #":"question #2","question":"How should one approach the process of freeing a slave if they do not have sufficient funds?","id":"bukhari-47-44"},{"hadith-eng":"The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.","reference":"Sahih al-Bukhari 2505, 2506, Book 47, Hadith 21","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address concerns and questions from his companions regarding the rituals of Hajj and Umrah?","id":"bukhari-47-45"},{"hadith-eng":"The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.","reference":"Sahih al-Bukhari 2505, 2506, Book 47, Hadith 21","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address concerns and misunderstandings among his companions regarding the rituals of Hajj and Umrah?","id":"bukhari-47-46"},{"hadith-eng":"My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the \ncompany of the Prophet (ﷺ) and had some camels and sheep (of the booty). The people hurried (in \nslaughtering the animals) and put their meat in the pots and started cooking. Allah's Messenger (ﷺ) came and \nordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. \nOne of the camels fled and the people had only a few horses, so they got worried. (The camel was \nchased and) a man slopped the camel by throwing an arrow at it. Allah's Messenger (ﷺ) said, 'Some of these \nanimals are untamed like wild animals, so if anyone of them went out of your control, then you should \ntreat it as you have done now.' \" My grandfather said, \"O Allah's Messenger (ﷺ)! We fear that we may meet \nour enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet (ﷺ) \nsaid, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is \nslaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or \nfingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used \nby Ethiopians for slaughtering. (See Hadith 668)","reference":"Sahih al-Bukhari 2507, Book 47, Hadith 22","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the issue of untamed animals during the distribution of booty?","id":"bukhari-47-47"},{"hadith-eng":"\"Allah's Messenger (ﷺ) sent an army towards the east coast and appointed Abu 'Ubaida bin Al-Jarrah as their \nchief, and the army consisted of three-hundred men including myself. We marched on till we reached \na place where our food was about to finish. Abu- 'Ubaida ordered us to collect all the journey food and \nit was collected. My (our) journey food was dates. Abu 'Ubaida kept on giving us our daily ration in \nsmall amounts from it, till it was exhausted. The share of everyone of us used to be one date only.\" I \nsaid, \"How could one date benefit you?\" Jabir replied, \"We came to know its value when even that too \nfinished.\" Jabir added, \"When we reached the sea-shore, we saw a huge fish which was like a small \nmountain. The army ate from it for eighteen days. Then Abu 'Ubaida ordered that two of its ribs be \nfixed and they were fixed in the ground. Then he ordered that a she-camel be ridden and it passed \nunder the two ribs (forming an arch) without touching them.\"","reference":"Sahih al-Bukhari 2483, Book 47, Hadith 1","grade":"","question #":"question #3","question":"What miraculous event did the army experience at the sea-shore that helped them survive?","id":"bukhari-47-48"},{"hadith-eng":"Once (on a journey) our provisions diminished and the people were reduced to poverty. They went to the Prophet (ﷺ) \r\nand asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him \r\nabout it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the \r\nProphet and said, \"O Allah's Messenger (ﷺ)! How would they survive after slaughtering their camels?\" \r\nAllah's Messenger (ﷺ) ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A \r\nleather sheet was spread and all the food was collected and heaped over it. Allah's Messenger (ﷺ) \r\nstood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and \r\nthey started taking from it till all of them got what was sufficient for them. Allah's Messenger (ﷺ) then said, \r\n\"I testify that None has the right to be worshipped but Allah, and I am His Messenger.\"","reference":"Sahih al-Bukhari 2484, Book 47, Hadith 2","grade":"","question #":"question #3","question":"What significance does the testimony of faith hold in the context of this event?","id":"bukhari-47-49"},{"hadith-eng":"We used to offer the `Asr prayer with the Prophet (ﷺ) and slaughter a camel, the meat of which would be \ndivided in ten parts. We would eat the cooked meat before sunset.","reference":"Sahih al-Bukhari 2485, Book 47, Hadith 3","grade":"","question #":"question #3","question":"What does this narration reveal about the social practices and communal activities of the companions during the Prophet's era?","id":"bukhari-47-50"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the \nfood of their families in Medina ran short, they would collect all their remaining food in one sheet and \nthen distribute it among themselves equally by measuring it with a bowl. So, these people are from \nme, and I am from them.\"","reference":"Sahih al-Bukhari 2486, Book 47, Hadith 4","grade":"","question #":"question #3","question":"What does the statement 'these people are from me, and I am from them' signify about the relationship between the Prophet and the Ash'ari tribe?","id":"bukhari-47-51"},{"hadith-eng":"that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's \nApostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.","reference":"Sahih al-Bukhari 2487, Book 47, Hadith 5","grade":"","question #":"question #3","question":"What role did Abu Bakr As-Siddiq play in the implementation of Zakat laws?","id":"bukhari-47-52"},{"hadith-eng":"My grandfather said, \"We were in the company of the Prophet (ﷺ) at Dhul-Hulaifa. The people felt \nhungry and captured some camels and sheep (as booty). The Prophet (ﷺ) was behind the people. They \nhurried and slaughtered the animals and put their meat in pots and started cooking it. (When the \nProphet came) he ordered the pots to be upset and then he distributed the animals (of the booty), \nregarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they \nwere exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah \nstopped the camel with it. The Prophet (ﷺ) said, \"Some of these animals are like wild animals, so if you \nlose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before \ndistributing them among the soldiers my grandfather said, \"We may meet the enemies in the future \nand have no knives; can we slaughter the animals with reeds?\" The Prophet (ﷺ) said, \"Use whatever \ncauses blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering \nthem. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones \n(i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not \nimitate for they are infidels).","reference":"Sahih al-Bukhari 2488, Book 47, Hadith 6","grade":"","question #":"question #3","question":"What are the permissible methods of slaughtering animals in Islam, and what should be avoided?","id":"bukhari-47-53"},{"hadith-eng":"The Prophet (ﷺ) decreed that one should not eat two dates together at a time unless he gets the permission \nfrom his companions (sharing the meal with him).","reference":"Sahih al-Bukhari 2489, Book 47, Hadith 7","grade":"","question #":"question #3","question":"How does this teaching promote fairness and consideration in communal meals?","id":"bukhari-47-54"},{"hadith-eng":"\"While at Medina we were struck with famine. Ibn Az-Zubair used to provide us with dates as our \nfood. Ibn `Umar used to pass by us and say, \"Don't eat two dates together at a time as the Prophet (ﷺ) has \nforbidden eating two dates together at a time (in a gathering) unless one takes the permission of one's \ncompanion brother.\"","reference":"Sahih al-Bukhari 2490, Book 47, Hadith 8","grade":"","question #":"question #3","question":"How does this teaching reflect on the etiquette of sharing and consuming food in Islam?","id":"bukhari-47-55"},{"hadith-eng":"Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'If one manumits his share of a jointly possessed slave, and can \nafford the price of the other shares according to the adequate price of the slave, the slave will be \ncompletely manumitted; otherwise he will be partially manumitted.' \" (Aiyub, a sub-narrator is not \nsure whether the saying \" ... otherwise he will be partially manumitted\" was said by Nafi` or the \nProphet.)","reference":"Sahih al-Bukhari 2491, Book 47, Hadith 9","grade":"","question #":"question #3","question":"What happens if a person cannot afford to buy the remaining shares of a jointly owned slave?","id":"bukhari-47-56"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him \nto get that slave manumitted completely by paying the remaining price, and if he does not have \nsufficient money to manumit him, then the price of the slave should be estimated justly, and he is to \nbe allowed to work and earn the amount that will manumit him (without overburdening him)\".","reference":"Sahih al-Bukhari 2492, Book 47, Hadith 10","grade":"","question #":"question #3","question":"What is the process for a slave to earn their freedom if their owner cannot pay for their complete manumission?","id":"bukhari-47-57"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of the person abiding by Allah's order and restrictions in comparison \nto those who violate them is like the example of those persons who drew lots for their seats in a boat. \nSome of them got seats in the upper part, and the others in the lower. When the latter needed water, \nthey had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our \nshare of the ship (and get water) saving those who are above us from troubling them. So, if the people \nin the upper part left the others do what they had suggested, all the people of the ship would be \ndestroyed, but if they prevented them, both parties would be safe.\"","reference":"Sahih al-Bukhari 2493, Book 47, Hadith 11","grade":"","question #":"question #3","question":"What lessons can be drawn about cooperation and prevention of harm in a community setting?","id":"bukhari-47-58"},{"hadith-eng":"That he had asked `Aisha about the meaning of the Statement of Allah: \"If you fear that you shall not \nBe able to deal justly With the orphan girls, then Marry (Other) women of your choice Two or three or \nfour.\" (4.3) \nShe said, \"O my nephew! This is about the orphan girl who lives with her guardian and shares his \nproperty. Her wealth and beauty may tempt him to marry her without giving her an adequate Mahr \n(bridal-money) which might have been given by another suitor. So, such guardians were forbidden to \nmarry such orphan girls unless they treated them justly and gave them the most suitable Mahr; \notherwise they were ordered to marry any other woman.\" `Aisha further said, \"After that verse the \npeople again asked the Prophet (about the marriage with orphan 'girls), so Allah revealed the \nfollowing verses:-- 'They ask your instruction Concerning the women. Say: Allah Instructs you about \nthem And about what is Recited unto you In the Book, concerning The orphan girls to whom You \ngive not the prescribed portions and yet whom you Desire to marry...\" (4.127) \nWhat is meant by Allah's Saying:-- 'And about what is Recited unto you is the former verse which \ngoes:-- 'If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (other) \nwomen of your choice.' (4.3) `Aisha said, \"Allah's saying in the other verse:--'Yet whom you desire to \nmarry' (4.127) means the desire of the guardian to marry an orphan girl under his supervision when \nshe has not much property or beauty (in which case he should treat her justly). The guardians were \nforbidden to marry their orphan girls possessing property and beauty without being just to them, as \nthey generally refrain from marrying them (when they are neither beautiful nor wealthy).","reference":"Sahih al-Bukhari 2494, Book 47, Hadith 12","grade":"","question #":"question #3","question":"What are the conditions under which a guardian is allowed to marry an orphan girl in his care according to Islamic teachings?","id":"bukhari-47-59"},{"hadith-eng":"The Prophet (ﷺ) established the right of Shu'fa (i.e. Preemption) in joint properties; but when the land is \ndivided and the ways are demarcated, then there is no pre-emption.","reference":"Sahih al-Bukhari 2495, Book 47, Hadith 13","grade":"","question #":"question #3","question":"What are the conditions under which the right of preemption is not applicable?","id":"bukhari-47-60"},{"hadith-eng":"The Prophet (ﷺ) said, \"The right of preemption is valid in every joint property, but when the land is \ndivided and the way is demarcated, then there is no right of pre-emption.\"","reference":"Sahih al-Bukhari 2496, Book 47, Hadith 14","grade":"","question #":"question #3","question":"What conditions must be met for the right of preemption to be invalidated in shared property?","id":"bukhari-47-61"},{"hadith-eng":"I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine \nbought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked \nabout it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet (ﷺ) \nand asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"","reference":"Sahih al-Bukhari 2497, 2498, Book 47, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of immediate exchange in financial dealings according to Islamic teachings?","id":"bukhari-47-62"},{"hadith-eng":"I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine \nbought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked \nabout it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet (ﷺ) \nand asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"","reference":"Sahih al-Bukhari 2497, 2498, Book 47, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of conducting transactions hand to hand in Islamic finance?","id":"bukhari-47-63"},{"hadith-eng":"Allah's Messenger (ﷺ) rented the land of Khaibar to the Jews on the condition that they would work on it and \ncultivate it and take half of its yield.","reference":"Sahih al-Bukhari 2499, Book 47, Hadith 16","grade":"","question #":"question #3","question":"What historical agreements were made between Muslims and Jews during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-47-64"},{"hadith-eng":"that Allah's Messenger (ﷺ) gave him some sheep to distribute among his companions in order to sacrifice \nthem and a kid was left. He told the Prophet (ﷺ) about it and the Prophet (ﷺ) said to him, \"Sacrifice it on your \nbehalf.\"","reference":"Sahih al-Bukhari 2500, Book 47, Hadith 17","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding personal sacrifices?","id":"bukhari-47-65"},{"hadith-eng":"that his mother Zainab bint Humaid took him to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take the \npledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his \nhand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated \nthat he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn \n`Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet (ﷺ) invoked \nAllah to bless you.\" So, he would be their partner, and very often he would win a camel's load and \nsend it home.","reference":"Sahih al-Bukhari 2501, 2502, Book 47, Hadith 18","grade":"","question #":"question #3","question":"What impact can a prophetic blessing have on a person's life and business dealings according to Islamic teachings?","id":"bukhari-47-66"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share o a jointly possessed slave, it is imperative on him to \nmanumit the slave completely if he has sufficient money to pay the rest of its price which is to be \nestimated justly. He should pay his partners their shares and release him (the freed one).","reference":"Sahih al-Bukhari 2503, Book 47, Hadith 19","grade":"","question #":"question #3","question":"What is the process for ensuring the complete manumission of a jointly owned slave when one partner decides to free their share?","id":"bukhari-47-67"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to \nmanumit the slave completely if he has sufficient money. Otherwise he should look for some work for \nthe slave (to earn what would enable him to emancipate himself), without overburdening him with \nwork.\"","reference":"Sahih al-Bukhari 2504, Book 47, Hadith 20","grade":"","question #":"question #3","question":"What considerations should be taken into account to ensure a slave is not overburdened with work while earning their freedom?","id":"bukhari-47-68"},{"hadith-eng":"The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.","reference":"Sahih al-Bukhari 2505, 2506, Book 47, Hadith 21","grade":"","question #":"question #3","question":"What does the hadith imply about the flexibility and permanence of certain rulings in Islamic rituals?","id":"bukhari-47-69"},{"hadith-eng":"The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.","reference":"Sahih al-Bukhari 2505, 2506, Book 47, Hadith 21","grade":"","question #":"question #3","question":"What does the interaction between the Prophet (ﷺ) and Suraqa bin Malik reveal about the permanence of certain rulings in Islam?","id":"bukhari-47-70"},{"hadith-eng":"My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the \ncompany of the Prophet (ﷺ) and had some camels and sheep (of the booty). The people hurried (in \nslaughtering the animals) and put their meat in the pots and started cooking. Allah's Messenger (ﷺ) came and \nordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. \nOne of the camels fled and the people had only a few horses, so they got worried. (The camel was \nchased and) a man slopped the camel by throwing an arrow at it. Allah's Messenger (ﷺ) said, 'Some of these \nanimals are untamed like wild animals, so if anyone of them went out of your control, then you should \ntreat it as you have done now.' \" My grandfather said, \"O Allah's Messenger (ﷺ)! We fear that we may meet \nour enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet (ﷺ) \nsaid, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is \nslaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or \nfingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used \nby Ethiopians for slaughtering. (See Hadith 668)","reference":"Sahih al-Bukhari 2507, Book 47, Hadith 22","grade":"","question #":"question #3","question":"What is the significance of mentioning the Name of Allah during the act of slaughtering animals?","id":"bukhari-47-71"}]