[{"hadith-eng":"The Prophet (ﷺ) said, \"O Muslim women! None of you should look down upon the gift sent by her female neighbor \neven if it were the trotters of the sheep (fleshless part of legs).","reference":"Sahih al-Bukhari 2566, Book 51, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of accepting gifts, regardless of their value, in fostering good relations among neighbors?","id":"bukhari-51-1"},{"hadith-eng":"Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the \ncrescent in this way we saw three crescents in two months and no fire (for cooking) used to be made \nin the houses of Allah's Messenger (ﷺ). I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The \ntwo black things: dates and water, our neighbors from Ansar had some Manarh and they used to \npresent Allah's Messenger (ﷺ) some of their milk and he used to make us drink.\"","reference":"Sahih al-Bukhari 2567, Book 51, Hadith 2","grade":"","question #":"question #1","question":"How did the household of the Prophet Muhammad (ﷺ) manage during times of scarcity?","id":"bukhari-51-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"I shall accept the invitation even if I were invited to a meal of a sheep's trotter, and \nI shall accept the gift even if it were an arm or a trotter of a sheep.\"","reference":"Sahih al-Bukhari 2568, Book 51, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of accepting invitations and gifts in Islam, regardless of their value?","id":"bukhari-51-3"},{"hadith-eng":"The Prophet (ﷺ) sent for a woman from the emigrants and she had a slave who was a carpenter. The \nProphet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her \nslave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he \nfinished the pulpit, the woman informed the Prophet (ﷺ) that it had been finished. The Prophet (ﷺ) asked her \nto send that pulpit to him, so they brought it. The Prophet (ﷺ) lifted it and placed it at the place in which \nyou see now.\"","reference":"Sahih al-Bukhari 2569, Book 51, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) using a pulpit for delivering sermons?","id":"bukhari-51-4"},{"hadith-eng":"That his father said, \"One day I was sitting with some of the Prophet's companions on the way to \nMecca. Allah's Messenger (ﷺ) was ahead of us. All of my companions were in the state of Ihram while I was \na non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about \nit but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it \nand rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me \nthe whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became \nangry and got down from the horse, picked up both the things and rode the horse again. I attacked the \nonager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and \nstarted eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the \nstate of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Messenger (ﷺ) \nand asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the \naffirmative and gave him that fleshy foreleg which he ate completely while he was in the state of \nIhram .","reference":"Sahih al-Bukhari 2570, Book 51, Hadith 5","grade":"","question #":"question #1","question":"What is the ruling on hunting and consuming game meat while in the state of Ihram?","id":"bukhari-51-5"},{"hadith-eng":"Once Allah's Messenger (ﷺ) visited us in this house of ours and asked for something to drink. We milked one \nof our sheep and mixed it with water from this well of ours and gave it to him. Abu Bakr was sitting \non his left side and `Umar in front of him and a bedouin on his right side. When Allah's Messenger (ﷺ) \nfinished, `Umar said to Allah's Messenger (ﷺ) \"Here is Abu Bakr.\" But Allah's Messenger (ﷺ) gave the remaining \nmilk to the bedouin and said twice, \"The (persons on the) right side! So, start from the right side.\" \nAnas added, \"It is a Sunna (the Prophet's traditions)\" and repeated it thrice.","reference":"Sahih al-Bukhari 2571, Book 51, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of starting from the right side in Islamic tradition?","id":"bukhari-51-6"},{"hadith-eng":"We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered \nand caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's \nApostle. (The narrator confirms that he sent two thighs). The Prophet (ﷺ) accepted that. (The sub-narrator \nasked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it.\")","reference":"Sahih al-Bukhari 2572, Book 51, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of sharing food with others in Islamic tradition?","id":"bukhari-51-7"},{"hadith-eng":"An onager was presented to Allah's Messenger (ﷺ) at the place called Al-Abwa' or Waddan, but Allah's \nApostle rejected it. When the Prophet (ﷺ) noticed the signs of sorrow on the giver's face he said, \"We \nhave not rejected your gift, but we are in the state of Ihram.\" (i.e. if we were not in a state of Ihram we \nwould have accepted your gift, Fath-ul-Bari page 130, Vol. 6)","reference":"Sahih al-Bukhari 2573, Book 51, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of the state of Ihram in relation to accepting gifts?","id":"bukhari-51-8"},{"hadith-eng":"The people used to look forward for the days of my (`Aisha's) turn to send gifts to Allah's Messenger (ﷺ) in \norder to please him.","reference":"Sahih al-Bukhari 2574, Book 51, Hadith 9","grade":"","question #":"question #1","question":"What significance did the companions place on giving gifts to the Prophet Muhammad (ﷺ)?","id":"bukhari-51-9"},{"hadith-eng":"Ibn `Abbas said: Um Hufaid, Ibn `Abbas's aunt sent some dried yogurt (butter free), ghee (butter) and \na mastigar to the Prophet (ﷺ) as a gift. The Prophet (ﷺ) ate the dried yogurt and butter but left the mastigar \nbecause he disliked it. Ibn `Abbas said, \"The mastigar was eaten at the table of Allah's Messenger (ﷺ) and if \nit had been illegal to eat, it could not have been eaten at the table of Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 2575, Book 51, Hadith 10","grade":"","question #":"question #1","question":"What can be inferred about the permissibility of certain foods based on the actions of the Prophet (ﷺ)?","id":"bukhari-51-10"},{"hadith-eng":"Whenever a meal was brought to Allah's Messenger (ﷺ), he would ask whether it was a gift or Sadaqa \n(something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, \nbut if it was a gift, he would hurry to share it with them.","reference":"Sahih al-Bukhari 2576, Book 51, Hadith 11","grade":"","question #":"question #1","question":"What is the distinction between a gift and Sadaqa in Islamic teachings?","id":"bukhari-51-11"},{"hadith-eng":"Some meat was brought to the Prophet (ﷺ) and it was said that the meat had been given in charity to \r\nBarirah. He said, \"It was Sadaqa for Barirah but a gift for us.\"","reference":"Sahih al-Bukhari 2577, Book 51, Hadith 12","grade":"","question #":"question #1","question":"How does the classification of food as charity or gift affect its permissibility for different individuals?","id":"bukhari-51-12"},{"hadith-eng":"I intended to buy Barirah but her masters stipulated that her Wala should be for them. When the \r\nProphet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" \r\nOnce Barirah was given some meat, and the Prophet (ﷺ) asked, \"What is this?\" I said, \"It has been given \r\nto Barirah in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Barirah was given the option (to \r\nstay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her \r\nhusband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether \r\nher husband was a slave or a free man. He replied that he did not know whether he was a slave or a \r\nfree man.\"","reference":"Sahih al-Bukhari 2578, Book 51, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of the concept of Wala' in Islamic law regarding the liberation of slaves?","id":"bukhari-51-13"},{"hadith-eng":"Once the Prophet (ﷺ) went to `Aisha and asked her whether she had something (to eat). She said that she \r\nhad nothing except the mutton which Um 'Atiyya had sent to (Barirah) in charity. The Prophet (ﷺ) said \r\nthat it had reached its destination (i.e. it is no longer an object of charity.)","reference":"Sahih al-Bukhari 2579, Book 51, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of the destination of charity in Islamic teachings?","id":"bukhari-51-14"},{"hadith-eng":"The people used to send gifts to the Prophet (ﷺ) on the day of my turn. Um Salama said: \"My companions \n(the wives of the Prophet (ﷺ) Other than Aisha) gathered and they complained about it. So I informed the \nProphet about it on their behalf, but he remained silent.","reference":"Sahih al-Bukhari 2580, Book 51, Hadith 15","grade":"","question #":"question #1","question":"What was the significance of gift-giving to the Prophet Muhammad (ﷺ) during specific times?","id":"bukhari-51-15"},{"hadith-eng":"The wives of Allah's Messenger (ﷺ) were in two groups. One group consisted of `Aisha, Hafsa, Safiyya and \nSauda; and the other group consisted of Um Salama and the other wives of Allah's Messenger (ﷺ). The \nMuslims knew that Allah's Messenger (ﷺ) loved `Aisha, so if any of them had a gift and wished to give to \nAllah's Messenger (ﷺ), he would delay it, till Allah's Messenger (ﷺ) had come to `Aisha's home and then he would \nsend his gift to Allah's Messenger (ﷺ) in her home. The group of Um Salama discussed the matter together \nand decided that Um Salama should request Allah's Messenger (ﷺ) to tell the people to send their gifts to him \nin whatever wife's house he was. Um Salama told Allah's Messenger (ﷺ) of what they had said, but he did not \nreply. \nThen they (those wives) asked Um Salama about it. She said, \"He did not say anything to me.\" They \nasked her to talk to him again. She talked to him again when she met him on her day, but he gave no \nreply. When they asked her, she replied that he had given no reply. They said to her, \"Talk to him till \nhe gives you a reply.\" When it was her turn, she talked to him again. He then said to her, \"Do not hurt \nme regarding Aisha, as the Divine Inspirations do not come to me on any of the beds except that of \nAisha.\" On that Um Salama said, \"I repent to Allah for hurting you.\" Then the group of Um Salama \ncalled Fatima, the daughter of Allah's Messenger (ﷺ) and sent her to Allah's Messenger (ﷺ) to say to him, \"Your \nwives request to treat them and the daughter of Abu Bakr on equal terms.\" \nThen Fatima conveyed the message to him. The Prophet (ﷺ) said, \"O my daughter! Don't you love whom \nI love?\" She replied in the affirmative and returned and told them of the situation. They requested her \nto go to him again but she refused. They then sent Zainab bint Jahsh who went to him and used harsh \nwords saying, \"Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal \nterms.\" On that she raised her voice and abused `Aisha to her face so much so that Allah's Messenger (ﷺ) \nlooked at `Aisha to see whether she would retort. `Aisha started replying to Zainab till she silenced \nher. The Prophet (ﷺ) then looked at `Aisha and said, \"She is really the daughter of Abu Bakr.\"","reference":"Sahih al-Bukhari 2581, Book 51, Hadith 16","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle disputes among his wives regarding fairness and favoritism?","id":"bukhari-51-16"},{"hadith-eng":"When I went to Thumama bin `Abdullah, he gave me some perfume and said that Anas would not \nreject the gifts of perfume. Anas said: The Prophet (ﷺ) used not to reject the gifts of perfume.","reference":"Sahih al-Bukhari 2582, Book 51, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of accepting gifts in Islam, particularly gifts of perfume?","id":"bukhari-51-17"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) he stood up amongst the people, \nGlorified and Praised Allah as He deserved, and said, \"Then after: Your brethren have come to you \nwith repentance and I see it logical to return to them their captives; so whoever amongst you likes to \ndo that as a favor, then he can do it, and whoever of you like to stick to his share till we give him his \nright from the very first Fai (war booty) (1) which Allah will bestow on us, then (he can do so).\" The \npeople replied, \"We do that (to return the captives) willingly as a favor for your sake.\"","reference":"Sahih al-Bukhari 2583, 2584, Book 51, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of showing mercy and forgiveness towards those who repent in Islam?","id":"bukhari-51-18"},{"hadith-eng":"Allah's Messenger (ﷺ) used to accept gifts and used to give something in return.","reference":"Sahih al-Bukhari 2585, Book 51, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of exchanging gifts in Islamic tradition?","id":"bukhari-51-19"},{"hadith-eng":"that his father took him to Allah's Messenger (ﷺ) and said, \"I have given this son of mine a slave.\" The \nProphet asked, \"Have you given all your sons the like?\" He replied in the negative. The Prophet (ﷺ) said, \n\"Take back your gift then.\"","reference":"Sahih al-Bukhari 2586, Book 51, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of fairness and equality among children in Islam?","id":"bukhari-51-20"},{"hadith-eng":"I heard An-Nu`man bin Bashir on the pulpit saying, \"My father gave me a gift but `Amra bint Rawaha \n(my mother) said that she would not agree to it unless he made Allah's Messenger (ﷺ) as a witness to it. So, \nmy father went to Allah's Messenger (ﷺ) and said, 'I have given a gift to my son from `Amra bint Rawaha, \nbut she ordered me to make you as a witness to it, O Allah's Messenger (ﷺ)!' Allah's Messenger (ﷺ) asked, 'Have \nyou given (the like of it) to everyone of your sons?' He replied in the negative. Allah's Messenger (ﷺ) said, \n'Be afraid of Allah, and be just to your children.' My father then returned and took back his gift.\"","reference":"Sahih al-Bukhari 2587, Book 51, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of fairness and justice in distributing gifts among children in Islam?","id":"bukhari-51-21"},{"hadith-eng":"Ubaidullah bin `Abdullah told me that `Aisha had said, \"When the Prophet (ﷺ) became sick and his \ncondition became serious, he requested his wives to allow him to be treated in my house, and they \nallowed him. He came out leaning on two men while his feet were dragging on the ground. He was \nwalking between Al-`Abbas and another man.\" 'Ubaidullah said, \"When I informed Ibn `Abbas of \nwhat `Aisha had said, he asked me whether I knew who was the second man whom `Aisha had not \nnamed. I replied in the negative. He said, 'He was `Ali bin Abi Talib.\"","reference":"Sahih al-Bukhari 2588, Book 51, Hadith 22","grade":"","question #":"question #1","question":"What does this narration reveal about the Prophet's preference for being cared for during his illness?","id":"bukhari-51-22"},{"hadith-eng":"The Prophet (ﷺ) said, \"One who takes back his gift (which he has already given) is like a dog that \nswallows its vomit.\"","reference":"Sahih al-Bukhari 2589, Book 51, Hadith 23","grade":"","question #":"question #1","question":"What is the moral implication of taking back a gift once it has been given?","id":"bukhari-51-23"},{"hadith-eng":"Once I said, \"O Allah's Messenger (ﷺ)! I have no property except what has been given to me by Az-Zubair \n(i.e. her husband). May I give in charity?\" The Prophet (ﷺ) said, \"Give in charity and do not withhold it; \notherwise Allah will withhold it back from you . \"","reference":"Sahih al-Bukhari 2590, Book 51, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of giving charity in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-51-24"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a \nlimited amount; and do not withhold your money lest Allah should withhold it from you.\"","reference":"Sahih al-Bukhari 2591, Book 51, Hadith 25","grade":"","question #":"question #1","question":"What is the significance of generosity in Islam and how does it relate to divine provision?","id":"bukhari-51-25"},{"hadith-eng":"the freed slave of Ibn `Abbas, that Maimuna bint Al-Harith told him that she manumitted a slave-girl \nwithout taking the permission of the Prophet. On the day when it was her turn to be with the Prophet, \nshe said, \"Do you know, O Allah's Messenger (ﷺ), that I have manumitted my slave-girl?\" He said, \"Have \nyou really?\" She replied in the affirmative. He said, \"You would have got more reward if you had \ngiven her (i.e. the slave-girl) to one of your maternal uncles.\"","reference":"Sahih al-Bukhari 2592, Book 51, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of seeking the Prophet's permission before making important decisions?","id":"bukhari-51-26"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) wanted to go on a journey, he would draw lots as to which of his wives \nwould accompany him. He would take her whose name came out. He used to fix for each of them a \nday and a night. But Sauda bint Zam`a gave up her (turn) day and night to `Aisha, the wife of the \nProphet in order to seek the pleasure of Allah's Messenger (ﷺ) (by that action).","reference":"Sahih al-Bukhari 2593, Book 51, Hadith 27","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) ensure fairness among his wives when traveling?","id":"bukhari-51-27"},{"hadith-eng":"Narrated Maimuna, the wife of the Prophet (ﷺ) that she manumitted her slave-girl and the Prophet (ﷺ) said to her, \"You would have got more reward if you had given the slave-girl to one of your maternal uncles.\"","reference":"Sahih al-Bukhari 2594, Book 51, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of manumitting a slave in Islam?","id":"bukhari-51-28"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! I have two neighbors; which of them should I give a gift to?\" The Prophet (ﷺ) \nsaid, \"(Give) to the one whose door is nearer to you.\"","reference":"Sahih al-Bukhari 2595, Book 51, Hadith 29","grade":"","question #":"question #1","question":"How should one prioritize giving gifts to neighbors in Islam?","id":"bukhari-51-29"},{"hadith-eng":"That he heard As-Sa'b bin Jath-thama Al-Laithi, who was one of the companions of the Prophet, \nsaying that he gave the meat of an onager to Allah's Messenger (ﷺ) while he was at a place called Al-Abwa' \nor Waddan, and was in a state of Ihram. The Prophet (ﷺ) did not accept it. When the Prophet (ﷺ) saw the signs \nof sorrow on As-Sa'b's face because of not accepting his present, he said (to him), \"We are not \nreturning your present, but we are in the state of Ihram.\" (See Hadith No. 747)","reference":"Sahih al-Bukhari 2596, Book 51, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of the state of Ihram in relation to accepting gifts or food?","id":"bukhari-51-30"},{"hadith-eng":"The Prophet (ﷺ) appointed a man from the tribe of Al-Azd, called Ibn 'Utbiyya for collecting the Zakat. \nWhen he returned he said, \"This (i.e. the Zakat) is for you and this has been given to my as a present.\" \nThe Prophet (ﷺ) said, \"Why hadn't he stayed in his father's or mother's house to see whether he would be \ngiven presents or not? By Him in Whose Hands my life is, whoever takes something from the \nresources of the Zakat (unlawfully) will be carrying it on his neck on the Day of Resurrection; if it be \na camel, it will be grunting; if a cow, it will be mooing; and if a sheep, it will be bleating.\" The \nProphet then raised his hands till we saw the whiteness of his armpits, and he said thrice, \"O Allah! \nHaven't I conveyed Your Message (to them)?\"","reference":"Sahih al-Bukhari 2597, Book 51, Hadith 31","grade":"","question #":"question #1","question":"What is the significance of integrity and honesty in handling public resources in Islam?","id":"bukhari-51-31"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"I will give you so much (the Prophet (ﷺ) pointed thrice with his hands) when \nfunds of Bahrain will come to me.\" But the Prophet (ﷺ) died before the money reached him. (When it \ncame) Abu Bakr ordered an announcer to announce that whoever had a money claim on the Prophet (ﷺ) or \nwas promised to be given something, should come to Abu Bakr. I went to Abu Bakr and told him that \nthe Prophet (ﷺ) had promised to give me so much. On that Abu Bakr gave me three handfuls (of money).","reference":"Sahih al-Bukhari 2598, Book 51, Hadith 32","grade":"","question #":"question #1","question":"How did Abu Bakr handle the financial promises made by the Prophet Muhammad (ﷺ) after his passing?","id":"bukhari-51-32"},{"hadith-eng":"Allah's Messenger (ﷺ) distributed some cloaks but did not give anything thereof to Makhrama. Makhrama \nsaid (to me), \"O son! accompany me to Allah's Messenger (ﷺ).\" When I went with him, he said, \"Call him to \nme.\" I called him (i.e. the Prophet (ﷺ) ) for my father. He came out wearing one of those cloaks and said, \n\"We kept this (cloak) for you, (Makhrama).\" Makhrama looked at the cloak and said, \"Makhrama is \npleased,\" (or the Prophet (ﷺ) said), \"Is Makhrama pleased?\"","reference":"Sahih al-Bukhari 2599, Book 51, Hadith 33","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle situations where someone felt left out or overlooked?","id":"bukhari-51-33"},{"hadith-eng":"A man came to Allah's Messenger (ﷺ) and said, \"I am ruined.\" The Prophet (ﷺ) asked, \"What do you mean?\" He \nsaid, \"I had a sexual intercourse with my wife during Ramadan (while fasting).\" The Prophet (ﷺ) asked \nhim, \"Can you manumit a slave?\" He replied in the negative. He then asked him, \"Can you fast for \ntwo successive months continuously\" He replied in the negative. The Prophet (ﷺ) then asked him, \"Can \nyou feed sixty poor persons?\" He replied in the negative. In the meantime an Ansari came with a \nbasket full of dates. The Prophet (ﷺ) said to the man, \"Take it and give it in charity (as an expiation of \nyour sin).\" The man said \"Should I give it to some people who are poorer than we O Allah's Messenger (ﷺ)? \nBy Him Who has sent you with the Truth, there is no family between Medina's two mountains poorer \nthan we.\" Allah's Messenger (ﷺ) told him to take it and provide his family with it.\"","reference":"Sahih al-Bukhari 2600, Book 51, Hadith 34","grade":"","question #":"question #1","question":"What are the options for expiation if someone breaks their fast during Ramadan through sexual intercourse?","id":"bukhari-51-34"},{"hadith-eng":"My father was martyred on the day (of the battle) of Uhud and his creditors demanded the debt back \nin a harsh manner. So I went to Allah's Messenger (ﷺ) and informed him of that, he asked them to accept the \nfruits of my garden and excuse my father, but they refused. So, Allah's Messenger (ﷺ) did not give them the \nfruits, nor did he cut them and distribute them among them, but said, \"I will come to you tomorrow \nmorning.\" So, he came to us the next morning and walked about in between the date-palms and \ninvoked Allah to bless their fruits. I plucked the fruits and gave back all the rights of the creditors in \nfull, and a lot of fruits were left for us. Then I went to Allah's Messenger (ﷺ), who was sitting, and informed \nhim about what happened. Allah's Messenger (ﷺ) told `Umar, who was sitting there, to listen to the story. \n`Umar said, \"Don't we know that you are Allah's Messenger (ﷺ)? By Allah! you are Allah's Messenger (ﷺ)!\"","reference":"Sahih al-Bukhari 2601, Book 51, Hadith 35","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) assist in resolving debts after the Battle of Uhud?","id":"bukhari-51-35"},{"hadith-eng":"A drink (milk mixed with water) was brought to the Prophet (ﷺ) who drank some of it while a boy was \nsitting on his right and old men on his left. The Prophet (ﷺ) said to the boy, \"If you permit me, I'll give \n(the rest of the drink to) these old men first.\" The boy said, \"I will not give preference to any one over \nme as regards my share from you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) then put that container in the boy's \nhand. (See Hadith No. 541).","reference":"Sahih al-Bukhari 2602, Book 51, Hadith 36","grade":"","question #":"question #1","question":"What does this incident teach about the rights of individuals in the presence of elders?","id":"bukhari-51-36"},{"hadith-eng":"Jabir (ra) said, \"I went to the Prophet (ﷺ) in the mosque and he paid me my right and gave me more than he owed me.\"","reference":"Sahih al-Bukhari 2603, Book 51, Hadith 37","grade":"","question #":"question #1","question":"What does this narration teach about fulfilling financial obligations and debts?","id":"bukhari-51-37"},{"hadith-eng":"I sold a camel to the Prophet (ﷺ) on one of the journeys. When we reached Medina, he ordered me to go \nto the Mosque and offer two rak`at. Then he weighed for me (the price of the camel in gold) and gave \nan extra amount over it. A part of it remained with me till it was taken by the army of Sham on the day \nof Harra.\"","reference":"Sahih al-Bukhari 2604, Book 51, Hadith 38","grade":"","question #":"question #1","question":"What is the significance of offering two rak`at upon returning from a journey in Islamic tradition?","id":"bukhari-51-38"},{"hadith-eng":"A drink (of milk and water) was brought to Allah's Messenger (ﷺ) while a boy was sitting on his right side \nand old men were sitting on his left side. He asked the boy, \"Will you allow me to give it to these \n(people)?\" The boy said, \"No, by Allah, I will not allow anyone to take my right from you.\" Then the \nProphet put the bowl in the boy's hand.","reference":"Sahih al-Bukhari 2605, Book 51, Hadith 39","grade":"","question #":"question #1","question":"What does this incident teach about the rights of individuals, regardless of age, in Islamic tradition?","id":"bukhari-51-39"},{"hadith-eng":"Allah's Messenger (ﷺ) owed a man some debt (and that man demanded it very harshly). The companions of \nthe Prophet (ﷺ) wanted to harm him, but the Prophet (ﷺ) said to them, \"Leave him, as the creditor has the \nright to speak harshly.\" He then added, \"Buy (a camel) of the same age and give it to him.\" They said, \n\"We cannot get except a camel of an older age than that of his.\" He said, \"Buy it and give it to him, as \nthe best amongst you is he who pays back his debt in the most handsome way.'","reference":"Sahih al-Bukhari 2606, Book 51, Hadith 40","grade":"","question #":"question #1","question":"What is the significance of fulfilling debts in Islam, even if it requires giving more than what was owed?","id":"bukhari-51-40"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) they requested him to return their \nproperty and their captives. He said to them, \"This concerns also other people along with me as you \nsee, and the best statement to me is the true one, so you may choose one of two alternatives; either the \ncaptives or the property and (I have not distributed the booty for) I have been waiting for you.\" \nWhen the Prophet (ﷺ) had returned from Ta'if, he waited for them for more than ten nights. When they \ncame to know that the Prophet (ﷺ) would not return except one of the two, they chose their captives. The \nProphet then stood up amongst the Muslims, Glorified and Praised Allah as He deserved, and then \nsaid, \"Then after: These brothers of yours have come to you with repentance and I see it proper to \nreturn their captives, so whoever amongst you likes to do that as a favor, then he can do it, and \nwhoever of you wants to stick to his share till we pay him from the very first Fai (i.e. war booty) \nwhich Allah will give us, then he can do so.\" The people said, \"We return (the captives) to them \nwillingly as a favor, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"I do not know who of you has given his \nconsent and who has not; so go back and your leaders may present your decision to me.\" The people \nwent away, and their leaders discussed the matter with them, and then came to the Prophet (ﷺ) to tell him \nthat all of them had given their consent (to return the captives) willingly. (Az-Zuhn, the sub-narrator \nsaid, \"This is what we know about the captives, of Hawazin.\")","reference":"Sahih al-Bukhari 2607, 2608, Book 51, Hadith 41","grade":"","question #":"question #1","question":"What is the significance of collective decision-making in resolving disputes according to Islamic teachings?","id":"bukhari-51-41"},{"hadith-eng":"The Prophet (ﷺ) took a camel of special age from somebody on credit. Its owner came and demanded it \nback (harshly). The Prophet (ﷺ) said, \"No doubt, he who has a right, can demand it.\" Then the Prophet (ﷺ) \ngave him an older camel than his camel and said, \"The best amongst you is he who repays his debts in \nthe most handsome way.\"","reference":"Sahih al-Bukhari 2609, Book 51, Hadith 42","grade":"","question #":"question #1","question":"What is the significance of fulfilling one's debts in Islam?","id":"bukhari-51-42"},{"hadith-eng":"That he was in the company of the Prophet (ﷺ) on a journey, riding a troublesome camel belonging to \n`Umar. The camel used to go ahead of the Prophet, so Ibn `Umar's father would say, \"O `Abdullah! \nNo one should go ahead of the Prophet.\" The Prophet (ﷺ) said to him, \"Sell it to me.\" `Umar said to the \nProphet \"It is for you.\" So, he bought it and said, \"O `Abdullah! It is for you, and you can do with it \nwhat you like.\"","reference":"Sahih al-Bukhari 2610, Book 51, Hadith 43","grade":"","question #":"question #1","question":"What does this narration teach about the respect and etiquette towards the Prophet during his lifetime?","id":"bukhari-51-43"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on a journey, and I was riding a troublesome camel. The Prophet (ﷺ) asked 'Umar to sell that camel to him. So, 'Umar sold it to him. The Prophet (ﷺ) then said, \"O 'Abdullah! The camel is for you.\"","reference":"Sahih al-Bukhari 2611, Book 51, Hadith 44","grade":"","question #":"question #1","question":"What can be learned about the Prophet Muhammad's (ﷺ) generosity from this incident?","id":"bukhari-51-44"},{"hadith-eng":"`Umar bin Al-Khattab saw a silken dress (cloak) being sold at the gate of the Mosque and said, \"O \nAllah's Messenger (ﷺ)! Would that you buy it and wear it on Fridays and when the delegates come to you!\" \nAllah's Messenger (ﷺ) said, \"This is worn by the one who will have no share in the Hereafter.\" Later on some \nsilk dresses were brought and Allah's Messenger (ﷺ) sent one of them to `Umar. `Umar said, \"How do you \ngive me this to wear while you said what you said about the dress of 'Utarid?\" Allah's Messenger (ﷺ) said, \"I \nhave not given it to you to wear.\" So, `Umar gave it to a pagan brother of his in Mecca.","reference":"Sahih al-Bukhari 2612, Book 51, Hadith 45","grade":"","question #":"question #1","question":"What is the Islamic perspective on wearing silk for men, and how does it relate to the Hereafter?","id":"bukhari-51-45"},{"hadith-eng":"Once the Prophet (ﷺ) went to the house of Fatima but did not enter it. `Ali came and she told him about \nthat. When 'All asked the Prophet (ﷺ) about it, he said, \"I saw a (multicolored) decorated curtain on her \ndoor. I am not interested in worldly things.\" `Ali went to Fatima and told her about it. Fatima said, \"I \nam ready to dispense with it in the way he suggests.\" The Prophet (ﷺ) ordered her to send it to such-andsuch \nneedy people. \"","reference":"Sahih al-Bukhari 2613, Book 51, Hadith 46","grade":"","question #":"question #1","question":"What does this narration teach about the Prophet's (ﷺ) attitude towards worldly possessions and materialism?","id":"bukhari-51-46"},{"hadith-eng":"The Prophet (ﷺ) gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I \ncut it into pieces and distributed it among my wives.\"","reference":"Sahih al-Bukhari 2614, Book 51, Hadith 47","grade":"","question #":"question #1","question":"What is the significance of the Prophet's reaction to wearing silk in Islamic teachings?","id":"bukhari-51-47"},{"hadith-eng":"A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet (ﷺ) used to \nforbid people to wear silk. So, the people were pleased to see it. The Prophet (ﷺ) said, \"By Him in Whose \nHands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" \nAnas added, \"The present was sent to the Prophet (ﷺ) by Ukaidir (a Christian) from Dauma.\"","reference":"Sahih al-Bukhari 2615, 2616, Book 51, Hadith 48","grade":"","question #":"question #1","question":"What is the Islamic perspective on wearing silk for men, and why was it forbidden by the Prophet Muhammad (ﷺ)?","id":"bukhari-51-48"},{"hadith-eng":"A Jewess brought a poisoned (cooked) sheep for the Prophet (ﷺ) who ate from it. She was brought to the \nProphet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the \npoison on the palate of the mouth of Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 2617, Book 51, Hadith 49","grade":"","question #":"question #1","question":"What was the Prophet Muhammad's (ﷺ) response to the attempt on his life by poisoning?","id":"bukhari-51-49"},{"hadith-eng":"We were one-hundred and thirty persons accompanying the Prophet (ﷺ) who asked us whether anyone of \nus had food. There was a man who had about a Sa of wheat which was mixed with water then. A very \ntall pagan came driving sheep. The Prophet (ﷺ) asked him, \"Will you sell us (a sheep) or give it as a \npresent?\" He said, \"I will sell you (a sheep).\" The Prophet (ﷺ) bought a sheep and it was slaughtered. The \nProphet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet (ﷺ) gave \nevery person of the one-hundred-and-thirty a piece of that; he gave all those of them who were \npresent; and kept the shares of those who were absent. The Prophet (ﷺ) then put its meat in two huge \nbasins and all of them ate to their fill, and even then more food was left in the two basins which were \ncarried on the camel (or said something like it).","reference":"Sahih al-Bukhari 2618, Book 51, Hadith 50","grade":"","question #":"question #1","question":"How does the story illustrate the concept of sharing and generosity in Islam?","id":"bukhari-51-50"},{"hadith-eng":"`Umar saw a silken cloak over a man for sale and requested the Prophet (ﷺ) to buy it in order to wear it on \nFridays and while meeting delegates. The Prophet (ﷺ) said, \"This is worn by the one who will have no \nshare in the Hereafter.\" Later on Allah's Messenger (ﷺ) got some silken cloaks similar to that one, and he \nsent one to `Umar. `Umar said to the Prophet (ﷺ) \"How can I wear it, while you said about it what you \nsaid?\" The Prophet (ﷺ) said, \"I have not given it to you to wear, but to sell or to give to someone else.\" So, \n`Umar sent it to his brother at Mecca before he embraced Islam.","reference":"Sahih al-Bukhari 2619, Book 51, Hadith 51","grade":"","question #":"question #1","question":"What is the significance of avoiding silk clothing for men in Islam?","id":"bukhari-51-51"},{"hadith-eng":"My mother came to me during the lifetime of Allah's Messenger (ﷺ) and she was a pagan. I said to Allah's \nApostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from \nme, shall I keep good relations with her?\" The Prophet (ﷺ) said, \"Yes, keep good relation with her. \"","reference":"Sahih al-Bukhari 2620, Book 51, Hadith 52","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding maintaining relationships with non-Muslim family members?","id":"bukhari-51-52"},{"hadith-eng":"The Prophet (ﷺ) said, \"He who takes back his present is like him who swallows his vomit.\"","reference":"Sahih al-Bukhari 2621, Book 51, Hadith 53","grade":"","question #":"question #1","question":"What is the significance of keeping one's word and not taking back gifts in Islamic teachings?","id":"bukhari-51-53"},{"hadith-eng":"The Prophet (ﷺ) said, \"The bad example is not for us. He who takes back his present is like a dog that \nswallows back its vomit.\"","reference":"Sahih al-Bukhari 2622, Book 51, Hadith 54","grade":"","question #":"question #1","question":"What is the Islamic perspective on taking back a gift once it has been given?","id":"bukhari-51-54"},{"hadith-eng":"I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to \nbuy it from him, thinking that he would sell it cheap. When I asked the Prophet (ﷺ) he said, \"Don't buy it, \neven if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is \nlike a dog that swallows back its vomit.\"","reference":"Sahih al-Bukhari 2623, Book 51, Hadith 55","grade":"","question #":"question #1","question":"What is the significance of not reclaiming what has been given in charity in Islam?","id":"bukhari-51-55"},{"hadith-eng":"The sons of Suhaib, (Suhaib, who was the freed slave of Bani\r\nJud'an) claimed that Allah's Messenger (ﷺ) had given two houses and one room to Suhaib. Marwan asked, \"Who will testify to your claim?\" They replied that Ibn 'Umar\r\nwould do so. Marwan sent for Ibn 'Umar who testified that Allah's Messenger (ﷺ) had really given Suhaib two houses and a room. So, Marwan gave the verdict (in favour of Suhaib's sons), because of (Ibn 'Umar's) witness.","reference":"Sahih al-Bukhari 2624, Book 51, Hadith 56","grade":"","question #":"question #1","question":"What is the significance of witness testimony in Islamic legal decisions?","id":"bukhari-51-56"},{"hadith-eng":"The Prophet (ﷺ) gave the verdict that `Umra is for the one to whom it is presented.","reference":"Sahih al-Bukhari 2625, Book 51, Hadith 57","grade":"","question #":"question #1","question":"What is the concept of 'Umra in Islamic inheritance law?","id":"bukhari-51-57"},{"hadith-eng":"The Prophet (ﷺ) said, \"Umra is permissible.\" Ata said, \"Jabir narrated the same to me from the Prophet.\"","reference":"Sahih al-Bukhari 2626, Book 51, Hadith 58","grade":"","question #":"question #1","question":"What is the significance of Umra in Islamic teachings?","id":"bukhari-51-58"},{"hadith-eng":"Once the people of Medina were frightened, so the Prophet (ﷺ) borrowed a horse from Abu Talha called \nAl-Mandub, and rode it. When he came back he said, \"We have not seen anything (to be afraid of), \nbut the horse was very fast (having an energy as inexhaustible as the water of the sea).","reference":"Sahih al-Bukhari 2627, Book 51, Hadith 59","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) respond to a situation of fear or panic among the people of Medina?","id":"bukhari-51-59"},{"hadith-eng":"I went to `Aisha and she was wearing a coarse dress costing five Dirhams. `Aisha said, \"Look up and \nsee my slave-girl who refuses to wear it in the house though during the lifetime of Allah's Messenger (ﷺ) I \nhad a similar dress which no woman desiring to appear elegant (before her husband) failed to borrow \nfrom me.\"","reference":"Sahih al-Bukhari 2628, Book 51, Hadith 60","grade":"","question #":"question #1","question":"What does this narration suggest about the simplicity and modesty in clothing during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-51-60"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"What a good Maniha (the she-camel which has recently given birth and which \ngives profuse milk) is, and (what a good Maniha) (the sheep which gives profuse milk, a bowl in the \nmorning and another in the evening) is!\"Narrated Malik:Maniha is a good deed of charity.","reference":"Sahih al-Bukhari 2629, Book 51, Hadith 61","grade":"","question #":"question #1","question":"What is the significance of giving a Maniha in Islam?","id":"bukhari-51-61"},{"hadith-eng":"Anas bin Malik said, \"When the emigrants came Medina, they had nothing whereas the Ansar had \nland and property. The Ansar gave them their land on condition that the emigrants would give them \nhalf the yearly yield and work on the land and provide the necessaries for cultivation.\" His (i.e. Anas's \nmother who was also the mother of `Abdullah bin Abu Talha, gave some date-palms to Allah' Apostle \nwho gave them to his freed slave-girl (Um Aiman) who was also the mother of Usama bin Zaid. When \nthe Prophet (ﷺ) finished from the fighting against the people of Khaibar and returned to Medina, the \nemigrants returned to the Ansar the fruit gifts which the Ansar had given them. The Prophet (ﷺ) also \nreturned to Anas's mother the date-palms. Allah's Messenger (ﷺ) gave Um Aiman other trees from his garden \nin lieu of the old gift.","reference":"Sahih al-Bukhari 2630, Book 51, Hadith 62","grade":"","question #":"question #1","question":"How did the Ansar support the emigrants when they arrived in Medina?","id":"bukhari-51-62"},{"hadith-eng":"That Allah's Messenger (ﷺ) said, \"There are forty virtuous deeds and the best of them is the Maniha of a shegoat, \nand anyone who does one of these virtuous deeds hoping for Allah's reward with firm \nconfidence that he will get it, then Allah will make him enter Paradise because of Hassan (a subnarrator) \nsaid, \"We tried to count those good deeds below the Maniha; we mentioned replying to the \nsneezer, removing harmful things from the road, etc., but we failed to count even fifteen.\"","reference":"Sahih al-Bukhari 2631, Book 51, Hadith 63","grade":"","question #":"question #1","question":"What are some examples of virtuous deeds that can lead to entering Paradise according to Islamic teachings?","id":"bukhari-51-63"},{"hadith-eng":"Some men had superfluous land and they said that they would give it to others to cultivate on the \ncondition that they would get one-third or one-fourth or one half of its yield. The Prophet (ﷺ) said, \n\"Whoever has land should cultivate it himself or give it to his brother or keep it uncultivated.\"","reference":"Sahih al-Bukhari 2632, Book 51, Hadith 64","grade":"","question #":"question #1","question":"What are the permissible options for someone who owns land but cannot cultivate it themselves?","id":"bukhari-51-64"},{"hadith-eng":"A bedouin came to the Prophet (ﷺ) and asked him about emigration. The Prophet (ﷺ) \nsaid to him, \"May Allah be merciful to you. The matter of emigration is difficult. Have you got some \ncamels?\" He replied in the affirmative. The Prophet (ﷺ) asked him, \"Do you pay their Zakat?\" He replied \nin the affirmative. He asked, \"Do you lend them so that their milk may be utilized by others?\" The \nbedouin said, \"Yes.\" The Prophet (ﷺ) asked, \"Do you milk them on the day off watering them?\" He \nreplied, \"Yes.\" The Prophet (ﷺ) said, \"Do good deeds beyond the merchants (or the sea) and Allah will \nnever disregard any of your deeds.\" (See Hadith No. 260, Vol. 5)","reference":"Sahih al-Bukhari 2633, Book 51, Hadith 65","grade":"","question #":"question #1","question":"What is the significance of performing good deeds in Islam, even beyond one's immediate community?","id":"bukhari-51-65"},{"hadith-eng":"That he was told by the most learned one amongst them (i.e. Ibn `Abbas) that the Prophet (ﷺ) went \ntowards some land which was flourishing with vegetation and asked to whom it belonged. He was told \nthat such and such a person took it on rent. The Prophet (ﷺ) said, \"It would have been better (for the \nowner) if he had given it to him gratis rather than charging him a fixed rent.","reference":"Sahih al-Bukhari 2634, Book 51, Hadith 66","grade":"","question #":"question #1","question":"What is the significance of generosity and selflessness in Islam when it comes to sharing resources?","id":"bukhari-51-66"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Prophet (ﷺ) Abraham migrated with Sarah. The people (of the town where they \nmigrated) gave her Ajar (i.e. Hajar). Sarah returned and said to Abraham, \"Do you know that Allah \nhas humiliated that pagan and he has given a slave-girl for my service?\"","reference":"Sahih al-Bukhari 2635, Book 51, Hadith 67","grade":"","question #":"question #1","question":"What is the significance of migration in the story of Prophet Abraham and Sarah?","id":"bukhari-51-67"},{"hadith-eng":"Once I gave a horse (for riding) in Allah's Cause. Later I saw it being sold. I asked Allah's Messenger (ﷺ) \n(whether I could buy it). He said, \"Don't buy it, for you should not get back what you have given in \ncharity.\"","reference":"Sahih al-Bukhari 2636, Book 51, Hadith 68","grade":"","question #":"question #1","question":"What is the ruling on buying back something that has been given in charity?","id":"bukhari-51-68"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Muslim women! None of you should look down upon the gift sent by her female neighbor \neven if it were the trotters of the sheep (fleshless part of legs).","reference":"Sahih al-Bukhari 2566, Book 51, Hadith 1","grade":"","question #":"question #2","question":"How does the attitude towards small gifts reflect one's humility and appreciation in Islam?","id":"bukhari-51-69"},{"hadith-eng":"Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the \ncrescent in this way we saw three crescents in two months and no fire (for cooking) used to be made \nin the houses of Allah's Messenger (ﷺ). I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The \ntwo black things: dates and water, our neighbors from Ansar had some Manarh and they used to \npresent Allah's Messenger (ﷺ) some of their milk and he used to make us drink.\"","reference":"Sahih al-Bukhari 2567, Book 51, Hadith 2","grade":"","question #":"question #2","question":"What role did the Ansar play in supporting the Prophet Muhammad (ﷺ) and his family?","id":"bukhari-51-70"},{"hadith-eng":"The Prophet (ﷺ) said, \"I shall accept the invitation even if I were invited to a meal of a sheep's trotter, and \nI shall accept the gift even if it were an arm or a trotter of a sheep.\"","reference":"Sahih al-Bukhari 2568, Book 51, Hadith 3","grade":"","question #":"question #2","question":"How does the acceptance of simple gifts reflect humility and gratitude in Islamic teachings?","id":"bukhari-51-71"},{"hadith-eng":"The Prophet (ﷺ) sent for a woman from the emigrants and she had a slave who was a carpenter. The \nProphet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her \nslave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he \nfinished the pulpit, the woman informed the Prophet (ﷺ) that it had been finished. The Prophet (ﷺ) asked her \nto send that pulpit to him, so they brought it. The Prophet (ﷺ) lifted it and placed it at the place in which \nyou see now.\"","reference":"Sahih al-Bukhari 2569, Book 51, Hadith 4","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) involve the community in the construction of the pulpit?","id":"bukhari-51-72"},{"hadith-eng":"That his father said, \"One day I was sitting with some of the Prophet's companions on the way to \nMecca. Allah's Messenger (ﷺ) was ahead of us. All of my companions were in the state of Ihram while I was \na non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about \nit but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it \nand rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me \nthe whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became \nangry and got down from the horse, picked up both the things and rode the horse again. I attacked the \nonager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and \nstarted eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the \nstate of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Messenger (ﷺ) \nand asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the \naffirmative and gave him that fleshy foreleg which he ate completely while he was in the state of \nIhram .","reference":"Sahih al-Bukhari 2570, Book 51, Hadith 5","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react to the situation involving the onager and what does it teach about adherence to Ihram rules?","id":"bukhari-51-73"},{"hadith-eng":"Once Allah's Messenger (ﷺ) visited us in this house of ours and asked for something to drink. We milked one \nof our sheep and mixed it with water from this well of ours and gave it to him. Abu Bakr was sitting \non his left side and `Umar in front of him and a bedouin on his right side. When Allah's Messenger (ﷺ) \nfinished, `Umar said to Allah's Messenger (ﷺ) \"Here is Abu Bakr.\" But Allah's Messenger (ﷺ) gave the remaining \nmilk to the bedouin and said twice, \"The (persons on the) right side! So, start from the right side.\" \nAnas added, \"It is a Sunna (the Prophet's traditions)\" and repeated it thrice.","reference":"Sahih al-Bukhari 2571, Book 51, Hadith 6","grade":"","question #":"question #2","question":"How does the practice of serving others reflect the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-51-74"},{"hadith-eng":"We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered \nand caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's \nApostle. (The narrator confirms that he sent two thighs). The Prophet (ﷺ) accepted that. (The sub-narrator \nasked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it.\")","reference":"Sahih al-Bukhari 2572, Book 51, Hadith 7","grade":"","question #":"question #2","question":"How does the Prophet's acceptance of food gifts reflect on his character and teachings?","id":"bukhari-51-75"},{"hadith-eng":"An onager was presented to Allah's Messenger (ﷺ) at the place called Al-Abwa' or Waddan, but Allah's \nApostle rejected it. When the Prophet (ﷺ) noticed the signs of sorrow on the giver's face he said, \"We \nhave not rejected your gift, but we are in the state of Ihram.\" (i.e. if we were not in a state of Ihram we \nwould have accepted your gift, Fath-ul-Bari page 130, Vol. 6)","reference":"Sahih al-Bukhari 2573, Book 51, Hadith 8","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations where he had to refuse a gift?","id":"bukhari-51-76"},{"hadith-eng":"The people used to look forward for the days of my (`Aisha's) turn to send gifts to Allah's Messenger (ﷺ) in \norder to please him.","reference":"Sahih al-Bukhari 2574, Book 51, Hadith 9","grade":"","question #":"question #2","question":"How did the companions express their affection and respect for the Prophet Muhammad (ﷺ)?","id":"bukhari-51-77"},{"hadith-eng":"Ibn `Abbas said: Um Hufaid, Ibn `Abbas's aunt sent some dried yogurt (butter free), ghee (butter) and \na mastigar to the Prophet (ﷺ) as a gift. The Prophet (ﷺ) ate the dried yogurt and butter but left the mastigar \nbecause he disliked it. Ibn `Abbas said, \"The mastigar was eaten at the table of Allah's Messenger (ﷺ) and if \nit had been illegal to eat, it could not have been eaten at the table of Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 2575, Book 51, Hadith 10","grade":"","question #":"question #2","question":"How does the Prophet's (ﷺ) personal preference influence the consumption of certain foods?","id":"bukhari-51-78"},{"hadith-eng":"Whenever a meal was brought to Allah's Messenger (ﷺ), he would ask whether it was a gift or Sadaqa \n(something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, \nbut if it was a gift, he would hurry to share it with them.","reference":"Sahih al-Bukhari 2576, Book 51, Hadith 11","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate generosity and sharing with his companions?","id":"bukhari-51-79"},{"hadith-eng":"Some meat was brought to the Prophet (ﷺ) and it was said that the meat had been given in charity to \r\nBarirah. He said, \"It was Sadaqa for Barirah but a gift for us.\"","reference":"Sahih al-Bukhari 2577, Book 51, Hadith 12","grade":"","question #":"question #2","question":"What is the significance of intention in the distribution and reception of charity and gifts in Islam?","id":"bukhari-51-80"},{"hadith-eng":"I intended to buy Barirah but her masters stipulated that her Wala should be for them. When the \r\nProphet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" \r\nOnce Barirah was given some meat, and the Prophet (ﷺ) asked, \"What is this?\" I said, \"It has been given \r\nto Barirah in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Barirah was given the option (to \r\nstay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her \r\nhusband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether \r\nher husband was a slave or a free man. He replied that he did not know whether he was a slave or a \r\nfree man.\"","reference":"Sahih al-Bukhari 2578, Book 51, Hadith 13","grade":"","question #":"question #2","question":"How does the status of a gift change when it is given as charity to someone else in Islam?","id":"bukhari-51-81"},{"hadith-eng":"Once the Prophet (ﷺ) went to `Aisha and asked her whether she had something (to eat). She said that she \r\nhad nothing except the mutton which Um 'Atiyya had sent to (Barirah) in charity. The Prophet (ﷺ) said \r\nthat it had reached its destination (i.e. it is no longer an object of charity.)","reference":"Sahih al-Bukhari 2579, Book 51, Hadith 14","grade":"","question #":"question #2","question":"How does the status of an item change once it reaches its intended recipient in Islam?","id":"bukhari-51-82"},{"hadith-eng":"The people used to send gifts to the Prophet (ﷺ) on the day of my turn. Um Salama said: \"My companions \n(the wives of the Prophet (ﷺ) Other than Aisha) gathered and they complained about it. So I informed the \nProphet about it on their behalf, but he remained silent.","reference":"Sahih al-Bukhari 2580, Book 51, Hadith 15","grade":"","question #":"question #2","question":"How did the wives of the Prophet (ﷺ) express their concerns regarding the distribution of gifts?","id":"bukhari-51-83"},{"hadith-eng":"The wives of Allah's Messenger (ﷺ) were in two groups. One group consisted of `Aisha, Hafsa, Safiyya and \nSauda; and the other group consisted of Um Salama and the other wives of Allah's Messenger (ﷺ). The \nMuslims knew that Allah's Messenger (ﷺ) loved `Aisha, so if any of them had a gift and wished to give to \nAllah's Messenger (ﷺ), he would delay it, till Allah's Messenger (ﷺ) had come to `Aisha's home and then he would \nsend his gift to Allah's Messenger (ﷺ) in her home. The group of Um Salama discussed the matter together \nand decided that Um Salama should request Allah's Messenger (ﷺ) to tell the people to send their gifts to him \nin whatever wife's house he was. Um Salama told Allah's Messenger (ﷺ) of what they had said, but he did not \nreply. \nThen they (those wives) asked Um Salama about it. She said, \"He did not say anything to me.\" They \nasked her to talk to him again. She talked to him again when she met him on her day, but he gave no \nreply. When they asked her, she replied that he had given no reply. They said to her, \"Talk to him till \nhe gives you a reply.\" When it was her turn, she talked to him again. He then said to her, \"Do not hurt \nme regarding Aisha, as the Divine Inspirations do not come to me on any of the beds except that of \nAisha.\" On that Um Salama said, \"I repent to Allah for hurting you.\" Then the group of Um Salama \ncalled Fatima, the daughter of Allah's Messenger (ﷺ) and sent her to Allah's Messenger (ﷺ) to say to him, \"Your \nwives request to treat them and the daughter of Abu Bakr on equal terms.\" \nThen Fatima conveyed the message to him. The Prophet (ﷺ) said, \"O my daughter! Don't you love whom \nI love?\" She replied in the affirmative and returned and told them of the situation. They requested her \nto go to him again but she refused. They then sent Zainab bint Jahsh who went to him and used harsh \nwords saying, \"Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal \nterms.\" On that she raised her voice and abused `Aisha to her face so much so that Allah's Messenger (ﷺ) \nlooked at `Aisha to see whether she would retort. `Aisha started replying to Zainab till she silenced \nher. The Prophet (ﷺ) then looked at `Aisha and said, \"She is really the daughter of Abu Bakr.\"","reference":"Sahih al-Bukhari 2581, Book 51, Hadith 16","grade":"","question #":"question #2","question":"What role did Fatima, the daughter of the Prophet (ﷺ), play in addressing the concerns of the Prophet's wives?","id":"bukhari-51-84"},{"hadith-eng":"When I went to Thumama bin `Abdullah, he gave me some perfume and said that Anas would not \nreject the gifts of perfume. Anas said: The Prophet (ﷺ) used not to reject the gifts of perfume.","reference":"Sahih al-Bukhari 2582, Book 51, Hadith 17","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his attitude towards receiving gifts?","id":"bukhari-51-85"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) he stood up amongst the people, \nGlorified and Praised Allah as He deserved, and said, \"Then after: Your brethren have come to you \nwith repentance and I see it logical to return to them their captives; so whoever amongst you likes to \ndo that as a favor, then he can do it, and whoever of you like to stick to his share till we give him his \nright from the very first Fai (war booty) (1) which Allah will bestow on us, then (he can do so).\" The \npeople replied, \"We do that (to return the captives) willingly as a favor for your sake.\"","reference":"Sahih al-Bukhari 2583, 2584, Book 51, Hadith 18","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) encourage his followers to treat captives and war booty?","id":"bukhari-51-86"},{"hadith-eng":"Allah's Messenger (ﷺ) used to accept gifts and used to give something in return.","reference":"Sahih al-Bukhari 2585, Book 51, Hadith 19","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the practice of reciprocity in social interactions?","id":"bukhari-51-87"},{"hadith-eng":"that his father took him to Allah's Messenger (ﷺ) and said, \"I have given this son of mine a slave.\" The \nProphet asked, \"Have you given all your sons the like?\" He replied in the negative. The Prophet (ﷺ) said, \n\"Take back your gift then.\"","reference":"Sahih al-Bukhari 2586, Book 51, Hadith 20","grade":"","question #":"question #2","question":"How does Islam view the distribution of gifts among children?","id":"bukhari-51-88"},{"hadith-eng":"I heard An-Nu`man bin Bashir on the pulpit saying, \"My father gave me a gift but `Amra bint Rawaha \n(my mother) said that she would not agree to it unless he made Allah's Messenger (ﷺ) as a witness to it. So, \nmy father went to Allah's Messenger (ﷺ) and said, 'I have given a gift to my son from `Amra bint Rawaha, \nbut she ordered me to make you as a witness to it, O Allah's Messenger (ﷺ)!' Allah's Messenger (ﷺ) asked, 'Have \nyou given (the like of it) to everyone of your sons?' He replied in the negative. Allah's Messenger (ﷺ) said, \n'Be afraid of Allah, and be just to your children.' My father then returned and took back his gift.\"","reference":"Sahih al-Bukhari 2587, Book 51, Hadith 21","grade":"","question #":"question #2","question":"How does seeking the Prophet's (ﷺ) guidance reflect on decision-making in family matters?","id":"bukhari-51-89"},{"hadith-eng":"Ubaidullah bin `Abdullah told me that `Aisha had said, \"When the Prophet (ﷺ) became sick and his \ncondition became serious, he requested his wives to allow him to be treated in my house, and they \nallowed him. He came out leaning on two men while his feet were dragging on the ground. He was \nwalking between Al-`Abbas and another man.\" 'Ubaidullah said, \"When I informed Ibn `Abbas of \nwhat `Aisha had said, he asked me whether I knew who was the second man whom `Aisha had not \nnamed. I replied in the negative. He said, 'He was `Ali bin Abi Talib.\"","reference":"Sahih al-Bukhari 2588, Book 51, Hadith 22","grade":"","question #":"question #2","question":"Who were the individuals that supported the Prophet when he was ill, according to this account?","id":"bukhari-51-90"},{"hadith-eng":"The Prophet (ﷺ) said, \"One who takes back his gift (which he has already given) is like a dog that \nswallows its vomit.\"","reference":"Sahih al-Bukhari 2589, Book 51, Hadith 23","grade":"","question #":"question #2","question":"How is the act of reclaiming a gift compared to the behavior of a dog in this teaching?","id":"bukhari-51-91"},{"hadith-eng":"Once I said, \"O Allah's Messenger (ﷺ)! I have no property except what has been given to me by Az-Zubair \n(i.e. her husband). May I give in charity?\" The Prophet (ﷺ) said, \"Give in charity and do not withhold it; \notherwise Allah will withhold it back from you . \"","reference":"Sahih al-Bukhari 2590, Book 51, Hadith 24","grade":"","question #":"question #2","question":"How does withholding charity affect one's relationship with Allah in Islamic teachings?","id":"bukhari-51-92"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a \nlimited amount; and do not withhold your money lest Allah should withhold it from you.\"","reference":"Sahih al-Bukhari 2591, Book 51, Hadith 25","grade":"","question #":"question #2","question":"How does withholding charity impact one's own sustenance according to Islamic teachings?","id":"bukhari-51-93"},{"hadith-eng":"the freed slave of Ibn `Abbas, that Maimuna bint Al-Harith told him that she manumitted a slave-girl \nwithout taking the permission of the Prophet. On the day when it was her turn to be with the Prophet, \nshe said, \"Do you know, O Allah's Messenger (ﷺ), that I have manumitted my slave-girl?\" He said, \"Have \nyou really?\" She replied in the affirmative. He said, \"You would have got more reward if you had \ngiven her (i.e. the slave-girl) to one of your maternal uncles.\"","reference":"Sahih al-Bukhari 2592, Book 51, Hadith 26","grade":"","question #":"question #2","question":"How does the act of manumitting a slave relate to gaining rewards in Islam?","id":"bukhari-51-94"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) wanted to go on a journey, he would draw lots as to which of his wives \nwould accompany him. He would take her whose name came out. He used to fix for each of them a \nday and a night. But Sauda bint Zam`a gave up her (turn) day and night to `Aisha, the wife of the \nProphet in order to seek the pleasure of Allah's Messenger (ﷺ) (by that action).","reference":"Sahih al-Bukhari 2593, Book 51, Hadith 27","grade":"","question #":"question #2","question":"What actions did Sauda bint Zam'a take to seek the pleasure of the Prophet Muhammad (ﷺ)?","id":"bukhari-51-95"},{"hadith-eng":"Narrated Maimuna, the wife of the Prophet (ﷺ) that she manumitted her slave-girl and the Prophet (ﷺ) said to her, \"You would have got more reward if you had given the slave-girl to one of your maternal uncles.\"","reference":"Sahih al-Bukhari 2594, Book 51, Hadith 28","grade":"","question #":"question #2","question":"How can one maximize the reward of charitable acts according to Islamic teachings?","id":"bukhari-51-96"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! I have two neighbors; which of them should I give a gift to?\" The Prophet (ﷺ) \nsaid, \"(Give) to the one whose door is nearer to you.\"","reference":"Sahih al-Bukhari 2595, Book 51, Hadith 29","grade":"","question #":"question #2","question":"What criteria can be used to determine which neighbor to give a gift to first?","id":"bukhari-51-97"},{"hadith-eng":"That he heard As-Sa'b bin Jath-thama Al-Laithi, who was one of the companions of the Prophet, \nsaying that he gave the meat of an onager to Allah's Messenger (ﷺ) while he was at a place called Al-Abwa' \nor Waddan, and was in a state of Ihram. The Prophet (ﷺ) did not accept it. When the Prophet (ﷺ) saw the signs \nof sorrow on As-Sa'b's face because of not accepting his present, he said (to him), \"We are not \nreturning your present, but we are in the state of Ihram.\" (See Hadith No. 747)","reference":"Sahih al-Bukhari 2596, Book 51, Hadith 30","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations where he could not accept a gift due to religious obligations?","id":"bukhari-51-98"},{"hadith-eng":"The Prophet (ﷺ) appointed a man from the tribe of Al-Azd, called Ibn 'Utbiyya for collecting the Zakat. \nWhen he returned he said, \"This (i.e. the Zakat) is for you and this has been given to my as a present.\" \nThe Prophet (ﷺ) said, \"Why hadn't he stayed in his father's or mother's house to see whether he would be \ngiven presents or not? By Him in Whose Hands my life is, whoever takes something from the \nresources of the Zakat (unlawfully) will be carrying it on his neck on the Day of Resurrection; if it be \na camel, it will be grunting; if a cow, it will be mooing; and if a sheep, it will be bleating.\" The \nProphet then raised his hands till we saw the whiteness of his armpits, and he said thrice, \"O Allah! \nHaven't I conveyed Your Message (to them)?\"","reference":"Sahih al-Bukhari 2597, Book 51, Hadith 31","grade":"","question #":"question #2","question":"What are the consequences of misappropriating Zakat funds according to Islamic teachings?","id":"bukhari-51-99"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"I will give you so much (the Prophet (ﷺ) pointed thrice with his hands) when \nfunds of Bahrain will come to me.\" But the Prophet (ﷺ) died before the money reached him. (When it \ncame) Abu Bakr ordered an announcer to announce that whoever had a money claim on the Prophet (ﷺ) or \nwas promised to be given something, should come to Abu Bakr. I went to Abu Bakr and told him that \nthe Prophet (ﷺ) had promised to give me so much. On that Abu Bakr gave me three handfuls (of money).","reference":"Sahih al-Bukhari 2598, Book 51, Hadith 32","grade":"","question #":"question #2","question":"What does this narration illustrate about the fulfillment of promises in Islam?","id":"bukhari-51-100"},{"hadith-eng":"Allah's Messenger (ﷺ) distributed some cloaks but did not give anything thereof to Makhrama. Makhrama \nsaid (to me), \"O son! accompany me to Allah's Messenger (ﷺ).\" When I went with him, he said, \"Call him to \nme.\" I called him (i.e. the Prophet (ﷺ) ) for my father. He came out wearing one of those cloaks and said, \n\"We kept this (cloak) for you, (Makhrama).\" Makhrama looked at the cloak and said, \"Makhrama is \npleased,\" (or the Prophet (ﷺ) said), \"Is Makhrama pleased?\"","reference":"Sahih al-Bukhari 2599, Book 51, Hadith 33","grade":"","question #":"question #2","question":"What can be learned about the Prophet's (ﷺ) approach to distributing gifts or resources among his companions?","id":"bukhari-51-101"},{"hadith-eng":"A man came to Allah's Messenger (ﷺ) and said, \"I am ruined.\" The Prophet (ﷺ) asked, \"What do you mean?\" He \nsaid, \"I had a sexual intercourse with my wife during Ramadan (while fasting).\" The Prophet (ﷺ) asked \nhim, \"Can you manumit a slave?\" He replied in the negative. He then asked him, \"Can you fast for \ntwo successive months continuously\" He replied in the negative. The Prophet (ﷺ) then asked him, \"Can \nyou feed sixty poor persons?\" He replied in the negative. In the meantime an Ansari came with a \nbasket full of dates. The Prophet (ﷺ) said to the man, \"Take it and give it in charity (as an expiation of \nyour sin).\" The man said \"Should I give it to some people who are poorer than we O Allah's Messenger (ﷺ)? \nBy Him Who has sent you with the Truth, there is no family between Medina's two mountains poorer \nthan we.\" Allah's Messenger (ﷺ) told him to take it and provide his family with it.\"","reference":"Sahih al-Bukhari 2600, Book 51, Hadith 34","grade":"","question #":"question #2","question":"How does the concept of charity play a role in seeking forgiveness for sins in Islam?","id":"bukhari-51-102"},{"hadith-eng":"My father was martyred on the day (of the battle) of Uhud and his creditors demanded the debt back \nin a harsh manner. So I went to Allah's Messenger (ﷺ) and informed him of that, he asked them to accept the \nfruits of my garden and excuse my father, but they refused. So, Allah's Messenger (ﷺ) did not give them the \nfruits, nor did he cut them and distribute them among them, but said, \"I will come to you tomorrow \nmorning.\" So, he came to us the next morning and walked about in between the date-palms and \ninvoked Allah to bless their fruits. I plucked the fruits and gave back all the rights of the creditors in \nfull, and a lot of fruits were left for us. Then I went to Allah's Messenger (ﷺ), who was sitting, and informed \nhim about what happened. Allah's Messenger (ﷺ) told `Umar, who was sitting there, to listen to the story. \n`Umar said, \"Don't we know that you are Allah's Messenger (ﷺ)? By Allah! you are Allah's Messenger (ﷺ)!\"","reference":"Sahih al-Bukhari 2601, Book 51, Hadith 35","grade":"","question #":"question #2","question":"What role does invoking Allah's blessings play in overcoming financial difficulties?","id":"bukhari-51-103"},{"hadith-eng":"A drink (milk mixed with water) was brought to the Prophet (ﷺ) who drank some of it while a boy was \nsitting on his right and old men on his left. The Prophet (ﷺ) said to the boy, \"If you permit me, I'll give \n(the rest of the drink to) these old men first.\" The boy said, \"I will not give preference to any one over \nme as regards my share from you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) then put that container in the boy's \nhand. (See Hadith No. 541).","reference":"Sahih al-Bukhari 2602, Book 51, Hadith 36","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate respect and consideration for others in this situation?","id":"bukhari-51-104"},{"hadith-eng":"Jabir (ra) said, \"I went to the Prophet (ﷺ) in the mosque and he paid me my right and gave me more than he owed me.\"","reference":"Sahih al-Bukhari 2603, Book 51, Hadith 37","grade":"","question #":"question #2","question":"How does the Prophet's behavior in this narration exemplify fairness and generosity?","id":"bukhari-51-105"},{"hadith-eng":"I sold a camel to the Prophet (ﷺ) on one of the journeys. When we reached Medina, he ordered me to go \nto the Mosque and offer two rak`at. Then he weighed for me (the price of the camel in gold) and gave \nan extra amount over it. A part of it remained with me till it was taken by the army of Sham on the day \nof Harra.\"","reference":"Sahih al-Bukhari 2604, Book 51, Hadith 38","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate fairness and generosity in business transactions?","id":"bukhari-51-106"},{"hadith-eng":"A drink (of milk and water) was brought to Allah's Messenger (ﷺ) while a boy was sitting on his right side \nand old men were sitting on his left side. He asked the boy, \"Will you allow me to give it to these \n(people)?\" The boy said, \"No, by Allah, I will not allow anyone to take my right from you.\" Then the \nProphet put the bowl in the boy's hand.","reference":"Sahih al-Bukhari 2605, Book 51, Hadith 39","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate fairness and respect for the rights of others in this situation?","id":"bukhari-51-107"},{"hadith-eng":"Allah's Messenger (ﷺ) owed a man some debt (and that man demanded it very harshly). The companions of \nthe Prophet (ﷺ) wanted to harm him, but the Prophet (ﷺ) said to them, \"Leave him, as the creditor has the \nright to speak harshly.\" He then added, \"Buy (a camel) of the same age and give it to him.\" They said, \n\"We cannot get except a camel of an older age than that of his.\" He said, \"Buy it and give it to him, as \nthe best amongst you is he who pays back his debt in the most handsome way.'","reference":"Sahih al-Bukhari 2606, Book 51, Hadith 40","grade":"","question #":"question #2","question":"How should one respond to a creditor who demands repayment harshly?","id":"bukhari-51-108"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) they requested him to return their \nproperty and their captives. He said to them, \"This concerns also other people along with me as you \nsee, and the best statement to me is the true one, so you may choose one of two alternatives; either the \ncaptives or the property and (I have not distributed the booty for) I have been waiting for you.\" \nWhen the Prophet (ﷺ) had returned from Ta'if, he waited for them for more than ten nights. When they \ncame to know that the Prophet (ﷺ) would not return except one of the two, they chose their captives. The \nProphet then stood up amongst the Muslims, Glorified and Praised Allah as He deserved, and then \nsaid, \"Then after: These brothers of yours have come to you with repentance and I see it proper to \nreturn their captives, so whoever amongst you likes to do that as a favor, then he can do it, and \nwhoever of you wants to stick to his share till we pay him from the very first Fai (i.e. war booty) \nwhich Allah will give us, then he can do so.\" The people said, \"We return (the captives) to them \nwillingly as a favor, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"I do not know who of you has given his \nconsent and who has not; so go back and your leaders may present your decision to me.\" The people \nwent away, and their leaders discussed the matter with them, and then came to the Prophet (ﷺ) to tell him \nthat all of them had given their consent (to return the captives) willingly. (Az-Zuhn, the sub-narrator \nsaid, \"This is what we know about the captives, of Hawazin.\")","reference":"Sahih al-Bukhari 2607, 2608, Book 51, Hadith 41","grade":"","question #":"question #2","question":"How does Islam encourage the act of returning captives or property as a gesture of goodwill?","id":"bukhari-51-109"},{"hadith-eng":"The Prophet (ﷺ) took a camel of special age from somebody on credit. Its owner came and demanded it \nback (harshly). The Prophet (ﷺ) said, \"No doubt, he who has a right, can demand it.\" Then the Prophet (ﷺ) \ngave him an older camel than his camel and said, \"The best amongst you is he who repays his debts in \nthe most handsome way.\"","reference":"Sahih al-Bukhari 2609, Book 51, Hadith 42","grade":"","question #":"question #2","question":"How should one respond to a creditor who demands repayment?","id":"bukhari-51-110"},{"hadith-eng":"That he was in the company of the Prophet (ﷺ) on a journey, riding a troublesome camel belonging to \n`Umar. The camel used to go ahead of the Prophet, so Ibn `Umar's father would say, \"O `Abdullah! \nNo one should go ahead of the Prophet.\" The Prophet (ﷺ) said to him, \"Sell it to me.\" `Umar said to the \nProphet \"It is for you.\" So, he bought it and said, \"O `Abdullah! It is for you, and you can do with it \nwhat you like.\"","reference":"Sahih al-Bukhari 2610, Book 51, Hadith 43","grade":"","question #":"question #2","question":"How does this story illustrate the concept of generosity and gift-giving in Islam?","id":"bukhari-51-111"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on a journey, and I was riding a troublesome camel. The Prophet (ﷺ) asked 'Umar to sell that camel to him. So, 'Umar sold it to him. The Prophet (ﷺ) then said, \"O 'Abdullah! The camel is for you.\"","reference":"Sahih al-Bukhari 2611, Book 51, Hadith 44","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations involving troublesome animals during journeys?","id":"bukhari-51-112"},{"hadith-eng":"`Umar bin Al-Khattab saw a silken dress (cloak) being sold at the gate of the Mosque and said, \"O \nAllah's Messenger (ﷺ)! Would that you buy it and wear it on Fridays and when the delegates come to you!\" \nAllah's Messenger (ﷺ) said, \"This is worn by the one who will have no share in the Hereafter.\" Later on some \nsilk dresses were brought and Allah's Messenger (ﷺ) sent one of them to `Umar. `Umar said, \"How do you \ngive me this to wear while you said what you said about the dress of 'Utarid?\" Allah's Messenger (ﷺ) said, \"I \nhave not given it to you to wear.\" So, `Umar gave it to a pagan brother of his in Mecca.","reference":"Sahih al-Bukhari 2612, Book 51, Hadith 45","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the suggestion of wearing silk, and what lesson can be derived from his response?","id":"bukhari-51-113"},{"hadith-eng":"Once the Prophet (ﷺ) went to the house of Fatima but did not enter it. `Ali came and she told him about \nthat. When 'All asked the Prophet (ﷺ) about it, he said, \"I saw a (multicolored) decorated curtain on her \ndoor. I am not interested in worldly things.\" `Ali went to Fatima and told her about it. Fatima said, \"I \nam ready to dispense with it in the way he suggests.\" The Prophet (ﷺ) ordered her to send it to such-andsuch \nneedy people. \"","reference":"Sahih al-Bukhari 2613, Book 51, Hadith 46","grade":"","question #":"question #2","question":"How did Fatima respond to the Prophet's (ﷺ) preference for simplicity and detachment from worldly decorations?","id":"bukhari-51-114"},{"hadith-eng":"The Prophet (ﷺ) gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I \ncut it into pieces and distributed it among my wives.\"","reference":"Sahih al-Bukhari 2614, Book 51, Hadith 47","grade":"","question #":"question #2","question":"How should one respond to the Prophet's disapproval according to Islamic tradition?","id":"bukhari-51-115"},{"hadith-eng":"A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet (ﷺ) used to \nforbid people to wear silk. So, the people were pleased to see it. The Prophet (ﷺ) said, \"By Him in Whose \nHands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" \nAnas added, \"The present was sent to the Prophet (ﷺ) by Ukaidir (a Christian) from Dauma.\"","reference":"Sahih al-Bukhari 2615, 2616, Book 51, Hadith 48","grade":"","question #":"question #2","question":"How does the hadith illustrate the concept of the rewards and blessings in Paradise compared to worldly possessions?","id":"bukhari-51-116"},{"hadith-eng":"A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet (ﷺ) used to \nforbid people to wear silk. So, the people were pleased to see it. The Prophet (ﷺ) said, \"By Him in Whose \nHands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" \nAnas added, \"The present was sent to the Prophet (ﷺ) by Ukaidir (a Christian) from Dauma.\"","reference":"Sahih al-Bukhari 2615, 2616, Book 51, Hadith 48","grade":"","question #":"question #2","question":"How does the hadith illustrate the concept of the rewards and luxuries in Paradise compared to worldly possessions?","id":"bukhari-51-117"},{"hadith-eng":"A Jewess brought a poisoned (cooked) sheep for the Prophet (ﷺ) who ate from it. She was brought to the \nProphet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the \npoison on the palate of the mouth of Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 2617, Book 51, Hadith 49","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate forgiveness in the incident involving the poisoned sheep?","id":"bukhari-51-118"},{"hadith-eng":"We were one-hundred and thirty persons accompanying the Prophet (ﷺ) who asked us whether anyone of \nus had food. There was a man who had about a Sa of wheat which was mixed with water then. A very \ntall pagan came driving sheep. The Prophet (ﷺ) asked him, \"Will you sell us (a sheep) or give it as a \npresent?\" He said, \"I will sell you (a sheep).\" The Prophet (ﷺ) bought a sheep and it was slaughtered. The \nProphet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet (ﷺ) gave \nevery person of the one-hundred-and-thirty a piece of that; he gave all those of them who were \npresent; and kept the shares of those who were absent. The Prophet (ﷺ) then put its meat in two huge \nbasins and all of them ate to their fill, and even then more food was left in the two basins which were \ncarried on the camel (or said something like it).","reference":"Sahih al-Bukhari 2618, Book 51, Hadith 50","grade":"","question #":"question #2","question":"What can be learned about the Prophet Muhammad's (ﷺ) approach to dealing with non-Muslims from this event?","id":"bukhari-51-119"},{"hadith-eng":"`Umar saw a silken cloak over a man for sale and requested the Prophet (ﷺ) to buy it in order to wear it on \nFridays and while meeting delegates. The Prophet (ﷺ) said, \"This is worn by the one who will have no \nshare in the Hereafter.\" Later on Allah's Messenger (ﷺ) got some silken cloaks similar to that one, and he \nsent one to `Umar. `Umar said to the Prophet (ﷺ) \"How can I wear it, while you said about it what you \nsaid?\" The Prophet (ﷺ) said, \"I have not given it to you to wear, but to sell or to give to someone else.\" So, \n`Umar sent it to his brother at Mecca before he embraced Islam.","reference":"Sahih al-Bukhari 2619, Book 51, Hadith 51","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) guide his companions regarding the use of silk?","id":"bukhari-51-120"},{"hadith-eng":"My mother came to me during the lifetime of Allah's Messenger (ﷺ) and she was a pagan. I said to Allah's \nApostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from \nme, shall I keep good relations with her?\" The Prophet (ﷺ) said, \"Yes, keep good relation with her. \"","reference":"Sahih al-Bukhari 2620, Book 51, Hadith 52","grade":"","question #":"question #2","question":"How should one treat a non-Muslim parent who seeks kindness and support?","id":"bukhari-51-121"},{"hadith-eng":"The Prophet (ﷺ) said, \"He who takes back his present is like him who swallows his vomit.\"","reference":"Sahih al-Bukhari 2621, Book 51, Hadith 53","grade":"","question #":"question #2","question":"How is the act of taking back a gift viewed in Islam, and what analogy is used to describe it?","id":"bukhari-51-122"},{"hadith-eng":"The Prophet (ﷺ) said, \"The bad example is not for us. He who takes back his present is like a dog that \nswallows back its vomit.\"","reference":"Sahih al-Bukhari 2622, Book 51, Hadith 54","grade":"","question #":"question #2","question":"How does Islam view the act of taking back a present in terms of moral conduct?","id":"bukhari-51-123"},{"hadith-eng":"I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to \nbuy it from him, thinking that he would sell it cheap. When I asked the Prophet (ﷺ) he said, \"Don't buy it, \neven if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is \nlike a dog that swallows back its vomit.\"","reference":"Sahih al-Bukhari 2623, Book 51, Hadith 55","grade":"","question #":"question #2","question":"How does Islam view the act of taking back a gift or charity once it has been given?","id":"bukhari-51-124"},{"hadith-eng":"The sons of Suhaib, (Suhaib, who was the freed slave of Bani\r\nJud'an) claimed that Allah's Messenger (ﷺ) had given two houses and one room to Suhaib. Marwan asked, \"Who will testify to your claim?\" They replied that Ibn 'Umar\r\nwould do so. Marwan sent for Ibn 'Umar who testified that Allah's Messenger (ﷺ) had really given Suhaib two houses and a room. So, Marwan gave the verdict (in favour of Suhaib's sons), because of (Ibn 'Umar's) witness.","reference":"Sahih al-Bukhari 2624, Book 51, Hadith 56","grade":"","question #":"question #2","question":"How does the credibility of a witness affect the outcome of a legal verdict in Islam?","id":"bukhari-51-125"},{"hadith-eng":"The Prophet (ﷺ) gave the verdict that `Umra is for the one to whom it is presented.","reference":"Sahih al-Bukhari 2625, Book 51, Hadith 57","grade":"","question #":"question #2","question":"How does the ruling on 'Umra affect the ownership of a gift in Islam?","id":"bukhari-51-126"},{"hadith-eng":"The Prophet (ﷺ) said, \"Umra is permissible.\" Ata said, \"Jabir narrated the same to me from the Prophet.\"","reference":"Sahih al-Bukhari 2626, Book 51, Hadith 58","grade":"","question #":"question #2","question":"How does the narration of hadiths by different companions contribute to Islamic jurisprudence?","id":"bukhari-51-127"},{"hadith-eng":"Once the people of Medina were frightened, so the Prophet (ﷺ) borrowed a horse from Abu Talha called \nAl-Mandub, and rode it. When he came back he said, \"We have not seen anything (to be afraid of), \nbut the horse was very fast (having an energy as inexhaustible as the water of the sea).","reference":"Sahih al-Bukhari 2627, Book 51, Hadith 59","grade":"","question #":"question #2","question":"What can be inferred about the Prophet's trust in his companions from his borrowing of a horse?","id":"bukhari-51-128"},{"hadith-eng":"I went to `Aisha and she was wearing a coarse dress costing five Dirhams. `Aisha said, \"Look up and \nsee my slave-girl who refuses to wear it in the house though during the lifetime of Allah's Messenger (ﷺ) I \nhad a similar dress which no woman desiring to appear elegant (before her husband) failed to borrow \nfrom me.\"","reference":"Sahih al-Bukhari 2628, Book 51, Hadith 60","grade":"","question #":"question #2","question":"How does this account reflect the attitudes towards sharing and generosity among the companions of the Prophet (ﷺ)?","id":"bukhari-51-129"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"What a good Maniha (the she-camel which has recently given birth and which \ngives profuse milk) is, and (what a good Maniha) (the sheep which gives profuse milk, a bowl in the \nmorning and another in the evening) is!\"Narrated Malik:Maniha is a good deed of charity.","reference":"Sahih al-Bukhari 2629, Book 51, Hadith 61","grade":"","question #":"question #2","question":"How is the act of giving a she-camel or sheep as Maniha considered a form of charity?","id":"bukhari-51-130"},{"hadith-eng":"Anas bin Malik said, \"When the emigrants came Medina, they had nothing whereas the Ansar had \nland and property. The Ansar gave them their land on condition that the emigrants would give them \nhalf the yearly yield and work on the land and provide the necessaries for cultivation.\" His (i.e. Anas's \nmother who was also the mother of `Abdullah bin Abu Talha, gave some date-palms to Allah' Apostle \nwho gave them to his freed slave-girl (Um Aiman) who was also the mother of Usama bin Zaid. When \nthe Prophet (ﷺ) finished from the fighting against the people of Khaibar and returned to Medina, the \nemigrants returned to the Ansar the fruit gifts which the Ansar had given them. The Prophet (ﷺ) also \nreturned to Anas's mother the date-palms. Allah's Messenger (ﷺ) gave Um Aiman other trees from his garden \nin lieu of the old gift.","reference":"Sahih al-Bukhari 2630, Book 51, Hadith 62","grade":"","question #":"question #2","question":"What was the arrangement between the Ansar and the emigrants regarding land and cultivation?","id":"bukhari-51-131"},{"hadith-eng":"That Allah's Messenger (ﷺ) said, \"There are forty virtuous deeds and the best of them is the Maniha of a shegoat, \nand anyone who does one of these virtuous deeds hoping for Allah's reward with firm \nconfidence that he will get it, then Allah will make him enter Paradise because of Hassan (a subnarrator) \nsaid, \"We tried to count those good deeds below the Maniha; we mentioned replying to the \nsneezer, removing harmful things from the road, etc., but we failed to count even fifteen.\"","reference":"Sahih al-Bukhari 2631, Book 51, Hadith 63","grade":"","question #":"question #2","question":"How does the intention and confidence in Allah's reward influence the acceptance of good deeds?","id":"bukhari-51-132"},{"hadith-eng":"Some men had superfluous land and they said that they would give it to others to cultivate on the \ncondition that they would get one-third or one-fourth or one half of its yield. The Prophet (ﷺ) said, \n\"Whoever has land should cultivate it himself or give it to his brother or keep it uncultivated.\"","reference":"Sahih al-Bukhari 2632, Book 51, Hadith 64","grade":"","question #":"question #2","question":"What guidance does Islam provide regarding the sharing of agricultural land and its produce?","id":"bukhari-51-133"},{"hadith-eng":"A bedouin came to the Prophet (ﷺ) and asked him about emigration. The Prophet (ﷺ) \nsaid to him, \"May Allah be merciful to you. The matter of emigration is difficult. Have you got some \ncamels?\" He replied in the affirmative. The Prophet (ﷺ) asked him, \"Do you pay their Zakat?\" He replied \nin the affirmative. He asked, \"Do you lend them so that their milk may be utilized by others?\" The \nbedouin said, \"Yes.\" The Prophet (ﷺ) asked, \"Do you milk them on the day off watering them?\" He \nreplied, \"Yes.\" The Prophet (ﷺ) said, \"Do good deeds beyond the merchants (or the sea) and Allah will \nnever disregard any of your deeds.\" (See Hadith No. 260, Vol. 5)","reference":"Sahih al-Bukhari 2633, Book 51, Hadith 65","grade":"","question #":"question #2","question":"How does the practice of paying Zakat and sharing resources reflect on a person's faith and character?","id":"bukhari-51-134"},{"hadith-eng":"That he was told by the most learned one amongst them (i.e. Ibn `Abbas) that the Prophet (ﷺ) went \ntowards some land which was flourishing with vegetation and asked to whom it belonged. He was told \nthat such and such a person took it on rent. The Prophet (ﷺ) said, \"It would have been better (for the \nowner) if he had given it to him gratis rather than charging him a fixed rent.","reference":"Sahih al-Bukhari 2634, Book 51, Hadith 66","grade":"","question #":"question #2","question":"How does Islam view the practice of renting land or property for cultivation?","id":"bukhari-51-135"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Prophet (ﷺ) Abraham migrated with Sarah. The people (of the town where they \nmigrated) gave her Ajar (i.e. Hajar). Sarah returned and said to Abraham, \"Do you know that Allah \nhas humiliated that pagan and he has given a slave-girl for my service?\"","reference":"Sahih al-Bukhari 2635, Book 51, Hadith 67","grade":"","question #":"question #2","question":"How did Sarah perceive the outcome of their migration in terms of divine intervention?","id":"bukhari-51-136"},{"hadith-eng":"Once I gave a horse (for riding) in Allah's Cause. Later I saw it being sold. I asked Allah's Messenger (ﷺ) \n(whether I could buy it). He said, \"Don't buy it, for you should not get back what you have given in \ncharity.\"","reference":"Sahih al-Bukhari 2636, Book 51, Hadith 68","grade":"","question #":"question #2","question":"How does Islam view the act of reclaiming a charitable donation?","id":"bukhari-51-137"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Muslim women! None of you should look down upon the gift sent by her female neighbor \neven if it were the trotters of the sheep (fleshless part of legs).","reference":"Sahih al-Bukhari 2566, Book 51, Hadith 1","grade":"","question #":"question #3","question":"What role do women play in maintaining neighborly relations according to Islamic teachings?","id":"bukhari-51-138"},{"hadith-eng":"Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the \ncrescent in this way we saw three crescents in two months and no fire (for cooking) used to be made \nin the houses of Allah's Messenger (ﷺ). I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The \ntwo black things: dates and water, our neighbors from Ansar had some Manarh and they used to \npresent Allah's Messenger (ﷺ) some of their milk and he used to make us drink.\"","reference":"Sahih al-Bukhari 2567, Book 51, Hadith 2","grade":"","question #":"question #3","question":"What does the reliance on simple sustenance like dates and water indicate about the lifestyle of the Prophet Muhammad (ﷺ)?","id":"bukhari-51-139"},{"hadith-eng":"The Prophet (ﷺ) said, \"I shall accept the invitation even if I were invited to a meal of a sheep's trotter, and \nI shall accept the gift even if it were an arm or a trotter of a sheep.\"","reference":"Sahih al-Bukhari 2568, Book 51, Hadith 3","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) attitude towards social interactions and hospitality from his actions?","id":"bukhari-51-140"},{"hadith-eng":"The Prophet (ﷺ) sent for a woman from the emigrants and she had a slave who was a carpenter. The \nProphet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her \nslave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he \nfinished the pulpit, the woman informed the Prophet (ﷺ) that it had been finished. The Prophet (ﷺ) asked her \nto send that pulpit to him, so they brought it. The Prophet (ﷺ) lifted it and placed it at the place in which \nyou see now.\"","reference":"Sahih al-Bukhari 2569, Book 51, Hadith 4","grade":"","question #":"question #3","question":"What role did the emigrant woman and her slave play in the preparation of the Prophet's pulpit?","id":"bukhari-51-141"},{"hadith-eng":"That his father said, \"One day I was sitting with some of the Prophet's companions on the way to \nMecca. Allah's Messenger (ﷺ) was ahead of us. All of my companions were in the state of Ihram while I was \na non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about \nit but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it \nand rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me \nthe whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became \nangry and got down from the horse, picked up both the things and rode the horse again. I attacked the \nonager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and \nstarted eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the \nstate of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Messenger (ﷺ) \nand asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the \naffirmative and gave him that fleshy foreleg which he ate completely while he was in the state of \nIhram .","reference":"Sahih al-Bukhari 2570, Book 51, Hadith 5","grade":"","question #":"question #3","question":"What does the Prophet's (ﷺ) action of eating the onager's meat indicate about the permissibility of consuming certain foods during Ihram?","id":"bukhari-51-142"},{"hadith-eng":"Once Allah's Messenger (ﷺ) visited us in this house of ours and asked for something to drink. We milked one \nof our sheep and mixed it with water from this well of ours and gave it to him. Abu Bakr was sitting \non his left side and `Umar in front of him and a bedouin on his right side. When Allah's Messenger (ﷺ) \nfinished, `Umar said to Allah's Messenger (ﷺ) \"Here is Abu Bakr.\" But Allah's Messenger (ﷺ) gave the remaining \nmilk to the bedouin and said twice, \"The (persons on the) right side! So, start from the right side.\" \nAnas added, \"It is a Sunna (the Prophet's traditions)\" and repeated it thrice.","reference":"Sahih al-Bukhari 2571, Book 51, Hadith 6","grade":"","question #":"question #3","question":"What can be learned about the etiquette of serving drinks from this narration?","id":"bukhari-51-143"},{"hadith-eng":"We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered \nand caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's \nApostle. (The narrator confirms that he sent two thighs). The Prophet (ﷺ) accepted that. (The sub-narrator \nasked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it.\")","reference":"Sahih al-Bukhari 2572, Book 51, Hadith 7","grade":"","question #":"question #3","question":"What can be learned about the permissibility of eating certain animals in Islam from this event?","id":"bukhari-51-144"},{"hadith-eng":"An onager was presented to Allah's Messenger (ﷺ) at the place called Al-Abwa' or Waddan, but Allah's \nApostle rejected it. When the Prophet (ﷺ) noticed the signs of sorrow on the giver's face he said, \"We \nhave not rejected your gift, but we are in the state of Ihram.\" (i.e. if we were not in a state of Ihram we \nwould have accepted your gift, Fath-ul-Bari page 130, Vol. 6)","reference":"Sahih al-Bukhari 2573, Book 51, Hadith 8","grade":"","question #":"question #3","question":"What can be learned about the etiquette of giving and receiving gifts in Islam from this incident?","id":"bukhari-51-145"},{"hadith-eng":"The people used to look forward for the days of my (`Aisha's) turn to send gifts to Allah's Messenger (ﷺ) in \norder to please him.","reference":"Sahih al-Bukhari 2574, Book 51, Hadith 9","grade":"","question #":"question #3","question":"What role did Aisha play in the companions' interactions with the Prophet Muhammad (ﷺ)?","id":"bukhari-51-146"},{"hadith-eng":"Ibn `Abbas said: Um Hufaid, Ibn `Abbas's aunt sent some dried yogurt (butter free), ghee (butter) and \na mastigar to the Prophet (ﷺ) as a gift. The Prophet (ﷺ) ate the dried yogurt and butter but left the mastigar \nbecause he disliked it. Ibn `Abbas said, \"The mastigar was eaten at the table of Allah's Messenger (ﷺ) and if \nit had been illegal to eat, it could not have been eaten at the table of Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 2575, Book 51, Hadith 10","grade":"","question #":"question #3","question":"What role does the Prophet's (ﷺ) dining table play in determining the legality of food items in Islam?","id":"bukhari-51-147"},{"hadith-eng":"Whenever a meal was brought to Allah's Messenger (ﷺ), he would ask whether it was a gift or Sadaqa \n(something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, \nbut if it was a gift, he would hurry to share it with them.","reference":"Sahih al-Bukhari 2576, Book 51, Hadith 11","grade":"","question #":"question #3","question":"What actions did the Prophet (ﷺ) take when presented with food, and how did he involve his companions?","id":"bukhari-51-148"},{"hadith-eng":"Some meat was brought to the Prophet (ﷺ) and it was said that the meat had been given in charity to \r\nBarirah. He said, \"It was Sadaqa for Barirah but a gift for us.\"","reference":"Sahih al-Bukhari 2577, Book 51, Hadith 12","grade":"","question #":"question #3","question":"How can the same item be considered charity for one person and a gift for another in Islamic teachings?","id":"bukhari-51-149"},{"hadith-eng":"I intended to buy Barirah but her masters stipulated that her Wala should be for them. When the \r\nProphet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" \r\nOnce Barirah was given some meat, and the Prophet (ﷺ) asked, \"What is this?\" I said, \"It has been given \r\nto Barirah in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Barirah was given the option (to \r\nstay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her \r\nhusband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether \r\nher husband was a slave or a free man. He replied that he did not know whether he was a slave or a \r\nfree man.\"","reference":"Sahih al-Bukhari 2578, Book 51, Hadith 13","grade":"","question #":"question #3","question":"What options are available to a freed slave in terms of marital status according to Islamic teachings?","id":"bukhari-51-150"},{"hadith-eng":"Once the Prophet (ﷺ) went to `Aisha and asked her whether she had something (to eat). She said that she \r\nhad nothing except the mutton which Um 'Atiyya had sent to (Barirah) in charity. The Prophet (ﷺ) said \r\nthat it had reached its destination (i.e. it is no longer an object of charity.)","reference":"Sahih al-Bukhari 2579, Book 51, Hadith 14","grade":"","question #":"question #3","question":"What can be inferred about the permissibility of consuming charity once it has been given to its recipient?","id":"bukhari-51-151"},{"hadith-eng":"The people used to send gifts to the Prophet (ﷺ) on the day of my turn. Um Salama said: \"My companions \n(the wives of the Prophet (ﷺ) Other than Aisha) gathered and they complained about it. So I informed the \nProphet about it on their behalf, but he remained silent.","reference":"Sahih al-Bukhari 2580, Book 51, Hadith 15","grade":"","question #":"question #3","question":"What was the Prophet Muhammad's (ﷺ) response when informed about the wives' concerns over gift-giving?","id":"bukhari-51-152"},{"hadith-eng":"The wives of Allah's Messenger (ﷺ) were in two groups. One group consisted of `Aisha, Hafsa, Safiyya and \nSauda; and the other group consisted of Um Salama and the other wives of Allah's Messenger (ﷺ). The \nMuslims knew that Allah's Messenger (ﷺ) loved `Aisha, so if any of them had a gift and wished to give to \nAllah's Messenger (ﷺ), he would delay it, till Allah's Messenger (ﷺ) had come to `Aisha's home and then he would \nsend his gift to Allah's Messenger (ﷺ) in her home. The group of Um Salama discussed the matter together \nand decided that Um Salama should request Allah's Messenger (ﷺ) to tell the people to send their gifts to him \nin whatever wife's house he was. Um Salama told Allah's Messenger (ﷺ) of what they had said, but he did not \nreply. \nThen they (those wives) asked Um Salama about it. She said, \"He did not say anything to me.\" They \nasked her to talk to him again. She talked to him again when she met him on her day, but he gave no \nreply. When they asked her, she replied that he had given no reply. They said to her, \"Talk to him till \nhe gives you a reply.\" When it was her turn, she talked to him again. He then said to her, \"Do not hurt \nme regarding Aisha, as the Divine Inspirations do not come to me on any of the beds except that of \nAisha.\" On that Um Salama said, \"I repent to Allah for hurting you.\" Then the group of Um Salama \ncalled Fatima, the daughter of Allah's Messenger (ﷺ) and sent her to Allah's Messenger (ﷺ) to say to him, \"Your \nwives request to treat them and the daughter of Abu Bakr on equal terms.\" \nThen Fatima conveyed the message to him. The Prophet (ﷺ) said, \"O my daughter! Don't you love whom \nI love?\" She replied in the affirmative and returned and told them of the situation. They requested her \nto go to him again but she refused. They then sent Zainab bint Jahsh who went to him and used harsh \nwords saying, \"Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal \nterms.\" On that she raised her voice and abused `Aisha to her face so much so that Allah's Messenger (ﷺ) \nlooked at `Aisha to see whether she would retort. `Aisha started replying to Zainab till she silenced \nher. The Prophet (ﷺ) then looked at `Aisha and said, \"She is really the daughter of Abu Bakr.\"","reference":"Sahih al-Bukhari 2581, Book 51, Hadith 16","grade":"","question #":"question #3","question":"How did Aisha demonstrate her relationship with the Prophet (ﷺ) during the confrontation with Zainab bint Jahsh?","id":"bukhari-51-153"},{"hadith-eng":"When I went to Thumama bin `Abdullah, he gave me some perfume and said that Anas would not \nreject the gifts of perfume. Anas said: The Prophet (ﷺ) used not to reject the gifts of perfume.","reference":"Sahih al-Bukhari 2582, Book 51, Hadith 17","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) practice regarding the acceptance of perfume as a gift?","id":"bukhari-51-154"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) he stood up amongst the people, \nGlorified and Praised Allah as He deserved, and said, \"Then after: Your brethren have come to you \nwith repentance and I see it logical to return to them their captives; so whoever amongst you likes to \ndo that as a favor, then he can do it, and whoever of you like to stick to his share till we give him his \nright from the very first Fai (war booty) (1) which Allah will bestow on us, then (he can do so).\" The \npeople replied, \"We do that (to return the captives) willingly as a favor for your sake.\"","reference":"Sahih al-Bukhari 2583, 2584, Book 51, Hadith 18","grade":"","question #":"question #3","question":"What role does community consensus play in decision-making according to Islamic teachings?","id":"bukhari-51-155"},{"hadith-eng":"Allah's Messenger (ﷺ) used to accept gifts and used to give something in return.","reference":"Sahih al-Bukhari 2585, Book 51, Hadith 19","grade":"","question #":"question #3","question":"What can be learned about the etiquette of giving and receiving gifts from the actions of the Prophet Muhammad (ﷺ)?","id":"bukhari-51-156"},{"hadith-eng":"that his father took him to Allah's Messenger (ﷺ) and said, \"I have given this son of mine a slave.\" The \nProphet asked, \"Have you given all your sons the like?\" He replied in the negative. The Prophet (ﷺ) said, \n\"Take back your gift then.\"","reference":"Sahih al-Bukhari 2586, Book 51, Hadith 20","grade":"","question #":"question #3","question":"What actions should a parent take if they have shown favoritism among their children?","id":"bukhari-51-157"},{"hadith-eng":"I heard An-Nu`man bin Bashir on the pulpit saying, \"My father gave me a gift but `Amra bint Rawaha \n(my mother) said that she would not agree to it unless he made Allah's Messenger (ﷺ) as a witness to it. So, \nmy father went to Allah's Messenger (ﷺ) and said, 'I have given a gift to my son from `Amra bint Rawaha, \nbut she ordered me to make you as a witness to it, O Allah's Messenger (ﷺ)!' Allah's Messenger (ﷺ) asked, 'Have \nyou given (the like of it) to everyone of your sons?' He replied in the negative. Allah's Messenger (ﷺ) said, \n'Be afraid of Allah, and be just to your children.' My father then returned and took back his gift.\"","reference":"Sahih al-Bukhari 2587, Book 51, Hadith 21","grade":"","question #":"question #3","question":"What are the implications of parental favoritism in Islamic teachings?","id":"bukhari-51-158"},{"hadith-eng":"Ubaidullah bin `Abdullah told me that `Aisha had said, \"When the Prophet (ﷺ) became sick and his \ncondition became serious, he requested his wives to allow him to be treated in my house, and they \nallowed him. He came out leaning on two men while his feet were dragging on the ground. He was \nwalking between Al-`Abbas and another man.\" 'Ubaidullah said, \"When I informed Ibn `Abbas of \nwhat `Aisha had said, he asked me whether I knew who was the second man whom `Aisha had not \nnamed. I replied in the negative. He said, 'He was `Ali bin Abi Talib.\"","reference":"Sahih al-Bukhari 2588, Book 51, Hadith 22","grade":"","question #":"question #3","question":"What can be inferred about the relationship between the Prophet and his companions from this narration?","id":"bukhari-51-159"},{"hadith-eng":"The Prophet (ﷺ) said, \"One who takes back his gift (which he has already given) is like a dog that \nswallows its vomit.\"","reference":"Sahih al-Bukhari 2589, Book 51, Hadith 23","grade":"","question #":"question #3","question":"What lessons can be learned about generosity and commitment from this analogy?","id":"bukhari-51-160"},{"hadith-eng":"Once I said, \"O Allah's Messenger (ﷺ)! I have no property except what has been given to me by Az-Zubair \n(i.e. her husband). May I give in charity?\" The Prophet (ﷺ) said, \"Give in charity and do not withhold it; \notherwise Allah will withhold it back from you . \"","reference":"Sahih al-Bukhari 2590, Book 51, Hadith 24","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the distribution of one's wealth in charity?","id":"bukhari-51-161"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a \nlimited amount; and do not withhold your money lest Allah should withhold it from you.\"","reference":"Sahih al-Bukhari 2591, Book 51, Hadith 25","grade":"","question #":"question #3","question":"What are the potential consequences of giving reluctantly in the context of Islamic charity?","id":"bukhari-51-162"},{"hadith-eng":"the freed slave of Ibn `Abbas, that Maimuna bint Al-Harith told him that she manumitted a slave-girl \nwithout taking the permission of the Prophet. On the day when it was her turn to be with the Prophet, \nshe said, \"Do you know, O Allah's Messenger (ﷺ), that I have manumitted my slave-girl?\" He said, \"Have \nyou really?\" She replied in the affirmative. He said, \"You would have got more reward if you had \ngiven her (i.e. the slave-girl) to one of your maternal uncles.\"","reference":"Sahih al-Bukhari 2592, Book 51, Hadith 26","grade":"","question #":"question #3","question":"What alternative actions could increase the reward when freeing a slave according to Islamic teachings?","id":"bukhari-51-163"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) wanted to go on a journey, he would draw lots as to which of his wives \nwould accompany him. He would take her whose name came out. He used to fix for each of them a \nday and a night. But Sauda bint Zam`a gave up her (turn) day and night to `Aisha, the wife of the \nProphet in order to seek the pleasure of Allah's Messenger (ﷺ) (by that action).","reference":"Sahih al-Bukhari 2593, Book 51, Hadith 27","grade":"","question #":"question #3","question":"What can be learned about the distribution of time and attention among the Prophet's wives from this narration?","id":"bukhari-51-164"},{"hadith-eng":"Narrated Maimuna, the wife of the Prophet (ﷺ) that she manumitted her slave-girl and the Prophet (ﷺ) said to her, \"You would have got more reward if you had given the slave-girl to one of your maternal uncles.\"","reference":"Sahih al-Bukhari 2594, Book 51, Hadith 28","grade":"","question #":"question #3","question":"What is the importance of considering family ties when giving charity in Islam?","id":"bukhari-51-165"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! I have two neighbors; which of them should I give a gift to?\" The Prophet (ﷺ) \nsaid, \"(Give) to the one whose door is nearer to you.\"","reference":"Sahih al-Bukhari 2595, Book 51, Hadith 29","grade":"","question #":"question #3","question":"What is the significance of proximity in choosing whom to give a gift to among neighbors?","id":"bukhari-51-166"},{"hadith-eng":"That he heard As-Sa'b bin Jath-thama Al-Laithi, who was one of the companions of the Prophet, \nsaying that he gave the meat of an onager to Allah's Messenger (ﷺ) while he was at a place called Al-Abwa' \nor Waddan, and was in a state of Ihram. The Prophet (ﷺ) did not accept it. When the Prophet (ﷺ) saw the signs \nof sorrow on As-Sa'b's face because of not accepting his present, he said (to him), \"We are not \nreturning your present, but we are in the state of Ihram.\" (See Hadith No. 747)","reference":"Sahih al-Bukhari 2596, Book 51, Hadith 30","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) sensitivity towards the feelings of others from this incident?","id":"bukhari-51-167"},{"hadith-eng":"The Prophet (ﷺ) appointed a man from the tribe of Al-Azd, called Ibn 'Utbiyya for collecting the Zakat. \nWhen he returned he said, \"This (i.e. the Zakat) is for you and this has been given to my as a present.\" \nThe Prophet (ﷺ) said, \"Why hadn't he stayed in his father's or mother's house to see whether he would be \ngiven presents or not? By Him in Whose Hands my life is, whoever takes something from the \nresources of the Zakat (unlawfully) will be carrying it on his neck on the Day of Resurrection; if it be \na camel, it will be grunting; if a cow, it will be mooing; and if a sheep, it will be bleating.\" The \nProphet then raised his hands till we saw the whiteness of his armpits, and he said thrice, \"O Allah! \nHaven't I conveyed Your Message (to them)?\"","reference":"Sahih al-Bukhari 2597, Book 51, Hadith 31","grade":"","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) emphasize the accountability of individuals on the Day of Resurrection for their actions?","id":"bukhari-51-168"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"I will give you so much (the Prophet (ﷺ) pointed thrice with his hands) when \nfunds of Bahrain will come to me.\" But the Prophet (ﷺ) died before the money reached him. (When it \ncame) Abu Bakr ordered an announcer to announce that whoever had a money claim on the Prophet (ﷺ) or \nwas promised to be given something, should come to Abu Bakr. I went to Abu Bakr and told him that \nthe Prophet (ﷺ) had promised to give me so much. On that Abu Bakr gave me three handfuls (of money).","reference":"Sahih al-Bukhari 2598, Book 51, Hadith 32","grade":"","question #":"question #3","question":"How does this event reflect the trust and responsibility placed on the companions of the Prophet (ﷺ)?","id":"bukhari-51-169"},{"hadith-eng":"Allah's Messenger (ﷺ) distributed some cloaks but did not give anything thereof to Makhrama. Makhrama \nsaid (to me), \"O son! accompany me to Allah's Messenger (ﷺ).\" When I went with him, he said, \"Call him to \nme.\" I called him (i.e. the Prophet (ﷺ) ) for my father. He came out wearing one of those cloaks and said, \n\"We kept this (cloak) for you, (Makhrama).\" Makhrama looked at the cloak and said, \"Makhrama is \npleased,\" (or the Prophet (ﷺ) said), \"Is Makhrama pleased?\"","reference":"Sahih al-Bukhari 2599, Book 51, Hadith 33","grade":"","question #":"question #3","question":"How does this incident reflect the importance of personal interaction and reassurance in resolving misunderstandings?","id":"bukhari-51-170"},{"hadith-eng":"A man came to Allah's Messenger (ﷺ) and said, \"I am ruined.\" The Prophet (ﷺ) asked, \"What do you mean?\" He \nsaid, \"I had a sexual intercourse with my wife during Ramadan (while fasting).\" The Prophet (ﷺ) asked \nhim, \"Can you manumit a slave?\" He replied in the negative. He then asked him, \"Can you fast for \ntwo successive months continuously\" He replied in the negative. The Prophet (ﷺ) then asked him, \"Can \nyou feed sixty poor persons?\" He replied in the negative. In the meantime an Ansari came with a \nbasket full of dates. The Prophet (ﷺ) said to the man, \"Take it and give it in charity (as an expiation of \nyour sin).\" The man said \"Should I give it to some people who are poorer than we O Allah's Messenger (ﷺ)? \nBy Him Who has sent you with the Truth, there is no family between Medina's two mountains poorer \nthan we.\" Allah's Messenger (ﷺ) told him to take it and provide his family with it.\"","reference":"Sahih al-Bukhari 2600, Book 51, Hadith 34","grade":"","question #":"question #3","question":"What is the significance of the Prophet's (ﷺ) response to the man's inability to fulfill the traditional forms of expiation?","id":"bukhari-51-171"},{"hadith-eng":"My father was martyred on the day (of the battle) of Uhud and his creditors demanded the debt back \nin a harsh manner. So I went to Allah's Messenger (ﷺ) and informed him of that, he asked them to accept the \nfruits of my garden and excuse my father, but they refused. So, Allah's Messenger (ﷺ) did not give them the \nfruits, nor did he cut them and distribute them among them, but said, \"I will come to you tomorrow \nmorning.\" So, he came to us the next morning and walked about in between the date-palms and \ninvoked Allah to bless their fruits. I plucked the fruits and gave back all the rights of the creditors in \nfull, and a lot of fruits were left for us. Then I went to Allah's Messenger (ﷺ), who was sitting, and informed \nhim about what happened. Allah's Messenger (ﷺ) told `Umar, who was sitting there, to listen to the story. \n`Umar said, \"Don't we know that you are Allah's Messenger (ﷺ)? By Allah! you are Allah's Messenger (ﷺ)!\"","reference":"Sahih al-Bukhari 2601, Book 51, Hadith 35","grade":"","question #":"question #3","question":"How did the companions of the Prophet Muhammad (ﷺ) react to witnessing his miracles?","id":"bukhari-51-172"},{"hadith-eng":"A drink (milk mixed with water) was brought to the Prophet (ﷺ) who drank some of it while a boy was \nsitting on his right and old men on his left. The Prophet (ﷺ) said to the boy, \"If you permit me, I'll give \n(the rest of the drink to) these old men first.\" The boy said, \"I will not give preference to any one over \nme as regards my share from you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) then put that container in the boy's \nhand. (See Hadith No. 541).","reference":"Sahih al-Bukhari 2602, Book 51, Hadith 36","grade":"","question #":"question #3","question":"What can be learned about the importance of seeking permission in Islamic etiquette from this event?","id":"bukhari-51-173"},{"hadith-eng":"Jabir (ra) said, \"I went to the Prophet (ﷺ) in the mosque and he paid me my right and gave me more than he owed me.\"","reference":"Sahih al-Bukhari 2603, Book 51, Hadith 37","grade":"","question #":"question #3","question":"What can be learned about the importance of settling debts promptly from this account?","id":"bukhari-51-174"},{"hadith-eng":"I sold a camel to the Prophet (ﷺ) on one of the journeys. When we reached Medina, he ordered me to go \nto the Mosque and offer two rak`at. Then he weighed for me (the price of the camel in gold) and gave \nan extra amount over it. A part of it remained with me till it was taken by the army of Sham on the day \nof Harra.\"","reference":"Sahih al-Bukhari 2604, Book 51, Hadith 38","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) character from his interaction with Jabir bin `Abdullah regarding the sale of the camel?","id":"bukhari-51-175"},{"hadith-eng":"A drink (of milk and water) was brought to Allah's Messenger (ﷺ) while a boy was sitting on his right side \nand old men were sitting on his left side. He asked the boy, \"Will you allow me to give it to these \n(people)?\" The boy said, \"No, by Allah, I will not allow anyone to take my right from you.\" Then the \nProphet put the bowl in the boy's hand.","reference":"Sahih al-Bukhari 2605, Book 51, Hadith 39","grade":"","question #":"question #3","question":"What can be learned about the importance of seeking permission and respecting the rights of others from this event?","id":"bukhari-51-176"},{"hadith-eng":"Allah's Messenger (ﷺ) owed a man some debt (and that man demanded it very harshly). The companions of \nthe Prophet (ﷺ) wanted to harm him, but the Prophet (ﷺ) said to them, \"Leave him, as the creditor has the \nright to speak harshly.\" He then added, \"Buy (a camel) of the same age and give it to him.\" They said, \n\"We cannot get except a camel of an older age than that of his.\" He said, \"Buy it and give it to him, as \nthe best amongst you is he who pays back his debt in the most handsome way.'","reference":"Sahih al-Bukhari 2606, Book 51, Hadith 40","grade":"","question #":"question #3","question":"What qualities make a person the best in terms of repaying debts according to Islamic teachings?","id":"bukhari-51-177"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) they requested him to return their \nproperty and their captives. He said to them, \"This concerns also other people along with me as you \nsee, and the best statement to me is the true one, so you may choose one of two alternatives; either the \ncaptives or the property and (I have not distributed the booty for) I have been waiting for you.\" \nWhen the Prophet (ﷺ) had returned from Ta'if, he waited for them for more than ten nights. When they \ncame to know that the Prophet (ﷺ) would not return except one of the two, they chose their captives. The \nProphet then stood up amongst the Muslims, Glorified and Praised Allah as He deserved, and then \nsaid, \"Then after: These brothers of yours have come to you with repentance and I see it proper to \nreturn their captives, so whoever amongst you likes to do that as a favor, then he can do it, and \nwhoever of you wants to stick to his share till we pay him from the very first Fai (i.e. war booty) \nwhich Allah will give us, then he can do so.\" The people said, \"We return (the captives) to them \nwillingly as a favor, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"I do not know who of you has given his \nconsent and who has not; so go back and your leaders may present your decision to me.\" The people \nwent away, and their leaders discussed the matter with them, and then came to the Prophet (ﷺ) to tell him \nthat all of them had given their consent (to return the captives) willingly. (Az-Zuhn, the sub-narrator \nsaid, \"This is what we know about the captives, of Hawazin.\")","reference":"Sahih al-Bukhari 2607, 2608, Book 51, Hadith 41","grade":"","question #":"question #3","question":"What role does the Prophet Muhammad (ﷺ) play in mediating and guiding the community in matters of conflict resolution?","id":"bukhari-51-178"},{"hadith-eng":"When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) they requested him to return their \nproperty and their captives. He said to them, \"This concerns also other people along with me as you \nsee, and the best statement to me is the true one, so you may choose one of two alternatives; either the \ncaptives or the property and (I have not distributed the booty for) I have been waiting for you.\" \nWhen the Prophet (ﷺ) had returned from Ta'if, he waited for them for more than ten nights. When they \ncame to know that the Prophet (ﷺ) would not return except one of the two, they chose their captives. The \nProphet then stood up amongst the Muslims, Glorified and Praised Allah as He deserved, and then \nsaid, \"Then after: These brothers of yours have come to you with repentance and I see it proper to \nreturn their captives, so whoever amongst you likes to do that as a favor, then he can do it, and \nwhoever of you wants to stick to his share till we pay him from the very first Fai (i.e. war booty) \nwhich Allah will give us, then he can do so.\" The people said, \"We return (the captives) to them \nwillingly as a favor, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"I do not know who of you has given his \nconsent and who has not; so go back and your leaders may present your decision to me.\" The people \nwent away, and their leaders discussed the matter with them, and then came to the Prophet (ﷺ) to tell him \nthat all of them had given their consent (to return the captives) willingly. (Az-Zuhn, the sub-narrator \nsaid, \"This is what we know about the captives, of Hawazin.\")","reference":"Sahih al-Bukhari 2607, 2608, Book 51, Hadith 41","grade":"","question #":"question #3","question":"What role does the concept of repentance play in the reconciliation process within a community?","id":"bukhari-51-179"},{"hadith-eng":"The Prophet (ﷺ) took a camel of special age from somebody on credit. Its owner came and demanded it \nback (harshly). The Prophet (ﷺ) said, \"No doubt, he who has a right, can demand it.\" Then the Prophet (ﷺ) \ngave him an older camel than his camel and said, \"The best amongst you is he who repays his debts in \nthe most handsome way.\"","reference":"Sahih al-Bukhari 2609, Book 51, Hadith 42","grade":"","question #":"question #3","question":"What qualities make a person the best in terms of repaying debts?","id":"bukhari-51-180"},{"hadith-eng":"That he was in the company of the Prophet (ﷺ) on a journey, riding a troublesome camel belonging to \n`Umar. The camel used to go ahead of the Prophet, so Ibn `Umar's father would say, \"O `Abdullah! \nNo one should go ahead of the Prophet.\" The Prophet (ﷺ) said to him, \"Sell it to me.\" `Umar said to the \nProphet \"It is for you.\" So, he bought it and said, \"O `Abdullah! It is for you, and you can do with it \nwhat you like.\"","reference":"Sahih al-Bukhari 2610, Book 51, Hadith 43","grade":"","question #":"question #3","question":"What can be learned about the relationship between the Prophet and his companions from this incident?","id":"bukhari-51-181"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on a journey, and I was riding a troublesome camel. The Prophet (ﷺ) asked 'Umar to sell that camel to him. So, 'Umar sold it to him. The Prophet (ﷺ) then said, \"O 'Abdullah! The camel is for you.\"","reference":"Sahih al-Bukhari 2611, Book 51, Hadith 44","grade":"","question #":"question #3","question":"What does this story illustrate about the relationship between the Prophet Muhammad (ﷺ) and his companions?","id":"bukhari-51-182"},{"hadith-eng":"`Umar bin Al-Khattab saw a silken dress (cloak) being sold at the gate of the Mosque and said, \"O \nAllah's Messenger (ﷺ)! Would that you buy it and wear it on Fridays and when the delegates come to you!\" \nAllah's Messenger (ﷺ) said, \"This is worn by the one who will have no share in the Hereafter.\" Later on some \nsilk dresses were brought and Allah's Messenger (ﷺ) sent one of them to `Umar. `Umar said, \"How do you \ngive me this to wear while you said what you said about the dress of 'Utarid?\" Allah's Messenger (ﷺ) said, \"I \nhave not given it to you to wear.\" So, `Umar gave it to a pagan brother of his in Mecca.","reference":"Sahih al-Bukhari 2612, Book 51, Hadith 45","grade":"","question #":"question #3","question":"What can be learned from Umar's decision to give the silk dress to his pagan brother in Mecca?","id":"bukhari-51-183"},{"hadith-eng":"Once the Prophet (ﷺ) went to the house of Fatima but did not enter it. `Ali came and she told him about \nthat. When 'All asked the Prophet (ﷺ) about it, he said, \"I saw a (multicolored) decorated curtain on her \ndoor. I am not interested in worldly things.\" `Ali went to Fatima and told her about it. Fatima said, \"I \nam ready to dispense with it in the way he suggests.\" The Prophet (ﷺ) ordered her to send it to such-andsuch \nneedy people. \"","reference":"Sahih al-Bukhari 2613, Book 51, Hadith 46","grade":"","question #":"question #3","question":"What lesson can be learned about charity and helping the needy from this incident involving the Prophet (ﷺ) and Fatima?","id":"bukhari-51-184"},{"hadith-eng":"The Prophet (ﷺ) gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I \ncut it into pieces and distributed it among my wives.\"","reference":"Sahih al-Bukhari 2614, Book 51, Hadith 47","grade":"","question #":"question #3","question":"What is the Islamic perspective on distributing gifts among family members?","id":"bukhari-51-185"},{"hadith-eng":"A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet (ﷺ) used to \nforbid people to wear silk. So, the people were pleased to see it. The Prophet (ﷺ) said, \"By Him in Whose \nHands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" \nAnas added, \"The present was sent to the Prophet (ﷺ) by Ukaidir (a Christian) from Dauma.\"","reference":"Sahih al-Bukhari 2615, 2616, Book 51, Hadith 48","grade":"","question #":"question #3","question":"What significance does the gift from Ukaidir, a Christian, hold in the context of the Prophet's interactions with non-Muslims?","id":"bukhari-51-186"},{"hadith-eng":"A Jewess brought a poisoned (cooked) sheep for the Prophet (ﷺ) who ate from it. She was brought to the \nProphet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the \npoison on the palate of the mouth of Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 2617, Book 51, Hadith 49","grade":"","question #":"question #3","question":"What can be learned about the Prophet Muhammad's (ﷺ) character from his reaction to being poisoned?","id":"bukhari-51-187"},{"hadith-eng":"We were one-hundred and thirty persons accompanying the Prophet (ﷺ) who asked us whether anyone of \nus had food. There was a man who had about a Sa of wheat which was mixed with water then. A very \ntall pagan came driving sheep. The Prophet (ﷺ) asked him, \"Will you sell us (a sheep) or give it as a \npresent?\" He said, \"I will sell you (a sheep).\" The Prophet (ﷺ) bought a sheep and it was slaughtered. The \nProphet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet (ﷺ) gave \nevery person of the one-hundred-and-thirty a piece of that; he gave all those of them who were \npresent; and kept the shares of those who were absent. The Prophet (ﷺ) then put its meat in two huge \nbasins and all of them ate to their fill, and even then more food was left in the two basins which were \ncarried on the camel (or said something like it).","reference":"Sahih al-Bukhari 2618, Book 51, Hadith 50","grade":"","question #":"question #3","question":"How does this event demonstrate the Prophet's (ﷺ) ability to manage resources and ensure everyone is provided for?","id":"bukhari-51-188"},{"hadith-eng":"`Umar saw a silken cloak over a man for sale and requested the Prophet (ﷺ) to buy it in order to wear it on \nFridays and while meeting delegates. The Prophet (ﷺ) said, \"This is worn by the one who will have no \nshare in the Hereafter.\" Later on Allah's Messenger (ﷺ) got some silken cloaks similar to that one, and he \nsent one to `Umar. `Umar said to the Prophet (ﷺ) \"How can I wear it, while you said about it what you \nsaid?\" The Prophet (ﷺ) said, \"I have not given it to you to wear, but to sell or to give to someone else.\" So, \n`Umar sent it to his brother at Mecca before he embraced Islam.","reference":"Sahih al-Bukhari 2619, Book 51, Hadith 51","grade":"","question #":"question #3","question":"What alternatives did the Prophet (ﷺ) suggest for handling items that are not permissible to use personally?","id":"bukhari-51-189"},{"hadith-eng":"My mother came to me during the lifetime of Allah's Messenger (ﷺ) and she was a pagan. I said to Allah's \nApostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from \nme, shall I keep good relations with her?\" The Prophet (ﷺ) said, \"Yes, keep good relation with her. \"","reference":"Sahih al-Bukhari 2620, Book 51, Hadith 52","grade":"","question #":"question #3","question":"What is the significance of showing kindness to parents in Islam, regardless of their faith?","id":"bukhari-51-190"},{"hadith-eng":"The Prophet (ﷺ) said, \"He who takes back his present is like him who swallows his vomit.\"","reference":"Sahih al-Bukhari 2621, Book 51, Hadith 53","grade":"","question #":"question #3","question":"What moral lesson can be derived from the comparison of taking back a gift to swallowing one's vomit?","id":"bukhari-51-191"},{"hadith-eng":"The Prophet (ﷺ) said, \"The bad example is not for us. He who takes back his present is like a dog that \nswallows back its vomit.\"","reference":"Sahih al-Bukhari 2622, Book 51, Hadith 54","grade":"","question #":"question #3","question":"What analogy is used in Islam to describe the act of reclaiming a gift, and what does it signify?","id":"bukhari-51-192"},{"hadith-eng":"I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to \nbuy it from him, thinking that he would sell it cheap. When I asked the Prophet (ﷺ) he said, \"Don't buy it, \neven if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is \nlike a dog that swallows back its vomit.\"","reference":"Sahih al-Bukhari 2623, Book 51, Hadith 55","grade":"","question #":"question #3","question":"What lesson can be learned from the analogy of a dog swallowing its vomit in relation to charity?","id":"bukhari-51-193"},{"hadith-eng":"The sons of Suhaib, (Suhaib, who was the freed slave of Bani\r\nJud'an) claimed that Allah's Messenger (ﷺ) had given two houses and one room to Suhaib. Marwan asked, \"Who will testify to your claim?\" They replied that Ibn 'Umar\r\nwould do so. Marwan sent for Ibn 'Umar who testified that Allah's Messenger (ﷺ) had really given Suhaib two houses and a room. So, Marwan gave the verdict (in favour of Suhaib's sons), because of (Ibn 'Umar's) witness.","reference":"Sahih al-Bukhari 2624, Book 51, Hadith 56","grade":"","question #":"question #3","question":"What role does the testimony of a respected companion play in resolving disputes in Islamic tradition?","id":"bukhari-51-194"},{"hadith-eng":"The Prophet (ﷺ) gave the verdict that `Umra is for the one to whom it is presented.","reference":"Sahih al-Bukhari 2625, Book 51, Hadith 57","grade":"","question #":"question #3","question":"What is the significance of the Prophet's verdict on 'Umra in Islamic jurisprudence?","id":"bukhari-51-195"},{"hadith-eng":"The Prophet (ﷺ) said, \"Umra is permissible.\" Ata said, \"Jabir narrated the same to me from the Prophet.\"","reference":"Sahih al-Bukhari 2626, Book 51, Hadith 58","grade":"","question #":"question #3","question":"What role does the testimony of companions play in the authenticity of hadiths?","id":"bukhari-51-196"},{"hadith-eng":"Once the people of Medina were frightened, so the Prophet (ﷺ) borrowed a horse from Abu Talha called \nAl-Mandub, and rode it. When he came back he said, \"We have not seen anything (to be afraid of), \nbut the horse was very fast (having an energy as inexhaustible as the water of the sea).","reference":"Sahih al-Bukhari 2627, Book 51, Hadith 59","grade":"","question #":"question #3","question":"What qualities of the horse Al-Mandub are highlighted in the narration?","id":"bukhari-51-197"},{"hadith-eng":"I went to `Aisha and she was wearing a coarse dress costing five Dirhams. `Aisha said, \"Look up and \nsee my slave-girl who refuses to wear it in the house though during the lifetime of Allah's Messenger (ﷺ) I \nhad a similar dress which no woman desiring to appear elegant (before her husband) failed to borrow \nfrom me.\"","reference":"Sahih al-Bukhari 2628, Book 51, Hadith 60","grade":"","question #":"question #3","question":"What can be inferred about the social norms and expectations of women's attire in the early Islamic community from this narration?","id":"bukhari-51-198"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"What a good Maniha (the she-camel which has recently given birth and which \ngives profuse milk) is, and (what a good Maniha) (the sheep which gives profuse milk, a bowl in the \nmorning and another in the evening) is!\"Narrated Malik:Maniha is a good deed of charity.","reference":"Sahih al-Bukhari 2629, Book 51, Hadith 61","grade":"","question #":"question #3","question":"What are the benefits of giving a Maniha to others in terms of community welfare?","id":"bukhari-51-199"},{"hadith-eng":"Anas bin Malik said, \"When the emigrants came Medina, they had nothing whereas the Ansar had \nland and property. The Ansar gave them their land on condition that the emigrants would give them \nhalf the yearly yield and work on the land and provide the necessaries for cultivation.\" His (i.e. Anas's \nmother who was also the mother of `Abdullah bin Abu Talha, gave some date-palms to Allah' Apostle \nwho gave them to his freed slave-girl (Um Aiman) who was also the mother of Usama bin Zaid. When \nthe Prophet (ﷺ) finished from the fighting against the people of Khaibar and returned to Medina, the \nemigrants returned to the Ansar the fruit gifts which the Ansar had given them. The Prophet (ﷺ) also \nreturned to Anas's mother the date-palms. Allah's Messenger (ﷺ) gave Um Aiman other trees from his garden \nin lieu of the old gift.","reference":"Sahih al-Bukhari 2630, Book 51, Hadith 62","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) handle the gifts given to him by the Ansar after the battle of Khaibar?","id":"bukhari-51-200"},{"hadith-eng":"That Allah's Messenger (ﷺ) said, \"There are forty virtuous deeds and the best of them is the Maniha of a shegoat, \nand anyone who does one of these virtuous deeds hoping for Allah's reward with firm \nconfidence that he will get it, then Allah will make him enter Paradise because of Hassan (a subnarrator) \nsaid, \"We tried to count those good deeds below the Maniha; we mentioned replying to the \nsneezer, removing harmful things from the road, etc., but we failed to count even fifteen.\"","reference":"Sahih al-Bukhari 2631, Book 51, Hadith 63","grade":"","question #":"question #3","question":"Why might it be challenging to enumerate all virtuous deeds, and what does this imply about the nature of good actions in Islam?","id":"bukhari-51-201"},{"hadith-eng":"Some men had superfluous land and they said that they would give it to others to cultivate on the \ncondition that they would get one-third or one-fourth or one half of its yield. The Prophet (ﷺ) said, \n\"Whoever has land should cultivate it himself or give it to his brother or keep it uncultivated.\"","reference":"Sahih al-Bukhari 2632, Book 51, Hadith 64","grade":"","question #":"question #3","question":"How does this teaching reflect the principles of brotherhood and cooperation in Islam?","id":"bukhari-51-202"},{"hadith-eng":"A bedouin came to the Prophet (ﷺ) and asked him about emigration. The Prophet (ﷺ) \nsaid to him, \"May Allah be merciful to you. The matter of emigration is difficult. Have you got some \ncamels?\" He replied in the affirmative. The Prophet (ﷺ) asked him, \"Do you pay their Zakat?\" He replied \nin the affirmative. He asked, \"Do you lend them so that their milk may be utilized by others?\" The \nbedouin said, \"Yes.\" The Prophet (ﷺ) asked, \"Do you milk them on the day off watering them?\" He \nreplied, \"Yes.\" The Prophet (ﷺ) said, \"Do good deeds beyond the merchants (or the sea) and Allah will \nnever disregard any of your deeds.\" (See Hadith No. 260, Vol. 5)","reference":"Sahih al-Bukhari 2633, Book 51, Hadith 65","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's (ﷺ) interaction with the bedouin regarding emigration and good deeds?","id":"bukhari-51-203"},{"hadith-eng":"That he was told by the most learned one amongst them (i.e. Ibn `Abbas) that the Prophet (ﷺ) went \ntowards some land which was flourishing with vegetation and asked to whom it belonged. He was told \nthat such and such a person took it on rent. The Prophet (ﷺ) said, \"It would have been better (for the \nowner) if he had given it to him gratis rather than charging him a fixed rent.","reference":"Sahih al-Bukhari 2634, Book 51, Hadith 66","grade":"","question #":"question #3","question":"What lessons can be learned about the benefits of giving without expecting anything in return?","id":"bukhari-51-204"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Prophet (ﷺ) Abraham migrated with Sarah. The people (of the town where they \nmigrated) gave her Ajar (i.e. Hajar). Sarah returned and said to Abraham, \"Do you know that Allah \nhas humiliated that pagan and he has given a slave-girl for my service?\"","reference":"Sahih al-Bukhari 2635, Book 51, Hadith 67","grade":"","question #":"question #3","question":"What role did Hajar play in the life of Prophet Abraham and Sarah according to Islamic tradition?","id":"bukhari-51-205"},{"hadith-eng":"Once I gave a horse (for riding) in Allah's Cause. Later I saw it being sold. I asked Allah's Messenger (ﷺ) \n(whether I could buy it). He said, \"Don't buy it, for you should not get back what you have given in \ncharity.\"","reference":"Sahih al-Bukhari 2636, Book 51, Hadith 68","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding transactions involving previously donated items?","id":"bukhari-51-206"}]