[{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not permissible for any Muslim who has something to will to stay for two \nnights without having his last will and testament written and kept ready with him.\"","reference":"Sahih al-Bukhari 2738, Book 55, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of having a written will in Islam?","id":"bukhari-55-1"},{"hadith-eng":"(The brother of the wife of Allah's Messenger (ﷺ). Juwaira bint Al-Harith) When Allah's Messenger (ﷺ) died, he did \nnot leave any Dirham or Dinar (i.e. money), a slave or a slave woman or anything else except his \nwhite mule, his arms and a piece of land which he had given in charity .","reference":"Sahih al-Bukhari 2739, Book 55, Hadith 2","grade":"","question #":"question #1","question":"What does the simplicity of the Prophet Muhammad's (ﷺ) possessions at the time of his death signify about his lifestyle?","id":"bukhari-55-2"},{"hadith-eng":"I asked `Abdullah bin Abu `Aufa \"Did the Prophet (ﷺ) make a will?\" He replied, \"No,\" I asked him, \"How \nis it then that the making of a will has been enjoined on people, (or that they are ordered to make a \nwill)?\" He replied, \"The Prophet (ﷺ) bequeathed Allah's Book (i.e. Qur'an).","reference":"Sahih al-Bukhari 2740, Book 55, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of making a will in Islam?","id":"bukhari-55-3"},{"hadith-eng":"In the presence of `Aisha some people mentioned that the Prophet (ﷺ) had appointed `Ali by will as his \nsuccessor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against \nmy chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and \nI could not even perceive that he had died, so when did he appoint him by will?\"","reference":"Sahih al-Bukhari 2741, Book 55, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of the claim regarding the Prophet's appointment of a successor in Islamic history?","id":"bukhari-55-4"},{"hadith-eng":"The Prophet (ﷺ) came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he \ndisliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah \nbestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Messenger (ﷺ)! May I will all my \nproperty (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One \nthird?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your \ninheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake \nwill be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah \nmay lengthen your age so that some people may benefit by you, and some others be harmed by you.\" \nAt that time Sa`d had only one daughter.","reference":"Sahih al-Bukhari 2742, Book 55, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of leaving wealth for one's inheritors in Islam?","id":"bukhari-55-5"},{"hadith-eng":"I recommend that people reduce the proportion of what they bequeath by will to the fourth (of the \nwhole legacy), for Allah's Messenger (ﷺ) said, \"One-third, yet even one third is too much.\"","reference":"Sahih al-Bukhari 2743, Book 55, Hadith 6","grade":"","question #":"question #1","question":"What is the recommended proportion of a person's estate that can be bequeathed by will according to Islamic teachings?","id":"bukhari-55-6"},{"hadith-eng":"I fell sick and the Prophet (ﷺ) paid me a visit. I said to him, \"O Allah's Messenger (ﷺ)! I invoke Allah that He \nmay not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you \nhealth and let the people benefit by you.\" I said, \"I want to will my property, and I have only one \ndaughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I \nsaid, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator \nadded, \"So the people started to will one third of their property and that was Permitted for them.\")","reference":"Sahih al-Bukhari 2744, Book 55, Hadith 7","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the distribution of wealth in a will, especially when one has limited heirs?","id":"bukhari-55-7"},{"hadith-eng":"(the wife of the Prophet) `Utba bin Abi Waqqas entrusted (his son) to his brother Sa`d bin Abi \nWaqqas saying, \"The son of the slave-girl of Zam`a is my (illegal) son, take him into your custody.\" \nSo during the year of the Conquest (of Mecca) Sa`d took the boy and said, \"This is my brother's son \nwhom my brother entrusted to me.\" 'Abu bin Zam's got up and said, \"He is my brother and the son of \nthe slave girl of my father and was born on my father's bed.\" Then both of them came to Allah's \nApostle and Sa`d said, \"O Allah's Messenger (ﷺ)! This is my brother's son whom my brother entrusted to \nme.\" \nThen 'Abu bin Zam`a got up and said, \"This is my brother and the son of the slave-girl of my father.\" \nAllah's Messenger (ﷺ) said, \"O Abu bin Zam`a! This boy is for you as the boy belongs to the bed (where he \nwas born), and for the adulterer is the stone (i.e. deprivation).\" Then the Prophet (ﷺ) said to his wife \nSauda bint Zam`a, \"Screen yourself from this boy,\" when he saw the boy's resemblance to `Utba. \nSince then the boy did not see Sauda till he died.","reference":"Sahih al-Bukhari 2745, Book 55, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of lineage and paternity in Islamic law as demonstrated in this situation?","id":"bukhari-55-8"},{"hadith-eng":"A Jew crushed the head of a girl between two stones. She was asked, \"Who has done so to you, soand- \nso? So-and-so?\" Till the name of the Jew was mentioned, whereupon she nodded (in agreement). \nSo the Jew was brought and was questioned till he confessed. The Prophet (ﷺ) then ordered that his head \nbe crushed with stones.","reference":"Sahih al-Bukhari 2746, Book 55, Hadith 9","grade":"","question #":"question #1","question":"What is the Islamic legal procedure when a crime is committed and the accused confesses?","id":"bukhari-55-9"},{"hadith-eng":"The custom (in old days) was that the property of the deceased would be inherited by his offspring; as \nfor the parents (of the deceased), they would inherit by the will of the deceased. Then Allah cancelled \nfrom that custom whatever He wished and fixed for the male double the amount inherited by the \nfemale, and for each parent a sixth (of the whole legacy) and for the wife an eighth or a fourth and for \nthe husband a half or a fourth.","reference":"Sahih al-Bukhari 2747, Book 55, Hadith 10","grade":"","question #":"question #1","question":"How did the inheritance laws change from pre-Islamic customs to Islamic regulations?","id":"bukhari-55-10"},{"hadith-eng":"A man asked the Prophet, \"O Allah's Messenger (ﷺ)! What kind of charity is the best?\" He replied. \"To give \nin charity when you are healthy and greedy hoping to be wealthy and afraid of becoming poor. Don't \ndelay giving in charity till the time when you are on the death bed when you say, 'Give so much to soand- \nso and so much to so-and so,' and at that time the property is not yours but it belongs to so-and-so \n(i.e. your inheritors).","reference":"Sahih al-Bukhari 2748, Book 55, Hadith 11","grade":"","question #":"question #1","question":"What is considered the best form of charity according to Islamic teachings?","id":"bukhari-55-11"},{"hadith-eng":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three: Whenever he speaks he tells a lie; whenever he \nis entrusted he proves dishonest; whenever he promises he breaks his promise.\"","reference":"Sahih al-Bukhari 2749, Book 55, Hadith 12","grade":"","question #":"question #1","question":"What are the characteristics that define a hypocrite according to Islamic teachings?","id":"bukhari-55-12"},{"hadith-eng":"Hakim bin Hizam said, \"I asked Allah's Messenger (ﷺ) for something, and he gave me, and I asked him again \nand he gave me and said, 'O Hakim! This wealth is green and sweet (i.e. as tempting as fruits), and \nwhoever takes it without greed then he is blessed in it, and whoever takes it with greediness, he is not \nblessed in it and he is like one who eats and never gets satisfied. \nThe upper (i.e. giving) hand is better than the lower (i.e. taking) hand.\" Hakim added, \"I said, O \nAllah's Messenger (ﷺ)! By Him Who has sent you with the Truth I will never demand anything from \nanybody after you till I die.\" Afterwards Abu Bakr used to call Hakim to give him something but he \nrefused to accept anything from him. Then `Umar called him to give him (something) but he refused. \nThen `Umar said, \"O Muslims! I offered to him (i.e. Hakim) his share which Allah has ordained for \nhim from this booty and he refuses to take it.\" Thus Hakim did not ask anybody for anything after the \nProphet, till he died--may Allah bestow His mercy upon him.","reference":"Sahih al-Bukhari 2750, Book 55, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of taking wealth without greed in Islam?","id":"bukhari-55-13"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"All of you are guardians and responsible for your charges: the Ruler \n(i.e. Imam) is a guardian and responsible for his subjects; and a man is a guardian of his family and is \nresponsible for his charges; and a lady is a guardian in the house of her husband and is responsible for \nher charge; and a servant is a guardian of the property of his master and is responsible for his charge.\" \nI think he also said, \"And a man is a guardian of the property of his father.\"","reference":"Sahih al-Bukhari 2751, Book 55, Hadith 14","grade":"","question #":"question #1","question":"What are the responsibilities of different individuals in their respective roles according to Islamic teachings?","id":"bukhari-55-14"},{"hadith-eng":"The Prophet (ﷺ) said to Abu Talha, \"I recommend that you divide (this garden) amongst your relatives.\" \nAbu Talha said, \"O Allah's Messenger (ﷺ)! I will do the same.\" So Abu Talha divided it among his relatives \nand cousins. \nIbn 'Abbes said, \"When the Qur'anic Verse: \n\"Warn your nearest kinsmen.\" (26.214) \nWas revealed, the Prophet (ﷺ) started calling the various big families of Quraish, \"O Bani Fihr! O Bani \nAdi!\". \nAbu Huraira said, \"When the Verse: \"Warn your nearest kinsmen\" was revealed, the Prophet (ﷺ) said (in a \nloud voice), \"O people of Quraish!\"","reference":"Sahih al-Bukhari 2752, Book 55, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of distributing wealth among relatives in Islam?","id":"bukhari-55-15"},{"hadith-eng":"When Allah revealed the Verse: \"Warn your nearest kinsmen,\" Allah's Messenger (ﷺ) got up and said, \"O \npeople of Quraish (or said similar words)! Buy (i.e. save) yourselves (from the Hellfire) as I cannot \nsave you from Allah's Punishment; O Bani `Abd Manaf! I cannot save you from Allah's Punishment, \nO Safiya, the Aunt of Allah's Messenger (ﷺ)! I cannot save you from Allah's Punishment; O Fatima bint \nMuhammad! Ask me anything from my wealth, but I cannot save you from Allah's Punishment.\"","reference":"Sahih al-Bukhari 2753, Book 55, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of personal responsibility in seeking salvation according to Islamic teachings?","id":"bukhari-55-16"},{"hadith-eng":"The Prophet (ﷺ) saw a man driving a Badana (i.e. camel for sacrifice) and said to him, \"Ride on it.\" The \nman said, \"O Allah's Messenger (ﷺ)! It is a Bandana.\" (The Prophet (ﷺ) repeated his order) and on the third or \nfourth time he said, \"Ride it, (woe to you\" or said: \"May Allah be merciful to you).","reference":"Sahih al-Bukhari 2754, Book 55, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of using sacrificial animals for riding according to Islamic teachings?","id":"bukhari-55-17"},{"hadith-eng":"Allah's Messenger (ﷺ) saw a man driving a Badana and said to him, \"Ride on it,\" and on the second or the \nthird time he added, \"Woe to you.\"","reference":"Sahih al-Bukhari 2755, Book 55, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of the Prophet's advice regarding riding an animal intended for sacrifice?","id":"bukhari-55-18"},{"hadith-eng":"The mother of Sa`d bin 'Ubada died in his absence. He said, \"O Allah's Messenger (ﷺ)! My mother died in \nmy absence; will it be of any benefit for her if I give Sadaqa on her behalf?\" The Prophet (ﷺ) said, \"Yes,\" \nSa`d said, \"I make you a witness that I gave my garden called Al Makhraf in charity on her behalf.\"","reference":"Sahih al-Bukhari 2756, Book 55, Hadith 19","grade":"","question #":"question #1","question":"Can giving charity on behalf of a deceased person benefit them in the hereafter?","id":"bukhari-55-19"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! For the acceptance of my repentance I wish to give all my property in \ncharity for Allah's sake through His Apostle .\" He said, \"It is better for you to keep some of the \nproperty for yourself.\" I said, \"Then I will keep my share in Khaibar.\"","reference":"Sahih al-Bukhari 2757, Book 55, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of balancing personal wealth and charitable giving in Islam?","id":"bukhari-55-20"},{"hadith-eng":"When the Holy Verse: 'By no means shall you attain Al-Birr (piety, righteousness, it means here Allah's Reward i.e., Paradise), unless you spend of that which you love..', (V 3:92) was revealed, Abu Talha went to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger ! Allah, the Blessed, the Superior stated in His book: 'By no means shall you attain Birr, unless you spend of that which you love....' (V 3:92) and the most beloved property to me is Bairuha' (which was a garden where Allah's Messenger (ﷺ) used to go to sit in its shade and drink from its water). I gave it to the Allah and His Messenger (ﷺ) hoping for Allah's Reward in the Hereafter. So, Ao Allah's Messenger ! Use it as Allah orders you to use it.\" Allah's Messenger (ﷺ) said, \"Bravo! O Abu Talha, it is fruitful property. We have accepted it from you and now we return it to you. Distribute it amongst you relatives.\" So, Abu Talha distributed it amongst his relatives, amongst whom were Ubai and Hassan. When Hassan sold his share of that garden to Mu'awiyya, he was asked, \"How do you see Abu Talha's Sadaqa?\" He replied, \"Who should not I sell a Sa' of date for Sa' of money ?\" The garden was situated on the courtyard of the palace of Bani Jadila built by Mu'awiya.","reference":"Sahih al-Bukhari 2758, Book 55, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of giving away beloved possessions in the pursuit of piety and righteousness?","id":"bukhari-55-21"},{"hadith-eng":"Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the \npeople have stopped acting on it. There are two kinds of guardians (who are in charge of the \ninheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, \nthe orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the \norphans): such a person should speak kindly and say (to those who are present at the time of \ndistribution), \"I can not give it to you (as the wealth belongs to the orphans).","reference":"Sahih al-Bukhari 2759, Book 55, Hadith 22","grade":"","question #":"question #1","question":"What are the responsibilities of a guardian in charge of inheritance according to Islamic teachings?","id":"bukhari-55-22"},{"hadith-eng":"A man said to the Prophet, \"My mother died suddenly, and I think that if she could speak, she would \nhave given in charity. May I give in charity on her behalf?\" He said, \"Yes! Give in charity on her \nbehalf.\"","reference":"Sahih al-Bukhari 2760, Book 55, Hadith 23","grade":"","question #":"question #1","question":"Is it permissible to give charity on behalf of a deceased person in Islam?","id":"bukhari-55-23"},{"hadith-eng":"Sa`d bin Ubada consulted Allah's Messenger (ﷺ) saying, \"My mother died and she had an unfulfilled vow.\" \nThe Prophet (ﷺ) said, \"Fulfill it on her behalf.\"","reference":"Sahih al-Bukhari 2761, Book 55, Hadith 24","grade":"","question #":"question #1","question":"What should one do if a deceased family member had an unfulfilled vow?","id":"bukhari-55-24"},{"hadith-eng":"That the mother of Sa`d bin Ubada the brother of Bani Saida died in Sa`d's absence, so he came to the \nProphet saying, \"O Allah's Messenger (ﷺ)! My mother died in my absence, will it benefit her if I give in \ncharity on her behalf?\" The Prophet (ﷺ) said, \"Yes.\" Sa`d said, \"I take you as my witness that I give my \ngarden Al-Makhraf in charity on her behalf.\"","reference":"Sahih al-Bukhari 2762, Book 55, Hadith 25","grade":"","question #":"question #1","question":"Can charity given on behalf of a deceased person benefit them in the hereafter?","id":"bukhari-55-25"},{"hadith-eng":"`Urwa bin Az-Zubair said that he asked `Aisha about the meaning of the Qur'anic Verse:-- \n\"And if you fear that you will not deal fairly with the orphan girls then marry (other) women of your \nchoice.\" (4.2-3) \nAisha said, \"It is about a female orphan under the guardianship of her guardian who is inclined \ntowards her because of her beauty and wealth, and likes to marry her with a Mahr less than what is \ngiven to women of her standard. So they (i.e. guardians) were forbidden to marry the orphans unless \nthey paid them a full appropriate Mahr (otherwise) they were ordered to marry other women instead of \nthem. Later on the people asked Allah's Messenger (ﷺ) about it. So Allah revealed the following Verse:-- \n\"They ask your instruction (O Muhammad!) regarding women. Say: Allah instructs you regarding \nthem...\" (4.127) \nand in this Verse Allah indicated that if the orphan girl was beautiful and wealthy, her guardian would \nhave the desire to marry her without giving her an appropriate Mahr equal to what her peers could get, \nbut if she was undesirable for lack of beauty or wealth, then he would not marry her, but seek to marry \nsome other woman instead of her. So, since he did not marry her when he had no inclination towards \nher, he had not the right to marry her when he had an interest in her, unless he treated her justly by \ngiving her a full Mahr and securing all her rights.","reference":"Sahih al-Bukhari 2763, Book 55, Hadith 26","grade":"","question #":"question #1","question":"What are the conditions under which a guardian is allowed to marry an orphan girl under his care?","id":"bukhari-55-26"},{"hadith-eng":"In the lifetime of Allah's Messenger (ﷺ) , `Umar gave in charity some of his property, a garden of date-palms \ncalled Thamgh. `Umar said, \"O Allah's Messenger (ﷺ)! I have some property which I prize highly and I want \nto give it in charity.\" The Prophet; said, \"Give it in charity (i.e. as an endowment) with its land and \ntrees on the condition that the land and trees will neither be sold nor given as a present, nor \nbequeathed, but the fruits are to be spent in charity.\" So `Umar gave it in charity, and it was for \nAllah's Cause, the emancipation of slaves, for the poor, for guests, for travelers, and for kinsmen. The \nperson acting as its administrator could eat from it reasonably and fairly, and could let a friend of his \neat from it provided he had no intention of becoming wealthy by its means.","reference":"Sahih al-Bukhari 2764, Book 55, Hadith 27","grade":"","question #":"question #1","question":"What are the guidelines for giving property in charity as an endowment in Islam?","id":"bukhari-55-27"},{"hadith-eng":"The following Verse:-- \n\"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for \nhimself what is just and reasonable.\" (4.6) \nwas revealed in connection with the guardian of an orphan, and it means that if he is poor he can have \nfor himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of \nthe inheritance.","reference":"Sahih al-Bukhari 2765, Book 55, Hadith 28","grade":"","question #":"question #1","question":"What guidelines are provided for a guardian managing the wealth of an orphan?","id":"bukhari-55-28"},{"hadith-eng":"The Prophet (ﷺ) said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Messenger (ﷺ)! \nWhat are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the \nlife which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba \n(usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the \ntime of fighting, and to accuse, chaste women, who never even think of anything touching chastity \nand are good believers.","reference":"Sahih al-Bukhari 2766, Book 55, Hadith 29","grade":"","question #":"question #1","question":"What are the seven great destructive sins in Islam that should be avoided?","id":"bukhari-55-29"},{"hadith-eng":"\"Ibn 'Umar never refused to be appointed as guardian.\" The most beloved thing to Ibn Sirin concerning an orphan's wealth was that the orphan's advisor and guardians would assemble to decide what is best for him. When Tawus was asked about something concerning an orphan's affairs, he would recite: '...And Allah knows him who means mischief from him who means good...' (V 2:220). 'Ata said concerning some orphans, \"The guardian is to provide for the young and the old orphans according to their needs from their shares.\"","reference":"Sahih al-Bukhari 2767, Book 55, Hadith 30","grade":"","question #":"question #1","question":"What responsibilities do guardians have towards orphans in terms of managing their wealth and well-being?","id":"bukhari-55-30"},{"hadith-eng":"When Allah's Messenger (ﷺ) came to Medina; he did not have any servant. Abu Talha (Anas' step-father) \ntook me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Anas is a wise boy, so let him serve you.\" \nSo, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I \nrefrained from doing anything, he never asked me why I refrained from doing it.","reference":"Sahih al-Bukhari 2768, Book 55, Hadith 31","grade":"","question #":"question #1","question":"What qualities did Anas possess that made him suitable to serve the Prophet Muhammad (ﷺ)?","id":"bukhari-55-31"},{"hadith-eng":"Abu Talha had the greatest wealth of date-palms amongst the Ansar in Medina, and he prized above \nall his wealth (his garden) Bairuha', which was situated opposite the Mosque (of the Prophet (ﷺ) ). The \nProphet used to enter It and drink from its fresh water. When the following Divine Verse came:-- \n\"By no means shall you attain piety until you spend of what you love,\" (3.92) \nAbu Talha got up saying. \"O Allah's Messenger (ﷺ)! Allah says, 'You will not attain piety until you spend of \nwhat you love,' and I prize above al I my wealth, Bairuha' which I want to give in charity for Allah's \nSake, hoping for its reward from Allah. So you can use it as Allah directs you.\" On that the Prophet (ﷺ) \nsaid, \"Bravo! It is a profitable (or perishable) property. (Ibn Maslama is not sure as to which word is \nright, i.e. profitable or perishable.) I have heard what you have said, and I recommend that you \ndistribute this amongst your relatives.\" On that Abu Talha said, \"O Allah's Messenger (ﷺ)! I will do (as you \nhave suggested).\" So, Abu Talha distributed that garden amongst his relatives and cousins.","reference":"Sahih al-Bukhari 2769, Book 55, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of giving charity from one's most valued possessions in Islam?","id":"bukhari-55-32"},{"hadith-eng":"A man said to Allah's Messenger (ﷺ) , \"My mother died, will it benefit her if I give in charity on her behalf?\" \nThe Prophet (ﷺ) replied in the affirmative. The man said, \"I have a garden and I make you a witness that I \ngive it in charity on her behalf.\"","reference":"Sahih al-Bukhari 2770, Book 55, Hadith 33","grade":"","question #":"question #1","question":"Can giving charity on behalf of a deceased person benefit them in the hereafter?","id":"bukhari-55-33"},{"hadith-eng":"When the Prophet (ﷺ) ordered that the mosque be built, he said, \"O Bani An-Najjar! Suggest to me a price \nfor this garden of yours.\" They replied, \"By Allah! We will demand its price from none but Allah.\"","reference":"Sahih al-Bukhari 2771, Book 55, Hadith 34","grade":"","question #":"question #1","question":"What does this narration teach about the attitude of the companions towards material compensation for religious purposes?","id":"bukhari-55-34"},{"hadith-eng":"When `Umar got a piece of land in Khaibar, he came to the Prophet (ﷺ) saying, \"I have got a piece of \nland, better than which I have never got. So what do you advise me regarding it?\" The Prophet (ﷺ) said, \n\"If you wish you can keep it as an endowment to be used for charitable purposes.\" So, `Umar gave the \nland in charity (i.e. as an endowments on the condition that the land would neither be sold nor given \nas a present, nor bequeathed, (and its yield) would be used for the poor, the kinsmen, the emancipation \nof slaves, Jihad, and for guests and travelers; and its administrator could eat in a reasonable just \nmanner, and he also could feed his friends without intending to be wealthy by its means.\"","reference":"Sahih al-Bukhari 2772, Book 55, Hadith 35","grade":"","question #":"question #1","question":"What is the concept of endowment in Islam and how can it be used for charitable purposes?","id":"bukhari-55-35"},{"hadith-eng":"`Umar got some property in Khaibar and he came to the Prophet (ﷺ) and informed him about it. The \nProphet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an \nendowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and \nthe guests.","reference":"Sahih al-Bukhari 2773, Book 55, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of giving property as charity in Islam?","id":"bukhari-55-36"},{"hadith-eng":"When Allah's Messenger (ﷺ) came to Medina, he ordered that a mosque be built. He said, \"O Bani An- \nNajjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price \nexcept from Allah.\"","reference":"Sahih al-Bukhari 2774, Book 55, Hadith 37","grade":"","question #":"question #1","question":"What was the significance of building a mosque upon the arrival of the Prophet in Medina?","id":"bukhari-55-37"},{"hadith-eng":"Once `Umar gave a horse in charity to be used in holy fighting. It had been given to him by Allah's \nApostle . `Umar gave it to another man to ride. Then `Umar was informed that the man put the horse \nfor sale, so he asked Allah's Messenger (ﷺ) whether he could buy it. Allah's Messenger (ﷺ) replied, \"You should not \nbuy it, for you should not take back what you have given in charity.\"","reference":"Sahih al-Bukhari 2775, Book 55, Hadith 38","grade":"","question #":"question #1","question":"What is the ruling on taking back something that has been given in charity?","id":"bukhari-55-38"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"My heirs will not inherit a Dinar or a Dirham (i.e. money), for whatever I leave \n(excluding the adequate support of my wives and the wages of my employees) is given in charity.\"","reference":"Sahih al-Bukhari 2776, Book 55, Hadith 39","grade":"","question #":"question #1","question":"What is the significance of the Prophet's decision regarding the inheritance of his wealth?","id":"bukhari-55-39"},{"hadith-eng":"When `Umar founded an endowment he stipulated that its administrator could eat from it and also \nfeed his friend on the condition that he would not store anything for himself from it.","reference":"Sahih al-Bukhari 2777, Book 55, Hadith 40","grade":"","question #":"question #1","question":"What guidelines did Umar set for the administration of an endowment?","id":"bukhari-55-40"},{"hadith-eng":"When 'Uthman (ra) was circled (by the rebels), he looked upon them from above and said, \"Ias you by Allah, I ask nobody but the Companions of the Prophet (ﷺ), dont you know that Allah's Messenger (ﷺ) said, 'Whoever  will (buy and) dig the well of Ruma will be granted Paradise,' and I (bought and) dug it? Don't you know that he said. 'Whoever equip the army of 'Usra (i.e., Tabuk's Ghazwa) will be granted Paradise,' and I equipped it ?\" They attested whatever he said.\nWhen 'Umar founded his endowment he said, \"Its administrator can eat from it.\" The management of the endowment can be taken over by the founder himself or any other person, for both cases are permissible.","reference":"Sahih al-Bukhari 2778, Book 55, Hadith 41","grade":"","question #":"question #1","question":"What actions did 'Uthman take that were promised Paradise by the Prophet Muhammad (ﷺ)?","id":"bukhari-55-41"},{"hadith-eng":"The Prophet (ﷺ) said (at the time of building the Mosque), \"O Ban, An-Najjar! Suggest to me a price for \nyour garden.\" They replied, \"We do not ask its price except from Allah.\"","reference":"Sahih al-Bukhari 2779, Book 55, Hadith 42","grade":"","question #":"question #1","question":"What does this narration teach about the attitude of selflessness and generosity in Islam?","id":"bukhari-55-42"},{"hadith-eng":"Ibn 'Abbas (ra) said, \"A man from the tribe of Bani Sahm went out in the company of Tamim Ad-Dari and 'Adi bin Badda'. The man of Bani Sahm died in a land where there was no Muslim. When Tamim and 'Adi returned conveying the property of the deceased, they claimed that they had lost a silver bowl with gold engraving. Allah's Messenger (ﷺ) made them take an oath (to confirm their claim), and then the bowl was found in Makkah with some people who claimed that they had bought it from Tamim and 'Adu, Then two witnesses from the relatives of the deceased got up and swore that their witnesses were more valid than the witnesses of  'Adi and Tamim, and that the bowl belonged to their deceased fellow. So, this verse was revealed in connection with this case ; 'O you who believe! When death approached any of you ...',\" (V 5:106)","reference":"Sahih al-Bukhari 2780, Book 55, Hadith 43","grade":"","question #":"question #1","question":"What is the significance of taking oaths in resolving disputes according to Islamic teachings?","id":"bukhari-55-43"},{"hadith-eng":"My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to \nbe paid. When the time of plucking the date-fruits came, I went to Allah's Messenger (ﷺ) and said, \"O Allah's \nApostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that \nthe creditors would see you.\" The Prophet (ﷺ) said, \"Go and collect the various kinds of dates and place \nthem separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started \nclaiming their rights pressingly at that time. When the Prophet (ﷺ) saw how they behaved, he went round \nthe biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" \nThen he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would \nhave pleased me that Allah would clear the debts of my father even though I had not taken a single \ndate to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap \nwhere Allah's Messenger (ﷺ) was sitting and noticed as if not a single date had been taken thereof.","reference":"Sahih al-Bukhari 2781, Book 55, Hadith 44","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) assist in resolving debts after the Battle of Uhud?","id":"bukhari-55-44"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not permissible for any Muslim who has something to will to stay for two \nnights without having his last will and testament written and kept ready with him.\"","reference":"Sahih al-Bukhari 2738, Book 55, Hadith 1","grade":"","question #":"question #2","question":"Why is it important for a Muslim to keep their last will and testament ready?","id":"bukhari-55-45"},{"hadith-eng":"(The brother of the wife of Allah's Messenger (ﷺ). Juwaira bint Al-Harith) When Allah's Messenger (ﷺ) died, he did \nnot leave any Dirham or Dinar (i.e. money), a slave or a slave woman or anything else except his \nwhite mule, his arms and a piece of land which he had given in charity .","reference":"Sahih al-Bukhari 2739, Book 55, Hadith 2","grade":"","question #":"question #2","question":"How does the distribution of the Prophet's (ﷺ) possessions reflect his teachings on charity and wealth?","id":"bukhari-55-46"},{"hadith-eng":"I asked `Abdullah bin Abu `Aufa \"Did the Prophet (ﷺ) make a will?\" He replied, \"No,\" I asked him, \"How \nis it then that the making of a will has been enjoined on people, (or that they are ordered to make a \nwill)?\" He replied, \"The Prophet (ﷺ) bequeathed Allah's Book (i.e. Qur'an).","reference":"Sahih al-Bukhari 2740, Book 55, Hadith 3","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) guide Muslims regarding the making of a will?","id":"bukhari-55-47"},{"hadith-eng":"In the presence of `Aisha some people mentioned that the Prophet (ﷺ) had appointed `Ali by will as his \nsuccessor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against \nmy chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and \nI could not even perceive that he had died, so when did he appoint him by will?\"","reference":"Sahih al-Bukhari 2741, Book 55, Hadith 4","grade":"","question #":"question #2","question":"How does the testimony of Aisha contribute to the understanding of events surrounding the Prophet's final moments?","id":"bukhari-55-48"},{"hadith-eng":"The Prophet (ﷺ) came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he \ndisliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah \nbestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Messenger (ﷺ)! May I will all my \nproperty (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One \nthird?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your \ninheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake \nwill be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah \nmay lengthen your age so that some people may benefit by you, and some others be harmed by you.\" \nAt that time Sa`d had only one daughter.","reference":"Sahih al-Bukhari 2742, Book 55, Hadith 5","grade":"","question #":"question #2","question":"How does Islam view the act of giving charity in relation to one's family?","id":"bukhari-55-49"},{"hadith-eng":"I recommend that people reduce the proportion of what they bequeath by will to the fourth (of the \nwhole legacy), for Allah's Messenger (ﷺ) said, \"One-third, yet even one third is too much.\"","reference":"Sahih al-Bukhari 2743, Book 55, Hadith 6","grade":"","question #":"question #2","question":"Why is it advised to limit the bequest to one-third of the estate in Islamic inheritance laws?","id":"bukhari-55-50"},{"hadith-eng":"I fell sick and the Prophet (ﷺ) paid me a visit. I said to him, \"O Allah's Messenger (ﷺ)! I invoke Allah that He \nmay not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you \nhealth and let the people benefit by you.\" I said, \"I want to will my property, and I have only one \ndaughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I \nsaid, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator \nadded, \"So the people started to will one third of their property and that was Permitted for them.\")","reference":"Sahih al-Bukhari 2744, Book 55, Hadith 7","grade":"","question #":"question #2","question":"How does Islam view the act of making a will and what are the recommended limits for bequeathing property?","id":"bukhari-55-51"},{"hadith-eng":"(the wife of the Prophet) `Utba bin Abi Waqqas entrusted (his son) to his brother Sa`d bin Abi \nWaqqas saying, \"The son of the slave-girl of Zam`a is my (illegal) son, take him into your custody.\" \nSo during the year of the Conquest (of Mecca) Sa`d took the boy and said, \"This is my brother's son \nwhom my brother entrusted to me.\" 'Abu bin Zam's got up and said, \"He is my brother and the son of \nthe slave girl of my father and was born on my father's bed.\" Then both of them came to Allah's \nApostle and Sa`d said, \"O Allah's Messenger (ﷺ)! This is my brother's son whom my brother entrusted to \nme.\" \nThen 'Abu bin Zam`a got up and said, \"This is my brother and the son of the slave-girl of my father.\" \nAllah's Messenger (ﷺ) said, \"O Abu bin Zam`a! This boy is for you as the boy belongs to the bed (where he \nwas born), and for the adulterer is the stone (i.e. deprivation).\" Then the Prophet (ﷺ) said to his wife \nSauda bint Zam`a, \"Screen yourself from this boy,\" when he saw the boy's resemblance to `Utba. \nSince then the boy did not see Sauda till he died.","reference":"Sahih al-Bukhari 2745, Book 55, Hadith 8","grade":"","question #":"question #2","question":"How does Islamic jurisprudence address disputes regarding the paternity of a child?","id":"bukhari-55-52"},{"hadith-eng":"A Jew crushed the head of a girl between two stones. She was asked, \"Who has done so to you, soand- \nso? So-and-so?\" Till the name of the Jew was mentioned, whereupon she nodded (in agreement). \nSo the Jew was brought and was questioned till he confessed. The Prophet (ﷺ) then ordered that his head \nbe crushed with stones.","reference":"Sahih al-Bukhari 2746, Book 55, Hadith 9","grade":"","question #":"question #2","question":"How does Islamic law address the issue of justice for victims of violent crimes?","id":"bukhari-55-53"},{"hadith-eng":"The custom (in old days) was that the property of the deceased would be inherited by his offspring; as \nfor the parents (of the deceased), they would inherit by the will of the deceased. Then Allah cancelled \nfrom that custom whatever He wished and fixed for the male double the amount inherited by the \nfemale, and for each parent a sixth (of the whole legacy) and for the wife an eighth or a fourth and for \nthe husband a half or a fourth.","reference":"Sahih al-Bukhari 2747, Book 55, Hadith 10","grade":"","question #":"question #2","question":"What are the specific inheritance shares allocated to parents, spouses, and children in Islamic law?","id":"bukhari-55-54"},{"hadith-eng":"A man asked the Prophet, \"O Allah's Messenger (ﷺ)! What kind of charity is the best?\" He replied. \"To give \nin charity when you are healthy and greedy hoping to be wealthy and afraid of becoming poor. Don't \ndelay giving in charity till the time when you are on the death bed when you say, 'Give so much to soand- \nso and so much to so-and so,' and at that time the property is not yours but it belongs to so-and-so \n(i.e. your inheritors).","reference":"Sahih al-Bukhari 2748, Book 55, Hadith 11","grade":"","question #":"question #2","question":"Why is it important to give charity while one is healthy and not delay it until the end of life?","id":"bukhari-55-55"},{"hadith-eng":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three: Whenever he speaks he tells a lie; whenever he \nis entrusted he proves dishonest; whenever he promises he breaks his promise.\"","reference":"Sahih al-Bukhari 2749, Book 55, Hadith 12","grade":"","question #":"question #2","question":"How is honesty related to trustworthiness in Islamic ethics?","id":"bukhari-55-56"},{"hadith-eng":"Hakim bin Hizam said, \"I asked Allah's Messenger (ﷺ) for something, and he gave me, and I asked him again \nand he gave me and said, 'O Hakim! This wealth is green and sweet (i.e. as tempting as fruits), and \nwhoever takes it without greed then he is blessed in it, and whoever takes it with greediness, he is not \nblessed in it and he is like one who eats and never gets satisfied. \nThe upper (i.e. giving) hand is better than the lower (i.e. taking) hand.\" Hakim added, \"I said, O \nAllah's Messenger (ﷺ)! By Him Who has sent you with the Truth I will never demand anything from \nanybody after you till I die.\" Afterwards Abu Bakr used to call Hakim to give him something but he \nrefused to accept anything from him. Then `Umar called him to give him (something) but he refused. \nThen `Umar said, \"O Muslims! I offered to him (i.e. Hakim) his share which Allah has ordained for \nhim from this booty and he refuses to take it.\" Thus Hakim did not ask anybody for anything after the \nProphet, till he died--may Allah bestow His mercy upon him.","reference":"Sahih al-Bukhari 2750, Book 55, Hadith 13","grade":"","question #":"question #2","question":"How does the concept of the 'upper hand' being better than the 'lower hand' relate to generosity and self-sufficiency?","id":"bukhari-55-57"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"All of you are guardians and responsible for your charges: the Ruler \n(i.e. Imam) is a guardian and responsible for his subjects; and a man is a guardian of his family and is \nresponsible for his charges; and a lady is a guardian in the house of her husband and is responsible for \nher charge; and a servant is a guardian of the property of his master and is responsible for his charge.\" \nI think he also said, \"And a man is a guardian of the property of his father.\"","reference":"Sahih al-Bukhari 2751, Book 55, Hadith 14","grade":"","question #":"question #2","question":"How does Islam emphasize the concept of guardianship and accountability in various aspects of life?","id":"bukhari-55-58"},{"hadith-eng":"The Prophet (ﷺ) said to Abu Talha, \"I recommend that you divide (this garden) amongst your relatives.\" \nAbu Talha said, \"O Allah's Messenger (ﷺ)! I will do the same.\" So Abu Talha divided it among his relatives \nand cousins. \nIbn 'Abbes said, \"When the Qur'anic Verse: \n\"Warn your nearest kinsmen.\" (26.214) \nWas revealed, the Prophet (ﷺ) started calling the various big families of Quraish, \"O Bani Fihr! O Bani \nAdi!\". \nAbu Huraira said, \"When the Verse: \"Warn your nearest kinsmen\" was revealed, the Prophet (ﷺ) said (in a \nloud voice), \"O people of Quraish!\"","reference":"Sahih al-Bukhari 2752, Book 55, Hadith 15","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the revelation of the verse about warning one's nearest kinsmen?","id":"bukhari-55-59"},{"hadith-eng":"When Allah revealed the Verse: \"Warn your nearest kinsmen,\" Allah's Messenger (ﷺ) got up and said, \"O \npeople of Quraish (or said similar words)! Buy (i.e. save) yourselves (from the Hellfire) as I cannot \nsave you from Allah's Punishment; O Bani `Abd Manaf! I cannot save you from Allah's Punishment, \nO Safiya, the Aunt of Allah's Messenger (ﷺ)! I cannot save you from Allah's Punishment; O Fatima bint \nMuhammad! Ask me anything from my wealth, but I cannot save you from Allah's Punishment.\"","reference":"Sahih al-Bukhari 2753, Book 55, Hadith 16","grade":"","question #":"question #2","question":"How does the concept of individual accountability manifest in the context of family and kinship in Islam?","id":"bukhari-55-60"},{"hadith-eng":"The Prophet (ﷺ) saw a man driving a Badana (i.e. camel for sacrifice) and said to him, \"Ride on it.\" The \nman said, \"O Allah's Messenger (ﷺ)! It is a Bandana.\" (The Prophet (ﷺ) repeated his order) and on the third or \nfourth time he said, \"Ride it, (woe to you\" or said: \"May Allah be merciful to you).","reference":"Sahih al-Bukhari 2754, Book 55, Hadith 17","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate compassion and practicality in his instructions regarding sacrificial animals?","id":"bukhari-55-61"},{"hadith-eng":"Allah's Messenger (ﷺ) saw a man driving a Badana and said to him, \"Ride on it,\" and on the second or the \nthird time he added, \"Woe to you.\"","reference":"Sahih al-Bukhari 2755, Book 55, Hadith 18","grade":"","question #":"question #2","question":"How does the Prophet's interaction with the man reflect on the treatment of animals in Islam?","id":"bukhari-55-62"},{"hadith-eng":"The mother of Sa`d bin 'Ubada died in his absence. He said, \"O Allah's Messenger (ﷺ)! My mother died in \nmy absence; will it be of any benefit for her if I give Sadaqa on her behalf?\" The Prophet (ﷺ) said, \"Yes,\" \nSa`d said, \"I make you a witness that I gave my garden called Al Makhraf in charity on her behalf.\"","reference":"Sahih al-Bukhari 2756, Book 55, Hadith 19","grade":"","question #":"question #2","question":"What actions can be taken to honor and benefit deceased family members in Islam?","id":"bukhari-55-63"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! For the acceptance of my repentance I wish to give all my property in \ncharity for Allah's sake through His Apostle .\" He said, \"It is better for you to keep some of the \nproperty for yourself.\" I said, \"Then I will keep my share in Khaibar.\"","reference":"Sahih al-Bukhari 2757, Book 55, Hadith 20","grade":"","question #":"question #2","question":"How does Islam view the act of repentance and its connection to charity?","id":"bukhari-55-64"},{"hadith-eng":"When the Holy Verse: 'By no means shall you attain Al-Birr (piety, righteousness, it means here Allah's Reward i.e., Paradise), unless you spend of that which you love..', (V 3:92) was revealed, Abu Talha went to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger ! Allah, the Blessed, the Superior stated in His book: 'By no means shall you attain Birr, unless you spend of that which you love....' (V 3:92) and the most beloved property to me is Bairuha' (which was a garden where Allah's Messenger (ﷺ) used to go to sit in its shade and drink from its water). I gave it to the Allah and His Messenger (ﷺ) hoping for Allah's Reward in the Hereafter. So, Ao Allah's Messenger ! Use it as Allah orders you to use it.\" Allah's Messenger (ﷺ) said, \"Bravo! O Abu Talha, it is fruitful property. We have accepted it from you and now we return it to you. Distribute it amongst you relatives.\" So, Abu Talha distributed it amongst his relatives, amongst whom were Ubai and Hassan. When Hassan sold his share of that garden to Mu'awiyya, he was asked, \"How do you see Abu Talha's Sadaqa?\" He replied, \"Who should not I sell a Sa' of date for Sa' of money ?\" The garden was situated on the courtyard of the palace of Bani Jadila built by Mu'awiya.","reference":"Sahih al-Bukhari 2758, Book 55, Hadith 21","grade":"","question #":"question #2","question":"How did Abu Talha demonstrate his commitment to Allah's teachings through his actions?","id":"bukhari-55-65"},{"hadith-eng":"Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the \npeople have stopped acting on it. There are two kinds of guardians (who are in charge of the \ninheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, \nthe orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the \norphans): such a person should speak kindly and say (to those who are present at the time of \ndistribution), \"I can not give it to you (as the wealth belongs to the orphans).","reference":"Sahih al-Bukhari 2759, Book 55, Hadith 22","grade":"","question #":"question #2","question":"How should a guardian who does not inherit handle the distribution of wealth to orphans and relatives?","id":"bukhari-55-66"},{"hadith-eng":"A man said to the Prophet, \"My mother died suddenly, and I think that if she could speak, she would \nhave given in charity. May I give in charity on her behalf?\" He said, \"Yes! Give in charity on her \nbehalf.\"","reference":"Sahih al-Bukhari 2760, Book 55, Hadith 23","grade":"","question #":"question #2","question":"What actions can be taken to benefit a deceased relative according to Islamic teachings?","id":"bukhari-55-67"},{"hadith-eng":"Sa`d bin Ubada consulted Allah's Messenger (ﷺ) saying, \"My mother died and she had an unfulfilled vow.\" \nThe Prophet (ﷺ) said, \"Fulfill it on her behalf.\"","reference":"Sahih al-Bukhari 2761, Book 55, Hadith 24","grade":"","question #":"question #2","question":"How can fulfilling vows on behalf of deceased relatives be significant in Islam?","id":"bukhari-55-68"},{"hadith-eng":"That the mother of Sa`d bin Ubada the brother of Bani Saida died in Sa`d's absence, so he came to the \nProphet saying, \"O Allah's Messenger (ﷺ)! My mother died in my absence, will it benefit her if I give in \ncharity on her behalf?\" The Prophet (ﷺ) said, \"Yes.\" Sa`d said, \"I take you as my witness that I give my \ngarden Al-Makhraf in charity on her behalf.\"","reference":"Sahih al-Bukhari 2762, Book 55, Hadith 25","grade":"","question #":"question #2","question":"What actions can be taken to benefit a deceased relative in Islam?","id":"bukhari-55-69"},{"hadith-eng":"`Urwa bin Az-Zubair said that he asked `Aisha about the meaning of the Qur'anic Verse:-- \n\"And if you fear that you will not deal fairly with the orphan girls then marry (other) women of your \nchoice.\" (4.2-3) \nAisha said, \"It is about a female orphan under the guardianship of her guardian who is inclined \ntowards her because of her beauty and wealth, and likes to marry her with a Mahr less than what is \ngiven to women of her standard. So they (i.e. guardians) were forbidden to marry the orphans unless \nthey paid them a full appropriate Mahr (otherwise) they were ordered to marry other women instead of \nthem. Later on the people asked Allah's Messenger (ﷺ) about it. So Allah revealed the following Verse:-- \n\"They ask your instruction (O Muhammad!) regarding women. Say: Allah instructs you regarding \nthem...\" (4.127) \nand in this Verse Allah indicated that if the orphan girl was beautiful and wealthy, her guardian would \nhave the desire to marry her without giving her an appropriate Mahr equal to what her peers could get, \nbut if she was undesirable for lack of beauty or wealth, then he would not marry her, but seek to marry \nsome other woman instead of her. So, since he did not marry her when he had no inclination towards \nher, he had not the right to marry her when he had an interest in her, unless he treated her justly by \ngiving her a full Mahr and securing all her rights.","reference":"Sahih al-Bukhari 2763, Book 55, Hadith 26","grade":"","question #":"question #2","question":"How does the Quran address the issue of fairness in marriage to orphan girls?","id":"bukhari-55-70"},{"hadith-eng":"In the lifetime of Allah's Messenger (ﷺ) , `Umar gave in charity some of his property, a garden of date-palms \ncalled Thamgh. `Umar said, \"O Allah's Messenger (ﷺ)! I have some property which I prize highly and I want \nto give it in charity.\" The Prophet; said, \"Give it in charity (i.e. as an endowment) with its land and \ntrees on the condition that the land and trees will neither be sold nor given as a present, nor \nbequeathed, but the fruits are to be spent in charity.\" So `Umar gave it in charity, and it was for \nAllah's Cause, the emancipation of slaves, for the poor, for guests, for travelers, and for kinsmen. The \nperson acting as its administrator could eat from it reasonably and fairly, and could let a friend of his \neat from it provided he had no intention of becoming wealthy by its means.","reference":"Sahih al-Bukhari 2764, Book 55, Hadith 27","grade":"","question #":"question #2","question":"How should the fruits of a charitable endowment be utilized according to Islamic teachings?","id":"bukhari-55-71"},{"hadith-eng":"The following Verse:-- \n\"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for \nhimself what is just and reasonable.\" (4.6) \nwas revealed in connection with the guardian of an orphan, and it means that if he is poor he can have \nfor himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of \nthe inheritance.","reference":"Sahih al-Bukhari 2765, Book 55, Hadith 28","grade":"","question #":"question #2","question":"How should a guardian act if they are financially well-off while managing an orphan's inheritance?","id":"bukhari-55-72"},{"hadith-eng":"The Prophet (ﷺ) said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Messenger (ﷺ)! \nWhat are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the \nlife which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba \n(usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the \ntime of fighting, and to accuse, chaste women, who never even think of anything touching chastity \nand are good believers.","reference":"Sahih al-Bukhari 2766, Book 55, Hadith 29","grade":"","question #":"question #2","question":"Why is associating partners with Allah considered a major sin in Islam?","id":"bukhari-55-73"},{"hadith-eng":"\"Ibn 'Umar never refused to be appointed as guardian.\" The most beloved thing to Ibn Sirin concerning an orphan's wealth was that the orphan's advisor and guardians would assemble to decide what is best for him. When Tawus was asked about something concerning an orphan's affairs, he would recite: '...And Allah knows him who means mischief from him who means good...' (V 2:220). 'Ata said concerning some orphans, \"The guardian is to provide for the young and the old orphans according to their needs from their shares.\"","reference":"Sahih al-Bukhari 2767, Book 55, Hadith 30","grade":"","question #":"question #2","question":"How should decisions be made regarding the welfare of orphans according to Islamic teachings?","id":"bukhari-55-74"},{"hadith-eng":"When Allah's Messenger (ﷺ) came to Medina; he did not have any servant. Abu Talha (Anas' step-father) \ntook me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Anas is a wise boy, so let him serve you.\" \nSo, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I \nrefrained from doing anything, he never asked me why I refrained from doing it.","reference":"Sahih al-Bukhari 2768, Book 55, Hadith 31","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) treat those who served him in terms of questioning their actions?","id":"bukhari-55-75"},{"hadith-eng":"Abu Talha had the greatest wealth of date-palms amongst the Ansar in Medina, and he prized above \nall his wealth (his garden) Bairuha', which was situated opposite the Mosque (of the Prophet (ﷺ) ). The \nProphet used to enter It and drink from its fresh water. When the following Divine Verse came:-- \n\"By no means shall you attain piety until you spend of what you love,\" (3.92) \nAbu Talha got up saying. \"O Allah's Messenger (ﷺ)! Allah says, 'You will not attain piety until you spend of \nwhat you love,' and I prize above al I my wealth, Bairuha' which I want to give in charity for Allah's \nSake, hoping for its reward from Allah. So you can use it as Allah directs you.\" On that the Prophet (ﷺ) \nsaid, \"Bravo! It is a profitable (or perishable) property. (Ibn Maslama is not sure as to which word is \nright, i.e. profitable or perishable.) I have heard what you have said, and I recommend that you \ndistribute this amongst your relatives.\" On that Abu Talha said, \"O Allah's Messenger (ﷺ)! I will do (as you \nhave suggested).\" So, Abu Talha distributed that garden amongst his relatives and cousins.","reference":"Sahih al-Bukhari 2769, Book 55, Hadith 32","grade":"","question #":"question #2","question":"How does the concept of piety relate to spending in the way of Allah according to Islamic teachings?","id":"bukhari-55-76"},{"hadith-eng":"A man said to Allah's Messenger (ﷺ) , \"My mother died, will it benefit her if I give in charity on her behalf?\" \nThe Prophet (ﷺ) replied in the affirmative. The man said, \"I have a garden and I make you a witness that I \ngive it in charity on her behalf.\"","reference":"Sahih al-Bukhari 2770, Book 55, Hadith 33","grade":"","question #":"question #2","question":"What actions can be taken to honor and benefit deceased family members in Islam?","id":"bukhari-55-77"},{"hadith-eng":"When the Prophet (ﷺ) ordered that the mosque be built, he said, \"O Bani An-Najjar! Suggest to me a price \nfor this garden of yours.\" They replied, \"By Allah! We will demand its price from none but Allah.\"","reference":"Sahih al-Bukhari 2771, Book 55, Hadith 34","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) demonstrate their dedication to the construction of the mosque?","id":"bukhari-55-78"},{"hadith-eng":"When `Umar got a piece of land in Khaibar, he came to the Prophet (ﷺ) saying, \"I have got a piece of \nland, better than which I have never got. So what do you advise me regarding it?\" The Prophet (ﷺ) said, \n\"If you wish you can keep it as an endowment to be used for charitable purposes.\" So, `Umar gave the \nland in charity (i.e. as an endowments on the condition that the land would neither be sold nor given \nas a present, nor bequeathed, (and its yield) would be used for the poor, the kinsmen, the emancipation \nof slaves, Jihad, and for guests and travelers; and its administrator could eat in a reasonable just \nmanner, and he also could feed his friends without intending to be wealthy by its means.\"","reference":"Sahih al-Bukhari 2772, Book 55, Hadith 35","grade":"","question #":"question #2","question":"What are the conditions and beneficiaries associated with an Islamic endowment?","id":"bukhari-55-79"},{"hadith-eng":"`Umar got some property in Khaibar and he came to the Prophet (ﷺ) and informed him about it. The \nProphet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an \nendowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and \nthe guests.","reference":"Sahih al-Bukhari 2773, Book 55, Hadith 36","grade":"","question #":"question #2","question":"How can endowments be used to benefit different groups in society?","id":"bukhari-55-80"},{"hadith-eng":"When Allah's Messenger (ﷺ) came to Medina, he ordered that a mosque be built. He said, \"O Bani An- \nNajjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price \nexcept from Allah.\"","reference":"Sahih al-Bukhari 2774, Book 55, Hadith 37","grade":"","question #":"question #2","question":"How did the Bani An-Najjar tribe respond to the Prophet's request for their garden?","id":"bukhari-55-81"},{"hadith-eng":"Once `Umar gave a horse in charity to be used in holy fighting. It had been given to him by Allah's \nApostle . `Umar gave it to another man to ride. Then `Umar was informed that the man put the horse \nfor sale, so he asked Allah's Messenger (ﷺ) whether he could buy it. Allah's Messenger (ﷺ) replied, \"You should not \nbuy it, for you should not take back what you have given in charity.\"","reference":"Sahih al-Bukhari 2775, Book 55, Hadith 38","grade":"","question #":"question #2","question":"How should one handle a situation where a charitable gift is being sold by the recipient?","id":"bukhari-55-82"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"My heirs will not inherit a Dinar or a Dirham (i.e. money), for whatever I leave \n(excluding the adequate support of my wives and the wages of my employees) is given in charity.\"","reference":"Sahih al-Bukhari 2776, Book 55, Hadith 39","grade":"","question #":"question #2","question":"How does the Prophet's instruction reflect on the distribution of wealth and charity in Islam?","id":"bukhari-55-83"},{"hadith-eng":"When `Umar founded an endowment he stipulated that its administrator could eat from it and also \nfeed his friend on the condition that he would not store anything for himself from it.","reference":"Sahih al-Bukhari 2777, Book 55, Hadith 40","grade":"","question #":"question #2","question":"What conditions are placed on the consumption and sharing of resources from an endowment?","id":"bukhari-55-84"},{"hadith-eng":"When 'Uthman (ra) was circled (by the rebels), he looked upon them from above and said, \"Ias you by Allah, I ask nobody but the Companions of the Prophet (ﷺ), dont you know that Allah's Messenger (ﷺ) said, 'Whoever  will (buy and) dig the well of Ruma will be granted Paradise,' and I (bought and) dug it? Don't you know that he said. 'Whoever equip the army of 'Usra (i.e., Tabuk's Ghazwa) will be granted Paradise,' and I equipped it ?\" They attested whatever he said.\nWhen 'Umar founded his endowment he said, \"Its administrator can eat from it.\" The management of the endowment can be taken over by the founder himself or any other person, for both cases are permissible.","reference":"Sahih al-Bukhari 2778, Book 55, Hadith 41","grade":"","question #":"question #2","question":"What is the significance of the well of Ruma and the army of 'Usra in Islamic history?","id":"bukhari-55-85"},{"hadith-eng":"The Prophet (ﷺ) said (at the time of building the Mosque), \"O Ban, An-Najjar! Suggest to me a price for \nyour garden.\" They replied, \"We do not ask its price except from Allah.\"","reference":"Sahih al-Bukhari 2779, Book 55, Hadith 42","grade":"","question #":"question #2","question":"How does the response of Ban, An-Najjar reflect their faith and reliance on Allah?","id":"bukhari-55-86"},{"hadith-eng":"Ibn 'Abbas (ra) said, \"A man from the tribe of Bani Sahm went out in the company of Tamim Ad-Dari and 'Adi bin Badda'. The man of Bani Sahm died in a land where there was no Muslim. When Tamim and 'Adi returned conveying the property of the deceased, they claimed that they had lost a silver bowl with gold engraving. Allah's Messenger (ﷺ) made them take an oath (to confirm their claim), and then the bowl was found in Makkah with some people who claimed that they had bought it from Tamim and 'Adu, Then two witnesses from the relatives of the deceased got up and swore that their witnesses were more valid than the witnesses of  'Adi and Tamim, and that the bowl belonged to their deceased fellow. So, this verse was revealed in connection with this case ; 'O you who believe! When death approached any of you ...',\" (V 5:106)","reference":"Sahih al-Bukhari 2780, Book 55, Hadith 43","grade":"","question #":"question #2","question":"How does Islam address the issue of trust and honesty in the context of inheritance and property disputes?","id":"bukhari-55-87"},{"hadith-eng":"My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to \nbe paid. When the time of plucking the date-fruits came, I went to Allah's Messenger (ﷺ) and said, \"O Allah's \nApostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that \nthe creditors would see you.\" The Prophet (ﷺ) said, \"Go and collect the various kinds of dates and place \nthem separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started \nclaiming their rights pressingly at that time. When the Prophet (ﷺ) saw how they behaved, he went round \nthe biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" \nThen he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would \nhave pleased me that Allah would clear the debts of my father even though I had not taken a single \ndate to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap \nwhere Allah's Messenger (ﷺ) was sitting and noticed as if not a single date had been taken thereof.","reference":"Sahih al-Bukhari 2781, Book 55, Hadith 44","grade":"","question #":"question #2","question":"What is the significance of trust in the Prophet's actions when dealing with financial matters?","id":"bukhari-55-88"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is not permissible for any Muslim who has something to will to stay for two \nnights without having his last will and testament written and kept ready with him.\"","reference":"Sahih al-Bukhari 2738, Book 55, Hadith 1","grade":"","question #":"question #3","question":"How does Islam view the responsibility of preparing a will for Muslims?","id":"bukhari-55-89"},{"hadith-eng":"(The brother of the wife of Allah's Messenger (ﷺ). Juwaira bint Al-Harith) When Allah's Messenger (ﷺ) died, he did \nnot leave any Dirham or Dinar (i.e. money), a slave or a slave woman or anything else except his \nwhite mule, his arms and a piece of land which he had given in charity .","reference":"Sahih al-Bukhari 2739, Book 55, Hadith 2","grade":"","question #":"question #3","question":"What can be learned from the Prophet Muhammad's (ﷺ) example regarding material wealth and its importance in life?","id":"bukhari-55-90"},{"hadith-eng":"I asked `Abdullah bin Abu `Aufa \"Did the Prophet (ﷺ) make a will?\" He replied, \"No,\" I asked him, \"How \nis it then that the making of a will has been enjoined on people, (or that they are ordered to make a \nwill)?\" He replied, \"The Prophet (ﷺ) bequeathed Allah's Book (i.e. Qur'an).","reference":"Sahih al-Bukhari 2740, Book 55, Hadith 3","grade":"","question #":"question #3","question":"What does it mean to bequeath the Qur'an according to Islamic teachings?","id":"bukhari-55-91"},{"hadith-eng":"In the presence of `Aisha some people mentioned that the Prophet (ﷺ) had appointed `Ali by will as his \nsuccessor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against \nmy chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and \nI could not even perceive that he had died, so when did he appoint him by will?\"","reference":"Sahih al-Bukhari 2741, Book 55, Hadith 4","grade":"","question #":"question #3","question":"What role does eyewitness testimony play in the authentication of historical events in Islam?","id":"bukhari-55-92"},{"hadith-eng":"The Prophet (ﷺ) came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he \ndisliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah \nbestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Messenger (ﷺ)! May I will all my \nproperty (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One \nthird?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your \ninheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake \nwill be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah \nmay lengthen your age so that some people may benefit by you, and some others be harmed by you.\" \nAt that time Sa`d had only one daughter.","reference":"Sahih al-Bukhari 2742, Book 55, Hadith 5","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the distribution of one's wealth in a will?","id":"bukhari-55-93"},{"hadith-eng":"I recommend that people reduce the proportion of what they bequeath by will to the fourth (of the \nwhole legacy), for Allah's Messenger (ﷺ) said, \"One-third, yet even one third is too much.\"","reference":"Sahih al-Bukhari 2743, Book 55, Hadith 6","grade":"","question #":"question #3","question":"How does the guidance on bequeathing a portion of one's estate reflect the balance between personal wishes and family rights in Islam?","id":"bukhari-55-94"},{"hadith-eng":"I fell sick and the Prophet (ﷺ) paid me a visit. I said to him, \"O Allah's Messenger (ﷺ)! I invoke Allah that He \nmay not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you \nhealth and let the people benefit by you.\" I said, \"I want to will my property, and I have only one \ndaughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I \nsaid, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator \nadded, \"So the people started to will one third of their property and that was Permitted for them.\")","reference":"Sahih al-Bukhari 2744, Book 55, Hadith 7","grade":"","question #":"question #3","question":"What is the significance of the Prophet's advice on the proportion of wealth to be willed in charity?","id":"bukhari-55-95"},{"hadith-eng":"(the wife of the Prophet) `Utba bin Abi Waqqas entrusted (his son) to his brother Sa`d bin Abi \nWaqqas saying, \"The son of the slave-girl of Zam`a is my (illegal) son, take him into your custody.\" \nSo during the year of the Conquest (of Mecca) Sa`d took the boy and said, \"This is my brother's son \nwhom my brother entrusted to me.\" 'Abu bin Zam's got up and said, \"He is my brother and the son of \nthe slave girl of my father and was born on my father's bed.\" Then both of them came to Allah's \nApostle and Sa`d said, \"O Allah's Messenger (ﷺ)! This is my brother's son whom my brother entrusted to \nme.\" \nThen 'Abu bin Zam`a got up and said, \"This is my brother and the son of the slave-girl of my father.\" \nAllah's Messenger (ﷺ) said, \"O Abu bin Zam`a! This boy is for you as the boy belongs to the bed (where he \nwas born), and for the adulterer is the stone (i.e. deprivation).\" Then the Prophet (ﷺ) said to his wife \nSauda bint Zam`a, \"Screen yourself from this boy,\" when he saw the boy's resemblance to `Utba. \nSince then the boy did not see Sauda till he died.","reference":"Sahih al-Bukhari 2745, Book 55, Hadith 8","grade":"","question #":"question #3","question":"What role does physical resemblance play in determining familial relationships in Islamic tradition?","id":"bukhari-55-96"},{"hadith-eng":"A Jew crushed the head of a girl between two stones. She was asked, \"Who has done so to you, soand- \nso? So-and-so?\" Till the name of the Jew was mentioned, whereupon she nodded (in agreement). \nSo the Jew was brought and was questioned till he confessed. The Prophet (ﷺ) then ordered that his head \nbe crushed with stones.","reference":"Sahih al-Bukhari 2746, Book 55, Hadith 9","grade":"","question #":"question #3","question":"What role does confession play in the Islamic judicial process?","id":"bukhari-55-97"},{"hadith-eng":"The custom (in old days) was that the property of the deceased would be inherited by his offspring; as \nfor the parents (of the deceased), they would inherit by the will of the deceased. Then Allah cancelled \nfrom that custom whatever He wished and fixed for the male double the amount inherited by the \nfemale, and for each parent a sixth (of the whole legacy) and for the wife an eighth or a fourth and for \nthe husband a half or a fourth.","reference":"Sahih al-Bukhari 2747, Book 55, Hadith 10","grade":"","question #":"question #3","question":"How does the inheritance share differ between male and female heirs in Islamic jurisprudence?","id":"bukhari-55-98"},{"hadith-eng":"A man asked the Prophet, \"O Allah's Messenger (ﷺ)! What kind of charity is the best?\" He replied. \"To give \nin charity when you are healthy and greedy hoping to be wealthy and afraid of becoming poor. Don't \ndelay giving in charity till the time when you are on the death bed when you say, 'Give so much to soand- \nso and so much to so-and so,' and at that time the property is not yours but it belongs to so-and-so \n(i.e. your inheritors).","reference":"Sahih al-Bukhari 2748, Book 55, Hadith 11","grade":"","question #":"question #3","question":"How does the intention and timing of giving charity affect its value in Islam?","id":"bukhari-55-99"},{"hadith-eng":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three: Whenever he speaks he tells a lie; whenever he \nis entrusted he proves dishonest; whenever he promises he breaks his promise.\"","reference":"Sahih al-Bukhari 2749, Book 55, Hadith 12","grade":"","question #":"question #3","question":"Why is fulfilling promises considered important in Islam?","id":"bukhari-55-100"},{"hadith-eng":"Hakim bin Hizam said, \"I asked Allah's Messenger (ﷺ) for something, and he gave me, and I asked him again \nand he gave me and said, 'O Hakim! This wealth is green and sweet (i.e. as tempting as fruits), and \nwhoever takes it without greed then he is blessed in it, and whoever takes it with greediness, he is not \nblessed in it and he is like one who eats and never gets satisfied. \nThe upper (i.e. giving) hand is better than the lower (i.e. taking) hand.\" Hakim added, \"I said, O \nAllah's Messenger (ﷺ)! By Him Who has sent you with the Truth I will never demand anything from \nanybody after you till I die.\" Afterwards Abu Bakr used to call Hakim to give him something but he \nrefused to accept anything from him. Then `Umar called him to give him (something) but he refused. \nThen `Umar said, \"O Muslims! I offered to him (i.e. Hakim) his share which Allah has ordained for \nhim from this booty and he refuses to take it.\" Thus Hakim did not ask anybody for anything after the \nProphet, till he died--may Allah bestow His mercy upon him.","reference":"Sahih al-Bukhari 2750, Book 55, Hadith 13","grade":"","question #":"question #3","question":"What can be learned from Hakim bin Hizam's decision to not ask for anything after the Prophet's time?","id":"bukhari-55-101"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"All of you are guardians and responsible for your charges: the Ruler \n(i.e. Imam) is a guardian and responsible for his subjects; and a man is a guardian of his family and is \nresponsible for his charges; and a lady is a guardian in the house of her husband and is responsible for \nher charge; and a servant is a guardian of the property of his master and is responsible for his charge.\" \nI think he also said, \"And a man is a guardian of the property of his father.\"","reference":"Sahih al-Bukhari 2751, Book 55, Hadith 14","grade":"","question #":"question #3","question":"What is the significance of being a guardian in the context of family and property management in Islam?","id":"bukhari-55-102"},{"hadith-eng":"The Prophet (ﷺ) said to Abu Talha, \"I recommend that you divide (this garden) amongst your relatives.\" \nAbu Talha said, \"O Allah's Messenger (ﷺ)! I will do the same.\" So Abu Talha divided it among his relatives \nand cousins. \nIbn 'Abbes said, \"When the Qur'anic Verse: \n\"Warn your nearest kinsmen.\" (26.214) \nWas revealed, the Prophet (ﷺ) started calling the various big families of Quraish, \"O Bani Fihr! O Bani \nAdi!\". \nAbu Huraira said, \"When the Verse: \"Warn your nearest kinsmen\" was revealed, the Prophet (ﷺ) said (in a \nloud voice), \"O people of Quraish!\"","reference":"Sahih al-Bukhari 2752, Book 55, Hadith 15","grade":"","question #":"question #3","question":"What actions did Abu Talha take upon receiving advice from the Prophet Muhammad (ﷺ)?","id":"bukhari-55-103"},{"hadith-eng":"When Allah revealed the Verse: \"Warn your nearest kinsmen,\" Allah's Messenger (ﷺ) got up and said, \"O \npeople of Quraish (or said similar words)! Buy (i.e. save) yourselves (from the Hellfire) as I cannot \nsave you from Allah's Punishment; O Bani `Abd Manaf! I cannot save you from Allah's Punishment, \nO Safiya, the Aunt of Allah's Messenger (ﷺ)! I cannot save you from Allah's Punishment; O Fatima bint \nMuhammad! Ask me anything from my wealth, but I cannot save you from Allah's Punishment.\"","reference":"Sahih al-Bukhari 2753, Book 55, Hadith 16","grade":"","question #":"question #3","question":"What does Islamic teaching say about the limitations of intercession by family members in matters of divine punishment?","id":"bukhari-55-104"},{"hadith-eng":"The Prophet (ﷺ) saw a man driving a Badana (i.e. camel for sacrifice) and said to him, \"Ride on it.\" The \nman said, \"O Allah's Messenger (ﷺ)! It is a Bandana.\" (The Prophet (ﷺ) repeated his order) and on the third or \nfourth time he said, \"Ride it, (woe to you\" or said: \"May Allah be merciful to you).","reference":"Sahih al-Bukhari 2754, Book 55, Hadith 17","grade":"","question #":"question #3","question":"What can be learned about the balance between religious rituals and practical needs from the Prophet's guidance on using sacrificial animals?","id":"bukhari-55-105"},{"hadith-eng":"Allah's Messenger (ﷺ) saw a man driving a Badana and said to him, \"Ride on it,\" and on the second or the \nthird time he added, \"Woe to you.\"","reference":"Sahih al-Bukhari 2755, Book 55, Hadith 18","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's emphasis on practicality and compassion in daily life from this incident?","id":"bukhari-55-106"},{"hadith-eng":"The mother of Sa`d bin 'Ubada died in his absence. He said, \"O Allah's Messenger (ﷺ)! My mother died in \nmy absence; will it be of any benefit for her if I give Sadaqa on her behalf?\" The Prophet (ﷺ) said, \"Yes,\" \nSa`d said, \"I make you a witness that I gave my garden called Al Makhraf in charity on her behalf.\"","reference":"Sahih al-Bukhari 2756, Book 55, Hadith 19","grade":"","question #":"question #3","question":"How does the intention behind giving charity impact its reward in Islamic teachings?","id":"bukhari-55-107"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! For the acceptance of my repentance I wish to give all my property in \ncharity for Allah's sake through His Apostle .\" He said, \"It is better for you to keep some of the \nproperty for yourself.\" I said, \"Then I will keep my share in Khaibar.\"","reference":"Sahih al-Bukhari 2757, Book 55, Hadith 20","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the management of personal assets after repentance?","id":"bukhari-55-108"},{"hadith-eng":"When the Holy Verse: 'By no means shall you attain Al-Birr (piety, righteousness, it means here Allah's Reward i.e., Paradise), unless you spend of that which you love..', (V 3:92) was revealed, Abu Talha went to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger ! Allah, the Blessed, the Superior stated in His book: 'By no means shall you attain Birr, unless you spend of that which you love....' (V 3:92) and the most beloved property to me is Bairuha' (which was a garden where Allah's Messenger (ﷺ) used to go to sit in its shade and drink from its water). I gave it to the Allah and His Messenger (ﷺ) hoping for Allah's Reward in the Hereafter. So, Ao Allah's Messenger ! Use it as Allah orders you to use it.\" Allah's Messenger (ﷺ) said, \"Bravo! O Abu Talha, it is fruitful property. We have accepted it from you and now we return it to you. Distribute it amongst you relatives.\" So, Abu Talha distributed it amongst his relatives, amongst whom were Ubai and Hassan. When Hassan sold his share of that garden to Mu'awiyya, he was asked, \"How do you see Abu Talha's Sadaqa?\" He replied, \"Who should not I sell a Sa' of date for Sa' of money ?\" The garden was situated on the courtyard of the palace of Bani Jadila built by Mu'awiya.","reference":"Sahih al-Bukhari 2758, Book 55, Hadith 21","grade":"","question #":"question #3","question":"What role does charity play in achieving spiritual rewards according to Islamic teachings?","id":"bukhari-55-109"},{"hadith-eng":"Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the \npeople have stopped acting on it. There are two kinds of guardians (who are in charge of the \ninheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, \nthe orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the \norphans): such a person should speak kindly and say (to those who are present at the time of \ndistribution), \"I can not give it to you (as the wealth belongs to the orphans).","reference":"Sahih al-Bukhari 2759, Book 55, Hadith 22","grade":"","question #":"question #3","question":"What is the significance of speaking kindly during the distribution of inheritance in Islam?","id":"bukhari-55-110"},{"hadith-eng":"A man said to the Prophet, \"My mother died suddenly, and I think that if she could speak, she would \nhave given in charity. May I give in charity on her behalf?\" He said, \"Yes! Give in charity on her \nbehalf.\"","reference":"Sahih al-Bukhari 2760, Book 55, Hadith 23","grade":"","question #":"question #3","question":"How does intention play a role in charitable acts for someone who has passed away?","id":"bukhari-55-111"},{"hadith-eng":"Sa`d bin Ubada consulted Allah's Messenger (ﷺ) saying, \"My mother died and she had an unfulfilled vow.\" \nThe Prophet (ﷺ) said, \"Fulfill it on her behalf.\"","reference":"Sahih al-Bukhari 2761, Book 55, Hadith 24","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the fulfillment of vows made by others?","id":"bukhari-55-112"},{"hadith-eng":"That the mother of Sa`d bin Ubada the brother of Bani Saida died in Sa`d's absence, so he came to the \nProphet saying, \"O Allah's Messenger (ﷺ)! My mother died in my absence, will it benefit her if I give in \ncharity on her behalf?\" The Prophet (ﷺ) said, \"Yes.\" Sa`d said, \"I take you as my witness that I give my \ngarden Al-Makhraf in charity on her behalf.\"","reference":"Sahih al-Bukhari 2762, Book 55, Hadith 25","grade":"","question #":"question #3","question":"How does the intention of the living impact the rewards for the deceased in Islamic teachings?","id":"bukhari-55-113"},{"hadith-eng":"`Urwa bin Az-Zubair said that he asked `Aisha about the meaning of the Qur'anic Verse:-- \n\"And if you fear that you will not deal fairly with the orphan girls then marry (other) women of your \nchoice.\" (4.2-3) \nAisha said, \"It is about a female orphan under the guardianship of her guardian who is inclined \ntowards her because of her beauty and wealth, and likes to marry her with a Mahr less than what is \ngiven to women of her standard. So they (i.e. guardians) were forbidden to marry the orphans unless \nthey paid them a full appropriate Mahr (otherwise) they were ordered to marry other women instead of \nthem. Later on the people asked Allah's Messenger (ﷺ) about it. So Allah revealed the following Verse:-- \n\"They ask your instruction (O Muhammad!) regarding women. Say: Allah instructs you regarding \nthem...\" (4.127) \nand in this Verse Allah indicated that if the orphan girl was beautiful and wealthy, her guardian would \nhave the desire to marry her without giving her an appropriate Mahr equal to what her peers could get, \nbut if she was undesirable for lack of beauty or wealth, then he would not marry her, but seek to marry \nsome other woman instead of her. So, since he did not marry her when he had no inclination towards \nher, he had not the right to marry her when he had an interest in her, unless he treated her justly by \ngiving her a full Mahr and securing all her rights.","reference":"Sahih al-Bukhari 2763, Book 55, Hadith 26","grade":"","question #":"question #3","question":"What is the significance of providing a full Mahr in the context of marrying an orphan girl?","id":"bukhari-55-114"},{"hadith-eng":"In the lifetime of Allah's Messenger (ﷺ) , `Umar gave in charity some of his property, a garden of date-palms \ncalled Thamgh. `Umar said, \"O Allah's Messenger (ﷺ)! I have some property which I prize highly and I want \nto give it in charity.\" The Prophet; said, \"Give it in charity (i.e. as an endowment) with its land and \ntrees on the condition that the land and trees will neither be sold nor given as a present, nor \nbequeathed, but the fruits are to be spent in charity.\" So `Umar gave it in charity, and it was for \nAllah's Cause, the emancipation of slaves, for the poor, for guests, for travelers, and for kinsmen. The \nperson acting as its administrator could eat from it reasonably and fairly, and could let a friend of his \neat from it provided he had no intention of becoming wealthy by its means.","reference":"Sahih al-Bukhari 2764, Book 55, Hadith 27","grade":"","question #":"question #3","question":"What responsibilities does an administrator have when managing a charitable endowment?","id":"bukhari-55-115"},{"hadith-eng":"The following Verse:-- \n\"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for \nhimself what is just and reasonable.\" (4.6) \nwas revealed in connection with the guardian of an orphan, and it means that if he is poor he can have \nfor himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of \nthe inheritance.","reference":"Sahih al-Bukhari 2765, Book 55, Hadith 28","grade":"","question #":"question #3","question":"What is considered just and reasonable for a poor guardian to take from an orphan's wealth?","id":"bukhari-55-116"},{"hadith-eng":"The Prophet (ﷺ) said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Messenger (ﷺ)! \nWhat are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the \nlife which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba \n(usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the \ntime of fighting, and to accuse, chaste women, who never even think of anything touching chastity \nand are good believers.","reference":"Sahih al-Bukhari 2766, Book 55, Hadith 29","grade":"","question #":"question #3","question":"What are the consequences of consuming usury and how is it viewed in Islamic teachings?","id":"bukhari-55-117"},{"hadith-eng":"\"Ibn 'Umar never refused to be appointed as guardian.\" The most beloved thing to Ibn Sirin concerning an orphan's wealth was that the orphan's advisor and guardians would assemble to decide what is best for him. When Tawus was asked about something concerning an orphan's affairs, he would recite: '...And Allah knows him who means mischief from him who means good...' (V 2:220). 'Ata said concerning some orphans, \"The guardian is to provide for the young and the old orphans according to their needs from their shares.\"","reference":"Sahih al-Bukhari 2767, Book 55, Hadith 30","grade":"","question #":"question #3","question":"What guidance does the Quran provide about distinguishing between those who intend good and those who intend mischief in the context of orphan care?","id":"bukhari-55-118"},{"hadith-eng":"When Allah's Messenger (ﷺ) came to Medina; he did not have any servant. Abu Talha (Anas' step-father) \ntook me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Anas is a wise boy, so let him serve you.\" \nSo, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I \nrefrained from doing anything, he never asked me why I refrained from doing it.","reference":"Sahih al-Bukhari 2768, Book 55, Hadith 31","grade":"","question #":"question #3","question":"What can be learned about the Prophet Muhammad's (ﷺ) leadership style from his interactions with his servants?","id":"bukhari-55-119"},{"hadith-eng":"Abu Talha had the greatest wealth of date-palms amongst the Ansar in Medina, and he prized above \nall his wealth (his garden) Bairuha', which was situated opposite the Mosque (of the Prophet (ﷺ) ). The \nProphet used to enter It and drink from its fresh water. When the following Divine Verse came:-- \n\"By no means shall you attain piety until you spend of what you love,\" (3.92) \nAbu Talha got up saying. \"O Allah's Messenger (ﷺ)! Allah says, 'You will not attain piety until you spend of \nwhat you love,' and I prize above al I my wealth, Bairuha' which I want to give in charity for Allah's \nSake, hoping for its reward from Allah. So you can use it as Allah directs you.\" On that the Prophet (ﷺ) \nsaid, \"Bravo! It is a profitable (or perishable) property. (Ibn Maslama is not sure as to which word is \nright, i.e. profitable or perishable.) I have heard what you have said, and I recommend that you \ndistribute this amongst your relatives.\" On that Abu Talha said, \"O Allah's Messenger (ﷺ)! I will do (as you \nhave suggested).\" So, Abu Talha distributed that garden amongst his relatives and cousins.","reference":"Sahih al-Bukhari 2769, Book 55, Hadith 32","grade":"","question #":"question #3","question":"What role does the guidance of the Prophet Muhammad (ﷺ) play in the distribution of charity?","id":"bukhari-55-120"},{"hadith-eng":"A man said to Allah's Messenger (ﷺ) , \"My mother died, will it benefit her if I give in charity on her behalf?\" \nThe Prophet (ﷺ) replied in the affirmative. The man said, \"I have a garden and I make you a witness that I \ngive it in charity on her behalf.\"","reference":"Sahih al-Bukhari 2770, Book 55, Hadith 33","grade":"","question #":"question #3","question":"How does Islam view the act of giving charity for someone who has passed away?","id":"bukhari-55-121"},{"hadith-eng":"When the Prophet (ﷺ) ordered that the mosque be built, he said, \"O Bani An-Najjar! Suggest to me a price \nfor this garden of yours.\" They replied, \"By Allah! We will demand its price from none but Allah.\"","reference":"Sahih al-Bukhari 2771, Book 55, Hadith 34","grade":"","question #":"question #3","question":"What can be learned about the values of selflessness and devotion from the actions of Bani An-Najjar in this narration?","id":"bukhari-55-122"},{"hadith-eng":"When `Umar got a piece of land in Khaibar, he came to the Prophet (ﷺ) saying, \"I have got a piece of \nland, better than which I have never got. So what do you advise me regarding it?\" The Prophet (ﷺ) said, \n\"If you wish you can keep it as an endowment to be used for charitable purposes.\" So, `Umar gave the \nland in charity (i.e. as an endowments on the condition that the land would neither be sold nor given \nas a present, nor bequeathed, (and its yield) would be used for the poor, the kinsmen, the emancipation \nof slaves, Jihad, and for guests and travelers; and its administrator could eat in a reasonable just \nmanner, and he also could feed his friends without intending to be wealthy by its means.\"","reference":"Sahih al-Bukhari 2772, Book 55, Hadith 35","grade":"","question #":"question #3","question":"How can the yield from an endowment be utilized according to Islamic teachings?","id":"bukhari-55-123"},{"hadith-eng":"`Umar got some property in Khaibar and he came to the Prophet (ﷺ) and informed him about it. The \nProphet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an \nendowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and \nthe guests.","reference":"Sahih al-Bukhari 2773, Book 55, Hadith 36","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the use of wealth for charitable purposes?","id":"bukhari-55-124"},{"hadith-eng":"When Allah's Messenger (ﷺ) came to Medina, he ordered that a mosque be built. He said, \"O Bani An- \nNajjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price \nexcept from Allah.\"","reference":"Sahih al-Bukhari 2774, Book 55, Hadith 37","grade":"","question #":"question #3","question":"What does the response of Bani An-Najjar indicate about their faith and priorities?","id":"bukhari-55-125"},{"hadith-eng":"Once `Umar gave a horse in charity to be used in holy fighting. It had been given to him by Allah's \nApostle . `Umar gave it to another man to ride. Then `Umar was informed that the man put the horse \nfor sale, so he asked Allah's Messenger (ﷺ) whether he could buy it. Allah's Messenger (ﷺ) replied, \"You should not \nbuy it, for you should not take back what you have given in charity.\"","reference":"Sahih al-Bukhari 2775, Book 55, Hadith 38","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the sale of items given in charity?","id":"bukhari-55-126"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"My heirs will not inherit a Dinar or a Dirham (i.e. money), for whatever I leave \n(excluding the adequate support of my wives and the wages of my employees) is given in charity.\"","reference":"Sahih al-Bukhari 2776, Book 55, Hadith 39","grade":"","question #":"question #3","question":"What exceptions did the Prophet make concerning the distribution of his wealth after his passing?","id":"bukhari-55-127"},{"hadith-eng":"When `Umar founded an endowment he stipulated that its administrator could eat from it and also \nfeed his friend on the condition that he would not store anything for himself from it.","reference":"Sahih al-Bukhari 2777, Book 55, Hadith 40","grade":"","question #":"question #3","question":"How does the stipulation of not storing anything for oneself relate to the management of charitable resources?","id":"bukhari-55-128"},{"hadith-eng":"When 'Uthman (ra) was circled (by the rebels), he looked upon them from above and said, \"Ias you by Allah, I ask nobody but the Companions of the Prophet (ﷺ), dont you know that Allah's Messenger (ﷺ) said, 'Whoever  will (buy and) dig the well of Ruma will be granted Paradise,' and I (bought and) dug it? Don't you know that he said. 'Whoever equip the army of 'Usra (i.e., Tabuk's Ghazwa) will be granted Paradise,' and I equipped it ?\" They attested whatever he said.\nWhen 'Umar founded his endowment he said, \"Its administrator can eat from it.\" The management of the endowment can be taken over by the founder himself or any other person, for both cases are permissible.","reference":"Sahih al-Bukhari 2778, Book 55, Hadith 41","grade":"","question #":"question #3","question":"How does Islamic tradition view the management and use of endowments or charitable foundations?","id":"bukhari-55-129"},{"hadith-eng":"The Prophet (ﷺ) said (at the time of building the Mosque), \"O Ban, An-Najjar! Suggest to me a price for \nyour garden.\" They replied, \"We do not ask its price except from Allah.\"","reference":"Sahih al-Bukhari 2779, Book 55, Hadith 42","grade":"","question #":"question #3","question":"What can be learned about the relationship between the Prophet Muhammad (ﷺ) and his companions from this event?","id":"bukhari-55-130"},{"hadith-eng":"Ibn 'Abbas (ra) said, \"A man from the tribe of Bani Sahm went out in the company of Tamim Ad-Dari and 'Adi bin Badda'. The man of Bani Sahm died in a land where there was no Muslim. When Tamim and 'Adi returned conveying the property of the deceased, they claimed that they had lost a silver bowl with gold engraving. Allah's Messenger (ﷺ) made them take an oath (to confirm their claim), and then the bowl was found in Makkah with some people who claimed that they had bought it from Tamim and 'Adu, Then two witnesses from the relatives of the deceased got up and swore that their witnesses were more valid than the witnesses of  'Adi and Tamim, and that the bowl belonged to their deceased fellow. So, this verse was revealed in connection with this case ; 'O you who believe! When death approached any of you ...',\" (V 5:106)","reference":"Sahih al-Bukhari 2780, Book 55, Hadith 43","grade":"","question #":"question #3","question":"What role do witnesses play in the Islamic legal system when it comes to verifying claims?","id":"bukhari-55-131"},{"hadith-eng":"My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to \nbe paid. When the time of plucking the date-fruits came, I went to Allah's Messenger (ﷺ) and said, \"O Allah's \nApostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that \nthe creditors would see you.\" The Prophet (ﷺ) said, \"Go and collect the various kinds of dates and place \nthem separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started \nclaiming their rights pressingly at that time. When the Prophet (ﷺ) saw how they behaved, he went round \nthe biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" \nThen he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would \nhave pleased me that Allah would clear the debts of my father even though I had not taken a single \ndate to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap \nwhere Allah's Messenger (ﷺ) was sitting and noticed as if not a single date had been taken thereof.","reference":"Sahih al-Bukhari 2781, Book 55, Hadith 44","grade":"","question #":"question #3","question":"How can faith in Allah's provision be demonstrated in times of financial difficulty?","id":"bukhari-55-132"}]