[{"hadith-eng":"`Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a \nplace six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He \nsaid 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing \nwhich Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the \nexception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Messenger (ﷺ) \nsacrificed cows on behalf of his wives.\"","reference":"Sahih al-Bukhari 294, Book 6, Hadith 1","grade":"","question #":"question #1","question":"What guidance is given to women who experience menstruation during Hajj?","id":"bukhari-6-1"},{"hadith-eng":"While in menses, I used to comb the hair of Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 295, Book 6, Hadith 2","grade":"","question #":"question #1","question":"What activities are permissible for a woman during her menses in relation to her husband?","id":"bukhari-6-2"},{"hadith-eng":"A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" \nI replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person \nto do the same. `Aisha told me that she used to comb the hair of Allah's Messenger (ﷺ) while she was in her \nmenses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she \nwould comb his hair, while she used to be in her menses.\"","reference":"Sahih al-Bukhari 296, Book 6, Hadith 3","grade":"","question #":"question #1","question":"What activities are permissible for a woman during her menses in relation to serving others?","id":"bukhari-6-3"},{"hadith-eng":"The Prophet (ﷺ) used to lean on my lap and recite Qur'an while I was in menses.","reference":"Sahih al-Bukhari 297, Book 6, Hadith 4","grade":"","question #":"question #1","question":"What does this narration indicate about the permissibility of reciting the Qur'an in the presence of a menstruating woman?","id":"bukhari-6-4"},{"hadith-eng":"While I was laying with the Prophet (ﷺ) under a single woolen sheet, I got the menses. I slipped away and \nput on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then \ncalled me and made me lie with him under the same sheet.","reference":"Sahih al-Bukhari 298, Book 6, Hadith 5","grade":"","question #":"question #1","question":"What does this narration teach about the interaction between spouses during menstruation?","id":"bukhari-6-5"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #1","question":"What does this narration indicate about the permissibility of physical intimacy between spouses during menstruation?","id":"bukhari-6-6"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) maintain physical intimacy with his wife during her menstrual period?","id":"bukhari-6-7"},{"hadith-eng":"(on the authority of his father) `Aisha said: \"Whenever Allah's Messenger (ﷺ) wanted to fondle anyone of us \nduring her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha \nadded, \"None of you could control his sexual desires as the Prophet (ﷺ) could.\"","reference":"Sahih al-Bukhari 302, Book 6, Hadith 7","grade":"","question #":"question #1","question":"What guidelines are provided for physical intimacy during a woman's menstrual period in Islam?","id":"bukhari-6-8"},{"hadith-eng":"When ever Allah's Messenger (ﷺ) wanted to fondle any of his wives during the periods (menses), he used to \nask her to wear an Izar.","reference":"Sahih al-Bukhari 303, Book 6, Hadith 8","grade":"","question #":"question #1","question":"What guidelines did the Prophet Muhammad (ﷺ) follow when interacting with his wives during their menstrual periods?","id":"bukhari-6-9"},{"hadith-eng":"Once Allah's Messenger (ﷺ) went out to the Musalla (to offer the prayer) of `Id-al-Adha or Al-Fitr prayer. \nThen he passed by the women and said, \"O women! Give alms, as I have seen that the majority of the \ndwellers of Hell-fire were you (women).\" They asked, \"Why is it so, O Allah's Messenger (ﷺ) ?\" He replied, \n\"You curse frequently and are ungrateful to your husbands. I have not seen anyone more deficient in \nintelligence and religion than you. A cautious sensible man could be led astray by some of you.\" The \nwomen asked, \"O Allah's Messenger (ﷺ)! What is deficient in our intelligence and religion?\" He said, \"Is not \nthe evidence of two women equal to the witness of one man?\" They replied in the affirmative. He \nsaid, \"This is the deficiency in her intelligence. Isn't it true that a woman can neither pray nor fast \nduring her menses?\" The women replied in the affirmative. He said, \"This is the deficiency in her \nreligion.\"","reference":"Sahih al-Bukhari 304, Book 6, Hadith 9","grade":"","question #":"question #1","question":"What are the reasons mentioned for women being the majority of the dwellers of Hell-fire according to the Prophet Muhammad (ﷺ)?","id":"bukhari-6-10"},{"hadith-eng":"We set out with the Prophet (ﷺ) for Hajj and when we reached Sarif I got my menses. When the Prophet (ﷺ) \ncame to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed \nHajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is \nthe thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do \nexcept that you do not perform the Tawaf round the Ka`ba till you are clean.\"","reference":"Sahih al-Bukhari 305, Book 6, Hadith 10","grade":"","question #":"question #1","question":"What guidance does Islam provide for women who experience menstruation during Hajj?","id":"bukhari-6-11"},{"hadith-eng":"Fatima bint Abi Hubaish said to Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! I do not become clean (from \nbleeding). Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied: \"No, because it is from a blood vessel \nand not the menses. So when the real menses begins give up your prayers and when it (the period) has \nfinished wash the blood off your body (take a bath) and offer your prayers.\"","reference":"Sahih al-Bukhari 306, Book 6, Hadith 11","grade":"","question #":"question #1","question":"What guidance is provided for women experiencing non-menstrual bleeding regarding their prayers?","id":"bukhari-6-12"},{"hadith-eng":"A woman asked Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! What should we do, if the blood of menses falls \non our clothes?\" Allah's Messenger (ﷺ) replied, \"If the blood of menses falls on the garment of anyone of \nyou, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).","reference":"Sahih al-Bukhari 307, Book 6, Hadith 12","grade":"","question #":"question #1","question":"What steps should be taken to clean menstrual blood from clothing according to Islamic teachings?","id":"bukhari-6-13"},{"hadith-eng":"Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot \nand rub the blood off her garment, and pour water over it and wash that portion thoroughly and \nsprinkle water over the rest of the garment. After that she would pray in (with) it.","reference":"Sahih al-Bukhari 308, Book 6, Hadith 13","grade":"","question #":"question #1","question":"What steps should be taken to clean a garment that has been stained with menstrual blood before performing prayers?","id":"bukhari-6-14"},{"hadith-eng":"Once one of the wives of the Prophet (ﷺ) did I`tikaf along with him and she was getting bleeding in \nbetween her periods. She used to see the blood (from her private parts) and she would perhaps put a \ndish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower \nand said, \"It looks like what so and so used to have.\")","reference":"Sahih al-Bukhari 309, Book 6, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of performing I'tikaf during menstruation or irregular bleeding?","id":"bukhari-6-15"},{"hadith-eng":"\"One of the wives of Allah's Messenger (ﷺ) joined him in I`tikaf and she noticed blood and yellowish \ndischarge (from her private parts) and put a dish under her when she prayed.\"","reference":"Sahih al-Bukhari 310, Book 6, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of I`tikaf in Islam and how is it observed by women?","id":"bukhari-6-16"},{"hadith-eng":"One of the mothers of the faithful believers (i.e. the wives of the Prophet (ﷺ) ) did I`tikaf while she was \nhaving bleeding in between her periods.","reference":"Sahih al-Bukhari 311, Book 6, Hadith 16","grade":"","question #":"question #1","question":"What is the ruling on performing I'tikaf for women experiencing bleeding between periods?","id":"bukhari-6-17"},{"hadith-eng":"None of us had more than a single garment and we used to have our menses while wearing it. \nWhenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the \nblood with our nails.","reference":"Sahih al-Bukhari 312, Book 6, Hadith 17","grade":"","question #":"question #1","question":"How did women in the time of the Prophet (ﷺ) manage menstrual hygiene with limited resources?","id":"bukhari-6-18"},{"hadith-eng":"We were forbidden to mourn for a dead person for more than three days except in the case of a \nhusband for whom mourning was allowed for four months and ten days. (During that time) we were \nnot allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored \nclothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed \nvery light perfumes at the time of taking a bath after menses and also we were forbidden to go with \nthe funeral procession .","reference":"Sahih al-Bukhari 313, Book 6, Hadith 18","grade":"","question #":"question #1","question":"What are the guidelines for mourning a deceased person in Islam, particularly for a husband?","id":"bukhari-6-19"},{"hadith-eng":"A woman asked the Prophet (ﷺ) about the bath which is taken after finishing from the menses. The Prophet (ﷺ) \ntold her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman \nasked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled \nher to myself and said, \"Rub the place soiled with blood with it.\"","reference":"Sahih al-Bukhari 314, Book 6, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of using scented cloth in purification after menstruation?","id":"bukhari-6-20"},{"hadith-eng":"An Ansari woman asked the Prophet (ﷺ) how to take a bath after finishing from the menses. He replied, \n\"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet (ﷺ) felt \nshy and turned his face. So I pulled her to me and told her what the Prophet (ﷺ) meant.","reference":"Sahih al-Bukhari 315, Book 6, Hadith 20","grade":"","question #":"question #1","question":"What guidance is provided for women regarding purification after menstruation?","id":"bukhari-6-21"},{"hadith-eng":"In the last Hajj of Allah's Messenger (ﷺ) I assumed the Ihram for Hajj along with Allah Apostle. I was one of \nthose who intended Tamattu` (to perform Hajj and `Umra) and did not take the Hadi (animal for \nsacrifice) with me. I got my menses and was not clean till the night of `Arafa I said, \"O Allah's \nApostle! It is the night of the day of `Arafat and I intended to perform the Hajj Tamattu` with `Umra. \nAllah's Messenger (ﷺ) told me to undo my hair and comb it and to postpone the `Umra. I did the same and \ncompleted the Hajj. On the night of Al-Hasba (i.e. place outside Mecca where the pilgrims go after \nfinishing all the ceremonies of Hajj at Mina) he (the Prophet) ordered `Abdur Rahman (`Aisha's brother) \nto take me to at-Tan`im to assume the lhram for `Umra in lieu of that of Hajj-at-Tamattu` which I had \nintended to perform.","reference":"Sahih al-Bukhari 316, Book 6, Hadith 21","grade":"","question #":"question #1","question":"What should a woman do if she gets her menses during Hajj and has intended to perform Hajj Tamattu`?","id":"bukhari-6-22"},{"hadith-eng":"On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Messenger (ﷺ) said, \"Any \none who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I \nwould have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others \nassumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and \nkept on menstruating until the day of `Arafat and complained of that to the Prophet. He told me to \npostpone my `Umra, undo and comb my hair, and to assume the Ihram of Hajj and I did so. On the \nnight of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I \nassumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, \nfasting or alms were required.","reference":"Sahih al-Bukhari 317, Book 6, Hadith 22","grade":"","question #":"question #1","question":"What are the different intentions one can have when assuming Ihram during the Hajj season?","id":"bukhari-6-23"},{"hadith-eng":"The Prophet (ﷺ) said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O \nLord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel \nasks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision \nbe? And what will his age be?' So all that is written while the child is still in the mother's womb.\"","reference":"Sahih al-Bukhari 318, Book 6, Hadith 23","grade":"","question #":"question #1","question":"What role does an angel play in the development of a fetus according to Islamic teachings?","id":"bukhari-6-24"},{"hadith-eng":"`Aisha said, \"We set out with the Prophet (ﷺ) in his last Hajj. Some of us intended to perform `Umra \nwhile others Hajj. When we reached Mecca, Allah's Messenger (ﷺ) said, 'Those who had assumed the lhram \nfor `Umra and had not brought the Hadi should finish his lhram and whoever had assumed the Ihram \nfor `Umra and brought the Hadi should not finish the Ihram till he has slaughtered his Hadi and \nwhoever had assumed the lhram for Hajj should complete his Hajj.\" `Aisha further said, \"I got my \nperiods (menses) and kept on menstruating till the day of `Arafat, and I had assumed the Ihram for \n`Umra only (Tamattu`). The Prophet (ﷺ) ordered me to undo and comb my head hair and assume the \nlhram for Hajj only and leave the `Umra. I did the same till I completed the Hajj. Then the Prophet (ﷺ) \nsent `Abdur Rahman bin Abi Bakr with me and ordered me to perform `Umra from at-Tan`im in lieu \nof the missed `Umra.\"","reference":"Sahih al-Bukhari 319, Book 6, Hadith 24","grade":"","question #":"question #1","question":"What are the different types of Ihram and their requirements during Hajj and Umrah?","id":"bukhari-6-25"},{"hadith-eng":"Fatima bint Abi Hubaish used to have bleeding in between the periods, so she asked the Prophet (ﷺ) about \nit. He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when \nthe (real) menses begins and when it has finished, take a bath and start praying.\"","reference":"Sahih al-Bukhari 320, Book 6, Hadith 25","grade":"","question #":"question #1","question":"What guidance is provided for women experiencing bleeding outside of their menstrual cycle?","id":"bukhari-6-26"},{"hadith-eng":"A woman asked `Aisha, \"Should I offer the prayers that which I did not offer because of menses\" \n`Aisha said, \"Are you from the Huraura' (a town in Iraq?) We were with the Prophet (ﷺ) and used to get \nour periods but he never ordered us to offer them (the Prayers missed during menses).\" `Aisha perhaps \nsaid, \"We did not offer them.\"","reference":"Sahih al-Bukhari 321, Book 6, Hadith 26","grade":"","question #":"question #1","question":"What is the ruling on making up missed prayers due to menstruation in Islam?","id":"bukhari-6-27"},{"hadith-eng":"Um-Salama said, \"I got my menses while I was lying with the Prophet (ﷺ) under a woolen sheet. So I \nslipped away, took the clothes for menses and put them on. Allah's Messenger (ﷺ) said, 'Have you got your \nmenses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um \nSalama further said, \"The Prophet (ﷺ) used to kiss me while he was fasting. The Prophet (ﷺ) and I used to \ntake the bath of Janaba from a single pot.\"","reference":"Sahih al-Bukhari 322, Book 6, Hadith 27","grade":"","question #":"question #1","question":"What does this narration teach about the interaction between spouses during menstruation?","id":"bukhari-6-28"},{"hadith-eng":"While I was lying with the Prophet (ﷺ) under a woolen sheet, I got my menses. I slipped away and put on \nthe clothes for menses. The Prophet (ﷺ) said, \"Have you got your menses?\" I replied, \"Yes.\" He called me \nand I slept with him under the woolen sheet.","reference":"Sahih al-Bukhari 323, Book 6, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of maintaining closeness and affection between spouses during menstruation in Islam?","id":"bukhari-6-29"},{"hadith-eng":"Hafsa said, 'We used to forbid our young women to go out for the two `Id prayers. A woman came \nand stayed at the palace of Bani Khalaf and she narrated about her sister whose husband took part in \ntwelve holy battles along with the Prophet (ﷺ) and her sister was with her husband in six (out of these \ntwelve). She (the woman's sister) said, \"We used to treat the wounded, look after the patients and once \nI asked the Prophet, 'Is there any harm for any of us to stay at home if she doesn't have a veil?' He \nsaid, 'She should cover herself with the veil of her companion and should participate in the good deeds \nand in the religious gathering of the Muslims.' When Um `Atiya came I asked her whether she had \nheard it from the Prophet. She replied, \"Yes. May my father be sacrificed for him (the Prophet)! \n(Whenever she mentioned the Prophet (ﷺ) she used to say, 'May my father be sacrificed for him) I have \nheard the Prophet (ﷺ) saying, 'The unmarried young virgins and the mature girl who stay often screened or \nthe young unmarried virgins who often stay screened and the menstruating women should come out \nand participate in the good deeds as well as the religious gathering of the faithful believers but the \nmenstruating women should keep away from the Musalla (praying place).' \" Hafsa asked Um `Atiya \nsurprisingly, \"Do you say the menstruating women?\" She replied, \"Doesn't a menstruating woman \nattend `Arafat (Hajj) and such and such (other deeds)?\"","reference":"Sahih al-Bukhari 324, Book 6, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of women participating in religious gatherings and good deeds in Islam?","id":"bukhari-6-30"},{"hadith-eng":"Fatima bint Abi Hubaish asked the Prophet, \"I got persistent bleeding (in between the periods) and do \nnot become clean. Shall I give up prayers?\" He replied, \"No, this is from a blood vessel. Give up the \nprayers only for the days on which you usually get the menses and then take a bath and offer your \nprayers.\"","reference":"Sahih al-Bukhari 325, Book 6, Hadith 30","grade":"","question #":"question #1","question":"What guidance is provided for women experiencing irregular bleeding regarding their prayer obligations?","id":"bukhari-6-31"},{"hadith-eng":"We never considered yellowish discharge as a thing of importance (as menses).","reference":"Sahih al-Bukhari 326, Book 6, Hadith 31","grade":"","question #":"question #1","question":"How is yellowish discharge viewed in relation to menstrual periods in Islamic jurisprudence?","id":"bukhari-6-32"},{"hadith-eng":"(the wife of the Prophet) Um Habiba got bleeding in between the periods for seven years. She asked \nAllah's Messenger (ﷺ) about it. He ordered her to take a bath (after the termination of actual periods) and \nadded that it was (from) a blood vessel. So she used to take a bath for every prayer.","reference":"Sahih al-Bukhari 327, Book 6, Hadith 32","grade":"","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide for women experiencing bleeding outside of their regular menstrual cycle?","id":"bukhari-6-33"},{"hadith-eng":"(the wife of the Prophet) I told Allah's Messenger (ﷺ) that Safiya bint Huyai had got her menses. He said, \n\"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that \nthe Prophet (ﷺ) told her to depart.","reference":"Sahih al-Bukhari 328, Book 6, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of performing Tawaf al-Ifada during Hajj?","id":"bukhari-6-34"},{"hadith-eng":"A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar \r\nformerly used to say that she should not leave but later on I heard him saying, \"She may leave, since \r\nAllah's Messenger (ﷺ) gave them the permission to leave (after Tawaf-Al-Ifada).\"","reference":"Sahih al-Bukhari 329, 330, Book 6, Hadith 34","grade":"","question #":"question #1","question":"What is the ruling regarding a woman leaving after performing Tawaf-Al-Ifada if she experiences menstruation?","id":"bukhari-6-35"},{"hadith-eng":"A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar \r\nformerly used to say that she should not leave but later on I heard him saying, \"She may leave, since \r\nAllah's Messenger (ﷺ) gave them the permission to leave (after Tawaf-Al-Ifada).\"","reference":"Sahih al-Bukhari 329, 330, Book 6, Hadith 34","grade":"","question #":"question #1","question":"What is the ruling for a woman who gets her menses after performing Tawaf-Al-Ifada during Hajj?","id":"bukhari-6-36"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Give up the prayer when your menses begin and when it has finished, wash \nthe blood off your body (take a bath) and start praying.\"","reference":"Sahih al-Bukhari 331, Book 6, Hadith 35","grade":"","question #":"question #1","question":"What are the guidelines for women regarding prayer during their menstrual cycle?","id":"bukhari-6-37"},{"hadith-eng":"The Prophet (ﷺ) offered the funeral prayer for the dead body of a woman who died during delivery \r\n(i.e. childbirth) and he stood by the middle of her body.","reference":"Sahih al-Bukhari 332, Book 6, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of the funeral prayer in Islam, especially for those who die during childbirth?","id":"bukhari-6-38"},{"hadith-eng":"(the wife of the Prophet) During my menses, I never prayed, but used to sit on the mat beside the \nmosque of Allah's Messenger (ﷺ). He used to offer the prayer on his sheet and in prostration some of his \nclothes used to touch me.\"","reference":"Sahih al-Bukhari 333, Book 6, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of a woman's role and presence during her menses in the context of Islamic practices?","id":"bukhari-6-39"},{"hadith-eng":"`Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a \nplace six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He \nsaid 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing \nwhich Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the \nexception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Messenger (ﷺ) \nsacrificed cows on behalf of his wives.\"","reference":"Sahih al-Bukhari 294, Book 6, Hadith 1","grade":"","question #":"question #2","question":"How does Islam address the natural occurrences in women's lives, such as menstruation, during religious obligations?","id":"bukhari-6-40"},{"hadith-eng":"While in menses, I used to comb the hair of Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 295, Book 6, Hadith 2","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) interact with his wives during their menstrual periods?","id":"bukhari-6-41"},{"hadith-eng":"A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" \nI replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person \nto do the same. `Aisha told me that she used to comb the hair of Allah's Messenger (ﷺ) while she was in her \nmenses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she \nwould comb his hair, while she used to be in her menses.\"","reference":"Sahih al-Bukhari 296, Book 6, Hadith 3","grade":"","question #":"question #2","question":"How did Aisha assist the Prophet Muhammad (ﷺ) during her menses while he was in I'tikaf?","id":"bukhari-6-42"},{"hadith-eng":"The Prophet (ﷺ) used to lean on my lap and recite Qur'an while I was in menses.","reference":"Sahih al-Bukhari 297, Book 6, Hadith 4","grade":"","question #":"question #2","question":"How does this narration reflect the relationship between the Prophet and his wives during their menstrual periods?","id":"bukhari-6-43"},{"hadith-eng":"While I was laying with the Prophet (ﷺ) under a single woolen sheet, I got the menses. I slipped away and \nput on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then \ncalled me and made me lie with him under the same sheet.","reference":"Sahih al-Bukhari 298, Book 6, Hadith 5","grade":"","question #":"question #2","question":"How does this narration reflect the Prophet's attitude towards natural bodily functions?","id":"bukhari-6-44"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #2","question":"How does this narration illustrate the Prophet's (ﷺ) approach to personal hygiene and cleanliness?","id":"bukhari-6-45"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #2","question":"What practices did the Prophet Muhammad (ﷺ) follow regarding personal hygiene and bathing with his spouse?","id":"bukhari-6-46"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #2","question":"What practices did the Prophet Muhammad (ﷺ) follow regarding personal hygiene and cleanliness with his spouse?","id":"bukhari-6-47"},{"hadith-eng":"(on the authority of his father) `Aisha said: \"Whenever Allah's Messenger (ﷺ) wanted to fondle anyone of us \nduring her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha \nadded, \"None of you could control his sexual desires as the Prophet (ﷺ) could.\"","reference":"Sahih al-Bukhari 302, Book 6, Hadith 7","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate self-control in matters of sexual desires?","id":"bukhari-6-48"},{"hadith-eng":"When ever Allah's Messenger (ﷺ) wanted to fondle any of his wives during the periods (menses), he used to \nask her to wear an Izar.","reference":"Sahih al-Bukhari 303, Book 6, Hadith 8","grade":"","question #":"question #2","question":"How does Islamic teaching address physical intimacy between spouses during menstruation?","id":"bukhari-6-49"},{"hadith-eng":"Once Allah's Messenger (ﷺ) went out to the Musalla (to offer the prayer) of `Id-al-Adha or Al-Fitr prayer. \nThen he passed by the women and said, \"O women! Give alms, as I have seen that the majority of the \ndwellers of Hell-fire were you (women).\" They asked, \"Why is it so, O Allah's Messenger (ﷺ) ?\" He replied, \n\"You curse frequently and are ungrateful to your husbands. I have not seen anyone more deficient in \nintelligence and religion than you. A cautious sensible man could be led astray by some of you.\" The \nwomen asked, \"O Allah's Messenger (ﷺ)! What is deficient in our intelligence and religion?\" He said, \"Is not \nthe evidence of two women equal to the witness of one man?\" They replied in the affirmative. He \nsaid, \"This is the deficiency in her intelligence. Isn't it true that a woman can neither pray nor fast \nduring her menses?\" The women replied in the affirmative. He said, \"This is the deficiency in her \nreligion.\"","reference":"Sahih al-Bukhari 304, Book 6, Hadith 9","grade":"","question #":"question #2","question":"How does the concept of deficiency in intelligence and religion relate to women in Islamic teachings?","id":"bukhari-6-50"},{"hadith-eng":"We set out with the Prophet (ﷺ) for Hajj and when we reached Sarif I got my menses. When the Prophet (ﷺ) \ncame to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed \nHajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is \nthe thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do \nexcept that you do not perform the Tawaf round the Ka`ba till you are clean.\"","reference":"Sahih al-Bukhari 305, Book 6, Hadith 10","grade":"","question #":"question #2","question":"How does the hadith address the emotional concerns of women regarding religious obligations during menstruation?","id":"bukhari-6-51"},{"hadith-eng":"Fatima bint Abi Hubaish said to Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! I do not become clean (from \nbleeding). Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied: \"No, because it is from a blood vessel \nand not the menses. So when the real menses begins give up your prayers and when it (the period) has \nfinished wash the blood off your body (take a bath) and offer your prayers.\"","reference":"Sahih al-Bukhari 306, Book 6, Hadith 11","grade":"","question #":"question #2","question":"How can one differentiate between menstrual and non-menstrual bleeding in Islamic jurisprudence?","id":"bukhari-6-52"},{"hadith-eng":"A woman asked Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! What should we do, if the blood of menses falls \non our clothes?\" Allah's Messenger (ﷺ) replied, \"If the blood of menses falls on the garment of anyone of \nyou, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).","reference":"Sahih al-Bukhari 307, Book 6, Hadith 12","grade":"","question #":"question #2","question":"How does the process of cleaning menstrual blood from garments affect the validity of prayer?","id":"bukhari-6-53"},{"hadith-eng":"Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot \nand rub the blood off her garment, and pour water over it and wash that portion thoroughly and \nsprinkle water over the rest of the garment. After that she would pray in (with) it.","reference":"Sahih al-Bukhari 308, Book 6, Hadith 13","grade":"","question #":"question #2","question":"How did the companions of the Prophet handle their garments after menstruation to ensure cleanliness for prayer?","id":"bukhari-6-54"},{"hadith-eng":"Once one of the wives of the Prophet (ﷺ) did I`tikaf along with him and she was getting bleeding in \nbetween her periods. She used to see the blood (from her private parts) and she would perhaps put a \ndish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower \nand said, \"It looks like what so and so used to have.\")","reference":"Sahih al-Bukhari 309, Book 6, Hadith 14","grade":"","question #":"question #2","question":"How did the wives of the Prophet (ﷺ) manage their religious duties during times of bleeding?","id":"bukhari-6-55"},{"hadith-eng":"\"One of the wives of Allah's Messenger (ﷺ) joined him in I`tikaf and she noticed blood and yellowish \ndischarge (from her private parts) and put a dish under her when she prayed.\"","reference":"Sahih al-Bukhari 310, Book 6, Hadith 15","grade":"","question #":"question #2","question":"How should women manage their prayers during menstruation or irregular bleeding?","id":"bukhari-6-56"},{"hadith-eng":"One of the mothers of the faithful believers (i.e. the wives of the Prophet (ﷺ) ) did I`tikaf while she was \nhaving bleeding in between her periods.","reference":"Sahih al-Bukhari 311, Book 6, Hadith 16","grade":"","question #":"question #2","question":"How does the practice of I'tikaf reflect the devotion of the wives of the Prophet (ﷺ)?","id":"bukhari-6-57"},{"hadith-eng":"None of us had more than a single garment and we used to have our menses while wearing it. \nWhenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the \nblood with our nails.","reference":"Sahih al-Bukhari 312, Book 6, Hadith 17","grade":"","question #":"question #2","question":"What methods were used historically to clean garments stained with menstrual blood?","id":"bukhari-6-58"},{"hadith-eng":"We were forbidden to mourn for a dead person for more than three days except in the case of a \nhusband for whom mourning was allowed for four months and ten days. (During that time) we were \nnot allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored \nclothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed \nvery light perfumes at the time of taking a bath after menses and also we were forbidden to go with \nthe funeral procession .","reference":"Sahih al-Bukhari 313, Book 6, Hadith 18","grade":"","question #":"question #2","question":"What restrictions are placed on women during the mourning period in terms of personal grooming and attire?","id":"bukhari-6-59"},{"hadith-eng":"A woman asked the Prophet (ﷺ) about the bath which is taken after finishing from the menses. The Prophet (ﷺ) \ntold her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman \nasked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled \nher to myself and said, \"Rub the place soiled with blood with it.\"","reference":"Sahih al-Bukhari 314, Book 6, Hadith 19","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) guide women regarding purification after their menstrual cycle?","id":"bukhari-6-60"},{"hadith-eng":"An Ansari woman asked the Prophet (ﷺ) how to take a bath after finishing from the menses. He replied, \n\"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet (ﷺ) felt \nshy and turned his face. So I pulled her to me and told her what the Prophet (ﷺ) meant.","reference":"Sahih al-Bukhari 315, Book 6, Hadith 20","grade":"","question #":"question #2","question":"How does modesty play a role in the communication of sensitive topics in Islamic teachings?","id":"bukhari-6-61"},{"hadith-eng":"In the last Hajj of Allah's Messenger (ﷺ) I assumed the Ihram for Hajj along with Allah Apostle. I was one of \nthose who intended Tamattu` (to perform Hajj and `Umra) and did not take the Hadi (animal for \nsacrifice) with me. I got my menses and was not clean till the night of `Arafa I said, \"O Allah's \nApostle! It is the night of the day of `Arafat and I intended to perform the Hajj Tamattu` with `Umra. \nAllah's Messenger (ﷺ) told me to undo my hair and comb it and to postpone the `Umra. I did the same and \ncompleted the Hajj. On the night of Al-Hasba (i.e. place outside Mecca where the pilgrims go after \nfinishing all the ceremonies of Hajj at Mina) he (the Prophet) ordered `Abdur Rahman (`Aisha's brother) \nto take me to at-Tan`im to assume the lhram for `Umra in lieu of that of Hajj-at-Tamattu` which I had \nintended to perform.","reference":"Sahih al-Bukhari 316, Book 6, Hadith 21","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) guide Aisha when she was unable to perform Umra due to her menses during Hajj?","id":"bukhari-6-62"},{"hadith-eng":"On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Messenger (ﷺ) said, \"Any \none who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I \nwould have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others \nassumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and \nkept on menstruating until the day of `Arafat and complained of that to the Prophet. He told me to \npostpone my `Umra, undo and comb my hair, and to assume the Ihram of Hajj and I did so. On the \nnight of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I \nassumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, \nfasting or alms were required.","reference":"Sahih al-Bukhari 317, Book 6, Hadith 22","grade":"","question #":"question #2","question":"How should a woman proceed with her pilgrimage if she experiences menstruation during Hajj?","id":"bukhari-6-63"},{"hadith-eng":"The Prophet (ﷺ) said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O \nLord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel \nasks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision \nbe? And what will his age be?' So all that is written while the child is still in the mother's womb.\"","reference":"Sahih al-Bukhari 318, Book 6, Hadith 23","grade":"","question #":"question #2","question":"How is the destiny of a child, including gender and lifespan, determined in the womb according to Islamic belief?","id":"bukhari-6-64"},{"hadith-eng":"`Aisha said, \"We set out with the Prophet (ﷺ) in his last Hajj. Some of us intended to perform `Umra \nwhile others Hajj. When we reached Mecca, Allah's Messenger (ﷺ) said, 'Those who had assumed the lhram \nfor `Umra and had not brought the Hadi should finish his lhram and whoever had assumed the Ihram \nfor `Umra and brought the Hadi should not finish the Ihram till he has slaughtered his Hadi and \nwhoever had assumed the lhram for Hajj should complete his Hajj.\" `Aisha further said, \"I got my \nperiods (menses) and kept on menstruating till the day of `Arafat, and I had assumed the Ihram for \n`Umra only (Tamattu`). The Prophet (ﷺ) ordered me to undo and comb my head hair and assume the \nlhram for Hajj only and leave the `Umra. I did the same till I completed the Hajj. Then the Prophet (ﷺ) \nsent `Abdur Rahman bin Abi Bakr with me and ordered me to perform `Umra from at-Tan`im in lieu \nof the missed `Umra.\"","reference":"Sahih al-Bukhari 319, Book 6, Hadith 24","grade":"","question #":"question #2","question":"How should one handle the situation of menstruation during the pilgrimage rituals?","id":"bukhari-6-65"},{"hadith-eng":"Fatima bint Abi Hubaish used to have bleeding in between the periods, so she asked the Prophet (ﷺ) about \nit. He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when \nthe (real) menses begins and when it has finished, take a bath and start praying.\"","reference":"Sahih al-Bukhari 320, Book 6, Hadith 25","grade":"","question #":"question #2","question":"How should a woman determine when to stop and resume prayers in relation to her menstrual cycle?","id":"bukhari-6-66"},{"hadith-eng":"A woman asked `Aisha, \"Should I offer the prayers that which I did not offer because of menses\" \n`Aisha said, \"Are you from the Huraura' (a town in Iraq?) We were with the Prophet (ﷺ) and used to get \nour periods but he never ordered us to offer them (the Prayers missed during menses).\" `Aisha perhaps \nsaid, \"We did not offer them.\"","reference":"Sahih al-Bukhari 321, Book 6, Hadith 26","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) handle missed prayers during menstruation?","id":"bukhari-6-67"},{"hadith-eng":"Um-Salama said, \"I got my menses while I was lying with the Prophet (ﷺ) under a woolen sheet. So I \nslipped away, took the clothes for menses and put them on. Allah's Messenger (ﷺ) said, 'Have you got your \nmenses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um \nSalama further said, \"The Prophet (ﷺ) used to kiss me while he was fasting. The Prophet (ﷺ) and I used to \ntake the bath of Janaba from a single pot.\"","reference":"Sahih al-Bukhari 322, Book 6, Hadith 27","grade":"","question #":"question #2","question":"How does this narration illustrate the Prophet's (ﷺ) approach to fasting and marital affection?","id":"bukhari-6-68"},{"hadith-eng":"While I was lying with the Prophet (ﷺ) under a woolen sheet, I got my menses. I slipped away and put on \nthe clothes for menses. The Prophet (ﷺ) said, \"Have you got your menses?\" I replied, \"Yes.\" He called me \nand I slept with him under the woolen sheet.","reference":"Sahih al-Bukhari 323, Book 6, Hadith 28","grade":"","question #":"question #2","question":"How does Islam address the natural occurrence of menstruation in the context of marital relationships?","id":"bukhari-6-69"},{"hadith-eng":"Hafsa said, 'We used to forbid our young women to go out for the two `Id prayers. A woman came \nand stayed at the palace of Bani Khalaf and she narrated about her sister whose husband took part in \ntwelve holy battles along with the Prophet (ﷺ) and her sister was with her husband in six (out of these \ntwelve). She (the woman's sister) said, \"We used to treat the wounded, look after the patients and once \nI asked the Prophet, 'Is there any harm for any of us to stay at home if she doesn't have a veil?' He \nsaid, 'She should cover herself with the veil of her companion and should participate in the good deeds \nand in the religious gathering of the Muslims.' When Um `Atiya came I asked her whether she had \nheard it from the Prophet. She replied, \"Yes. May my father be sacrificed for him (the Prophet)! \n(Whenever she mentioned the Prophet (ﷺ) she used to say, 'May my father be sacrificed for him) I have \nheard the Prophet (ﷺ) saying, 'The unmarried young virgins and the mature girl who stay often screened or \nthe young unmarried virgins who often stay screened and the menstruating women should come out \nand participate in the good deeds as well as the religious gathering of the faithful believers but the \nmenstruating women should keep away from the Musalla (praying place).' \" Hafsa asked Um `Atiya \nsurprisingly, \"Do you say the menstruating women?\" She replied, \"Doesn't a menstruating woman \nattend `Arafat (Hajj) and such and such (other deeds)?\"","reference":"Sahih al-Bukhari 324, Book 6, Hadith 29","grade":"","question #":"question #2","question":"How should women who do not have a veil manage their participation in religious events according to Islamic teachings?","id":"bukhari-6-70"},{"hadith-eng":"Fatima bint Abi Hubaish asked the Prophet, \"I got persistent bleeding (in between the periods) and do \nnot become clean. Shall I give up prayers?\" He replied, \"No, this is from a blood vessel. Give up the \nprayers only for the days on which you usually get the menses and then take a bath and offer your \nprayers.\"","reference":"Sahih al-Bukhari 325, Book 6, Hadith 30","grade":"","question #":"question #2","question":"How should a woman distinguish between menstrual bleeding and other types of bleeding in terms of religious duties?","id":"bukhari-6-71"},{"hadith-eng":"We never considered yellowish discharge as a thing of importance (as menses).","reference":"Sahih al-Bukhari 326, Book 6, Hadith 31","grade":"","question #":"question #2","question":"What are the implications of considering certain discharges as insignificant in the context of menstruation?","id":"bukhari-6-72"},{"hadith-eng":"(the wife of the Prophet) Um Habiba got bleeding in between the periods for seven years. She asked \nAllah's Messenger (ﷺ) about it. He ordered her to take a bath (after the termination of actual periods) and \nadded that it was (from) a blood vessel. So she used to take a bath for every prayer.","reference":"Sahih al-Bukhari 327, Book 6, Hadith 32","grade":"","question #":"question #2","question":"How did Um Habiba manage her prayers during the period of irregular bleeding?","id":"bukhari-6-73"},{"hadith-eng":"(the wife of the Prophet) I told Allah's Messenger (ﷺ) that Safiya bint Huyai had got her menses. He said, \n\"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that \nthe Prophet (ﷺ) told her to depart.","reference":"Sahih al-Bukhari 328, Book 6, Hadith 33","grade":"","question #":"question #2","question":"How does menstruation affect the rituals of Hajj for women?","id":"bukhari-6-74"},{"hadith-eng":"A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar \r\nformerly used to say that she should not leave but later on I heard him saying, \"She may leave, since \r\nAllah's Messenger (ﷺ) gave them the permission to leave (after Tawaf-Al-Ifada).\"","reference":"Sahih al-Bukhari 329, 330, Book 6, Hadith 34","grade":"","question #":"question #2","question":"How did the understanding of Ibn `Umar regarding a woman's departure after Tawaf-Al-Ifada change over time?","id":"bukhari-6-75"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Give up the prayer when your menses begin and when it has finished, wash \nthe blood off your body (take a bath) and start praying.\"","reference":"Sahih al-Bukhari 331, Book 6, Hadith 35","grade":"","question #":"question #2","question":"What steps should be taken by women to resume prayer after menstruation?","id":"bukhari-6-76"},{"hadith-eng":"The Prophet (ﷺ) offered the funeral prayer for the dead body of a woman who died during delivery \r\n(i.e. childbirth) and he stood by the middle of her body.","reference":"Sahih al-Bukhari 332, Book 6, Hadith 36","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) conduct the funeral prayer for a woman who died during childbirth?","id":"bukhari-6-77"},{"hadith-eng":"(the wife of the Prophet) During my menses, I never prayed, but used to sit on the mat beside the \nmosque of Allah's Messenger (ﷺ). He used to offer the prayer on his sheet and in prostration some of his \nclothes used to touch me.\"","reference":"Sahih al-Bukhari 333, Book 6, Hadith 37","grade":"","question #":"question #2","question":"How does the proximity of a menstruating woman to a place of prayer reflect on her participation in religious life?","id":"bukhari-6-78"},{"hadith-eng":"`Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a \nplace six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He \nsaid 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing \nwhich Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the \nexception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Messenger (ﷺ) \nsacrificed cows on behalf of his wives.\"","reference":"Sahih al-Bukhari 294, Book 6, Hadith 1","grade":"","question #":"question #3","question":"What actions are permissible for a pilgrim who is unable to perform Tawaf due to menstruation?","id":"bukhari-6-79"},{"hadith-eng":"While in menses, I used to comb the hair of Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 295, Book 6, Hadith 2","grade":"","question #":"question #3","question":"What does this narration indicate about the personal grooming habits of the Prophet (ﷺ)?","id":"bukhari-6-80"},{"hadith-eng":"A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" \nI replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person \nto do the same. `Aisha told me that she used to comb the hair of Allah's Messenger (ﷺ) while she was in her \nmenses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she \nwould comb his hair, while she used to be in her menses.\"","reference":"Sahih al-Bukhari 296, Book 6, Hadith 3","grade":"","question #":"question #3","question":"What does this narration indicate about the interaction between men and women during menses in Islam?","id":"bukhari-6-81"},{"hadith-eng":"The Prophet (ﷺ) used to lean on my lap and recite Qur'an while I was in menses.","reference":"Sahih al-Bukhari 297, Book 6, Hadith 4","grade":"","question #":"question #3","question":"What can be inferred about the physical proximity between spouses during menstruation from this narration?","id":"bukhari-6-82"},{"hadith-eng":"While I was laying with the Prophet (ﷺ) under a single woolen sheet, I got the menses. I slipped away and \nput on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then \ncalled me and made me lie with him under the same sheet.","reference":"Sahih al-Bukhari 298, Book 6, Hadith 5","grade":"","question #":"question #3","question":"What can be learned about the permissibility of physical closeness between spouses during menstruation from this narration?","id":"bukhari-6-83"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #3","question":"What can be learned from this narration about the interactions between the Prophet (ﷺ) and his wives during I`tikaf?","id":"bukhari-6-84"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) involve his wife in his personal care during I`tikaf?","id":"bukhari-6-85"},{"hadith-eng":"The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).","reference":"Sahih al-Bukhari 299, 300, 301, Book 6, Hadith 6","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) involve his wife in daily activities during her menstrual cycle?","id":"bukhari-6-86"},{"hadith-eng":"(on the authority of his father) `Aisha said: \"Whenever Allah's Messenger (ﷺ) wanted to fondle anyone of us \nduring her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha \nadded, \"None of you could control his sexual desires as the Prophet (ﷺ) could.\"","reference":"Sahih al-Bukhari 302, Book 6, Hadith 7","grade":"","question #":"question #3","question":"What is the significance of wearing an Izar during certain intimate interactions according to Islamic teachings?","id":"bukhari-6-87"},{"hadith-eng":"When ever Allah's Messenger (ﷺ) wanted to fondle any of his wives during the periods (menses), he used to \nask her to wear an Izar.","reference":"Sahih al-Bukhari 303, Book 6, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of wearing an Izar in the context of marital relations during menstruation?","id":"bukhari-6-88"},{"hadith-eng":"Once Allah's Messenger (ﷺ) went out to the Musalla (to offer the prayer) of `Id-al-Adha or Al-Fitr prayer. \nThen he passed by the women and said, \"O women! Give alms, as I have seen that the majority of the \ndwellers of Hell-fire were you (women).\" They asked, \"Why is it so, O Allah's Messenger (ﷺ) ?\" He replied, \n\"You curse frequently and are ungrateful to your husbands. I have not seen anyone more deficient in \nintelligence and religion than you. A cautious sensible man could be led astray by some of you.\" The \nwomen asked, \"O Allah's Messenger (ﷺ)! What is deficient in our intelligence and religion?\" He said, \"Is not \nthe evidence of two women equal to the witness of one man?\" They replied in the affirmative. He \nsaid, \"This is the deficiency in her intelligence. Isn't it true that a woman can neither pray nor fast \nduring her menses?\" The women replied in the affirmative. He said, \"This is the deficiency in her \nreligion.\"","reference":"Sahih al-Bukhari 304, Book 6, Hadith 9","grade":"","question #":"question #3","question":"What is the significance of giving alms in relation to the warnings given to women by the Prophet Muhammad (ﷺ)?","id":"bukhari-6-89"},{"hadith-eng":"We set out with the Prophet (ﷺ) for Hajj and when we reached Sarif I got my menses. When the Prophet (ﷺ) \ncame to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed \nHajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is \nthe thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do \nexcept that you do not perform the Tawaf round the Ka`ba till you are clean.\"","reference":"Sahih al-Bukhari 305, Book 6, Hadith 10","grade":"","question #":"question #3","question":"What are the specific restrictions for women on Hajj when they are menstruating?","id":"bukhari-6-90"},{"hadith-eng":"Fatima bint Abi Hubaish said to Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! I do not become clean (from \nbleeding). Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied: \"No, because it is from a blood vessel \nand not the menses. So when the real menses begins give up your prayers and when it (the period) has \nfinished wash the blood off your body (take a bath) and offer your prayers.\"","reference":"Sahih al-Bukhari 306, Book 6, Hadith 11","grade":"","question #":"question #3","question":"What steps should be taken by a woman to resume prayers after non-menstrual bleeding?","id":"bukhari-6-91"},{"hadith-eng":"A woman asked Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! What should we do, if the blood of menses falls \non our clothes?\" Allah's Messenger (ﷺ) replied, \"If the blood of menses falls on the garment of anyone of \nyou, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).","reference":"Sahih al-Bukhari 307, Book 6, Hadith 12","grade":"","question #":"question #3","question":"What is the significance of cleanliness in Islamic rituals and practices?","id":"bukhari-6-92"},{"hadith-eng":"Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot \nand rub the blood off her garment, and pour water over it and wash that portion thoroughly and \nsprinkle water over the rest of the garment. After that she would pray in (with) it.","reference":"Sahih al-Bukhari 308, Book 6, Hadith 13","grade":"","question #":"question #3","question":"What is the significance of cleanliness in garments for performing prayers in Islam?","id":"bukhari-6-93"},{"hadith-eng":"Once one of the wives of the Prophet (ﷺ) did I`tikaf along with him and she was getting bleeding in \nbetween her periods. She used to see the blood (from her private parts) and she would perhaps put a \ndish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower \nand said, \"It looks like what so and so used to have.\")","reference":"Sahih al-Bukhari 309, Book 6, Hadith 14","grade":"","question #":"question #3","question":"What can be inferred about the practices of cleanliness and purity from this narration?","id":"bukhari-6-94"},{"hadith-eng":"\"One of the wives of Allah's Messenger (ﷺ) joined him in I`tikaf and she noticed blood and yellowish \ndischarge (from her private parts) and put a dish under her when she prayed.\"","reference":"Sahih al-Bukhari 310, Book 6, Hadith 15","grade":"","question #":"question #3","question":"What are the considerations for women participating in I`tikaf while experiencing menstrual or post-menstrual discharge?","id":"bukhari-6-95"},{"hadith-eng":"One of the mothers of the faithful believers (i.e. the wives of the Prophet (ﷺ) ) did I`tikaf while she was \nhaving bleeding in between her periods.","reference":"Sahih al-Bukhari 311, Book 6, Hadith 16","grade":"","question #":"question #3","question":"What are the conditions under which a woman can perform I'tikaf during her menstrual cycle?","id":"bukhari-6-96"},{"hadith-eng":"None of us had more than a single garment and we used to have our menses while wearing it. \nWhenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the \nblood with our nails.","reference":"Sahih al-Bukhari 312, Book 6, Hadith 17","grade":"","question #":"question #3","question":"What does this narration reveal about the living conditions and resourcefulness of early Muslim women?","id":"bukhari-6-97"},{"hadith-eng":"We were forbidden to mourn for a dead person for more than three days except in the case of a \nhusband for whom mourning was allowed for four months and ten days. (During that time) we were \nnot allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored \nclothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed \nvery light perfumes at the time of taking a bath after menses and also we were forbidden to go with \nthe funeral procession .","reference":"Sahih al-Bukhari 313, Book 6, Hadith 18","grade":"","question #":"question #3","question":"What are the exceptions to the mourning period rules for women in Islam?","id":"bukhari-6-98"},{"hadith-eng":"A woman asked the Prophet (ﷺ) about the bath which is taken after finishing from the menses. The Prophet (ﷺ) \ntold her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman \nasked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled \nher to myself and said, \"Rub the place soiled with blood with it.\"","reference":"Sahih al-Bukhari 314, Book 6, Hadith 19","grade":"","question #":"question #3","question":"What role does personal guidance play in understanding religious practices related to purification?","id":"bukhari-6-99"},{"hadith-eng":"An Ansari woman asked the Prophet (ﷺ) how to take a bath after finishing from the menses. He replied, \n\"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet (ﷺ) felt \nshy and turned his face. So I pulled her to me and told her what the Prophet (ﷺ) meant.","reference":"Sahih al-Bukhari 315, Book 6, Hadith 20","grade":"","question #":"question #3","question":"What is the significance of using perfumed substances in the process of purification?","id":"bukhari-6-100"},{"hadith-eng":"In the last Hajj of Allah's Messenger (ﷺ) I assumed the Ihram for Hajj along with Allah Apostle. I was one of \nthose who intended Tamattu` (to perform Hajj and `Umra) and did not take the Hadi (animal for \nsacrifice) with me. I got my menses and was not clean till the night of `Arafa I said, \"O Allah's \nApostle! It is the night of the day of `Arafat and I intended to perform the Hajj Tamattu` with `Umra. \nAllah's Messenger (ﷺ) told me to undo my hair and comb it and to postpone the `Umra. I did the same and \ncompleted the Hajj. On the night of Al-Hasba (i.e. place outside Mecca where the pilgrims go after \nfinishing all the ceremonies of Hajj at Mina) he (the Prophet) ordered `Abdur Rahman (`Aisha's brother) \nto take me to at-Tan`im to assume the lhram for `Umra in lieu of that of Hajj-at-Tamattu` which I had \nintended to perform.","reference":"Sahih al-Bukhari 316, Book 6, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of performing Umra from at-Tan`im for those who missed it during Hajj Tamattu`?","id":"bukhari-6-101"},{"hadith-eng":"On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Messenger (ﷺ) said, \"Any \none who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I \nwould have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others \nassumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and \nkept on menstruating until the day of `Arafat and complained of that to the Prophet. He told me to \npostpone my `Umra, undo and comb my hair, and to assume the Ihram of Hajj and I did so. On the \nnight of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I \nassumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, \nfasting or alms were required.","reference":"Sahih al-Bukhari 317, Book 6, Hadith 22","grade":"","question #":"question #3","question":"What are the requirements for performing `Umra in lieu of a postponed one due to menstruation?","id":"bukhari-6-102"},{"hadith-eng":"The Prophet (ﷺ) said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O \nLord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel \nasks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision \nbe? And what will his age be?' So all that is written while the child is still in the mother's womb.\"","reference":"Sahih al-Bukhari 318, Book 6, Hadith 23","grade":"","question #":"question #3","question":"What aspects of a person's life are predetermined while they are still in the mother's womb?","id":"bukhari-6-103"},{"hadith-eng":"`Aisha said, \"We set out with the Prophet (ﷺ) in his last Hajj. Some of us intended to perform `Umra \nwhile others Hajj. When we reached Mecca, Allah's Messenger (ﷺ) said, 'Those who had assumed the lhram \nfor `Umra and had not brought the Hadi should finish his lhram and whoever had assumed the Ihram \nfor `Umra and brought the Hadi should not finish the Ihram till he has slaughtered his Hadi and \nwhoever had assumed the lhram for Hajj should complete his Hajj.\" `Aisha further said, \"I got my \nperiods (menses) and kept on menstruating till the day of `Arafat, and I had assumed the Ihram for \n`Umra only (Tamattu`). The Prophet (ﷺ) ordered me to undo and comb my head hair and assume the \nlhram for Hajj only and leave the `Umra. I did the same till I completed the Hajj. Then the Prophet (ﷺ) \nsent `Abdur Rahman bin Abi Bakr with me and ordered me to perform `Umra from at-Tan`im in lieu \nof the missed `Umra.\"","reference":"Sahih al-Bukhari 319, Book 6, Hadith 24","grade":"","question #":"question #3","question":"What is the significance of performing Umrah from at-Tan'im as mentioned in the narration?","id":"bukhari-6-104"},{"hadith-eng":"Fatima bint Abi Hubaish used to have bleeding in between the periods, so she asked the Prophet (ﷺ) about \nit. He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when \nthe (real) menses begins and when it has finished, take a bath and start praying.\"","reference":"Sahih al-Bukhari 320, Book 6, Hadith 25","grade":"","question #":"question #3","question":"What is the significance of taking a bath after the menstrual period ends in Islamic practice?","id":"bukhari-6-105"},{"hadith-eng":"A woman asked `Aisha, \"Should I offer the prayers that which I did not offer because of menses\" \n`Aisha said, \"Are you from the Huraura' (a town in Iraq?) We were with the Prophet (ﷺ) and used to get \nour periods but he never ordered us to offer them (the Prayers missed during menses).\" `Aisha perhaps \nsaid, \"We did not offer them.\"","reference":"Sahih al-Bukhari 321, Book 6, Hadith 26","grade":"","question #":"question #3","question":"What can be inferred about the practice of women during the Prophet's time regarding prayers missed due to menstruation?","id":"bukhari-6-106"},{"hadith-eng":"Um-Salama said, \"I got my menses while I was lying with the Prophet (ﷺ) under a woolen sheet. So I \nslipped away, took the clothes for menses and put them on. Allah's Messenger (ﷺ) said, 'Have you got your \nmenses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um \nSalama further said, \"The Prophet (ﷺ) used to kiss me while he was fasting. The Prophet (ﷺ) and I used to \ntake the bath of Janaba from a single pot.\"","reference":"Sahih al-Bukhari 322, Book 6, Hadith 27","grade":"","question #":"question #3","question":"What can be learned from this narration about the practice of taking a bath of Janaba together?","id":"bukhari-6-107"},{"hadith-eng":"While I was lying with the Prophet (ﷺ) under a woolen sheet, I got my menses. I slipped away and put on \nthe clothes for menses. The Prophet (ﷺ) said, \"Have you got your menses?\" I replied, \"Yes.\" He called me \nand I slept with him under the woolen sheet.","reference":"Sahih al-Bukhari 323, Book 6, Hadith 28","grade":"","question #":"question #3","question":"What does this narration imply about the Prophet's (ﷺ) attitude towards menstruation and marital intimacy?","id":"bukhari-6-108"},{"hadith-eng":"Hafsa said, 'We used to forbid our young women to go out for the two `Id prayers. A woman came \nand stayed at the palace of Bani Khalaf and she narrated about her sister whose husband took part in \ntwelve holy battles along with the Prophet (ﷺ) and her sister was with her husband in six (out of these \ntwelve). She (the woman's sister) said, \"We used to treat the wounded, look after the patients and once \nI asked the Prophet, 'Is there any harm for any of us to stay at home if she doesn't have a veil?' He \nsaid, 'She should cover herself with the veil of her companion and should participate in the good deeds \nand in the religious gathering of the Muslims.' When Um `Atiya came I asked her whether she had \nheard it from the Prophet. She replied, \"Yes. May my father be sacrificed for him (the Prophet)! \n(Whenever she mentioned the Prophet (ﷺ) she used to say, 'May my father be sacrificed for him) I have \nheard the Prophet (ﷺ) saying, 'The unmarried young virgins and the mature girl who stay often screened or \nthe young unmarried virgins who often stay screened and the menstruating women should come out \nand participate in the good deeds as well as the religious gathering of the faithful believers but the \nmenstruating women should keep away from the Musalla (praying place).' \" Hafsa asked Um `Atiya \nsurprisingly, \"Do you say the menstruating women?\" She replied, \"Doesn't a menstruating woman \nattend `Arafat (Hajj) and such and such (other deeds)?\"","reference":"Sahih al-Bukhari 324, Book 6, Hadith 29","grade":"","question #":"question #3","question":"What are the guidelines for menstruating women regarding participation in religious gatherings and activities?","id":"bukhari-6-109"},{"hadith-eng":"Fatima bint Abi Hubaish asked the Prophet, \"I got persistent bleeding (in between the periods) and do \nnot become clean. Shall I give up prayers?\" He replied, \"No, this is from a blood vessel. Give up the \nprayers only for the days on which you usually get the menses and then take a bath and offer your \nprayers.\"","reference":"Sahih al-Bukhari 325, Book 6, Hadith 30","grade":"","question #":"question #3","question":"What steps should a woman take after her usual menstrual period ends to resume her prayers?","id":"bukhari-6-110"},{"hadith-eng":"We never considered yellowish discharge as a thing of importance (as menses).","reference":"Sahih al-Bukhari 326, Book 6, Hadith 31","grade":"","question #":"question #3","question":"How does the understanding of menstrual discharges affect women's religious practices in Islam?","id":"bukhari-6-111"},{"hadith-eng":"(the wife of the Prophet) Um Habiba got bleeding in between the periods for seven years. She asked \nAllah's Messenger (ﷺ) about it. He ordered her to take a bath (after the termination of actual periods) and \nadded that it was (from) a blood vessel. So she used to take a bath for every prayer.","reference":"Sahih al-Bukhari 327, Book 6, Hadith 32","grade":"","question #":"question #3","question":"What is the significance of distinguishing between menstrual blood and other types of bleeding in Islamic jurisprudence?","id":"bukhari-6-112"},{"hadith-eng":"(the wife of the Prophet) I told Allah's Messenger (ﷺ) that Safiya bint Huyai had got her menses. He said, \n\"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that \nthe Prophet (ﷺ) told her to depart.","reference":"Sahih al-Bukhari 328, Book 6, Hadith 33","grade":"","question #":"question #3","question":"What considerations are made for women who are menstruating during Hajj?","id":"bukhari-6-113"},{"hadith-eng":"A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar \r\nformerly used to say that she should not leave but later on I heard him saying, \"She may leave, since \r\nAllah's Messenger (ﷺ) gave them the permission to leave (after Tawaf-Al-Ifada).\"","reference":"Sahih al-Bukhari 329, 330, Book 6, Hadith 34","grade":"","question #":"question #3","question":"What permission did the Prophet Muhammad (ﷺ) give to women concerning their departure after Tawaf-Al-Ifada?","id":"bukhari-6-114"},{"hadith-eng":"A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar \r\nformerly used to say that she should not leave but later on I heard him saying, \"She may leave, since \r\nAllah's Messenger (ﷺ) gave them the permission to leave (after Tawaf-Al-Ifada).\"","reference":"Sahih al-Bukhari 329, 330, Book 6, Hadith 34","grade":"","question #":"question #3","question":"What permission did the Prophet Muhammad (ﷺ) give to women regarding their departure after Tawaf-Al-Ifada?","id":"bukhari-6-115"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Give up the prayer when your menses begin and when it has finished, wash \nthe blood off your body (take a bath) and start praying.\"","reference":"Sahih al-Bukhari 331, Book 6, Hadith 35","grade":"","question #":"question #3","question":"How does Islamic teaching address the purification process for women after menstruation?","id":"bukhari-6-116"},{"hadith-eng":"The Prophet (ﷺ) offered the funeral prayer for the dead body of a woman who died during delivery \r\n(i.e. childbirth) and he stood by the middle of her body.","reference":"Sahih al-Bukhari 332, Book 6, Hadith 36","grade":"","question #":"question #3","question":"What is the position of the Imam during the funeral prayer according to Islamic tradition?","id":"bukhari-6-117"},{"hadith-eng":"(the wife of the Prophet) During my menses, I never prayed, but used to sit on the mat beside the \nmosque of Allah's Messenger (ﷺ). He used to offer the prayer on his sheet and in prostration some of his \nclothes used to touch me.\"","reference":"Sahih al-Bukhari 333, Book 6, Hadith 37","grade":"","question #":"question #3","question":"What does this narration imply about the interaction between the Prophet and his wives during their menstrual periods?","id":"bukhari-6-118"}]