[{"hadith-eng":"The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.","reference":"Sahih al-Bukhari 4978, 4979, Book 66, Hadith 1","grade":"","question #":"question #1","question":"How long did the Prophet Muhammad (ﷺ) reside in Mecca and Medina during his prophethood?","id":"bukhari-66-1"},{"hadith-eng":"I was informed that Gabriel came to the Prophet (ﷺ) while Um Salama was with him. Gabriel started \ntalking (to the Prophet). Then the Prophet (ﷺ) asked Um Salama, \"Who is this?\" She replied, \"He is Dihya \n(al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other \nthan him (i.e. Dihya) till I heard the sermon of the Prophet (ﷺ) wherein he informed about the news of \nGabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: \nFrom Usama bin Zaid.","reference":"Sahih al-Bukhari 4980, Book 66, Hadith 2","grade":"","question #":"question #1","question":"How did the companions of the Prophet (ﷺ) perceive the appearance of angels like Gabriel?","id":"bukhari-66-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"Every Prophet was given miracles because of which people believed, but what I \nhave been given, is Divine Inspiration which Allah has revealed to me. So I hope that my followers \nwill outnumber the followers of the other Prophets on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 4981, Book 66, Hadith 3","grade":"","question #":"question #1","question":"What distinguishes the miracles given to Prophet Muhammad from those given to other prophets?","id":"bukhari-66-3"},{"hadith-eng":"Allah sent down His Divine Inspiration to His Apostle continuously and abundantly during the period \npreceding his death till He took him unto Him. That was the period of the greatest part of revelation; \nand Allah's Messenger (ﷺ) died after that.","reference":"Sahih al-Bukhari 4982, Book 66, Hadith 4","grade":"","question #":"question #1","question":"What significance does the period preceding the Prophet's death hold in terms of Divine Revelation?","id":"bukhari-66-4"},{"hadith-eng":"Once the Prophet (ﷺ) fell ill and did not offer the night prayer (Tahajjud prayer) for a night or two. A \nwoman (the wife of Abu Lahab) came to him and said, \"O Muhammad ! I do not see but that your \nSatan has left you.\" Then Allah revealed (Surat-Ad-Duha): \n'By the fore-noon, and by the night when it darkens (or is still); Your Lord has not forsaken you, nor \nhated you.' (93)","reference":"Sahih al-Bukhari 4983, Book 66, Hadith 5","grade":"","question #":"question #1","question":"How did the revelation of Surat Ad-Duha provide reassurance to the Prophet Muhammad (ﷺ) during a time of distress?","id":"bukhari-66-5"},{"hadith-eng":"(The Caliph `Uthman ordered Zaid bin Thabit, Sa`id bin Al-As, `Abdullah bin Az-Zubair and `Abdur- \nRahman bin Al-Harith bin Hisham to write the Qur'an in the form of a book (Mushafs) and said to \nthem. \"In case you disagree with Zaid bin Thabit (Al-Ansari) regarding any dialectic Arabic utterance \nof the Qur'an, then write it in the dialect of Quraish, for the Qur'an was revealed in this dialect.\" So \nthey did it.","reference":"Sahih al-Bukhari 4984, Book 66, Hadith 6","grade":"","question #":"question #1","question":"What was the role of Zaid bin Thabit and his companions in compiling the Qur'an into a book form?","id":"bukhari-66-6"},{"hadith-eng":"Ya`la used to say, \"I wish I could see Allah's Messenger (ﷺ) at the time he is being inspired Divinely.\" When \nthe Prophet (ﷺ) was at Al-Ja'rana and was shaded by a garment hanging over him and some of his \ncompanions were with him, a man perfumed with scent came and said, \"O Allah's Messenger (ﷺ)! What is \nyour opinion regarding a man who assumes Ihram and puts on a cloak after perfuming his body with \nscent?\" The Prophet (ﷺ) waited for a while, and then the Divine Inspiration descended upon him. `Umar \npointed out to Ya`la, telling him to come. Ya`la came and pushed his head (underneath the screen \nwhich was covering the Prophet (ﷺ) ) and behold! The Prophet's face was red and he kept on breathing \nheavily for a while and then he was relieved. Thereupon he said, \"Where is the questioner who asked \nme about `Umra a while ago?\" The man was sought and then was brought before the Prophet (ﷺ) who said \n(to him), \"As regards the scent which you perfumed your body with, you must wash it off thrice, and \nas for your cloak, you must take it off; and then perform in your `Umra all those things which you \nperform in Hajj.\"","reference":"Sahih al-Bukhari 4985, Book 66, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of witnessing the Prophet Muhammad (ﷺ) receiving Divine Inspiration?","id":"bukhari-66-7"},{"hadith-eng":"Abu Bakr As-Siddiq sent for me when the people of Yamama had been killed (i.e., a number of the \nProphet's Companions who fought against Musailima). (I went to him) and found `Umar bin Al- \nKhattab sitting with him. Abu Bakr then said (to me), \"`Umar has come to me and said: \"Casualties \nwere heavy among the Qurra' of the Qur'an (i.e. those who knew the Qur'an by heart) on the day of \nthe Battle of Yamama, and I am afraid that more heavy casualties may take place among the Qurra' \non other battlefields, whereby a large part of the Qur'an may be lost. Therefore I suggest, you (Abu \nBakr) order that the Qur'an be collected.\" I said to `Umar, \"How can you do something which Allah's \nApostle did not do?\" `Umar said, \"By Allah, that is a good project.\" `Umar kept on urging me to \naccept his proposal till Allah opened my chest for it and I began to realize the good in the idea which \n`Umar had realized.\" Then Abu Bakr said (to me). 'You are a wise young man and we do not have any \nsuspicion about you, and you used to write the Divine Inspiration for Allah's Messenger (ﷺ). So you should \nsearch for (the fragmentary scripts of) the Qur'an and collect it in one book.\" By Allah If they had \nordered me to shift one of the mountains, it would not have been heavier for me than this ordering me \nto collect the Qur'an. Then I said to Abu Bakr, \"How will you do something which Allah's Messenger (ﷺ) did \nnot do?\" Abu Bakr replied, \"By Allah, it is a good project.\" Abu Bakr kept on urging me to accept his \nidea until Allah opened my chest for what He had opened the chests of Abu Bakr and `Umar. So I \nstarted looking for the Qur'an and collecting it from (what was written on) palme stalks, thin white \nstones and also from the men who knew it by heart, till I found the last Verse of Surat at-Tauba \n(Repentance) with Abi Khuzaima Al-Ansari, and I did not find it with anybody other than him. The \nVerse is: \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty..(till the end of Surat-Baraa' (at-Tauba) (9.128-129). \nThen the complete manuscripts (copy) of the Qur'an remained with Abu Bakr till he died, then with \n`Umar till the end of his life, and then with Hafsa, the daughter of `Umar.","reference":"Sahih al-Bukhari 4986, Book 66, Hadith 8","grade":"","question #":"question #1","question":"What were the circumstances that led to the decision to compile the Qur'an into a single book?","id":"bukhari-66-8"},{"hadith-eng":"Hudhaifa bin Al-Yaman came to `Uthman at the time when the people of Sham and the people of Iraq \nwere Waging war to conquer Arminya and Adharbijan. Hudhaifa was afraid of their (the people of \nSham and Iraq) differences in the recitation of the Qur'an, so he said to `Uthman, \"O chief of the \nBelievers! Save this nation before they differ about the Book (Qur'an) as Jews and the Christians did \nbefore.\" So `Uthman sent a message to Hafsa saying, \"Send us the manuscripts of the Qur'an so that \nwe may compile the Qur'anic materials in perfect copies and return the manuscripts to you.\" Hafsa \nsent it to `Uthman. `Uthman then ordered Zaid bin Thabit, `Abdullah bin AzZubair, Sa`id bin Al-As \nand `AbdurRahman bin Harith bin Hisham to rewrite the manuscripts in perfect copies. `Uthman said \nto the three Quraishi men, \"In case you disagree with Zaid bin Thabit on any point in the Qur'an, then \nwrite it in the dialect of Quraish, the Qur'an was revealed in their tongue.\" They did so, and when they \nhad written many copies, `Uthman returned the original manuscripts to Hafsa. `Uthman sent to every \nMuslim province one copy of what they had copied, and ordered that all the other Qur'anic materials, \nwhether written in fragmentary manuscripts or whole copies, be burnt.","reference":"Sahih al-Bukhari 4987, Book 66, Hadith 9","grade":"","question #":"question #1","question":"What measures were taken to ensure the uniformity of the Qur'an's recitation among different regions?","id":"bukhari-66-9"},{"hadith-eng":"'Among the Believers are men who have been true in their covenant with Allah.' (33.23)","reference":"Sahih al-Bukhari 4988, Book 66, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of preserving the Quranic text accurately in Islamic tradition?","id":"bukhari-66-10"},{"hadith-eng":"Abu Bakr sent for me and said, \"You used to write the Divine Revelations for Allah's Messenger (ﷺ) : So you \nshould search for (the Qur'an and collect) it.\" I started searching for the Qur'an till I found the last two \nVerses of Surat at-Tauba with Abi Khuza`ima Al-Ansari and I could not find these Verses with \nanybody other than him. (They were): \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty ...' (9.128-129)","reference":"Sahih al-Bukhari 4989, Book 66, Hadith 11","grade":"","question #":"question #1","question":"What was the role of Zaid bin Thabit in the compilation of the Qur'an?","id":"bukhari-66-11"},{"hadith-eng":"There was revealed: 'Not equal are those believers who sit (at home) and those who strive and fight in \nthe Cause of Allah.' (4.95) \nThe Prophet (ﷺ) said, \"Call Zaid for me and let him bring the board, the inkpot and the scapula bone (or \nthe scapula bone and the ink pot).\"' Then he said, \"Write: 'Not equal are those Believers who sit..\", and \nat that time `Amr bin Um Maktum, the blind man was sitting behind the Prophet (ﷺ) . He said, \"O Allah's \nApostle! What is your order For me (as regards the above Verse) as I am a blind man?\" So, instead of \nthe above Verse, the following Verse was revealed: \n'Not equal are those believers who sit (at home) except those who are disabled (by injury or are blind \nor lame etc.) and those who strive and fight in the cause of Allah.' (4.95)","reference":"Sahih al-Bukhari 4990, Book 66, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of striving and fighting in the cause of Allah compared to staying at home?","id":"bukhari-66-12"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Gabriel recited the Qur'an to me in one way. Then I requested him (to read it in \nanother way), and continued asking him to recite it in other ways, and he recited it in several ways till \nhe ultimately recited it in seven different ways.\"","reference":"Sahih al-Bukhari 4991, Book 66, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of the Qur'an being revealed in multiple recitations?","id":"bukhari-66-13"},{"hadith-eng":"I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Messenger (ﷺ) and I \nlistened to his recitation and noticed that he recited in several different ways which Allah's Messenger (ﷺ) \nhad not taught me. I was about to jump over him during his prayer, but I controlled my temper, and \nwhen he had completed his prayer, I put his upper garment around his neck and seized him by it and \nsaid, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to \nme.\" I said, \"You have told a lie, for Allah's Messenger (ﷺ) has taught it to me in a different way from \nyours.\" So I dragged him to Allah's Messenger (ﷺ) and said (to Allah's Messenger (ﷺ)), \n\"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's \nApostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I \nheard him reciting. Then Allah's Messenger (ﷺ) said, \"It was revealed in this way,\" and added, \"Recite, O \n`Umar!\" I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed in this way. This \nQur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier \nfor you (or read as much of it as may be easy for you).","reference":"Sahih al-Bukhari 4992, Book 66, Hadith 14","grade":"","question #":"question #1","question":"What does the hadith teach about the different ways of reciting the Qur'an?","id":"bukhari-66-14"},{"hadith-eng":"While I was with Aisha, the mother of the Believers, a person from Iraq came and asked, \"What type \nof shroud is the best?\" `Aisha said, \"May Allah be merciful to you! What does it matter?\" He said, \"O \nmother of the Believers! Show me (the copy of) your Qur'an,\" She said, \"Why?\" He said, \"In order to \ncompile and arrange the Qur'an according to it, for people recite it with its Suras not in proper order.\" \n`Aisha said, \"What does it matter which part of it you read first? (Be informed) that the first thing that \nwas revealed thereof was a Sura from Al-Mufassal, and in it was mentioned Paradise and the Fire. \nWhen the people embraced Islam, the Verses regarding legal and illegal things were revealed. If the \nfirst thing to be revealed was: 'Do not drink alcoholic drinks.' people would have said, 'We will never \nleave alcoholic drinks,' and if there had been revealed, 'Do not commit illegal sexual intercourse, 'they \nwould have said, 'We will never give up illegal sexual intercourse.' While I was a young girl of \nplaying age, the following Verse was revealed in Mecca to Muhammad: 'Nay! But the Hour is their \nappointed time (for their full recompense), and the Hour will be more grievous and more bitter.' \n(54.46) Sura Al-Baqara (The Cow) and Surat An-Nisa (The Women) were revealed while I was with \nhim.\" Then `Aisha took out the copy of the Qur'an for the man and dictated to him the Verses of the \nSuras (in their proper order) .","reference":"Sahih al-Bukhari 4993, Book 66, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of the order of revelation in understanding the Qur'an?","id":"bukhari-66-15"},{"hadith-eng":"Surat Bani-lsrael, Al-Kahf (The Cave), Maryam, Taha, Al-Anbiya' (The prophets) are amongst my \nfirst earnings and my old property, and (in fact) they are my old property.","reference":"Sahih al-Bukhari 4994, Book 66, Hadith 16","grade":"","question #":"question #1","question":"What significance do the Surahs Bani Isra'il, Al-Kahf, Maryam, Taha, and Al-Anbiya' hold in Islamic teachings?","id":"bukhari-66-16"},{"hadith-eng":"I learnt, 'Glorify the Name of your Lord the Most High' (Surat al-A'la) No 87, before the Prophet (ﷺ) came \n(to Medina) .","reference":"Sahih al-Bukhari 4995, Book 66, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of learning and memorizing Quranic verses before the Prophet's migration to Medina?","id":"bukhari-66-17"},{"hadith-eng":"`Abdullah said, \"I learnt An-Naza'ir which the Prophet (ﷺ) used to recite in pairs in each rak`a.\" Then \n`Abdullah got up and Alqama accompanied him to his house, and when Alqama came out, we asked \nhim (about those Suras). He said, \"They are twenty Suras that start from the beginning of Al- \nMufassal, according to the arrangement done be Ibn Mas`ud, and end with the Suras starting with Ha \nMim, e.g. Ha Mim (the Smoke). and \"About what they question one another?\" (78.1)","reference":"Sahih al-Bukhari 4996, Book 66, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of reciting specific pairs of Suras in each rak`a during prayer?","id":"bukhari-66-18"},{"hadith-eng":"The Prophet (ﷺ) was the most generous person, and he used to become more so (generous) particularly in \nthe month of Ramadan because Gabriel used to meet him every night of the month of Ramadan till it \nelapsed. Allah's Messenger (ﷺ) used to recite the Qur'an for him. When Gabriel met him, he used to become \nmore generous than the fast wind in doing good.","reference":"Sahih al-Bukhari 4997, Book 66, Hadith 19","grade":"","question #":"question #1","question":"How does the presence of Gabriel during Ramadan influence the Prophet's generosity?","id":"bukhari-66-19"},{"hadith-eng":"Gabriel used to repeat the recitation of the Qur'an with the Prophet (ﷺ) once a year, but he repeated it \ntwice with him in the year he died. The Prophet (ﷺ) used to stay in I`tikaf for ten days every year (in the \nmonth of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.","reference":"Sahih al-Bukhari 4998, Book 66, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of Gabriel repeating the recitation of the Qur'an with the Prophet Muhammad (ﷺ) annually?","id":"bukhari-66-20"},{"hadith-eng":"`Abdullah bin `Amr mentioned `Abdullah bin Masud and said, \"I shall ever love that man, for I heard \nthe Prophet (ﷺ) saying, 'Take (learn) the Qur'an from four: `Abdullah bin Masud, Salim, Mu`adh and Ubai \nbin Ka`b.' \"","reference":"Sahih al-Bukhari 4999, Book 66, Hadith 21","grade":"","question #":"question #1","question":"Who were the four companions recommended by the Prophet for learning the Qur'an?","id":"bukhari-66-21"},{"hadith-eng":"Once `Abdullah bin Mas`ud delivered a sermon before us and said, \"By Allah, I learnt over seventy \nSuras direct from Allah's Messenger (ﷺ) . By Allah, the companions of the Prophet (ﷺ) came to know that I am \none of those who know Allah's Book best of all of them, yet I am not the best of them.\" Shaqiq added: \nI sat in his religious gathering and I did not hear anybody opposing him (in his speech).","reference":"Sahih al-Bukhari 5000, Book 66, Hadith 22","grade":"","question #":"question #1","question":"What does this narration suggest about the knowledge and memorization of the Quran among the companions of the Prophet?","id":"bukhari-66-22"},{"hadith-eng":"While we were in the city of Hims (in Syria), Ibn Mas`ud recited Surat Yusuf. A man said to him), \"It \nwas not revealed in this way.\" Then Ibn Mas`ud said, \"I recited it in this way before Allah's Messenger (ﷺ) \nand he confirmed my recitation by saying, 'Well done!' \" Ibn Mas`ud detected the smell of wine from \nthe man's mouth, so he said to him, \"Aren't you ashamed of telling a lie about Allah's Book and (along \nwith this) you drink alcoholic liquors too?\" Then he lashed him according to the law.","reference":"Sahih al-Bukhari 5001, Book 66, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of verifying the authenticity of Quranic recitation?","id":"bukhari-66-23"},{"hadith-eng":"By Allah other than Whom none has the right to be worshipped! There is no Sura revealed in Allah's \nBook but I know at what place it was revealed; and there is no Verse revealed in Allah's Book but I \nknow about whom it was revealed. And if I know that there is somebody who knows Allah's Book \nbetter than I, and he is at a place that camels can reach, I would go to him.","reference":"Sahih al-Bukhari 5002, Book 66, Hadith 24","grade":"","question #":"question #1","question":"What does this narration suggest about the importance of knowledge and understanding of the Quran?","id":"bukhari-66-24"},{"hadith-eng":"I asked Anas bin Malik: \"Who collected the Qur'an at the time of the Prophet (ﷺ) ?\" He replied, \"Four, all \nof whom were from the Ansar: Ubai bin Ka`b, Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid.\"","reference":"Sahih al-Bukhari 5003, Book 66, Hadith 25","grade":"","question #":"question #1","question":"Who were the key individuals responsible for collecting the Qur'an during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-66-25"},{"hadith-eng":"When the Prophet (ﷺ) died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin \nJabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .","reference":"Sahih al-Bukhari 5004, Book 66, Hadith 26","grade":"","question #":"question #1","question":"Who were the individuals known for collecting the Qur'an during the time of the Prophet's death?","id":"bukhari-66-26"},{"hadith-eng":"`Umar said, Ubai was the best of us in the recitation (of the Qur'an) yet we leave some of what he \nrecites.' Ubai says, 'PI have taken it from the mouth of Allah's Messenger (ﷺ) and will not leave for anything \nwhatever.\" But Allah said \"None of Our Revelations do We abrogate or cause to be forgotten but We \nsubstitute something better or similar.\" 2.106","reference":"Sahih al-Bukhari 5005, Book 66, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of abrogation in the Quranic revelation process?","id":"bukhari-66-27"},{"hadith-eng":"While I was praying, the Prophet (ﷺ) called me but I did not respond to his call. Later I said, \"O Allah's \nApostle! I was praying.\" He said, \"Didn't Allah say: 'O you who believe! Give your response to Allah \n(by obeying Him) and to His Apostle when he calls you'?\" (8.24) \nHe then said, \"Shall I not teach you the most superior Surah in the Qur'an?\" He said, '(It is), \n'Praise be to Allah, the Lord of the worlds. ' (i.e., Surat Al-Fatiha) which consists of seven repeatedly \nrecited Verses and the Magnificent Qur'an which was given to me.\"","reference":"Sahih al-Bukhari 5006, Book 66, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of responding to the call of the Prophet in Islam?","id":"bukhari-66-28"},{"hadith-eng":"While we were on one of our journeys, we dismounted at a place where a slave girl came and said, \n\"The chief of this tribe has been stung by a scorpion and our men are not present; is there anybody \namong you who can treat him (by reciting something)?\" Then one of our men went along with her \nthough we did not think that he knew any such treatment. But he treated the chief by reciting \nsomething, and the sick man recovered whereupon he gave him thirty sheep and gave us milk to drink \n(as a reward). When he returned, we asked our friend, \"Did you know how to treat with the recitation \nof something?\" He said, \"No, but I treated him only with the recitation of the Mother of the Book (i.e., \nAl-Fatiha).\" We said, \"Do not say anything (about it) till we reach or ask the Prophet (ﷺ) so when we \nreached Medina, we mentioned that to the Prophet (in order to know whether the sheep which we had \ntaken were lawful to take or not). The Prophet (ﷺ) said, \"How did he come to know that it (Al-Fatiha) \ncould be used for treatment? Distribute your reward and assign for me one share thereof as well.\"","reference":"Sahih al-Bukhari 5007, Book 66, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of using Al-Fatiha for healing in Islamic tradition?","id":"bukhari-66-29"},{"hadith-eng":"Whoever recites two verses ... (text as in the following hadith)","reference":"Sahih al-Bukhari 5008, Book 66, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of reciting specific verses from the Quran in seeking protection or blessings?","id":"bukhari-66-30"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"","reference":"Sahih al-Bukhari 5009, Book 66, Hadith 31","grade":"","question #":"question #1","question":"What is the significance of reciting the last two verses of Surat Al-Baqara at night?","id":"bukhari-66-31"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing from the foodstuff. I caught him and said, \"I will take you to Allah's Messenger (ﷺ)!\" Then Abu Huraira described the whole narration and said: That person said (to me), \"(Please don't take me to Allah's Messenger (ﷺ) and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet (ﷺ) heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"","reference":"Sahih al-Bukhari 5010, Book 66, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of reciting Ayat-al-Kursi before sleeping according to Islamic teachings?","id":"bukhari-66-32"},{"hadith-eng":"A man was reciting Surat Al-Kahf and his horse was tied with two ropes beside him. A cloud came \ndown and spread over that man, and it kept on coming closer and closer to him till his horse started \njumping (as if afraid of something). When it was morning, the man came to the Prophet, and told him \nof that experience. The Prophet (ﷺ) said, \"That was As-Sakina (tranquility) which descended because of \n(the recitation of) the Qur'an.\"","reference":"Sahih al-Bukhari 5011, Book 66, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of tranquility in relation to the recitation of the Qur'an?","id":"bukhari-66-33"},{"hadith-eng":"Allah's Messenger (ﷺ) was traveling on one of his journeys, and `Umar bin Al-Khattab was traveling along \nwith him at night. `Umar asked him about something, but Allah's Messenger (ﷺ) did not answer him. He \nasked again, but he did not answer. He asked for the third time, but he did not answer. On that, `Umar \nsaid to himself, \"May your mother lose you! You have asked Allah's Messenger (ﷺ) three times, but he did \nnot answer at all!\" `Umar said, \"So I made my camel go fast till I was ahead of the people, and I was \nafraid that something might be revealed about me. After a little while I heard a call maker calling me, \nI said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's \nApostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to \nme than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O \nMuhammad), a manifest victory.' \" (Surat al-Fath) No. (48.1).","reference":"Sahih al-Bukhari 5012, Book 66, Hadith 34","grade":"","question #":"question #1","question":"What can be learned about the patience and wisdom of the Prophet Muhammad (ﷺ) when responding to questions?","id":"bukhari-66-34"},{"hadith-eng":"A man heard another man reciting (Surat-Al-Ikhlas) 'Say He is Allah, (the) One.' (112. 1) repeatedly. The next morning he came to Allah's Messenger (ﷺ) and informed him about it as if he thought that it was not enough to recite. On that Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, this Surah is equal to one-third of the Qur'an!\"","reference":"Sahih al-Bukhari 5013, Book 66, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of Surah Al-Ikhlas in the Quran according to Islamic teachings?","id":"bukhari-66-35"},{"hadith-eng":"My brother, Qatada bin An-Nau'man said, \"A man performed the night prayer late at night in the lifetime of the Prophet (ﷺ) and he read: 'Say: He is Allah, (the) One,' (112.1) and read nothing besides that. The next morning a man went to the Prophet (ﷺ) ,~ and told him about that . (The Prophet (ﷺ) replied the same as (in Hadith 532) above.)","reference":"Sahih al-Bukhari 5014, Book 66, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of reciting Surah Al-Ikhlas during prayer?","id":"bukhari-66-36"},{"hadith-eng":"The Prophet (ﷺ) said to his companions, \"Is it difficult for any of you to recite one third of the Qur'an in \none night?\" This suggestion was difficult for them so they said, \"Who among us has the power to do \nso, O Allah's Messenger (ﷺ)?\" Allah Apostle replied: \" Allah (the) One, the Self-Sufficient Master Whom all \ncreatures need.' (Surat Al-Ikhlas 112.1--to the End) is equal to one third of the Qur'an.\"","reference":"Sahih al-Bukhari 5015, Book 66, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of reciting Surah Al-Ikhlas in terms of its equivalence to the Qur'an?","id":"bukhari-66-37"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) became sick, he would recite Mu'awwidhat (Surat Al-Falaq and Surat An- \nNas) and then blow his breath over his body. When he became seriously ill, I used to recite (these two \nSuras) and rub his hands over his body hoping for its blessings.","reference":"Sahih al-Bukhari 5016, Book 66, Hadith 38","grade":"","question #":"question #1","question":"What is the significance of reciting Surah Al-Falaq and Surah An-Nas for protection and healing?","id":"bukhari-66-38"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to bed every night, he used to cup his hands together and blow over it after reciting Surat Al-Ikhlas, Surat Al-Falaq and Surat An-Nas, and then rub his hands over whatever parts of his body he was able to rub, starting with his head, face and front of his body. He used to do that three times.","reference":"Sahih al-Bukhari 5017, Book 66, Hadith 39","grade":"","question #":"question #1","question":"What is the significance of reciting specific Surahs before sleeping in Islamic tradition?","id":"bukhari-66-39"},{"hadith-eng":"That while he was reciting Surat Al-Baqara (The Cow) at night, and his\r\n     horse was tied beside him, the horse was suddenly startled and \r\n     troubled. When he stopped reciting, the horse became quiet, and when \r\n     he started again, the horse was startled again. Then he stopped \r\n     reciting and the horse became quiet too. He started reciting again and\r\n     the horse was startled and troubled once again. Then he stopped \r\n     reciting and his son, Yahya was beside the horse. He was afraid that \r\n     the horse might trample on him. When he took the boy away and looked \r\n     towards the sky, he could not see it. The next morning he informed the\r\n     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn \r\n     Hudair replied, \"O Allah's Messenger (ﷺ)! My son, Yahya was near the horse \r\n     and I was afraid that it might trample on him, so I looked towards the\r\n     sky, and went to him. When I looked at the sky, I saw something like a\r\n     cloud containing what looked like lamps, so I went out in order not to\r\n     see it.\" The Prophet (ﷺ) said, \"Do you know what that was?\" Ibn Hudair \r\n     replied, \"No.\" The Prophet (ﷺ) said, \"Those were Angels who came near to \r\n     you for your voice and if you had kept on reciting till dawn, it would\r\n     have remained there till morning when people would have seen it as it \r\n     would not have disappeared.","reference":"Sahih al-Bukhari 5018, Book 66, Hadith 40","grade":"","question #":"question #1","question":"What is the significance of angels being attracted to the recitation of the Quran?","id":"bukhari-66-40"},{"hadith-eng":"Shaddad bin Ma'qil and I entered upon Ibn `Abbas. Shaddad bin Ma'qil asked him, \"Did the Prophet (ﷺ) \nleave anything (besides the Qur'an)?\" He replied. \"He did not leave anything except what is Between \nthe two bindings (of the Qur'an).\" Then we visited Muhammad bin Al-Hanafiyya and asked him (the \nsame question). He replied, \"The Prophet (ﷺ) did not leave except what is between the bindings (of the \nQur'an).","reference":"Sahih al-Bukhari 5019, Book 66, Hadith 41","grade":"","question #":"question #1","question":"What did the Prophet (ﷺ) leave behind for his followers according to the companions?","id":"bukhari-66-41"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of him (a believer) who recites the Qur'an is like that of a citron \nwhich tastes good and smells good. And he (a believer) who does not recite the Qur'an is like a date \nwhich is good in taste but has no smell. And the example of a dissolute wicked person who recites the \nQur'an is like the Raihana (sweet basil) which smells good but tastes bitter. And the example of a \ndissolute wicked person who does not recite the Qur'an is like the colocynth which tastes bitter and \nhas no smell.","reference":"Sahih al-Bukhari 5020, Book 66, Hadith 42","grade":"","question #":"question #1","question":"How does reciting the Qur'an affect the character and perception of a believer?","id":"bukhari-66-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"Your life in comparison to the lifetime of the past nations is like the period \r\nbetween the time of `Asr prayer and sunset. Your example and the example of the Jews and Christians \r\nis that of person who employed laborers and said to them, \"Who will work for me till the middle of \r\nthe day for one Qirat (a special weight)?' The Jews did. He then said, \"Who will work for me from the \r\nmiddle of the day till the `Asr prayer for one Qirat each?\" The Christians worked accordingly. Then \r\nyou (Muslims) are working from the `Asr prayer till the Maghrib prayer for two Qirats each. They (the \r\nJews and the Christians) said, 'We did more labor but took less wages.' He (Allah) said, 'Have I \r\nwronged you in your rights?' They replied, 'No.' Then He said, 'This is My Blessing which I give to \r\nwhom I wish.\"","reference":"Sahih al-Bukhari 5021, Book 66, Hadith 43","grade":"","question #":"question #1","question":"How does the hadith illustrate the concept of divine justice and distribution of rewards among different communities?","id":"bukhari-66-43"},{"hadith-eng":"I asked `Abdullah bin Abi `Aufa, \"Did the Prophet (ﷺ) make a will (to appoint his successor or bequeath \nwealth)?\" He replied, \"No.\" I said, \"How is it prescribed then for the people to make wills, and they \nare ordered to do so while the Prophet (ﷺ) did not make any will?\" He said, \"He made a will wherein he \nrecommended Allah's Book.\"","reference":"Sahih al-Bukhari 5022, Book 66, Hadith 44","grade":"","question #":"question #1","question":"What is the significance of making a will in Islam, and how is it related to the teachings of the Prophet (ﷺ)?","id":"bukhari-66-44"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a pleasant tone.\" The companion of the sub-narrator (Abu Salama) said, \"It means, reciting \nit aloud.\"","reference":"Sahih al-Bukhari 5023, Book 66, Hadith 45","grade":"","question #":"question #1","question":"What is the significance of reciting the Qur'an in a pleasant tone according to Islamic teachings?","id":"bukhari-66-45"},{"hadith-eng":"The Prophet (ﷺ) I said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a loud and pleasant tone.\" Sufyan said, \"This saying means: a prophet who regards the \nQur'an as something that makes him dispense with many worldly pleasures.\"","reference":"Sahih al-Bukhari 5024, Book 66, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of reciting the Qur'an in a loud and pleasant tone for a prophet?","id":"bukhari-66-46"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Not to wish to be the like except of two men. A man whom Allah has given the \nknowledge of the Book and he recites it during the hours of the night, and a man whom Allah has \ngiven wealth, and he spends it in charity during the night and the hours of the day.\"","reference":"Sahih al-Bukhari 5025, Book 66, Hadith 47","grade":"","question #":"question #1","question":"What are the two qualities or actions that are considered worthy of admiration according to the teachings of Islam?","id":"bukhari-66-47"},{"hadith-eng":"Allah's Messenger (ﷺ) I said, \"Not to wish to be the like of except two men: A man whom Allah has taught \nthe Qur'an and he recites it during the hours of the night and during the hours of the day, and his \nneighbor listens to him and says, 'I wish I had been given what has been given to so-and-so, so that I \nmight do what he does; and a man whom Allah has given wealth and he spends it on what is just and \nright, whereupon an other man May say, 'I wish I had been given what so-and-so has been given, for \nthen I would do what he does.\"","reference":"Sahih al-Bukhari 5026, Book 66, Hadith 48","grade":"","question #":"question #1","question":"What are the two qualities or possessions that one should aspire to have according to Islamic teachings?","id":"bukhari-66-48"},{"hadith-eng":"The Prophet (ﷺ) said, \"The best among you (Muslims) are those who learn the Qur'an and teach it.\"","reference":"Sahih al-Bukhari 5027, Book 66, Hadith 49","grade":"","question #":"question #1","question":"Who are considered the best individuals among Muslims according to Islamic teachings?","id":"bukhari-66-49"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most superior among you (Muslims) are those who learn the Qur'an and teach \nit.\"","reference":"Sahih al-Bukhari 5028, Book 66, Hadith 50","grade":"","question #":"question #1","question":"Who are considered the most superior among Muslims according to Islamic teachings?","id":"bukhari-66-50"},{"hadith-eng":"A lady came to the Prophet (ﷺ) and declared that she had decided to offer herself to Allah and His \nApostle. The Prophet (ﷺ) said, \"I am not in need of women.\" A man said (to the Prophet) \"Please marry \nher to me.\" The Prophet (ﷺ) said (to him), \"Give her a garment.\" The man said, \"I cannot afford it.\" The \nProphet said, \"Give her anything, even if it were an iron ring.\" The man apologized again. The \nProphet then asked him, \"What do you know by heart of the Qur'an?\" He replied, \"I know such-andsuch \nportion of the Qur'an (by heart).\" The Prophet (ﷺ) said, \"Then I marry her to you for that much of the \nQur'an which you know by heart.\"","reference":"Sahih al-Bukhari 5029, Book 66, Hadith 51","grade":"","question #":"question #1","question":"What is the significance of offering oneself in marriage in Islamic tradition?","id":"bukhari-66-51"},{"hadith-eng":"A lady came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to you to offer myself to \nyou.\" He raised his eyes and looked at her and then lowered his head. When the lady saw that he did \nnot make any decision, she sat down. On that, a man from his companions got up and said. \"O Allah's \nApostle! If you are not in need of this woman, then marry her to me.\" Allah's Messenger (ﷺ) said, \"Do you \nhave anything to offer her?\" He replied. \"No, by Allah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said to him, \n\"Go to your family and see if you can find something.' The man went and returned, saying, \"No, by \nAllah, O Allah's Messenger (ﷺ)! I have not found anything.\" The Prophet (ﷺ) said, \"Try to find something, even \nif it is an iron ring.'' He went again and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ), not even \nan iron ring, but I have this waist sheet of mine.\" The man had no upper garment, so he intended to \ngive her, half his waist sheet. So Allah's Messenger (ﷺ) said, ''What would she do with your waist sheet? If \nyou wear it, she will have nothing of it over her body, and if she wears it, you will have nothing over \nyour body.\" So that man sat for a long period and then got up, and Allah's Messenger (ﷺ) saw him going \naway, so he ordered somebody to call him. When he came, the Prophet (ﷺ) asked him, \" How much of the \nQur'an do you know?\" He replied, \"I know such Surat and such Surat and such Surat,\" and went on \ncounting it, The Prophet (ﷺ) asked him, \"Can you recite it by heart?\" he replied, \"Yes.\" The Prophet (ﷺ) said, \n\"Go, I have married this lady to you for the amount of the Qur'an you know by heart.\"","reference":"Sahih al-Bukhari 5030, Book 66, Hadith 52","grade":"","question #":"question #1","question":"What is the significance of offering oneself for marriage in Islamic tradition?","id":"bukhari-66-52"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The example of the person who knows the Qur'an by heart is like the owner of \ntied camels. If he keeps them tied, he will control them, but if he releases them, they will run away.\"","reference":"Sahih al-Bukhari 5031, Book 66, Hadith 53","grade":"","question #":"question #1","question":"What is the significance of maintaining regular recitation and memorization of the Qur'an in one's life?","id":"bukhari-66-53"},{"hadith-eng":"The Prophet (ﷺ) said, \"It is a bad thing that some of you say, 'I have forgotten such-and-such verse of the \nQur'an,' for indeed, he has been caused (by Allah) to forget it. So you must keep on reciting the Qur'an \nbecause it escapes from the hearts of men faster than camel do.\"","reference":"Sahih al-Bukhari 5032, Book 66, Hadith 54","grade":"","question #":"question #1","question":"What is the significance of regularly reciting the Qur'an in maintaining its memorization?","id":"bukhari-66-54"},{"hadith-eng":"The Prophet (ﷺ) said, \"Commit yourself to the Qur'an, for by Him in whose Hand is my soul, it is surely more prone to break away than a camel in its bind.","reference":"Sahih al-Bukhari 5033, Book 66, Hadith 56","grade":"","question #":"question #1","question":"What is the significance of maintaining a strong connection with the Qur'an in a believer's life?","id":"bukhari-66-55"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) reciting Surat-al-Fath on his she-camel on the day of the Conquest of Mecca.","reference":"Sahih al-Bukhari 5034, Book 66, Hadith 57","grade":"","question #":"question #1","question":"What significance does the recitation of Surat-al-Fath hold during significant events in Islamic history?","id":"bukhari-66-56"},{"hadith-eng":"Those Suras which you people call the Mufassal, are the Muhkam. And Ibn `Abbas said, \"Allah's \nApostle died when I was a boy of ten years, and I had learnt the Muhkam (of the Qur'an).","reference":"Sahih al-Bukhari 5035, Book 66, Hadith 58","grade":"","question #":"question #1","question":"What is the significance of the Mufassal Suras in the Quran?","id":"bukhari-66-57"},{"hadith-eng":"Ibn `Abbas said, \"I have learnt all the Muhkam Suras during the life time of Allah's Messenger (ﷺ).\" I said to \nhim, 'What is meant by the Muhkam?\" He replied, \"The Mufassal.\"","reference":"Sahih al-Bukhari 5036, Book 66, Hadith 59","grade":"","question #":"question #1","question":"What is the significance of learning and understanding the Muhkam Suras in Islam?","id":"bukhari-66-58"},{"hadith-eng":"The Prophet (ﷺ) heard a man reciting the Qur'an in the mosque and said, \"May Allah bestow His Mercy \non him, as he has reminded me of such-and-such Verses of such a Surah.\"","reference":"Sahih al-Bukhari 5037, Book 66, Hadith 60","grade":"","question #":"question #1","question":"What is the significance of reciting the Qur'an in a mosque according to Islamic teachings?","id":"bukhari-66-59"},{"hadith-eng":"Allah's Messenger (ﷺ) heard a man reciting the Qur'an at night, and said, \"May Allah bestow His Mercy on \nhim, as he has reminded me of such-and-such Verses of such-and-such Suras, which I was caused to \nforget.\"","reference":"Sahih al-Bukhari 5038, Book 66, Hadith 62","grade":"","question #":"question #1","question":"What is the significance of reciting the Qur'an in reminding others of forgotten verses?","id":"bukhari-66-60"},{"hadith-eng":"The Prophet (ﷺ) said, \"Why does anyone of the people say, 'I have forgotten such-and-such Verses (of the \nQur'an)?' He, in fact, is caused (by Allah) to forget.\"","reference":"Sahih al-Bukhari 5039, Book 66, Hadith 63","grade":"","question #":"question #1","question":"What is the significance of attributing forgetfulness of Quranic verses to divine will?","id":"bukhari-66-61"},{"hadith-eng":"The Prophet (ﷺ) said, \"If one recites the last two verses of Surat al-Baqarah at night, it is sufficient for him (for that night).\"","reference":"Sahih al-Bukhari 5040, Book 66, Hadith 64","grade":"","question #":"question #1","question":"What is the significance of reciting specific verses from the Quran at night for spiritual protection or sufficiency?","id":"bukhari-66-62"},{"hadith-eng":"I heard Hisham bin Hakim bin Hizam reciting Surat-al-Furqan during the lifetime of Allah's Messenger (ﷺ), \nand I listened to his recitation and noticed that he recited it in several ways which Allah's Messenger (ﷺ) had \nnot taught me. So I was on the point of attacking him in the prayer, but I waited till he finished his \nprayer, and then I seized him by the collar and said, \"Who taught you this Surah which I have heard \nyou reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to me.\" I said, \"You are telling a lie; By Allah! \nAllah's Messenger (ﷺ) taught me (in a different way) this very Surah which I have heard you reciting.\" So I \ntook him, leading him to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I heard this person reciting \nSurat-al-Furqan in a way that you did not teach me, and you have taught me Surat-al-Furqan.\" The \nProphet said, \"O Hisham, recite!\" So he recited in the same way as I heard him recite it before. On \nthat Allah's Messenger (ﷺ) said, \"It was revealed to be recited in this way.\" Then Allah's Messenger (ﷺ) said, \n\"Recite, O `Umar!\" So I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed to \nbe recited in this way.\" Allah\" Apostle added, \"The Qur'an has been revealed to be recited in several \ndifferent ways, so recite of it that which is easier for you.\"","reference":"Sahih al-Bukhari 5041, Book 66, Hadith 65","grade":"","question #":"question #1","question":"What does this narration teach about the flexibility in the recitation of the Qur'an?","id":"bukhari-66-63"},{"hadith-eng":"The Prophet (ﷺ) heard a reciter reciting, the Qur'an in the mosque at night. The Prophet (ﷺ) said, \"May Allah \nbestow His Mercy on him, as he has remind ed me of such-and-such Verses of such and-such Suras, \nwhich I missed!\"","reference":"Sahih al-Bukhari 5042, Book 66, Hadith 66","grade":"","question #":"question #1","question":"What is the significance of reciting the Qur'an in the mosque at night?","id":"bukhari-66-64"},{"hadith-eng":"We went to `Abdullah in the morning and a man said, \"Yesterday I recited all the Mufassal Suras.\" On \nthat `Abdullah said, \"That is very quick, and we have the (Prophet's) recitation, and I remember very \nwell the recitation of those Suras which the Prophet (ﷺ) used to recite, and they were eighteen Suras from \nthe Mufassal, and two Suras from the Suras that start with Ha Mim.","reference":"Sahih al-Bukhari 5043, Book 66, Hadith 67","grade":"","question #":"question #1","question":"What can be inferred about the speed and quality of recitation from the Prophet's practice?","id":"bukhari-66-65"},{"hadith-eng":"Regarding His (Allah's) Statement:-- 'Move not your tongue concerning (the Qur'an) to make haste \ntherewith.' (75.16) And whenever Gabriel descended to Allah's Messenger (ﷺ) with the Divine Inspiration, \nAllah's Messenger (ﷺ) used to move his tongue and lips, and that used to be hard for him, and one could \neasily recognize that he was being inspired Divinely. So Allah revealed the Verse which occurs in the \nSurah starting with \"I do swear by the Day of Resurrection.' (75.1) i.e. 'Move not your tongue \nconcerning (the Qur'an) to make haste then with. It is for Us to collect it (in your mind) (O \nMuhammad) an give you the ability to recite it 'by heart.' (75.16-17) which means: It is for us to \ncollect it (in your mind) and give you the ability to recite it by heart. And when We have recited it to \nyou (O Muhammad) through Gabriel then follow you its recital. (75.18) means: 'When We reveal it \n(the Qur'an) to you, Listen to it.' for then: It is for Us to explain it and make it clear to you' (75.19) \ni.e. It is up to Us to explain it through your tongue. So, when Gabriel came to him, Allah's Messenger (ﷺ) \nwould listen to him attentively, and as soon as Gabriel left, he would recite the Revelations, as Allah \nhad promised him.","reference":"Sahih al-Bukhari 5044, Book 66, Hadith 68","grade":"","question #":"question #1","question":"What was the significance of the Prophet Muhammad's (ﷺ) interaction with Gabriel during the revelation of the Qur'an?","id":"bukhari-66-66"},{"hadith-eng":"I asked Anas bin Malik about the recitation of the Prophet. He said, \"He used to pray long (certain \nsounds) very much.","reference":"Sahih al-Bukhari 5045, Book 66, Hadith 69","grade":"","question #":"question #1","question":"How did the Prophet Muhammad recite during his prayers according to Anas bin Malik?","id":"bukhari-66-67"},{"hadith-eng":"Anas was asked, \"How was the recitation (of the Qur'an) of the Prophet?' He replied, \"It was \ncharacterized by the prolongation of certain sounds.\" He then recited: In the Name of Allah, the Most \nBeneficent, the Most Merciful prolonging the pronunciation of 'In the Name of Allah, 'the most \nBeneficent,' and 'the Most Merciful.","reference":"Sahih al-Bukhari 5046, Book 66, Hadith 70","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) recite the Qur'an according to his companions?","id":"bukhari-66-68"},{"hadith-eng":"I saw the Prophet (ﷺ) reciting (Qur'an) while he was riding on his she camel or camel which was moving, \ncarrying him. He was reciting Surat Fath or part of Surat Fath very softly and in an Attractive \nvibrating tone.","reference":"Sahih al-Bukhari 5047, Book 66, Hadith 71","grade":"","question #":"question #1","question":"What does this narration suggest about the permissibility of reciting the Qur'an while traveling?","id":"bukhari-66-69"},{"hadith-eng":"That the Prophet (ﷺ) said to him' \"O Abu Musa! You have been given one of themazamir(sweet melodious voices) of the family of David.'","reference":"Sahih al-Bukhari 5048, Book 66, Hadith 72","grade":"","question #":"question #1","question":"What is the significance of having a melodious voice in Islamic tradition?","id":"bukhari-66-70"},{"hadith-eng":"That the Prophet (ﷺ) said to him, \"Recite the Qur'an to me.\" `Abdullah said, \"Shall I recite (the Qur'an) to \nyou while it has been revealed to you?\" He said, \"I like to hear it from others.\"","reference":"Sahih al-Bukhari 5049, Book 66, Hadith 73","grade":"","question #":"question #1","question":"What is the significance of listening to the Qur'an being recited by others, even for those to whom it was revealed?","id":"bukhari-66-71"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Recite (the Qur'an) to me.\" I said, \"O Allah's Messenger (ﷺ) Shall I recite (the \nQur'an) to you while it has been revealed to you?\" He said, \"Yes.\" So I recited Surat-An-Nisa' (The \nWomen), but when I recited the Verse: \n'How (will it be) then when We bring from each nation a witness and We bring you (O Muhammad) \nas a witness against these people.' (4.41) He said, \"Enough for the present,\" I looked at him and \nbehold! His eyes were overflowing with tears","reference":"Sahih al-Bukhari 5050, Book 66, Hadith 74","grade":"","question #":"question #1","question":"What is the significance of reciting the Qur'an to the Prophet Muhammad (ﷺ) despite it being revealed to him?","id":"bukhari-66-72"},{"hadith-eng":"Ibn Shubruma said, \"I wanted to see how much of the Qur'an can be enough (to recite in prayer) and I could not find a Surah containing less than three Verses, therefore I said to myself), \"One ought not to recite less than three (Quranic) Verses (in prayer).\"","reference":"Sahih al-Bukhari 5051, Book 66, Hadith 75","grade":"","question #":"question #1","question":"What is the minimum number of Quranic verses that should be recited in prayer according to Islamic teachings?","id":"bukhari-66-73"},{"hadith-eng":"My father got me married to a lady of a noble family, and often used to ask my wife about me, and she \nused to reply, \"What a wonderful man he is! He never comes to my bed, nor has he approached me \nsince he married me.\" When this state continued for a long period, my father told the story to the \nProphet who said to my father, \"Let me meet him.\" Then I met him and he asked me, \"How do you \nfast?\" I replied, \"I fast daily,\" He asked, \"How long does it take you to finish the recitation of the \nwhole Qur'an?\" I replied, \"I finish it every night.\" On that he said, \"Fast for three days every month \nand recite the Qur'an (and finish it) in one month.\" I said, \"But I have power to do more than that.\" He \nsaid, \"Then fast for three days per week.\" I said, \"i have the power to do more than that.\" He said, \n\"Therefore, fast the most superior type of fasting, (that is, the fasting of (prophet) David who used to \nfast every alternate day; and finish the recitation of the whole Qur'an In seven days.\" I wish I had \naccepted the permission of Allah's Messenger (ﷺ) as I have become a weak old man. It is said that `Abdullah \nused to recite one-seventh of the Qur'an during the day-time to some of his family members, for he \nused to check his memorization of what he would recite at night during the daytime so that it would be \neasier for him to read at night. And whenever he wanted to gain some strength, he used to give up \nfasting for some days and count those days to fast for a similar period, for he disliked to leave those \nthings which he used to do during the lifetime of the Prophet.","reference":"Sahih al-Bukhari 5052, Book 66, Hadith 77","grade":"","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding fasting and recitation of the Qur'an?","id":"bukhari-66-74"},{"hadith-eng":"The Prophet (ﷺ) asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"","reference":"Sahih al-Bukhari 5053, Book 66, Hadith 78","grade":"","question #":"question #1","question":"What is the significance of completing the recitation of the entire Qur'an in Islam?","id":"bukhari-66-75"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power \n(to do more than that).\" Allah's Messenger (ﷺ) said, \"Then finish the recitation of the Qur'an in seven days, \nand do not finish it in less than this period.\"","reference":"Sahih al-Bukhari 5054, Book 66, Hadith 79","grade":"","question #":"question #1","question":"What is the recommended minimum time period for completing the recitation of the Qur'an?","id":"bukhari-66-76"},{"hadith-eng":"Allah's Messenger (ﷺ) said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa \n(The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a \nwitness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to \nme, \"Stop!\" Thereupon I saw his eyes overflowing with tears.","reference":"Sahih al-Bukhari 5055, Book 66, Hadith 80","grade":"","question #":"question #1","question":"Why did the Prophet Muhammad (ﷺ) express a desire to hear the Qur'an recited by someone else?","id":"bukhari-66-77"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Recite Qur'an to me.\" I said to him. \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\"","reference":"Sahih al-Bukhari 5056, Book 66, Hadith 81","grade":"","question #":"question #1","question":"Why might someone prefer to listen to the Qur'an recited by another person even if they have received its revelation?","id":"bukhari-66-78"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"In the last days (of the world) there will appear young people with foolish \nthoughts and ideas. They will give good talks, but they will go out of Islam as an arrow goes out of its \ngame, their faith will not exceed their throats. So, wherever you find them, kill them, for there will be \na reward for their killers on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 5057, Book 66, Hadith 82","grade":"","question #":"question #1","question":"What are the characteristics of the young people mentioned in the hadith who appear in the last days?","id":"bukhari-66-79"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There will appear some people among you whose prayer will make \nyou look down upon yours, and whose fasting will make you look down upon yours, but they will \nrecite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of \nIslam as an arrow goes out through the game whereupon the archer would examine the arrowhead but \nsee nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see \nnothing, and finally he suspects to find something in the lower part of the arrow.\"","reference":"Sahih al-Bukhari 5058, Book 66, Hadith 83","grade":"","question #":"question #1","question":"What are the characteristics of people whose religious practices may appear superior but lack sincerity?","id":"bukhari-66-80"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of a believer who recites the Qur'an and acts on it, like a citron which \ntastes nice and smells nice. And the example of a believer who does not recite the Qur'an but acts on \nit, is like a date which tastes good but has no smell. And the example of a hypocrite who recites the \nQur'an is like a Raihana (sweet basil) which smells good but tastes bitter And the example of a \nhypocrite who does not recite the Qur'an is like a colocynth which tastes bitter and has a bad smell.\"","reference":"Sahih al-Bukhari 5059, Book 66, Hadith 84","grade":"","question #":"question #1","question":"What are the characteristics of a believer who recites and acts upon the Qur'an?","id":"bukhari-66-81"},{"hadith-eng":"The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but if \nyou have any difference of opinion (as regards to its interpretation and meaning) then you should stop \nreciting it (for the time being).","reference":"Sahih al-Bukhari 5060, Book 66, Hadith 85","grade":"","question #":"question #1","question":"What should be done when there is a disagreement in the interpretation of the Qur'an?","id":"bukhari-66-82"},{"hadith-eng":"The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but \nwhen you have any difference of opinion (as regards its interpretation and meaning) then you should \nstop reciting it (for the time being)'","reference":"Sahih al-Bukhari 5061, Book 66, Hadith 86","grade":"","question #":"question #1","question":"What should be done when there is a disagreement in the interpretation of the Qur'an?","id":"bukhari-66-83"},{"hadith-eng":"That he heard a man reciting a Quranic Verse which he had heard the Prophet (ﷺ) reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet (ﷺ) said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet (ﷺ) further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"","reference":"Sahih al-Bukhari 5062, Book 66, Hadith 87","grade":"","question #":"question #1","question":"What is the significance of accepting different recitations of the Quran in Islam?","id":"bukhari-66-84"},{"hadith-eng":"The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.","reference":"Sahih al-Bukhari 4978, 4979, Book 66, Hadith 1","grade":"","question #":"question #2","question":"What significance does the duration of the Prophet's stay in Mecca and Medina hold in Islamic history?","id":"bukhari-66-85"},{"hadith-eng":"The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.","reference":"Sahih al-Bukhari 4978, 4979, Book 66, Hadith 1","grade":"","question #":"question #2","question":"What significance does the period of revelation in Mecca and Medina hold in Islamic history?","id":"bukhari-66-86"},{"hadith-eng":"I was informed that Gabriel came to the Prophet (ﷺ) while Um Salama was with him. Gabriel started \ntalking (to the Prophet). Then the Prophet (ﷺ) asked Um Salama, \"Who is this?\" She replied, \"He is Dihya \n(al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other \nthan him (i.e. Dihya) till I heard the sermon of the Prophet (ﷺ) wherein he informed about the news of \nGabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: \nFrom Usama bin Zaid.","reference":"Sahih al-Bukhari 4980, Book 66, Hadith 2","grade":"","question #":"question #2","question":"What role did Um Salama play in the incident involving Gabriel and the Prophet (ﷺ)?","id":"bukhari-66-87"},{"hadith-eng":"The Prophet (ﷺ) said, \"Every Prophet was given miracles because of which people believed, but what I \nhave been given, is Divine Inspiration which Allah has revealed to me. So I hope that my followers \nwill outnumber the followers of the other Prophets on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 4981, Book 66, Hadith 3","grade":"","question #":"question #2","question":"How does Divine Inspiration play a role in the belief of the followers of Prophet Muhammad?","id":"bukhari-66-88"},{"hadith-eng":"Allah sent down His Divine Inspiration to His Apostle continuously and abundantly during the period \npreceding his death till He took him unto Him. That was the period of the greatest part of revelation; \nand Allah's Messenger (ﷺ) died after that.","reference":"Sahih al-Bukhari 4982, Book 66, Hadith 4","grade":"","question #":"question #2","question":"How did the frequency of Divine Inspiration change during the Prophet's final days?","id":"bukhari-66-89"},{"hadith-eng":"Once the Prophet (ﷺ) fell ill and did not offer the night prayer (Tahajjud prayer) for a night or two. A \nwoman (the wife of Abu Lahab) came to him and said, \"O Muhammad ! I do not see but that your \nSatan has left you.\" Then Allah revealed (Surat-Ad-Duha): \n'By the fore-noon, and by the night when it darkens (or is still); Your Lord has not forsaken you, nor \nhated you.' (93)","reference":"Sahih al-Bukhari 4983, Book 66, Hadith 5","grade":"","question #":"question #2","question":"What was the reaction of the Prophet's adversaries when he temporarily stopped performing the night prayer due to illness?","id":"bukhari-66-90"},{"hadith-eng":"(The Caliph `Uthman ordered Zaid bin Thabit, Sa`id bin Al-As, `Abdullah bin Az-Zubair and `Abdur- \nRahman bin Al-Harith bin Hisham to write the Qur'an in the form of a book (Mushafs) and said to \nthem. \"In case you disagree with Zaid bin Thabit (Al-Ansari) regarding any dialectic Arabic utterance \nof the Qur'an, then write it in the dialect of Quraish, for the Qur'an was revealed in this dialect.\" So \nthey did it.","reference":"Sahih al-Bukhari 4984, Book 66, Hadith 6","grade":"","question #":"question #2","question":"Why was the dialect of Quraish chosen for writing the Qur'an during its compilation?","id":"bukhari-66-91"},{"hadith-eng":"Ya`la used to say, \"I wish I could see Allah's Messenger (ﷺ) at the time he is being inspired Divinely.\" When \nthe Prophet (ﷺ) was at Al-Ja'rana and was shaded by a garment hanging over him and some of his \ncompanions were with him, a man perfumed with scent came and said, \"O Allah's Messenger (ﷺ)! What is \nyour opinion regarding a man who assumes Ihram and puts on a cloak after perfuming his body with \nscent?\" The Prophet (ﷺ) waited for a while, and then the Divine Inspiration descended upon him. `Umar \npointed out to Ya`la, telling him to come. Ya`la came and pushed his head (underneath the screen \nwhich was covering the Prophet (ﷺ) ) and behold! The Prophet's face was red and he kept on breathing \nheavily for a while and then he was relieved. Thereupon he said, \"Where is the questioner who asked \nme about `Umra a while ago?\" The man was sought and then was brought before the Prophet (ﷺ) who said \n(to him), \"As regards the scent which you perfumed your body with, you must wash it off thrice, and \nas for your cloak, you must take it off; and then perform in your `Umra all those things which you \nperform in Hajj.\"","reference":"Sahih al-Bukhari 4985, Book 66, Hadith 7","grade":"","question #":"question #2","question":"What should a person do if they have applied perfume and worn a cloak after assuming Ihram?","id":"bukhari-66-92"},{"hadith-eng":"Abu Bakr As-Siddiq sent for me when the people of Yamama had been killed (i.e., a number of the \nProphet's Companions who fought against Musailima). (I went to him) and found `Umar bin Al- \nKhattab sitting with him. Abu Bakr then said (to me), \"`Umar has come to me and said: \"Casualties \nwere heavy among the Qurra' of the Qur'an (i.e. those who knew the Qur'an by heart) on the day of \nthe Battle of Yamama, and I am afraid that more heavy casualties may take place among the Qurra' \non other battlefields, whereby a large part of the Qur'an may be lost. Therefore I suggest, you (Abu \nBakr) order that the Qur'an be collected.\" I said to `Umar, \"How can you do something which Allah's \nApostle did not do?\" `Umar said, \"By Allah, that is a good project.\" `Umar kept on urging me to \naccept his proposal till Allah opened my chest for it and I began to realize the good in the idea which \n`Umar had realized.\" Then Abu Bakr said (to me). 'You are a wise young man and we do not have any \nsuspicion about you, and you used to write the Divine Inspiration for Allah's Messenger (ﷺ). So you should \nsearch for (the fragmentary scripts of) the Qur'an and collect it in one book.\" By Allah If they had \nordered me to shift one of the mountains, it would not have been heavier for me than this ordering me \nto collect the Qur'an. Then I said to Abu Bakr, \"How will you do something which Allah's Messenger (ﷺ) did \nnot do?\" Abu Bakr replied, \"By Allah, it is a good project.\" Abu Bakr kept on urging me to accept his \nidea until Allah opened my chest for what He had opened the chests of Abu Bakr and `Umar. So I \nstarted looking for the Qur'an and collecting it from (what was written on) palme stalks, thin white \nstones and also from the men who knew it by heart, till I found the last Verse of Surat at-Tauba \n(Repentance) with Abi Khuzaima Al-Ansari, and I did not find it with anybody other than him. The \nVerse is: \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty..(till the end of Surat-Baraa' (at-Tauba) (9.128-129). \nThen the complete manuscripts (copy) of the Qur'an remained with Abu Bakr till he died, then with \n`Umar till the end of his life, and then with Hafsa, the daughter of `Umar.","reference":"Sahih al-Bukhari 4986, Book 66, Hadith 8","grade":"","question #":"question #2","question":"What role did Zaid bin Thabit play in the collection of the Qur'an?","id":"bukhari-66-93"},{"hadith-eng":"Hudhaifa bin Al-Yaman came to `Uthman at the time when the people of Sham and the people of Iraq \nwere Waging war to conquer Arminya and Adharbijan. Hudhaifa was afraid of their (the people of \nSham and Iraq) differences in the recitation of the Qur'an, so he said to `Uthman, \"O chief of the \nBelievers! Save this nation before they differ about the Book (Qur'an) as Jews and the Christians did \nbefore.\" So `Uthman sent a message to Hafsa saying, \"Send us the manuscripts of the Qur'an so that \nwe may compile the Qur'anic materials in perfect copies and return the manuscripts to you.\" Hafsa \nsent it to `Uthman. `Uthman then ordered Zaid bin Thabit, `Abdullah bin AzZubair, Sa`id bin Al-As \nand `AbdurRahman bin Harith bin Hisham to rewrite the manuscripts in perfect copies. `Uthman said \nto the three Quraishi men, \"In case you disagree with Zaid bin Thabit on any point in the Qur'an, then \nwrite it in the dialect of Quraish, the Qur'an was revealed in their tongue.\" They did so, and when they \nhad written many copies, `Uthman returned the original manuscripts to Hafsa. `Uthman sent to every \nMuslim province one copy of what they had copied, and ordered that all the other Qur'anic materials, \nwhether written in fragmentary manuscripts or whole copies, be burnt.","reference":"Sahih al-Bukhari 4987, Book 66, Hadith 9","grade":"","question #":"question #2","question":"Why was it important to compile the Qur'an in the dialect of the Quraish?","id":"bukhari-66-94"},{"hadith-eng":"'Among the Believers are men who have been true in their covenant with Allah.' (33.23)","reference":"Sahih al-Bukhari 4988, Book 66, Hadith 10","grade":"","question #":"question #2","question":"How did the companions of the Prophet ensure the authenticity of the Quranic verses during its compilation?","id":"bukhari-66-95"},{"hadith-eng":"Abu Bakr sent for me and said, \"You used to write the Divine Revelations for Allah's Messenger (ﷺ) : So you \nshould search for (the Qur'an and collect) it.\" I started searching for the Qur'an till I found the last two \nVerses of Surat at-Tauba with Abi Khuza`ima Al-Ansari and I could not find these Verses with \nanybody other than him. (They were): \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty ...' (9.128-129)","reference":"Sahih al-Bukhari 4989, Book 66, Hadith 11","grade":"","question #":"question #2","question":"How were the last two verses of Surat at-Tauba discovered and verified?","id":"bukhari-66-96"},{"hadith-eng":"There was revealed: 'Not equal are those believers who sit (at home) and those who strive and fight in \nthe Cause of Allah.' (4.95) \nThe Prophet (ﷺ) said, \"Call Zaid for me and let him bring the board, the inkpot and the scapula bone (or \nthe scapula bone and the ink pot).\"' Then he said, \"Write: 'Not equal are those Believers who sit..\", and \nat that time `Amr bin Um Maktum, the blind man was sitting behind the Prophet (ﷺ) . He said, \"O Allah's \nApostle! What is your order For me (as regards the above Verse) as I am a blind man?\" So, instead of \nthe above Verse, the following Verse was revealed: \n'Not equal are those believers who sit (at home) except those who are disabled (by injury or are blind \nor lame etc.) and those who strive and fight in the cause of Allah.' (4.95)","reference":"Sahih al-Bukhari 4990, Book 66, Hadith 12","grade":"","question #":"question #2","question":"How does the Quran address the situation of believers with disabilities in the context of striving in the cause of Allah?","id":"bukhari-66-97"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Gabriel recited the Qur'an to me in one way. Then I requested him (to read it in \nanother way), and continued asking him to recite it in other ways, and he recited it in several ways till \nhe ultimately recited it in seven different ways.\"","reference":"Sahih al-Bukhari 4991, Book 66, Hadith 13","grade":"","question #":"question #2","question":"How does the flexibility in Qur'anic recitation reflect on the accessibility of the message to different communities?","id":"bukhari-66-98"},{"hadith-eng":"I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Messenger (ﷺ) and I \nlistened to his recitation and noticed that he recited in several different ways which Allah's Messenger (ﷺ) \nhad not taught me. I was about to jump over him during his prayer, but I controlled my temper, and \nwhen he had completed his prayer, I put his upper garment around his neck and seized him by it and \nsaid, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to \nme.\" I said, \"You have told a lie, for Allah's Messenger (ﷺ) has taught it to me in a different way from \nyours.\" So I dragged him to Allah's Messenger (ﷺ) and said (to Allah's Messenger (ﷺ)), \n\"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's \nApostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I \nheard him reciting. Then Allah's Messenger (ﷺ) said, \"It was revealed in this way,\" and added, \"Recite, O \n`Umar!\" I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed in this way. This \nQur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier \nfor you (or read as much of it as may be easy for you).","reference":"Sahih al-Bukhari 4992, Book 66, Hadith 14","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address disputes regarding the recitation of the Qur'an?","id":"bukhari-66-99"},{"hadith-eng":"While I was with Aisha, the mother of the Believers, a person from Iraq came and asked, \"What type \nof shroud is the best?\" `Aisha said, \"May Allah be merciful to you! What does it matter?\" He said, \"O \nmother of the Believers! Show me (the copy of) your Qur'an,\" She said, \"Why?\" He said, \"In order to \ncompile and arrange the Qur'an according to it, for people recite it with its Suras not in proper order.\" \n`Aisha said, \"What does it matter which part of it you read first? (Be informed) that the first thing that \nwas revealed thereof was a Sura from Al-Mufassal, and in it was mentioned Paradise and the Fire. \nWhen the people embraced Islam, the Verses regarding legal and illegal things were revealed. If the \nfirst thing to be revealed was: 'Do not drink alcoholic drinks.' people would have said, 'We will never \nleave alcoholic drinks,' and if there had been revealed, 'Do not commit illegal sexual intercourse, 'they \nwould have said, 'We will never give up illegal sexual intercourse.' While I was a young girl of \nplaying age, the following Verse was revealed in Mecca to Muhammad: 'Nay! But the Hour is their \nappointed time (for their full recompense), and the Hour will be more grievous and more bitter.' \n(54.46) Sura Al-Baqara (The Cow) and Surat An-Nisa (The Women) were revealed while I was with \nhim.\" Then `Aisha took out the copy of the Qur'an for the man and dictated to him the Verses of the \nSuras (in their proper order) .","reference":"Sahih al-Bukhari 4993, Book 66, Hadith 15","grade":"","question #":"question #2","question":"How did early Muslims respond to the gradual revelation of prohibitions in Islam?","id":"bukhari-66-100"},{"hadith-eng":"Surat Bani-lsrael, Al-Kahf (The Cave), Maryam, Taha, Al-Anbiya' (The prophets) are amongst my \nfirst earnings and my old property, and (in fact) they are my old property.","reference":"Sahih al-Bukhari 4994, Book 66, Hadith 16","grade":"","question #":"question #2","question":"How are early memorized Surahs considered as valuable assets in one's spiritual journey?","id":"bukhari-66-101"},{"hadith-eng":"I learnt, 'Glorify the Name of your Lord the Most High' (Surat al-A'la) No 87, before the Prophet (ﷺ) came \n(to Medina) .","reference":"Sahih al-Bukhari 4995, Book 66, Hadith 17","grade":"","question #":"question #2","question":"How did early Muslims engage with the Quran before the establishment of the Muslim community in Medina?","id":"bukhari-66-102"},{"hadith-eng":"`Abdullah said, \"I learnt An-Naza'ir which the Prophet (ﷺ) used to recite in pairs in each rak`a.\" Then \n`Abdullah got up and Alqama accompanied him to his house, and when Alqama came out, we asked \nhim (about those Suras). He said, \"They are twenty Suras that start from the beginning of Al- \nMufassal, according to the arrangement done be Ibn Mas`ud, and end with the Suras starting with Ha \nMim, e.g. Ha Mim (the Smoke). and \"About what they question one another?\" (78.1)","reference":"Sahih al-Bukhari 4996, Book 66, Hadith 18","grade":"","question #":"question #2","question":"How did Abdullah learn about the Suras that the Prophet (ﷺ) used to recite in pairs?","id":"bukhari-66-103"},{"hadith-eng":"The Prophet (ﷺ) was the most generous person, and he used to become more so (generous) particularly in \nthe month of Ramadan because Gabriel used to meet him every night of the month of Ramadan till it \nelapsed. Allah's Messenger (ﷺ) used to recite the Qur'an for him. When Gabriel met him, he used to become \nmore generous than the fast wind in doing good.","reference":"Sahih al-Bukhari 4997, Book 66, Hadith 19","grade":"","question #":"question #2","question":"What is the significance of reciting the Qur'an during the month of Ramadan?","id":"bukhari-66-104"},{"hadith-eng":"Gabriel used to repeat the recitation of the Qur'an with the Prophet (ﷺ) once a year, but he repeated it \ntwice with him in the year he died. The Prophet (ﷺ) used to stay in I`tikaf for ten days every year (in the \nmonth of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.","reference":"Sahih al-Bukhari 4998, Book 66, Hadith 20","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) observe I`tikaf during the month of Ramadan, and what changes occurred in the year of his death?","id":"bukhari-66-105"},{"hadith-eng":"`Abdullah bin `Amr mentioned `Abdullah bin Masud and said, \"I shall ever love that man, for I heard \nthe Prophet (ﷺ) saying, 'Take (learn) the Qur'an from four: `Abdullah bin Masud, Salim, Mu`adh and Ubai \nbin Ka`b.' \"","reference":"Sahih al-Bukhari 4999, Book 66, Hadith 21","grade":"","question #":"question #2","question":"What qualities might have led the Prophet to recommend specific individuals for teaching the Qur'an?","id":"bukhari-66-106"},{"hadith-eng":"Once `Abdullah bin Mas`ud delivered a sermon before us and said, \"By Allah, I learnt over seventy \nSuras direct from Allah's Messenger (ﷺ) . By Allah, the companions of the Prophet (ﷺ) came to know that I am \none of those who know Allah's Book best of all of them, yet I am not the best of them.\" Shaqiq added: \nI sat in his religious gathering and I did not hear anybody opposing him (in his speech).","reference":"Sahih al-Bukhari 5000, Book 66, Hadith 22","grade":"","question #":"question #2","question":"How does humility play a role in the character of those who possess great knowledge according to this account?","id":"bukhari-66-107"},{"hadith-eng":"While we were in the city of Hims (in Syria), Ibn Mas`ud recited Surat Yusuf. A man said to him), \"It \nwas not revealed in this way.\" Then Ibn Mas`ud said, \"I recited it in this way before Allah's Messenger (ﷺ) \nand he confirmed my recitation by saying, 'Well done!' \" Ibn Mas`ud detected the smell of wine from \nthe man's mouth, so he said to him, \"Aren't you ashamed of telling a lie about Allah's Book and (along \nwith this) you drink alcoholic liquors too?\" Then he lashed him according to the law.","reference":"Sahih al-Bukhari 5001, Book 66, Hadith 23","grade":"","question #":"question #2","question":"How should one respond to false claims about religious texts?","id":"bukhari-66-108"},{"hadith-eng":"By Allah other than Whom none has the right to be worshipped! There is no Sura revealed in Allah's \nBook but I know at what place it was revealed; and there is no Verse revealed in Allah's Book but I \nknow about whom it was revealed. And if I know that there is somebody who knows Allah's Book \nbetter than I, and he is at a place that camels can reach, I would go to him.","reference":"Sahih al-Bukhari 5002, Book 66, Hadith 24","grade":"","question #":"question #2","question":"How does the narrator express his dedication to learning and understanding the Quran?","id":"bukhari-66-109"},{"hadith-eng":"I asked Anas bin Malik: \"Who collected the Qur'an at the time of the Prophet (ﷺ) ?\" He replied, \"Four, all \nof whom were from the Ansar: Ubai bin Ka`b, Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid.\"","reference":"Sahih al-Bukhari 5003, Book 66, Hadith 25","grade":"","question #":"question #2","question":"What role did the Ansar play in the preservation and collection of the Qur'an?","id":"bukhari-66-110"},{"hadith-eng":"When the Prophet (ﷺ) died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin \nJabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .","reference":"Sahih al-Bukhari 5004, Book 66, Hadith 26","grade":"","question #":"question #2","question":"What significance did the companions of the Prophet hold in preserving the Qur'an after his death?","id":"bukhari-66-111"},{"hadith-eng":"`Umar said, Ubai was the best of us in the recitation (of the Qur'an) yet we leave some of what he \nrecites.' Ubai says, 'PI have taken it from the mouth of Allah's Messenger (ﷺ) and will not leave for anything \nwhatever.\" But Allah said \"None of Our Revelations do We abrogate or cause to be forgotten but We \nsubstitute something better or similar.\" 2.106","reference":"Sahih al-Bukhari 5005, Book 66, Hadith 27","grade":"","question #":"question #2","question":"How does the concept of abrogation affect the recitation and understanding of the Quran?","id":"bukhari-66-112"},{"hadith-eng":"While I was praying, the Prophet (ﷺ) called me but I did not respond to his call. Later I said, \"O Allah's \nApostle! I was praying.\" He said, \"Didn't Allah say: 'O you who believe! Give your response to Allah \n(by obeying Him) and to His Apostle when he calls you'?\" (8.24) \nHe then said, \"Shall I not teach you the most superior Surah in the Qur'an?\" He said, '(It is), \n'Praise be to Allah, the Lord of the worlds. ' (i.e., Surat Al-Fatiha) which consists of seven repeatedly \nrecited Verses and the Magnificent Qur'an which was given to me.\"","reference":"Sahih al-Bukhari 5006, Book 66, Hadith 28","grade":"","question #":"question #2","question":"Which Surah is considered the most superior in the Qur'an and why?","id":"bukhari-66-113"},{"hadith-eng":"While we were on one of our journeys, we dismounted at a place where a slave girl came and said, \n\"The chief of this tribe has been stung by a scorpion and our men are not present; is there anybody \namong you who can treat him (by reciting something)?\" Then one of our men went along with her \nthough we did not think that he knew any such treatment. But he treated the chief by reciting \nsomething, and the sick man recovered whereupon he gave him thirty sheep and gave us milk to drink \n(as a reward). When he returned, we asked our friend, \"Did you know how to treat with the recitation \nof something?\" He said, \"No, but I treated him only with the recitation of the Mother of the Book (i.e., \nAl-Fatiha).\" We said, \"Do not say anything (about it) till we reach or ask the Prophet (ﷺ) so when we \nreached Medina, we mentioned that to the Prophet (in order to know whether the sheep which we had \ntaken were lawful to take or not). The Prophet (ﷺ) said, \"How did he come to know that it (Al-Fatiha) \ncould be used for treatment? Distribute your reward and assign for me one share thereof as well.\"","reference":"Sahih al-Bukhari 5007, Book 66, Hadith 29","grade":"","question #":"question #2","question":"How does the concept of accepting rewards for spiritual or religious acts manifest in Islamic teachings?","id":"bukhari-66-114"},{"hadith-eng":"Whoever recites two verses ... (text as in the following hadith)","reference":"Sahih al-Bukhari 5008, Book 66, Hadith 30","grade":"","question #":"question #2","question":"How can the recitation of Quranic verses impact a person's spiritual or physical well-being?","id":"bukhari-66-115"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"","reference":"Sahih al-Bukhari 5009, Book 66, Hadith 31","grade":"","question #":"question #2","question":"How can reciting specific verses from the Quran provide spiritual protection or sufficiency?","id":"bukhari-66-116"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing from the foodstuff. I caught him and said, \"I will take you to Allah's Messenger (ﷺ)!\" Then Abu Huraira described the whole narration and said: That person said (to me), \"(Please don't take me to Allah's Messenger (ﷺ) and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet (ﷺ) heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"","reference":"Sahih al-Bukhari 5010, Book 66, Hadith 32","grade":"","question #":"question #2","question":"How does Islam view the concept of protection from evil forces during the night?","id":"bukhari-66-117"},{"hadith-eng":"A man was reciting Surat Al-Kahf and his horse was tied with two ropes beside him. A cloud came \ndown and spread over that man, and it kept on coming closer and closer to him till his horse started \njumping (as if afraid of something). When it was morning, the man came to the Prophet, and told him \nof that experience. The Prophet (ﷺ) said, \"That was As-Sakina (tranquility) which descended because of \n(the recitation of) the Qur'an.\"","reference":"Sahih al-Bukhari 5011, Book 66, Hadith 33","grade":"","question #":"question #2","question":"How does the presence of tranquility affect animals according to Islamic teachings?","id":"bukhari-66-118"},{"hadith-eng":"Allah's Messenger (ﷺ) was traveling on one of his journeys, and `Umar bin Al-Khattab was traveling along \nwith him at night. `Umar asked him about something, but Allah's Messenger (ﷺ) did not answer him. He \nasked again, but he did not answer. He asked for the third time, but he did not answer. On that, `Umar \nsaid to himself, \"May your mother lose you! You have asked Allah's Messenger (ﷺ) three times, but he did \nnot answer at all!\" `Umar said, \"So I made my camel go fast till I was ahead of the people, and I was \nafraid that something might be revealed about me. After a little while I heard a call maker calling me, \nI said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's \nApostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to \nme than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O \nMuhammad), a manifest victory.' \" (Surat al-Fath) No. (48.1).","reference":"Sahih al-Bukhari 5012, Book 66, Hadith 34","grade":"","question #":"question #2","question":"How did Umar ibn Al-Khattab react when the Prophet (ﷺ) did not immediately respond to his questions?","id":"bukhari-66-119"},{"hadith-eng":"A man heard another man reciting (Surat-Al-Ikhlas) 'Say He is Allah, (the) One.' (112. 1) repeatedly. The next morning he came to Allah's Messenger (ﷺ) and informed him about it as if he thought that it was not enough to recite. On that Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, this Surah is equal to one-third of the Qur'an!\"","reference":"Sahih al-Bukhari 5013, Book 66, Hadith 35","grade":"","question #":"question #2","question":"How does the repetition of certain Surahs reflect on their value and importance in Islam?","id":"bukhari-66-120"},{"hadith-eng":"My brother, Qatada bin An-Nau'man said, \"A man performed the night prayer late at night in the lifetime of the Prophet (ﷺ) and he read: 'Say: He is Allah, (the) One,' (112.1) and read nothing besides that. The next morning a man went to the Prophet (ﷺ) ,~ and told him about that . (The Prophet (ﷺ) replied the same as (in Hadith 532) above.)","reference":"Sahih al-Bukhari 5014, Book 66, Hadith 36","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the recitation of Surah Al-Ikhlas in prayer?","id":"bukhari-66-121"},{"hadith-eng":"The Prophet (ﷺ) said to his companions, \"Is it difficult for any of you to recite one third of the Qur'an in \none night?\" This suggestion was difficult for them so they said, \"Who among us has the power to do \nso, O Allah's Messenger (ﷺ)?\" Allah Apostle replied: \" Allah (the) One, the Self-Sufficient Master Whom all \ncreatures need.' (Surat Al-Ikhlas 112.1--to the End) is equal to one third of the Qur'an.\"","reference":"Sahih al-Bukhari 5015, Book 66, Hadith 37","grade":"","question #":"question #2","question":"How does Surah Al-Ikhlas reflect the concept of Tawheed in Islam?","id":"bukhari-66-122"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) became sick, he would recite Mu'awwidhat (Surat Al-Falaq and Surat An- \nNas) and then blow his breath over his body. When he became seriously ill, I used to recite (these two \nSuras) and rub his hands over his body hoping for its blessings.","reference":"Sahih al-Bukhari 5016, Book 66, Hadith 38","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) use the Mu'awwidhat during times of illness?","id":"bukhari-66-123"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to bed every night, he used to cup his hands together and blow over it after reciting Surat Al-Ikhlas, Surat Al-Falaq and Surat An-Nas, and then rub his hands over whatever parts of his body he was able to rub, starting with his head, face and front of his body. He used to do that three times.","reference":"Sahih al-Bukhari 5017, Book 66, Hadith 39","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate physical actions with recitation for protection before sleep?","id":"bukhari-66-124"},{"hadith-eng":"That while he was reciting Surat Al-Baqara (The Cow) at night, and his\r\n     horse was tied beside him, the horse was suddenly startled and \r\n     troubled. When he stopped reciting, the horse became quiet, and when \r\n     he started again, the horse was startled again. Then he stopped \r\n     reciting and the horse became quiet too. He started reciting again and\r\n     the horse was startled and troubled once again. Then he stopped \r\n     reciting and his son, Yahya was beside the horse. He was afraid that \r\n     the horse might trample on him. When he took the boy away and looked \r\n     towards the sky, he could not see it. The next morning he informed the\r\n     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn \r\n     Hudair replied, \"O Allah's Messenger (ﷺ)! My son, Yahya was near the horse \r\n     and I was afraid that it might trample on him, so I looked towards the\r\n     sky, and went to him. When I looked at the sky, I saw something like a\r\n     cloud containing what looked like lamps, so I went out in order not to\r\n     see it.\" The Prophet (ﷺ) said, \"Do you know what that was?\" Ibn Hudair \r\n     replied, \"No.\" The Prophet (ﷺ) said, \"Those were Angels who came near to \r\n     you for your voice and if you had kept on reciting till dawn, it would\r\n     have remained there till morning when people would have seen it as it \r\n     would not have disappeared.","reference":"Sahih al-Bukhari 5018, Book 66, Hadith 40","grade":"","question #":"question #2","question":"How can the presence of angels be perceived during the recitation of the Quran?","id":"bukhari-66-125"},{"hadith-eng":"Shaddad bin Ma'qil and I entered upon Ibn `Abbas. Shaddad bin Ma'qil asked him, \"Did the Prophet (ﷺ) \nleave anything (besides the Qur'an)?\" He replied. \"He did not leave anything except what is Between \nthe two bindings (of the Qur'an).\" Then we visited Muhammad bin Al-Hanafiyya and asked him (the \nsame question). He replied, \"The Prophet (ﷺ) did not leave except what is between the bindings (of the \nQur'an).","reference":"Sahih al-Bukhari 5019, Book 66, Hadith 41","grade":"","question #":"question #2","question":"How do the companions describe the legacy of the Prophet (ﷺ) in terms of religious texts?","id":"bukhari-66-126"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of him (a believer) who recites the Qur'an is like that of a citron \nwhich tastes good and smells good. And he (a believer) who does not recite the Qur'an is like a date \nwhich is good in taste but has no smell. And the example of a dissolute wicked person who recites the \nQur'an is like the Raihana (sweet basil) which smells good but tastes bitter. And the example of a \ndissolute wicked person who does not recite the Qur'an is like the colocynth which tastes bitter and \nhas no smell.","reference":"Sahih al-Bukhari 5020, Book 66, Hadith 42","grade":"","question #":"question #2","question":"What are the characteristics of a believer who does not recite the Qur'an?","id":"bukhari-66-127"},{"hadith-eng":"The Prophet (ﷺ) said, \"Your life in comparison to the lifetime of the past nations is like the period \r\nbetween the time of `Asr prayer and sunset. Your example and the example of the Jews and Christians \r\nis that of person who employed laborers and said to them, \"Who will work for me till the middle of \r\nthe day for one Qirat (a special weight)?' The Jews did. He then said, \"Who will work for me from the \r\nmiddle of the day till the `Asr prayer for one Qirat each?\" The Christians worked accordingly. Then \r\nyou (Muslims) are working from the `Asr prayer till the Maghrib prayer for two Qirats each. They (the \r\nJews and the Christians) said, 'We did more labor but took less wages.' He (Allah) said, 'Have I \r\nwronged you in your rights?' They replied, 'No.' Then He said, 'This is My Blessing which I give to \r\nwhom I wish.\"","reference":"Sahih al-Bukhari 5021, Book 66, Hadith 43","grade":"","question #":"question #2","question":"What is the significance of the analogy of laborers and wages in understanding the roles of different religious communities?","id":"bukhari-66-128"},{"hadith-eng":"I asked `Abdullah bin Abi `Aufa, \"Did the Prophet (ﷺ) make a will (to appoint his successor or bequeath \nwealth)?\" He replied, \"No.\" I said, \"How is it prescribed then for the people to make wills, and they \nare ordered to do so while the Prophet (ﷺ) did not make any will?\" He said, \"He made a will wherein he \nrecommended Allah's Book.\"","reference":"Sahih al-Bukhari 5022, Book 66, Hadith 44","grade":"","question #":"question #2","question":"Why is it important for Muslims to adhere to the guidance of the Quran according to the Prophet's (ﷺ) recommendation?","id":"bukhari-66-129"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a pleasant tone.\" The companion of the sub-narrator (Abu Salama) said, \"It means, reciting \nit aloud.\"","reference":"Sahih al-Bukhari 5023, Book 66, Hadith 45","grade":"","question #":"question #2","question":"How does reciting the Qur'an aloud impact the listener and the reciter in Islam?","id":"bukhari-66-130"},{"hadith-eng":"The Prophet (ﷺ) I said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a loud and pleasant tone.\" Sufyan said, \"This saying means: a prophet who regards the \nQur'an as something that makes him dispense with many worldly pleasures.\"","reference":"Sahih al-Bukhari 5024, Book 66, Hadith 46","grade":"","question #":"question #2","question":"How does the Qur'an influence a prophet's relationship with worldly pleasures?","id":"bukhari-66-131"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Not to wish to be the like except of two men. A man whom Allah has given the \nknowledge of the Book and he recites it during the hours of the night, and a man whom Allah has \ngiven wealth, and he spends it in charity during the night and the hours of the day.\"","reference":"Sahih al-Bukhari 5025, Book 66, Hadith 47","grade":"","question #":"question #2","question":"How is the recitation of the Book during the night viewed in terms of spiritual significance?","id":"bukhari-66-132"},{"hadith-eng":"Allah's Messenger (ﷺ) I said, \"Not to wish to be the like of except two men: A man whom Allah has taught \nthe Qur'an and he recites it during the hours of the night and during the hours of the day, and his \nneighbor listens to him and says, 'I wish I had been given what has been given to so-and-so, so that I \nmight do what he does; and a man whom Allah has given wealth and he spends it on what is just and \nright, whereupon an other man May say, 'I wish I had been given what so-and-so has been given, for \nthen I would do what he does.\"","reference":"Sahih al-Bukhari 5026, Book 66, Hadith 48","grade":"","question #":"question #2","question":"How does the recitation of the Qur'an influence others in a community setting?","id":"bukhari-66-133"},{"hadith-eng":"The Prophet (ﷺ) said, \"The best among you (Muslims) are those who learn the Qur'an and teach it.\"","reference":"Sahih al-Bukhari 5027, Book 66, Hadith 49","grade":"","question #":"question #2","question":"What is the significance of learning and teaching the Qur'an in Islam?","id":"bukhari-66-134"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most superior among you (Muslims) are those who learn the Qur'an and teach \nit.\"","reference":"Sahih al-Bukhari 5028, Book 66, Hadith 50","grade":"","question #":"question #2","question":"What is the significance of learning and teaching the Qur'an in Islam?","id":"bukhari-66-135"},{"hadith-eng":"A lady came to the Prophet (ﷺ) and declared that she had decided to offer herself to Allah and His \nApostle. The Prophet (ﷺ) said, \"I am not in need of women.\" A man said (to the Prophet) \"Please marry \nher to me.\" The Prophet (ﷺ) said (to him), \"Give her a garment.\" The man said, \"I cannot afford it.\" The \nProphet said, \"Give her anything, even if it were an iron ring.\" The man apologized again. The \nProphet then asked him, \"What do you know by heart of the Qur'an?\" He replied, \"I know such-andsuch \nportion of the Qur'an (by heart).\" The Prophet (ﷺ) said, \"Then I marry her to you for that much of the \nQur'an which you know by heart.\"","reference":"Sahih al-Bukhari 5029, Book 66, Hadith 51","grade":"","question #":"question #2","question":"How does the ability to recite the Qur'an influence marriage proposals in Islam?","id":"bukhari-66-136"},{"hadith-eng":"A lady came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to you to offer myself to \nyou.\" He raised his eyes and looked at her and then lowered his head. When the lady saw that he did \nnot make any decision, she sat down. On that, a man from his companions got up and said. \"O Allah's \nApostle! If you are not in need of this woman, then marry her to me.\" Allah's Messenger (ﷺ) said, \"Do you \nhave anything to offer her?\" He replied. \"No, by Allah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said to him, \n\"Go to your family and see if you can find something.' The man went and returned, saying, \"No, by \nAllah, O Allah's Messenger (ﷺ)! I have not found anything.\" The Prophet (ﷺ) said, \"Try to find something, even \nif it is an iron ring.'' He went again and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ), not even \nan iron ring, but I have this waist sheet of mine.\" The man had no upper garment, so he intended to \ngive her, half his waist sheet. So Allah's Messenger (ﷺ) said, ''What would she do with your waist sheet? If \nyou wear it, she will have nothing of it over her body, and if she wears it, you will have nothing over \nyour body.\" So that man sat for a long period and then got up, and Allah's Messenger (ﷺ) saw him going \naway, so he ordered somebody to call him. When he came, the Prophet (ﷺ) asked him, \" How much of the \nQur'an do you know?\" He replied, \"I know such Surat and such Surat and such Surat,\" and went on \ncounting it, The Prophet (ﷺ) asked him, \"Can you recite it by heart?\" he replied, \"Yes.\" The Prophet (ﷺ) said, \n\"Go, I have married this lady to you for the amount of the Qur'an you know by heart.\"","reference":"Sahih al-Bukhari 5030, Book 66, Hadith 52","grade":"","question #":"question #2","question":"How does the knowledge of the Qur'an play a role in marriage proposals?","id":"bukhari-66-137"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The example of the person who knows the Qur'an by heart is like the owner of \ntied camels. If he keeps them tied, he will control them, but if he releases them, they will run away.\"","reference":"Sahih al-Bukhari 5031, Book 66, Hadith 53","grade":"","question #":"question #2","question":"How can the analogy of tied camels help in understanding the importance of retaining the Qur'an in memory?","id":"bukhari-66-138"},{"hadith-eng":"The Prophet (ﷺ) said, \"It is a bad thing that some of you say, 'I have forgotten such-and-such verse of the \nQur'an,' for indeed, he has been caused (by Allah) to forget it. So you must keep on reciting the Qur'an \nbecause it escapes from the hearts of men faster than camel do.\"","reference":"Sahih al-Bukhari 5032, Book 66, Hadith 54","grade":"","question #":"question #2","question":"How does the Qur'an escape from the hearts of people, and what can be done to prevent it?","id":"bukhari-66-139"},{"hadith-eng":"The Prophet (ﷺ) said, \"Commit yourself to the Qur'an, for by Him in whose Hand is my soul, it is surely more prone to break away than a camel in its bind.","reference":"Sahih al-Bukhari 5033, Book 66, Hadith 56","grade":"","question #":"question #2","question":"How does the analogy of a camel in its bind relate to the relationship between a believer and the Qur'an?","id":"bukhari-66-140"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) reciting Surat-al-Fath on his she-camel on the day of the Conquest of Mecca.","reference":"Sahih al-Bukhari 5034, Book 66, Hadith 57","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the practice of reciting the Quran during travel?","id":"bukhari-66-141"},{"hadith-eng":"Those Suras which you people call the Mufassal, are the Muhkam. And Ibn `Abbas said, \"Allah's \nApostle died when I was a boy of ten years, and I had learnt the Muhkam (of the Qur'an).","reference":"Sahih al-Bukhari 5035, Book 66, Hadith 58","grade":"","question #":"question #2","question":"At what age did Ibn `Abbas learn the Muhkam of the Quran?","id":"bukhari-66-142"},{"hadith-eng":"Ibn `Abbas said, \"I have learnt all the Muhkam Suras during the life time of Allah's Messenger (ﷺ).\" I said to \nhim, 'What is meant by the Muhkam?\" He replied, \"The Mufassal.\"","reference":"Sahih al-Bukhari 5036, Book 66, Hadith 59","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) approach the study and memorization of the Quran?","id":"bukhari-66-143"},{"hadith-eng":"The Prophet (ﷺ) heard a man reciting the Qur'an in the mosque and said, \"May Allah bestow His Mercy \non him, as he has reminded me of such-and-such Verses of such a Surah.\"","reference":"Sahih al-Bukhari 5037, Book 66, Hadith 60","grade":"","question #":"question #2","question":"How can reciting the Qur'an serve as a reminder for others in the community?","id":"bukhari-66-144"},{"hadith-eng":"Allah's Messenger (ﷺ) heard a man reciting the Qur'an at night, and said, \"May Allah bestow His Mercy on \nhim, as he has reminded me of such-and-such Verses of such-and-such Suras, which I was caused to \nforget.\"","reference":"Sahih al-Bukhari 5038, Book 66, Hadith 62","grade":"","question #":"question #2","question":"How does the act of reciting the Qur'an at night impact the listener according to Islamic teachings?","id":"bukhari-66-145"},{"hadith-eng":"The Prophet (ﷺ) said, \"Why does anyone of the people say, 'I have forgotten such-and-such Verses (of the \nQur'an)?' He, in fact, is caused (by Allah) to forget.\"","reference":"Sahih al-Bukhari 5039, Book 66, Hadith 63","grade":"","question #":"question #2","question":"How should one perceive the act of forgetting Quranic verses in the context of faith?","id":"bukhari-66-146"},{"hadith-eng":"The Prophet (ﷺ) said, \"If one recites the last two verses of Surat al-Baqarah at night, it is sufficient for him (for that night).\"","reference":"Sahih al-Bukhari 5040, Book 66, Hadith 64","grade":"","question #":"question #2","question":"How can the recitation of certain Quranic verses impact a person's nightly routine or spiritual practice?","id":"bukhari-66-147"},{"hadith-eng":"I heard Hisham bin Hakim bin Hizam reciting Surat-al-Furqan during the lifetime of Allah's Messenger (ﷺ), \nand I listened to his recitation and noticed that he recited it in several ways which Allah's Messenger (ﷺ) had \nnot taught me. So I was on the point of attacking him in the prayer, but I waited till he finished his \nprayer, and then I seized him by the collar and said, \"Who taught you this Surah which I have heard \nyou reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to me.\" I said, \"You are telling a lie; By Allah! \nAllah's Messenger (ﷺ) taught me (in a different way) this very Surah which I have heard you reciting.\" So I \ntook him, leading him to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I heard this person reciting \nSurat-al-Furqan in a way that you did not teach me, and you have taught me Surat-al-Furqan.\" The \nProphet said, \"O Hisham, recite!\" So he recited in the same way as I heard him recite it before. On \nthat Allah's Messenger (ﷺ) said, \"It was revealed to be recited in this way.\" Then Allah's Messenger (ﷺ) said, \n\"Recite, O `Umar!\" So I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed to \nbe recited in this way.\" Allah\" Apostle added, \"The Qur'an has been revealed to be recited in several \ndifferent ways, so recite of it that which is easier for you.\"","reference":"Sahih al-Bukhari 5041, Book 66, Hadith 65","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address differences in Qur'anic recitation among his companions?","id":"bukhari-66-148"},{"hadith-eng":"The Prophet (ﷺ) heard a reciter reciting, the Qur'an in the mosque at night. The Prophet (ﷺ) said, \"May Allah \nbestow His Mercy on him, as he has remind ed me of such-and-such Verses of such and-such Suras, \nwhich I missed!\"","reference":"Sahih al-Bukhari 5042, Book 66, Hadith 66","grade":"","question #":"question #2","question":"How can reciting the Qur'an serve as a reminder for others?","id":"bukhari-66-149"},{"hadith-eng":"We went to `Abdullah in the morning and a man said, \"Yesterday I recited all the Mufassal Suras.\" On \nthat `Abdullah said, \"That is very quick, and we have the (Prophet's) recitation, and I remember very \nwell the recitation of those Suras which the Prophet (ﷺ) used to recite, and they were eighteen Suras from \nthe Mufassal, and two Suras from the Suras that start with Ha Mim.","reference":"Sahih al-Bukhari 5043, Book 66, Hadith 67","grade":"","question #":"question #2","question":"How many Suras from the Mufassal did the Prophet (ﷺ) recite according to this narration?","id":"bukhari-66-150"},{"hadith-eng":"Regarding His (Allah's) Statement:-- 'Move not your tongue concerning (the Qur'an) to make haste \ntherewith.' (75.16) And whenever Gabriel descended to Allah's Messenger (ﷺ) with the Divine Inspiration, \nAllah's Messenger (ﷺ) used to move his tongue and lips, and that used to be hard for him, and one could \neasily recognize that he was being inspired Divinely. So Allah revealed the Verse which occurs in the \nSurah starting with \"I do swear by the Day of Resurrection.' (75.1) i.e. 'Move not your tongue \nconcerning (the Qur'an) to make haste then with. It is for Us to collect it (in your mind) (O \nMuhammad) an give you the ability to recite it 'by heart.' (75.16-17) which means: It is for us to \ncollect it (in your mind) and give you the ability to recite it by heart. And when We have recited it to \nyou (O Muhammad) through Gabriel then follow you its recital. (75.18) means: 'When We reveal it \n(the Qur'an) to you, Listen to it.' for then: It is for Us to explain it and make it clear to you' (75.19) \ni.e. It is up to Us to explain it through your tongue. So, when Gabriel came to him, Allah's Messenger (ﷺ) \nwould listen to him attentively, and as soon as Gabriel left, he would recite the Revelations, as Allah \nhad promised him.","reference":"Sahih al-Bukhari 5044, Book 66, Hadith 68","grade":"","question #":"question #2","question":"How did Allah assure the Prophet Muhammad (ﷺ) regarding the memorization and recitation of the Qur'an?","id":"bukhari-66-151"},{"hadith-eng":"I asked Anas bin Malik about the recitation of the Prophet. He said, \"He used to pray long (certain \nsounds) very much.","reference":"Sahih al-Bukhari 5045, Book 66, Hadith 69","grade":"","question #":"question #2","question":"What can be learned about the Prophet's prayer habits from Anas bin Malik's narration?","id":"bukhari-66-152"},{"hadith-eng":"Anas was asked, \"How was the recitation (of the Qur'an) of the Prophet?' He replied, \"It was \ncharacterized by the prolongation of certain sounds.\" He then recited: In the Name of Allah, the Most \nBeneficent, the Most Merciful prolonging the pronunciation of 'In the Name of Allah, 'the most \nBeneficent,' and 'the Most Merciful.","reference":"Sahih al-Bukhari 5046, Book 66, Hadith 70","grade":"","question #":"question #2","question":"What is the significance of prolonging certain sounds during the recitation of the Qur'an?","id":"bukhari-66-153"},{"hadith-eng":"I saw the Prophet (ﷺ) reciting (Qur'an) while he was riding on his she camel or camel which was moving, \ncarrying him. He was reciting Surat Fath or part of Surat Fath very softly and in an Attractive \nvibrating tone.","reference":"Sahih al-Bukhari 5047, Book 66, Hadith 71","grade":"","question #":"question #2","question":"How does the Prophet's manner of recitation reflect on the recommended way to recite the Qur'an?","id":"bukhari-66-154"},{"hadith-eng":"That the Prophet (ﷺ) said to him' \"O Abu Musa! You have been given one of themazamir(sweet melodious voices) of the family of David.'","reference":"Sahih al-Bukhari 5048, Book 66, Hadith 72","grade":"","question #":"question #2","question":"How is the family of David referenced in Islamic teachings regarding musical talent?","id":"bukhari-66-155"},{"hadith-eng":"That the Prophet (ﷺ) said to him, \"Recite the Qur'an to me.\" `Abdullah said, \"Shall I recite (the Qur'an) to \nyou while it has been revealed to you?\" He said, \"I like to hear it from others.\"","reference":"Sahih al-Bukhari 5049, Book 66, Hadith 73","grade":"","question #":"question #2","question":"How does the act of listening to the Qur'an from others contribute to one's spiritual experience?","id":"bukhari-66-156"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Recite (the Qur'an) to me.\" I said, \"O Allah's Messenger (ﷺ) Shall I recite (the \nQur'an) to you while it has been revealed to you?\" He said, \"Yes.\" So I recited Surat-An-Nisa' (The \nWomen), but when I recited the Verse: \n'How (will it be) then when We bring from each nation a witness and We bring you (O Muhammad) \nas a witness against these people.' (4.41) He said, \"Enough for the present,\" I looked at him and \nbehold! His eyes were overflowing with tears","reference":"Sahih al-Bukhari 5050, Book 66, Hadith 74","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) react emotionally to the recitation of certain verses of the Qur'an?","id":"bukhari-66-157"},{"hadith-eng":"Ibn Shubruma said, \"I wanted to see how much of the Qur'an can be enough (to recite in prayer) and I could not find a Surah containing less than three Verses, therefore I said to myself), \"One ought not to recite less than three (Quranic) Verses (in prayer).\"","reference":"Sahih al-Bukhari 5051, Book 66, Hadith 75","grade":"","question #":"question #2","question":"Why might someone conclude that reciting less than three verses in prayer is insufficient?","id":"bukhari-66-158"},{"hadith-eng":"My father got me married to a lady of a noble family, and often used to ask my wife about me, and she \nused to reply, \"What a wonderful man he is! He never comes to my bed, nor has he approached me \nsince he married me.\" When this state continued for a long period, my father told the story to the \nProphet who said to my father, \"Let me meet him.\" Then I met him and he asked me, \"How do you \nfast?\" I replied, \"I fast daily,\" He asked, \"How long does it take you to finish the recitation of the \nwhole Qur'an?\" I replied, \"I finish it every night.\" On that he said, \"Fast for three days every month \nand recite the Qur'an (and finish it) in one month.\" I said, \"But I have power to do more than that.\" He \nsaid, \"Then fast for three days per week.\" I said, \"i have the power to do more than that.\" He said, \n\"Therefore, fast the most superior type of fasting, (that is, the fasting of (prophet) David who used to \nfast every alternate day; and finish the recitation of the whole Qur'an In seven days.\" I wish I had \naccepted the permission of Allah's Messenger (ﷺ) as I have become a weak old man. It is said that `Abdullah \nused to recite one-seventh of the Qur'an during the day-time to some of his family members, for he \nused to check his memorization of what he would recite at night during the daytime so that it would be \neasier for him to read at night. And whenever he wanted to gain some strength, he used to give up \nfasting for some days and count those days to fast for a similar period, for he disliked to leave those \nthings which he used to do during the lifetime of the Prophet.","reference":"Sahih al-Bukhari 5052, Book 66, Hadith 77","grade":"","question #":"question #2","question":"How can one balance religious devotion with personal well-being according to Islamic teachings?","id":"bukhari-66-159"},{"hadith-eng":"The Prophet (ﷺ) asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"","reference":"Sahih al-Bukhari 5053, Book 66, Hadith 78","grade":"","question #":"question #2","question":"How does the frequency of Qur'an recitation reflect on a person's spiritual discipline?","id":"bukhari-66-160"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power \n(to do more than that).\" Allah's Messenger (ﷺ) said, \"Then finish the recitation of the Qur'an in seven days, \nand do not finish it in less than this period.\"","reference":"Sahih al-Bukhari 5054, Book 66, Hadith 79","grade":"","question #":"question #2","question":"Why might it be discouraged to finish the recitation of the Qur'an in less than seven days?","id":"bukhari-66-161"},{"hadith-eng":"Allah's Messenger (ﷺ) said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa \n(The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a \nwitness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to \nme, \"Stop!\" Thereupon I saw his eyes overflowing with tears.","reference":"Sahih al-Bukhari 5055, Book 66, Hadith 80","grade":"","question #":"question #2","question":"What emotional response did the Prophet Muhammad (ﷺ) have upon hearing the recitation of the Qur'an?","id":"bukhari-66-162"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Recite Qur'an to me.\" I said to him. \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\"","reference":"Sahih al-Bukhari 5056, Book 66, Hadith 81","grade":"","question #":"question #2","question":"What can be learned about the relationship between the Prophet Muhammad (ﷺ) and his companions from this interaction?","id":"bukhari-66-163"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"In the last days (of the world) there will appear young people with foolish \nthoughts and ideas. They will give good talks, but they will go out of Islam as an arrow goes out of its \ngame, their faith will not exceed their throats. So, wherever you find them, kill them, for there will be \na reward for their killers on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 5057, Book 66, Hadith 82","grade":"","question #":"question #2","question":"What is the significance of the metaphor used to describe how these individuals leave Islam?","id":"bukhari-66-164"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There will appear some people among you whose prayer will make \nyou look down upon yours, and whose fasting will make you look down upon yours, but they will \nrecite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of \nIslam as an arrow goes out through the game whereupon the archer would examine the arrowhead but \nsee nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see \nnothing, and finally he suspects to find something in the lower part of the arrow.\"","reference":"Sahih al-Bukhari 5058, Book 66, Hadith 83","grade":"","question #":"question #2","question":"How can reciting the Qur'an without understanding or acting upon it affect one's faith?","id":"bukhari-66-165"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of a believer who recites the Qur'an and acts on it, like a citron which \ntastes nice and smells nice. And the example of a believer who does not recite the Qur'an but acts on \nit, is like a date which tastes good but has no smell. And the example of a hypocrite who recites the \nQur'an is like a Raihana (sweet basil) which smells good but tastes bitter And the example of a \nhypocrite who does not recite the Qur'an is like a colocynth which tastes bitter and has a bad smell.\"","reference":"Sahih al-Bukhari 5059, Book 66, Hadith 84","grade":"","question #":"question #2","question":"How is a believer who acts on the Qur'an but does not recite it described?","id":"bukhari-66-166"},{"hadith-eng":"The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but if \nyou have any difference of opinion (as regards to its interpretation and meaning) then you should stop \nreciting it (for the time being).","reference":"Sahih al-Bukhari 5060, Book 66, Hadith 85","grade":"","question #":"question #2","question":"How important is consensus in understanding the meanings of the Qur'an?","id":"bukhari-66-167"},{"hadith-eng":"The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but \nwhen you have any difference of opinion (as regards its interpretation and meaning) then you should \nstop reciting it (for the time being)'","reference":"Sahih al-Bukhari 5061, Book 66, Hadith 86","grade":"","question #":"question #2","question":"How important is consensus in understanding the meanings of the Qur'an?","id":"bukhari-66-168"},{"hadith-eng":"That he heard a man reciting a Quranic Verse which he had heard the Prophet (ﷺ) reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet (ﷺ) said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet (ﷺ) further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"","reference":"Sahih al-Bukhari 5062, Book 66, Hadith 87","grade":"","question #":"question #2","question":"How can differences in religious practices lead to the downfall of previous nations?","id":"bukhari-66-169"},{"hadith-eng":"The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.","reference":"Sahih al-Bukhari 4978, 4979, Book 66, Hadith 1","grade":"","question #":"question #3","question":"How was the Qur'an revealed to the Prophet Muhammad (ﷺ) during his time in Mecca?","id":"bukhari-66-170"},{"hadith-eng":"The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.","reference":"Sahih al-Bukhari 4978, 4979, Book 66, Hadith 1","grade":"","question #":"question #3","question":"How does the duration of the Prophet's stay in Mecca and Medina relate to the revelation of the Qur'an?","id":"bukhari-66-171"},{"hadith-eng":"I was informed that Gabriel came to the Prophet (ﷺ) while Um Salama was with him. Gabriel started \ntalking (to the Prophet). Then the Prophet (ﷺ) asked Um Salama, \"Who is this?\" She replied, \"He is Dihya \n(al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other \nthan him (i.e. Dihya) till I heard the sermon of the Prophet (ﷺ) wherein he informed about the news of \nGabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: \nFrom Usama bin Zaid.","reference":"Sahih al-Bukhari 4980, Book 66, Hadith 2","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) communicate the presence of Gabriel to his companions?","id":"bukhari-66-172"},{"hadith-eng":"The Prophet (ﷺ) said, \"Every Prophet was given miracles because of which people believed, but what I \nhave been given, is Divine Inspiration which Allah has revealed to me. So I hope that my followers \nwill outnumber the followers of the other Prophets on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 4981, Book 66, Hadith 3","grade":"","question #":"question #3","question":"What is the significance of the number of followers of Prophet Muhammad on the Day of Resurrection?","id":"bukhari-66-173"},{"hadith-eng":"Allah sent down His Divine Inspiration to His Apostle continuously and abundantly during the period \npreceding his death till He took him unto Him. That was the period of the greatest part of revelation; \nand Allah's Messenger (ﷺ) died after that.","reference":"Sahih al-Bukhari 4982, Book 66, Hadith 4","grade":"","question #":"question #3","question":"What can be inferred about the relationship between the Prophet's life events and the revelation of the Quran?","id":"bukhari-66-174"},{"hadith-eng":"Once the Prophet (ﷺ) fell ill and did not offer the night prayer (Tahajjud prayer) for a night or two. A \nwoman (the wife of Abu Lahab) came to him and said, \"O Muhammad ! I do not see but that your \nSatan has left you.\" Then Allah revealed (Surat-Ad-Duha): \n'By the fore-noon, and by the night when it darkens (or is still); Your Lord has not forsaken you, nor \nhated you.' (93)","reference":"Sahih al-Bukhari 4983, Book 66, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of Surat Ad-Duha in affirming Allah's continuous support and love for the Prophet Muhammad (ﷺ)?","id":"bukhari-66-175"},{"hadith-eng":"(The Caliph `Uthman ordered Zaid bin Thabit, Sa`id bin Al-As, `Abdullah bin Az-Zubair and `Abdur- \nRahman bin Al-Harith bin Hisham to write the Qur'an in the form of a book (Mushafs) and said to \nthem. \"In case you disagree with Zaid bin Thabit (Al-Ansari) regarding any dialectic Arabic utterance \nof the Qur'an, then write it in the dialect of Quraish, for the Qur'an was revealed in this dialect.\" So \nthey did it.","reference":"Sahih al-Bukhari 4984, Book 66, Hadith 6","grade":"","question #":"question #3","question":"How did the early Muslims address disagreements in dialects when compiling the Qur'an?","id":"bukhari-66-176"},{"hadith-eng":"Ya`la used to say, \"I wish I could see Allah's Messenger (ﷺ) at the time he is being inspired Divinely.\" When \nthe Prophet (ﷺ) was at Al-Ja'rana and was shaded by a garment hanging over him and some of his \ncompanions were with him, a man perfumed with scent came and said, \"O Allah's Messenger (ﷺ)! What is \nyour opinion regarding a man who assumes Ihram and puts on a cloak after perfuming his body with \nscent?\" The Prophet (ﷺ) waited for a while, and then the Divine Inspiration descended upon him. `Umar \npointed out to Ya`la, telling him to come. Ya`la came and pushed his head (underneath the screen \nwhich was covering the Prophet (ﷺ) ) and behold! The Prophet's face was red and he kept on breathing \nheavily for a while and then he was relieved. Thereupon he said, \"Where is the questioner who asked \nme about `Umra a while ago?\" The man was sought and then was brought before the Prophet (ﷺ) who said \n(to him), \"As regards the scent which you perfumed your body with, you must wash it off thrice, and \nas for your cloak, you must take it off; and then perform in your `Umra all those things which you \nperform in Hajj.\"","reference":"Sahih al-Bukhari 4985, Book 66, Hadith 7","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) react when he received Divine Inspiration?","id":"bukhari-66-177"},{"hadith-eng":"Abu Bakr As-Siddiq sent for me when the people of Yamama had been killed (i.e., a number of the \nProphet's Companions who fought against Musailima). (I went to him) and found `Umar bin Al- \nKhattab sitting with him. Abu Bakr then said (to me), \"`Umar has come to me and said: \"Casualties \nwere heavy among the Qurra' of the Qur'an (i.e. those who knew the Qur'an by heart) on the day of \nthe Battle of Yamama, and I am afraid that more heavy casualties may take place among the Qurra' \non other battlefields, whereby a large part of the Qur'an may be lost. Therefore I suggest, you (Abu \nBakr) order that the Qur'an be collected.\" I said to `Umar, \"How can you do something which Allah's \nApostle did not do?\" `Umar said, \"By Allah, that is a good project.\" `Umar kept on urging me to \naccept his proposal till Allah opened my chest for it and I began to realize the good in the idea which \n`Umar had realized.\" Then Abu Bakr said (to me). 'You are a wise young man and we do not have any \nsuspicion about you, and you used to write the Divine Inspiration for Allah's Messenger (ﷺ). So you should \nsearch for (the fragmentary scripts of) the Qur'an and collect it in one book.\" By Allah If they had \nordered me to shift one of the mountains, it would not have been heavier for me than this ordering me \nto collect the Qur'an. Then I said to Abu Bakr, \"How will you do something which Allah's Messenger (ﷺ) did \nnot do?\" Abu Bakr replied, \"By Allah, it is a good project.\" Abu Bakr kept on urging me to accept his \nidea until Allah opened my chest for what He had opened the chests of Abu Bakr and `Umar. So I \nstarted looking for the Qur'an and collecting it from (what was written on) palme stalks, thin white \nstones and also from the men who knew it by heart, till I found the last Verse of Surat at-Tauba \n(Repentance) with Abi Khuzaima Al-Ansari, and I did not find it with anybody other than him. The \nVerse is: \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty..(till the end of Surat-Baraa' (at-Tauba) (9.128-129). \nThen the complete manuscripts (copy) of the Qur'an remained with Abu Bakr till he died, then with \n`Umar till the end of his life, and then with Hafsa, the daughter of `Umar.","reference":"Sahih al-Bukhari 4986, Book 66, Hadith 8","grade":"","question #":"question #3","question":"How did Abu Bakr and Umar convince Zaid bin Thabit to undertake the task of compiling the Qur'an?","id":"bukhari-66-178"},{"hadith-eng":"Hudhaifa bin Al-Yaman came to `Uthman at the time when the people of Sham and the people of Iraq \nwere Waging war to conquer Arminya and Adharbijan. Hudhaifa was afraid of their (the people of \nSham and Iraq) differences in the recitation of the Qur'an, so he said to `Uthman, \"O chief of the \nBelievers! Save this nation before they differ about the Book (Qur'an) as Jews and the Christians did \nbefore.\" So `Uthman sent a message to Hafsa saying, \"Send us the manuscripts of the Qur'an so that \nwe may compile the Qur'anic materials in perfect copies and return the manuscripts to you.\" Hafsa \nsent it to `Uthman. `Uthman then ordered Zaid bin Thabit, `Abdullah bin AzZubair, Sa`id bin Al-As \nand `AbdurRahman bin Harith bin Hisham to rewrite the manuscripts in perfect copies. `Uthman said \nto the three Quraishi men, \"In case you disagree with Zaid bin Thabit on any point in the Qur'an, then \nwrite it in the dialect of Quraish, the Qur'an was revealed in their tongue.\" They did so, and when they \nhad written many copies, `Uthman returned the original manuscripts to Hafsa. `Uthman sent to every \nMuslim province one copy of what they had copied, and ordered that all the other Qur'anic materials, \nwhether written in fragmentary manuscripts or whole copies, be burnt.","reference":"Sahih al-Bukhari 4987, Book 66, Hadith 9","grade":"","question #":"question #3","question":"What actions did Uthman take to prevent differences in the Qur'an similar to those that occurred among Jews and Christians with their scriptures?","id":"bukhari-66-179"},{"hadith-eng":"'Among the Believers are men who have been true in their covenant with Allah.' (33.23)","reference":"Sahih al-Bukhari 4988, Book 66, Hadith 10","grade":"","question #":"question #3","question":"What role did individual companions play in the preservation and compilation of the Quran?","id":"bukhari-66-180"},{"hadith-eng":"Abu Bakr sent for me and said, \"You used to write the Divine Revelations for Allah's Messenger (ﷺ) : So you \nshould search for (the Qur'an and collect) it.\" I started searching for the Qur'an till I found the last two \nVerses of Surat at-Tauba with Abi Khuza`ima Al-Ansari and I could not find these Verses with \nanybody other than him. (They were): \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty ...' (9.128-129)","reference":"Sahih al-Bukhari 4989, Book 66, Hadith 11","grade":"","question #":"question #3","question":"What does the process of collecting the Qur'an reveal about the preservation of the text?","id":"bukhari-66-181"},{"hadith-eng":"There was revealed: 'Not equal are those believers who sit (at home) and those who strive and fight in \nthe Cause of Allah.' (4.95) \nThe Prophet (ﷺ) said, \"Call Zaid for me and let him bring the board, the inkpot and the scapula bone (or \nthe scapula bone and the ink pot).\"' Then he said, \"Write: 'Not equal are those Believers who sit..\", and \nat that time `Amr bin Um Maktum, the blind man was sitting behind the Prophet (ﷺ) . He said, \"O Allah's \nApostle! What is your order For me (as regards the above Verse) as I am a blind man?\" So, instead of \nthe above Verse, the following Verse was revealed: \n'Not equal are those believers who sit (at home) except those who are disabled (by injury or are blind \nor lame etc.) and those who strive and fight in the cause of Allah.' (4.95)","reference":"Sahih al-Bukhari 4990, Book 66, Hadith 12","grade":"","question #":"question #3","question":"What role did revelation play in addressing the concerns of individuals with disabilities in early Islamic society?","id":"bukhari-66-182"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Gabriel recited the Qur'an to me in one way. Then I requested him (to read it in \nanother way), and continued asking him to recite it in other ways, and he recited it in several ways till \nhe ultimately recited it in seven different ways.\"","reference":"Sahih al-Bukhari 4991, Book 66, Hadith 13","grade":"","question #":"question #3","question":"What role did the Angel Gabriel play in the revelation and recitation of the Qur'an to the Prophet Muhammad (ﷺ)?","id":"bukhari-66-183"},{"hadith-eng":"I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Messenger (ﷺ) and I \nlistened to his recitation and noticed that he recited in several different ways which Allah's Messenger (ﷺ) \nhad not taught me. I was about to jump over him during his prayer, but I controlled my temper, and \nwhen he had completed his prayer, I put his upper garment around his neck and seized him by it and \nsaid, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to \nme.\" I said, \"You have told a lie, for Allah's Messenger (ﷺ) has taught it to me in a different way from \nyours.\" So I dragged him to Allah's Messenger (ﷺ) and said (to Allah's Messenger (ﷺ)), \n\"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's \nApostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I \nheard him reciting. Then Allah's Messenger (ﷺ) said, \"It was revealed in this way,\" and added, \"Recite, O \n`Umar!\" I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed in this way. This \nQur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier \nfor you (or read as much of it as may be easy for you).","reference":"Sahih al-Bukhari 4992, Book 66, Hadith 14","grade":"","question #":"question #3","question":"What is the significance of the Qur'an being revealed in seven different ways?","id":"bukhari-66-184"},{"hadith-eng":"While I was with Aisha, the mother of the Believers, a person from Iraq came and asked, \"What type \nof shroud is the best?\" `Aisha said, \"May Allah be merciful to you! What does it matter?\" He said, \"O \nmother of the Believers! Show me (the copy of) your Qur'an,\" She said, \"Why?\" He said, \"In order to \ncompile and arrange the Qur'an according to it, for people recite it with its Suras not in proper order.\" \n`Aisha said, \"What does it matter which part of it you read first? (Be informed) that the first thing that \nwas revealed thereof was a Sura from Al-Mufassal, and in it was mentioned Paradise and the Fire. \nWhen the people embraced Islam, the Verses regarding legal and illegal things were revealed. If the \nfirst thing to be revealed was: 'Do not drink alcoholic drinks.' people would have said, 'We will never \nleave alcoholic drinks,' and if there had been revealed, 'Do not commit illegal sexual intercourse, 'they \nwould have said, 'We will never give up illegal sexual intercourse.' While I was a young girl of \nplaying age, the following Verse was revealed in Mecca to Muhammad: 'Nay! But the Hour is their \nappointed time (for their full recompense), and the Hour will be more grievous and more bitter.' \n(54.46) Sura Al-Baqara (The Cow) and Surat An-Nisa (The Women) were revealed while I was with \nhim.\" Then `Aisha took out the copy of the Qur'an for the man and dictated to him the Verses of the \nSuras (in their proper order) .","reference":"Sahih al-Bukhari 4993, Book 66, Hadith 15","grade":"","question #":"question #3","question":"What role did Aisha play in preserving and teaching the Qur'an to others?","id":"bukhari-66-185"},{"hadith-eng":"Surat Bani-lsrael, Al-Kahf (The Cave), Maryam, Taha, Al-Anbiya' (The prophets) are amongst my \nfirst earnings and my old property, and (in fact) they are my old property.","reference":"Sahih al-Bukhari 4994, Book 66, Hadith 16","grade":"","question #":"question #3","question":"What does the term 'old property' imply in the context of memorizing and reciting the Quran?","id":"bukhari-66-186"},{"hadith-eng":"I learnt, 'Glorify the Name of your Lord the Most High' (Surat al-A'la) No 87, before the Prophet (ﷺ) came \n(to Medina) .","reference":"Sahih al-Bukhari 4995, Book 66, Hadith 17","grade":"","question #":"question #3","question":"What does the memorization of specific Surahs indicate about the early Islamic practices?","id":"bukhari-66-187"},{"hadith-eng":"`Abdullah said, \"I learnt An-Naza'ir which the Prophet (ﷺ) used to recite in pairs in each rak`a.\" Then \n`Abdullah got up and Alqama accompanied him to his house, and when Alqama came out, we asked \nhim (about those Suras). He said, \"They are twenty Suras that start from the beginning of Al- \nMufassal, according to the arrangement done be Ibn Mas`ud, and end with the Suras starting with Ha \nMim, e.g. Ha Mim (the Smoke). and \"About what they question one another?\" (78.1)","reference":"Sahih al-Bukhari 4996, Book 66, Hadith 18","grade":"","question #":"question #3","question":"What is the role of Alqama in conveying the information about the Suras recited by the Prophet (ﷺ)?","id":"bukhari-66-188"},{"hadith-eng":"The Prophet (ﷺ) was the most generous person, and he used to become more so (generous) particularly in \nthe month of Ramadan because Gabriel used to meet him every night of the month of Ramadan till it \nelapsed. Allah's Messenger (ﷺ) used to recite the Qur'an for him. When Gabriel met him, he used to become \nmore generous than the fast wind in doing good.","reference":"Sahih al-Bukhari 4997, Book 66, Hadith 19","grade":"","question #":"question #3","question":"In what ways can generosity be compared to the fast wind in doing good deeds?","id":"bukhari-66-189"},{"hadith-eng":"Gabriel used to repeat the recitation of the Qur'an with the Prophet (ﷺ) once a year, but he repeated it \ntwice with him in the year he died. The Prophet (ﷺ) used to stay in I`tikaf for ten days every year (in the \nmonth of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.","reference":"Sahih al-Bukhari 4998, Book 66, Hadith 20","grade":"","question #":"question #3","question":"What can be inferred about the importance of the Qur'an and I`tikaf from the practices of the Prophet Muhammad (ﷺ) in his final year?","id":"bukhari-66-190"},{"hadith-eng":"`Abdullah bin `Amr mentioned `Abdullah bin Masud and said, \"I shall ever love that man, for I heard \nthe Prophet (ﷺ) saying, 'Take (learn) the Qur'an from four: `Abdullah bin Masud, Salim, Mu`adh and Ubai \nbin Ka`b.' \"","reference":"Sahih al-Bukhari 4999, Book 66, Hadith 21","grade":"","question #":"question #3","question":"How does the recommendation of certain companions highlight the importance of selecting knowledgeable teachers in Islam?","id":"bukhari-66-191"},{"hadith-eng":"Once `Abdullah bin Mas`ud delivered a sermon before us and said, \"By Allah, I learnt over seventy \nSuras direct from Allah's Messenger (ﷺ) . By Allah, the companions of the Prophet (ﷺ) came to know that I am \none of those who know Allah's Book best of all of them, yet I am not the best of them.\" Shaqiq added: \nI sat in his religious gathering and I did not hear anybody opposing him (in his speech).","reference":"Sahih al-Bukhari 5000, Book 66, Hadith 22","grade":"","question #":"question #3","question":"What can be inferred about the respect and acceptance of authority among the companions from this narration?","id":"bukhari-66-192"},{"hadith-eng":"While we were in the city of Hims (in Syria), Ibn Mas`ud recited Surat Yusuf. A man said to him), \"It \nwas not revealed in this way.\" Then Ibn Mas`ud said, \"I recited it in this way before Allah's Messenger (ﷺ) \nand he confirmed my recitation by saying, 'Well done!' \" Ibn Mas`ud detected the smell of wine from \nthe man's mouth, so he said to him, \"Aren't you ashamed of telling a lie about Allah's Book and (along \nwith this) you drink alcoholic liquors too?\" Then he lashed him according to the law.","reference":"Sahih al-Bukhari 5001, Book 66, Hadith 23","grade":"","question #":"question #3","question":"What are the consequences of consuming alcohol in Islamic law?","id":"bukhari-66-193"},{"hadith-eng":"By Allah other than Whom none has the right to be worshipped! There is no Sura revealed in Allah's \nBook but I know at what place it was revealed; and there is no Verse revealed in Allah's Book but I \nknow about whom it was revealed. And if I know that there is somebody who knows Allah's Book \nbetter than I, and he is at a place that camels can reach, I would go to him.","reference":"Sahih al-Bukhari 5002, Book 66, Hadith 24","grade":"","question #":"question #3","question":"What can be inferred about the narrator's commitment to seeking knowledge from others in this narration?","id":"bukhari-66-194"},{"hadith-eng":"I asked Anas bin Malik: \"Who collected the Qur'an at the time of the Prophet (ﷺ) ?\" He replied, \"Four, all \nof whom were from the Ansar: Ubai bin Ka`b, Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid.\"","reference":"Sahih al-Bukhari 5003, Book 66, Hadith 25","grade":"","question #":"question #3","question":"How did the companions of the Prophet contribute to the compilation of the Qur'an?","id":"bukhari-66-195"},{"hadith-eng":"When the Prophet (ﷺ) died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin \nJabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .","reference":"Sahih al-Bukhari 5004, Book 66, Hadith 26","grade":"","question #":"question #3","question":"How was the inheritance handled for companions who had no offspring?","id":"bukhari-66-196"},{"hadith-eng":"`Umar said, Ubai was the best of us in the recitation (of the Qur'an) yet we leave some of what he \nrecites.' Ubai says, 'PI have taken it from the mouth of Allah's Messenger (ﷺ) and will not leave for anything \nwhatever.\" But Allah said \"None of Our Revelations do We abrogate or cause to be forgotten but We \nsubstitute something better or similar.\" 2.106","reference":"Sahih al-Bukhari 5005, Book 66, Hadith 27","grade":"","question #":"question #3","question":"What is the role of individual reciters in preserving the Quranic text, and how does it relate to divine guidance?","id":"bukhari-66-197"},{"hadith-eng":"While I was praying, the Prophet (ﷺ) called me but I did not respond to his call. Later I said, \"O Allah's \nApostle! I was praying.\" He said, \"Didn't Allah say: 'O you who believe! Give your response to Allah \n(by obeying Him) and to His Apostle when he calls you'?\" (8.24) \nHe then said, \"Shall I not teach you the most superior Surah in the Qur'an?\" He said, '(It is), \n'Praise be to Allah, the Lord of the worlds. ' (i.e., Surat Al-Fatiha) which consists of seven repeatedly \nrecited Verses and the Magnificent Qur'an which was given to me.\"","reference":"Sahih al-Bukhari 5006, Book 66, Hadith 28","grade":"","question #":"question #3","question":"What is the importance of Surat Al-Fatiha in Islamic prayer?","id":"bukhari-66-198"},{"hadith-eng":"While we were on one of our journeys, we dismounted at a place where a slave girl came and said, \n\"The chief of this tribe has been stung by a scorpion and our men are not present; is there anybody \namong you who can treat him (by reciting something)?\" Then one of our men went along with her \nthough we did not think that he knew any such treatment. But he treated the chief by reciting \nsomething, and the sick man recovered whereupon he gave him thirty sheep and gave us milk to drink \n(as a reward). When he returned, we asked our friend, \"Did you know how to treat with the recitation \nof something?\" He said, \"No, but I treated him only with the recitation of the Mother of the Book (i.e., \nAl-Fatiha).\" We said, \"Do not say anything (about it) till we reach or ask the Prophet (ﷺ) so when we \nreached Medina, we mentioned that to the Prophet (in order to know whether the sheep which we had \ntaken were lawful to take or not). The Prophet (ﷺ) said, \"How did he come to know that it (Al-Fatiha) \ncould be used for treatment? Distribute your reward and assign for me one share thereof as well.\"","reference":"Sahih al-Bukhari 5007, Book 66, Hadith 29","grade":"","question #":"question #3","question":"What role does consultation with the Prophet (ﷺ) play in validating actions and decisions in early Islamic society?","id":"bukhari-66-199"},{"hadith-eng":"Whoever recites two verses ... (text as in the following hadith)","reference":"Sahih al-Bukhari 5008, Book 66, Hadith 30","grade":"","question #":"question #3","question":"What role does the recitation of Quranic verses play in the daily life of a Muslim?","id":"bukhari-66-200"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"","reference":"Sahih al-Bukhari 5009, Book 66, Hadith 31","grade":"","question #":"question #3","question":"What are the benefits associated with reciting Quranic verses before sleeping?","id":"bukhari-66-201"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing from the foodstuff. I caught him and said, \"I will take you to Allah's Messenger (ﷺ)!\" Then Abu Huraira described the whole narration and said: That person said (to me), \"(Please don't take me to Allah's Messenger (ﷺ) and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet (ﷺ) heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"","reference":"Sahih al-Bukhari 5010, Book 66, Hadith 32","grade":"","question #":"question #3","question":"What lesson can be learned about the nature of truth and deception from the interaction between Abu Huraira and the thief?","id":"bukhari-66-202"},{"hadith-eng":"A man was reciting Surat Al-Kahf and his horse was tied with two ropes beside him. A cloud came \ndown and spread over that man, and it kept on coming closer and closer to him till his horse started \njumping (as if afraid of something). When it was morning, the man came to the Prophet, and told him \nof that experience. The Prophet (ﷺ) said, \"That was As-Sakina (tranquility) which descended because of \n(the recitation of) the Qur'an.\"","reference":"Sahih al-Bukhari 5011, Book 66, Hadith 33","grade":"","question #":"question #3","question":"What can be inferred about the spiritual impact of reciting Surat Al-Kahf from this narration?","id":"bukhari-66-203"},{"hadith-eng":"Allah's Messenger (ﷺ) was traveling on one of his journeys, and `Umar bin Al-Khattab was traveling along \nwith him at night. `Umar asked him about something, but Allah's Messenger (ﷺ) did not answer him. He \nasked again, but he did not answer. He asked for the third time, but he did not answer. On that, `Umar \nsaid to himself, \"May your mother lose you! You have asked Allah's Messenger (ﷺ) three times, but he did \nnot answer at all!\" `Umar said, \"So I made my camel go fast till I was ahead of the people, and I was \nafraid that something might be revealed about me. After a little while I heard a call maker calling me, \nI said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's \nApostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to \nme than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O \nMuhammad), a manifest victory.' \" (Surat al-Fath) No. (48.1).","reference":"Sahih al-Bukhari 5012, Book 66, Hadith 34","grade":"","question #":"question #3","question":"What significance does the revelation of Surah al-Fath hold in the context of this journey?","id":"bukhari-66-204"},{"hadith-eng":"A man heard another man reciting (Surat-Al-Ikhlas) 'Say He is Allah, (the) One.' (112. 1) repeatedly. The next morning he came to Allah's Messenger (ﷺ) and informed him about it as if he thought that it was not enough to recite. On that Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, this Surah is equal to one-third of the Qur'an!\"","reference":"Sahih al-Bukhari 5013, Book 66, Hadith 35","grade":"","question #":"question #3","question":"What does the comparison of Surah Al-Ikhlas to one-third of the Quran imply about its meaning and message?","id":"bukhari-66-205"},{"hadith-eng":"My brother, Qatada bin An-Nau'man said, \"A man performed the night prayer late at night in the lifetime of the Prophet (ﷺ) and he read: 'Say: He is Allah, (the) One,' (112.1) and read nothing besides that. The next morning a man went to the Prophet (ﷺ) ,~ and told him about that . (The Prophet (ﷺ) replied the same as (in Hadith 532) above.)","reference":"Sahih al-Bukhari 5014, Book 66, Hadith 36","grade":"","question #":"question #3","question":"What can be learned about the acceptance of different recitations in prayer from this narration?","id":"bukhari-66-206"},{"hadith-eng":"The Prophet (ﷺ) said to his companions, \"Is it difficult for any of you to recite one third of the Qur'an in \none night?\" This suggestion was difficult for them so they said, \"Who among us has the power to do \nso, O Allah's Messenger (ﷺ)?\" Allah Apostle replied: \" Allah (the) One, the Self-Sufficient Master Whom all \ncreatures need.' (Surat Al-Ikhlas 112.1--to the End) is equal to one third of the Qur'an.\"","reference":"Sahih al-Bukhari 5015, Book 66, Hadith 37","grade":"","question #":"question #3","question":"What challenges might people face in reciting large portions of the Qur'an, and how can Surah Al-Ikhlas serve as an alternative?","id":"bukhari-66-207"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) became sick, he would recite Mu'awwidhat (Surat Al-Falaq and Surat An- \nNas) and then blow his breath over his body. When he became seriously ill, I used to recite (these two \nSuras) and rub his hands over his body hoping for its blessings.","reference":"Sahih al-Bukhari 5016, Book 66, Hadith 38","grade":"","question #":"question #3","question":"What role does seeking blessings through recitation and physical actions play in Islamic healing practices?","id":"bukhari-66-208"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to bed every night, he used to cup his hands together and blow over it after reciting Surat Al-Ikhlas, Surat Al-Falaq and Surat An-Nas, and then rub his hands over whatever parts of his body he was able to rub, starting with his head, face and front of his body. He used to do that three times.","reference":"Sahih al-Bukhari 5017, Book 66, Hadith 39","grade":"","question #":"question #3","question":"What is the purpose of blowing over one's hands after reciting certain Surahs according to the Sunnah?","id":"bukhari-66-209"},{"hadith-eng":"That while he was reciting Surat Al-Baqara (The Cow) at night, and his\r\n     horse was tied beside him, the horse was suddenly startled and \r\n     troubled. When he stopped reciting, the horse became quiet, and when \r\n     he started again, the horse was startled again. Then he stopped \r\n     reciting and the horse became quiet too. He started reciting again and\r\n     the horse was startled and troubled once again. Then he stopped \r\n     reciting and his son, Yahya was beside the horse. He was afraid that \r\n     the horse might trample on him. When he took the boy away and looked \r\n     towards the sky, he could not see it. The next morning he informed the\r\n     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn \r\n     Hudair replied, \"O Allah's Messenger (ﷺ)! My son, Yahya was near the horse \r\n     and I was afraid that it might trample on him, so I looked towards the\r\n     sky, and went to him. When I looked at the sky, I saw something like a\r\n     cloud containing what looked like lamps, so I went out in order not to\r\n     see it.\" The Prophet (ﷺ) said, \"Do you know what that was?\" Ibn Hudair \r\n     replied, \"No.\" The Prophet (ﷺ) said, \"Those were Angels who came near to \r\n     you for your voice and if you had kept on reciting till dawn, it would\r\n     have remained there till morning when people would have seen it as it \r\n     would not have disappeared.","reference":"Sahih al-Bukhari 5018, Book 66, Hadith 40","grade":"","question #":"question #3","question":"What precautions should be taken when reciting the Quran in the presence of animals or children?","id":"bukhari-66-210"},{"hadith-eng":"Shaddad bin Ma'qil and I entered upon Ibn `Abbas. Shaddad bin Ma'qil asked him, \"Did the Prophet (ﷺ) \nleave anything (besides the Qur'an)?\" He replied. \"He did not leave anything except what is Between \nthe two bindings (of the Qur'an).\" Then we visited Muhammad bin Al-Hanafiyya and asked him (the \nsame question). He replied, \"The Prophet (ﷺ) did not leave except what is between the bindings (of the \nQur'an).","reference":"Sahih al-Bukhari 5019, Book 66, Hadith 41","grade":"","question #":"question #3","question":"What is the significance of the Qur'an in the teachings left by the Prophet (ﷺ)?","id":"bukhari-66-211"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of him (a believer) who recites the Qur'an is like that of a citron \nwhich tastes good and smells good. And he (a believer) who does not recite the Qur'an is like a date \nwhich is good in taste but has no smell. And the example of a dissolute wicked person who recites the \nQur'an is like the Raihana (sweet basil) which smells good but tastes bitter. And the example of a \ndissolute wicked person who does not recite the Qur'an is like the colocynth which tastes bitter and \nhas no smell.","reference":"Sahih al-Bukhari 5020, Book 66, Hadith 42","grade":"","question #":"question #3","question":"How is a wicked person who recites the Qur'an compared to one who does not in terms of their qualities?","id":"bukhari-66-212"},{"hadith-eng":"The Prophet (ﷺ) said, \"Your life in comparison to the lifetime of the past nations is like the period \r\nbetween the time of `Asr prayer and sunset. Your example and the example of the Jews and Christians \r\nis that of person who employed laborers and said to them, \"Who will work for me till the middle of \r\nthe day for one Qirat (a special weight)?' The Jews did. He then said, \"Who will work for me from the \r\nmiddle of the day till the `Asr prayer for one Qirat each?\" The Christians worked accordingly. Then \r\nyou (Muslims) are working from the `Asr prayer till the Maghrib prayer for two Qirats each. They (the \r\nJews and the Christians) said, 'We did more labor but took less wages.' He (Allah) said, 'Have I \r\nwronged you in your rights?' They replied, 'No.' Then He said, 'This is My Blessing which I give to \r\nwhom I wish.\"","reference":"Sahih al-Bukhari 5021, Book 66, Hadith 43","grade":"","question #":"question #3","question":"How does the hadith explain the concept of Allah's blessings and His discretion in granting them?","id":"bukhari-66-213"},{"hadith-eng":"I asked `Abdullah bin Abi `Aufa, \"Did the Prophet (ﷺ) make a will (to appoint his successor or bequeath \nwealth)?\" He replied, \"No.\" I said, \"How is it prescribed then for the people to make wills, and they \nare ordered to do so while the Prophet (ﷺ) did not make any will?\" He said, \"He made a will wherein he \nrecommended Allah's Book.\"","reference":"Sahih al-Bukhari 5022, Book 66, Hadith 44","grade":"","question #":"question #3","question":"How does the practice of making a will reflect the values and principles taught in the Quran?","id":"bukhari-66-214"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a pleasant tone.\" The companion of the sub-narrator (Abu Salama) said, \"It means, reciting \nit aloud.\"","reference":"Sahih al-Bukhari 5023, Book 66, Hadith 45","grade":"","question #":"question #3","question":"What is the relationship between a prophet's recitation of the Qur'an and Allah's attention?","id":"bukhari-66-215"},{"hadith-eng":"The Prophet (ﷺ) I said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a loud and pleasant tone.\" Sufyan said, \"This saying means: a prophet who regards the \nQur'an as something that makes him dispense with many worldly pleasures.\"","reference":"Sahih al-Bukhari 5024, Book 66, Hadith 46","grade":"","question #":"question #3","question":"Why does Allah listen attentively to a prophet reciting the Qur'an?","id":"bukhari-66-216"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Not to wish to be the like except of two men. A man whom Allah has given the \nknowledge of the Book and he recites it during the hours of the night, and a man whom Allah has \ngiven wealth, and he spends it in charity during the night and the hours of the day.\"","reference":"Sahih al-Bukhari 5025, Book 66, Hadith 47","grade":"","question #":"question #3","question":"What is the significance of spending wealth in charity both during the night and day in Islam?","id":"bukhari-66-217"},{"hadith-eng":"Allah's Messenger (ﷺ) I said, \"Not to wish to be the like of except two men: A man whom Allah has taught \nthe Qur'an and he recites it during the hours of the night and during the hours of the day, and his \nneighbor listens to him and says, 'I wish I had been given what has been given to so-and-so, so that I \nmight do what he does; and a man whom Allah has given wealth and he spends it on what is just and \nright, whereupon an other man May say, 'I wish I had been given what so-and-so has been given, for \nthen I would do what he does.\"","reference":"Sahih al-Bukhari 5026, Book 66, Hadith 48","grade":"","question #":"question #3","question":"What is the significance of spending wealth justly and rightly in Islam?","id":"bukhari-66-218"},{"hadith-eng":"The Prophet (ﷺ) said, \"The best among you (Muslims) are those who learn the Qur'an and teach it.\"","reference":"Sahih al-Bukhari 5027, Book 66, Hadith 49","grade":"","question #":"question #3","question":"How does the act of teaching the Qur'an benefit the Muslim community?","id":"bukhari-66-219"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most superior among you (Muslims) are those who learn the Qur'an and teach \nit.\"","reference":"Sahih al-Bukhari 5028, Book 66, Hadith 50","grade":"","question #":"question #3","question":"How does the act of teaching the Qur'an contribute to a person's status in the Muslim community?","id":"bukhari-66-220"},{"hadith-eng":"A lady came to the Prophet (ﷺ) and declared that she had decided to offer herself to Allah and His \nApostle. The Prophet (ﷺ) said, \"I am not in need of women.\" A man said (to the Prophet) \"Please marry \nher to me.\" The Prophet (ﷺ) said (to him), \"Give her a garment.\" The man said, \"I cannot afford it.\" The \nProphet said, \"Give her anything, even if it were an iron ring.\" The man apologized again. The \nProphet then asked him, \"What do you know by heart of the Qur'an?\" He replied, \"I know such-andsuch \nportion of the Qur'an (by heart).\" The Prophet (ﷺ) said, \"Then I marry her to you for that much of the \nQur'an which you know by heart.\"","reference":"Sahih al-Bukhari 5029, Book 66, Hadith 51","grade":"","question #":"question #3","question":"What alternatives are suggested in Islam when a person cannot afford a traditional dowry?","id":"bukhari-66-221"},{"hadith-eng":"A lady came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to you to offer myself to \nyou.\" He raised his eyes and looked at her and then lowered his head. When the lady saw that he did \nnot make any decision, she sat down. On that, a man from his companions got up and said. \"O Allah's \nApostle! If you are not in need of this woman, then marry her to me.\" Allah's Messenger (ﷺ) said, \"Do you \nhave anything to offer her?\" He replied. \"No, by Allah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said to him, \n\"Go to your family and see if you can find something.' The man went and returned, saying, \"No, by \nAllah, O Allah's Messenger (ﷺ)! I have not found anything.\" The Prophet (ﷺ) said, \"Try to find something, even \nif it is an iron ring.'' He went again and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ), not even \nan iron ring, but I have this waist sheet of mine.\" The man had no upper garment, so he intended to \ngive her, half his waist sheet. So Allah's Messenger (ﷺ) said, ''What would she do with your waist sheet? If \nyou wear it, she will have nothing of it over her body, and if she wears it, you will have nothing over \nyour body.\" So that man sat for a long period and then got up, and Allah's Messenger (ﷺ) saw him going \naway, so he ordered somebody to call him. When he came, the Prophet (ﷺ) asked him, \" How much of the \nQur'an do you know?\" He replied, \"I know such Surat and such Surat and such Surat,\" and went on \ncounting it, The Prophet (ﷺ) asked him, \"Can you recite it by heart?\" he replied, \"Yes.\" The Prophet (ﷺ) said, \n\"Go, I have married this lady to you for the amount of the Qur'an you know by heart.\"","reference":"Sahih al-Bukhari 5030, Book 66, Hadith 52","grade":"","question #":"question #3","question":"What alternatives are considered acceptable in Islam when a person lacks material wealth for a marriage proposal?","id":"bukhari-66-222"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The example of the person who knows the Qur'an by heart is like the owner of \ntied camels. If he keeps them tied, he will control them, but if he releases them, they will run away.\"","reference":"Sahih al-Bukhari 5031, Book 66, Hadith 53","grade":"","question #":"question #3","question":"What are the potential consequences of neglecting the memorization and recitation of the Qur'an?","id":"bukhari-66-223"},{"hadith-eng":"The Prophet (ﷺ) said, \"It is a bad thing that some of you say, 'I have forgotten such-and-such verse of the \nQur'an,' for indeed, he has been caused (by Allah) to forget it. So you must keep on reciting the Qur'an \nbecause it escapes from the hearts of men faster than camel do.\"","reference":"Sahih al-Bukhari 5032, Book 66, Hadith 54","grade":"","question #":"question #3","question":"What is the implication of forgetting verses of the Qur'an according to Islamic teachings?","id":"bukhari-66-224"},{"hadith-eng":"The Prophet (ﷺ) said, \"Commit yourself to the Qur'an, for by Him in whose Hand is my soul, it is surely more prone to break away than a camel in its bind.","reference":"Sahih al-Bukhari 5033, Book 66, Hadith 56","grade":"","question #":"question #3","question":"Why is it important to consistently engage with the Qur'an according to Islamic teachings?","id":"bukhari-66-225"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) reciting Surat-al-Fath on his she-camel on the day of the Conquest of Mecca.","reference":"Sahih al-Bukhari 5034, Book 66, Hadith 57","grade":"","question #":"question #3","question":"What can be learned from the Prophet's actions during the Conquest of Mecca regarding the recitation of the Quran?","id":"bukhari-66-226"},{"hadith-eng":"Those Suras which you people call the Mufassal, are the Muhkam. And Ibn `Abbas said, \"Allah's \nApostle died when I was a boy of ten years, and I had learnt the Muhkam (of the Qur'an).","reference":"Sahih al-Bukhari 5035, Book 66, Hadith 58","grade":"","question #":"question #3","question":"What does the term 'Muhkam' refer to in the context of the Quran?","id":"bukhari-66-227"},{"hadith-eng":"Ibn `Abbas said, \"I have learnt all the Muhkam Suras during the life time of Allah's Messenger (ﷺ).\" I said to \nhim, 'What is meant by the Muhkam?\" He replied, \"The Mufassal.\"","reference":"Sahih al-Bukhari 5036, Book 66, Hadith 59","grade":"","question #":"question #3","question":"What is the meaning and importance of the term 'Mufassal' in the context of the Quran?","id":"bukhari-66-228"},{"hadith-eng":"The Prophet (ﷺ) heard a man reciting the Qur'an in the mosque and said, \"May Allah bestow His Mercy \non him, as he has reminded me of such-and-such Verses of such a Surah.\"","reference":"Sahih al-Bukhari 5037, Book 66, Hadith 60","grade":"","question #":"question #3","question":"What is the importance of invoking Allah's mercy upon someone who recites the Qur'an?","id":"bukhari-66-229"},{"hadith-eng":"Allah's Messenger (ﷺ) heard a man reciting the Qur'an at night, and said, \"May Allah bestow His Mercy on \nhim, as he has reminded me of such-and-such Verses of such-and-such Suras, which I was caused to \nforget.\"","reference":"Sahih al-Bukhari 5038, Book 66, Hadith 62","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) attitude towards those who recite the Qur'an?","id":"bukhari-66-230"},{"hadith-eng":"The Prophet (ﷺ) said, \"Why does anyone of the people say, 'I have forgotten such-and-such Verses (of the \nQur'an)?' He, in fact, is caused (by Allah) to forget.\"","reference":"Sahih al-Bukhari 5039, Book 66, Hadith 63","grade":"","question #":"question #3","question":"What might be the implications of claiming personal responsibility for forgetting Quranic verses?","id":"bukhari-66-231"},{"hadith-eng":"The Prophet (ﷺ) said, \"If one recites the last two verses of Surat al-Baqarah at night, it is sufficient for him (for that night).\"","reference":"Sahih al-Bukhari 5040, Book 66, Hadith 64","grade":"","question #":"question #3","question":"What benefits are associated with reciting the last two verses of Surat al-Baqarah according to Islamic teachings?","id":"bukhari-66-232"},{"hadith-eng":"I heard Hisham bin Hakim bin Hizam reciting Surat-al-Furqan during the lifetime of Allah's Messenger (ﷺ), \nand I listened to his recitation and noticed that he recited it in several ways which Allah's Messenger (ﷺ) had \nnot taught me. So I was on the point of attacking him in the prayer, but I waited till he finished his \nprayer, and then I seized him by the collar and said, \"Who taught you this Surah which I have heard \nyou reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to me.\" I said, \"You are telling a lie; By Allah! \nAllah's Messenger (ﷺ) taught me (in a different way) this very Surah which I have heard you reciting.\" So I \ntook him, leading him to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I heard this person reciting \nSurat-al-Furqan in a way that you did not teach me, and you have taught me Surat-al-Furqan.\" The \nProphet said, \"O Hisham, recite!\" So he recited in the same way as I heard him recite it before. On \nthat Allah's Messenger (ﷺ) said, \"It was revealed to be recited in this way.\" Then Allah's Messenger (ﷺ) said, \n\"Recite, O `Umar!\" So I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed to \nbe recited in this way.\" Allah\" Apostle added, \"The Qur'an has been revealed to be recited in several \ndifferent ways, so recite of it that which is easier for you.\"","reference":"Sahih al-Bukhari 5041, Book 66, Hadith 65","grade":"","question #":"question #3","question":"What is the significance of the Qur'an being revealed to be recited in several different ways?","id":"bukhari-66-233"},{"hadith-eng":"The Prophet (ﷺ) heard a reciter reciting, the Qur'an in the mosque at night. The Prophet (ﷺ) said, \"May Allah \nbestow His Mercy on him, as he has remind ed me of such-and-such Verses of such and-such Suras, \nwhich I missed!\"","reference":"Sahih al-Bukhari 5042, Book 66, Hadith 66","grade":"","question #":"question #3","question":"What is the impact of being reminded of forgotten verses of the Qur'an?","id":"bukhari-66-234"},{"hadith-eng":"We went to `Abdullah in the morning and a man said, \"Yesterday I recited all the Mufassal Suras.\" On \nthat `Abdullah said, \"That is very quick, and we have the (Prophet's) recitation, and I remember very \nwell the recitation of those Suras which the Prophet (ﷺ) used to recite, and they were eighteen Suras from \nthe Mufassal, and two Suras from the Suras that start with Ha Mim.","reference":"Sahih al-Bukhari 5043, Book 66, Hadith 67","grade":"","question #":"question #3","question":"What significance do the Suras starting with Ha Mim hold in the Prophet's recitation?","id":"bukhari-66-235"},{"hadith-eng":"Regarding His (Allah's) Statement:-- 'Move not your tongue concerning (the Qur'an) to make haste \ntherewith.' (75.16) And whenever Gabriel descended to Allah's Messenger (ﷺ) with the Divine Inspiration, \nAllah's Messenger (ﷺ) used to move his tongue and lips, and that used to be hard for him, and one could \neasily recognize that he was being inspired Divinely. So Allah revealed the Verse which occurs in the \nSurah starting with \"I do swear by the Day of Resurrection.' (75.1) i.e. 'Move not your tongue \nconcerning (the Qur'an) to make haste then with. It is for Us to collect it (in your mind) (O \nMuhammad) an give you the ability to recite it 'by heart.' (75.16-17) which means: It is for us to \ncollect it (in your mind) and give you the ability to recite it by heart. And when We have recited it to \nyou (O Muhammad) through Gabriel then follow you its recital. (75.18) means: 'When We reveal it \n(the Qur'an) to you, Listen to it.' for then: It is for Us to explain it and make it clear to you' (75.19) \ni.e. It is up to Us to explain it through your tongue. So, when Gabriel came to him, Allah's Messenger (ﷺ) \nwould listen to him attentively, and as soon as Gabriel left, he would recite the Revelations, as Allah \nhad promised him.","reference":"Sahih al-Bukhari 5044, Book 66, Hadith 68","grade":"","question #":"question #3","question":"What does the process of revelation and explanation of the Qur'an entail according to Islamic teachings?","id":"bukhari-66-236"},{"hadith-eng":"I asked Anas bin Malik about the recitation of the Prophet. He said, \"He used to pray long (certain \nsounds) very much.","reference":"Sahih al-Bukhari 5045, Book 66, Hadith 69","grade":"","question #":"question #3","question":"What significance does the length of certain sounds in prayer have in Islamic practice?","id":"bukhari-66-237"},{"hadith-eng":"Anas was asked, \"How was the recitation (of the Qur'an) of the Prophet?' He replied, \"It was \ncharacterized by the prolongation of certain sounds.\" He then recited: In the Name of Allah, the Most \nBeneficent, the Most Merciful prolonging the pronunciation of 'In the Name of Allah, 'the most \nBeneficent,' and 'the Most Merciful.","reference":"Sahih al-Bukhari 5046, Book 66, Hadith 70","grade":"","question #":"question #3","question":"How does the recitation style of the Prophet Muhammad (ﷺ) reflect on the understanding of the Qur'an?","id":"bukhari-66-238"},{"hadith-eng":"I saw the Prophet (ﷺ) reciting (Qur'an) while he was riding on his she camel or camel which was moving, \ncarrying him. He was reciting Surat Fath or part of Surat Fath very softly and in an Attractive \nvibrating tone.","reference":"Sahih al-Bukhari 5047, Book 66, Hadith 71","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's engagement with the Qur'an during his journeys?","id":"bukhari-66-239"},{"hadith-eng":"That the Prophet (ﷺ) said to him' \"O Abu Musa! You have been given one of themazamir(sweet melodious voices) of the family of David.'","reference":"Sahih al-Bukhari 5048, Book 66, Hadith 72","grade":"","question #":"question #3","question":"What qualities are associated with Abu Musa in the context of his voice?","id":"bukhari-66-240"},{"hadith-eng":"That the Prophet (ﷺ) said to him, \"Recite the Qur'an to me.\" `Abdullah said, \"Shall I recite (the Qur'an) to \nyou while it has been revealed to you?\" He said, \"I like to hear it from others.\"","reference":"Sahih al-Bukhari 5049, Book 66, Hadith 73","grade":"","question #":"question #3","question":"What can be learned about the humility of the Prophet (ﷺ) from his desire to hear the Qur'an recited by others?","id":"bukhari-66-241"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Recite (the Qur'an) to me.\" I said, \"O Allah's Messenger (ﷺ) Shall I recite (the \nQur'an) to you while it has been revealed to you?\" He said, \"Yes.\" So I recited Surat-An-Nisa' (The \nWomen), but when I recited the Verse: \n'How (will it be) then when We bring from each nation a witness and We bring you (O Muhammad) \nas a witness against these people.' (4.41) He said, \"Enough for the present,\" I looked at him and \nbehold! His eyes were overflowing with tears","reference":"Sahih al-Bukhari 5050, Book 66, Hadith 74","grade":"","question #":"question #3","question":"What is the role of the Prophet Muhammad (ﷺ) as a witness according to the Qur'an?","id":"bukhari-66-242"},{"hadith-eng":"Ibn Shubruma said, \"I wanted to see how much of the Qur'an can be enough (to recite in prayer) and I could not find a Surah containing less than three Verses, therefore I said to myself), \"One ought not to recite less than three (Quranic) Verses (in prayer).\"","reference":"Sahih al-Bukhari 5051, Book 66, Hadith 75","grade":"","question #":"question #3","question":"How does the recitation of Quranic verses in prayer relate to the completeness of the prayer?","id":"bukhari-66-243"},{"hadith-eng":"My father got me married to a lady of a noble family, and often used to ask my wife about me, and she \nused to reply, \"What a wonderful man he is! He never comes to my bed, nor has he approached me \nsince he married me.\" When this state continued for a long period, my father told the story to the \nProphet who said to my father, \"Let me meet him.\" Then I met him and he asked me, \"How do you \nfast?\" I replied, \"I fast daily,\" He asked, \"How long does it take you to finish the recitation of the \nwhole Qur'an?\" I replied, \"I finish it every night.\" On that he said, \"Fast for three days every month \nand recite the Qur'an (and finish it) in one month.\" I said, \"But I have power to do more than that.\" He \nsaid, \"Then fast for three days per week.\" I said, \"i have the power to do more than that.\" He said, \n\"Therefore, fast the most superior type of fasting, (that is, the fasting of (prophet) David who used to \nfast every alternate day; and finish the recitation of the whole Qur'an In seven days.\" I wish I had \naccepted the permission of Allah's Messenger (ﷺ) as I have become a weak old man. It is said that `Abdullah \nused to recite one-seventh of the Qur'an during the day-time to some of his family members, for he \nused to check his memorization of what he would recite at night during the daytime so that it would be \neasier for him to read at night. And whenever he wanted to gain some strength, he used to give up \nfasting for some days and count those days to fast for a similar period, for he disliked to leave those \nthings which he used to do during the lifetime of the Prophet.","reference":"Sahih al-Bukhari 5052, Book 66, Hadith 77","grade":"","question #":"question #3","question":"What is the significance of moderation in religious practices in Islam?","id":"bukhari-66-244"},{"hadith-eng":"The Prophet (ﷺ) asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"","reference":"Sahih al-Bukhari 5053, Book 66, Hadith 78","grade":"","question #":"question #3","question":"What are the recommended practices for reciting the Qur'an regularly?","id":"bukhari-66-245"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power \n(to do more than that).\" Allah's Messenger (ﷺ) said, \"Then finish the recitation of the Qur'an in seven days, \nand do not finish it in less than this period.\"","reference":"Sahih al-Bukhari 5054, Book 66, Hadith 79","grade":"","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) guide individuals in balancing their ability with religious practices?","id":"bukhari-66-246"},{"hadith-eng":"Allah's Messenger (ﷺ) said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa \n(The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a \nwitness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to \nme, \"Stop!\" Thereupon I saw his eyes overflowing with tears.","reference":"Sahih al-Bukhari 5055, Book 66, Hadith 80","grade":"","question #":"question #3","question":"What significance does the verse from Surat An-Nisa hold in the context of the Prophet Muhammad (ﷺ) being a witness?","id":"bukhari-66-247"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Recite Qur'an to me.\" I said to him. \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\"","reference":"Sahih al-Bukhari 5056, Book 66, Hadith 81","grade":"","question #":"question #3","question":"How does listening to the Qur'an from others contribute to one's understanding and appreciation of it?","id":"bukhari-66-248"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"In the last days (of the world) there will appear young people with foolish \nthoughts and ideas. They will give good talks, but they will go out of Islam as an arrow goes out of its \ngame, their faith will not exceed their throats. So, wherever you find them, kill them, for there will be \na reward for their killers on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 5057, Book 66, Hadith 82","grade":"","question #":"question #3","question":"What is the reward mentioned for those who deal with these individuals as instructed in the hadith?","id":"bukhari-66-249"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There will appear some people among you whose prayer will make \nyou look down upon yours, and whose fasting will make you look down upon yours, but they will \nrecite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of \nIslam as an arrow goes out through the game whereupon the archer would examine the arrowhead but \nsee nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see \nnothing, and finally he suspects to find something in the lower part of the arrow.\"","reference":"Sahih al-Bukhari 5058, Book 66, Hadith 83","grade":"","question #":"question #3","question":"What is the significance of the analogy of an arrow in describing those who deviate from Islam despite their outward religious observance?","id":"bukhari-66-250"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of a believer who recites the Qur'an and acts on it, like a citron which \ntastes nice and smells nice. And the example of a believer who does not recite the Qur'an but acts on \nit, is like a date which tastes good but has no smell. And the example of a hypocrite who recites the \nQur'an is like a Raihana (sweet basil) which smells good but tastes bitter And the example of a \nhypocrite who does not recite the Qur'an is like a colocynth which tastes bitter and has a bad smell.\"","reference":"Sahih al-Bukhari 5059, Book 66, Hadith 84","grade":"","question #":"question #3","question":"What is the comparison made between a hypocrite who recites the Qur'an and one who does not?","id":"bukhari-66-251"},{"hadith-eng":"The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but if \nyou have any difference of opinion (as regards to its interpretation and meaning) then you should stop \nreciting it (for the time being).","reference":"Sahih al-Bukhari 5060, Book 66, Hadith 85","grade":"","question #":"question #3","question":"What is the recommended approach when studying the Qur'an and encountering differing opinions?","id":"bukhari-66-252"},{"hadith-eng":"The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but \nwhen you have any difference of opinion (as regards its interpretation and meaning) then you should \nstop reciting it (for the time being)'","reference":"Sahih al-Bukhari 5061, Book 66, Hadith 86","grade":"","question #":"question #3","question":"What is the significance of studying the Qur'an with agreement on its interpretation?","id":"bukhari-66-253"},{"hadith-eng":"That he heard a man reciting a Quranic Verse which he had heard the Prophet (ﷺ) reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet (ﷺ) said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet (ﷺ) further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"","reference":"Sahih al-Bukhari 5062, Book 66, Hadith 87","grade":"","question #":"question #3","question":"What lesson can be learned from the Prophet's response to differing Quranic recitations?","id":"bukhari-66-254"}]