[{"hadith-eng":"I asked the Prophet (ﷺ) about the game killed by a Mi'rad (i.e. a sharp-edged piece of wood or a piece of \nwood provided with a sharp piece of iron used for hunting). He said, \"If the game is killed with its \nsharp edge, eat of it, but if it is killed with its shaft, with a hit by its broad side then the game is \n(unlawful to eat) for it has been beaten to death.\" I asked him about the game killed by a trained \nhound. He said, \"If the hound catches the game for you, eat of it, for killing the game by the hound, is \nlike its slaughtering. But if you see with your hound or hounds another dog, and you are afraid that it \nmight have shared in hunting the game with your hound and killed it, then you should not eat of it, \nbecause you have mentioned Allah's name on (sending) your hound only, but you have not mentioned \nit on some other hound.","reference":"Sahih al-Bukhari 5475, Book 72, Hadith 1","grade":"","question #":"question #1","question":"What are the conditions for the permissibility of eating game hunted with a sharp-edged tool?","id":"bukhari-72-1"},{"hadith-eng":"I asked Allah's Messenger (ﷺ) about the Mi'rad. He said, \"If you hit the game with its sharp edge, eat it, but if \nthe Mi'rad hits the game with its shaft with a hit by its broad side do not eat it, for it has been beaten to \ndeath with a piece of wood. (i.e. unlawful).\" I asked, \"If I let loose my trained hound after a game?\" \nHe said, \"If you let loose your trained hound after game, and mention the name of Allah, then you can \neat.\" I said, \"If the hound eats of the game?\" He said \"Then you should not eat of it, for the hound has \nhunted the game for itself and not for you.\" I said, \"Some times I send my hound and then I find some \nother hound with it?\" He said \"Don't eat the game, as you have mentioned the Name of Allah on your \ndog only and not on the other.\"","reference":"Sahih al-Bukhari 5476, Book 72, Hadith 2","grade":"","question #":"question #1","question":"What are the conditions for consuming game hunted with a Mi'rad according to Islamic teachings?","id":"bukhari-72-2"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! We let loose our trained hounds after a game?\" He said, \"Eat what they \nhunt for you.\" I said, \"Even if they killed (the game)?\" He replied, 'Even if they killed (the game).\" I \nsaid, 'We also hit (the game) with the Mi'rad?\" He said, \"Eat of the animal which the Mi'rad kills by \npiercing its body, but do not eat of the animal which is killed by the broad side of the Mi'rad.''","reference":"Sahih al-Bukhari 5477, Book 72, Hadith 3","grade":"","question #":"question #1","question":"What are the guidelines for consuming game hunted by trained animals in Islam?","id":"bukhari-72-3"},{"hadith-eng":"I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take \nour meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and \nwith my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He \nsaid, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other \nthan theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat \nout of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt \nsomething with your trained hound after mentioning Allah's Name, eat of it, and if you hunt \nsomething with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"","reference":"Sahih al-Bukhari 5478, Book 72, Hadith 4","grade":"","question #":"question #1","question":"What guidelines are provided for using utensils belonging to the People of the Scripture?","id":"bukhari-72-4"},{"hadith-eng":"that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw \r\nstones, for Allah's Messenger (ﷺ) has forbidden throwing stones, or he used to dislike it.\" `Abdullah added: \r\nThrowing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or \r\ngouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I \r\ntell you that Allah's Messenger (ﷺ) has forbidden or disliked the throwing the stones (in such a way), yet you \r\nare throwing stones! I shall not talk to you for such-and-such a period.\"","reference":"Sahih al-Bukhari 5479, Book 72, Hadith 5","grade":"","question #":"question #1","question":"What are the potential harms associated with throwing stones as mentioned in the narration?","id":"bukhari-72-5"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever keeps a (pet) dog which is neither a watch dog nor a hunting dog, will get \na daily deduction of two Qirat from his good deeds.\"","reference":"Sahih al-Bukhari 5480, Book 72, Hadith 6","grade":"","question #":"question #1","question":"What are the consequences of keeping a pet dog that is not used for guarding or hunting in Islam?","id":"bukhari-72-6"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If someone keeps a dog neither for hunting, nor for guarding livestock, \nthe reward (for his good deeds) will be reduced by two Qirats per day.\"","reference":"Sahih al-Bukhari 5481, Book 72, Hadith 7","grade":"","question #":"question #1","question":"What are the permissible reasons for keeping a dog in Islam?","id":"bukhari-72-7"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If someone keeps a dog neither for guarding livestock, nor for hunting, his good \ndeeds will decrease (in reward) by two Qirats a day.'","reference":"Sahih al-Bukhari 5482, Book 72, Hadith 8","grade":"","question #":"question #1","question":"What are the permissible reasons for keeping a dog in Islam?","id":"bukhari-72-8"},{"hadith-eng":"I asked Allah's Messenger (ﷺ). \"We hunt with the help of these hounds.\" He said, \"If you let loose your \ntrained hounds after a game, and mention the name of Allah, then you can eat what the hounds catch \nfor you, even if they killed the game. But you should not eat of it if the hound has eaten of it, for then \nit is likely that the hound has caught the game for itself. And if other hounds join your hound in \nhunting the game, then do not eat of it.\"","reference":"Sahih al-Bukhari 5483, Book 72, Hadith 9","grade":"","question #":"question #1","question":"What conditions must be met for hunted game to be permissible to eat in Islam?","id":"bukhari-72-9"},{"hadith-eng":"The Prophet (ﷺ) said, \"If you let loose your hound after a game and mention Allah's Name on sending it, \nand the hound catches the game and kills it, then you can eat of it. But if the hound eats of it, then you \nshould not eat thereof, for the hound has caught it for itself. And if along with your hound, joined other \nhounds, and Allah's Name was not mentioned at the time of their sending, and they catch an animal \nand kill it, you should not eat of it, for you will not know which of them has killed it. And if you have \nthrown an arrow at the game and then find it (dead) two or three days later and, it bears no mark other \nthan the wound inflicted by your arrow, then you can eat of it. But if the game is found (dead) in \nwater, then do not eat of it.\"","reference":"Sahih al-Bukhari 5484, Book 72, Hadith 10","grade":"","question #":"question #1","question":"What are the conditions for consuming game caught by a trained hunting animal in Islam?","id":"bukhari-72-10"},{"hadith-eng":"And it has also been narrated by `Adi bin Hatim that he asked the Prophet (ﷺ) \n\"If a hunter throws an arrow at the game and after tracing it for two or three days he finds it dead but \nstill bearing his arrow, (can he eat of it)?\" The Prophet (ﷺ) replied, \"He can eat if he wishes.\"","reference":"Sahih al-Bukhari 5485, Book 72, Hadith 11","grade":"","question #":"question #1","question":"What are the guidelines for consuming game meat that has been hunted with an arrow?","id":"bukhari-72-11"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! I let loose my hound after a game and mention Allah's Name on sending \nit.\" The Prophet (ﷺ) said, \"If you let loose your hound after a game and you mention Allah's Name on \nsending it and the hound catches and kills the game and eats of it, then you should not eat of it, for it \nhas killed it for itself.\" I said, \"Sometimes when I send my hound after a game, I find another hound \nalong with it and I do not know which of them has caught the game.\" He said, \"You must not eat of it \nbecause you have not mentioned, the Name of Allah except on sending your own hound, and you did \nnot mention it on the other hound.\" Then I asked him about the game hunted with a Mi'rad (i.e. a \nsharp edged piece of wood or a piece of wood provided with a sharp piece of iron used for hunting). \nHe said, \"If the game is killed with its sharp edge, you can eat of it, but if it is killed by its broad side \n(shaft), you cannot eat of it, for then it is like an animal beaten to death with a piece of wood.\"","reference":"Sahih al-Bukhari 5486, Book 72, Hadith 12","grade":"","question #":"question #1","question":"What are the conditions for consuming game hunted by a trained hound in Islamic law?","id":"bukhari-72-12"},{"hadith-eng":"I asked Allah's Messenger (ﷺ), \"We hunt with these hounds.\" He said, \"If you send your trained hounds after \na game and mention Allah's Name on sending, you can eat of what they catch for you. But if the \nhound eats of the game, then you must not eat of it, for I am afraid that the hound caught it for itself, \nand if another hound joins your hounds (during the hunt), you should not eat of the game.\"","reference":"Sahih al-Bukhari 5487, Book 72, Hadith 13","grade":"","question #":"question #1","question":"What are the conditions for consuming game caught by trained hunting dogs in Islam?","id":"bukhari-72-13"},{"hadith-eng":"I came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow \nand trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your \nsaying that you are living in the land of the people of the Scripture and that you eat in their utensils, if \nyou can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than \ntheirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if \nyou hung something with your bow, and have mentioned Allah's Name while hunting, then you can \neat (the game). And if you hunt something with your trained hound, and have mentioned Allah's \nName on sending it for hunting then you can eat (the game). But if you hunt something with your \nuntrained hound and you were able to slaughter it before its death, you can eat of it.\"","reference":"Sahih al-Bukhari 5488, Book 72, Hadith 14","grade":"","question #":"question #1","question":"What guidelines are provided for using utensils belonging to people of the Scripture?","id":"bukhari-72-14"},{"hadith-eng":"We provoked a rabbit at Marr Az-Zahran till it started jumping. My companions chased it till they got \ntired. But I alone ran after it and caught it and brought it to Abu Talha. He sent both its legs to the \nProphet who accepted them.","reference":"Sahih al-Bukhari 5489, Book 72, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of sharing food with the Prophet in Islamic tradition?","id":"bukhari-72-15"},{"hadith-eng":"that once he was with Allah's Messenger (ﷺ) (on the way to Mecca). When he had covered some of the way \nto Mecca, he and some companions of his, who were in the state of lhram. remained behind the \nProphet while Abu Qatada himself was not in the state of Ihram. Abu Qatada, seeing an onager rode \nhis horse and asked his companions to hand him a whip, but they refused. He then asked them to hand \nhim his spear, but they refused. Then he took it himself and attacked the onager and killed it. Some of \nthe Companions of Allah's Messenger (ﷺ) ate of it, but some others refused to eat. When they met Allah's \nApostle they asked him about that. He said, \"It was meal given to you by Allah.\"","reference":"Sahih al-Bukhari 5490, Book 72, Hadith 16","grade":"","question #":"question #1","question":"What is the ruling on hunting and consuming game meat while in the state of Ihram?","id":"bukhari-72-16"},{"hadith-eng":"(the same Hadith above, but he added); The Prophet (ﷺ) asked, \"Is there any of its meat left with you?\"","reference":"Sahih al-Bukhari 5491, Book 72, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of verifying the authenticity of a narration in Islamic tradition?","id":"bukhari-72-17"},{"hadith-eng":"I was with the Prophet (on a journey) between Mecca and Medina, and all of them, (i.e. the Prophet (ﷺ) \nand his companions) were in the state of Ihram, while I was not in that state. I was riding my horse \nand I used to be fond of ascending mountains. So while I was doing so I noticed that the people were \nlooking at something. I went to see what it was, and behold it was an onager. I asked my companions, \n\"What is that?\" They said, \"We do not know.\" I said, \"It is an onager.' They said, \"It is what you have \nseen.\" I had left my whip, so I said to them, \"Hand to me my whip.\" They said, \"We will not help you \nin that (in hunting the onager).\" I got down, took my whip and chased the animal (on my horse) and \ndid not stop till I killed it. I went to them and said, \"Come on, carry it!\" But they said, \"We will not \neven touch it.\" At last I alone carried it and brought it to them. Some of them ate of it and some \nrefused to eat of it. I said (to them), \"I will ask the Prophet (ﷺ) about it (on your behalf).\" When I met the \nProphet, I told him the whole story. He said to me, \"Has anything of it been left with you?\" I said, \n\"Yes.\" He said, \"Eat, for it is a meal Allah has offered to you.\"","reference":"Sahih al-Bukhari 5492, Book 72, Hadith 18","grade":"","question #":"question #1","question":"What is the ruling on hunting and consuming game meat while in the state of Ihram?","id":"bukhari-72-18"},{"hadith-eng":"We went out in a campaign and the army was called The Army of the Khabt, and Abu 'Ubaida was \nour commander. We were struck with severe hunger. Then the sea threw a huge dead fish called Al- \n`Anbar, the like of which had never been seen. We ate of it for half a month, and then Abu 'Ubaida \ntook one of its bones (and made an arch of it) so that a rider could easily pass under it.","reference":"Sahih al-Bukhari 5493, Book 72, Hadith 19","grade":"","question #":"question #1","question":"What challenges did the army face during the campaign led by Abu 'Ubaida?","id":"bukhari-72-19"},{"hadith-eng":"The Prophet (ﷺ) sent us as an army unit of three hundred warriors under the command of Abu 'Ubaida to \nambush a caravan of the Quraish. But we were struck with such severe hunger that we ate the Khabt \n(desert bushes), so our army was called the Army of the Khabt. Then the sea threw a huge fish called \nAl-`Anbar and we ate of it for half a month and rubbed our bodies with its fat till our bodies became \nhealthy. Then Abu Ubaida took one of its ribs and fixed it over the ground and a rider passed \nunderneath it. There was a man amongst us who slaughtered three camels when hunger became \nsevere, and he slaughtered three more, but after that Abu 'Ubaida forbade him to do so.","reference":"Sahih al-Bukhari 5494, Book 72, Hadith 20","grade":"","question #":"question #1","question":"What challenges did the army unit face during their mission under the command of Abu 'Ubaida?","id":"bukhari-72-20"},{"hadith-eng":"We participated with the Prophet (ﷺ) in six or seven Ghazawat, and we used to eat locusts with him.","reference":"Sahih al-Bukhari 5495, Book 72, Hadith 21","grade":"","question #":"question #1","question":"What types of food were consumed by the Prophet and his companions during military expeditions?","id":"bukhari-72-21"},{"hadith-eng":"I came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture, and we take our meals in their utensils, and there is game in that land and I hunt with my \nbow and with my trained hound and with my untrained hound.\" The Prophet (ﷺ) said, \"As for your saying \nthat you are in the land of people of the Scripture, you should not eat in their utensils unless you find \nno alternative, in which case you must wash the utensils and then eat in them As for your saying that \nyou are in the land of game, if you hunt something with your bow, mention Allah's Name (while \nhunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name \non sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it \nand you can eat of it.\"","reference":"Sahih al-Bukhari 5496, Book 72, Hadith 22","grade":"","question #":"question #1","question":"What guidelines are provided for using utensils belonging to people of the Scripture?","id":"bukhari-72-22"},{"hadith-eng":"In the evening of the day of the conquest of Khaibar, the army made fires (for cooking). The Prophet (ﷺ) \nsaid, \"For what have you made these fires?\" They said, \"For cooking the meat of domestic donkeys.\" \nHe said, \"Throw away what is in the cooking pots and break the pots.\" A man from the people got up \nand said, \"Shall we throw the contents of the cooking pots and then wash the pots (instead of breaking \nthem)?\" The Prophet (ﷺ) said, \"Yes, you can do either.'","reference":"Sahih al-Bukhari 5497, Book 72, Hadith 23","grade":"","question #":"question #1","question":"What was the Prophet's instruction regarding the cooking of domestic donkey meat?","id":"bukhari-72-23"},{"hadith-eng":"We were with the Prophet (ﷺ) in Dhul-Hulaifa and there the people were struck with severe hunger. Then \nwe got camels and sheep as war booty (and slaughtered them). The Prophet (ﷺ) was behind all the people. \nThe people hurried and fixed the cooking pots (for cooking) but the Prophet (ﷺ) came there and ordered \nthat the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as \nequal to one camel. One of the camels ran away and there were a few horses with the people. They \nchased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. \nThe Prophet (ﷺ) said, \"Among these animals some are as wild as wild beasts, so if one of them runs away \nfrom you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the \nenemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet (ﷺ) said, \"If the \nkilling tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). \nBut do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the \nknife of Ethiopians.\"","reference":"Sahih al-Bukhari 5498, Book 72, Hadith 24","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the treatment of animals that escape during a hunt or battle?","id":"bukhari-72-24"},{"hadith-eng":"Allah's Messenger (ﷺ) said that he met Zaid bin `Amr Nufail at a place near Baldah and this had happened \nbefore Allah's Messenger (ﷺ) received the Divine Inspiration. Allah's Messenger (ﷺ) presented a dish of meat (that \nhad been offered to him by the pagans) to Zaid bin `Amr, but Zaid refused to eat of it and then said (to \nthe pagans), \"I do not eat of what you slaughter on your stonealtars (Ansabs) nor do I eat except that \non which Allah's Name has been mentioned on slaughtering.\"","reference":"Sahih al-Bukhari 5499, Book 72, Hadith 25","grade":"","question #":"question #1","question":"What is the significance of mentioning Allah's name during the act of slaughtering animals in Islam?","id":"bukhari-72-25"},{"hadith-eng":"Once during the lifetime of Allah's Messenger (ﷺ) we offered some animals as sacrifices. Some people \nslaughtered their sacrifices before the (Id) prayer, so when the Prophet (ﷺ) finished his prayer, he saw that \nthey had slaughtered their sacrifices before the prayer. He said, \"Whoever has slaughtered (his \nsacrifice) before the prayer, should slaughter (another sacrifice) in lieu of it; and whoever has not yet \nslaughtered it till we have prayed; should slaughter (it) by mentioning Allah's Name.\"","reference":"Sahih al-Bukhari 5500, Book 72, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of performing the Eid prayer before slaughtering the sacrificial animal?","id":"bukhari-72-26"},{"hadith-eng":"that a slave girl of theirs used to shepherd some sheep at Si'a (a mountain near Medina). On seeing \none of her sheep dying, she broke a stone and slaughtered it. Ka`b said to his family, \"Do not eat (of \nit) till I go to the Prophet (ﷺ) and ask him, or, till I send someone to ask him.\" So he went to the Prophet (ﷺ) \nor sent someone to him The Prophet (ﷺ) permitted (them) to eat it.","reference":"Sahih al-Bukhari 5501, Book 72, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of seeking guidance from the Prophet in matters of religious rulings?","id":"bukhari-72-27"},{"hadith-eng":"that Ka`b had a slave girl who used to graze his sheep on a small mountain, called \"Sl'a\", situated near \nthe market. Once a sheep was dying, so she broke a stone and slaughtered it with it. When they \nmentioned that to the Prophet, he, permitted them to eat it.","reference":"Sahih al-Bukhari 5502, Book 72, Hadith 28","grade":"","question #":"question #1","question":"What is the ruling on consuming meat from an animal that was slaughtered with a stone?","id":"bukhari-72-28"},{"hadith-eng":"that he said, \"O Allah's Messenger (ﷺ)! We have no knife.\" The Prophet (ﷺ) said, \"if the killing tool causes blood \nto gush out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter \nwith a nail or a tooth, for the nail is the knife of Ethiopians and a tooth is a bone.\" Suddenly a camel \nran away and it was stopped (with an arrow). The Prophet (ﷺ) then said, \"Of these camels there are some \nwhich are as wild as wild beasts; so if one of them runs away from you and you cannot catch it, treat it \nin this manner (i.e. shoot it with an arrow).","reference":"Sahih al-Bukhari 5503, Book 72, Hadith 29","grade":"","question #":"question #1","question":"What are the conditions for the permissibility of consuming meat from a slaughtered animal in Islam?","id":"bukhari-72-29"},{"hadith-eng":"A lady slaughtered a sheep with a stone and then the Prophet (ﷺ) was asked about it and he permitted it to \nbe eaten.","reference":"Sahih al-Bukhari 5504, Book 72, Hadith 30","grade":"","question #":"question #1","question":"What are the conditions under which an animal slaughtered by a woman is considered permissible to eat in Islam?","id":"bukhari-72-30"},{"hadith-eng":"A slave girl belonging to Ka`b used to graze some sheep at Sl'a (mountain). Once one of her sheep \nwas dying. She reached it (before it died) and slaughtered it with a stone. The Prophet (ﷺ) was asked, and \nhe said, \"Eat it.\"","reference":"Sahih al-Bukhari 5505, Book 72, Hadith 31","grade":"","question #":"question #1","question":"What is the ruling on consuming meat from an animal slaughtered by a non-traditional method in an emergency situation?","id":"bukhari-72-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except \nwhat is slaughtered with a tooth or a nail.'","reference":"Sahih al-Bukhari 5506, Book 72, Hadith 32","grade":"","question #":"question #1","question":"What are the permissible instruments for slaughtering animals in Islam?","id":"bukhari-72-32"},{"hadith-eng":"A group of people said to the Prophet, \"Some people bring us meat and we do not know whether they \nhave mentioned Allah's Name or not on slaughtering the animal.\" He said, \"Mention Allah's Name on \nit and eat.\" Those people had embraced Islam recently.","reference":"Sahih al-Bukhari 5507, Book 72, Hadith 33","grade":"","question #":"question #1","question":"What should one do if uncertain about whether Allah's name was mentioned during the slaughtering of an animal?","id":"bukhari-72-33"},{"hadith-eng":"While we were besieging the castle of Khaibar, Somebody threw a skin full of fat and I went ahead to \ntake it, but on looking behind, I saw the Prophet (ﷺ) and I felt shy in his presence (and did not take it).","reference":"Sahih al-Bukhari 5508, Book 72, Hadith 34","grade":"","question #":"question #1","question":"What can be learned about the behavior of companions in the presence of the Prophet Muhammad (ﷺ)?","id":"bukhari-72-34"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! We are going to face the enemy tomorrow and we do not have knives.\" He \nsaid, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name \nis mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you \nwhy: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some \ncamels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an \narrow and stopped it. Allah's Messenger (ﷺ) said, \"Of these camels there are some which are as wild as wild \nbeasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"","reference":"Sahih al-Bukhari 5509, Book 72, Hadith 35","grade":"","question #":"question #1","question":"What are the permissible tools for slaughtering animals in Islam and why are certain tools prohibited?","id":"bukhari-72-35"},{"hadith-eng":"We slaughtered a horse (by Nahr) during the lifetime of the Prophet (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5510, Book 72, Hadith 36","grade":"","question #":"question #1","question":"What is the ruling on consuming horse meat in Islam?","id":"bukhari-72-36"},{"hadith-eng":"We slaughtered a horse (by Dhabh) during the lifetime of Allah's Messenger (ﷺ) while we were at Medina, \nand we ate it.","reference":"Sahih al-Bukhari 5511, Book 72, Hadith 37","grade":"","question #":"question #1","question":"What is the ruling on consuming horse meat in Islam?","id":"bukhari-72-37"},{"hadith-eng":"We slaughtered a horse (by Nahr) during the lifetime of Allah's Messenger (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5512, Book 72, Hadith 38","grade":"","question #":"question #1","question":"What is the ruling on consuming horse meat in Islam?","id":"bukhari-72-38"},{"hadith-eng":"Anas and I went to Al-Hakam bin Aiyub. Anas saw some boys shooting at a tied hen. Anas said, \"The \nProphet has forbidden the shooting of tied or confined animals.\"","reference":"Sahih al-Bukhari 5513, Book 72, Hadith 39","grade":"","question #":"question #1","question":"What is the Islamic perspective on treating animals with kindness and compassion?","id":"bukhari-72-39"},{"hadith-eng":"that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn \n`Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from \ntying the birds for the sake of killing them, as I have heard the Prophet (ﷺ) forbidding the killing of an \nanimal or other living thing after tying them.\"","reference":"Sahih al-Bukhari 5514, Book 72, Hadith 40","grade":"","question #":"question #1","question":"What ethical considerations should be taken into account when dealing with animals in Islam?","id":"bukhari-72-40"},{"hadith-eng":"While I was with Ibn `Umar, we passed by a group of young men who had tied a hen and started \nshooting at it. When they saw Ibn `Umar, they dispersed, leaving it. On that Ibn `Umar said, \"Who has \ndone this? The Prophet (ﷺ) cursed the one who did so.\"Narrated Ibn `Umar:The Prophet (ﷺ) cursed the one who did Muthla to an animal (i e., cut its limbs or some other part of its \nbody while it is still alive).","reference":"Sahih al-Bukhari 5515, Book 72, Hadith 41","grade":"","question #":"question #1","question":"What is the Islamic perspective on treating animals with cruelty or mutilation?","id":"bukhari-72-41"},{"hadith-eng":"The Prophet (ﷺ) forbade An-Nuhba and Al-Muthla.","reference":"Sahih al-Bukhari 5516, Book 72, Hadith 42","grade":"","question #":"question #1","question":"What are the prohibitions related to An-Nuhba in Islamic teachings?","id":"bukhari-72-42"},{"hadith-eng":"I saw the Prophet (ﷺ) eating chicken.","reference":"Sahih al-Bukhari 5517, Book 72, Hadith 43","grade":"","question #":"question #1","question":"What types of food did the Prophet Muhammad (ﷺ) consume during his lifetime?","id":"bukhari-72-43"},{"hadith-eng":"We were in the company of Abu Musa Al-Ash`ari and there were friendly relations between us and \nthis tribe of Jarm. Abu Musa was presented with a dish containing chicken. Among the people there \nwas sitting a red-faced man who did not come near the food. Abu Musa said (to him), \"Come on (and \neat), for I have seen Allah's Messenger (ﷺ) eating of it (i.e. chicken).\" He said, \"I have seen it eating \nsomething (dirty) and since then I have disliked it, and have taken an oath that I shall not eat it ' Abu \nMusa said, \"Come on, I will tell you (or narrate to you). Once I went to Allah s Apostle with a group \nof Al-Ash`ariyin, and met him while he was angry, distributing some camels of rak`at. We asked for \nmounts but he took an oath that he would not give us any mounts, and added, 'I have nothing to mount \nyou on' In the meantime some camels of booty were brought to Allah's Messenger (ﷺ) and he asked twice, \n'Where are Al-Ash`ariyin?\" So he gave us five white camels with big humps. We stayed for a short \nwhile (after we had covered a little distance), and then I said to my companions, \"Allah's Messenger (ﷺ) has \nforgotten his oath. By Allah, if we do not remind Allah's Messenger (ﷺ) of his oath, we will never be \nsuccessful.\" So we returned to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We asked you for mounts, \nbut you took an oath that you would not give us any mounts; we think that you have forgotten your \noath.' He said, 'It is Allah Who has given you mounts. By Allah, and Allah willing, if I take an oath \nand later find something else better than that. then I do what is better and expiate my oath.' \"","reference":"Sahih al-Bukhari 5518, Book 72, Hadith 44","grade":"","question #":"question #1","question":"What is the significance of fulfilling oaths and what should one do if they find a better option after taking an oath?","id":"bukhari-72-44"},{"hadith-eng":"We slaughtered a horse during the lifetime of Allah's Messenger (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5519, Book 72, Hadith 45","grade":"","question #":"question #1","question":"What is the ruling on consuming horse meat in Islam?","id":"bukhari-72-45"},{"hadith-eng":"On the Day of the battle of Khaibar, Allah's Messenger (ﷺ) made donkey's meat unlawful and allowed the \neating of horse flesh.","reference":"Sahih al-Bukhari 5520, Book 72, Hadith 46","grade":"","question #":"question #1","question":"What dietary restrictions were established by the Prophet Muhammad (ﷺ) during the Battle of Khaibar?","id":"bukhari-72-46"},{"hadith-eng":"The Prophet (ﷺ) made the meat of donkeys unlawful on the day of the battle of Khaibar.","reference":"Sahih al-Bukhari 5521, Book 72, Hadith 47","grade":"","question #":"question #1","question":"What dietary restrictions were imposed by the Prophet Muhammad (ﷺ) during the battle of Khaibar?","id":"bukhari-72-47"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat.","reference":"Sahih al-Bukhari 5522, Book 72, Hadith 48","grade":"","question #":"question #1","question":"What types of meat are prohibited in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-72-48"},{"hadith-eng":"Allah's Messenger (ﷺ) prohibited Al-Mut'a marriage and the eating of donkey's meat in the year of the \nKhaibar battle.","reference":"Sahih al-Bukhari 5523, Book 72, Hadith 49","grade":"","question #":"question #1","question":"What are the prohibitions related to marriage and food mentioned during the time of the Khaibar battle?","id":"bukhari-72-49"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat on the day of the battle of Khaibar, and allowed \nthe eating of horse flesh.","reference":"Sahih al-Bukhari 5524, Book 72, Hadith 50","grade":"","question #":"question #1","question":"What dietary restrictions did the Prophet Muhammad (ﷺ) impose during the battle of Khaibar?","id":"bukhari-72-50"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat.","reference":"Sahih al-Bukhari 5525, 5526, Book 72, Hadith 51","grade":"","question #":"question #1","question":"What types of meat are prohibited in Islam according to the teachings of the Prophet (ﷺ)?","id":"bukhari-72-51"},{"hadith-eng":"Allah's Messenger (ﷺ) prohibited the eating of donkey's meat.Narrated Az-Zuhri:The Prophet (ﷺ) prohibited the eating of beasts having fangs.","reference":"Sahih al-Bukhari 5527, Book 72, Hadith 52","grade":"","question #":"question #1","question":"What types of animals are prohibited for consumption in Islam according to the teachings of the Prophet (ﷺ)?","id":"bukhari-72-52"},{"hadith-eng":"Someone came to Allah's Messenger (ﷺ) and said, \"The donkeys have been (slaughtered and) eaten. Another \nman came and said, \"The donkeys have been destroyed.\" On that the Prophet (ﷺ) ordered a caller to \nannounce to the people: Allah and His Apostle forbid you to eat the meat of donkeys, for it is impure.' \nThus the pots were turned upside down while the (donkeys') meat was boiling in them.","reference":"Sahih al-Bukhari 5528, Book 72, Hadith 53","grade":"","question #":"question #1","question":"What is the Islamic ruling on consuming the meat of donkeys?","id":"bukhari-72-53"},{"hadith-eng":"I said to Jabir bin Zaid, \"The people claim that Allah's Messenger (ﷺ) forbade the eating of donkey's meat.\" \nHe said, \"Al-Hakam bin `Amr Al-Ghifari used to say so when he was with us, but Ibn `Abbas, the \ngreat religious learned man, refused to give a final verdict and recited:-- 'Say: I find not in that which \nhas been inspired to me anything forbidden to be eaten by one who wishes to eat it, unless it be \ncarrion, blood poured forth or the flesh of swine...' (6.145)","reference":"Sahih al-Bukhari 5529, Book 72, Hadith 54","grade":"","question #":"question #1","question":"What is the significance of seeking guidance from religious scholars when there is a difference of opinion on a matter?","id":"bukhari-72-54"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the eating of the meat of beasts having fangs.","reference":"Sahih al-Bukhari 5530, Book 72, Hadith 55","grade":"","question #":"question #1","question":"What types of animals are prohibited for consumption in Islam?","id":"bukhari-72-55"},{"hadith-eng":"Once Allah's Messenger (ﷺ) passed by a dead sheep and said (to the people), \"Why don't you use its hide?\" \nThey said, \"But it is dead,\" He said, \"Only eating it, is prohibited.\"","reference":"Sahih al-Bukhari 5531, Book 72, Hadith 56","grade":"","question #":"question #1","question":"What is the ruling on using the hide of a dead animal in Islamic law?","id":"bukhari-72-56"},{"hadith-eng":"The Prophet (ﷺ) passed by a dead goat and said, \"There is no harm if its owners benefit from its skin.\"","reference":"Sahih al-Bukhari 5532, Book 72, Hadith 57","grade":"","question #":"question #1","question":"What is the ruling on using the skin of a dead animal in Islam?","id":"bukhari-72-57"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"None is wounded in Allah's Cause but will come on the Day of Resurrection \nwith his wound bleeding. The thing that will come out of his wound will be the color of blood, but its \nsmell will be the smell of musk.\"","reference":"Sahih al-Bukhari 5533, Book 72, Hadith 58","grade":"","question #":"question #1","question":"What is the significance of wounds received in Allah's Cause on the Day of Resurrection?","id":"bukhari-72-58"},{"hadith-eng":"The Prophet (ﷺ) said, 'The example of a good pious companion and an evil one is that of a person carrying \nmusk and another blowing a pair of bellows. The one who is carrying musk will either give you some \nperfume as a present, or you will buy some from him, or you will get a good smell from him, but the \none who is blowing a pair of bellows will either burn your clothes or you will get a bad smell from \nhim.\"","reference":"Sahih al-Bukhari 5534, Book 72, Hadith 59","grade":"","question #":"question #1","question":"What are the characteristics of a good companion compared to an evil one?","id":"bukhari-72-59"},{"hadith-eng":"Once we provoked a rabbit at Marr-az-Zahran. The people chased it till they got tired. Then I caught It \nand brought it to Abu Talha, who slaughtered it and then sent both its pelvic pieces (or legs) to the \nProphet, and the Prophet (ﷺ) accepted the present.","reference":"Sahih al-Bukhari 5535, Book 72, Hadith 60","grade":"","question #":"question #1","question":"What is the significance of accepting gifts in Islamic tradition?","id":"bukhari-72-60"},{"hadith-eng":"The Prophet (ﷺ) said, \"I do not eat mastigure, but I do not prohibit its eating.\"","reference":"Sahih al-Bukhari 5536, Book 72, Hadith 61","grade":"","question #":"question #1","question":"What is the stance of the Prophet Muhammad (ﷺ) on eating certain foods that he personally did not consume?","id":"bukhari-72-61"},{"hadith-eng":"Allah's Messenger (ﷺ) and I entered the house of Maimuna. A roasted mastigure was served. Allah's Messenger (ﷺ) \nstretched his hand out (to eat of it) but some woman said, \"Inform Allah's Messenger (ﷺ) of what he is about \nto eat.\" So they said, \"It is mastigure, O Allah's Messenger (ﷺ)!\" He withdrew his hand, whereupon I said, \"O \nAllah's Messenger (ﷺ)! Is it unlawful?\" He said, \"No, but this is not found in the land of my people, so I \ndislike it.\" So I pulled the mastigure towards me and ate it while Allah's Messenger (ﷺ) was looking at me.","reference":"Sahih al-Bukhari 5537, Book 72, Hadith 62","grade":"","question #":"question #1","question":"What is the significance of cultural preferences in dietary choices in Islam?","id":"bukhari-72-62"},{"hadith-eng":"A mouse fell into the butter-fat and died. The Prophet (ﷺ) was asked about that. He said, \"Throw away the \nmouse and the butter-fat that surrounded it, and eat the rest of the butter-fat (As-Samn).","reference":"Sahih al-Bukhari 5538, Book 72, Hadith 63","grade":"","question #":"question #1","question":"What should be done if a dead animal is found in food according to Islamic teachings?","id":"bukhari-72-63"},{"hadith-eng":"regarding an animal, e.g., a mouse or some other animal that had fallen into solid or liquid oil or \nbutter-fat: I had been informed that a mouse had died in butter-fat whereupon Allah's Messenger (ﷺ) ordered \nthat the butter-fat near it be thrown away and the rest of the butter-fat can be eaten.","reference":"Sahih al-Bukhari 5539, Book 72, Hadith 64","grade":"","question #":"question #1","question":"What should be done if an animal falls into solid or liquid food items like oil or butter-fat?","id":"bukhari-72-64"},{"hadith-eng":"The Prophet (ﷺ) was asked about a mouse that had fallen into butter-fat (and died). He said, \"Throw away \nthe mouse and the portion of butter-fat around it, and eat the rest.\"","reference":"Sahih al-Bukhari 5540, Book 72, Hadith 65","grade":"","question #":"question #1","question":"What should be done if a small impurity falls into food according to Islamic teachings?","id":"bukhari-72-65"},{"hadith-eng":"that Ibn `Umar disliked the branding of animals on the face. Ibn `Umar said, \"The Prophet (ﷺ) forbade \nbeating (animals) on the face.\"","reference":"Sahih al-Bukhari 5541, Book 72, Hadith 66","grade":"","question #":"question #1","question":"What is the Islamic perspective on treating animals with kindness and respect?","id":"bukhari-72-66"},{"hadith-eng":"I brought a brother of mine to the Prophet (ﷺ) to do Tahnik for him while the Prophet (ﷺ) was in a sheep fold \nof his, and I saw him branding a sheep. (The sub-narrator said: I think Anas said, branding it on the \near.)","reference":"Sahih al-Bukhari 5542, Book 72, Hadith 67","grade":"","question #":"question #1","question":"What is the significance of the practice of Tahnik in Islamic tradition?","id":"bukhari-72-67"},{"hadith-eng":"I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for \nslaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, \nand if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or \nnail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" \nThe quick ones among the people got the war booty while the Prophet (ﷺ) was behind the people. So they \nplaced the cooking pots on the fire, but the Prophet (ﷺ) ordered the cooking pots to be turned upside \ndown. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. \nThen a camel belonging to the first party of people ran away and they had no horses with them, so a \nman shot it with an arrow whereby Allah stopped it. The Prophet (ﷺ) said, \"Of these animals there are \nsome which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it \nwith an arrow).","reference":"Sahih al-Bukhari 5543, Book 72, Hadith 68","grade":"","question #":"question #1","question":"What are the permissible methods for slaughtering animals in Islam, and what conditions must be met?","id":"bukhari-72-68"},{"hadith-eng":"While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an \narrow and stopped it. The Prophet (ﷺ) said, \"Of these camels some are as wild as wild beasts, so if one of \nthem runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's \nApostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we \nhave no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to \nflow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering \ninstrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"","reference":"Sahih al-Bukhari 5544, Book 72, Hadith 69","grade":"","question #":"question #1","question":"What guidance does Islam provide for dealing with runaway animals during a journey?","id":"bukhari-72-69"},{"hadith-eng":"I asked the Prophet (ﷺ) about the game killed by a Mi'rad (i.e. a sharp-edged piece of wood or a piece of \nwood provided with a sharp piece of iron used for hunting). He said, \"If the game is killed with its \nsharp edge, eat of it, but if it is killed with its shaft, with a hit by its broad side then the game is \n(unlawful to eat) for it has been beaten to death.\" I asked him about the game killed by a trained \nhound. He said, \"If the hound catches the game for you, eat of it, for killing the game by the hound, is \nlike its slaughtering. But if you see with your hound or hounds another dog, and you are afraid that it \nmight have shared in hunting the game with your hound and killed it, then you should not eat of it, \nbecause you have mentioned Allah's name on (sending) your hound only, but you have not mentioned \nit on some other hound.","reference":"Sahih al-Bukhari 5475, Book 72, Hadith 1","grade":"","question #":"question #2","question":"How does the presence of an untrained or unknown dog affect the permissibility of eating hunted game?","id":"bukhari-72-70"},{"hadith-eng":"I asked Allah's Messenger (ﷺ) about the Mi'rad. He said, \"If you hit the game with its sharp edge, eat it, but if \nthe Mi'rad hits the game with its shaft with a hit by its broad side do not eat it, for it has been beaten to \ndeath with a piece of wood. (i.e. unlawful).\" I asked, \"If I let loose my trained hound after a game?\" \nHe said, \"If you let loose your trained hound after game, and mention the name of Allah, then you can \neat.\" I said, \"If the hound eats of the game?\" He said \"Then you should not eat of it, for the hound has \nhunted the game for itself and not for you.\" I said, \"Some times I send my hound and then I find some \nother hound with it?\" He said \"Don't eat the game, as you have mentioned the Name of Allah on your \ndog only and not on the other.\"","reference":"Sahih al-Bukhari 5476, Book 72, Hadith 2","grade":"","question #":"question #2","question":"What should be considered when using a trained hound for hunting in Islam?","id":"bukhari-72-71"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! We let loose our trained hounds after a game?\" He said, \"Eat what they \nhunt for you.\" I said, \"Even if they killed (the game)?\" He replied, 'Even if they killed (the game).\" I \nsaid, 'We also hit (the game) with the Mi'rad?\" He said, \"Eat of the animal which the Mi'rad kills by \npiercing its body, but do not eat of the animal which is killed by the broad side of the Mi'rad.''","reference":"Sahih al-Bukhari 5477, Book 72, Hadith 3","grade":"","question #":"question #2","question":"What is the ruling on eating animals killed by hunting tools like the Mi'rad?","id":"bukhari-72-72"},{"hadith-eng":"I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take \nour meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and \nwith my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He \nsaid, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other \nthan theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat \nout of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt \nsomething with your trained hound after mentioning Allah's Name, eat of it, and if you hunt \nsomething with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"","reference":"Sahih al-Bukhari 5478, Book 72, Hadith 4","grade":"","question #":"question #2","question":"What are the conditions for consuming game hunted with a bow or hounds?","id":"bukhari-72-73"},{"hadith-eng":"that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw \r\nstones, for Allah's Messenger (ﷺ) has forbidden throwing stones, or he used to dislike it.\" `Abdullah added: \r\nThrowing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or \r\ngouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I \r\ntell you that Allah's Messenger (ﷺ) has forbidden or disliked the throwing the stones (in such a way), yet you \r\nare throwing stones! I shall not talk to you for such-and-such a period.\"","reference":"Sahih al-Bukhari 5479, Book 72, Hadith 5","grade":"","question #":"question #2","question":"How does the hadith emphasize the importance of adhering to the Prophet's teachings?","id":"bukhari-72-74"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever keeps a (pet) dog which is neither a watch dog nor a hunting dog, will get \na daily deduction of two Qirat from his good deeds.\"","reference":"Sahih al-Bukhari 5480, Book 72, Hadith 6","grade":"","question #":"question #2","question":"How does keeping certain animals affect a person's good deeds according to Islamic teachings?","id":"bukhari-72-75"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If someone keeps a dog neither for hunting, nor for guarding livestock, \nthe reward (for his good deeds) will be reduced by two Qirats per day.\"","reference":"Sahih al-Bukhari 5481, Book 72, Hadith 7","grade":"","question #":"question #2","question":"How does keeping a dog without a valid reason affect a person's reward for good deeds?","id":"bukhari-72-76"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If someone keeps a dog neither for guarding livestock, nor for hunting, his good \ndeeds will decrease (in reward) by two Qirats a day.'","reference":"Sahih al-Bukhari 5482, Book 72, Hadith 8","grade":"","question #":"question #2","question":"How does keeping a dog without a valid reason affect a person's good deeds?","id":"bukhari-72-77"},{"hadith-eng":"I asked Allah's Messenger (ﷺ). \"We hunt with the help of these hounds.\" He said, \"If you let loose your \ntrained hounds after a game, and mention the name of Allah, then you can eat what the hounds catch \nfor you, even if they killed the game. But you should not eat of it if the hound has eaten of it, for then \nit is likely that the hound has caught the game for itself. And if other hounds join your hound in \nhunting the game, then do not eat of it.\"","reference":"Sahih al-Bukhari 5483, Book 72, Hadith 9","grade":"","question #":"question #2","question":"Why is it important to mention the name of Allah when letting loose trained hounds for hunting?","id":"bukhari-72-78"},{"hadith-eng":"The Prophet (ﷺ) said, \"If you let loose your hound after a game and mention Allah's Name on sending it, \nand the hound catches the game and kills it, then you can eat of it. But if the hound eats of it, then you \nshould not eat thereof, for the hound has caught it for itself. And if along with your hound, joined other \nhounds, and Allah's Name was not mentioned at the time of their sending, and they catch an animal \nand kill it, you should not eat of it, for you will not know which of them has killed it. And if you have \nthrown an arrow at the game and then find it (dead) two or three days later and, it bears no mark other \nthan the wound inflicted by your arrow, then you can eat of it. But if the game is found (dead) in \nwater, then do not eat of it.\"","reference":"Sahih al-Bukhari 5484, Book 72, Hadith 10","grade":"","question #":"question #2","question":"Why is it important to mention Allah's Name when sending a hunting animal after game?","id":"bukhari-72-79"},{"hadith-eng":"And it has also been narrated by `Adi bin Hatim that he asked the Prophet (ﷺ) \n\"If a hunter throws an arrow at the game and after tracing it for two or three days he finds it dead but \nstill bearing his arrow, (can he eat of it)?\" The Prophet (ﷺ) replied, \"He can eat if he wishes.\"","reference":"Sahih al-Bukhari 5485, Book 72, Hadith 11","grade":"","question #":"question #2","question":"How long can a hunter trace a wounded animal before deciding if it is permissible to eat?","id":"bukhari-72-80"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! I let loose my hound after a game and mention Allah's Name on sending \nit.\" The Prophet (ﷺ) said, \"If you let loose your hound after a game and you mention Allah's Name on \nsending it and the hound catches and kills the game and eats of it, then you should not eat of it, for it \nhas killed it for itself.\" I said, \"Sometimes when I send my hound after a game, I find another hound \nalong with it and I do not know which of them has caught the game.\" He said, \"You must not eat of it \nbecause you have not mentioned, the Name of Allah except on sending your own hound, and you did \nnot mention it on the other hound.\" Then I asked him about the game hunted with a Mi'rad (i.e. a \nsharp edged piece of wood or a piece of wood provided with a sharp piece of iron used for hunting). \nHe said, \"If the game is killed with its sharp edge, you can eat of it, but if it is killed by its broad side \n(shaft), you cannot eat of it, for then it is like an animal beaten to death with a piece of wood.\"","reference":"Sahih al-Bukhari 5486, Book 72, Hadith 12","grade":"","question #":"question #2","question":"Why is it important to mention the Name of Allah when sending a hunting animal after game?","id":"bukhari-72-81"},{"hadith-eng":"I asked Allah's Messenger (ﷺ), \"We hunt with these hounds.\" He said, \"If you send your trained hounds after \na game and mention Allah's Name on sending, you can eat of what they catch for you. But if the \nhound eats of the game, then you must not eat of it, for I am afraid that the hound caught it for itself, \nand if another hound joins your hounds (during the hunt), you should not eat of the game.\"","reference":"Sahih al-Bukhari 5487, Book 72, Hadith 13","grade":"","question #":"question #2","question":"Why is it important to mention Allah's Name when sending trained hounds for hunting?","id":"bukhari-72-82"},{"hadith-eng":"I came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow \nand trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your \nsaying that you are living in the land of the people of the Scripture and that you eat in their utensils, if \nyou can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than \ntheirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if \nyou hung something with your bow, and have mentioned Allah's Name while hunting, then you can \neat (the game). And if you hunt something with your trained hound, and have mentioned Allah's \nName on sending it for hunting then you can eat (the game). But if you hunt something with your \nuntrained hound and you were able to slaughter it before its death, you can eat of it.\"","reference":"Sahih al-Bukhari 5488, Book 72, Hadith 14","grade":"","question #":"question #2","question":"What conditions must be met for game hunted with a bow to be considered lawful to eat?","id":"bukhari-72-83"},{"hadith-eng":"We provoked a rabbit at Marr Az-Zahran till it started jumping. My companions chased it till they got \ntired. But I alone ran after it and caught it and brought it to Abu Talha. He sent both its legs to the \nProphet who accepted them.","reference":"Sahih al-Bukhari 5489, Book 72, Hadith 15","grade":"","question #":"question #2","question":"How does the act of hunting and sharing reflect on the companionship among the Prophet's followers?","id":"bukhari-72-84"},{"hadith-eng":"that once he was with Allah's Messenger (ﷺ) (on the way to Mecca). When he had covered some of the way \nto Mecca, he and some companions of his, who were in the state of lhram. remained behind the \nProphet while Abu Qatada himself was not in the state of Ihram. Abu Qatada, seeing an onager rode \nhis horse and asked his companions to hand him a whip, but they refused. He then asked them to hand \nhim his spear, but they refused. Then he took it himself and attacked the onager and killed it. Some of \nthe Companions of Allah's Messenger (ﷺ) ate of it, but some others refused to eat. When they met Allah's \nApostle they asked him about that. He said, \"It was meal given to you by Allah.\"","reference":"Sahih al-Bukhari 5490, Book 72, Hadith 16","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react to the situation involving the onager, and what does it teach about differing opinions?","id":"bukhari-72-85"},{"hadith-eng":"(the same Hadith above, but he added); The Prophet (ﷺ) asked, \"Is there any of its meat left with you?\"","reference":"Sahih al-Bukhari 5491, Book 72, Hadith 17","grade":"","question #":"question #2","question":"How does the act of asking for an oath contribute to the credibility of a hadith?","id":"bukhari-72-86"},{"hadith-eng":"I was with the Prophet (on a journey) between Mecca and Medina, and all of them, (i.e. the Prophet (ﷺ) \nand his companions) were in the state of Ihram, while I was not in that state. I was riding my horse \nand I used to be fond of ascending mountains. So while I was doing so I noticed that the people were \nlooking at something. I went to see what it was, and behold it was an onager. I asked my companions, \n\"What is that?\" They said, \"We do not know.\" I said, \"It is an onager.' They said, \"It is what you have \nseen.\" I had left my whip, so I said to them, \"Hand to me my whip.\" They said, \"We will not help you \nin that (in hunting the onager).\" I got down, took my whip and chased the animal (on my horse) and \ndid not stop till I killed it. I went to them and said, \"Come on, carry it!\" But they said, \"We will not \neven touch it.\" At last I alone carried it and brought it to them. Some of them ate of it and some \nrefused to eat of it. I said (to them), \"I will ask the Prophet (ﷺ) about it (on your behalf).\" When I met the \nProphet, I told him the whole story. He said to me, \"Has anything of it been left with you?\" I said, \n\"Yes.\" He said, \"Eat, for it is a meal Allah has offered to you.\"","reference":"Sahih al-Bukhari 5492, Book 72, Hadith 18","grade":"","question #":"question #2","question":"How should one approach a situation where there is a difference of opinion among companions regarding a religious matter?","id":"bukhari-72-87"},{"hadith-eng":"We went out in a campaign and the army was called The Army of the Khabt, and Abu 'Ubaida was \nour commander. We were struck with severe hunger. Then the sea threw a huge dead fish called Al- \n`Anbar, the like of which had never been seen. We ate of it for half a month, and then Abu 'Ubaida \ntook one of its bones (and made an arch of it) so that a rider could easily pass under it.","reference":"Sahih al-Bukhari 5493, Book 72, Hadith 19","grade":"","question #":"question #2","question":"How did the army manage to survive when faced with severe hunger during their campaign?","id":"bukhari-72-88"},{"hadith-eng":"The Prophet (ﷺ) sent us as an army unit of three hundred warriors under the command of Abu 'Ubaida to \nambush a caravan of the Quraish. But we were struck with such severe hunger that we ate the Khabt \n(desert bushes), so our army was called the Army of the Khabt. Then the sea threw a huge fish called \nAl-`Anbar and we ate of it for half a month and rubbed our bodies with its fat till our bodies became \nhealthy. Then Abu Ubaida took one of its ribs and fixed it over the ground and a rider passed \nunderneath it. There was a man amongst us who slaughtered three camels when hunger became \nsevere, and he slaughtered three more, but after that Abu 'Ubaida forbade him to do so.","reference":"Sahih al-Bukhari 5494, Book 72, Hadith 20","grade":"","question #":"question #2","question":"How did the army unit sustain themselves when faced with severe hunger in the desert?","id":"bukhari-72-89"},{"hadith-eng":"We participated with the Prophet (ﷺ) in six or seven Ghazawat, and we used to eat locusts with him.","reference":"Sahih al-Bukhari 5495, Book 72, Hadith 21","grade":"","question #":"question #2","question":"How many military expeditions did the companions participate in with the Prophet according to this narration?","id":"bukhari-72-90"},{"hadith-eng":"I came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture, and we take our meals in their utensils, and there is game in that land and I hunt with my \nbow and with my trained hound and with my untrained hound.\" The Prophet (ﷺ) said, \"As for your saying \nthat you are in the land of people of the Scripture, you should not eat in their utensils unless you find \nno alternative, in which case you must wash the utensils and then eat in them As for your saying that \nyou are in the land of game, if you hunt something with your bow, mention Allah's Name (while \nhunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name \non sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it \nand you can eat of it.\"","reference":"Sahih al-Bukhari 5496, Book 72, Hadith 22","grade":"","question #":"question #2","question":"What are the conditions for consuming game hunted with a bow or hounds?","id":"bukhari-72-91"},{"hadith-eng":"In the evening of the day of the conquest of Khaibar, the army made fires (for cooking). The Prophet (ﷺ) \nsaid, \"For what have you made these fires?\" They said, \"For cooking the meat of domestic donkeys.\" \nHe said, \"Throw away what is in the cooking pots and break the pots.\" A man from the people got up \nand said, \"Shall we throw the contents of the cooking pots and then wash the pots (instead of breaking \nthem)?\" The Prophet (ﷺ) said, \"Yes, you can do either.'","reference":"Sahih al-Bukhari 5497, Book 72, Hadith 23","grade":"","question #":"question #2","question":"How did the Prophet respond to the suggestion of washing the cooking pots instead of breaking them?","id":"bukhari-72-92"},{"hadith-eng":"We were with the Prophet (ﷺ) in Dhul-Hulaifa and there the people were struck with severe hunger. Then \nwe got camels and sheep as war booty (and slaughtered them). The Prophet (ﷺ) was behind all the people. \nThe people hurried and fixed the cooking pots (for cooking) but the Prophet (ﷺ) came there and ordered \nthat the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as \nequal to one camel. One of the camels ran away and there were a few horses with the people. They \nchased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. \nThe Prophet (ﷺ) said, \"Among these animals some are as wild as wild beasts, so if one of them runs away \nfrom you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the \nenemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet (ﷺ) said, \"If the \nkilling tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). \nBut do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the \nknife of Ethiopians.\"","reference":"Sahih al-Bukhari 5498, Book 72, Hadith 24","grade":"","question #":"question #2","question":"What are the Islamic guidelines for ensuring meat is halal when slaughtering animals without traditional tools?","id":"bukhari-72-93"},{"hadith-eng":"Allah's Messenger (ﷺ) said that he met Zaid bin `Amr Nufail at a place near Baldah and this had happened \nbefore Allah's Messenger (ﷺ) received the Divine Inspiration. Allah's Messenger (ﷺ) presented a dish of meat (that \nhad been offered to him by the pagans) to Zaid bin `Amr, but Zaid refused to eat of it and then said (to \nthe pagans), \"I do not eat of what you slaughter on your stonealtars (Ansabs) nor do I eat except that \non which Allah's Name has been mentioned on slaughtering.\"","reference":"Sahih al-Bukhari 5499, Book 72, Hadith 25","grade":"","question #":"question #2","question":"How did Zaid bin `Amr demonstrate his commitment to monotheism before the advent of Islam?","id":"bukhari-72-94"},{"hadith-eng":"Once during the lifetime of Allah's Messenger (ﷺ) we offered some animals as sacrifices. Some people \nslaughtered their sacrifices before the (Id) prayer, so when the Prophet (ﷺ) finished his prayer, he saw that \nthey had slaughtered their sacrifices before the prayer. He said, \"Whoever has slaughtered (his \nsacrifice) before the prayer, should slaughter (another sacrifice) in lieu of it; and whoever has not yet \nslaughtered it till we have prayed; should slaughter (it) by mentioning Allah's Name.\"","reference":"Sahih al-Bukhari 5500, Book 72, Hadith 26","grade":"","question #":"question #2","question":"What should be done if a sacrificial animal is slaughtered before the Eid prayer?","id":"bukhari-72-95"},{"hadith-eng":"that a slave girl of theirs used to shepherd some sheep at Si'a (a mountain near Medina). On seeing \none of her sheep dying, she broke a stone and slaughtered it. Ka`b said to his family, \"Do not eat (of \nit) till I go to the Prophet (ﷺ) and ask him, or, till I send someone to ask him.\" So he went to the Prophet (ﷺ) \nor sent someone to him The Prophet (ﷺ) permitted (them) to eat it.","reference":"Sahih al-Bukhari 5501, Book 72, Hadith 27","grade":"","question #":"question #2","question":"How does the act of consulting religious authority impact decision-making in Islamic practice?","id":"bukhari-72-96"},{"hadith-eng":"that Ka`b had a slave girl who used to graze his sheep on a small mountain, called \"Sl'a\", situated near \nthe market. Once a sheep was dying, so she broke a stone and slaughtered it with it. When they \nmentioned that to the Prophet, he, permitted them to eat it.","reference":"Sahih al-Bukhari 5502, Book 72, Hadith 28","grade":"","question #":"question #2","question":"How does the permissibility of using unconventional tools for slaughtering reflect on Islamic dietary laws?","id":"bukhari-72-97"},{"hadith-eng":"that he said, \"O Allah's Messenger (ﷺ)! We have no knife.\" The Prophet (ﷺ) said, \"if the killing tool causes blood \nto gush out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter \nwith a nail or a tooth, for the nail is the knife of Ethiopians and a tooth is a bone.\" Suddenly a camel \nran away and it was stopped (with an arrow). The Prophet (ﷺ) then said, \"Of these camels there are some \nwhich are as wild as wild beasts; so if one of them runs away from you and you cannot catch it, treat it \nin this manner (i.e. shoot it with an arrow).","reference":"Sahih al-Bukhari 5503, Book 72, Hadith 29","grade":"","question #":"question #2","question":"Why are certain tools like nails and teeth prohibited for slaughtering animals in Islamic tradition?","id":"bukhari-72-98"},{"hadith-eng":"A lady slaughtered a sheep with a stone and then the Prophet (ﷺ) was asked about it and he permitted it to \nbe eaten.","reference":"Sahih al-Bukhari 5504, Book 72, Hadith 30","grade":"","question #":"question #2","question":"What materials are permissible to use for slaughtering animals in Islamic law?","id":"bukhari-72-99"},{"hadith-eng":"A slave girl belonging to Ka`b used to graze some sheep at Sl'a (mountain). Once one of her sheep \nwas dying. She reached it (before it died) and slaughtered it with a stone. The Prophet (ﷺ) was asked, and \nhe said, \"Eat it.\"","reference":"Sahih al-Bukhari 5505, Book 72, Hadith 31","grade":"","question #":"question #2","question":"How does Islamic law address the permissibility of eating meat from animals slaughtered by women or slaves?","id":"bukhari-72-100"},{"hadith-eng":"The Prophet (ﷺ) said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except \nwhat is slaughtered with a tooth or a nail.'","reference":"Sahih al-Bukhari 5506, Book 72, Hadith 32","grade":"","question #":"question #2","question":"Why are teeth and nails not allowed for slaughtering animals according to Islamic teachings?","id":"bukhari-72-101"},{"hadith-eng":"A group of people said to the Prophet, \"Some people bring us meat and we do not know whether they \nhave mentioned Allah's Name or not on slaughtering the animal.\" He said, \"Mention Allah's Name on \nit and eat.\" Those people had embraced Islam recently.","reference":"Sahih al-Bukhari 5507, Book 72, Hadith 33","grade":"","question #":"question #2","question":"How does the guidance provided to new Muslims reflect the Prophet's approach to teaching Islam?","id":"bukhari-72-102"},{"hadith-eng":"While we were besieging the castle of Khaibar, Somebody threw a skin full of fat and I went ahead to \ntake it, but on looking behind, I saw the Prophet (ﷺ) and I felt shy in his presence (and did not take it).","reference":"Sahih al-Bukhari 5508, Book 72, Hadith 34","grade":"","question #":"question #2","question":"How does the presence of a respected leader influence the actions of individuals in a group setting?","id":"bukhari-72-103"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! We are going to face the enemy tomorrow and we do not have knives.\" He \nsaid, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name \nis mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you \nwhy: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some \ncamels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an \narrow and stopped it. Allah's Messenger (ﷺ) said, \"Of these camels there are some which are as wild as wild \nbeasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"","reference":"Sahih al-Bukhari 5509, Book 72, Hadith 35","grade":"","question #":"question #2","question":"What is the significance of mentioning Allah's Name during the slaughtering of an animal?","id":"bukhari-72-104"},{"hadith-eng":"We slaughtered a horse (by Nahr) during the lifetime of the Prophet (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5510, Book 72, Hadith 36","grade":"","question #":"question #2","question":"How does the practice of slaughtering animals reflect on dietary laws in Islam?","id":"bukhari-72-105"},{"hadith-eng":"We slaughtered a horse (by Dhabh) during the lifetime of Allah's Messenger (ﷺ) while we were at Medina, \nand we ate it.","reference":"Sahih al-Bukhari 5511, Book 72, Hadith 37","grade":"","question #":"question #2","question":"What does this narration indicate about the dietary practices during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-72-106"},{"hadith-eng":"We slaughtered a horse (by Nahr) during the lifetime of Allah's Messenger (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5512, Book 72, Hadith 38","grade":"","question #":"question #2","question":"How did the companions of the Prophet Muhammad (ﷺ) approach the consumption of different types of meat?","id":"bukhari-72-107"},{"hadith-eng":"Anas and I went to Al-Hakam bin Aiyub. Anas saw some boys shooting at a tied hen. Anas said, \"The \nProphet has forbidden the shooting of tied or confined animals.\"","reference":"Sahih al-Bukhari 5513, Book 72, Hadith 39","grade":"","question #":"question #2","question":"Why is it prohibited to harm or shoot tied or confined animals in Islam?","id":"bukhari-72-108"},{"hadith-eng":"that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn \n`Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from \ntying the birds for the sake of killing them, as I have heard the Prophet (ﷺ) forbidding the killing of an \nanimal or other living thing after tying them.\"","reference":"Sahih al-Bukhari 5514, Book 72, Hadith 40","grade":"","question #":"question #2","question":"How does Islam view the treatment of animals, particularly in the context of hunting or sport?","id":"bukhari-72-109"},{"hadith-eng":"While I was with Ibn `Umar, we passed by a group of young men who had tied a hen and started \nshooting at it. When they saw Ibn `Umar, they dispersed, leaving it. On that Ibn `Umar said, \"Who has \ndone this? The Prophet (ﷺ) cursed the one who did so.\"Narrated Ibn `Umar:The Prophet (ﷺ) cursed the one who did Muthla to an animal (i e., cut its limbs or some other part of its \nbody while it is still alive).","reference":"Sahih al-Bukhari 5515, Book 72, Hadith 41","grade":"","question #":"question #2","question":"What actions are considered sinful when dealing with animals according to Islamic teachings?","id":"bukhari-72-110"},{"hadith-eng":"The Prophet (ﷺ) forbade An-Nuhba and Al-Muthla.","reference":"Sahih al-Bukhari 5516, Book 72, Hadith 42","grade":"","question #":"question #2","question":"What is the significance of forbidding Al-Muthla in Islam?","id":"bukhari-72-111"},{"hadith-eng":"I saw the Prophet (ﷺ) eating chicken.","reference":"Sahih al-Bukhari 5517, Book 72, Hadith 43","grade":"","question #":"question #2","question":"How does the dietary practice of the Prophet Muhammad (ﷺ) influence Islamic dietary laws?","id":"bukhari-72-112"},{"hadith-eng":"We were in the company of Abu Musa Al-Ash`ari and there were friendly relations between us and \nthis tribe of Jarm. Abu Musa was presented with a dish containing chicken. Among the people there \nwas sitting a red-faced man who did not come near the food. Abu Musa said (to him), \"Come on (and \neat), for I have seen Allah's Messenger (ﷺ) eating of it (i.e. chicken).\" He said, \"I have seen it eating \nsomething (dirty) and since then I have disliked it, and have taken an oath that I shall not eat it ' Abu \nMusa said, \"Come on, I will tell you (or narrate to you). Once I went to Allah s Apostle with a group \nof Al-Ash`ariyin, and met him while he was angry, distributing some camels of rak`at. We asked for \nmounts but he took an oath that he would not give us any mounts, and added, 'I have nothing to mount \nyou on' In the meantime some camels of booty were brought to Allah's Messenger (ﷺ) and he asked twice, \n'Where are Al-Ash`ariyin?\" So he gave us five white camels with big humps. We stayed for a short \nwhile (after we had covered a little distance), and then I said to my companions, \"Allah's Messenger (ﷺ) has \nforgotten his oath. By Allah, if we do not remind Allah's Messenger (ﷺ) of his oath, we will never be \nsuccessful.\" So we returned to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We asked you for mounts, \nbut you took an oath that you would not give us any mounts; we think that you have forgotten your \noath.' He said, 'It is Allah Who has given you mounts. By Allah, and Allah willing, if I take an oath \nand later find something else better than that. then I do what is better and expiate my oath.' \"","reference":"Sahih al-Bukhari 5518, Book 72, Hadith 44","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations when he was reminded of an oath he had taken?","id":"bukhari-72-113"},{"hadith-eng":"We slaughtered a horse during the lifetime of Allah's Messenger (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5519, Book 72, Hadith 45","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) approach the consumption of different types of meat?","id":"bukhari-72-114"},{"hadith-eng":"On the Day of the battle of Khaibar, Allah's Messenger (ﷺ) made donkey's meat unlawful and allowed the \neating of horse flesh.","reference":"Sahih al-Bukhari 5520, Book 72, Hadith 46","grade":"","question #":"question #2","question":"What types of meat were declared permissible and impermissible by the Prophet Muhammad (ﷺ) in Islamic dietary laws?","id":"bukhari-72-115"},{"hadith-eng":"The Prophet (ﷺ) made the meat of donkeys unlawful on the day of the battle of Khaibar.","reference":"Sahih al-Bukhari 5521, Book 72, Hadith 47","grade":"","question #":"question #2","question":"What is the significance of the prohibition of donkey meat in Islamic dietary laws?","id":"bukhari-72-116"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat.","reference":"Sahih al-Bukhari 5522, Book 72, Hadith 48","grade":"","question #":"question #2","question":"How do dietary restrictions in Islam reflect the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-72-117"},{"hadith-eng":"Allah's Messenger (ﷺ) prohibited Al-Mut'a marriage and the eating of donkey's meat in the year of the \nKhaibar battle.","reference":"Sahih al-Bukhari 5523, Book 72, Hadith 49","grade":"","question #":"question #2","question":"What is the significance of the prohibition of Al-Mut'a marriage in Islamic teachings?","id":"bukhari-72-118"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat on the day of the battle of Khaibar, and allowed \nthe eating of horse flesh.","reference":"Sahih al-Bukhari 5524, Book 72, Hadith 50","grade":"","question #":"question #2","question":"What types of meat were Muslims permitted to consume according to the Prophet Muhammad (ﷺ) during the battle of Khaibar?","id":"bukhari-72-119"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat.","reference":"Sahih al-Bukhari 5525, 5526, Book 72, Hadith 51","grade":"","question #":"question #2","question":"Why might certain animals be prohibited for consumption in Islamic dietary laws?","id":"bukhari-72-120"},{"hadith-eng":"Allah's Messenger (ﷺ) prohibited the eating of donkey's meat.Narrated Az-Zuhri:The Prophet (ﷺ) prohibited the eating of beasts having fangs.","reference":"Sahih al-Bukhari 5527, Book 72, Hadith 52","grade":"","question #":"question #2","question":"Why might certain animals, such as those with fangs, be prohibited from being eaten in Islamic dietary laws?","id":"bukhari-72-121"},{"hadith-eng":"Someone came to Allah's Messenger (ﷺ) and said, \"The donkeys have been (slaughtered and) eaten. Another \nman came and said, \"The donkeys have been destroyed.\" On that the Prophet (ﷺ) ordered a caller to \nannounce to the people: Allah and His Apostle forbid you to eat the meat of donkeys, for it is impure.' \nThus the pots were turned upside down while the (donkeys') meat was boiling in them.","reference":"Sahih al-Bukhari 5528, Book 72, Hadith 53","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the news about the consumption of donkey meat?","id":"bukhari-72-122"},{"hadith-eng":"I said to Jabir bin Zaid, \"The people claim that Allah's Messenger (ﷺ) forbade the eating of donkey's meat.\" \nHe said, \"Al-Hakam bin `Amr Al-Ghifari used to say so when he was with us, but Ibn `Abbas, the \ngreat religious learned man, refused to give a final verdict and recited:-- 'Say: I find not in that which \nhas been inspired to me anything forbidden to be eaten by one who wishes to eat it, unless it be \ncarrion, blood poured forth or the flesh of swine...' (6.145)","reference":"Sahih al-Bukhari 5529, Book 72, Hadith 54","grade":"","question #":"question #2","question":"How does the Quran address dietary restrictions and what are the specific prohibitions mentioned?","id":"bukhari-72-123"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the eating of the meat of beasts having fangs.","reference":"Sahih al-Bukhari 5530, Book 72, Hadith 55","grade":"","question #":"question #2","question":"Why might certain animals be forbidden to eat according to Islamic teachings?","id":"bukhari-72-124"},{"hadith-eng":"Once Allah's Messenger (ﷺ) passed by a dead sheep and said (to the people), \"Why don't you use its hide?\" \nThey said, \"But it is dead,\" He said, \"Only eating it, is prohibited.\"","reference":"Sahih al-Bukhari 5531, Book 72, Hadith 56","grade":"","question #":"question #2","question":"What are the permissible uses of a dead animal according to Islamic teachings?","id":"bukhari-72-125"},{"hadith-eng":"The Prophet (ﷺ) passed by a dead goat and said, \"There is no harm if its owners benefit from its skin.\"","reference":"Sahih al-Bukhari 5532, Book 72, Hadith 57","grade":"","question #":"question #2","question":"How can the skin of a dead animal be beneficial according to Islamic teachings?","id":"bukhari-72-126"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"None is wounded in Allah's Cause but will come on the Day of Resurrection \nwith his wound bleeding. The thing that will come out of his wound will be the color of blood, but its \nsmell will be the smell of musk.\"","reference":"Sahih al-Bukhari 5533, Book 72, Hadith 58","grade":"","question #":"question #2","question":"How are the wounds of those who fought in Allah's Cause described in terms of appearance and fragrance?","id":"bukhari-72-127"},{"hadith-eng":"The Prophet (ﷺ) said, 'The example of a good pious companion and an evil one is that of a person carrying \nmusk and another blowing a pair of bellows. The one who is carrying musk will either give you some \nperfume as a present, or you will buy some from him, or you will get a good smell from him, but the \none who is blowing a pair of bellows will either burn your clothes or you will get a bad smell from \nhim.\"","reference":"Sahih al-Bukhari 5534, Book 72, Hadith 59","grade":"","question #":"question #2","question":"How can the influence of companions affect a person's behavior and character?","id":"bukhari-72-128"},{"hadith-eng":"Once we provoked a rabbit at Marr-az-Zahran. The people chased it till they got tired. Then I caught It \nand brought it to Abu Talha, who slaughtered it and then sent both its pelvic pieces (or legs) to the \nProphet, and the Prophet (ﷺ) accepted the present.","reference":"Sahih al-Bukhari 5535, Book 72, Hadith 60","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) demonstrate their respect and love for him through their actions?","id":"bukhari-72-129"},{"hadith-eng":"The Prophet (ﷺ) said, \"I do not eat mastigure, but I do not prohibit its eating.\"","reference":"Sahih al-Bukhari 5536, Book 72, Hadith 61","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) differentiate between personal preference and religious prohibition in dietary matters?","id":"bukhari-72-130"},{"hadith-eng":"Allah's Messenger (ﷺ) and I entered the house of Maimuna. A roasted mastigure was served. Allah's Messenger (ﷺ) \nstretched his hand out (to eat of it) but some woman said, \"Inform Allah's Messenger (ﷺ) of what he is about \nto eat.\" So they said, \"It is mastigure, O Allah's Messenger (ﷺ)!\" He withdrew his hand, whereupon I said, \"O \nAllah's Messenger (ﷺ)! Is it unlawful?\" He said, \"No, but this is not found in the land of my people, so I \ndislike it.\" So I pulled the mastigure towards me and ate it while Allah's Messenger (ﷺ) was looking at me.","reference":"Sahih al-Bukhari 5537, Book 72, Hadith 62","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate respect for personal dislikes in this situation?","id":"bukhari-72-131"},{"hadith-eng":"A mouse fell into the butter-fat and died. The Prophet (ﷺ) was asked about that. He said, \"Throw away the \nmouse and the butter-fat that surrounded it, and eat the rest of the butter-fat (As-Samn).","reference":"Sahih al-Bukhari 5538, Book 72, Hadith 63","grade":"","question #":"question #2","question":"How does Islamic law address the issue of food contamination?","id":"bukhari-72-132"},{"hadith-eng":"regarding an animal, e.g., a mouse or some other animal that had fallen into solid or liquid oil or \nbutter-fat: I had been informed that a mouse had died in butter-fat whereupon Allah's Messenger (ﷺ) ordered \nthat the butter-fat near it be thrown away and the rest of the butter-fat can be eaten.","reference":"Sahih al-Bukhari 5539, Book 72, Hadith 64","grade":"","question #":"question #2","question":"How does Islamic law address the issue of contamination in food by animals?","id":"bukhari-72-133"},{"hadith-eng":"The Prophet (ﷺ) was asked about a mouse that had fallen into butter-fat (and died). He said, \"Throw away \nthe mouse and the portion of butter-fat around it, and eat the rest.\"","reference":"Sahih al-Bukhari 5540, Book 72, Hadith 65","grade":"","question #":"question #2","question":"How does Islamic law address the issue of contamination in food?","id":"bukhari-72-134"},{"hadith-eng":"that Ibn `Umar disliked the branding of animals on the face. Ibn `Umar said, \"The Prophet (ﷺ) forbade \nbeating (animals) on the face.\"","reference":"Sahih al-Bukhari 5541, Book 72, Hadith 66","grade":"","question #":"question #2","question":"Why is it discouraged to brand or beat animals on the face in Islam?","id":"bukhari-72-135"},{"hadith-eng":"I brought a brother of mine to the Prophet (ﷺ) to do Tahnik for him while the Prophet (ﷺ) was in a sheep fold \nof his, and I saw him branding a sheep. (The sub-narrator said: I think Anas said, branding it on the \near.)","reference":"Sahih al-Bukhari 5542, Book 72, Hadith 67","grade":"","question #":"question #2","question":"What does the act of branding animals signify in the context of Islamic practices?","id":"bukhari-72-136"},{"hadith-eng":"I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for \nslaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, \nand if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or \nnail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" \nThe quick ones among the people got the war booty while the Prophet (ﷺ) was behind the people. So they \nplaced the cooking pots on the fire, but the Prophet (ﷺ) ordered the cooking pots to be turned upside \ndown. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. \nThen a camel belonging to the first party of people ran away and they had no horses with them, so a \nman shot it with an arrow whereby Allah stopped it. The Prophet (ﷺ) said, \"Of these animals there are \nsome which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it \nwith an arrow).","reference":"Sahih al-Bukhari 5543, Book 72, Hadith 68","grade":"","question #":"question #2","question":"How should war booty be distributed according to Islamic teachings?","id":"bukhari-72-137"},{"hadith-eng":"While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an \narrow and stopped it. The Prophet (ﷺ) said, \"Of these camels some are as wild as wild beasts, so if one of \nthem runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's \nApostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we \nhave no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to \nflow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering \ninstrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"","reference":"Sahih al-Bukhari 5544, Book 72, Hadith 69","grade":"","question #":"question #2","question":"What are the conditions for permissible slaughtering of animals in Islam?","id":"bukhari-72-138"},{"hadith-eng":"I asked the Prophet (ﷺ) about the game killed by a Mi'rad (i.e. a sharp-edged piece of wood or a piece of \nwood provided with a sharp piece of iron used for hunting). He said, \"If the game is killed with its \nsharp edge, eat of it, but if it is killed with its shaft, with a hit by its broad side then the game is \n(unlawful to eat) for it has been beaten to death.\" I asked him about the game killed by a trained \nhound. He said, \"If the hound catches the game for you, eat of it, for killing the game by the hound, is \nlike its slaughtering. But if you see with your hound or hounds another dog, and you are afraid that it \nmight have shared in hunting the game with your hound and killed it, then you should not eat of it, \nbecause you have mentioned Allah's name on (sending) your hound only, but you have not mentioned \nit on some other hound.","reference":"Sahih al-Bukhari 5475, Book 72, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of mentioning Allah's name when sending a trained hound for hunting?","id":"bukhari-72-139"},{"hadith-eng":"I asked Allah's Messenger (ﷺ) about the Mi'rad. He said, \"If you hit the game with its sharp edge, eat it, but if \nthe Mi'rad hits the game with its shaft with a hit by its broad side do not eat it, for it has been beaten to \ndeath with a piece of wood. (i.e. unlawful).\" I asked, \"If I let loose my trained hound after a game?\" \nHe said, \"If you let loose your trained hound after game, and mention the name of Allah, then you can \neat.\" I said, \"If the hound eats of the game?\" He said \"Then you should not eat of it, for the hound has \nhunted the game for itself and not for you.\" I said, \"Some times I send my hound and then I find some \nother hound with it?\" He said \"Don't eat the game, as you have mentioned the Name of Allah on your \ndog only and not on the other.\"","reference":"Sahih al-Bukhari 5476, Book 72, Hadith 2","grade":"","question #":"question #3","question":"Why is it important to mention the name of Allah when sending a hound for hunting?","id":"bukhari-72-140"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! We let loose our trained hounds after a game?\" He said, \"Eat what they \nhunt for you.\" I said, \"Even if they killed (the game)?\" He replied, 'Even if they killed (the game).\" I \nsaid, 'We also hit (the game) with the Mi'rad?\" He said, \"Eat of the animal which the Mi'rad kills by \npiercing its body, but do not eat of the animal which is killed by the broad side of the Mi'rad.''","reference":"Sahih al-Bukhari 5477, Book 72, Hadith 3","grade":"","question #":"question #3","question":"How does the method of killing affect the permissibility of consuming hunted animals?","id":"bukhari-72-141"},{"hadith-eng":"I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take \nour meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and \nwith my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He \nsaid, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other \nthan theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat \nout of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt \nsomething with your trained hound after mentioning Allah's Name, eat of it, and if you hunt \nsomething with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"","reference":"Sahih al-Bukhari 5478, Book 72, Hadith 4","grade":"","question #":"question #3","question":"How does the training of a hunting hound affect the permissibility of eating the hunted game?","id":"bukhari-72-142"},{"hadith-eng":"that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw \r\nstones, for Allah's Messenger (ﷺ) has forbidden throwing stones, or he used to dislike it.\" `Abdullah added: \r\nThrowing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or \r\ngouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I \r\ntell you that Allah's Messenger (ﷺ) has forbidden or disliked the throwing the stones (in such a way), yet you \r\nare throwing stones! I shall not talk to you for such-and-such a period.\"","reference":"Sahih al-Bukhari 5479, Book 72, Hadith 5","grade":"","question #":"question #3","question":"What consequences might one face for disregarding the Prophet's guidance according to the narration?","id":"bukhari-72-143"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever keeps a (pet) dog which is neither a watch dog nor a hunting dog, will get \na daily deduction of two Qirat from his good deeds.\"","reference":"Sahih al-Bukhari 5480, Book 72, Hadith 6","grade":"","question #":"question #3","question":"What types of dogs are permissible to keep in Islam without incurring a deduction in good deeds?","id":"bukhari-72-144"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If someone keeps a dog neither for hunting, nor for guarding livestock, \nthe reward (for his good deeds) will be reduced by two Qirats per day.\"","reference":"Sahih al-Bukhari 5481, Book 72, Hadith 7","grade":"","question #":"question #3","question":"What is the significance of the term 'Qirats' in the context of Islamic teachings on rewards and deeds?","id":"bukhari-72-145"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If someone keeps a dog neither for guarding livestock, nor for hunting, his good \ndeeds will decrease (in reward) by two Qirats a day.'","reference":"Sahih al-Bukhari 5482, Book 72, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of the term 'Qirats' in the context of Islamic teachings on good deeds?","id":"bukhari-72-146"},{"hadith-eng":"I asked Allah's Messenger (ﷺ). \"We hunt with the help of these hounds.\" He said, \"If you let loose your \ntrained hounds after a game, and mention the name of Allah, then you can eat what the hounds catch \nfor you, even if they killed the game. But you should not eat of it if the hound has eaten of it, for then \nit is likely that the hound has caught the game for itself. And if other hounds join your hound in \nhunting the game, then do not eat of it.\"","reference":"Sahih al-Bukhari 5483, Book 72, Hadith 9","grade":"","question #":"question #3","question":"What are the implications if a trained hound eats from the game it catches?","id":"bukhari-72-147"},{"hadith-eng":"The Prophet (ﷺ) said, \"If you let loose your hound after a game and mention Allah's Name on sending it, \nand the hound catches the game and kills it, then you can eat of it. But if the hound eats of it, then you \nshould not eat thereof, for the hound has caught it for itself. And if along with your hound, joined other \nhounds, and Allah's Name was not mentioned at the time of their sending, and they catch an animal \nand kill it, you should not eat of it, for you will not know which of them has killed it. And if you have \nthrown an arrow at the game and then find it (dead) two or three days later and, it bears no mark other \nthan the wound inflicted by your arrow, then you can eat of it. But if the game is found (dead) in \nwater, then do not eat of it.\"","reference":"Sahih al-Bukhari 5484, Book 72, Hadith 10","grade":"","question #":"question #3","question":"What should be considered when finding game killed by an arrow after several days?","id":"bukhari-72-148"},{"hadith-eng":"And it has also been narrated by `Adi bin Hatim that he asked the Prophet (ﷺ) \n\"If a hunter throws an arrow at the game and after tracing it for two or three days he finds it dead but \nstill bearing his arrow, (can he eat of it)?\" The Prophet (ﷺ) replied, \"He can eat if he wishes.\"","reference":"Sahih al-Bukhari 5485, Book 72, Hadith 11","grade":"","question #":"question #3","question":"What conditions must be met for a hunter to eat the game he has hunted after a few days?","id":"bukhari-72-149"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! I let loose my hound after a game and mention Allah's Name on sending \nit.\" The Prophet (ﷺ) said, \"If you let loose your hound after a game and you mention Allah's Name on \nsending it and the hound catches and kills the game and eats of it, then you should not eat of it, for it \nhas killed it for itself.\" I said, \"Sometimes when I send my hound after a game, I find another hound \nalong with it and I do not know which of them has caught the game.\" He said, \"You must not eat of it \nbecause you have not mentioned, the Name of Allah except on sending your own hound, and you did \nnot mention it on the other hound.\" Then I asked him about the game hunted with a Mi'rad (i.e. a \nsharp edged piece of wood or a piece of wood provided with a sharp piece of iron used for hunting). \nHe said, \"If the game is killed with its sharp edge, you can eat of it, but if it is killed by its broad side \n(shaft), you cannot eat of it, for then it is like an animal beaten to death with a piece of wood.\"","reference":"Sahih al-Bukhari 5486, Book 72, Hadith 12","grade":"","question #":"question #3","question":"What are the guidelines for determining the permissibility of eating game hunted with a Mi'rad?","id":"bukhari-72-150"},{"hadith-eng":"I asked Allah's Messenger (ﷺ), \"We hunt with these hounds.\" He said, \"If you send your trained hounds after \na game and mention Allah's Name on sending, you can eat of what they catch for you. But if the \nhound eats of the game, then you must not eat of it, for I am afraid that the hound caught it for itself, \nand if another hound joins your hounds (during the hunt), you should not eat of the game.\"","reference":"Sahih al-Bukhari 5487, Book 72, Hadith 13","grade":"","question #":"question #3","question":"What should be done if a hunting dog eats from the game it catches?","id":"bukhari-72-151"},{"hadith-eng":"I came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow \nand trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your \nsaying that you are living in the land of the people of the Scripture and that you eat in their utensils, if \nyou can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than \ntheirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if \nyou hung something with your bow, and have mentioned Allah's Name while hunting, then you can \neat (the game). And if you hunt something with your trained hound, and have mentioned Allah's \nName on sending it for hunting then you can eat (the game). But if you hunt something with your \nuntrained hound and you were able to slaughter it before its death, you can eat of it.\"","reference":"Sahih al-Bukhari 5488, Book 72, Hadith 14","grade":"","question #":"question #3","question":"How does the training of a hunting hound affect the permissibility of eating the game it catches?","id":"bukhari-72-152"},{"hadith-eng":"We provoked a rabbit at Marr Az-Zahran till it started jumping. My companions chased it till they got \ntired. But I alone ran after it and caught it and brought it to Abu Talha. He sent both its legs to the \nProphet who accepted them.","reference":"Sahih al-Bukhari 5489, Book 72, Hadith 15","grade":"","question #":"question #3","question":"What can be learned about the Prophet's acceptance of gifts from his companions?","id":"bukhari-72-153"},{"hadith-eng":"that once he was with Allah's Messenger (ﷺ) (on the way to Mecca). When he had covered some of the way \nto Mecca, he and some companions of his, who were in the state of lhram. remained behind the \nProphet while Abu Qatada himself was not in the state of Ihram. Abu Qatada, seeing an onager rode \nhis horse and asked his companions to hand him a whip, but they refused. He then asked them to hand \nhim his spear, but they refused. Then he took it himself and attacked the onager and killed it. Some of \nthe Companions of Allah's Messenger (ﷺ) ate of it, but some others refused to eat. When they met Allah's \nApostle they asked him about that. He said, \"It was meal given to you by Allah.\"","reference":"Sahih al-Bukhari 5490, Book 72, Hadith 16","grade":"","question #":"question #3","question":"What does this incident illustrate about the provisions provided by Allah during a journey?","id":"bukhari-72-154"},{"hadith-eng":"(the same Hadith above, but he added); The Prophet (ﷺ) asked, \"Is there any of its meat left with you?\"","reference":"Sahih al-Bukhari 5491, Book 72, Hadith 17","grade":"","question #":"question #3","question":"What actions are recommended for a person seeking forgiveness after committing a sin?","id":"bukhari-72-155"},{"hadith-eng":"I was with the Prophet (on a journey) between Mecca and Medina, and all of them, (i.e. the Prophet (ﷺ) \nand his companions) were in the state of Ihram, while I was not in that state. I was riding my horse \nand I used to be fond of ascending mountains. So while I was doing so I noticed that the people were \nlooking at something. I went to see what it was, and behold it was an onager. I asked my companions, \n\"What is that?\" They said, \"We do not know.\" I said, \"It is an onager.' They said, \"It is what you have \nseen.\" I had left my whip, so I said to them, \"Hand to me my whip.\" They said, \"We will not help you \nin that (in hunting the onager).\" I got down, took my whip and chased the animal (on my horse) and \ndid not stop till I killed it. I went to them and said, \"Come on, carry it!\" But they said, \"We will not \neven touch it.\" At last I alone carried it and brought it to them. Some of them ate of it and some \nrefused to eat of it. I said (to them), \"I will ask the Prophet (ﷺ) about it (on your behalf).\" When I met the \nProphet, I told him the whole story. He said to me, \"Has anything of it been left with you?\" I said, \n\"Yes.\" He said, \"Eat, for it is a meal Allah has offered to you.\"","reference":"Sahih al-Bukhari 5492, Book 72, Hadith 18","grade":"","question #":"question #3","question":"What is the significance of seeking the Prophet's guidance in matters of uncertainty during his time?","id":"bukhari-72-156"},{"hadith-eng":"We went out in a campaign and the army was called The Army of the Khabt, and Abu 'Ubaida was \nour commander. We were struck with severe hunger. Then the sea threw a huge dead fish called Al- \n`Anbar, the like of which had never been seen. We ate of it for half a month, and then Abu 'Ubaida \ntook one of its bones (and made an arch of it) so that a rider could easily pass under it.","reference":"Sahih al-Bukhari 5493, Book 72, Hadith 19","grade":"","question #":"question #3","question":"What significance does the incident of the large fish, Al-`Anbar, hold in Islamic history?","id":"bukhari-72-157"},{"hadith-eng":"The Prophet (ﷺ) sent us as an army unit of three hundred warriors under the command of Abu 'Ubaida to \nambush a caravan of the Quraish. But we were struck with such severe hunger that we ate the Khabt \n(desert bushes), so our army was called the Army of the Khabt. Then the sea threw a huge fish called \nAl-`Anbar and we ate of it for half a month and rubbed our bodies with its fat till our bodies became \nhealthy. Then Abu Ubaida took one of its ribs and fixed it over the ground and a rider passed \nunderneath it. There was a man amongst us who slaughtered three camels when hunger became \nsevere, and he slaughtered three more, but after that Abu 'Ubaida forbade him to do so.","reference":"Sahih al-Bukhari 5494, Book 72, Hadith 20","grade":"","question #":"question #3","question":"What was the significance of the large fish called Al-`Anbar in the survival of the army unit?","id":"bukhari-72-158"},{"hadith-eng":"We participated with the Prophet (ﷺ) in six or seven Ghazawat, and we used to eat locusts with him.","reference":"Sahih al-Bukhari 5495, Book 72, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of eating locusts in Islamic tradition or history?","id":"bukhari-72-159"},{"hadith-eng":"I came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture, and we take our meals in their utensils, and there is game in that land and I hunt with my \nbow and with my trained hound and with my untrained hound.\" The Prophet (ﷺ) said, \"As for your saying \nthat you are in the land of people of the Scripture, you should not eat in their utensils unless you find \nno alternative, in which case you must wash the utensils and then eat in them As for your saying that \nyou are in the land of game, if you hunt something with your bow, mention Allah's Name (while \nhunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name \non sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it \nand you can eat of it.\"","reference":"Sahih al-Bukhari 5496, Book 72, Hadith 22","grade":"","question #":"question #3","question":"How should one handle game caught by an untrained hound according to Islamic teachings?","id":"bukhari-72-160"},{"hadith-eng":"In the evening of the day of the conquest of Khaibar, the army made fires (for cooking). The Prophet (ﷺ) \nsaid, \"For what have you made these fires?\" They said, \"For cooking the meat of domestic donkeys.\" \nHe said, \"Throw away what is in the cooking pots and break the pots.\" A man from the people got up \nand said, \"Shall we throw the contents of the cooking pots and then wash the pots (instead of breaking \nthem)?\" The Prophet (ﷺ) said, \"Yes, you can do either.'","reference":"Sahih al-Bukhari 5497, Book 72, Hadith 23","grade":"","question #":"question #3","question":"What does this incident teach about the permissibility of consuming certain types of meat in Islam?","id":"bukhari-72-161"},{"hadith-eng":"We were with the Prophet (ﷺ) in Dhul-Hulaifa and there the people were struck with severe hunger. Then \nwe got camels and sheep as war booty (and slaughtered them). The Prophet (ﷺ) was behind all the people. \nThe people hurried and fixed the cooking pots (for cooking) but the Prophet (ﷺ) came there and ordered \nthat the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as \nequal to one camel. One of the camels ran away and there were a few horses with the people. They \nchased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. \nThe Prophet (ﷺ) said, \"Among these animals some are as wild as wild beasts, so if one of them runs away \nfrom you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the \nenemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet (ﷺ) said, \"If the \nkilling tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). \nBut do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the \nknife of Ethiopians.\"","reference":"Sahih al-Bukhari 5498, Book 72, Hadith 24","grade":"","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) emphasize the importance of mentioning Allah's Name during the slaughtering process?","id":"bukhari-72-162"},{"hadith-eng":"Allah's Messenger (ﷺ) said that he met Zaid bin `Amr Nufail at a place near Baldah and this had happened \nbefore Allah's Messenger (ﷺ) received the Divine Inspiration. Allah's Messenger (ﷺ) presented a dish of meat (that \nhad been offered to him by the pagans) to Zaid bin `Amr, but Zaid refused to eat of it and then said (to \nthe pagans), \"I do not eat of what you slaughter on your stonealtars (Ansabs) nor do I eat except that \non which Allah's Name has been mentioned on slaughtering.\"","reference":"Sahih al-Bukhari 5499, Book 72, Hadith 25","grade":"","question #":"question #3","question":"What can be learned from Zaid bin `Amr's refusal to eat meat offered by pagans?","id":"bukhari-72-163"},{"hadith-eng":"Once during the lifetime of Allah's Messenger (ﷺ) we offered some animals as sacrifices. Some people \nslaughtered their sacrifices before the (Id) prayer, so when the Prophet (ﷺ) finished his prayer, he saw that \nthey had slaughtered their sacrifices before the prayer. He said, \"Whoever has slaughtered (his \nsacrifice) before the prayer, should slaughter (another sacrifice) in lieu of it; and whoever has not yet \nslaughtered it till we have prayed; should slaughter (it) by mentioning Allah's Name.\"","reference":"Sahih al-Bukhari 5500, Book 72, Hadith 26","grade":"","question #":"question #3","question":"Why is it important to mention Allah's Name when slaughtering a sacrificial animal?","id":"bukhari-72-164"},{"hadith-eng":"that a slave girl of theirs used to shepherd some sheep at Si'a (a mountain near Medina). On seeing \none of her sheep dying, she broke a stone and slaughtered it. Ka`b said to his family, \"Do not eat (of \nit) till I go to the Prophet (ﷺ) and ask him, or, till I send someone to ask him.\" So he went to the Prophet (ﷺ) \nor sent someone to him The Prophet (ﷺ) permitted (them) to eat it.","reference":"Sahih al-Bukhari 5501, Book 72, Hadith 27","grade":"","question #":"question #3","question":"What are the considerations for determining the permissibility of consuming meat in Islam?","id":"bukhari-72-165"},{"hadith-eng":"that Ka`b had a slave girl who used to graze his sheep on a small mountain, called \"Sl'a\", situated near \nthe market. Once a sheep was dying, so she broke a stone and slaughtered it with it. When they \nmentioned that to the Prophet, he, permitted them to eat it.","reference":"Sahih al-Bukhari 5502, Book 72, Hadith 28","grade":"","question #":"question #3","question":"What considerations are taken into account when determining the permissibility of eating meat in Islam?","id":"bukhari-72-166"},{"hadith-eng":"that he said, \"O Allah's Messenger (ﷺ)! We have no knife.\" The Prophet (ﷺ) said, \"if the killing tool causes blood \nto gush out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter \nwith a nail or a tooth, for the nail is the knife of Ethiopians and a tooth is a bone.\" Suddenly a camel \nran away and it was stopped (with an arrow). The Prophet (ﷺ) then said, \"Of these camels there are some \nwhich are as wild as wild beasts; so if one of them runs away from you and you cannot catch it, treat it \nin this manner (i.e. shoot it with an arrow).","reference":"Sahih al-Bukhari 5503, Book 72, Hadith 29","grade":"","question #":"question #3","question":"How should one handle a runaway camel according to Islamic teachings?","id":"bukhari-72-167"},{"hadith-eng":"A lady slaughtered a sheep with a stone and then the Prophet (ﷺ) was asked about it and he permitted it to \nbe eaten.","reference":"Sahih al-Bukhari 5504, Book 72, Hadith 30","grade":"","question #":"question #3","question":"How does the permissibility of eating an animal slaughtered with a stone reflect on the flexibility of Islamic dietary laws?","id":"bukhari-72-168"},{"hadith-eng":"A slave girl belonging to Ka`b used to graze some sheep at Sl'a (mountain). Once one of her sheep \nwas dying. She reached it (before it died) and slaughtered it with a stone. The Prophet (ﷺ) was asked, and \nhe said, \"Eat it.\"","reference":"Sahih al-Bukhari 5505, Book 72, Hadith 31","grade":"","question #":"question #3","question":"What are the conditions under which an animal slaughtered with a stone is considered halal?","id":"bukhari-72-169"},{"hadith-eng":"The Prophet (ﷺ) said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except \nwhat is slaughtered with a tooth or a nail.'","reference":"Sahih al-Bukhari 5506, Book 72, Hadith 32","grade":"","question #":"question #3","question":"What is the significance of blood flow in the Islamic method of slaughtering animals?","id":"bukhari-72-170"},{"hadith-eng":"A group of people said to the Prophet, \"Some people bring us meat and we do not know whether they \nhave mentioned Allah's Name or not on slaughtering the animal.\" He said, \"Mention Allah's Name on \nit and eat.\" Those people had embraced Islam recently.","reference":"Sahih al-Bukhari 5507, Book 72, Hadith 33","grade":"","question #":"question #3","question":"What is the significance of mentioning Allah's name before consuming meat in Islam?","id":"bukhari-72-171"},{"hadith-eng":"While we were besieging the castle of Khaibar, Somebody threw a skin full of fat and I went ahead to \ntake it, but on looking behind, I saw the Prophet (ﷺ) and I felt shy in his presence (and did not take it).","reference":"Sahih al-Bukhari 5508, Book 72, Hadith 34","grade":"","question #":"question #3","question":"What ethical considerations might arise when one desires something that is not rightfully theirs?","id":"bukhari-72-172"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! We are going to face the enemy tomorrow and we do not have knives.\" He \nsaid, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name \nis mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you \nwhy: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some \ncamels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an \narrow and stopped it. Allah's Messenger (ﷺ) said, \"Of these camels there are some which are as wild as wild \nbeasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"","reference":"Sahih al-Bukhari 5509, Book 72, Hadith 35","grade":"","question #":"question #3","question":"How should one handle animals that become difficult to manage or capture according to Islamic teachings?","id":"bukhari-72-173"},{"hadith-eng":"We slaughtered a horse (by Nahr) during the lifetime of the Prophet (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5510, Book 72, Hadith 36","grade":"","question #":"question #3","question":"What are the implications of actions performed during the lifetime of the Prophet (ﷺ) on Islamic jurisprudence?","id":"bukhari-72-174"},{"hadith-eng":"We slaughtered a horse (by Dhabh) during the lifetime of Allah's Messenger (ﷺ) while we were at Medina, \nand we ate it.","reference":"Sahih al-Bukhari 5511, Book 72, Hadith 37","grade":"","question #":"question #3","question":"How does this narration reflect the permissibility of certain animals for consumption in Islamic law?","id":"bukhari-72-175"},{"hadith-eng":"We slaughtered a horse (by Nahr) during the lifetime of Allah's Messenger (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5512, Book 72, Hadith 38","grade":"","question #":"question #3","question":"What are the implications of slaughtering animals according to Islamic practices during the Prophet's time?","id":"bukhari-72-176"},{"hadith-eng":"Anas and I went to Al-Hakam bin Aiyub. Anas saw some boys shooting at a tied hen. Anas said, \"The \nProphet has forbidden the shooting of tied or confined animals.\"","reference":"Sahih al-Bukhari 5513, Book 72, Hadith 39","grade":"","question #":"question #3","question":"How does Islam guide its followers in terms of ethical treatment of animals?","id":"bukhari-72-177"},{"hadith-eng":"that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn \n`Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from \ntying the birds for the sake of killing them, as I have heard the Prophet (ﷺ) forbidding the killing of an \nanimal or other living thing after tying them.\"","reference":"Sahih al-Bukhari 5514, Book 72, Hadith 40","grade":"","question #":"question #3","question":"What teachings of the Prophet Muhammad (ﷺ) emphasize the humane treatment of living creatures?","id":"bukhari-72-178"},{"hadith-eng":"While I was with Ibn `Umar, we passed by a group of young men who had tied a hen and started \nshooting at it. When they saw Ibn `Umar, they dispersed, leaving it. On that Ibn `Umar said, \"Who has \ndone this? The Prophet (ﷺ) cursed the one who did so.\"Narrated Ibn `Umar:The Prophet (ﷺ) cursed the one who did Muthla to an animal (i e., cut its limbs or some other part of its \nbody while it is still alive).","reference":"Sahih al-Bukhari 5515, Book 72, Hadith 41","grade":"","question #":"question #3","question":"How does Islam view the act of using animals for target practice or entertainment?","id":"bukhari-72-179"},{"hadith-eng":"The Prophet (ﷺ) forbade An-Nuhba and Al-Muthla.","reference":"Sahih al-Bukhari 5516, Book 72, Hadith 42","grade":"","question #":"question #3","question":"How do Islamic teachings address the issue of mutilation or disfigurement?","id":"bukhari-72-180"},{"hadith-eng":"I saw the Prophet (ﷺ) eating chicken.","reference":"Sahih al-Bukhari 5517, Book 72, Hadith 43","grade":"","question #":"question #3","question":"What can be learned from the eating habits of the Prophet Muhammad (ﷺ)?","id":"bukhari-72-181"},{"hadith-eng":"We were in the company of Abu Musa Al-Ash`ari and there were friendly relations between us and \nthis tribe of Jarm. Abu Musa was presented with a dish containing chicken. Among the people there \nwas sitting a red-faced man who did not come near the food. Abu Musa said (to him), \"Come on (and \neat), for I have seen Allah's Messenger (ﷺ) eating of it (i.e. chicken).\" He said, \"I have seen it eating \nsomething (dirty) and since then I have disliked it, and have taken an oath that I shall not eat it ' Abu \nMusa said, \"Come on, I will tell you (or narrate to you). Once I went to Allah s Apostle with a group \nof Al-Ash`ariyin, and met him while he was angry, distributing some camels of rak`at. We asked for \nmounts but he took an oath that he would not give us any mounts, and added, 'I have nothing to mount \nyou on' In the meantime some camels of booty were brought to Allah's Messenger (ﷺ) and he asked twice, \n'Where are Al-Ash`ariyin?\" So he gave us five white camels with big humps. We stayed for a short \nwhile (after we had covered a little distance), and then I said to my companions, \"Allah's Messenger (ﷺ) has \nforgotten his oath. By Allah, if we do not remind Allah's Messenger (ﷺ) of his oath, we will never be \nsuccessful.\" So we returned to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We asked you for mounts, \nbut you took an oath that you would not give us any mounts; we think that you have forgotten your \noath.' He said, 'It is Allah Who has given you mounts. By Allah, and Allah willing, if I take an oath \nand later find something else better than that. then I do what is better and expiate my oath.' \"","reference":"Sahih al-Bukhari 5518, Book 72, Hadith 44","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) generosity and decision-making from the incident involving the distribution of camels?","id":"bukhari-72-182"},{"hadith-eng":"We slaughtered a horse during the lifetime of Allah's Messenger (ﷺ) and ate it.","reference":"Sahih al-Bukhari 5519, Book 72, Hadith 45","grade":"","question #":"question #3","question":"What are some examples of animals that were consumed during the time of the Prophet (ﷺ)?","id":"bukhari-72-183"},{"hadith-eng":"On the Day of the battle of Khaibar, Allah's Messenger (ﷺ) made donkey's meat unlawful and allowed the \neating of horse flesh.","reference":"Sahih al-Bukhari 5520, Book 72, Hadith 46","grade":"","question #":"question #3","question":"How did the rulings on consuming donkey and horse meat differ according to Islamic teachings during the Prophet's time?","id":"bukhari-72-184"},{"hadith-eng":"The Prophet (ﷺ) made the meat of donkeys unlawful on the day of the battle of Khaibar.","reference":"Sahih al-Bukhari 5521, Book 72, Hadith 47","grade":"","question #":"question #3","question":"How do historical events influence the dietary guidelines in Islam?","id":"bukhari-72-185"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat.","reference":"Sahih al-Bukhari 5522, Book 72, Hadith 48","grade":"","question #":"question #3","question":"What is the significance of adhering to the dietary laws prescribed in Islam?","id":"bukhari-72-186"},{"hadith-eng":"Allah's Messenger (ﷺ) prohibited Al-Mut'a marriage and the eating of donkey's meat in the year of the \nKhaibar battle.","reference":"Sahih al-Bukhari 5523, Book 72, Hadith 49","grade":"","question #":"question #3","question":"Why was the consumption of donkey's meat prohibited by the Prophet Muhammad (ﷺ)?","id":"bukhari-72-187"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat on the day of the battle of Khaibar, and allowed \nthe eating of horse flesh.","reference":"Sahih al-Bukhari 5524, Book 72, Hadith 50","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) differentiate between the consumption of donkey and horse meat?","id":"bukhari-72-188"},{"hadith-eng":"The Prophet (ﷺ) prohibited the eating of donkey's meat.","reference":"Sahih al-Bukhari 5525, 5526, Book 72, Hadith 51","grade":"","question #":"question #3","question":"How do Islamic dietary restrictions reflect the teachings of the Prophet (ﷺ)?","id":"bukhari-72-189"},{"hadith-eng":"Allah's Messenger (ﷺ) prohibited the eating of donkey's meat.Narrated Az-Zuhri:The Prophet (ﷺ) prohibited the eating of beasts having fangs.","reference":"Sahih al-Bukhari 5527, Book 72, Hadith 52","grade":"","question #":"question #3","question":"How do Islamic dietary restrictions reflect the broader principles of halal and haram in Islam?","id":"bukhari-72-190"},{"hadith-eng":"Someone came to Allah's Messenger (ﷺ) and said, \"The donkeys have been (slaughtered and) eaten. Another \nman came and said, \"The donkeys have been destroyed.\" On that the Prophet (ﷺ) ordered a caller to \nannounce to the people: Allah and His Apostle forbid you to eat the meat of donkeys, for it is impure.' \nThus the pots were turned upside down while the (donkeys') meat was boiling in them.","reference":"Sahih al-Bukhari 5528, Book 72, Hadith 53","grade":"","question #":"question #3","question":"What actions were taken by the people upon receiving the Prophet's (ﷺ) prohibition regarding donkey meat?","id":"bukhari-72-191"},{"hadith-eng":"I said to Jabir bin Zaid, \"The people claim that Allah's Messenger (ﷺ) forbade the eating of donkey's meat.\" \nHe said, \"Al-Hakam bin `Amr Al-Ghifari used to say so when he was with us, but Ibn `Abbas, the \ngreat religious learned man, refused to give a final verdict and recited:-- 'Say: I find not in that which \nhas been inspired to me anything forbidden to be eaten by one who wishes to eat it, unless it be \ncarrion, blood poured forth or the flesh of swine...' (6.145)","reference":"Sahih al-Bukhari 5529, Book 72, Hadith 54","grade":"","question #":"question #3","question":"What role does personal interpretation play in understanding religious texts when there is no explicit prohibition?","id":"bukhari-72-192"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the eating of the meat of beasts having fangs.","reference":"Sahih al-Bukhari 5530, Book 72, Hadith 55","grade":"","question #":"question #3","question":"What is the significance of dietary restrictions in Islamic law?","id":"bukhari-72-193"},{"hadith-eng":"Once Allah's Messenger (ﷺ) passed by a dead sheep and said (to the people), \"Why don't you use its hide?\" \nThey said, \"But it is dead,\" He said, \"Only eating it, is prohibited.\"","reference":"Sahih al-Bukhari 5531, Book 72, Hadith 56","grade":"","question #":"question #3","question":"How does Islamic law differentiate between consuming and using parts of a dead animal?","id":"bukhari-72-194"},{"hadith-eng":"The Prophet (ﷺ) passed by a dead goat and said, \"There is no harm if its owners benefit from its skin.\"","reference":"Sahih al-Bukhari 5532, Book 72, Hadith 57","grade":"","question #":"question #3","question":"What are the conditions under which the skin of a dead animal can be used?","id":"bukhari-72-195"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"None is wounded in Allah's Cause but will come on the Day of Resurrection \nwith his wound bleeding. The thing that will come out of his wound will be the color of blood, but its \nsmell will be the smell of musk.\"","reference":"Sahih al-Bukhari 5533, Book 72, Hadith 58","grade":"","question #":"question #3","question":"What does the transformation of the smell of wounds into musk signify in Islamic teachings?","id":"bukhari-72-196"},{"hadith-eng":"The Prophet (ﷺ) said, 'The example of a good pious companion and an evil one is that of a person carrying \nmusk and another blowing a pair of bellows. The one who is carrying musk will either give you some \nperfume as a present, or you will buy some from him, or you will get a good smell from him, but the \none who is blowing a pair of bellows will either burn your clothes or you will get a bad smell from \nhim.\"","reference":"Sahih al-Bukhari 5534, Book 72, Hadith 59","grade":"","question #":"question #3","question":"What are the potential benefits and harms of associating with different types of people?","id":"bukhari-72-197"},{"hadith-eng":"Once we provoked a rabbit at Marr-az-Zahran. The people chased it till they got tired. Then I caught It \nand brought it to Abu Talha, who slaughtered it and then sent both its pelvic pieces (or legs) to the \nProphet, and the Prophet (ﷺ) accepted the present.","reference":"Sahih al-Bukhari 5535, Book 72, Hadith 60","grade":"","question #":"question #3","question":"What does this incident teach about the permissibility of hunting and consuming certain animals in Islam?","id":"bukhari-72-198"},{"hadith-eng":"The Prophet (ﷺ) said, \"I do not eat mastigure, but I do not prohibit its eating.\"","reference":"Sahih al-Bukhari 5536, Book 72, Hadith 61","grade":"","question #":"question #3","question":"What can be inferred about the permissibility of consuming certain foods in Islam based on the Prophet's personal eating habits?","id":"bukhari-72-199"},{"hadith-eng":"Allah's Messenger (ﷺ) and I entered the house of Maimuna. A roasted mastigure was served. Allah's Messenger (ﷺ) \nstretched his hand out (to eat of it) but some woman said, \"Inform Allah's Messenger (ﷺ) of what he is about \nto eat.\" So they said, \"It is mastigure, O Allah's Messenger (ﷺ)!\" He withdrew his hand, whereupon I said, \"O \nAllah's Messenger (ﷺ)! Is it unlawful?\" He said, \"No, but this is not found in the land of my people, so I \ndislike it.\" So I pulled the mastigure towards me and ate it while Allah's Messenger (ﷺ) was looking at me.","reference":"Sahih al-Bukhari 5537, Book 72, Hadith 62","grade":"","question #":"question #3","question":"What can be learned about the permissibility of food that is not customary in one's culture from this incident?","id":"bukhari-72-200"},{"hadith-eng":"A mouse fell into the butter-fat and died. The Prophet (ﷺ) was asked about that. He said, \"Throw away the \nmouse and the butter-fat that surrounded it, and eat the rest of the butter-fat (As-Samn).","reference":"Sahih al-Bukhari 5538, Book 72, Hadith 63","grade":"","question #":"question #3","question":"What guidance does Islam provide on handling impure substances in consumables?","id":"bukhari-72-201"},{"hadith-eng":"regarding an animal, e.g., a mouse or some other animal that had fallen into solid or liquid oil or \nbutter-fat: I had been informed that a mouse had died in butter-fat whereupon Allah's Messenger (ﷺ) ordered \nthat the butter-fat near it be thrown away and the rest of the butter-fat can be eaten.","reference":"Sahih al-Bukhari 5539, Book 72, Hadith 64","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the consumption of food that has been in contact with a dead animal?","id":"bukhari-72-202"},{"hadith-eng":"The Prophet (ﷺ) was asked about a mouse that had fallen into butter-fat (and died). He said, \"Throw away \nthe mouse and the portion of butter-fat around it, and eat the rest.\"","reference":"Sahih al-Bukhari 5540, Book 72, Hadith 65","grade":"","question #":"question #3","question":"What guidance does Islam provide on handling food that has come into contact with impurities?","id":"bukhari-72-203"},{"hadith-eng":"that Ibn `Umar disliked the branding of animals on the face. Ibn `Umar said, \"The Prophet (ﷺ) forbade \nbeating (animals) on the face.\"","reference":"Sahih al-Bukhari 5541, Book 72, Hadith 66","grade":"","question #":"question #3","question":"How does Islam guide its followers in the ethical treatment of animals?","id":"bukhari-72-204"},{"hadith-eng":"I brought a brother of mine to the Prophet (ﷺ) to do Tahnik for him while the Prophet (ﷺ) was in a sheep fold \nof his, and I saw him branding a sheep. (The sub-narrator said: I think Anas said, branding it on the \near.)","reference":"Sahih al-Bukhari 5542, Book 72, Hadith 67","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) interact with him in everyday situations?","id":"bukhari-72-205"},{"hadith-eng":"I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for \nslaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, \nand if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or \nnail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" \nThe quick ones among the people got the war booty while the Prophet (ﷺ) was behind the people. So they \nplaced the cooking pots on the fire, but the Prophet (ﷺ) ordered the cooking pots to be turned upside \ndown. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. \nThen a camel belonging to the first party of people ran away and they had no horses with them, so a \nman shot it with an arrow whereby Allah stopped it. The Prophet (ﷺ) said, \"Of these animals there are \nsome which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it \nwith an arrow).","reference":"Sahih al-Bukhari 5543, Book 72, Hadith 68","grade":"","question #":"question #3","question":"What should be done if a domesticated animal becomes wild and runs away?","id":"bukhari-72-206"},{"hadith-eng":"While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an \narrow and stopped it. The Prophet (ﷺ) said, \"Of these camels some are as wild as wild beasts, so if one of \nthem runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's \nApostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we \nhave no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to \nflow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering \ninstrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"","reference":"Sahih al-Bukhari 5544, Book 72, Hadith 69","grade":"","question #":"question #3","question":"Why are certain tools like teeth and nails prohibited for slaughtering animals in Islamic teachings?","id":"bukhari-72-207"}]