[{"hadith-eng":"The Prophet (ﷺ) said (on the day of Idal-Adha), \"The first thing we will do on this day of ours, is to offer \nthe (`Id) prayer and then return to slaughter the sacrifice. Whoever does so, he acted according to our \nSunna (tradition), and whoever slaughtered (the sacrifice) before the prayer, what he offered was just \nmeat he presented to his family, and that will not be considered as Nusak (sacrifice).\" (On hearing \nthat) Abu Burda bin Niyar got up, for he had slaughtered the sacrifice before the prayer, and said, \"I \nhave got a six month old ram.\" The Prophet (ﷺ) said, 'Slaughter it (as a sacrifice) but it will not be \nsufficient for any-one else (as a sacrifice after you). Al-Bara' added: The Prophet (ﷺ) said, \"Whoever \nslaughtered (the sacrifice) after the prayer, he slaughtered it at the right time and followed the tradition \nof the Muslims.\"","reference":"Sahih al-Bukhari 5545, Book 73, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of performing the Eid prayer before slaughtering the sacrifice on Eid al-Adha?","id":"bukhari-73-1"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the prayer, he just slaughtered it for \nhimself, and whoever slaughtered it after the prayer, he slaughtered it at the right time and followed \nthe tradition of the Muslims.\"","reference":"Sahih al-Bukhari 5546, Book 73, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of timing in performing religious sacrifices in Islam?","id":"bukhari-73-2"},{"hadith-eng":"that the Prophet (ﷺ) distributed among his companions some animals for sacrifice (to be slaughtered on \n`Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Messenger (ﷺ)! I get \nin my share of Jadha'a (a six month old ram).\" The Prophet (ﷺ) said, \"Slaughter it as a sacrifice.\"","reference":"Sahih al-Bukhari 5547, Book 73, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of distributing animals for sacrifice among companions during `Id-al-Adha?","id":"bukhari-73-3"},{"hadith-eng":"that the Prophet (ﷺ) entered upon her when she had her menses at Sarif before entering Mecca, and she \nwas weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet (ﷺ) \nsaid, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a \nmatter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the \nothers, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef \nwas brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Messenger (ﷺ) has \nslaughtered some cows as sacrifices on behalf of his wives.\"","reference":"Sahih al-Bukhari 5548, Book 73, Hadith 4","grade":"","question #":"question #1","question":"What guidance does Islam provide for women who are menstruating during the Hajj pilgrimage?","id":"bukhari-73-4"},{"hadith-eng":"The Prophet (ﷺ) said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should \nrepeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Messenger (ﷺ)! This is a day on \nwhich meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is \nto me better than the meat of two sheep.\" The Prophet (ﷺ) allowed him to slaughter it as a sacrifice, but I \ndo not know whether this permission was valid for other than that man or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and then the people went towards some sheep and distributed \nthem among themselves.","reference":"Sahih al-Bukhari 5549, Book 73, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of performing the sacrifice after the prayer on the day of Nahr?","id":"bukhari-73-5"},{"hadith-eng":"The Prophet (ﷺ) said, \"Time has come back to its original state which it had on the day Allah created the \nHeavens and the Earth. The year is twelve months, four of which are sacred, three of them are in \nsuccession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is \nbetween Juma'da (ath-thamj and Sha'ban. The Prophet (ﷺ) then asked, \"Which month is this?\" We said, \n\"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a \nname other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \n\"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we \nthought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of \nMecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know \nbetter.\" He kept silent so long that we thought that he would call it by a name other than its real name. \nHe said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor \nare as sacred to one another as this day of yours in this town of yours in this month of yours. You will \nmeet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting \nthe necks of each other. It is incumbent upon those who are present to convey this message to those \nwho are absent, for some of those to whom it is conveyed may comprehend it better than some of \nthose who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The \nProphet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered \nAllah's message (to you)?\"","reference":"Sahih al-Bukhari 5550, Book 73, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of the sacred months in Islam and which months are considered sacred?","id":"bukhari-73-6"},{"hadith-eng":"'Abdullah (bin 'Umar) used to slaughter his sacrifice at the \n     slaughtering place (i.e the slaughtering place of the Prophet (ﷺ) ) .","reference":"Sahih al-Bukhari 5551, Book 73, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of following the practices of the Prophet (ﷺ) in religious rituals?","id":"bukhari-73-7"},{"hadith-eng":"Ibn 'Umar said,\"Allah's Messenger (ﷺ) used to slaughter (camels and sheep, etc.,) as sacrifices at the Musalla.\"","reference":"Sahih al-Bukhari 5552, Book 73, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of performing sacrifices during Islamic rituals?","id":"bukhari-73-8"},{"hadith-eng":"The Prophet (ﷺ) used to offer two rams as sacrifices, and I also used to offer two rams.","reference":"Sahih al-Bukhari 5553, Book 73, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of offering sacrifices in Islam?","id":"bukhari-73-9"},{"hadith-eng":"Allah's Messenger (ﷺ) came towards two horned rams having black and white colors and slaughtered them \nwith his own hands.","reference":"Sahih al-Bukhari 5554, Book 73, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) performing the act of slaughtering animals himself?","id":"bukhari-73-10"},{"hadith-eng":"that the Prophet (ﷺ) gave him some sheep to distribute among his companions to slaughter as sacrifices \n(`Id--al--Adha). A kid goat was left and he told the Prophet (ﷺ) of that whereupon he said to him, \"Slaughter it \nas a sacrifice (on your behalf).","reference":"Sahih al-Bukhari 5555, Book 73, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of distributing sacrificial animals among companions during Eid al-Adha?","id":"bukhari-73-11"},{"hadith-eng":"An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Messenger (ﷺ) \nsaid to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's \nApostle! I have got a domestic kid goat.\" The Prophet (ﷺ) said, \"Slaughter it (as a sacrifice) but it will not be \npermissible for anybody other than you\" The Prophet (ﷺ) added, \"Whoever slaughtered his sacrifice \nbefore the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, \nhe offered his sacrifice properly and followed the tradition of the Muslims.\"","reference":"Sahih al-Bukhari 5556, Book 73, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of performing the sacrificial slaughter after the 'Id prayer in Islamic tradition?","id":"bukhari-73-12"},{"hadith-eng":"Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet (ﷺ) said to him, \n\"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" \n(Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) \nThe Prophet (ﷺ) said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient \nfor anyone else after you.\"","reference":"Sahih al-Bukhari 5557, Book 73, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of performing the sacrifice after the Eid prayer in Islamic tradition?","id":"bukhari-73-13"},{"hadith-eng":"The Prophet (ﷺ) slaughtered two rams, black and white in color (as sacrifices), and I saw him putting his \nfoot on their sides and mentioning Allah's Name and Takbir (Allahu Akbar). Then he slaughtered \nthem with his own hands.","reference":"Sahih al-Bukhari 5558, Book 73, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of mentioning Allah's Name and Takbir during the act of sacrifice?","id":"bukhari-73-14"},{"hadith-eng":"Allah's Messenger (ﷺ) entered upon me at Sarif while I was weeping (because I was afraid that I would not \nbe able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I \nreplied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform \nthe ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" \nAllah's Messenger (ﷺ) slaughtered some cows as sacrifices on behalf of his wives.","reference":"Sahih al-Bukhari 5559, Book 73, Hadith 15","grade":"","question #":"question #1","question":"What guidance does Islam provide for women who are menstruating during the Hajj pilgrimage?","id":"bukhari-73-15"},{"hadith-eng":"I heard the Prophet (ﷺ) delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we \nwill do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our \nsacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered \nhis sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that \nwas not a sacrifice.\" Abu Burda got up and said, \"O Allah's Messenger (ﷺ)! I slaughtered the sacrifice before \nthe prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet (ﷺ) said, \"Slaughter it \nto make up for that, but it will not be sufficient for anybody else after you.\"","reference":"Sahih al-Bukhari 5560, Book 73, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of performing the `Id prayer before slaughtering the sacrifice on the day of `Id?","id":"bukhari-73-16"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter \nanother one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of \nhis neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a \nwhich is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I \ndo not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and the people went towards their sheep and slaughtered \nthem.","reference":"Sahih al-Bukhari 5561, Book 73, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of performing the sacrifice after the Eid prayer in Islamic tradition?","id":"bukhari-73-17"},{"hadith-eng":"I witnessed the Prophet (ﷺ) on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before \noffering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered \ntheir sacrifice yet, should slaughter now.\"","reference":"Sahih al-Bukhari 5562, Book 73, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of performing the `Id prayer before slaughtering the sacrifice on the Day of Nahr?","id":"bukhari-73-18"},{"hadith-eng":"One day Allah's Messenger (ﷺ) offered the `Id prayer and said, \"Whoever offers our prayer and faces our \nQibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar got up \nand said, \"O Allah's Messenger (ﷺ)! I have already done it. The Prophet (ﷺ) said, \"That is something you have \ndone before its due time.\" Abu Burda said, \"I have a Jadha'a which is better than two old sheep; shall I \nslaughter it?\" The Prophet (ﷺ) said, \"Yes, but it will not be sufficient for anyone after you.\"","reference":"Sahih al-Bukhari 5563, Book 73, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of performing the 'Id prayer before slaughtering the sacrifice?","id":"bukhari-73-19"},{"hadith-eng":"The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his \nfoot on their sides and slaughter them with his own hands.","reference":"Sahih al-Bukhari 5564, Book 73, Hadith 20","grade":"","question #":"question #1","question":"What are the characteristics of the animals the Prophet (ﷺ) used for sacrifice?","id":"bukhari-73-20"},{"hadith-eng":"The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them \nwith his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their \nsides.","reference":"Sahih al-Bukhari 5565, Book 73, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) personally performing the sacrifice during Eid al-Adha?","id":"bukhari-73-21"},{"hadith-eng":"that he came to `Aisha and said to her, \"O Mother of the Believers! There is a man who sends a Hadi \nto Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state \nof Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" \n(What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She \nsaid, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to \nKa`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the \npeople returned (from the Hajj).","reference":"Sahih al-Bukhari 5566, Book 73, Hadith 22","grade":"","question #":"question #1","question":"What is the significance of sending a Hadi to the Ka'ba in Islamic tradition?","id":"bukhari-73-22"},{"hadith-eng":"During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to \nMedina. (The narrator often said. The meat of the Hadi).","reference":"Sahih al-Bukhari 5567, Book 73, Hadith 23","grade":"","question #":"question #1","question":"What was the practice regarding the meat of sacrifices during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-73-23"},{"hadith-eng":"that once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented \nto him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall \nnot taste it. (In his narration) Abu Sa`id added: I got up and went to my brother, Abu Qatada (who was \nhis maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He \nSa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and \neaten later on).","reference":"Sahih al-Bukhari 5568, Book 73, Hadith 24","grade":"","question #":"question #1","question":"What was the initial stance on consuming the meat of sacrifices after Eid al-Adha?","id":"bukhari-73-24"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after \nthree days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last \nyear?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having \na hard time and I wanted you to help (the needy).","reference":"Sahih al-Bukhari 5569, Book 73, Hadith 25","grade":"","question #":"question #1","question":"What is the significance of distributing meat from a sacrifice during times of hardship?","id":"bukhari-73-25"},{"hadith-eng":"We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \n\"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he \nwanted us to feed of it to others, Allah knows better.","reference":"Sahih al-Bukhari 5570, Book 73, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of distributing sacrificial meat to others in Islam?","id":"bukhari-73-26"},{"hadith-eng":"the freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab. \n`Umar offered the `Id prayer before the sermon and then delivered the sermon before the people, \nsaying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two \n'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the \nmeat of your sacrifices.\"","reference":"Sahih al-Bukhari 5571, Book 73, Hadith 27","grade":"","question #":"question #1","question":"What are the two days on which fasting is prohibited in Islam?","id":"bukhari-73-27"},{"hadith-eng":"(in continuation of above). Then I witnessed the `Id with `Uthman bin `Affan, and that was on a Friday. \nHe offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) \ntogether, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua \nprayer, he may wait, and whoever would like to return (home) Is granted my permission to do so.\"","reference":"Sahih al-Bukhari 5572, Book 73, Hadith 28","grade":"","question #":"question #1","question":"What considerations are made when two Islamic festivals coincide on the same day?","id":"bukhari-73-28"},{"hadith-eng":"(in continuation of above). Then I witnessed (the 'Its) with `Ali bin Abi Talib, and he too offered the `Id prayer before the sermon \nand then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat \nthe meat of your sacrifices for more than three days.\"","reference":"Sahih al-Bukhari 5573, Book 73, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of offering the Eid prayer before the sermon in Islamic tradition?","id":"bukhari-73-29"},{"hadith-eng":"`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for \nthree days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of \nthe meat of Hadi (which is regarded as unlawful after the three days of the `Id).","reference":"Sahih al-Bukhari 5574, Book 73, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of consuming the meat of sacrifices during `Id al Adha for a limited period?","id":"bukhari-73-30"},{"hadith-eng":"The Prophet (ﷺ) said (on the day of Idal-Adha), \"The first thing we will do on this day of ours, is to offer \nthe (`Id) prayer and then return to slaughter the sacrifice. Whoever does so, he acted according to our \nSunna (tradition), and whoever slaughtered (the sacrifice) before the prayer, what he offered was just \nmeat he presented to his family, and that will not be considered as Nusak (sacrifice).\" (On hearing \nthat) Abu Burda bin Niyar got up, for he had slaughtered the sacrifice before the prayer, and said, \"I \nhave got a six month old ram.\" The Prophet (ﷺ) said, 'Slaughter it (as a sacrifice) but it will not be \nsufficient for any-one else (as a sacrifice after you). Al-Bara' added: The Prophet (ﷺ) said, \"Whoever \nslaughtered (the sacrifice) after the prayer, he slaughtered it at the right time and followed the tradition \nof the Muslims.\"","reference":"Sahih al-Bukhari 5545, Book 73, Hadith 1","grade":"","question #":"question #2","question":"How does the timing of the sacrifice affect its validity according to Islamic tradition?","id":"bukhari-73-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the prayer, he just slaughtered it for \nhimself, and whoever slaughtered it after the prayer, he slaughtered it at the right time and followed \nthe tradition of the Muslims.\"","reference":"Sahih al-Bukhari 5546, Book 73, Hadith 2","grade":"","question #":"question #2","question":"How does following the tradition of the Muslims relate to the act of sacrifice?","id":"bukhari-73-32"},{"hadith-eng":"that the Prophet (ﷺ) distributed among his companions some animals for sacrifice (to be slaughtered on \n`Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Messenger (ﷺ)! I get \nin my share of Jadha'a (a six month old ram).\" The Prophet (ﷺ) said, \"Slaughter it as a sacrifice.\"","reference":"Sahih al-Bukhari 5547, Book 73, Hadith 3","grade":"","question #":"question #2","question":"What is the ruling on sacrificing a six-month-old goat during `Id-al-Adha?","id":"bukhari-73-33"},{"hadith-eng":"that the Prophet (ﷺ) entered upon her when she had her menses at Sarif before entering Mecca, and she \nwas weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet (ﷺ) \nsaid, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a \nmatter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the \nothers, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef \nwas brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Messenger (ﷺ) has \nslaughtered some cows as sacrifices on behalf of his wives.\"","reference":"Sahih al-Bukhari 5548, Book 73, Hadith 4","grade":"","question #":"question #2","question":"How does the hadith address the emotional concerns of women regarding religious duties during menstruation?","id":"bukhari-73-34"},{"hadith-eng":"The Prophet (ﷺ) said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should \nrepeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Messenger (ﷺ)! This is a day on \nwhich meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is \nto me better than the meat of two sheep.\" The Prophet (ﷺ) allowed him to slaughter it as a sacrifice, but I \ndo not know whether this permission was valid for other than that man or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and then the people went towards some sheep and distributed \nthem among themselves.","reference":"Sahih al-Bukhari 5549, Book 73, Hadith 5","grade":"","question #":"question #2","question":"How does the Prophet's response to the man with the six-month-old ram illustrate flexibility in religious rulings?","id":"bukhari-73-35"},{"hadith-eng":"The Prophet (ﷺ) said, \"Time has come back to its original state which it had on the day Allah created the \nHeavens and the Earth. The year is twelve months, four of which are sacred, three of them are in \nsuccession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is \nbetween Juma'da (ath-thamj and Sha'ban. The Prophet (ﷺ) then asked, \"Which month is this?\" We said, \n\"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a \nname other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \n\"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we \nthought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of \nMecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know \nbetter.\" He kept silent so long that we thought that he would call it by a name other than its real name. \nHe said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor \nare as sacred to one another as this day of yours in this town of yours in this month of yours. You will \nmeet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting \nthe necks of each other. It is incumbent upon those who are present to convey this message to those \nwho are absent, for some of those to whom it is conveyed may comprehend it better than some of \nthose who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The \nProphet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered \nAllah's message (to you)?\"","reference":"Sahih al-Bukhari 5550, Book 73, Hadith 6","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) emphasize the sanctity of life, property, and honor among Muslims?","id":"bukhari-73-36"},{"hadith-eng":"'Abdullah (bin 'Umar) used to slaughter his sacrifice at the \n     slaughtering place (i.e the slaughtering place of the Prophet (ﷺ) ) .","reference":"Sahih al-Bukhari 5551, Book 73, Hadith 7","grade":"","question #":"question #2","question":"How did 'Abdullah bin 'Umar demonstrate adherence to the traditions of the Prophet (ﷺ) in his actions?","id":"bukhari-73-37"},{"hadith-eng":"Ibn 'Umar said,\"Allah's Messenger (ﷺ) used to slaughter (camels and sheep, etc.,) as sacrifices at the Musalla.\"","reference":"Sahih al-Bukhari 5552, Book 73, Hadith 8","grade":"","question #":"question #2","question":"Where did the Prophet Muhammad (ﷺ) perform the act of sacrificing animals?","id":"bukhari-73-38"},{"hadith-eng":"The Prophet (ﷺ) used to offer two rams as sacrifices, and I also used to offer two rams.","reference":"Sahih al-Bukhari 5553, Book 73, Hadith 9","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) practice the act of sacrifice?","id":"bukhari-73-39"},{"hadith-eng":"Allah's Messenger (ﷺ) came towards two horned rams having black and white colors and slaughtered them \nwith his own hands.","reference":"Sahih al-Bukhari 5554, Book 73, Hadith 10","grade":"","question #":"question #2","question":"What can be inferred about the practice of animal sacrifice in Islam from this narration?","id":"bukhari-73-40"},{"hadith-eng":"that the Prophet (ﷺ) gave him some sheep to distribute among his companions to slaughter as sacrifices \n(`Id--al--Adha). A kid goat was left and he told the Prophet (ﷺ) of that whereupon he said to him, \"Slaughter it \nas a sacrifice (on your behalf).","reference":"Sahih al-Bukhari 5555, Book 73, Hadith 11","grade":"","question #":"question #2","question":"How should one handle leftover sacrificial animals according to Islamic teachings?","id":"bukhari-73-41"},{"hadith-eng":"An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Messenger (ﷺ) \nsaid to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's \nApostle! I have got a domestic kid goat.\" The Prophet (ﷺ) said, \"Slaughter it (as a sacrifice) but it will not be \npermissible for anybody other than you\" The Prophet (ﷺ) added, \"Whoever slaughtered his sacrifice \nbefore the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, \nhe offered his sacrifice properly and followed the tradition of the Muslims.\"","reference":"Sahih al-Bukhari 5556, Book 73, Hadith 12","grade":"","question #":"question #2","question":"Why was Abu Burda's initial sacrifice not considered valid according to the Prophet Muhammad (ﷺ)?","id":"bukhari-73-42"},{"hadith-eng":"Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet (ﷺ) said to him, \n\"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" \n(Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) \nThe Prophet (ﷺ) said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient \nfor anyone else after you.\"","reference":"Sahih al-Bukhari 5557, Book 73, Hadith 13","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address mistakes made in religious rituals?","id":"bukhari-73-43"},{"hadith-eng":"The Prophet (ﷺ) slaughtered two rams, black and white in color (as sacrifices), and I saw him putting his \nfoot on their sides and mentioning Allah's Name and Takbir (Allahu Akbar). Then he slaughtered \nthem with his own hands.","reference":"Sahih al-Bukhari 5558, Book 73, Hadith 14","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform the act of slaughtering sacrificial animals?","id":"bukhari-73-44"},{"hadith-eng":"Allah's Messenger (ﷺ) entered upon me at Sarif while I was weeping (because I was afraid that I would not \nbe able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I \nreplied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform \nthe ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" \nAllah's Messenger (ﷺ) slaughtered some cows as sacrifices on behalf of his wives.","reference":"Sahih al-Bukhari 5559, Book 73, Hadith 15","grade":"","question #":"question #2","question":"How does the hadith address the natural occurrences in women's lives and their impact on religious duties?","id":"bukhari-73-45"},{"hadith-eng":"I heard the Prophet (ﷺ) delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we \nwill do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our \nsacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered \nhis sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that \nwas not a sacrifice.\" Abu Burda got up and said, \"O Allah's Messenger (ﷺ)! I slaughtered the sacrifice before \nthe prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet (ﷺ) said, \"Slaughter it \nto make up for that, but it will not be sufficient for anybody else after you.\"","reference":"Sahih al-Bukhari 5560, Book 73, Hadith 16","grade":"","question #":"question #2","question":"How does the timing of the sacrifice affect its validity according to Islamic tradition?","id":"bukhari-73-46"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter \nanother one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of \nhis neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a \nwhich is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I \ndo not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and the people went towards their sheep and slaughtered \nthem.","reference":"Sahih al-Bukhari 5561, Book 73, Hadith 17","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate flexibility and understanding in addressing the needs of his community?","id":"bukhari-73-47"},{"hadith-eng":"I witnessed the Prophet (ﷺ) on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before \noffering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered \ntheir sacrifice yet, should slaughter now.\"","reference":"Sahih al-Bukhari 5562, Book 73, Hadith 18","grade":"","question #":"question #2","question":"What should a person do if they have slaughtered their sacrifice before the `Id prayer?","id":"bukhari-73-48"},{"hadith-eng":"One day Allah's Messenger (ﷺ) offered the `Id prayer and said, \"Whoever offers our prayer and faces our \nQibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar got up \nand said, \"O Allah's Messenger (ﷺ)! I have already done it. The Prophet (ﷺ) said, \"That is something you have \ndone before its due time.\" Abu Burda said, \"I have a Jadha'a which is better than two old sheep; shall I \nslaughter it?\" The Prophet (ﷺ) said, \"Yes, but it will not be sufficient for anyone after you.\"","reference":"Sahih al-Bukhari 5563, Book 73, Hadith 19","grade":"","question #":"question #2","question":"How does the timing of a religious act affect its validity in Islamic practice?","id":"bukhari-73-49"},{"hadith-eng":"The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his \nfoot on their sides and slaughter them with his own hands.","reference":"Sahih al-Bukhari 5564, Book 73, Hadith 20","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) perform the act of sacrifice during Eid?","id":"bukhari-73-50"},{"hadith-eng":"The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them \nwith his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their \nsides.","reference":"Sahih al-Bukhari 5565, Book 73, Hadith 21","grade":"","question #":"question #2","question":"What are the recommended practices and phrases to be recited during the act of animal sacrifice in Islam?","id":"bukhari-73-51"},{"hadith-eng":"that he came to `Aisha and said to her, \"O Mother of the Believers! There is a man who sends a Hadi \nto Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state \nof Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" \n(What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She \nsaid, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to \nKa`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the \npeople returned (from the Hajj).","reference":"Sahih al-Bukhari 5566, Book 73, Hadith 22","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) approach the state of Ihram when sending a Hadi?","id":"bukhari-73-52"},{"hadith-eng":"During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to \nMedina. (The narrator often said. The meat of the Hadi).","reference":"Sahih al-Bukhari 5567, Book 73, Hadith 23","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) handle the meat of sacrifices when traveling to Medina?","id":"bukhari-73-53"},{"hadith-eng":"that once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented \nto him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall \nnot taste it. (In his narration) Abu Sa`id added: I got up and went to my brother, Abu Qatada (who was \nhis maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He \nSa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and \neaten later on).","reference":"Sahih al-Bukhari 5568, Book 73, Hadith 24","grade":"","question #":"question #2","question":"How did the verdict regarding the consumption of sacrificial meat change over time?","id":"bukhari-73-54"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after \nthree days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last \nyear?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having \na hard time and I wanted you to help (the needy).","reference":"Sahih al-Bukhari 5569, Book 73, Hadith 25","grade":"","question #":"question #2","question":"How does the practice of storing and sharing sacrificial meat reflect on community support and charity?","id":"bukhari-73-55"},{"hadith-eng":"We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \n\"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he \nwanted us to feed of it to others, Allah knows better.","reference":"Sahih al-Bukhari 5570, Book 73, Hadith 26","grade":"","question #":"question #2","question":"Why might there be a restriction on consuming sacrificial meat for more than three days?","id":"bukhari-73-56"},{"hadith-eng":"the freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab. \n`Umar offered the `Id prayer before the sermon and then delivered the sermon before the people, \nsaying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two \n'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the \nmeat of your sacrifices.\"","reference":"Sahih al-Bukhari 5571, Book 73, Hadith 27","grade":"","question #":"question #2","question":"Why is fasting forbidden on the day of Eid al-Adha?","id":"bukhari-73-57"},{"hadith-eng":"(in continuation of above). Then I witnessed the `Id with `Uthman bin `Affan, and that was on a Friday. \nHe offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) \ntogether, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua \nprayer, he may wait, and whoever would like to return (home) Is granted my permission to do so.\"","reference":"Sahih al-Bukhari 5572, Book 73, Hadith 28","grade":"","question #":"question #2","question":"What options are available for people living in the suburbs regarding attending the Friday prayer when it coincides with Eid?","id":"bukhari-73-58"},{"hadith-eng":"(in continuation of above). Then I witnessed (the 'Its) with `Ali bin Abi Talib, and he too offered the `Id prayer before the sermon \nand then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat \nthe meat of your sacrifices for more than three days.\"","reference":"Sahih al-Bukhari 5573, Book 73, Hadith 29","grade":"","question #":"question #2","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the consumption of sacrificial meat during Eid?","id":"bukhari-73-59"},{"hadith-eng":"`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for \nthree days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of \nthe meat of Hadi (which is regarded as unlawful after the three days of the `Id).","reference":"Sahih al-Bukhari 5574, Book 73, Hadith 30","grade":"","question #":"question #2","question":"Why did `Abdullah bin `Umar avoid eating the meat of Hadi after three days of `Id al Adha?","id":"bukhari-73-60"},{"hadith-eng":"The Prophet (ﷺ) said (on the day of Idal-Adha), \"The first thing we will do on this day of ours, is to offer \nthe (`Id) prayer and then return to slaughter the sacrifice. Whoever does so, he acted according to our \nSunna (tradition), and whoever slaughtered (the sacrifice) before the prayer, what he offered was just \nmeat he presented to his family, and that will not be considered as Nusak (sacrifice).\" (On hearing \nthat) Abu Burda bin Niyar got up, for he had slaughtered the sacrifice before the prayer, and said, \"I \nhave got a six month old ram.\" The Prophet (ﷺ) said, 'Slaughter it (as a sacrifice) but it will not be \nsufficient for any-one else (as a sacrifice after you). Al-Bara' added: The Prophet (ﷺ) said, \"Whoever \nslaughtered (the sacrifice) after the prayer, he slaughtered it at the right time and followed the tradition \nof the Muslims.\"","reference":"Sahih al-Bukhari 5545, Book 73, Hadith 1","grade":"","question #":"question #3","question":"What are the consequences of slaughtering the sacrifice before the Eid prayer?","id":"bukhari-73-61"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the prayer, he just slaughtered it for \nhimself, and whoever slaughtered it after the prayer, he slaughtered it at the right time and followed \nthe tradition of the Muslims.\"","reference":"Sahih al-Bukhari 5546, Book 73, Hadith 2","grade":"","question #":"question #3","question":"What are the consequences of performing a religious act at the incorrect time?","id":"bukhari-73-62"},{"hadith-eng":"that the Prophet (ﷺ) distributed among his companions some animals for sacrifice (to be slaughtered on \n`Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Messenger (ﷺ)! I get \nin my share of Jadha'a (a six month old ram).\" The Prophet (ﷺ) said, \"Slaughter it as a sacrifice.\"","reference":"Sahih al-Bukhari 5547, Book 73, Hadith 3","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) address concerns regarding the suitability of sacrificial animals?","id":"bukhari-73-63"},{"hadith-eng":"that the Prophet (ﷺ) entered upon her when she had her menses at Sarif before entering Mecca, and she \nwas weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet (ﷺ) \nsaid, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a \nmatter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the \nothers, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef \nwas brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Messenger (ﷺ) has \nslaughtered some cows as sacrifices on behalf of his wives.\"","reference":"Sahih al-Bukhari 5548, Book 73, Hadith 4","grade":"","question #":"question #3","question":"What specific Hajj rituals are women exempt from during their menstrual period according to Islamic teachings?","id":"bukhari-73-64"},{"hadith-eng":"The Prophet (ﷺ) said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should \nrepeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Messenger (ﷺ)! This is a day on \nwhich meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is \nto me better than the meat of two sheep.\" The Prophet (ﷺ) allowed him to slaughter it as a sacrifice, but I \ndo not know whether this permission was valid for other than that man or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and then the people went towards some sheep and distributed \nthem among themselves.","reference":"Sahih al-Bukhari 5549, Book 73, Hadith 5","grade":"","question #":"question #3","question":"What can be learned about the distribution of meat during the sacrifice from this event?","id":"bukhari-73-65"},{"hadith-eng":"The Prophet (ﷺ) said, \"Time has come back to its original state which it had on the day Allah created the \nHeavens and the Earth. The year is twelve months, four of which are sacred, three of them are in \nsuccession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is \nbetween Juma'da (ath-thamj and Sha'ban. The Prophet (ﷺ) then asked, \"Which month is this?\" We said, \n\"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a \nname other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \n\"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we \nthought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of \nMecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know \nbetter.\" He kept silent so long that we thought that he would call it by a name other than its real name. \nHe said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor \nare as sacred to one another as this day of yours in this town of yours in this month of yours. You will \nmeet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting \nthe necks of each other. It is incumbent upon those who are present to convey this message to those \nwho are absent, for some of those to whom it is conveyed may comprehend it better than some of \nthose who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The \nProphet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered \nAllah's message (to you)?\"","reference":"Sahih al-Bukhari 5550, Book 73, Hadith 6","grade":"","question #":"question #3","question":"What responsibility do Muslims have in conveying the message of Islam to others according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-73-66"},{"hadith-eng":"'Abdullah (bin 'Umar) used to slaughter his sacrifice at the \n     slaughtering place (i.e the slaughtering place of the Prophet (ﷺ) ) .","reference":"Sahih al-Bukhari 5551, Book 73, Hadith 7","grade":"","question #":"question #3","question":"What can be learned from the actions of the companions of the Prophet (ﷺ) regarding the performance of religious duties?","id":"bukhari-73-67"},{"hadith-eng":"Ibn 'Umar said,\"Allah's Messenger (ﷺ) used to slaughter (camels and sheep, etc.,) as sacrifices at the Musalla.\"","reference":"Sahih al-Bukhari 5552, Book 73, Hadith 8","grade":"","question #":"question #3","question":"What types of animals are mentioned as being sacrificed in Islamic traditions?","id":"bukhari-73-68"},{"hadith-eng":"The Prophet (ﷺ) used to offer two rams as sacrifices, and I also used to offer two rams.","reference":"Sahih al-Bukhari 5553, Book 73, Hadith 9","grade":"","question #":"question #3","question":"What can be learned from the practice of offering two rams as sacrifices?","id":"bukhari-73-69"},{"hadith-eng":"Allah's Messenger (ﷺ) came towards two horned rams having black and white colors and slaughtered them \nwith his own hands.","reference":"Sahih al-Bukhari 5554, Book 73, Hadith 10","grade":"","question #":"question #3","question":"How does the description of the rams' colors relate to the traditions of sacrifice in Islamic teachings?","id":"bukhari-73-70"},{"hadith-eng":"that the Prophet (ﷺ) gave him some sheep to distribute among his companions to slaughter as sacrifices \n(`Id--al--Adha). A kid goat was left and he told the Prophet (ﷺ) of that whereupon he said to him, \"Slaughter it \nas a sacrifice (on your behalf).","reference":"Sahih al-Bukhari 5555, Book 73, Hadith 11","grade":"","question #":"question #3","question":"What is the ruling on offering a sacrifice on behalf of oneself in Islam?","id":"bukhari-73-71"},{"hadith-eng":"An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Messenger (ﷺ) \nsaid to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's \nApostle! I have got a domestic kid goat.\" The Prophet (ﷺ) said, \"Slaughter it (as a sacrifice) but it will not be \npermissible for anybody other than you\" The Prophet (ﷺ) added, \"Whoever slaughtered his sacrifice \nbefore the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, \nhe offered his sacrifice properly and followed the tradition of the Muslims.\"","reference":"Sahih al-Bukhari 5556, Book 73, Hadith 12","grade":"","question #":"question #3","question":"What exception did the Prophet Muhammad (ﷺ) make for Abu Burda regarding the sacrifice, and why was it unique to him?","id":"bukhari-73-72"},{"hadith-eng":"Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet (ﷺ) said to him, \n\"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" \n(Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) \nThe Prophet (ﷺ) said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient \nfor anyone else after you.\"","reference":"Sahih al-Bukhari 5557, Book 73, Hadith 13","grade":"","question #":"question #3","question":"What exceptions did the Prophet Muhammad (ﷺ) make regarding the type of animal used for sacrifice?","id":"bukhari-73-73"},{"hadith-eng":"The Prophet (ﷺ) slaughtered two rams, black and white in color (as sacrifices), and I saw him putting his \nfoot on their sides and mentioning Allah's Name and Takbir (Allahu Akbar). Then he slaughtered \nthem with his own hands.","reference":"Sahih al-Bukhari 5558, Book 73, Hadith 14","grade":"","question #":"question #3","question":"What are the characteristics of the animals chosen by the Prophet (ﷺ) for sacrifice?","id":"bukhari-73-74"},{"hadith-eng":"Allah's Messenger (ﷺ) entered upon me at Sarif while I was weeping (because I was afraid that I would not \nbe able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I \nreplied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform \nthe ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" \nAllah's Messenger (ﷺ) slaughtered some cows as sacrifices on behalf of his wives.","reference":"Sahih al-Bukhari 5559, Book 73, Hadith 15","grade":"","question #":"question #3","question":"What actions did the Prophet Muhammad (ﷺ) take on behalf of his wives during the Hajj pilgrimage?","id":"bukhari-73-75"},{"hadith-eng":"I heard the Prophet (ﷺ) delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we \nwill do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our \nsacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered \nhis sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that \nwas not a sacrifice.\" Abu Burda got up and said, \"O Allah's Messenger (ﷺ)! I slaughtered the sacrifice before \nthe prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet (ﷺ) said, \"Slaughter it \nto make up for that, but it will not be sufficient for anybody else after you.\"","reference":"Sahih al-Bukhari 5560, Book 73, Hadith 16","grade":"","question #":"question #3","question":"What exception did the Prophet (ﷺ) make for Abu Burda regarding the sacrifice, and what does it imply?","id":"bukhari-73-76"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter \nanother one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of \nhis neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a \nwhich is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I \ndo not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and the people went towards their sheep and slaughtered \nthem.","reference":"Sahih al-Bukhari 5561, Book 73, Hadith 17","grade":"","question #":"question #3","question":"What considerations might be taken into account when determining the suitability of an animal for sacrifice?","id":"bukhari-73-77"},{"hadith-eng":"I witnessed the Prophet (ﷺ) on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before \noffering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered \ntheir sacrifice yet, should slaughter now.\"","reference":"Sahih al-Bukhari 5562, Book 73, Hadith 18","grade":"","question #":"question #3","question":"What instructions are given to those who have not yet slaughtered their sacrifice on the Day of Nahr?","id":"bukhari-73-78"},{"hadith-eng":"One day Allah's Messenger (ﷺ) offered the `Id prayer and said, \"Whoever offers our prayer and faces our \nQibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar got up \nand said, \"O Allah's Messenger (ﷺ)! I have already done it. The Prophet (ﷺ) said, \"That is something you have \ndone before its due time.\" Abu Burda said, \"I have a Jadha'a which is better than two old sheep; shall I \nslaughter it?\" The Prophet (ﷺ) said, \"Yes, but it will not be sufficient for anyone after you.\"","reference":"Sahih al-Bukhari 5563, Book 73, Hadith 19","grade":"","question #":"question #3","question":"What exceptions, if any, are mentioned regarding the rules of sacrifice during 'Id?","id":"bukhari-73-79"},{"hadith-eng":"The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his \nfoot on their sides and slaughter them with his own hands.","reference":"Sahih al-Bukhari 5564, Book 73, Hadith 20","grade":"","question #":"question #3","question":"What is the significance of the Prophet (ﷺ) personally conducting the sacrifice?","id":"bukhari-73-80"},{"hadith-eng":"The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them \nwith his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their \nsides.","reference":"Sahih al-Bukhari 5565, Book 73, Hadith 21","grade":"","question #":"question #3","question":"How does the act of sacrifice reflect the principles of devotion and submission in Islamic teachings?","id":"bukhari-73-81"},{"hadith-eng":"that he came to `Aisha and said to her, \"O Mother of the Believers! There is a man who sends a Hadi \nto Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state \nof Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" \n(What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She \nsaid, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to \nKa`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the \npeople returned (from the Hajj).","reference":"Sahih al-Bukhari 5566, Book 73, Hadith 22","grade":"","question #":"question #3","question":"What can be inferred about the lawful actions for men during Hajj from Aisha's response?","id":"bukhari-73-82"},{"hadith-eng":"During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to \nMedina. (The narrator often said. The meat of the Hadi).","reference":"Sahih al-Bukhari 5567, Book 73, Hadith 23","grade":"","question #":"question #3","question":"What does this narration indicate about the preservation and transportation of sacrificial meat in early Islamic practices?","id":"bukhari-73-83"},{"hadith-eng":"that once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented \nto him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall \nnot taste it. (In his narration) Abu Sa`id added: I got up and went to my brother, Abu Qatada (who was \nhis maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He \nSa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and \neaten later on).","reference":"Sahih al-Bukhari 5568, Book 73, Hadith 24","grade":"","question #":"question #3","question":"What role did Abu Qatada play in informing Abu Sa`id Al-Khudri about the new verdict on sacrificial meat?","id":"bukhari-73-84"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after \nthree days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last \nyear?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having \na hard time and I wanted you to help (the needy).","reference":"Sahih al-Bukhari 5569, Book 73, Hadith 25","grade":"","question #":"question #3","question":"What considerations should be made when deciding how long to keep sacrificial meat?","id":"bukhari-73-85"},{"hadith-eng":"We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \n\"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he \nwanted us to feed of it to others, Allah knows better.","reference":"Sahih al-Bukhari 5570, Book 73, Hadith 26","grade":"","question #":"question #3","question":"How does the practice of sharing sacrificial meat reflect the values of charity and community in Islam?","id":"bukhari-73-86"},{"hadith-eng":"the freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab. \n`Umar offered the `Id prayer before the sermon and then delivered the sermon before the people, \nsaying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two \n'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the \nmeat of your sacrifices.\"","reference":"Sahih al-Bukhari 5571, Book 73, Hadith 27","grade":"","question #":"question #3","question":"What is the significance of eating the meat of sacrifices on Eid al-Adha?","id":"bukhari-73-87"},{"hadith-eng":"(in continuation of above). Then I witnessed the `Id with `Uthman bin `Affan, and that was on a Friday. \nHe offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) \ntogether, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua \nprayer, he may wait, and whoever would like to return (home) Is granted my permission to do so.\"","reference":"Sahih al-Bukhari 5572, Book 73, Hadith 28","grade":"","question #":"question #3","question":"How did Uthman bin Affan address the congregation when Eid and Friday prayer coincided?","id":"bukhari-73-88"},{"hadith-eng":"(in continuation of above). Then I witnessed (the 'Its) with `Ali bin Abi Talib, and he too offered the `Id prayer before the sermon \nand then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat \nthe meat of your sacrifices for more than three days.\"","reference":"Sahih al-Bukhari 5573, Book 73, Hadith 29","grade":"","question #":"question #3","question":"How did Ali bin Abi Talib implement the teachings of the Prophet Muhammad (ﷺ) during the Eid prayer?","id":"bukhari-73-89"},{"hadith-eng":"`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for \nthree days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of \nthe meat of Hadi (which is regarded as unlawful after the three days of the `Id).","reference":"Sahih al-Bukhari 5574, Book 73, Hadith 30","grade":"","question #":"question #3","question":"What are the guidelines for consuming sacrificial meat during the days of `Id al Adha according to Islamic teachings?","id":"bukhari-73-90"}]