[{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever drinks alcoholic drinks in the world and does not repent (before \ndying), will be deprived of it in the Hereafter.\"","reference":"Sahih al-Bukhari 5575, Book 74, Hadith 1","grade":"","question #":"question #1","question":"What are the consequences in the Hereafter for consuming alcoholic drinks without repentance?","id":"bukhari-74-1"},{"hadith-eng":"On the night Allah's Messenger (ﷺ) was taken on a night journey (Miraj) two cups, one containing wine and \nthe other milk, were presented to him at Jerusalem. He looked at it and took the cup of milk. Gabriel \nsaid, \"Praise be to Allah Who guided you to Al-Fitra (the right path); if you had taken (the cup of) \nwine, your nation would have gone astray.\"","reference":"Sahih al-Bukhari 5576, Book 74, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of choosing milk over wine in the context of guidance and the right path?","id":"bukhari-74-2"},{"hadith-eng":"I heard from Allah's Messenger (ﷺ) a narration which none other than I will narrate to you. The Prophet, said, \n\"From among the portents of the our are the following: General ignorance (in religious affairs) will \nprevail, (religious) knowledge will decrease, illegal sexual intercourse will prevail, alcoholic drinks \nwill be drunk (in abundance), men will decrease and women will increase so much so that for every \nfifty women there will be one man to look after them.\"","reference":"Sahih al-Bukhari 5577, Book 74, Hadith 3","grade":"","question #":"question #1","question":"What are some of the signs of the approaching Hour as mentioned in Islamic teachings?","id":"bukhari-74-3"},{"hadith-eng":"The Prophet (ﷺ) said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a \nbeliever; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the \ntime of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman \nbin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority \nof Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who \nrobs (takes illegally something by force) while the people are looking at him, is not a believer at the \ntime he is robbing (taking).","reference":"Sahih al-Bukhari 5578, Book 74, Hadith 4","grade":"","question #":"question #1","question":"What is the relationship between committing major sins and one's state of faith in Islam?","id":"bukhari-74-4"},{"hadith-eng":"\"Alcoholic drinks were prohibited (by Allah) when there was nothing of it (special kind of wine) in \nMedina.","reference":"Sahih al-Bukhari 5579, Book 74, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of the prohibition of alcoholic drinks in Islam?","id":"bukhari-74-5"},{"hadith-eng":"\"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, \nfor most of our liquors were made from unripe and ripe dates.","reference":"Sahih al-Bukhari 5580, Book 74, Hadith 6","grade":"","question #":"question #1","question":"What was the common source of alcoholic drinks in Medina during the time of prohibition?","id":"bukhari-74-6"},{"hadith-eng":"`Umar stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, \nand these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an \nalcoholic drink is that, that disturbs the mind.","reference":"Sahih al-Bukhari 5581, Book 74, Hadith 7","grade":"","question #":"question #1","question":"What are the sources from which alcoholic drinks can be prepared according to Islamic teachings?","id":"bukhari-74-7"},{"hadith-eng":"I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b with a drink prepared from ripe and unripe \ndates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing \nthat) Abu Talha said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.","reference":"Sahih al-Bukhari 5582, Book 74, Hadith 8","grade":"","question #":"question #1","question":"How did the companions of the Prophet react to the prohibition of alcoholic drinks?","id":"bukhari-74-8"},{"hadith-eng":"While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the \nyoungest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \n\"Throw it away.\" So I threw it away.","reference":"Sahih al-Bukhari 5583, Book 74, Hadith 9","grade":"","question #":"question #1","question":"What was the reaction of the companions when they learned about the prohibition of alcoholic drinks?","id":"bukhari-74-9"},{"hadith-eng":"Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe \ndates.","reference":"Sahih al-Bukhari 5584, Book 74, Hadith 10","grade":"","question #":"question #1","question":"What was the source of alcoholic drinks before they were prohibited in Islam?","id":"bukhari-74-10"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about Al-Bit. He said, \"All drinks that intoxicate are unlawful (to drink.)","reference":"Sahih al-Bukhari 5585, Book 74, Hadith 11","grade":"","question #":"question #1","question":"What is the Islamic ruling on consuming intoxicating drinks?","id":"bukhari-74-11"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about Al-Bit a liquor prepared from honey \n     which the Yemenites used to drink. Allah's Messenger (ﷺ) said, \"All drinks \n     that intoxicate are unlawful (to drink).\"","reference":"Sahih al-Bukhari 5586, Book 74, Hadith 12","grade":"","question #":"question #1","question":"What is the Islamic ruling on consuming intoxicating substances?","id":"bukhari-74-12"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Do not make drinks in Ad-Dubba' nor in \n     Al-Muzaffat.  Abu Huraira used to add to them Al-Hantam and An-Naqir.","reference":"Sahih al-Bukhari 5587, Book 74, Hadith 13","grade":"","question #":"question #1","question":"What are the specific containers mentioned that should not be used for making drinks?","id":"bukhari-74-13"},{"hadith-eng":"`Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ), saying, \"Alcoholic drinks were prohibited \nby Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, \nbarley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's \nApostle had not left us before he had given us definite verdicts concerning three matters, i.e., how \nmuch a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person \namong whose heirs there is no father or son), and various types of Riba(1 ) (usury) .\"","reference":"Sahih al-Bukhari 5588, Book 74, Hadith 14","grade":"","question #":"question #1","question":"What are the sources from which alcoholic drinks were traditionally prepared according to Islamic teachings?","id":"bukhari-74-14"},{"hadith-eng":"\"Alcoholic drinks are prepared from five things, i.e., raisins, dates.\n     wheat, barley and honey.\"","reference":"Sahih al-Bukhari 5589, Book 74, Hadith 15","grade":"","question #":"question #1","question":"What are the sources from which alcoholic drinks can be prepared according to Islamic teachings?","id":"bukhari-74-15"},{"hadith-eng":"that he heard the Prophet (ﷺ) saying, \"From among my followers there will \n     be some people who will consider illegal sexual intercourse, the \n     wearing of silk, the drinking of alcoholic drinks and the use of \n     musical instruments, as lawful. And there will be some people who will\n     stay near the side of a mountain and in the evening their shepherd \n     will come to them with their sheep and ask them for something, but \n     they will say to him, 'Return to us tomorrow.' Allah will destroy them\n     during the night and will let the mountain fall on them, and He will \n     transform the rest of them into monkeys and pigs and they will remain \n     so till the Day of Resurrection.\"","reference":"Sahih al-Bukhari 5590, Book 74, Hadith 16","grade":"","question #":"question #1","question":"What are the consequences mentioned for those who consider certain prohibited actions as lawful?","id":"bukhari-74-16"},{"hadith-eng":"Abu Usaid As-Sa`idi came and invited Allah's Messenger (ﷺ) on the occasion of his wedding. His wife who \nwas the bride, was serving them. Do you know what drink she prepared for Allah's Messenger (ﷺ) ? She had \nsoaked some dates in water in a Tur overnight.","reference":"Sahih al-Bukhari 5591, Book 74, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of hospitality in Islamic tradition as demonstrated in this event?","id":"bukhari-74-17"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the use of (certain) containers, but the Ansar said, \"We cannot dispense with \nthem.\" The Prophet (ﷺ) then said, \"If so, then use them.\"","reference":"Sahih al-Bukhari 5592, Book 74, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of flexibility and understanding in Islamic rulings when faced with practical difficulties?","id":"bukhari-74-18"},{"hadith-eng":"When the Prophet (ﷺ) forbade the use of certain containers (that were used for preparing alcoholic drinks), \nsomebody said to the Prophet (ﷺ) . \"But not all the people can find skins.\" So he allowed them to use clay \njars not covered with pitch.","reference":"Sahih al-Bukhari 5593, Book 74, Hadith 19","grade":"","question #":"question #1","question":"What considerations did the Prophet (ﷺ) take into account when prohibiting certain containers for use?","id":"bukhari-74-19"},{"hadith-eng":"the Prophet (ﷺ) forbade the use of Ad-Dubba' and Al Muzaffat.A'mash also narrated this.","reference":"Sahih al-Bukhari 5594, Book 74, Hadith 20","grade":"","question #":"question #1","question":"What are Ad-Dubba' and Al Muzaffat, and why were they forbidden by the Prophet (ﷺ)?","id":"bukhari-74-20"},{"hadith-eng":"I asked Al-Aswad, \"Did you ask `Aisha, Mother of the Believers, about the containers in which it is \ndisliked to prepare (non-alcoholic) drinks?\" He said, \"Yes, I said to her, 'O Mother of the Believers! \nWhat containers did the Prophet (ﷺ) forbid to use for preparing (non-alcoholic) drinks?\" She said, 'The \nProphet forbade us, (his family), to prepare (nonalcoholic) drinks in Ad-Dubba and Al-Muzaffat.' I \nasked, 'Didn't you mention Al Jar and Al Hantam?' She said, 'I tell what I have heard; shall I tell you \nwhat I have not heard?' \"","reference":"Sahih al-Bukhari 5595, Book 74, Hadith 21","grade":"","question #":"question #1","question":"What types of containers were prohibited by the Prophet for preparing non-alcoholic drinks?","id":"bukhari-74-21"},{"hadith-eng":"I heard `Abdullah bin Abi `Aufa saying, \"The Prophet (ﷺ) forbade the use of green jars.\" I said, \"Shall we \ndrink out of white jars?\" He said, \"No.\"","reference":"Sahih al-Bukhari 5596, Book 74, Hadith 22","grade":"","question #":"question #1","question":"What is the significance of the Prophet's prohibition on using certain types of jars?","id":"bukhari-74-22"},{"hadith-eng":"Abu Usaid As Sa`idi invited the Prophet (ﷺ) to his wedding banquet. At that time his wife was serving \nthem and she was the bride. She said, ''Do you know what (kind of syrup) I soaked (made) for Allah's \nApostle? I soaked some dates in water in a Tur (bowl) overnight. '","reference":"Sahih al-Bukhari 5597, Book 74, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of inviting the Prophet Muhammad (ﷺ) to a wedding banquet in Islamic tradition?","id":"bukhari-74-23"},{"hadith-eng":"I asked Ibn `Abbas about Al-Badhaq. He said, \"Muhammad prohibited alcoholic drinks before It was \ncalled Al-Badhaq (by saying), 'Any drink that intoxicates is unlawful.' I said, 'What about good lawful \ndrinks?' He said,'Apart from what is lawful and good, all other things are unlawful and not good \n(unclean Al-Khabith).","reference":"Sahih al-Bukhari 5598, Book 74, Hadith 24","grade":"","question #":"question #1","question":"What is the Islamic ruling on consuming intoxicating substances?","id":"bukhari-74-24"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things and honey.","reference":"Sahih al-Bukhari 5599, Book 74, Hadith 25","grade":"","question #":"question #1","question":"What were some of the Prophet Muhammad's (ﷺ) preferences in food?","id":"bukhari-74-25"},{"hadith-eng":"While I was serving Abu Talha. Abu Dujana and Abu Suhail bin Al-Baida' with a drink made from a \nmixture of unripe and ripe dates, alcoholic drinks, were made unlawful, whereupon I threw it away, \nand I was their butler and the youngest of them, and we used to consider that drink as an alcoholic \ndrink in those days.","reference":"Sahih al-Bukhari 5600, Book 74, Hadith 26","grade":"","question #":"question #1","question":"What was the reaction of the companions when alcoholic drinks were made unlawful in Islam?","id":"bukhari-74-26"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of alcoholic drinks prepared from raisins, dates, unripe dates and \nfresh ripe dates.","reference":"Sahih al-Bukhari 5601, Book 74, Hadith 27","grade":"","question #":"question #1","question":"What types of substances are prohibited for consumption in Islam according to the teachings of the Prophet (ﷺ)?","id":"bukhari-74-27"},{"hadith-eng":"The Prophet (ﷺ) forbade the mixing of ripe and unripe dates and also the mixing of dates and raisins (for \npreparing a syrup) but the syrup of each kind of fruit should be prepared separately. ( One may have \nsuch drinks as long as it is fresh )","reference":"Sahih al-Bukhari 5602, Book 74, Hadith 28","grade":"","question #":"question #1","question":"What are the guidelines for mixing different types of fruits when preparing a syrup in Islamic teachings?","id":"bukhari-74-28"},{"hadith-eng":"Allah's Messenger (ﷺ) was presented a bowl of milk and a bowl of wine on the night he was taken on a \njourney (Al-Mi'raj).","reference":"Sahih al-Bukhari 5603, Book 74, Hadith 29","grade":"","question #":"question #1","question":"What significance does the choice between milk and wine hold in Islamic teachings?","id":"bukhari-74-29"},{"hadith-eng":"The people doubted whether Allah's Messenger (ﷺ) was fasting or the Day of `Arafat or not. So I sent a cup \ncontaining milk to him and he drank it.","reference":"Sahih al-Bukhari 5604, Book 74, Hadith 30","grade":"","question #":"question #1","question":"What can be inferred about the actions of the Prophet (ﷺ) regarding fasting on the Day of `Arafat?","id":"bukhari-74-30"},{"hadith-eng":"Abu Humaid brought a cup of mix from a place called Al-Naqi. Allah's Messenger (ﷺ) said to him, \"Will you \nnot cover it, even by placing a stick across its\"","reference":"Sahih al-Bukhari 5605, Book 74, Hadith 31","grade":"","question #":"question #1","question":"What is the significance of covering food and drink in Islamic teachings?","id":"bukhari-74-31"},{"hadith-eng":"Abu Humaid, an Ansari man, came from AnNaqi carrying a cup of milk to the Prophet. The Prophet (ﷺ) \nsaid, \"Will you not cover it even by placing a stick across it?\"","reference":"Sahih al-Bukhari 5606, Book 74, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of covering food and drink in Islamic teachings?","id":"bukhari-74-32"},{"hadith-eng":"The Prophet (ﷺ) came from Mecca with Abu Bakr. Abu Bakr said \"We passed by a shepherd and at that \ntime Allah's Messenger (ﷺ) was thirsty. I milked a little milk in a bowl and Allah's Messenger (ﷺ) drank till I was \npleased. Suraqa bin Ju'shum came to us riding a horse (chasing us). The Prophet (ﷺ) invoked evil upon \nhim, whereupon Suraqa requested him not to invoke evil upon him, in which case he would go back. \nThe Prophet (ﷺ) agreed.","reference":"Sahih al-Bukhari 5607, Book 74, Hadith 33","grade":"","question #":"question #1","question":"What can be learned about the Prophet's (ﷺ) interactions with others during times of need and pursuit?","id":"bukhari-74-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best object of charity is a she-camel which has (newly) given birth and \ngives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its \nmilk by milking one bowl in the morning and one in the evening.\"","reference":"Sahih al-Bukhari 5608, Book 74, Hadith 34","grade":"","question #":"question #1","question":"What is considered the best form of charity in terms of livestock according to Islamic teachings?","id":"bukhari-74-34"},{"hadith-eng":"Allah's Messenger (ﷺ) drank milk and then rinsed his mouth and said, \"It contains fat.\"","reference":"Sahih al-Bukhari 5609, Book 74, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of rinsing the mouth after consuming certain foods or drinks in Islam?","id":"bukhari-74-35"},{"hadith-eng":"I was raised to the Lote Tree and saw four rivers, two of which were coming out and two going in. \nThose which were coming out were the Nile and the Euphrates, and those which were going in were two rivers in paradise. Then I was given three bowls, one containing milk, and another containing honey, and a third containing wine. I took the bowl containing milk and drank it. It was said to me, \"You and your followers will be on the right path (of Islam).\"","reference":"Sahih al-Bukhari 5610, Book 74, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of the Lote Tree in Islamic tradition?","id":"bukhari-74-36"},{"hadith-eng":"Abu Talha had the largest number of datepalms from amongst the Ansars of Medina. The dearest of \nhis property to him was Bairuha garden which was facing the (Prophet's) Mosque. Allah's Messenger (ﷺ) \nused to enter it and drink of its good fresh water. When the Holy Verse:-- 'By no means shall you \nattain righteousness unless you spend (in charity) of that which you love.' (3.92) was revealed, Abu \nTalha got up and said, \"O Allah's Messenger (ﷺ)! Allah says: By no means shall you attain righteousness \nunless you spend of that which you love,' and the dearest of my property to me is the Bairuha garden \nand I want to give it in charity in Allah's Cause, seeking to be rewarded by Allah for that. So you can \nspend it, O Allah's Messenger (ﷺ), where-ever Allah instructs you. ' Allah s Apostle said, \"Good! That is a \nperishable (or profitable) wealth\" (`Abdullah is in doubt as to which word was used.) He said, \"I have \nheard what you have said but in my opinion you'd better give it to your kith and kin.\" On that Abu \nTalha said, \"I will do so, O Allah's Messenger (ﷺ)!\" Abu Talha distributed that garden among his kith and kin \nand cousins.","reference":"Sahih al-Bukhari 5611, Book 74, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of giving in charity from one's most cherished possessions in Islam?","id":"bukhari-74-37"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) drinking milk. He came to my house and I milked a sheep and then mixed the \nmilk with water from the well for Allah's Messenger (ﷺ). He took the bowl and drank while on his left there \nwas sitting Abu Bakr, and on his right there was a bedouin. He then gave the remaining milk to the \nbedouin and said, \"The right! The right (first).","reference":"Sahih al-Bukhari 5612, Book 74, Hadith 38","grade":"","question #":"question #1","question":"What is the significance of giving preference to the person on the right in Islamic etiquette?","id":"bukhari-74-38"},{"hadith-eng":"Allah's Messenger (ﷺ) and one of his companions entered upon an Ansari man and the Prophet (ﷺ) said to him, \n\"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting \nour mouth in it.\" The man was watering his garden then. He said, \"O Allah's Messenger (ﷺ)! I have water \nkept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and \nmilked a domestic goat of his in it. Allah's Messenger (ﷺ) drank, and then the man who had come along with \nhim, drank.","reference":"Sahih al-Bukhari 5613, Book 74, Hadith 39","grade":"","question #":"question #1","question":"What is the significance of hospitality in Islamic teachings as demonstrated by the actions of the Ansari man?","id":"bukhari-74-39"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things (syrup, etc.) and honey.","reference":"Sahih al-Bukhari 5614, Book 74, Hadith 40","grade":"","question #":"question #1","question":"What were some of the food preferences of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-40"},{"hadith-eng":"Ali came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and \r\nsaid, \"Some people dislike to drink while standing, but I saw the Prophet (ﷺ) doing (drinking water) as \r\nyou have seen me doing now.\"","reference":"Sahih al-Bukhari 5615, Book 74, Hadith 41","grade":"","question #":"question #1","question":"What is the significance of following the actions of the Prophet Muhammad (ﷺ) in daily practices?","id":"bukhari-74-41"},{"hadith-eng":"`Ali offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order \nto deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him \nand he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining \nwater while he was standing. and said, \"Some people dislike to drink water while standing thought the \nProphet did as I have just done.\"","reference":"Sahih al-Bukhari 5616, Book 74, Hadith 42","grade":"","question #":"question #1","question":"What actions did Ali perform before and after the Zuhr prayer in the courtyard of the Mosque of Kufa?","id":"bukhari-74-42"},{"hadith-eng":"The Prophet (ﷺ) drank Zamzam (water) while standing.","reference":"Sahih al-Bukhari 5617, Book 74, Hadith 43","grade":"","question #":"question #1","question":"What is the significance of drinking Zamzam water in Islam?","id":"bukhari-74-43"},{"hadith-eng":"(daughter of Al-Harith) that she sent a bowl of milk to the Prophet (ﷺ) while he was standing (at `Arafat) \nin the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The \nProphet was on the back of his camel.","reference":"Sahih al-Bukhari 5618, Book 74, Hadith 44","grade":"","question #":"question #1","question":"What is the significance of drinking milk during the Day of Arafat according to Islamic tradition?","id":"bukhari-74-44"},{"hadith-eng":"Milk mixed with water was brought to Allah's Messenger (ﷺ) while a bedouin was on his right and Abu Bakr \nwas on his left. He drank (of it) and then gave (it) to the bedouin and said, 'The right\" \"The right \n(first).","reference":"Sahih al-Bukhari 5619, Book 74, Hadith 45","grade":"","question #":"question #1","question":"What is the significance of giving preference to the person on the right in Islamic etiquette?","id":"bukhari-74-45"},{"hadith-eng":"Allah's Messenger (ﷺ) was offered something to drink. He drank of it while on his right was a boy and on his \nleft were some elderly people. He said to the boy, \"May I give these (elderly) people first?\" The boy \nsaid, \"By Allah, O Allah's Messenger (ﷺ)! I will not give up my share from you to somebody else.\" On that \nAllah's Messenger (ﷺ) placed the cup in the hand of that boy.","reference":"Sahih al-Bukhari 5620, Book 74, Hadith 46","grade":"","question #":"question #1","question":"What does this incident teach about the rights of individuals in Islamic etiquette?","id":"bukhari-74-46"},{"hadith-eng":"The Prophet (ﷺ) and one of his companions entered upon an Ansari man. The Prophet (ﷺ) and his companion \ngreeted (the man) and he replied, \"O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! \nIt is hot,\" while he was watering his garden. The Prophet (ﷺ) asked him, \"If you have water kept overnight \nin a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was \nwatering the garden The man said, \"O Allah's Messenger (ﷺ)! I have water kept overnight in a water-skin. He \nwent to the shade and poured some water into a bowl and milked some milk from a domestic goat in \nit. The Prophet (ﷺ) drank and then gave the bowl to the man who had come along with him to drink.","reference":"Sahih al-Bukhari 5621, Book 74, Hadith 47","grade":"","question #":"question #1","question":"What is the significance of hospitality in Islamic teachings as demonstrated by the actions of the Ansari man?","id":"bukhari-74-47"},{"hadith-eng":"I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the \nyoungest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to \nme), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was \n(made from), He replied, \"(From) ripe dates and unripe dates.\"","reference":"Sahih al-Bukhari 5622, Book 74, Hadith 48","grade":"","question #":"question #1","question":"What was the reaction of the companions when they learned about the prohibition of alcoholic drinks?","id":"bukhari-74-48"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When night falls (or when it is evening), stop your children from going out, for \nthe devils spread out at that time. But when an hour of the night has passed, release them and close the \ndoors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin \nand mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover \nthem even by placing something across it, and extinguish your lamps. \"","reference":"Sahih al-Bukhari 5623, Book 74, Hadith 49","grade":"","question #":"question #1","question":"What precautions should be taken during the evening to protect against the influence of devils?","id":"bukhari-74-49"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Extinguish the lamps when you go to bed; close your doors; tie the mouths of \nyour water skins, and cover the food and drinks.\" I think he added, \". . . even with a stick you place \nacross the container.\"","reference":"Sahih al-Bukhari 5624, Book 74, Hadith 50","grade":"","question #":"question #1","question":"What precautions should be taken before going to bed according to Islamic teachings?","id":"bukhari-74-50"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the bending of the mouths of water skins for the sake of drinking from them.","reference":"Sahih al-Bukhari 5625, Book 74, Hadith 51","grade":"","question #":"question #1","question":"What are the potential health or hygiene concerns associated with drinking directly from water skins?","id":"bukhari-74-51"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) forbidding the drinking of water by bending the mouths of water skins, i.e., \ndrinking from the mouths directly.","reference":"Sahih al-Bukhari 5626, Book 74, Hadith 52","grade":"","question #":"question #1","question":"What are the potential health or hygiene concerns associated with drinking directly from the mouths of water skins?","id":"bukhari-74-52"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade drinking directly from the mouth of a water skin or other leather containers. \nand forbade preventing one's neighbor from fixing a peg in (the wall of) one's house.","reference":"Sahih al-Bukhari 5627, Book 74, Hadith 53","grade":"","question #":"question #1","question":"What are the etiquettes of drinking water as taught by the Prophet Muhammad (ﷺ)?","id":"bukhari-74-53"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of water directly from the mouth of a water skin .","reference":"Sahih al-Bukhari 5628, Book 74, Hadith 54","grade":"","question #":"question #1","question":"What are the potential health or hygiene concerns associated with drinking directly from a water skin?","id":"bukhari-74-54"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of water direct from the mouth of a water-skin.","reference":"Sahih al-Bukhari 5629, Book 74, Hadith 55","grade":"","question #":"question #1","question":"What are the potential health or safety concerns associated with drinking directly from a water-skin?","id":"bukhari-74-55"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When you drink (water), do not breath in the vessel; and when you urinate, do \nnot touch your penis with your right hand. And when you cleanse yourself after defecation, do not use \nyour right hand.\"","reference":"Sahih al-Bukhari 5630, Book 74, Hadith 56","grade":"","question #":"question #1","question":"What are the etiquettes of drinking water as taught by the Prophet Muhammad (ﷺ)?","id":"bukhari-74-56"},{"hadith-eng":"Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; \nused to take three breaths while drinking.","reference":"Sahih al-Bukhari 5631, Book 74, Hadith 57","grade":"","question #":"question #1","question":"What is the significance of taking multiple breaths while drinking in Islamic tradition?","id":"bukhari-74-57"},{"hadith-eng":"While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver \nvessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he \nhas not stopped using it. The Prophet (ﷺ) forbade us to wear clothes of silk or Dibaj, and to drink in gold \nor silver utensils, and said, 'These things are for them (unbelievers) in this world and for you \n(Muslims) in the Hereafter.' \"","reference":"Sahih al-Bukhari 5632, Book 74, Hadith 58","grade":"","question #":"question #1","question":"What are the Islamic guidelines regarding the use of gold and silver utensils?","id":"bukhari-74-58"},{"hadith-eng":"The Prophet (ﷺ) said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for \nthese things are for them (unbelievers) in this world and for you in the Hereafter.\"","reference":"Sahih al-Bukhari 5633, Book 74, Hadith 59","grade":"","question #":"question #1","question":"What is the Islamic perspective on using gold and silver utensils?","id":"bukhari-74-59"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"He who drinks in silver utensils is only filling his \n`Abdomen with Hell Fire.\"","reference":"Sahih al-Bukhari 5634, Book 74, Hadith 60","grade":"","question #":"question #1","question":"What is the Islamic ruling on using silver utensils for drinking?","id":"bukhari-74-60"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us from seven. He ordered us to visit the \nsick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he \nsays, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help \nothers to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use \nMayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, \nDibaj or Istabraq (two kinds of silk).","reference":"Sahih al-Bukhari 5635, Book 74, Hadith 61","grade":"","question #":"question #1","question":"What are the seven actions that are encouraged in Islam according to this narration?","id":"bukhari-74-61"},{"hadith-eng":"that the people were in doubt whether the Prophet (ﷺ) was fasting on the Day of `Arafat or not, so a \n(wooden) drinking vessel full of milk was sent to him, and he drank it.","reference":"Sahih al-Bukhari 5636, Book 74, Hadith 62","grade":"","question #":"question #1","question":"What can be inferred about the Prophet's actions regarding fasting on the Day of `Arafat?","id":"bukhari-74-62"},{"hadith-eng":"An Arab lady was mentioned to the Prophet (ﷺ) so he asked Abu Usaid As-Sa`idi to send for her, and he \nsent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet (ﷺ) came out and went to \nher and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet (ﷺ) spoke \nto her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said \nto her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Messenger (ﷺ) who has come \nto command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the \nProphet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give \nus water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: \nSahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul \n`Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.","reference":"Sahih al-Bukhari 5637, Book 74, Hadith 63","grade":"","question #":"question #1","question":"What is the significance of seeking refuge in Allah when feeling uncomfortable or threatened?","id":"bukhari-74-63"},{"hadith-eng":"I saw the drinking bowl of the Prophet (ﷺ) with Anas bin Malik, and it had been broken, and he had \nmended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \n\"I gave water to the Prophet (ﷺ) in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: \nAround that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but \nAbu Talha said to him, \"Do not change a thing that Allah's Messenger (ﷺ) has made.\" So Anas left it as it \nwas.","reference":"Sahih al-Bukhari 5638, Book 74, Hadith 64","grade":"","question #":"question #1","question":"What is the significance of preserving items used by the Prophet Muhammad (ﷺ) in their original state?","id":"bukhari-74-64"},{"hadith-eng":"I was with the Prophet (ﷺ) and the time for the `Asr prayer became due. We had no water with us except a \nlittle which was put in a vessel and was brought to the Prophet (ﷺ) . He put his hand into it and spread out \nhis fingers and then said, \"Come along! Hurry up! All those who want to perform ablution. The \nblessing is from Allah.'' I saw the water gushing out from his fingers. So the people performed the \nablution and drank, and I tried to drink more of that water (beyond my thirst and capacity), for I knew \nthat it was a blessing. The sub-narrator said: I asked Jabir, \"How many persons were you then?\" He \nreplied, \"We were one-thousand four hundred men.\" Salim said: Jabir said, 1500.","reference":"Sahih al-Bukhari 5639, Book 74, Hadith 65","grade":"","question #":"question #1","question":"What is the significance of miracles in strengthening the faith of the companions of the Prophet?","id":"bukhari-74-65"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever drinks alcoholic drinks in the world and does not repent (before \ndying), will be deprived of it in the Hereafter.\"","reference":"Sahih al-Bukhari 5575, Book 74, Hadith 1","grade":"","question #":"question #2","question":"How does repentance affect one's eligibility for certain rewards in the Hereafter?","id":"bukhari-74-66"},{"hadith-eng":"On the night Allah's Messenger (ﷺ) was taken on a night journey (Miraj) two cups, one containing wine and \nthe other milk, were presented to him at Jerusalem. He looked at it and took the cup of milk. Gabriel \nsaid, \"Praise be to Allah Who guided you to Al-Fitra (the right path); if you had taken (the cup of) \nwine, your nation would have gone astray.\"","reference":"Sahih al-Bukhari 5576, Book 74, Hadith 2","grade":"","question #":"question #2","question":"How does the choice made by the Prophet during the night journey reflect on the spiritual direction of his nation?","id":"bukhari-74-67"},{"hadith-eng":"I heard from Allah's Messenger (ﷺ) a narration which none other than I will narrate to you. The Prophet, said, \n\"From among the portents of the our are the following: General ignorance (in religious affairs) will \nprevail, (religious) knowledge will decrease, illegal sexual intercourse will prevail, alcoholic drinks \nwill be drunk (in abundance), men will decrease and women will increase so much so that for every \nfifty women there will be one man to look after them.\"","reference":"Sahih al-Bukhari 5577, Book 74, Hadith 3","grade":"","question #":"question #2","question":"How does the prevalence of ignorance and decrease in religious knowledge relate to the signs of the end times?","id":"bukhari-74-68"},{"hadith-eng":"The Prophet (ﷺ) said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a \nbeliever; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the \ntime of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman \nbin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority \nof Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who \nrobs (takes illegally something by force) while the people are looking at him, is not a believer at the \ntime he is robbing (taking).","reference":"Sahih al-Bukhari 5578, Book 74, Hadith 4","grade":"","question #":"question #2","question":"How does the act of committing sins like theft or adultery affect a person's belief according to Islamic teachings?","id":"bukhari-74-69"},{"hadith-eng":"\"Alcoholic drinks were prohibited (by Allah) when there was nothing of it (special kind of wine) in \nMedina.","reference":"Sahih al-Bukhari 5579, Book 74, Hadith 5","grade":"","question #":"question #2","question":"How did the prohibition of alcohol impact the society in Medina at the time of the Prophet?","id":"bukhari-74-70"},{"hadith-eng":"\"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, \nfor most of our liquors were made from unripe and ripe dates.","reference":"Sahih al-Bukhari 5580, Book 74, Hadith 6","grade":"","question #":"question #2","question":"How did the prohibition of alcoholic drinks impact the consumption of wine made from grapes in Medina?","id":"bukhari-74-71"},{"hadith-eng":"`Umar stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, \nand these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an \nalcoholic drink is that, that disturbs the mind.","reference":"Sahih al-Bukhari 5581, Book 74, Hadith 7","grade":"","question #":"question #2","question":"How is an alcoholic drink defined in terms of its effect on the mind in Islamic jurisprudence?","id":"bukhari-74-72"},{"hadith-eng":"I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b with a drink prepared from ripe and unripe \ndates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing \nthat) Abu Talha said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.","reference":"Sahih al-Bukhari 5582, Book 74, Hadith 8","grade":"","question #":"question #2","question":"What actions were taken by the companions upon learning about the prohibition of alcohol in Islam?","id":"bukhari-74-73"},{"hadith-eng":"While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the \nyoungest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \n\"Throw it away.\" So I threw it away.","reference":"Sahih al-Bukhari 5583, Book 74, Hadith 9","grade":"","question #":"question #2","question":"How did the companions demonstrate obedience to new Islamic rulings during the time of the Prophet?","id":"bukhari-74-74"},{"hadith-eng":"Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe \ndates.","reference":"Sahih al-Bukhari 5584, Book 74, Hadith 10","grade":"","question #":"question #2","question":"How did the prohibition of alcoholic drinks impact the practices of preparing beverages in early Islamic society?","id":"bukhari-74-75"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about Al-Bit. He said, \"All drinks that intoxicate are unlawful (to drink.)","reference":"Sahih al-Bukhari 5585, Book 74, Hadith 11","grade":"","question #":"question #2","question":"How does Islam define substances that are considered unlawful to consume?","id":"bukhari-74-76"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about Al-Bit a liquor prepared from honey \n     which the Yemenites used to drink. Allah's Messenger (ﷺ) said, \"All drinks \n     that intoxicate are unlawful (to drink).\"","reference":"Sahih al-Bukhari 5586, Book 74, Hadith 12","grade":"","question #":"question #2","question":"How does Islam view the consumption of drinks that cause intoxication?","id":"bukhari-74-77"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Do not make drinks in Ad-Dubba' nor in \n     Al-Muzaffat.  Abu Huraira used to add to them Al-Hantam and An-Naqir.","reference":"Sahih al-Bukhari 5587, Book 74, Hadith 13","grade":"","question #":"question #2","question":"Why might certain types of containers be prohibited for making drinks in Islamic teachings?","id":"bukhari-74-78"},{"hadith-eng":"`Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ), saying, \"Alcoholic drinks were prohibited \nby Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, \nbarley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's \nApostle had not left us before he had given us definite verdicts concerning three matters, i.e., how \nmuch a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person \namong whose heirs there is no father or son), and various types of Riba(1 ) (usury) .\"","reference":"Sahih al-Bukhari 5588, Book 74, Hadith 14","grade":"","question #":"question #2","question":"What are the implications of alcohol consumption on the mind as mentioned in Islamic teachings?","id":"bukhari-74-79"},{"hadith-eng":"\"Alcoholic drinks are prepared from five things, i.e., raisins, dates.\n     wheat, barley and honey.\"","reference":"Sahih al-Bukhari 5589, Book 74, Hadith 15","grade":"","question #":"question #2","question":"How does Islam categorize substances like raisins, dates, wheat, barley, and honey in the context of alcohol production?","id":"bukhari-74-80"},{"hadith-eng":"that he heard the Prophet (ﷺ) saying, \"From among my followers there will \n     be some people who will consider illegal sexual intercourse, the \n     wearing of silk, the drinking of alcoholic drinks and the use of \n     musical instruments, as lawful. And there will be some people who will\n     stay near the side of a mountain and in the evening their shepherd \n     will come to them with their sheep and ask them for something, but \n     they will say to him, 'Return to us tomorrow.' Allah will destroy them\n     during the night and will let the mountain fall on them, and He will \n     transform the rest of them into monkeys and pigs and they will remain \n     so till the Day of Resurrection.\"","reference":"Sahih al-Bukhari 5590, Book 74, Hadith 16","grade":"","question #":"question #2","question":"How does the hadith describe the transformation of people who engage in certain sinful behaviors?","id":"bukhari-74-81"},{"hadith-eng":"Abu Usaid As-Sa`idi came and invited Allah's Messenger (ﷺ) on the occasion of his wedding. His wife who \nwas the bride, was serving them. Do you know what drink she prepared for Allah's Messenger (ﷺ) ? She had \nsoaked some dates in water in a Tur overnight.","reference":"Sahih al-Bukhari 5591, Book 74, Hadith 17","grade":"","question #":"question #2","question":"How were drinks traditionally prepared and served during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-82"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the use of (certain) containers, but the Ansar said, \"We cannot dispense with \nthem.\" The Prophet (ﷺ) then said, \"If so, then use them.\"","reference":"Sahih al-Bukhari 5592, Book 74, Hadith 18","grade":"","question #":"question #2","question":"How does the interaction between the Prophet and the Ansar illustrate the balance between religious directives and community needs?","id":"bukhari-74-83"},{"hadith-eng":"When the Prophet (ﷺ) forbade the use of certain containers (that were used for preparing alcoholic drinks), \nsomebody said to the Prophet (ﷺ) . \"But not all the people can find skins.\" So he allowed them to use clay \njars not covered with pitch.","reference":"Sahih al-Bukhari 5593, Book 74, Hadith 19","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) address the concerns of people who could not find alternative containers?","id":"bukhari-74-84"},{"hadith-eng":"the Prophet (ﷺ) forbade the use of Ad-Dubba' and Al Muzaffat.A'mash also narrated this.","reference":"Sahih al-Bukhari 5594, Book 74, Hadith 20","grade":"","question #":"question #2","question":"What is the significance of prohibiting certain items or practices in Islam?","id":"bukhari-74-85"},{"hadith-eng":"I asked Al-Aswad, \"Did you ask `Aisha, Mother of the Believers, about the containers in which it is \ndisliked to prepare (non-alcoholic) drinks?\" He said, \"Yes, I said to her, 'O Mother of the Believers! \nWhat containers did the Prophet (ﷺ) forbid to use for preparing (non-alcoholic) drinks?\" She said, 'The \nProphet forbade us, (his family), to prepare (nonalcoholic) drinks in Ad-Dubba and Al-Muzaffat.' I \nasked, 'Didn't you mention Al Jar and Al Hantam?' She said, 'I tell what I have heard; shall I tell you \nwhat I have not heard?' \"","reference":"Sahih al-Bukhari 5595, Book 74, Hadith 21","grade":"","question #":"question #2","question":"How did Aisha, the Mother of the Believers, respond when asked about the containers forbidden by the Prophet?","id":"bukhari-74-86"},{"hadith-eng":"I heard `Abdullah bin Abi `Aufa saying, \"The Prophet (ﷺ) forbade the use of green jars.\" I said, \"Shall we \ndrink out of white jars?\" He said, \"No.\"","reference":"Sahih al-Bukhari 5596, Book 74, Hadith 22","grade":"","question #":"question #2","question":"How does the guidance on the use of jars reflect on the broader principles of Islamic dietary laws?","id":"bukhari-74-87"},{"hadith-eng":"Abu Usaid As Sa`idi invited the Prophet (ﷺ) to his wedding banquet. At that time his wife was serving \nthem and she was the bride. She said, ''Do you know what (kind of syrup) I soaked (made) for Allah's \nApostle? I soaked some dates in water in a Tur (bowl) overnight. '","reference":"Sahih al-Bukhari 5597, Book 74, Hadith 23","grade":"","question #":"question #2","question":"How were traditional drinks prepared and served during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-88"},{"hadith-eng":"I asked Ibn `Abbas about Al-Badhaq. He said, \"Muhammad prohibited alcoholic drinks before It was \ncalled Al-Badhaq (by saying), 'Any drink that intoxicates is unlawful.' I said, 'What about good lawful \ndrinks?' He said,'Apart from what is lawful and good, all other things are unlawful and not good \n(unclean Al-Khabith).","reference":"Sahih al-Bukhari 5598, Book 74, Hadith 24","grade":"","question #":"question #2","question":"How does Islam differentiate between lawful and unlawful drinks?","id":"bukhari-74-89"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things and honey.","reference":"Sahih al-Bukhari 5599, Book 74, Hadith 25","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) view sweet foods and honey?","id":"bukhari-74-90"},{"hadith-eng":"While I was serving Abu Talha. Abu Dujana and Abu Suhail bin Al-Baida' with a drink made from a \nmixture of unripe and ripe dates, alcoholic drinks, were made unlawful, whereupon I threw it away, \nand I was their butler and the youngest of them, and we used to consider that drink as an alcoholic \ndrink in those days.","reference":"Sahih al-Bukhari 5600, Book 74, Hadith 26","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) respond to the prohibition of alcohol?","id":"bukhari-74-91"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of alcoholic drinks prepared from raisins, dates, unripe dates and \nfresh ripe dates.","reference":"Sahih al-Bukhari 5601, Book 74, Hadith 27","grade":"","question #":"question #2","question":"Why is the consumption of alcoholic beverages discouraged in Islamic teachings?","id":"bukhari-74-92"},{"hadith-eng":"The Prophet (ﷺ) forbade the mixing of ripe and unripe dates and also the mixing of dates and raisins (for \npreparing a syrup) but the syrup of each kind of fruit should be prepared separately. ( One may have \nsuch drinks as long as it is fresh )","reference":"Sahih al-Bukhari 5602, Book 74, Hadith 28","grade":"","question #":"question #2","question":"Why is it important to prepare syrups from each type of fruit separately according to Islamic tradition?","id":"bukhari-74-93"},{"hadith-eng":"Allah's Messenger (ﷺ) was presented a bowl of milk and a bowl of wine on the night he was taken on a \njourney (Al-Mi'raj).","reference":"Sahih al-Bukhari 5603, Book 74, Hadith 29","grade":"","question #":"question #2","question":"What does the event of Al-Mi'raj signify in the life of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-94"},{"hadith-eng":"The people doubted whether Allah's Messenger (ﷺ) was fasting or the Day of `Arafat or not. So I sent a cup \ncontaining milk to him and he drank it.","reference":"Sahih al-Bukhari 5604, Book 74, Hadith 30","grade":"","question #":"question #2","question":"How can the actions of the Prophet (ﷺ) clarify doubts about religious practices?","id":"bukhari-74-95"},{"hadith-eng":"Abu Humaid brought a cup of mix from a place called Al-Naqi. Allah's Messenger (ﷺ) said to him, \"Will you \nnot cover it, even by placing a stick across its\"","reference":"Sahih al-Bukhari 5605, Book 74, Hadith 31","grade":"","question #":"question #2","question":"How can one ensure the protection of food and drink from impurities or harm?","id":"bukhari-74-96"},{"hadith-eng":"Abu Humaid, an Ansari man, came from AnNaqi carrying a cup of milk to the Prophet. The Prophet (ﷺ) \nsaid, \"Will you not cover it even by placing a stick across it?\"","reference":"Sahih al-Bukhari 5606, Book 74, Hadith 32","grade":"","question #":"question #2","question":"How can one ensure the protection of food and drink from impurities or harm?","id":"bukhari-74-97"},{"hadith-eng":"The Prophet (ﷺ) came from Mecca with Abu Bakr. Abu Bakr said \"We passed by a shepherd and at that \ntime Allah's Messenger (ﷺ) was thirsty. I milked a little milk in a bowl and Allah's Messenger (ﷺ) drank till I was \npleased. Suraqa bin Ju'shum came to us riding a horse (chasing us). The Prophet (ﷺ) invoked evil upon \nhim, whereupon Suraqa requested him not to invoke evil upon him, in which case he would go back. \nThe Prophet (ﷺ) agreed.","reference":"Sahih al-Bukhari 5607, Book 74, Hadith 33","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) respond to requests for mercy from those who initially opposed him?","id":"bukhari-74-98"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best object of charity is a she-camel which has (newly) given birth and \ngives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its \nmilk by milking one bowl in the morning and one in the evening.\"","reference":"Sahih al-Bukhari 5608, Book 74, Hadith 34","grade":"","question #":"question #2","question":"How can the act of giving a milk-producing animal as charity benefit the recipient?","id":"bukhari-74-99"},{"hadith-eng":"Allah's Messenger (ﷺ) drank milk and then rinsed his mouth and said, \"It contains fat.\"","reference":"Sahih al-Bukhari 5609, Book 74, Hadith 35","grade":"","question #":"question #2","question":"How does the consumption of milk relate to dietary practices in Islamic teachings?","id":"bukhari-74-100"},{"hadith-eng":"I was raised to the Lote Tree and saw four rivers, two of which were coming out and two going in. \nThose which were coming out were the Nile and the Euphrates, and those which were going in were two rivers in paradise. Then I was given three bowls, one containing milk, and another containing honey, and a third containing wine. I took the bowl containing milk and drank it. It was said to me, \"You and your followers will be on the right path (of Islam).\"","reference":"Sahih al-Bukhari 5610, Book 74, Hadith 36","grade":"","question #":"question #2","question":"What do the rivers mentioned in the hadith symbolize in Islamic teachings?","id":"bukhari-74-101"},{"hadith-eng":"Abu Talha had the largest number of datepalms from amongst the Ansars of Medina. The dearest of \nhis property to him was Bairuha garden which was facing the (Prophet's) Mosque. Allah's Messenger (ﷺ) \nused to enter it and drink of its good fresh water. When the Holy Verse:-- 'By no means shall you \nattain righteousness unless you spend (in charity) of that which you love.' (3.92) was revealed, Abu \nTalha got up and said, \"O Allah's Messenger (ﷺ)! Allah says: By no means shall you attain righteousness \nunless you spend of that which you love,' and the dearest of my property to me is the Bairuha garden \nand I want to give it in charity in Allah's Cause, seeking to be rewarded by Allah for that. So you can \nspend it, O Allah's Messenger (ﷺ), where-ever Allah instructs you. ' Allah s Apostle said, \"Good! That is a \nperishable (or profitable) wealth\" (`Abdullah is in doubt as to which word was used.) He said, \"I have \nheard what you have said but in my opinion you'd better give it to your kith and kin.\" On that Abu \nTalha said, \"I will do so, O Allah's Messenger (ﷺ)!\" Abu Talha distributed that garden among his kith and kin \nand cousins.","reference":"Sahih al-Bukhari 5611, Book 74, Hadith 37","grade":"","question #":"question #2","question":"How does the concept of righteousness relate to spending in charity according to Islamic teachings?","id":"bukhari-74-102"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) drinking milk. He came to my house and I milked a sheep and then mixed the \nmilk with water from the well for Allah's Messenger (ﷺ). He took the bowl and drank while on his left there \nwas sitting Abu Bakr, and on his right there was a bedouin. He then gave the remaining milk to the \nbedouin and said, \"The right! The right (first).","reference":"Sahih al-Bukhari 5612, Book 74, Hadith 38","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate hospitality and sharing in this scenario?","id":"bukhari-74-103"},{"hadith-eng":"Allah's Messenger (ﷺ) and one of his companions entered upon an Ansari man and the Prophet (ﷺ) said to him, \n\"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting \nour mouth in it.\" The man was watering his garden then. He said, \"O Allah's Messenger (ﷺ)! I have water \nkept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and \nmilked a domestic goat of his in it. Allah's Messenger (ﷺ) drank, and then the man who had come along with \nhim, drank.","reference":"Sahih al-Bukhari 5613, Book 74, Hadith 39","grade":"","question #":"question #2","question":"How does the practice of sharing resources, like water, reflect the values of community and generosity in Islam?","id":"bukhari-74-104"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things (syrup, etc.) and honey.","reference":"Sahih al-Bukhari 5614, Book 74, Hadith 40","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) view sweet foods and honey?","id":"bukhari-74-105"},{"hadith-eng":"Ali came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and \r\nsaid, \"Some people dislike to drink while standing, but I saw the Prophet (ﷺ) doing (drinking water) as \r\nyou have seen me doing now.\"","reference":"Sahih al-Bukhari 5615, Book 74, Hadith 41","grade":"","question #":"question #2","question":"How does the practice of drinking water while standing relate to the traditions of the Prophet (ﷺ)?","id":"bukhari-74-106"},{"hadith-eng":"`Ali offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order \nto deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him \nand he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining \nwater while he was standing. and said, \"Some people dislike to drink water while standing thought the \nProphet did as I have just done.\"","reference":"Sahih al-Bukhari 5616, Book 74, Hadith 42","grade":"","question #":"question #2","question":"What is the significance of drinking water while standing according to the practices of the Prophet?","id":"bukhari-74-107"},{"hadith-eng":"The Prophet (ﷺ) drank Zamzam (water) while standing.","reference":"Sahih al-Bukhari 5617, Book 74, Hadith 43","grade":"","question #":"question #2","question":"Is there any specific posture recommended for drinking Zamzam water?","id":"bukhari-74-108"},{"hadith-eng":"(daughter of Al-Harith) that she sent a bowl of milk to the Prophet (ﷺ) while he was standing (at `Arafat) \nin the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The \nProphet was on the back of his camel.","reference":"Sahih al-Bukhari 5618, Book 74, Hadith 44","grade":"","question #":"question #2","question":"How does the Prophet's action of drinking milk at Arafat reflect on the permissibility of consuming food and drink during certain rituals?","id":"bukhari-74-109"},{"hadith-eng":"Milk mixed with water was brought to Allah's Messenger (ﷺ) while a bedouin was on his right and Abu Bakr \nwas on his left. He drank (of it) and then gave (it) to the bedouin and said, 'The right\" \"The right \n(first).","reference":"Sahih al-Bukhari 5619, Book 74, Hadith 45","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate fairness and respect in social gatherings?","id":"bukhari-74-110"},{"hadith-eng":"Allah's Messenger (ﷺ) was offered something to drink. He drank of it while on his right was a boy and on his \nleft were some elderly people. He said to the boy, \"May I give these (elderly) people first?\" The boy \nsaid, \"By Allah, O Allah's Messenger (ﷺ)! I will not give up my share from you to somebody else.\" On that \nAllah's Messenger (ﷺ) placed the cup in the hand of that boy.","reference":"Sahih al-Bukhari 5620, Book 74, Hadith 46","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate fairness and respect for the rights of others in this situation?","id":"bukhari-74-111"},{"hadith-eng":"The Prophet (ﷺ) and one of his companions entered upon an Ansari man. The Prophet (ﷺ) and his companion \ngreeted (the man) and he replied, \"O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! \nIt is hot,\" while he was watering his garden. The Prophet (ﷺ) asked him, \"If you have water kept overnight \nin a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was \nwatering the garden The man said, \"O Allah's Messenger (ﷺ)! I have water kept overnight in a water-skin. He \nwent to the shade and poured some water into a bowl and milked some milk from a domestic goat in \nit. The Prophet (ﷺ) drank and then gave the bowl to the man who had come along with him to drink.","reference":"Sahih al-Bukhari 5621, Book 74, Hadith 47","grade":"","question #":"question #2","question":"How does the sharing of food and drink reflect the values of community and brotherhood in Islam?","id":"bukhari-74-112"},{"hadith-eng":"I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the \nyoungest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to \nme), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was \n(made from), He replied, \"(From) ripe dates and unripe dates.\"","reference":"Sahih al-Bukhari 5622, Book 74, Hadith 48","grade":"","question #":"question #2","question":"How did the companions dispose of alcoholic drinks upon hearing about their prohibition?","id":"bukhari-74-113"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When night falls (or when it is evening), stop your children from going out, for \nthe devils spread out at that time. But when an hour of the night has passed, release them and close the \ndoors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin \nand mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover \nthem even by placing something across it, and extinguish your lamps. \"","reference":"Sahih al-Bukhari 5623, Book 74, Hadith 49","grade":"","question #":"question #2","question":"Why is it important to mention Allah's Name when closing doors and covering containers?","id":"bukhari-74-114"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Extinguish the lamps when you go to bed; close your doors; tie the mouths of \nyour water skins, and cover the food and drinks.\" I think he added, \". . . even with a stick you place \nacross the container.\"","reference":"Sahih al-Bukhari 5624, Book 74, Hadith 50","grade":"","question #":"question #2","question":"How can one ensure the safety of their home and belongings during the night?","id":"bukhari-74-115"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the bending of the mouths of water skins for the sake of drinking from them.","reference":"Sahih al-Bukhari 5625, Book 74, Hadith 51","grade":"","question #":"question #2","question":"Why might it be important to follow specific etiquettes or guidelines when consuming food or drink in Islam?","id":"bukhari-74-116"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) forbidding the drinking of water by bending the mouths of water skins, i.e., \ndrinking from the mouths directly.","reference":"Sahih al-Bukhari 5626, Book 74, Hadith 52","grade":"","question #":"question #2","question":"What are the etiquettes of drinking water as taught by the Prophet Muhammad (ﷺ)?","id":"bukhari-74-117"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade drinking directly from the mouth of a water skin or other leather containers. \nand forbade preventing one's neighbor from fixing a peg in (the wall of) one's house.","reference":"Sahih al-Bukhari 5627, Book 74, Hadith 53","grade":"","question #":"question #2","question":"How does Islam emphasize the importance of maintaining good relations with neighbors?","id":"bukhari-74-118"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of water directly from the mouth of a water skin .","reference":"Sahih al-Bukhari 5628, Book 74, Hadith 54","grade":"","question #":"question #2","question":"What are the etiquettes of drinking water in Islam as taught by the Prophet Muhammad (ﷺ)?","id":"bukhari-74-119"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of water direct from the mouth of a water-skin.","reference":"Sahih al-Bukhari 5629, Book 74, Hadith 55","grade":"","question #":"question #2","question":"What guidance does Islam provide regarding the manner of drinking water?","id":"bukhari-74-120"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When you drink (water), do not breath in the vessel; and when you urinate, do \nnot touch your penis with your right hand. And when you cleanse yourself after defecation, do not use \nyour right hand.\"","reference":"Sahih al-Bukhari 5630, Book 74, Hadith 56","grade":"","question #":"question #2","question":"Why is it advised not to use the right hand for certain personal hygiene tasks in Islam?","id":"bukhari-74-121"},{"hadith-eng":"Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; \nused to take three breaths while drinking.","reference":"Sahih al-Bukhari 5631, Book 74, Hadith 57","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) practice drinking water according to his companions?","id":"bukhari-74-122"},{"hadith-eng":"While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver \nvessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he \nhas not stopped using it. The Prophet (ﷺ) forbade us to wear clothes of silk or Dibaj, and to drink in gold \nor silver utensils, and said, 'These things are for them (unbelievers) in this world and for you \n(Muslims) in the Hereafter.' \"","reference":"Sahih al-Bukhari 5632, Book 74, Hadith 58","grade":"","question #":"question #2","question":"Why are certain luxurious items reserved for the Hereafter according to Islamic teachings?","id":"bukhari-74-123"},{"hadith-eng":"The Prophet (ﷺ) said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for \nthese things are for them (unbelievers) in this world and for you in the Hereafter.\"","reference":"Sahih al-Bukhari 5633, Book 74, Hadith 59","grade":"","question #":"question #2","question":"Why are silk and Dibaj clothes prohibited for believers in this world?","id":"bukhari-74-124"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"He who drinks in silver utensils is only filling his \n`Abdomen with Hell Fire.\"","reference":"Sahih al-Bukhari 5634, Book 74, Hadith 60","grade":"","question #":"question #2","question":"What are the consequences mentioned for those who drink from silver utensils?","id":"bukhari-74-125"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us from seven. He ordered us to visit the \nsick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he \nsays, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help \nothers to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use \nMayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, \nDibaj or Istabraq (two kinds of silk).","reference":"Sahih al-Bukhari 5635, Book 74, Hadith 61","grade":"","question #":"question #2","question":"What are the seven prohibitions mentioned in this narration?","id":"bukhari-74-126"},{"hadith-eng":"that the people were in doubt whether the Prophet (ﷺ) was fasting on the Day of `Arafat or not, so a \n(wooden) drinking vessel full of milk was sent to him, and he drank it.","reference":"Sahih al-Bukhari 5636, Book 74, Hadith 62","grade":"","question #":"question #2","question":"How did the Prophet's consumption of milk clarify the doubts of the people?","id":"bukhari-74-127"},{"hadith-eng":"An Arab lady was mentioned to the Prophet (ﷺ) so he asked Abu Usaid As-Sa`idi to send for her, and he \nsent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet (ﷺ) came out and went to \nher and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet (ﷺ) spoke \nto her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said \nto her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Messenger (ﷺ) who has come \nto command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the \nProphet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give \nus water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: \nSahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul \n`Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.","reference":"Sahih al-Bukhari 5637, Book 74, Hadith 63","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to a woman's request for refuge from him?","id":"bukhari-74-128"},{"hadith-eng":"I saw the drinking bowl of the Prophet (ﷺ) with Anas bin Malik, and it had been broken, and he had \nmended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \n\"I gave water to the Prophet (ﷺ) in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: \nAround that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but \nAbu Talha said to him, \"Do not change a thing that Allah's Messenger (ﷺ) has made.\" So Anas left it as it \nwas.","reference":"Sahih al-Bukhari 5638, Book 74, Hadith 64","grade":"","question #":"question #2","question":"How did Anas bin Malik demonstrate his respect for the Prophet's belongings?","id":"bukhari-74-129"},{"hadith-eng":"I was with the Prophet (ﷺ) and the time for the `Asr prayer became due. We had no water with us except a \nlittle which was put in a vessel and was brought to the Prophet (ﷺ) . He put his hand into it and spread out \nhis fingers and then said, \"Come along! Hurry up! All those who want to perform ablution. The \nblessing is from Allah.'' I saw the water gushing out from his fingers. So the people performed the \nablution and drank, and I tried to drink more of that water (beyond my thirst and capacity), for I knew \nthat it was a blessing. The sub-narrator said: I asked Jabir, \"How many persons were you then?\" He \nreplied, \"We were one-thousand four hundred men.\" Salim said: Jabir said, 1500.","reference":"Sahih al-Bukhari 5639, Book 74, Hadith 65","grade":"","question #":"question #2","question":"How did the companions of the Prophet demonstrate their belief in the blessings of Allah during challenging situations?","id":"bukhari-74-130"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever drinks alcoholic drinks in the world and does not repent (before \ndying), will be deprived of it in the Hereafter.\"","reference":"Sahih al-Bukhari 5575, Book 74, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of abstaining from alcohol in Islamic teachings?","id":"bukhari-74-131"},{"hadith-eng":"On the night Allah's Messenger (ﷺ) was taken on a night journey (Miraj) two cups, one containing wine and \nthe other milk, were presented to him at Jerusalem. He looked at it and took the cup of milk. Gabriel \nsaid, \"Praise be to Allah Who guided you to Al-Fitra (the right path); if you had taken (the cup of) \nwine, your nation would have gone astray.\"","reference":"Sahih al-Bukhari 5576, Book 74, Hadith 2","grade":"","question #":"question #3","question":"What role does divine guidance play in making choices that affect the spiritual well-being of a community?","id":"bukhari-74-132"},{"hadith-eng":"I heard from Allah's Messenger (ﷺ) a narration which none other than I will narrate to you. The Prophet, said, \n\"From among the portents of the our are the following: General ignorance (in religious affairs) will \nprevail, (religious) knowledge will decrease, illegal sexual intercourse will prevail, alcoholic drinks \nwill be drunk (in abundance), men will decrease and women will increase so much so that for every \nfifty women there will be one man to look after them.\"","reference":"Sahih al-Bukhari 5577, Book 74, Hadith 3","grade":"","question #":"question #3","question":"What societal changes are indicated by the imbalance in the male-to-female ratio as a sign of the Hour?","id":"bukhari-74-133"},{"hadith-eng":"The Prophet (ﷺ) said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a \nbeliever; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the \ntime of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman \nbin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority \nof Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who \nrobs (takes illegally something by force) while the people are looking at him, is not a believer at the \ntime he is robbing (taking).","reference":"Sahih al-Bukhari 5578, Book 74, Hadith 4","grade":"","question #":"question #3","question":"What are the implications of committing sins openly in front of others on a person's faith?","id":"bukhari-74-134"},{"hadith-eng":"\"Alcoholic drinks were prohibited (by Allah) when there was nothing of it (special kind of wine) in \nMedina.","reference":"Sahih al-Bukhari 5579, Book 74, Hadith 5","grade":"","question #":"question #3","question":"What are the implications of prohibiting certain substances in Islamic law?","id":"bukhari-74-135"},{"hadith-eng":"\"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, \nfor most of our liquors were made from unripe and ripe dates.","reference":"Sahih al-Bukhari 5580, Book 74, Hadith 6","grade":"","question #":"question #3","question":"What types of dates were used to make liquors in Medina before the prohibition of alcoholic drinks?","id":"bukhari-74-136"},{"hadith-eng":"`Umar stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, \nand these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an \nalcoholic drink is that, that disturbs the mind.","reference":"Sahih al-Bukhari 5581, Book 74, Hadith 7","grade":"","question #":"question #3","question":"What was the role of Umar in communicating the prohibition of alcoholic drinks in Islam?","id":"bukhari-74-137"},{"hadith-eng":"I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b with a drink prepared from ripe and unripe \ndates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing \nthat) Abu Talha said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.","reference":"Sahih al-Bukhari 5582, Book 74, Hadith 8","grade":"","question #":"question #3","question":"What does the immediate response of the companions to the prohibition of alcohol indicate about their commitment to Islamic teachings?","id":"bukhari-74-138"},{"hadith-eng":"While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the \nyoungest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \n\"Throw it away.\" So I threw it away.","reference":"Sahih al-Bukhari 5583, Book 74, Hadith 9","grade":"","question #":"question #3","question":"What does this incident reveal about the immediate implementation of Islamic laws by the early Muslims?","id":"bukhari-74-139"},{"hadith-eng":"Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe \ndates.","reference":"Sahih al-Bukhari 5584, Book 74, Hadith 10","grade":"","question #":"question #3","question":"What ingredients were commonly used to prepare alcoholic drinks before their prohibition in Islamic tradition?","id":"bukhari-74-140"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about Al-Bit. He said, \"All drinks that intoxicate are unlawful (to drink.)","reference":"Sahih al-Bukhari 5585, Book 74, Hadith 11","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding intoxicating beverages?","id":"bukhari-74-141"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about Al-Bit a liquor prepared from honey \n     which the Yemenites used to drink. Allah's Messenger (ﷺ) said, \"All drinks \n     that intoxicate are unlawful (to drink).\"","reference":"Sahih al-Bukhari 5586, Book 74, Hadith 12","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding beverages made from honey that intoxicate?","id":"bukhari-74-142"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Do not make drinks in Ad-Dubba' nor in \n     Al-Muzaffat.  Abu Huraira used to add to them Al-Hantam and An-Naqir.","reference":"Sahih al-Bukhari 5587, Book 74, Hadith 13","grade":"","question #":"question #3","question":"How do different narrators contribute to the understanding of prohibitions in Islamic traditions?","id":"bukhari-74-143"},{"hadith-eng":"`Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ), saying, \"Alcoholic drinks were prohibited \nby Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, \nbarley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's \nApostle had not left us before he had given us definite verdicts concerning three matters, i.e., how \nmuch a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person \namong whose heirs there is no father or son), and various types of Riba(1 ) (usury) .\"","reference":"Sahih al-Bukhari 5588, Book 74, Hadith 14","grade":"","question #":"question #3","question":"What are some unresolved issues related to inheritance and usury that were highlighted by Umar?","id":"bukhari-74-144"},{"hadith-eng":"\"Alcoholic drinks are prepared from five things, i.e., raisins, dates.\n     wheat, barley and honey.\"","reference":"Sahih al-Bukhari 5589, Book 74, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of identifying the ingredients used in making alcoholic beverages in Islamic jurisprudence?","id":"bukhari-74-145"},{"hadith-eng":"that he heard the Prophet (ﷺ) saying, \"From among my followers there will \n     be some people who will consider illegal sexual intercourse, the \n     wearing of silk, the drinking of alcoholic drinks and the use of \n     musical instruments, as lawful. And there will be some people who will\n     stay near the side of a mountain and in the evening their shepherd \n     will come to them with their sheep and ask them for something, but \n     they will say to him, 'Return to us tomorrow.' Allah will destroy them\n     during the night and will let the mountain fall on them, and He will \n     transform the rest of them into monkeys and pigs and they will remain \n     so till the Day of Resurrection.\"","reference":"Sahih al-Bukhari 5590, Book 74, Hadith 16","grade":"","question #":"question #3","question":"What actions are highlighted as being wrongly considered permissible by some followers in the hadith?","id":"bukhari-74-146"},{"hadith-eng":"Abu Usaid As-Sa`idi came and invited Allah's Messenger (ﷺ) on the occasion of his wedding. His wife who \nwas the bride, was serving them. Do you know what drink she prepared for Allah's Messenger (ﷺ) ? She had \nsoaked some dates in water in a Tur overnight.","reference":"Sahih al-Bukhari 5591, Book 74, Hadith 17","grade":"","question #":"question #3","question":"What role did women play in social gatherings during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-147"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the use of (certain) containers, but the Ansar said, \"We cannot dispense with \nthem.\" The Prophet (ﷺ) then said, \"If so, then use them.\"","reference":"Sahih al-Bukhari 5592, Book 74, Hadith 18","grade":"","question #":"question #3","question":"What can be learned about the adaptability of Islamic teachings in response to the needs of the people?","id":"bukhari-74-148"},{"hadith-eng":"When the Prophet (ﷺ) forbade the use of certain containers (that were used for preparing alcoholic drinks), \nsomebody said to the Prophet (ﷺ) . \"But not all the people can find skins.\" So he allowed them to use clay \njars not covered with pitch.","reference":"Sahih al-Bukhari 5593, Book 74, Hadith 19","grade":"","question #":"question #3","question":"What alternatives were provided for containers used in preparing alcoholic drinks according to the Prophet's (ﷺ) guidance?","id":"bukhari-74-149"},{"hadith-eng":"the Prophet (ﷺ) forbade the use of Ad-Dubba' and Al Muzaffat.A'mash also narrated this.","reference":"Sahih al-Bukhari 5594, Book 74, Hadith 20","grade":"","question #":"question #3","question":"How does the prohibition of specific items reflect the broader principles of Islamic dietary or consumption laws?","id":"bukhari-74-150"},{"hadith-eng":"I asked Al-Aswad, \"Did you ask `Aisha, Mother of the Believers, about the containers in which it is \ndisliked to prepare (non-alcoholic) drinks?\" He said, \"Yes, I said to her, 'O Mother of the Believers! \nWhat containers did the Prophet (ﷺ) forbid to use for preparing (non-alcoholic) drinks?\" She said, 'The \nProphet forbade us, (his family), to prepare (nonalcoholic) drinks in Ad-Dubba and Al-Muzaffat.' I \nasked, 'Didn't you mention Al Jar and Al Hantam?' She said, 'I tell what I have heard; shall I tell you \nwhat I have not heard?' \"","reference":"Sahih al-Bukhari 5595, Book 74, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of narrating only what one has directly heard in Islamic tradition?","id":"bukhari-74-151"},{"hadith-eng":"I heard `Abdullah bin Abi `Aufa saying, \"The Prophet (ﷺ) forbade the use of green jars.\" I said, \"Shall we \ndrink out of white jars?\" He said, \"No.\"","reference":"Sahih al-Bukhari 5596, Book 74, Hadith 22","grade":"","question #":"question #3","question":"What might be the reasons behind the specific prohibition of green jars in Islamic tradition?","id":"bukhari-74-152"},{"hadith-eng":"Abu Usaid As Sa`idi invited the Prophet (ﷺ) to his wedding banquet. At that time his wife was serving \nthem and she was the bride. She said, ''Do you know what (kind of syrup) I soaked (made) for Allah's \nApostle? I soaked some dates in water in a Tur (bowl) overnight. '","reference":"Sahih al-Bukhari 5597, Book 74, Hadith 23","grade":"","question #":"question #3","question":"What role did women play in serving guests during social gatherings in early Islamic society?","id":"bukhari-74-153"},{"hadith-eng":"I asked Ibn `Abbas about Al-Badhaq. He said, \"Muhammad prohibited alcoholic drinks before It was \ncalled Al-Badhaq (by saying), 'Any drink that intoxicates is unlawful.' I said, 'What about good lawful \ndrinks?' He said,'Apart from what is lawful and good, all other things are unlawful and not good \n(unclean Al-Khabith).","reference":"Sahih al-Bukhari 5598, Book 74, Hadith 24","grade":"","question #":"question #3","question":"What criteria determine whether a drink is considered unclean or prohibited in Islam?","id":"bukhari-74-154"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things and honey.","reference":"Sahih al-Bukhari 5599, Book 74, Hadith 25","grade":"","question #":"question #3","question":"What can be learned about the dietary habits of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-155"},{"hadith-eng":"While I was serving Abu Talha. Abu Dujana and Abu Suhail bin Al-Baida' with a drink made from a \nmixture of unripe and ripe dates, alcoholic drinks, were made unlawful, whereupon I threw it away, \nand I was their butler and the youngest of them, and we used to consider that drink as an alcoholic \ndrink in those days.","reference":"Sahih al-Bukhari 5600, Book 74, Hadith 26","grade":"","question #":"question #3","question":"What does this narration reveal about the practices and attitudes towards alcohol before its prohibition in Islam?","id":"bukhari-74-156"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of alcoholic drinks prepared from raisins, dates, unripe dates and \nfresh ripe dates.","reference":"Sahih al-Bukhari 5601, Book 74, Hadith 27","grade":"","question #":"question #3","question":"What are the different sources from which alcoholic drinks can be made that are forbidden in Islam?","id":"bukhari-74-157"},{"hadith-eng":"The Prophet (ﷺ) forbade the mixing of ripe and unripe dates and also the mixing of dates and raisins (for \npreparing a syrup) but the syrup of each kind of fruit should be prepared separately. ( One may have \nsuch drinks as long as it is fresh )","reference":"Sahih al-Bukhari 5602, Book 74, Hadith 28","grade":"","question #":"question #3","question":"What are the conditions under which one may consume fruit syrups in Islam?","id":"bukhari-74-158"},{"hadith-eng":"Allah's Messenger (ﷺ) was presented a bowl of milk and a bowl of wine on the night he was taken on a \njourney (Al-Mi'raj).","reference":"Sahih al-Bukhari 5603, Book 74, Hadith 29","grade":"","question #":"question #3","question":"How are symbolic choices used to convey messages in Islamic narratives?","id":"bukhari-74-159"},{"hadith-eng":"The people doubted whether Allah's Messenger (ﷺ) was fasting or the Day of `Arafat or not. So I sent a cup \ncontaining milk to him and he drank it.","reference":"Sahih al-Bukhari 5604, Book 74, Hadith 30","grade":"","question #":"question #3","question":"What is the significance of verifying the fasting status of the Prophet (ﷺ) through a tangible action?","id":"bukhari-74-160"},{"hadith-eng":"Abu Humaid brought a cup of mix from a place called Al-Naqi. Allah's Messenger (ﷺ) said to him, \"Will you \nnot cover it, even by placing a stick across its\"","reference":"Sahih al-Bukhari 5605, Book 74, Hadith 31","grade":"","question #":"question #3","question":"What are some simple methods to cover food and drink as advised in Islamic tradition?","id":"bukhari-74-161"},{"hadith-eng":"Abu Humaid, an Ansari man, came from AnNaqi carrying a cup of milk to the Prophet. The Prophet (ﷺ) \nsaid, \"Will you not cover it even by placing a stick across it?\"","reference":"Sahih al-Bukhari 5606, Book 74, Hadith 32","grade":"","question #":"question #3","question":"What practical steps can be taken to safeguard consumables according to Islamic guidance?","id":"bukhari-74-162"},{"hadith-eng":"The Prophet (ﷺ) came from Mecca with Abu Bakr. Abu Bakr said \"We passed by a shepherd and at that \ntime Allah's Messenger (ﷺ) was thirsty. I milked a little milk in a bowl and Allah's Messenger (ﷺ) drank till I was \npleased. Suraqa bin Ju'shum came to us riding a horse (chasing us). The Prophet (ﷺ) invoked evil upon \nhim, whereupon Suraqa requested him not to invoke evil upon him, in which case he would go back. \nThe Prophet (ﷺ) agreed.","reference":"Sahih al-Bukhari 5607, Book 74, Hadith 33","grade":"","question #":"question #3","question":"What does this incident reveal about the relationship between the Prophet (ﷺ) and his companions during difficult journeys?","id":"bukhari-74-163"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best object of charity is a she-camel which has (newly) given birth and \ngives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its \nmilk by milking one bowl in the morning and one in the evening.\"","reference":"Sahih al-Bukhari 5608, Book 74, Hadith 34","grade":"","question #":"question #3","question":"What are the benefits of giving a she-camel or she-goat in charity for both the giver and the receiver?","id":"bukhari-74-164"},{"hadith-eng":"Allah's Messenger (ﷺ) drank milk and then rinsed his mouth and said, \"It contains fat.\"","reference":"Sahih al-Bukhari 5609, Book 74, Hadith 35","grade":"","question #":"question #3","question":"What can be inferred about the properties of milk from the actions of the Prophet (ﷺ)?","id":"bukhari-74-165"},{"hadith-eng":"I was raised to the Lote Tree and saw four rivers, two of which were coming out and two going in. \nThose which were coming out were the Nile and the Euphrates, and those which were going in were two rivers in paradise. Then I was given three bowls, one containing milk, and another containing honey, and a third containing wine. I took the bowl containing milk and drank it. It was said to me, \"You and your followers will be on the right path (of Islam).\"","reference":"Sahih al-Bukhari 5610, Book 74, Hadith 36","grade":"","question #":"question #3","question":"What is the symbolic meaning of the Prophet choosing the bowl of milk in the vision?","id":"bukhari-74-166"},{"hadith-eng":"Abu Talha had the largest number of datepalms from amongst the Ansars of Medina. The dearest of \nhis property to him was Bairuha garden which was facing the (Prophet's) Mosque. Allah's Messenger (ﷺ) \nused to enter it and drink of its good fresh water. When the Holy Verse:-- 'By no means shall you \nattain righteousness unless you spend (in charity) of that which you love.' (3.92) was revealed, Abu \nTalha got up and said, \"O Allah's Messenger (ﷺ)! Allah says: By no means shall you attain righteousness \nunless you spend of that which you love,' and the dearest of my property to me is the Bairuha garden \nand I want to give it in charity in Allah's Cause, seeking to be rewarded by Allah for that. So you can \nspend it, O Allah's Messenger (ﷺ), where-ever Allah instructs you. ' Allah s Apostle said, \"Good! That is a \nperishable (or profitable) wealth\" (`Abdullah is in doubt as to which word was used.) He said, \"I have \nheard what you have said but in my opinion you'd better give it to your kith and kin.\" On that Abu \nTalha said, \"I will do so, O Allah's Messenger (ﷺ)!\" Abu Talha distributed that garden among his kith and kin \nand cousins.","reference":"Sahih al-Bukhari 5611, Book 74, Hadith 37","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the distribution of charity among relatives?","id":"bukhari-74-167"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) drinking milk. He came to my house and I milked a sheep and then mixed the \nmilk with water from the well for Allah's Messenger (ﷺ). He took the bowl and drank while on his left there \nwas sitting Abu Bakr, and on his right there was a bedouin. He then gave the remaining milk to the \nbedouin and said, \"The right! The right (first).","reference":"Sahih al-Bukhari 5612, Book 74, Hadith 38","grade":"","question #":"question #3","question":"What can be learned about the social interactions and manners of the Prophet Muhammad (ﷺ) from this event?","id":"bukhari-74-168"},{"hadith-eng":"Allah's Messenger (ﷺ) and one of his companions entered upon an Ansari man and the Prophet (ﷺ) said to him, \n\"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting \nour mouth in it.\" The man was watering his garden then. He said, \"O Allah's Messenger (ﷺ)! I have water \nkept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and \nmilked a domestic goat of his in it. Allah's Messenger (ﷺ) drank, and then the man who had come along with \nhim, drank.","reference":"Sahih al-Bukhari 5613, Book 74, Hadith 39","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to simplicity and humility from his willingness to drink water directly from a container?","id":"bukhari-74-169"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things (syrup, etc.) and honey.","reference":"Sahih al-Bukhari 5614, Book 74, Hadith 40","grade":"","question #":"question #3","question":"What can be learned about the dietary habits of the Prophet Muhammad (ﷺ) from his liking for sweet things?","id":"bukhari-74-170"},{"hadith-eng":"Ali came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and \r\nsaid, \"Some people dislike to drink while standing, but I saw the Prophet (ﷺ) doing (drinking water) as \r\nyou have seen me doing now.\"","reference":"Sahih al-Bukhari 5615, Book 74, Hadith 41","grade":"","question #":"question #3","question":"What are the differing opinions among people regarding drinking water while standing, and how are they addressed in Islamic teachings?","id":"bukhari-74-171"},{"hadith-eng":"`Ali offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order \nto deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him \nand he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining \nwater while he was standing. and said, \"Some people dislike to drink water while standing thought the \nProphet did as I have just done.\"","reference":"Sahih al-Bukhari 5616, Book 74, Hadith 42","grade":"","question #":"question #3","question":"How did Ali address the people's affairs between the Zuhr and Asr prayers?","id":"bukhari-74-172"},{"hadith-eng":"The Prophet (ﷺ) drank Zamzam (water) while standing.","reference":"Sahih al-Bukhari 5617, Book 74, Hadith 43","grade":"","question #":"question #3","question":"What are the etiquettes of drinking water according to Islamic teachings?","id":"bukhari-74-173"},{"hadith-eng":"(daughter of Al-Harith) that she sent a bowl of milk to the Prophet (ﷺ) while he was standing (at `Arafat) \nin the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The \nProphet was on the back of his camel.","reference":"Sahih al-Bukhari 5618, Book 74, Hadith 44","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's practices during the pilgrimage from his actions at Arafat?","id":"bukhari-74-174"},{"hadith-eng":"Milk mixed with water was brought to Allah's Messenger (ﷺ) while a bedouin was on his right and Abu Bakr \nwas on his left. He drank (of it) and then gave (it) to the bedouin and said, 'The right\" \"The right \n(first).","reference":"Sahih al-Bukhari 5619, Book 74, Hadith 45","grade":"","question #":"question #3","question":"What can be learned about the distribution of food and drink from the actions of the Prophet Muhammad (ﷺ)?","id":"bukhari-74-175"},{"hadith-eng":"Allah's Messenger (ﷺ) was offered something to drink. He drank of it while on his right was a boy and on his \nleft were some elderly people. He said to the boy, \"May I give these (elderly) people first?\" The boy \nsaid, \"By Allah, O Allah's Messenger (ﷺ)! I will not give up my share from you to somebody else.\" On that \nAllah's Messenger (ﷺ) placed the cup in the hand of that boy.","reference":"Sahih al-Bukhari 5620, Book 74, Hadith 46","grade":"","question #":"question #3","question":"What can be learned about the importance of fulfilling promises and respecting the rights of the young in Islam from this event?","id":"bukhari-74-176"},{"hadith-eng":"The Prophet (ﷺ) and one of his companions entered upon an Ansari man. The Prophet (ﷺ) and his companion \ngreeted (the man) and he replied, \"O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! \nIt is hot,\" while he was watering his garden. The Prophet (ﷺ) asked him, \"If you have water kept overnight \nin a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was \nwatering the garden The man said, \"O Allah's Messenger (ﷺ)! I have water kept overnight in a water-skin. He \nwent to the shade and poured some water into a bowl and milked some milk from a domestic goat in \nit. The Prophet (ﷺ) drank and then gave the bowl to the man who had come along with him to drink.","reference":"Sahih al-Bukhari 5621, Book 74, Hadith 47","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) humility and simplicity from his interaction with the Ansari man?","id":"bukhari-74-177"},{"hadith-eng":"I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the \nyoungest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to \nme), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was \n(made from), He replied, \"(From) ripe dates and unripe dates.\"","reference":"Sahih al-Bukhari 5622, Book 74, Hadith 48","grade":"","question #":"question #3","question":"What ingredients were used in the preparation of alcoholic drinks by the companions before the prohibition?","id":"bukhari-74-178"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When night falls (or when it is evening), stop your children from going out, for \nthe devils spread out at that time. But when an hour of the night has passed, release them and close the \ndoors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin \nand mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover \nthem even by placing something across it, and extinguish your lamps. \"","reference":"Sahih al-Bukhari 5623, Book 74, Hadith 49","grade":"","question #":"question #3","question":"What actions are recommended to ensure safety and protection during the night according to Islamic teachings?","id":"bukhari-74-179"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Extinguish the lamps when you go to bed; close your doors; tie the mouths of \nyour water skins, and cover the food and drinks.\" I think he added, \". . . even with a stick you place \nacross the container.\"","reference":"Sahih al-Bukhari 5624, Book 74, Hadith 50","grade":"","question #":"question #3","question":"What are the recommended practices for handling food and drink containers in Islam?","id":"bukhari-74-180"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the bending of the mouths of water skins for the sake of drinking from them.","reference":"Sahih al-Bukhari 5625, Book 74, Hadith 51","grade":"","question #":"question #3","question":"How does Islamic teaching address the manner in which one should drink water or other beverages?","id":"bukhari-74-181"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) forbidding the drinking of water by bending the mouths of water skins, i.e., \ndrinking from the mouths directly.","reference":"Sahih al-Bukhari 5626, Book 74, Hadith 52","grade":"","question #":"question #3","question":"Why might it be important to follow specific guidelines when consuming food or drink in Islam?","id":"bukhari-74-182"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade drinking directly from the mouth of a water skin or other leather containers. \nand forbade preventing one's neighbor from fixing a peg in (the wall of) one's house.","reference":"Sahih al-Bukhari 5627, Book 74, Hadith 53","grade":"","question #":"question #3","question":"What are the implications of preventing a neighbor from utilizing shared spaces or resources?","id":"bukhari-74-183"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of water directly from the mouth of a water skin .","reference":"Sahih al-Bukhari 5628, Book 74, Hadith 54","grade":"","question #":"question #3","question":"Why might the Prophet (ﷺ) have advised against drinking directly from a water skin?","id":"bukhari-74-184"},{"hadith-eng":"The Prophet (ﷺ) forbade the drinking of water direct from the mouth of a water-skin.","reference":"Sahih al-Bukhari 5629, Book 74, Hadith 55","grade":"","question #":"question #3","question":"How does the prohibition of certain practices reflect the Prophet's concern for the well-being of his followers?","id":"bukhari-74-185"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When you drink (water), do not breath in the vessel; and when you urinate, do \nnot touch your penis with your right hand. And when you cleanse yourself after defecation, do not use \nyour right hand.\"","reference":"Sahih al-Bukhari 5630, Book 74, Hadith 56","grade":"","question #":"question #3","question":"What are the Islamic guidelines for maintaining cleanliness after using the restroom?","id":"bukhari-74-186"},{"hadith-eng":"Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; \nused to take three breaths while drinking.","reference":"Sahih al-Bukhari 5631, Book 74, Hadith 57","grade":"","question #":"question #3","question":"What can be learned from the drinking habits of the Prophet Muhammad (ﷺ) as narrated by his companions?","id":"bukhari-74-187"},{"hadith-eng":"While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver \nvessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he \nhas not stopped using it. The Prophet (ﷺ) forbade us to wear clothes of silk or Dibaj, and to drink in gold \nor silver utensils, and said, 'These things are for them (unbelievers) in this world and for you \n(Muslims) in the Hereafter.' \"","reference":"Sahih al-Bukhari 5632, Book 74, Hadith 58","grade":"","question #":"question #3","question":"What is the significance of adhering to the Prophet's prohibitions in daily life?","id":"bukhari-74-188"},{"hadith-eng":"The Prophet (ﷺ) said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for \nthese things are for them (unbelievers) in this world and for you in the Hereafter.\"","reference":"Sahih al-Bukhari 5633, Book 74, Hadith 59","grade":"","question #":"question #3","question":"What is the significance of distinguishing between the permissible and impermissible in Islam regarding worldly luxuries?","id":"bukhari-74-189"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"He who drinks in silver utensils is only filling his \n`Abdomen with Hell Fire.\"","reference":"Sahih al-Bukhari 5634, Book 74, Hadith 60","grade":"","question #":"question #3","question":"How does the use of certain materials for utensils relate to the concept of punishment in Islam?","id":"bukhari-74-190"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us from seven. He ordered us to visit the \nsick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he \nsays, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help \nothers to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use \nMayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, \nDibaj or Istabraq (two kinds of silk).","reference":"Sahih al-Bukhari 5635, Book 74, Hadith 61","grade":"","question #":"question #3","question":"How does this narration guide Muslims in their social interactions and personal conduct?","id":"bukhari-74-191"},{"hadith-eng":"that the people were in doubt whether the Prophet (ﷺ) was fasting on the Day of `Arafat or not, so a \n(wooden) drinking vessel full of milk was sent to him, and he drank it.","reference":"Sahih al-Bukhari 5636, Book 74, Hadith 62","grade":"","question #":"question #3","question":"What significance does the Day of `Arafat hold in Islamic tradition, and how is it observed?","id":"bukhari-74-192"},{"hadith-eng":"An Arab lady was mentioned to the Prophet (ﷺ) so he asked Abu Usaid As-Sa`idi to send for her, and he \nsent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet (ﷺ) came out and went to \nher and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet (ﷺ) spoke \nto her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said \nto her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Messenger (ﷺ) who has come \nto command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the \nProphet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give \nus water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: \nSahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul \n`Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.","reference":"Sahih al-Bukhari 5637, Book 74, Hadith 63","grade":"","question #":"question #3","question":"What can be learned from the companions' interaction with the Prophet (ﷺ) regarding marriage proposals?","id":"bukhari-74-193"},{"hadith-eng":"I saw the drinking bowl of the Prophet (ﷺ) with Anas bin Malik, and it had been broken, and he had \nmended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \n\"I gave water to the Prophet (ﷺ) in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: \nAround that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but \nAbu Talha said to him, \"Do not change a thing that Allah's Messenger (ﷺ) has made.\" So Anas left it as it \nwas.","reference":"Sahih al-Bukhari 5638, Book 74, Hadith 64","grade":"","question #":"question #3","question":"What can be learned from Abu Talha's advice regarding the alteration of the Prophet's possessions?","id":"bukhari-74-194"},{"hadith-eng":"I was with the Prophet (ﷺ) and the time for the `Asr prayer became due. We had no water with us except a \nlittle which was put in a vessel and was brought to the Prophet (ﷺ) . He put his hand into it and spread out \nhis fingers and then said, \"Come along! Hurry up! All those who want to perform ablution. The \nblessing is from Allah.'' I saw the water gushing out from his fingers. So the people performed the \nablution and drank, and I tried to drink more of that water (beyond my thirst and capacity), for I knew \nthat it was a blessing. The sub-narrator said: I asked Jabir, \"How many persons were you then?\" He \nreplied, \"We were one-thousand four hundred men.\" Salim said: Jabir said, 1500.","reference":"Sahih al-Bukhari 5639, Book 74, Hadith 65","grade":"","question #":"question #3","question":"What role does the Prophet's actions play in providing guidance and reassurance to his followers in times of need?","id":"bukhari-74-195"}]