[{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"No calamity befalls a Muslim but that Allah expiates \nsome of his sins because of it, even though it were the prick he receives from a thorn.\"","reference":"Sahih al-Bukhari 5640, Book 75, Hadith 1","grade":"","question #":"question #1","question":"How does experiencing calamities affect the expiation of sins for a Muslim?","id":"bukhari-75-1"},{"hadith-eng":"The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"","reference":"Sahih al-Bukhari 5641, 5642, Book 75, Hadith 2","grade":"","question #":"question #1","question":"How does experiencing physical or emotional hardships affect a Muslim's sins?","id":"bukhari-75-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"","reference":"Sahih al-Bukhari 5641, 5642, Book 75, Hadith 2","grade":"","question #":"question #1","question":"How does experiencing physical or emotional difficulties impact a Muslim's sins according to Islamic teachings?","id":"bukhari-75-3"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt \nsometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine \ntree which keeps straight till once it is uprooted suddenly.","reference":"Sahih al-Bukhari 5643, Book 75, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of resilience and adaptability in the life of a believer?","id":"bukhari-75-4"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The example of a believer is that of a fresh tender plant; from whatever \ndirection the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. \nSimilarly, a believer is afflicted with calamities (but he remains patient till Allah removes his \ndifficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah \ncuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)","reference":"Sahih al-Bukhari 5644, Book 75, Hadith 4","grade":"","question #":"question #1","question":"How does the metaphor of a tender plant illustrate the resilience and patience of a believer in the face of adversity?","id":"bukhari-75-5"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If Allah wants to do good to somebody, He afflicts him with trials.\"","reference":"Sahih al-Bukhari 5645, Book 75, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of facing trials in one's life according to Islamic teachings?","id":"bukhari-75-6"},{"hadith-eng":"I never saw anybody suffering so much from sickness as Allah's Messenger (ﷺ).","reference":"Sahih al-Bukhari 5646, Book 75, Hadith 6","grade":"","question #":"question #1","question":"How did Aisha describe the severity of the Prophet Muhammad's (ﷺ) illness?","id":"bukhari-75-7"},{"hadith-eng":"I visited the Prophet (ﷺ) during his ailments and he was suffering from a high fever. I said, \"You have a \nhigh fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is \nafflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"","reference":"Sahih al-Bukhari 5647, Book 75, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of enduring illness or suffering in Islam?","id":"bukhari-75-8"},{"hadith-eng":"I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I said, \"O Allah's Messenger (ﷺ)! You \nhave a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you \nwill have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it \nwere the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5648, Book 75, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of enduring suffering or illness in Islam?","id":"bukhari-75-9"},{"hadith-eng":"The Prophet (ﷺ) said, \"Feed the hungry, visit the sick, and set free the captives.\"","reference":"Sahih al-Bukhari 5649, Book 75, Hadith 9","grade":"","question #":"question #1","question":"What are the recommended actions to support and care for those in need according to Islamic teachings?","id":"bukhari-75-10"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do seven other things. He forbade us \nto wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral \nprocessions, visit the sick and greet everybody. (See Hadith No. 104)","reference":"Sahih al-Bukhari 5650, Book 75, Hadith 10","grade":"","question #":"question #1","question":"What are the seven things that Muslims are forbidden from using or wearing according to Islamic teachings?","id":"bukhari-75-11"},{"hadith-eng":"Once I fell ill. The Prophet (ﷺ) and Abu Bakr came walking to pay me a visit and found me unconscious. \nThe Prophet (ﷺ) performed ablution and then poured the remaining water on me, and I came to my senses \nto see the Prophet. I said, \"O Allah's Messenger (ﷺ)! What shall I do with my property? How shall I dispose \nof (distribute) my property?\" He did not reply till the Verse of inheritance was revealed.","reference":"Sahih al-Bukhari 5651, Book 75, Hadith 11","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take when visiting a sick person according to this narration?","id":"bukhari-75-12"},{"hadith-eng":"Ibn `Abbas said to me, \"Shall I show you a woman of the people of Paradise?\" I said, \"Yes.\" He said, \n\"This black lady came to the Prophet (ﷺ) and said, 'I get attacks of epilepsy and my body becomes \nuncovered; please invoke Allah for me.' The Prophet (ﷺ) said (to her), 'If you wish, be patient and you will \nhave (enter) Paradise; and if you wish, I will invoke Allah to cure you.' She said, 'I will remain \npatient,' and added, 'but I become uncovered, so please invoke Allah for me that I may not become \nuncovered.' So he invoked Allah for her.\"Narrated 'Ata:That he had seen Um Zafar, the tall black lady, at (holding) the curtain of the Ka`ba.","reference":"Sahih al-Bukhari 5652, Book 75, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of patience in the face of personal trials and its reward in Islam?","id":"bukhari-75-13"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his \neyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"","reference":"Sahih al-Bukhari 5653, Book 75, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of patience in Islam when facing personal hardships or losses?","id":"bukhari-75-14"},{"hadith-eng":"When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal got a fever. I entered upon them and \nasked, \"O my father! How are you? O Bilal! How are you?\" Whenever fever attacked Abu Bakr, he \nwould recite the following poetic verses: 'Everybody is staying alive among his people, yet death is \nnearer to him than his shoe laces.\" And whenever the fever deserted Bilal, he would recite (two poetic \nlines): 'Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and \nJalil (two kinds of good smelling grass). Would that one day I would drink of the water of Majinna \nand would that Shama and Tafil (two mountains at Mecca) would appear to me.' Then I came and \ninformed Allah's Messenger (ﷺ) about that, whereupon he said, \"O Allah! Make us love Medina as much or \nmore than we love Mecca. O Allah! Make it healthy and bless its Mudd and Sa for us, and take away \nits fever and put it in Al Juhfa.\"","reference":"Sahih al-Bukhari 5654, Book 75, Hadith 14","grade":"","question #":"question #1","question":"What challenges did the early Muslims face upon emigrating to Medina?","id":"bukhari-75-15"},{"hadith-eng":"Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet (ﷺ) a daughter of the \nProphet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet (ﷺ) sent \nher his greetings and added \"It is for Allah what He takes, and what He gives; and everything before \nHis sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again \nsent a message, beseeching him by Allah, to come. So the Prophet (ﷺ) got up. and so did we (and went \nthere). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of \nthe Prophet. Sa`d said to him, \"What is this, O Allah's Messenger (ﷺ)?\" He said. \"This Is Mercy which Allah \nhas embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His \nMercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)","reference":"Sahih al-Bukhari 5655, Book 75, Hadith 15","grade":"","question #":"question #1","question":"How does Islam view the concept of patience and hope in times of personal loss?","id":"bukhari-75-16"},{"hadith-eng":"The Prophet (ﷺ) went to visit a sick bedouin. Whenever the Prophet (ﷺ) went to a patient, he used to say to \nhim, \"Don't worry, if Allah will, it will be expiation (for your sins):\" The bedouin said, \"You say \nexpiation? No, it is but a fever that is boiling or harassing an old man and will lead him to his grave \nwithout his will.\" The Prophet (ﷺ) said, \"Then, yes, it is so.\"","reference":"Sahih al-Bukhari 5656, Book 75, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of visiting the sick in Islam and what supplications are recommended during such visits?","id":"bukhari-75-17"},{"hadith-eng":"A Jewish boy used to serve the Prophet (ﷺ) and became ill. The Prophet (ﷺ) went to pay him a visit and said \nto him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his \ndeathbed, the Prophet (ﷺ) visited him.","reference":"Sahih al-Bukhari 5657, Book 75, Hadith 17","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take when visiting a sick person, and what can be learned from this behavior?","id":"bukhari-75-18"},{"hadith-eng":"During the ailment of the Prophet (ﷺ) some people came to visits him. He led them in prayer while sitting. \nbut they prayed standing, so he waved to them to sit down. When he had finished the prayer, he said, \n\"An Imam is to be followed, so when he bows, you should bow. and when he raises his head, you \nshould raise yours, and if he prays sitting. you should pray sitting.\" Abu `Abdullah said Al-Humaidi \nsaid, (The order of ) \"This narration has been abrogated by the last action of the Prophet (ﷺ) as he led the \nprayer sitting, while the people prayed standing behind him.'","reference":"Sahih al-Bukhari 5658, Book 75, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of following the Imam during prayer in Islam?","id":"bukhari-75-19"},{"hadith-eng":"I became seriously ill at Mecca and the Prophet (ﷺ) came to visit me. I said, \"O Allah's Messenger (ﷺ)! I shall \nleave behind me a good fortune, but my heir is my only daughter; shall I bequeath two third of my \nproperty to be spent in charity and leave one third (for my heir)?\" He said, \"No.\" I said, \"Shall I \nbequeath half and leave half?\" He said, \"No.\" I said, \"Shall I bequeath one third and leave two thirds?\" \nHe said, \"One third is alright, though even one third is too much.\" Then he placed his hand on his \nforehead and passed it over my face and `Abdomen and said, \"O Allah! Cure Sa`d and complete his \nemigration.\" I feel as if I have been feeling the coldness of his hand on my liver ever since.","reference":"Sahih al-Bukhari 5659, Book 75, Hadith 19","grade":"","question #":"question #1","question":"What is the Islamic perspective on the distribution of wealth in a will when there is only one heir?","id":"bukhari-75-20"},{"hadith-eng":"I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I touched him with my hand and \nsaid, \"O Allah's Messenger (ﷺ)! You have a high fever.\" Allah's Messenger (ﷺ) said, \"Yes, I have as much fever as \ntwo men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Messenger (ﷺ) said, \"Yes, \nno Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will \nremove his sins for him as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5660, Book 75, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of enduring illness or hardship in Islam?","id":"bukhari-75-21"},{"hadith-eng":"I visited the Prophet (ﷺ) during his illness and touched him while he was having a fever. I said to him, \n\"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is \nafflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"","reference":"Sahih al-Bukhari 5661, Book 75, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of enduring illness or harm in Islam in terms of spiritual reward?","id":"bukhari-75-22"},{"hadith-eng":"Allah's Messenger (ﷺ) entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, \n(your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling \nwithin an old man and will send him to his grave.\" On that, the Prophet (ﷺ) said, \"Then yes, it is so.\"","reference":"Sahih al-Bukhari 5662, Book 75, Hadith 22","grade":"","question #":"question #1","question":"How can illness serve as an expiation for sins in Islamic teachings?","id":"bukhari-75-23"},{"hadith-eng":"The Prophet (ﷺ) rode a donkey having a saddle with a Fadakiyya velvet covering. He mounted me behind \nhim and went to visit Sa`d bin 'Ubada, and that had been before the battle of Badr. The Prophet (ﷺ) \nproceeded till he passed by a gathering in which `Abdullah bin Ubai bin Salul was present, and that \nhad been before `Abdullah embraced Islam. The gathering comprised of Muslims, polytheists, i.e., \nisolators and Jews. `Abdullah bin Rawaha was also present in that gathering. When dust raised by the \ndonkey covered the gathering, `Abdullah bin Ubai covered his nose with his upper garment and said, \n\"Do not trouble us with dust.\" The Prophet (ﷺ) greeted them, stopped and dismounted. Then he invited \nthem to Allah (i.e., to embrace Islam) and recited to them some verses of the Holy Qur'an. On that, \n`Abdullah bin Ubai said, \"O man ! There is nothing better than what you say if it is true. Do not \ntrouble us with it in our gathering, but return to your house, and if somebody comes to you, teach him \nthere.\" On that `Abdullah bin Rawaha said, Yes, O Allah's Messenger (ﷺ)! Bring your teachings to our \ngathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing each other till \nthey were about to fight. The Prophet (ﷺ) kept on quietening them till they became calm. Thereupon the \nProphet mounted his animal and proceeded till he entered upon Sa`d bin Ubada. He said to him \"O \nSa`d! Have you not heard what Abu Hubab (i.e., `Abdullah bin Ubai) said?\" Sa`d said, 'O Allah's \nApostle! Excuse and forgive him, for Allah has given you what He has given you. The people of this \ntown (Medina decided unanimously to crown him and make him their chief by placing a turban on his \nhead, but when that was prevented by the Truth which Allah had given you he (`Abdullah bin Ubai) \nwas grieved out of jealously, and that was the reason which caused him to behave in the way you have \nseen.\"","reference":"Sahih al-Bukhari 5663, Book 75, Hadith 23","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle opposition and criticism when inviting others to Islam?","id":"bukhari-75-24"},{"hadith-eng":"The Prophet (ﷺ) came to visit me (while I was sick) and he was riding neither a mule, nor a horse.","reference":"Sahih al-Bukhari 5664, Book 75, Hadith 24","grade":"","question #":"question #1","question":"What does the mode of transportation used by the Prophet (ﷺ) during his visit signify about his lifestyle?","id":"bukhari-75-25"},{"hadith-eng":"The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of \nyour head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make \nexpiation for that.\"","reference":"Sahih al-Bukhari 5665, Book 75, Hadith 25","grade":"","question #":"question #1","question":"What actions should be taken if someone is troubled by lice during a religious obligation?","id":"bukhari-75-26"},{"hadith-eng":"`Aisha, (complaining of headache) said, \"Oh, my head\"! Allah's Messenger (ﷺ) said, \"I wish that had \nhappened while I was still living, for then I would ask Allah's Forgiveness for you and invoke Allah \nfor you.\" Aisha said, \"Wa thuklayah! By Allah, I think you want me to die; and If this should happen, \nyou would spend the last part of the day sleeping with one of your wives!\" The Prophet (ﷺ) said, \"Nay, I \nshould say, 'Oh my head!' I felt like sending for Abu Bakr and his son, and appoint him as my \nsuccessor lest some people claimed something or some others wished something, but then I said (to \nmyself), 'Allah would not allow it to be otherwise, and the Muslims would prevent it to be otherwise\".","reference":"Sahih al-Bukhari 5666, Book 75, Hadith 26","grade":"","question #":"question #1","question":"What does this narration reveal about the relationship between the Prophet Muhammad (ﷺ) and Aisha?","id":"bukhari-75-27"},{"hadith-eng":"I visited the Prophet (ﷺ) while he was having a high fever. I touched him an said, \"You have a very high \nfever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double \nreward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other \ninconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5667, Book 75, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of enduring illness or hardship in Islam?","id":"bukhari-75-28"},{"hadith-eng":"Allah's Messenger (ﷺ) came to visit me during my ailment which had been aggravated during Hajjat-al- \nWada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only \ndaughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He \nsaid, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better \nthan to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall \nget a reward for it, even for what you put in the mouth of your wife.\"","reference":"Sahih al-Bukhari 5668, Book 75, Hadith 28","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the distribution of wealth and inheritance?","id":"bukhari-75-29"},{"hadith-eng":"When Allah's Messenger (ﷺ) was on his death-bed and in the house there were some people among whom \nwas `Umar bin Al-Khattab, the Prophet (ﷺ) said, \"Come, let me write for you a statement after which you \nwill not go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill and you have the Qur'an; so the Book of \nAllah is enough for us.\" The people present in the house differed and quarrelled. Some said \"Go near \nso that the Prophet (ﷺ) may write for you a statement after which you will not go astray,\" while the others \nsaid as `Umar said. When they caused a hue and cry before the Prophet, Allah's Messenger (ﷺ) said, \"Go \naway!\" Narrated 'Ubaidullah: Ibn `Abbas used to say, \"It was very unfortunate that Allah's Messenger (ﷺ) \nwas prevented from writing that statement for them because of their disagreement and noise.\"","reference":"Sahih al-Bukhari 5669, Book 75, Hadith 29","grade":"","question #":"question #1","question":"What was the significance of the statement the Prophet (ﷺ) intended to write before his passing?","id":"bukhari-75-30"},{"hadith-eng":"My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is- ill.\" The Prophet (ﷺ) \ntouched my head with his hand and invoked Allah to bless me. He then performed ablution and I \ndrank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- \nNubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.","reference":"Sahih al-Bukhari 5670, Book 75, Hadith 30","grade":"","question #":"question #1","question":"What significance does the Seal of Prophethood hold in Islamic tradition?","id":"bukhari-75-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he \nhas to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let \nme die if death is better for me.' \"","reference":"Sahih al-Bukhari 5671, Book 75, Hadith 31","grade":"","question #":"question #1","question":"What guidance does Islam provide for dealing with calamities and hardships in life?","id":"bukhari-75-32"},{"hadith-eng":"We went to pay a visit to Khabbab (who was sick) and he had been branded (cauterized) at seven \nplaces in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this \nworld) without having their rewards reduced through enjoying the pleasures of this life, but we have \ngot (so much) wealth that we find no way to spend It except on the construction of buildings Had the \nProphet not forbidden us to wish for death, I would have wished for it.' We visited him for the second \ntime while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he \nspends except for something that he spends on building.\"","reference":"Sahih al-Bukhari 5672, Book 75, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of spending wealth in Islam, and how does it relate to rewards in the Hereafter?","id":"bukhari-75-33"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"The good deeds of any person will not make him enter Paradise.\" \n(i.e., None can enter Paradise through his good deeds.) They (the Prophet's companions) said, 'Not \neven you, O Allah's Messenger (ﷺ)?' He said, \"Not even myself, unless Allah bestows His favor and mercy \non me.\" So be moderate in your religious deeds and do the deeds that are within your ability: and none \nof you should wish for death, for if he is a good doer, he may increase his good deeds, and if he is an \nevil doer, he may repent to Allah.\"","reference":"Sahih al-Bukhari 5673, Book 75, Hadith 33","grade":"","question #":"question #1","question":"Why is it emphasized that good deeds alone are not sufficient for entering Paradise?","id":"bukhari-75-34"},{"hadith-eng":"I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your \nMercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)","reference":"Sahih al-Bukhari 5674, Book 75, Hadith 34","grade":"","question #":"question #1","question":"What is the significance of seeking Allah's mercy and forgiveness in Islam?","id":"bukhari-75-35"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke \nAllah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who \ncures. There is no cure but Yours, a cure that leaves no disease.\"","reference":"Sahih al-Bukhari 5675, Book 75, Hadith 35","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) make when visiting a sick person?","id":"bukhari-75-36"},{"hadith-eng":"The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me \n(or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or \nfather to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed.","reference":"Sahih al-Bukhari 5676, Book 75, Hadith 36","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take when visiting someone who was ill?","id":"bukhari-75-37"},{"hadith-eng":"When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal had a fever. I entered upon them and \nsaid, \"O my father! How are you? O Bilal! How are you?\" Whenever Abu Bakr got the fever he used \nto say, \"Everybody is staying alive with his people, yet death is nearer to him than his shoe laces.\" \nAnd when fever deserted Bilal, he would recite (two poetic verses): \"Would that I could stay \novernight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling \ngrass). Would that one day I could drink of the water of Majinna, and would that Shama and Tafil \n(two mountains at Mecca) would appear to me!\" I went to Allah's Messenger (ﷺ) and informed him about \nthat. He said, \"O Allah! Make us love Medina as much or more than we love Mecca, and make it \nhealthy, and bless its Sa and its Mudd, and take away its fever and put it in Al-Juhfa.\" (See Hadith No \n558) .","reference":"Sahih al-Bukhari 5677, Book 75, Hadith 37","grade":"","question #":"question #1","question":"What was the reaction of Abu Bakr and Bilal to the fever they experienced in Medina?","id":"bukhari-75-38"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"No calamity befalls a Muslim but that Allah expiates \nsome of his sins because of it, even though it were the prick he receives from a thorn.\"","reference":"Sahih al-Bukhari 5640, Book 75, Hadith 1","grade":"","question #":"question #2","question":"What is the significance of enduring minor hardships, like a thorn prick, in the context of sin expiation?","id":"bukhari-75-39"},{"hadith-eng":"The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"","reference":"Sahih al-Bukhari 5641, 5642, Book 75, Hadith 2","grade":"","question #":"question #2","question":"What is the significance of minor afflictions, like a thorn prick, in the context of sin expiation?","id":"bukhari-75-40"},{"hadith-eng":"The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"","reference":"Sahih al-Bukhari 5641, 5642, Book 75, Hadith 2","grade":"","question #":"question #2","question":"What is the significance of minor afflictions, such as a thorn prick, in the context of spiritual purification?","id":"bukhari-75-41"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt \nsometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine \ntree which keeps straight till once it is uprooted suddenly.","reference":"Sahih al-Bukhari 5643, Book 75, Hadith 3","grade":"","question #":"question #2","question":"How does the behavior of a hypocrite differ from that of a believer in terms of stability and change?","id":"bukhari-75-42"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The example of a believer is that of a fresh tender plant; from whatever \ndirection the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. \nSimilarly, a believer is afflicted with calamities (but he remains patient till Allah removes his \ndifficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah \ncuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)","reference":"Sahih al-Bukhari 5644, Book 75, Hadith 4","grade":"","question #":"question #2","question":"What characteristics differentiate a believer from an impious person according to the metaphor used in the narration?","id":"bukhari-75-43"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If Allah wants to do good to somebody, He afflicts him with trials.\"","reference":"Sahih al-Bukhari 5645, Book 75, Hadith 5","grade":"","question #":"question #2","question":"How can trials be perceived as a form of goodness from Allah?","id":"bukhari-75-44"},{"hadith-eng":"I never saw anybody suffering so much from sickness as Allah's Messenger (ﷺ).","reference":"Sahih al-Bukhari 5646, Book 75, Hadith 6","grade":"","question #":"question #2","question":"What can be inferred about the Prophet Muhammad's (ﷺ) endurance during times of sickness?","id":"bukhari-75-45"},{"hadith-eng":"I visited the Prophet (ﷺ) during his ailments and he was suffering from a high fever. I said, \"You have a \nhigh fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is \nafflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"","reference":"Sahih al-Bukhari 5647, Book 75, Hadith 7","grade":"","question #":"question #2","question":"How does experiencing harm or affliction relate to the concept of sin removal in Islamic teachings?","id":"bukhari-75-46"},{"hadith-eng":"I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I said, \"O Allah's Messenger (ﷺ)! You \nhave a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you \nwill have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it \nwere the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5648, Book 75, Hadith 8","grade":"","question #":"question #2","question":"How does experiencing physical pain or harm relate to the expiation of sins in Islamic teachings?","id":"bukhari-75-47"},{"hadith-eng":"The Prophet (ﷺ) said, \"Feed the hungry, visit the sick, and set free the captives.\"","reference":"Sahih al-Bukhari 5649, Book 75, Hadith 9","grade":"","question #":"question #2","question":"How does Islam emphasize the importance of visiting the sick and providing for the hungry?","id":"bukhari-75-48"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do seven other things. He forbade us \nto wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral \nprocessions, visit the sick and greet everybody. (See Hadith No. 104)","reference":"Sahih al-Bukhari 5650, Book 75, Hadith 10","grade":"","question #":"question #2","question":"What are the recommended actions for Muslims to perform in their community as instructed by the Prophet Muhammad (ﷺ)?","id":"bukhari-75-49"},{"hadith-eng":"Once I fell ill. The Prophet (ﷺ) and Abu Bakr came walking to pay me a visit and found me unconscious. \nThe Prophet (ﷺ) performed ablution and then poured the remaining water on me, and I came to my senses \nto see the Prophet. I said, \"O Allah's Messenger (ﷺ)! What shall I do with my property? How shall I dispose \nof (distribute) my property?\" He did not reply till the Verse of inheritance was revealed.","reference":"Sahih al-Bukhari 5651, Book 75, Hadith 11","grade":"","question #":"question #2","question":"How did the revelation of the Verse of inheritance influence decisions regarding property distribution?","id":"bukhari-75-50"},{"hadith-eng":"Ibn `Abbas said to me, \"Shall I show you a woman of the people of Paradise?\" I said, \"Yes.\" He said, \n\"This black lady came to the Prophet (ﷺ) and said, 'I get attacks of epilepsy and my body becomes \nuncovered; please invoke Allah for me.' The Prophet (ﷺ) said (to her), 'If you wish, be patient and you will \nhave (enter) Paradise; and if you wish, I will invoke Allah to cure you.' She said, 'I will remain \npatient,' and added, 'but I become uncovered, so please invoke Allah for me that I may not become \nuncovered.' So he invoked Allah for her.\"Narrated 'Ata:That he had seen Um Zafar, the tall black lady, at (holding) the curtain of the Ka`ba.","reference":"Sahih al-Bukhari 5652, Book 75, Hadith 12","grade":"","question #":"question #2","question":"How does the concept of modesty play a role in the life of a believer facing health challenges?","id":"bukhari-75-51"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his \neyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"","reference":"Sahih al-Bukhari 5653, Book 75, Hadith 13","grade":"","question #":"question #2","question":"How does Islam view the concept of compensation for enduring trials with patience?","id":"bukhari-75-52"},{"hadith-eng":"When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal got a fever. I entered upon them and \nasked, \"O my father! How are you? O Bilal! How are you?\" Whenever fever attacked Abu Bakr, he \nwould recite the following poetic verses: 'Everybody is staying alive among his people, yet death is \nnearer to him than his shoe laces.\" And whenever the fever deserted Bilal, he would recite (two poetic \nlines): 'Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and \nJalil (two kinds of good smelling grass). Would that one day I would drink of the water of Majinna \nand would that Shama and Tafil (two mountains at Mecca) would appear to me.' Then I came and \ninformed Allah's Messenger (ﷺ) about that, whereupon he said, \"O Allah! Make us love Medina as much or \nmore than we love Mecca. O Allah! Make it healthy and bless its Mudd and Sa for us, and take away \nits fever and put it in Al Juhfa.\"","reference":"Sahih al-Bukhari 5654, Book 75, Hadith 14","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) pray for the well-being of Medina and its inhabitants?","id":"bukhari-75-53"},{"hadith-eng":"Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet (ﷺ) a daughter of the \nProphet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet (ﷺ) sent \nher his greetings and added \"It is for Allah what He takes, and what He gives; and everything before \nHis sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again \nsent a message, beseeching him by Allah, to come. So the Prophet (ﷺ) got up. and so did we (and went \nthere). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of \nthe Prophet. Sa`d said to him, \"What is this, O Allah's Messenger (ﷺ)?\" He said. \"This Is Mercy which Allah \nhas embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His \nMercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)","reference":"Sahih al-Bukhari 5655, Book 75, Hadith 15","grade":"","question #":"question #2","question":"What is the significance of showing mercy and compassion according to Islamic teachings?","id":"bukhari-75-54"},{"hadith-eng":"The Prophet (ﷺ) went to visit a sick bedouin. Whenever the Prophet (ﷺ) went to a patient, he used to say to \nhim, \"Don't worry, if Allah will, it will be expiation (for your sins):\" The bedouin said, \"You say \nexpiation? No, it is but a fever that is boiling or harassing an old man and will lead him to his grave \nwithout his will.\" The Prophet (ﷺ) said, \"Then, yes, it is so.\"","reference":"Sahih al-Bukhari 5656, Book 75, Hadith 16","grade":"","question #":"question #2","question":"How does illness serve as an expiation for sins according to Islamic teachings?","id":"bukhari-75-55"},{"hadith-eng":"A Jewish boy used to serve the Prophet (ﷺ) and became ill. The Prophet (ﷺ) went to pay him a visit and said \nto him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his \ndeathbed, the Prophet (ﷺ) visited him.","reference":"Sahih al-Bukhari 5657, Book 75, Hadith 17","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) encourage others to embrace Islam, and what was the outcome in this instance?","id":"bukhari-75-56"},{"hadith-eng":"During the ailment of the Prophet (ﷺ) some people came to visits him. He led them in prayer while sitting. \nbut they prayed standing, so he waved to them to sit down. When he had finished the prayer, he said, \n\"An Imam is to be followed, so when he bows, you should bow. and when he raises his head, you \nshould raise yours, and if he prays sitting. you should pray sitting.\" Abu `Abdullah said Al-Humaidi \nsaid, (The order of ) \"This narration has been abrogated by the last action of the Prophet (ﷺ) as he led the \nprayer sitting, while the people prayed standing behind him.'","reference":"Sahih al-Bukhari 5658, Book 75, Hadith 18","grade":"","question #":"question #2","question":"How should the congregation adjust their prayer if the Imam is praying while sitting?","id":"bukhari-75-57"},{"hadith-eng":"I became seriously ill at Mecca and the Prophet (ﷺ) came to visit me. I said, \"O Allah's Messenger (ﷺ)! I shall \nleave behind me a good fortune, but my heir is my only daughter; shall I bequeath two third of my \nproperty to be spent in charity and leave one third (for my heir)?\" He said, \"No.\" I said, \"Shall I \nbequeath half and leave half?\" He said, \"No.\" I said, \"Shall I bequeath one third and leave two thirds?\" \nHe said, \"One third is alright, though even one third is too much.\" Then he placed his hand on his \nforehead and passed it over my face and `Abdomen and said, \"O Allah! Cure Sa`d and complete his \nemigration.\" I feel as if I have been feeling the coldness of his hand on my liver ever since.","reference":"Sahih al-Bukhari 5659, Book 75, Hadith 19","grade":"","question #":"question #2","question":"How does Islam guide the allocation of wealth for charity in a will?","id":"bukhari-75-58"},{"hadith-eng":"I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I touched him with my hand and \nsaid, \"O Allah's Messenger (ﷺ)! You have a high fever.\" Allah's Messenger (ﷺ) said, \"Yes, I have as much fever as \ntwo men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Messenger (ﷺ) said, \"Yes, \nno Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will \nremove his sins for him as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5660, Book 75, Hadith 20","grade":"","question #":"question #2","question":"How does experiencing physical suffering relate to the concept of sin expiation in Islamic teachings?","id":"bukhari-75-59"},{"hadith-eng":"I visited the Prophet (ﷺ) during his illness and touched him while he was having a fever. I said to him, \n\"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is \nafflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"","reference":"Sahih al-Bukhari 5661, Book 75, Hadith 21","grade":"","question #":"question #2","question":"How does experiencing physical ailments relate to the concept of sin expiation in Islamic teachings?","id":"bukhari-75-60"},{"hadith-eng":"Allah's Messenger (ﷺ) entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, \n(your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling \nwithin an old man and will send him to his grave.\" On that, the Prophet (ﷺ) said, \"Then yes, it is so.\"","reference":"Sahih al-Bukhari 5662, Book 75, Hadith 22","grade":"","question #":"question #2","question":"What is the significance of a positive attitude towards illness in Islam?","id":"bukhari-75-61"},{"hadith-eng":"The Prophet (ﷺ) rode a donkey having a saddle with a Fadakiyya velvet covering. He mounted me behind \nhim and went to visit Sa`d bin 'Ubada, and that had been before the battle of Badr. The Prophet (ﷺ) \nproceeded till he passed by a gathering in which `Abdullah bin Ubai bin Salul was present, and that \nhad been before `Abdullah embraced Islam. The gathering comprised of Muslims, polytheists, i.e., \nisolators and Jews. `Abdullah bin Rawaha was also present in that gathering. When dust raised by the \ndonkey covered the gathering, `Abdullah bin Ubai covered his nose with his upper garment and said, \n\"Do not trouble us with dust.\" The Prophet (ﷺ) greeted them, stopped and dismounted. Then he invited \nthem to Allah (i.e., to embrace Islam) and recited to them some verses of the Holy Qur'an. On that, \n`Abdullah bin Ubai said, \"O man ! There is nothing better than what you say if it is true. Do not \ntrouble us with it in our gathering, but return to your house, and if somebody comes to you, teach him \nthere.\" On that `Abdullah bin Rawaha said, Yes, O Allah's Messenger (ﷺ)! Bring your teachings to our \ngathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing each other till \nthey were about to fight. The Prophet (ﷺ) kept on quietening them till they became calm. Thereupon the \nProphet mounted his animal and proceeded till he entered upon Sa`d bin Ubada. He said to him \"O \nSa`d! Have you not heard what Abu Hubab (i.e., `Abdullah bin Ubai) said?\" Sa`d said, 'O Allah's \nApostle! Excuse and forgive him, for Allah has given you what He has given you. The people of this \ntown (Medina decided unanimously to crown him and make him their chief by placing a turban on his \nhead, but when that was prevented by the Truth which Allah had given you he (`Abdullah bin Ubai) \nwas grieved out of jealously, and that was the reason which caused him to behave in the way you have \nseen.\"","reference":"Sahih al-Bukhari 5663, Book 75, Hadith 23","grade":"","question #":"question #2","question":"What was the reaction of different groups present when the Prophet (ﷺ) invited them to Islam?","id":"bukhari-75-62"},{"hadith-eng":"The Prophet (ﷺ) came to visit me (while I was sick) and he was riding neither a mule, nor a horse.","reference":"Sahih al-Bukhari 5664, Book 75, Hadith 24","grade":"","question #":"question #2","question":"How does the Prophet's (ﷺ) act of visiting a sick person reflect on the importance of community care in Islam?","id":"bukhari-75-63"},{"hadith-eng":"The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of \nyour head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make \nexpiation for that.\"","reference":"Sahih al-Bukhari 5665, Book 75, Hadith 25","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address personal hygiene issues among his companions?","id":"bukhari-75-64"},{"hadith-eng":"`Aisha, (complaining of headache) said, \"Oh, my head\"! Allah's Messenger (ﷺ) said, \"I wish that had \nhappened while I was still living, for then I would ask Allah's Forgiveness for you and invoke Allah \nfor you.\" Aisha said, \"Wa thuklayah! By Allah, I think you want me to die; and If this should happen, \nyou would spend the last part of the day sleeping with one of your wives!\" The Prophet (ﷺ) said, \"Nay, I \nshould say, 'Oh my head!' I felt like sending for Abu Bakr and his son, and appoint him as my \nsuccessor lest some people claimed something or some others wished something, but then I said (to \nmyself), 'Allah would not allow it to be otherwise, and the Muslims would prevent it to be otherwise\".","reference":"Sahih al-Bukhari 5666, Book 75, Hadith 26","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) express his concern for the future leadership of the Muslim community?","id":"bukhari-75-65"},{"hadith-eng":"I visited the Prophet (ﷺ) while he was having a high fever. I touched him an said, \"You have a very high \nfever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double \nreward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other \ninconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5667, Book 75, Hadith 27","grade":"","question #":"question #2","question":"How does experiencing physical ailments relate to the concept of sin expiation in Islamic teachings?","id":"bukhari-75-66"},{"hadith-eng":"Allah's Messenger (ﷺ) came to visit me during my ailment which had been aggravated during Hajjat-al- \nWada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only \ndaughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He \nsaid, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better \nthan to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall \nget a reward for it, even for what you put in the mouth of your wife.\"","reference":"Sahih al-Bukhari 5668, Book 75, Hadith 28","grade":"","question #":"question #2","question":"Why is it considered better to leave one's heirs financially secure rather than giving away most of one's wealth in charity?","id":"bukhari-75-67"},{"hadith-eng":"When Allah's Messenger (ﷺ) was on his death-bed and in the house there were some people among whom \nwas `Umar bin Al-Khattab, the Prophet (ﷺ) said, \"Come, let me write for you a statement after which you \nwill not go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill and you have the Qur'an; so the Book of \nAllah is enough for us.\" The people present in the house differed and quarrelled. Some said \"Go near \nso that the Prophet (ﷺ) may write for you a statement after which you will not go astray,\" while the others \nsaid as `Umar said. When they caused a hue and cry before the Prophet, Allah's Messenger (ﷺ) said, \"Go \naway!\" Narrated 'Ubaidullah: Ibn `Abbas used to say, \"It was very unfortunate that Allah's Messenger (ﷺ) \nwas prevented from writing that statement for them because of their disagreement and noise.\"","reference":"Sahih al-Bukhari 5669, Book 75, Hadith 29","grade":"","question #":"question #2","question":"How did the companions react to the Prophet's (ﷺ) request to write a statement, and what was the outcome?","id":"bukhari-75-68"},{"hadith-eng":"My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is- ill.\" The Prophet (ﷺ) \ntouched my head with his hand and invoked Allah to bless me. He then performed ablution and I \ndrank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- \nNubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.","reference":"Sahih al-Bukhari 5670, Book 75, Hadith 30","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his compassion and care for the sick?","id":"bukhari-75-69"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he \nhas to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let \nme die if death is better for me.' \"","reference":"Sahih al-Bukhari 5671, Book 75, Hadith 31","grade":"","question #":"question #2","question":"How should a person approach the concept of life and death in times of distress according to Islamic teachings?","id":"bukhari-75-70"},{"hadith-eng":"We went to pay a visit to Khabbab (who was sick) and he had been branded (cauterized) at seven \nplaces in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this \nworld) without having their rewards reduced through enjoying the pleasures of this life, but we have \ngot (so much) wealth that we find no way to spend It except on the construction of buildings Had the \nProphet not forbidden us to wish for death, I would have wished for it.' We visited him for the second \ntime while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he \nspends except for something that he spends on building.\"","reference":"Sahih al-Bukhari 5672, Book 75, Hadith 32","grade":"","question #":"question #2","question":"Why might a Muslim be discouraged from wishing for death, according to Islamic teachings?","id":"bukhari-75-71"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"The good deeds of any person will not make him enter Paradise.\" \n(i.e., None can enter Paradise through his good deeds.) They (the Prophet's companions) said, 'Not \neven you, O Allah's Messenger (ﷺ)?' He said, \"Not even myself, unless Allah bestows His favor and mercy \non me.\" So be moderate in your religious deeds and do the deeds that are within your ability: and none \nof you should wish for death, for if he is a good doer, he may increase his good deeds, and if he is an \nevil doer, he may repent to Allah.\"","reference":"Sahih al-Bukhari 5673, Book 75, Hadith 33","grade":"","question #":"question #2","question":"What is the significance of Allah's favor and mercy in attaining Paradise?","id":"bukhari-75-72"},{"hadith-eng":"I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your \nMercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)","reference":"Sahih al-Bukhari 5674, Book 75, Hadith 34","grade":"","question #":"question #2","question":"How does the concept of joining the highest companions in Paradise relate to Islamic teachings?","id":"bukhari-75-73"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke \nAllah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who \ncures. There is no cure but Yours, a cure that leaves no disease.\"","reference":"Sahih al-Bukhari 5675, Book 75, Hadith 35","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) emphasize the belief in Allah as the ultimate healer?","id":"bukhari-75-74"},{"hadith-eng":"The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me \n(or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or \nfather to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed.","reference":"Sahih al-Bukhari 5676, Book 75, Hadith 36","grade":"","question #":"question #2","question":"How did the revelation of the inheritance verse come about according to this narration?","id":"bukhari-75-75"},{"hadith-eng":"When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal had a fever. I entered upon them and \nsaid, \"O my father! How are you? O Bilal! How are you?\" Whenever Abu Bakr got the fever he used \nto say, \"Everybody is staying alive with his people, yet death is nearer to him than his shoe laces.\" \nAnd when fever deserted Bilal, he would recite (two poetic verses): \"Would that I could stay \novernight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling \ngrass). Would that one day I could drink of the water of Majinna, and would that Shama and Tafil \n(two mountains at Mecca) would appear to me!\" I went to Allah's Messenger (ﷺ) and informed him about \nthat. He said, \"O Allah! Make us love Medina as much or more than we love Mecca, and make it \nhealthy, and bless its Sa and its Mudd, and take away its fever and put it in Al-Juhfa.\" (See Hadith No \n558) .","reference":"Sahih al-Bukhari 5677, Book 75, Hadith 37","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) pray for the city of Medina in terms of health and blessings?","id":"bukhari-75-76"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"No calamity befalls a Muslim but that Allah expiates \nsome of his sins because of it, even though it were the prick he receives from a thorn.\"","reference":"Sahih al-Bukhari 5640, Book 75, Hadith 1","grade":"","question #":"question #3","question":"In what ways can a Muslim find spiritual benefit in the face of adversity?","id":"bukhari-75-77"},{"hadith-eng":"The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"","reference":"Sahih al-Bukhari 5641, 5642, Book 75, Hadith 2","grade":"","question #":"question #3","question":"In what ways does Islam view the relationship between suffering and spiritual purification?","id":"bukhari-75-78"},{"hadith-eng":"The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"","reference":"Sahih al-Bukhari 5641, 5642, Book 75, Hadith 2","grade":"","question #":"question #3","question":"In what ways does Islam view the relationship between personal suffering and the expiation of sins?","id":"bukhari-75-79"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt \nsometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine \ntree which keeps straight till once it is uprooted suddenly.","reference":"Sahih al-Bukhari 5643, Book 75, Hadith 3","grade":"","question #":"question #3","question":"What lessons can be drawn from the comparison between a tender plant and a pine tree in understanding faith and hypocrisy?","id":"bukhari-75-80"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The example of a believer is that of a fresh tender plant; from whatever \ndirection the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. \nSimilarly, a believer is afflicted with calamities (but he remains patient till Allah removes his \ndifficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah \ncuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)","reference":"Sahih al-Bukhari 5644, Book 75, Hadith 4","grade":"","question #":"question #3","question":"In what ways does patience play a role in overcoming life's challenges as described in the metaphor of the believer?","id":"bukhari-75-81"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If Allah wants to do good to somebody, He afflicts him with trials.\"","reference":"Sahih al-Bukhari 5645, Book 75, Hadith 5","grade":"","question #":"question #3","question":"What is the relationship between divine trials and personal growth in Islam?","id":"bukhari-75-82"},{"hadith-eng":"I never saw anybody suffering so much from sickness as Allah's Messenger (ﷺ).","reference":"Sahih al-Bukhari 5646, Book 75, Hadith 6","grade":"","question #":"question #3","question":"How does the experience of the Prophet Muhammad (ﷺ) with illness reflect on his human nature?","id":"bukhari-75-83"},{"hadith-eng":"I visited the Prophet (ﷺ) during his ailments and he was suffering from a high fever. I said, \"You have a \nhigh fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is \nafflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"","reference":"Sahih al-Bukhari 5647, Book 75, Hadith 7","grade":"","question #":"question #3","question":"What is the relationship between physical ailments and spiritual rewards in Islam?","id":"bukhari-75-84"},{"hadith-eng":"I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I said, \"O Allah's Messenger (ﷺ)! You \nhave a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you \nwill have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it \nwere the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5648, Book 75, Hadith 8","grade":"","question #":"question #3","question":"What is the concept of receiving double rewards for enduring hardships in Islam?","id":"bukhari-75-85"},{"hadith-eng":"The Prophet (ﷺ) said, \"Feed the hungry, visit the sick, and set free the captives.\"","reference":"Sahih al-Bukhari 5649, Book 75, Hadith 9","grade":"","question #":"question #3","question":"What is the significance of freeing captives in Islamic tradition?","id":"bukhari-75-86"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do seven other things. He forbade us \nto wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral \nprocessions, visit the sick and greet everybody. (See Hadith No. 104)","reference":"Sahih al-Bukhari 5650, Book 75, Hadith 10","grade":"","question #":"question #3","question":"How does Islamic guidance balance prohibitions with positive community actions?","id":"bukhari-75-87"},{"hadith-eng":"Once I fell ill. The Prophet (ﷺ) and Abu Bakr came walking to pay me a visit and found me unconscious. \nThe Prophet (ﷺ) performed ablution and then poured the remaining water on me, and I came to my senses \nto see the Prophet. I said, \"O Allah's Messenger (ﷺ)! What shall I do with my property? How shall I dispose \nof (distribute) my property?\" He did not reply till the Verse of inheritance was revealed.","reference":"Sahih al-Bukhari 5651, Book 75, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of the Prophet (ﷺ) performing ablution and using the remaining water in this context?","id":"bukhari-75-88"},{"hadith-eng":"Ibn `Abbas said to me, \"Shall I show you a woman of the people of Paradise?\" I said, \"Yes.\" He said, \n\"This black lady came to the Prophet (ﷺ) and said, 'I get attacks of epilepsy and my body becomes \nuncovered; please invoke Allah for me.' The Prophet (ﷺ) said (to her), 'If you wish, be patient and you will \nhave (enter) Paradise; and if you wish, I will invoke Allah to cure you.' She said, 'I will remain \npatient,' and added, 'but I become uncovered, so please invoke Allah for me that I may not become \nuncovered.' So he invoked Allah for her.\"Narrated 'Ata:That he had seen Um Zafar, the tall black lady, at (holding) the curtain of the Ka`ba.","reference":"Sahih al-Bukhari 5652, Book 75, Hadith 12","grade":"","question #":"question #3","question":"What options did the Prophet Muhammad (ﷺ) offer to those seeking relief from their afflictions?","id":"bukhari-75-89"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his \neyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"","reference":"Sahih al-Bukhari 5653, Book 75, Hadith 13","grade":"","question #":"question #3","question":"What are the rewards promised in Islam for those who remain patient during difficult times?","id":"bukhari-75-90"},{"hadith-eng":"When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal got a fever. I entered upon them and \nasked, \"O my father! How are you? O Bilal! How are you?\" Whenever fever attacked Abu Bakr, he \nwould recite the following poetic verses: 'Everybody is staying alive among his people, yet death is \nnearer to him than his shoe laces.\" And whenever the fever deserted Bilal, he would recite (two poetic \nlines): 'Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and \nJalil (two kinds of good smelling grass). Would that one day I would drink of the water of Majinna \nand would that Shama and Tafil (two mountains at Mecca) would appear to me.' Then I came and \ninformed Allah's Messenger (ﷺ) about that, whereupon he said, \"O Allah! Make us love Medina as much or \nmore than we love Mecca. O Allah! Make it healthy and bless its Mudd and Sa for us, and take away \nits fever and put it in Al Juhfa.\"","reference":"Sahih al-Bukhari 5654, Book 75, Hadith 14","grade":"","question #":"question #3","question":"What significance do the poetic verses recited by Abu Bakr and Bilal hold in the context of their experiences in Medina?","id":"bukhari-75-91"},{"hadith-eng":"Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet (ﷺ) a daughter of the \nProphet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet (ﷺ) sent \nher his greetings and added \"It is for Allah what He takes, and what He gives; and everything before \nHis sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again \nsent a message, beseeching him by Allah, to come. So the Prophet (ﷺ) got up. and so did we (and went \nthere). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of \nthe Prophet. Sa`d said to him, \"What is this, O Allah's Messenger (ﷺ)?\" He said. \"This Is Mercy which Allah \nhas embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His \nMercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)","reference":"Sahih al-Bukhari 5655, Book 75, Hadith 15","grade":"","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) exemplify the expression of human emotions in the face of grief?","id":"bukhari-75-92"},{"hadith-eng":"The Prophet (ﷺ) went to visit a sick bedouin. Whenever the Prophet (ﷺ) went to a patient, he used to say to \nhim, \"Don't worry, if Allah will, it will be expiation (for your sins):\" The bedouin said, \"You say \nexpiation? No, it is but a fever that is boiling or harassing an old man and will lead him to his grave \nwithout his will.\" The Prophet (ﷺ) said, \"Then, yes, it is so.\"","reference":"Sahih al-Bukhari 5656, Book 75, Hadith 16","grade":"","question #":"question #3","question":"What is the attitude of a believer towards illness and how should they perceive it in terms of faith and destiny?","id":"bukhari-75-93"},{"hadith-eng":"A Jewish boy used to serve the Prophet (ﷺ) and became ill. The Prophet (ﷺ) went to pay him a visit and said \nto him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his \ndeathbed, the Prophet (ﷺ) visited him.","reference":"Sahih al-Bukhari 5657, Book 75, Hadith 17","grade":"","question #":"question #3","question":"What significance does visiting the sick hold in Islamic teachings, as demonstrated by the Prophet (ﷺ)?","id":"bukhari-75-94"},{"hadith-eng":"During the ailment of the Prophet (ﷺ) some people came to visits him. He led them in prayer while sitting. \nbut they prayed standing, so he waved to them to sit down. When he had finished the prayer, he said, \n\"An Imam is to be followed, so when he bows, you should bow. and when he raises his head, you \nshould raise yours, and if he prays sitting. you should pray sitting.\" Abu `Abdullah said Al-Humaidi \nsaid, (The order of ) \"This narration has been abrogated by the last action of the Prophet (ﷺ) as he led the \nprayer sitting, while the people prayed standing behind him.'","reference":"Sahih al-Bukhari 5658, Book 75, Hadith 18","grade":"","question #":"question #3","question":"What does the concept of abrogation in Islamic teachings imply in the context of prayer practices?","id":"bukhari-75-95"},{"hadith-eng":"I became seriously ill at Mecca and the Prophet (ﷺ) came to visit me. I said, \"O Allah's Messenger (ﷺ)! I shall \nleave behind me a good fortune, but my heir is my only daughter; shall I bequeath two third of my \nproperty to be spent in charity and leave one third (for my heir)?\" He said, \"No.\" I said, \"Shall I \nbequeath half and leave half?\" He said, \"No.\" I said, \"Shall I bequeath one third and leave two thirds?\" \nHe said, \"One third is alright, though even one third is too much.\" Then he placed his hand on his \nforehead and passed it over my face and `Abdomen and said, \"O Allah! Cure Sa`d and complete his \nemigration.\" I feel as if I have been feeling the coldness of his hand on my liver ever since.","reference":"Sahih al-Bukhari 5659, Book 75, Hadith 19","grade":"","question #":"question #3","question":"What significance does the Prophet's prayer for healing and completion of emigration hold in this context?","id":"bukhari-75-96"},{"hadith-eng":"I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I touched him with my hand and \nsaid, \"O Allah's Messenger (ﷺ)! You have a high fever.\" Allah's Messenger (ﷺ) said, \"Yes, I have as much fever as \ntwo men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Messenger (ﷺ) said, \"Yes, \nno Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will \nremove his sins for him as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5660, Book 75, Hadith 20","grade":"","question #":"question #3","question":"What does the comparison of shedding sins to a tree shedding its leaves imply about the nature of forgiveness in Islam?","id":"bukhari-75-97"},{"hadith-eng":"I visited the Prophet (ﷺ) during his illness and touched him while he was having a fever. I said to him, \n\"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is \nafflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"","reference":"Sahih al-Bukhari 5661, Book 75, Hadith 21","grade":"","question #":"question #3","question":"What is the relationship between suffering and the forgiveness of sins in Islamic belief?","id":"bukhari-75-98"},{"hadith-eng":"Allah's Messenger (ﷺ) entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, \n(your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling \nwithin an old man and will send him to his grave.\" On that, the Prophet (ﷺ) said, \"Then yes, it is so.\"","reference":"Sahih al-Bukhari 5662, Book 75, Hadith 22","grade":"","question #":"question #3","question":"How does one's perception of illness affect their spiritual state according to Islamic beliefs?","id":"bukhari-75-99"},{"hadith-eng":"The Prophet (ﷺ) rode a donkey having a saddle with a Fadakiyya velvet covering. He mounted me behind \nhim and went to visit Sa`d bin 'Ubada, and that had been before the battle of Badr. The Prophet (ﷺ) \nproceeded till he passed by a gathering in which `Abdullah bin Ubai bin Salul was present, and that \nhad been before `Abdullah embraced Islam. The gathering comprised of Muslims, polytheists, i.e., \nisolators and Jews. `Abdullah bin Rawaha was also present in that gathering. When dust raised by the \ndonkey covered the gathering, `Abdullah bin Ubai covered his nose with his upper garment and said, \n\"Do not trouble us with dust.\" The Prophet (ﷺ) greeted them, stopped and dismounted. Then he invited \nthem to Allah (i.e., to embrace Islam) and recited to them some verses of the Holy Qur'an. On that, \n`Abdullah bin Ubai said, \"O man ! There is nothing better than what you say if it is true. Do not \ntrouble us with it in our gathering, but return to your house, and if somebody comes to you, teach him \nthere.\" On that `Abdullah bin Rawaha said, Yes, O Allah's Messenger (ﷺ)! Bring your teachings to our \ngathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing each other till \nthey were about to fight. The Prophet (ﷺ) kept on quietening them till they became calm. Thereupon the \nProphet mounted his animal and proceeded till he entered upon Sa`d bin Ubada. He said to him \"O \nSa`d! Have you not heard what Abu Hubab (i.e., `Abdullah bin Ubai) said?\" Sa`d said, 'O Allah's \nApostle! Excuse and forgive him, for Allah has given you what He has given you. The people of this \ntown (Medina decided unanimously to crown him and make him their chief by placing a turban on his \nhead, but when that was prevented by the Truth which Allah had given you he (`Abdullah bin Ubai) \nwas grieved out of jealously, and that was the reason which caused him to behave in the way you have \nseen.\"","reference":"Sahih al-Bukhari 5663, Book 75, Hadith 23","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) manage conflicts among diverse groups during his time?","id":"bukhari-75-100"},{"hadith-eng":"The Prophet (ﷺ) came to visit me (while I was sick) and he was riding neither a mule, nor a horse.","reference":"Sahih al-Bukhari 5664, Book 75, Hadith 24","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) character from his choice of transportation when visiting others?","id":"bukhari-75-101"},{"hadith-eng":"The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of \nyour head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make \nexpiation for that.\"","reference":"Sahih al-Bukhari 5665, Book 75, Hadith 25","grade":"","question #":"question #3","question":"What is the significance of making expiation in Islamic teachings when dealing with personal discomforts?","id":"bukhari-75-102"},{"hadith-eng":"`Aisha, (complaining of headache) said, \"Oh, my head\"! Allah's Messenger (ﷺ) said, \"I wish that had \nhappened while I was still living, for then I would ask Allah's Forgiveness for you and invoke Allah \nfor you.\" Aisha said, \"Wa thuklayah! By Allah, I think you want me to die; and If this should happen, \nyou would spend the last part of the day sleeping with one of your wives!\" The Prophet (ﷺ) said, \"Nay, I \nshould say, 'Oh my head!' I felt like sending for Abu Bakr and his son, and appoint him as my \nsuccessor lest some people claimed something or some others wished something, but then I said (to \nmyself), 'Allah would not allow it to be otherwise, and the Muslims would prevent it to be otherwise\".","reference":"Sahih al-Bukhari 5666, Book 75, Hadith 26","grade":"","question #":"question #3","question":"What can be inferred about the Prophet Muhammad's (ﷺ) views on succession and leadership from this narration?","id":"bukhari-75-103"},{"hadith-eng":"I visited the Prophet (ﷺ) while he was having a high fever. I touched him an said, \"You have a very high \nfever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double \nreward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other \ninconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"","reference":"Sahih al-Bukhari 5667, Book 75, Hadith 27","grade":"","question #":"question #3","question":"What rewards are promised to Muslims who endure suffering with patience according to Islamic beliefs?","id":"bukhari-75-104"},{"hadith-eng":"Allah's Messenger (ﷺ) came to visit me during my ailment which had been aggravated during Hajjat-al- \nWada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only \ndaughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He \nsaid, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better \nthan to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall \nget a reward for it, even for what you put in the mouth of your wife.\"","reference":"Sahih al-Bukhari 5668, Book 75, Hadith 28","grade":"","question #":"question #3","question":"How does Islam view the act of spending wealth with the intention of seeking Allah's pleasure?","id":"bukhari-75-105"},{"hadith-eng":"When Allah's Messenger (ﷺ) was on his death-bed and in the house there were some people among whom \nwas `Umar bin Al-Khattab, the Prophet (ﷺ) said, \"Come, let me write for you a statement after which you \nwill not go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill and you have the Qur'an; so the Book of \nAllah is enough for us.\" The people present in the house differed and quarrelled. Some said \"Go near \nso that the Prophet (ﷺ) may write for you a statement after which you will not go astray,\" while the others \nsaid as `Umar said. When they caused a hue and cry before the Prophet, Allah's Messenger (ﷺ) said, \"Go \naway!\" Narrated 'Ubaidullah: Ibn `Abbas used to say, \"It was very unfortunate that Allah's Messenger (ﷺ) \nwas prevented from writing that statement for them because of their disagreement and noise.\"","reference":"Sahih al-Bukhari 5669, Book 75, Hadith 29","grade":"","question #":"question #3","question":"What does this incident reveal about the dynamics and decision-making among the companions during the Prophet's (ﷺ) final days?","id":"bukhari-75-106"},{"hadith-eng":"My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is- ill.\" The Prophet (ﷺ) \ntouched my head with his hand and invoked Allah to bless me. He then performed ablution and I \ndrank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- \nNubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.","reference":"Sahih al-Bukhari 5670, Book 75, Hadith 30","grade":"","question #":"question #3","question":"What is the significance of drinking the remaining water of the Prophet's ablution in Islamic belief?","id":"bukhari-75-107"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he \nhas to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let \nme die if death is better for me.' \"","reference":"Sahih al-Bukhari 5671, Book 75, Hadith 31","grade":"","question #":"question #3","question":"What is the recommended supplication for someone who is contemplating life and death due to severe trials?","id":"bukhari-75-108"},{"hadith-eng":"We went to pay a visit to Khabbab (who was sick) and he had been branded (cauterized) at seven \nplaces in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this \nworld) without having their rewards reduced through enjoying the pleasures of this life, but we have \ngot (so much) wealth that we find no way to spend It except on the construction of buildings Had the \nProphet not forbidden us to wish for death, I would have wished for it.' We visited him for the second \ntime while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he \nspends except for something that he spends on building.\"","reference":"Sahih al-Bukhari 5672, Book 75, Hadith 32","grade":"","question #":"question #3","question":"What are the implications of spending wealth on construction in terms of spiritual rewards?","id":"bukhari-75-109"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"The good deeds of any person will not make him enter Paradise.\" \n(i.e., None can enter Paradise through his good deeds.) They (the Prophet's companions) said, 'Not \neven you, O Allah's Messenger (ﷺ)?' He said, \"Not even myself, unless Allah bestows His favor and mercy \non me.\" So be moderate in your religious deeds and do the deeds that are within your ability: and none \nof you should wish for death, for if he is a good doer, he may increase his good deeds, and if he is an \nevil doer, he may repent to Allah.\"","reference":"Sahih al-Bukhari 5673, Book 75, Hadith 33","grade":"","question #":"question #3","question":"Why is it advised to be moderate in religious deeds and to perform actions within one's ability?","id":"bukhari-75-110"},{"hadith-eng":"I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your \nMercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)","reference":"Sahih al-Bukhari 5674, Book 75, Hadith 34","grade":"","question #":"question #3","question":"What can be learned from the Prophet's supplication for mercy and companionship in the afterlife?","id":"bukhari-75-111"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke \nAllah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who \ncures. There is no cure but Yours, a cure that leaves no disease.\"","reference":"Sahih al-Bukhari 5675, Book 75, Hadith 35","grade":"","question #":"question #3","question":"What is the significance of invoking Allah for a cure that leaves no disease?","id":"bukhari-75-112"},{"hadith-eng":"The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me \n(or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or \nfather to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed.","reference":"Sahih al-Bukhari 5676, Book 75, Hadith 36","grade":"","question #":"question #3","question":"What concerns did Jabir bin `Abdullah express regarding his inheritance?","id":"bukhari-75-113"},{"hadith-eng":"When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal had a fever. I entered upon them and \nsaid, \"O my father! How are you? O Bilal! How are you?\" Whenever Abu Bakr got the fever he used \nto say, \"Everybody is staying alive with his people, yet death is nearer to him than his shoe laces.\" \nAnd when fever deserted Bilal, he would recite (two poetic verses): \"Would that I could stay \novernight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling \ngrass). Would that one day I could drink of the water of Majinna, and would that Shama and Tafil \n(two mountains at Mecca) would appear to me!\" I went to Allah's Messenger (ﷺ) and informed him about \nthat. He said, \"O Allah! Make us love Medina as much or more than we love Mecca, and make it \nhealthy, and bless its Sa and its Mudd, and take away its fever and put it in Al-Juhfa.\" (See Hadith No \n558) .","reference":"Sahih al-Bukhari 5677, Book 75, Hadith 37","grade":"","question #":"question #3","question":"What significance do the poetic verses recited by Bilal hold in expressing his longing for Mecca?","id":"bukhari-75-114"}]