[{"hadith-eng":"The Prophet (ﷺ) said, \"There is no disease that Allah has created, except that He also has created its \ntreatment.\"","reference":"Sahih al-Bukhari 5678, Book 76, Hadith 1","grade":"","question #":"question #1","question":"What does this saying imply about the relationship between diseases and their treatments in Islamic teachings?","id":"bukhari-76-1"},{"hadith-eng":"We used to go for Military expeditions along with Allah's Messenger (ﷺ) and provide the people with water, \nserve them and bring the dead and the wounded back to Medina.","reference":"Sahih al-Bukhari 5679, Book 76, Hadith 2","grade":"","question #":"question #1","question":"What roles did women play during military expeditions in the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-2"},{"hadith-eng":"(The Prophet (ﷺ) said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire \n(cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\"","reference":"Sahih al-Bukhari 5680, Book 76, Hadith 3","grade":"","question #":"question #1","question":"What are the three methods mentioned for healing in Islamic tradition?","id":"bukhari-76-3"},{"hadith-eng":"The Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding \nwith fire) but I forbid my followers to use cauterization (branding with fire).","reference":"Sahih al-Bukhari 5681, Book 76, Hadith 4","grade":"","question #":"question #1","question":"What are the three methods mentioned for healing in Islamic teachings?","id":"bukhari-76-4"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things and honey.","reference":"Sahih al-Bukhari 5682, Book 76, Hadith 5","grade":"","question #":"question #1","question":"What were some of the food preferences of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-5"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If there is any healing in your medicines, then it is in cupping, a gulp of \nhoney or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) \nbranded with fire.\"","reference":"Sahih al-Bukhari 5683, Book 76, Hadith 6","grade":"","question #":"question #1","question":"What are the traditional methods of healing mentioned in Islamic teachings?","id":"bukhari-76-6"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"My brother has some Abdominal trouble.\" The Prophet (ﷺ) said to \nhim \"Let him drink honey.\" The man came for the second time and the Prophet (ﷺ) said to him, 'Let him \ndrink honey.\" He came for the third time and the Prophet (ﷺ) said, \"Let him drink honey.\" He returned \nagain and said, \"I have done that ' The Prophet (ﷺ) then said, \"Allah has said the truth, but your brother's \n`Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.","reference":"Sahih al-Bukhari 5684, Book 76, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of honey in Islamic medicine and healing practices?","id":"bukhari-76-7"},{"hadith-eng":"Some people were sick and they said, \"O Allah's Messenger (ﷺ)! Give us shelter and food. So when they \nbecame healthy they said, \"The weather of Medina is not suitable for us.\" So he sent them to Al-Harra \nwith some she-camels of his and said, \"Drink of their milk.\" But when they became healthy, they \nkilled the shepherd of the Prophet (ﷺ) and drove away his camels. The Prophet (ﷺ) sent some people in their \npursuit. Then he got their hands and feet cut and their eyes were branded with heated pieces of iron. I \nsaw one of them licking the earth with his tongue till he died.","reference":"Sahih al-Bukhari 5685, Book 76, Hadith 8","grade":"","question #":"question #1","question":"What are the consequences of betrayal and murder in Islamic teachings?","id":"bukhari-76-8"},{"hadith-eng":"The climate of Medina did not suit some people, so the Prophet (ﷺ) ordered them to follow his shepherd, \ni.e. his camels, and drink their milk and urine (as a medicine). So they followed the shepherd that is \nthe camels and drank their milk and urine till their bodies became healthy. Then they killed the \nshepherd and drove away the camels. When the news reached the Prophet (ﷺ) he sent some people in their \npursuit. When they were brought, he cut their hands and feet and their eyes were branded with heated \npieces of iron.","reference":"Sahih al-Bukhari 5686, Book 76, Hadith 9","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) prescribe for those who were unwell due to the climate of Medina?","id":"bukhari-76-9"},{"hadith-eng":"We went out and Ghalib bin Abjar was accompanying us. He fell ill on the way and when we arrived \nat Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black \ncumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting \nmixture into both nostrils, for `Aisha has narrated to me that she heard the Prophet (ﷺ) saying, 'This black \ncumin is healing for all diseases except As-Sam.' Aisha said, 'What is As-Sam?' He said, 'Death.\"","reference":"Sahih al-Bukhari 5687, Book 76, Hadith 10","grade":"","question #":"question #1","question":"What are the medicinal benefits of black cumin according to Islamic teachings?","id":"bukhari-76-10"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There is healing in black cumin for all diseases except death.\"","reference":"Sahih al-Bukhari 5688, Book 76, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of black cumin in Islamic medicine?","id":"bukhari-76-11"},{"hadith-eng":"Aisha used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. \nShe used to say, \"I heard Allah's Messenger (ﷺ) saying, 'at-Talbina gives rest to the heart of the patient and \nmakes it active and relieves some of his sorrow and grief.'\"","reference":"Sahih al-Bukhari 5689, Book 76, Hadith 12","grade":"","question #":"question #1","question":"What are the benefits of at-Talbina for someone who is sick or grieving?","id":"bukhari-76-12"},{"hadith-eng":"`Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is \nbeneficial.''","reference":"Sahih al-Bukhari 5690, Book 76, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of recommending certain foods or remedies for patients in Islamic tradition?","id":"bukhari-76-13"},{"hadith-eng":"The Prophet (ﷺ) was cupped and he paid the wages to the one who had cupped him and then took Su'ut \n(Medicine sniffed by nose).","reference":"Sahih al-Bukhari 5691, Book 76, Hadith 14","grade":"","question #":"question #1","question":"What does this narration teach about the practice of cupping in Islam?","id":"bukhari-76-14"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.","reference":"Sahih al-Bukhari 5692, 5693, Book 76, Hadith 15","grade":"","question #":"question #1","question":"What are the medicinal benefits of Indian incense according to Islamic teachings?","id":"bukhari-76-15"},{"hadith-eng":"The Prophet (ﷺ) was cupped while he was fasting.","reference":"Sahih al-Bukhari 5694, Book 76, Hadith 16","grade":"","question #":"question #1","question":"What is the ruling on cupping while fasting in Islam?","id":"bukhari-76-16"},{"hadith-eng":"The Prophet (ﷺ) was cupped while he was in a state of Ihram.","reference":"Sahih al-Bukhari 5695, Book 76, Hadith 17","grade":"","question #":"question #1","question":"What is the ruling on performing medical treatments such as cupping while in a state of Ihram?","id":"bukhari-76-17"},{"hadith-eng":"that he was asked about the wages of the one who cups others. He said, 'Allah's Messenger (ﷺ) was cupped \nby `Abd Taiba, to whom he gave two Sa of food and interceded for him with his masters who \nconsequently reduced what they used to charge him daily. Then the Prophet (ﷺ) s said, \"The best \nmedicines you may treat yourselves with are cupping and sea incense.' He added, \"You should not \ntorture your children by treating tonsillitis by pressing the tonsils or the palate with the finger, but use \nincense.\"","reference":"Sahih al-Bukhari 5696, Book 76, Hadith 18","grade":"","question #":"question #1","question":"What are the recommended treatments mentioned for medical ailments in Islamic tradition?","id":"bukhari-76-18"},{"hadith-eng":"that he paid Al-Muqanna a visit during his illness and said, \"I will not leave till he gets cupped, for I \nheard Allah's Messenger (ﷺ) saying, \"There is healing in cupping.\"","reference":"Sahih al-Bukhari 5697, Book 76, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of cupping in Islamic medicine according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-19"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.","reference":"Sahih al-Bukhari 5698, 5699, Book 76, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of cupping in Islamic tradition, especially during the state of Ihram?","id":"bukhari-76-20"},{"hadith-eng":"The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .","reference":"Sahih al-Bukhari 5700, 5701, Book 76, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of cupping as a treatment in Islamic tradition?","id":"bukhari-76-21"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If there is any good in your medicines, then it is in a gulp of honey, a \ncupping operation, or branding (cauterization), but I do not like to be (cauterized) branded.","reference":"Sahih al-Bukhari 5702, Book 76, Hadith 22","grade":"","question #":"question #1","question":"What are the traditional remedies mentioned by the Prophet (ﷺ) for healing?","id":"bukhari-76-22"},{"hadith-eng":"The Prophet (ﷺ) came to me during the period of Al-Hudaibiya, while I was lighting fire underneath a \ncooking pot and lice were falling down my head. He said, \"Do your lice hurt your?\" I said, \"Yes.\" He \nsaid, \"Shave your head and fast for three days or feed six poor persons or slaughter a sheep as a \nsacrifice:\"","reference":"Sahih al-Bukhari 5703, Book 76, Hadith 23","grade":"","question #":"question #1","question":"What are the options provided for someone who is in a state of discomfort due to lice during a pilgrimage?","id":"bukhari-76-23"},{"hadith-eng":"The Prophet (ﷺ) said, \"If there is any healing in your medicines then it is a cupping operation, or branding \n(cauterization), but I do not like to be (cauterized) branded.\"","reference":"Sahih al-Bukhari 5704, Book 76, Hadith 24","grade":"","question #":"question #1","question":"What are the traditional methods of healing mentioned in Islamic teachings?","id":"bukhari-76-24"},{"hadith-eng":"Allah's Messenger (ﷺ) said, 'Nations were displayed before me; one or two prophets would pass by along \nwith a few followers. A prophet would pass by accompanied by nobody. Then a big crowd of people \npassed in front of me and I asked, Who are they Are they my followers?\" It was said, 'No. It is Moses \nand his followers It was said to me, 'Look at the horizon.'' Behold! There was a multitude of people \nfilling the horizon. Then it was said to me, 'Look there and there about the stretching sky! Behold! \nThere was a multitude filling the horizon,' It was said to me, 'This is your nation out of whom seventy \nthousand shall enter Paradise without reckoning.' \"Then the Prophet (ﷺ) entered his house without telling \nhis companions who they (the 70,000) were. So the people started talking about the issue and said, \"It \nis we who have believed in Allah and followed His Apostle; therefore those people are either \nourselves or our children who are born m the Islamic era, for we were born in the Pre-lslamic Period \nof Ignorance.'' When the Prophet (ﷺ) heard of that, he came out and said. \"Those people are those who do \nnot treat themselves with Ruqya, nor do they believe in bad or good omen (from birds etc.) nor do \nthey get themselves branded (Cauterized). but they put their trust (only) in their Lord \" On that \n'Ukasha bin Muhsin said. \"Am I one of them, O Allah's Messenger (ﷺ)?' The Prophet (ﷺ) said, \"Yes.\" Then \nanother person got up and said, \"Am I one of them?\" The Prophet (ﷺ) said, 'Ukasha has anticipated you.\"","reference":"Sahih al-Bukhari 5705, Book 76, Hadith 25","grade":"","question #":"question #1","question":"What characteristics define the group of people who will enter Paradise without reckoning?","id":"bukhari-76-25"},{"hadith-eng":"The husband of a lady died and her eyes became sore and the people mentioned her story to the \nProphet They asked him whether it was permissible for her to use kohl as her eyes were exposed to \ndanger. He said, \"Previously, when one of you was bereaved by a husband she would stay in her dirty \nclothes in a bad unhealthy house (for one year), and when a dog passed by, she would throw a globe \nof dung. No, (she should observe the prescribed period Idda) for four months and ten days.'","reference":"Sahih al-Bukhari 5706, Book 76, Hadith 26","grade":"","question #":"question #1","question":"What is the prescribed period of Idda for a woman whose husband has passed away?","id":"bukhari-76-26"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(There is) no 'Adwa (no contagious disease is conveyed without Allah's permission). nor is there any bad omen (from birds), nor is there any Hamah, nor is there any bad omen in the month of Safar, and one should run away from the leper as one runs away from a lion.\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Sahih al-Bukhari 5707, Book 76, Hadith 27","grade":"","question #":"question #1","question":"What is the Islamic perspective on contagious diseases and superstitions?","id":"bukhari-76-27"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Truffles are like Manna (i.e. they grow naturally without man's care) and \ntheir water heals eye diseases.\"","reference":"Sahih al-Bukhari 5708, Book 76, Hadith 28","grade":"","question #":"question #1","question":"What are the natural benefits of truffles as mentioned in Islamic teachings?","id":"bukhari-76-28"},{"hadith-eng":"Abu Bakr kissed (the forehead of) the Prophet (ﷺ) when he was dead. `Aisha added: We put medicine in \none side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He \ndislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not \nforbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just \nbecause a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be \nforced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had \nnot witnessed your deed.\"","reference":"Sahih al-Bukhari 5709-5712, Book 76, Hadith 29","grade":"","question #":"question #1","question":"What actions did Abu Bakr take upon the death of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-29"},{"hadith-eng":"I went to Allah's Messenger (ﷺ) along with a a son of mine whose palate and tonsils I had pressed with my \nfinger as a treatment for a (throat and tonsil) disease. The Prophet (ﷺ) said, \"Why do you pain your \nchildren by pressing their throats! Use Ud Al-Hindi (certain Indian incense) for it cures seven \ndiseases, one of which is pleurisy. It is used as a snuff for treating throat and tonsil disease and it is \ninserted into one side of the mouth of one suffering from pleurisy.\"","reference":"Sahih al-Bukhari 5713, Book 76, Hadith 30","grade":"","question #":"question #1","question":"What alternative remedies did the Prophet Muhammad (ﷺ) suggest for treating throat and tonsil diseases?","id":"bukhari-76-30"},{"hadith-eng":"(the wife of the Prophet) \nWhen the health of Allah's Messenger (ﷺ) deteriorated and his condition became serious, he asked the \npermission of all his wives to allow him to be treated In my house, and they allowed him. He came \nout, supported by two men and his legs were dragging on the ground between `Abbas and another \nman. (The sub-narrator told Ibn `Abbas who said: Do you know who was the other man whom `Aisha \ndid not mention? The sub-narrator said: No. Ibn `Abbas said: It was `Ali.) `Aisha added: When the \nProphet entered my house and his disease became aggravated, he said, \"Pour on me seven water skins \nfull of water (the tying ribbons of which had not been untied) so that I may give some advice to the \npeople.\" So we made him sit in a tub belonging to Hafsa, the wife of the Prophet (ﷺ) and started pouring \nwater on him from those water skins till he waved us to stop. Then he went out to the people and led \nthem in prayer and delivered a speech before them.","reference":"Sahih al-Bukhari 5714, Book 76, Hadith 31","grade":"","question #":"question #1","question":"What does this narration reveal about the Prophet's relationship with his wives during his illness?","id":"bukhari-76-31"},{"hadith-eng":"that she took to Allah's Messenger (ﷺ) one of her sons whose palate and tonsils she had pressed because he \nhad throat trouble. The Prophet (ﷺ) said, \"Why do you pain your children by getting the palate pressed \nlike that? Use the Ud Al-Hindi (certain Indian incense) for it cures seven diseases one of which is \npleurisy.\"","reference":"Sahih al-Bukhari 5715, Book 76, Hadith 32","grade":"","question #":"question #1","question":"What are the recommended treatments for throat ailments in Islamic tradition?","id":"bukhari-76-32"},{"hadith-eng":"A man came to the prophet and said, 'My brother has got loose motions. The Prophet (ﷺ) said, Let him \ndrink honey.\" The man again (came) and said, 'I made him drink (honey) but that made him worse.' \nThe Prophet (ﷺ) said, 'Allah has said the Truth, and the `Abdomen of your brother has told a lie.\" (See \nHadith No. 88)","reference":"Sahih al-Bukhari 5716, Book 76, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of honey in Islamic medicine and its use as a remedy?","id":"bukhari-76-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, 'There is no 'Adwa (no disease is conveyed from the sick to the healthy without \nAllah's permission), nor Safar, nor Hama.\" A bedouin stood up and said, \"Then what about my \ncamels? They are like deer on the sand, but when a mangy camel comes and mixes with them, they all \nget infected with mangy.\" The Prophet (ﷺ) said, \"Then who conveyed the (mange) disease to the first \none?\"","reference":"Sahih al-Bukhari 5717, Book 76, Hadith 34","grade":"","question #":"question #1","question":"What is the Islamic perspective on the transmission of diseases and divine will?","id":"bukhari-76-34"},{"hadith-eng":"that she took to Allah's Messenger (ﷺ) one of her sons whose palate and tonsils she had pressed to treat a \nthroat trouble. The Prophet (ﷺ) said, \"Be afraid of Allah! Why do you pain your children by having their \ntonsils pressed like that? Use the Ud Al-Hindi (a certain Indian incense) for it cures seven diseases, \none of which is pleurisy.\"","reference":"Sahih al-Bukhari 5718, Book 76, Hadith 35","grade":"","question #":"question #1","question":"What are the potential harms of traditional medical practices on children according to Islamic teachings?","id":"bukhari-76-35"},{"hadith-eng":"Allah's Messenger (ﷺ) allowed one of the Ansar families to treat persons who have taken poison and also \nwho are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for \npleurisy, when Allah's Messenger (ﷺ) was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit \nwitnessed that, and it was Abu Talha who branded (cauterized) me.","reference":"Sahih al-Bukhari 5719, 5720, 5721, Book 76, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of using Ruqya in treating ailments according to Islamic tradition?","id":"bukhari-76-36"},{"hadith-eng":"When the helmet broke on the head of the Prophet (ﷺ) and his face became covered with blood and his \nincisor tooth broke (i.e. during the battle of Uhud), `Ali used to bring water in his shield while Fatima \nwas washing the blood off his face. When Fatima saw that the bleeding increased because of the \nwater, she took a mat (of palm leaves), burnt it, and stuck it (the burnt ashes) on the wound of Allah's \nApostle, whereupon the bleeding stopped.","reference":"Sahih al-Bukhari 5722, Book 76, Hadith 37","grade":"","question #":"question #1","question":"What actions did Fatima take to stop the bleeding of the Prophet during the battle of Uhud?","id":"bukhari-76-37"},{"hadith-eng":"`Abdullah bin `Umar said, \"The Prophet (ﷺ) said, 'Fever is from the heat of Hell, so put it out (cool it) \nwith water.' \" Nafi` added: `Abdullah used to say, \"O Allah! Relieve us from the punishment,\" (when \nhe suffered from fever).","reference":"Sahih al-Bukhari 5723, Book 76, Hadith 38","grade":"","question #":"question #1","question":"What is the relationship between fever and the concept of Hell in Islamic teachings?","id":"bukhari-76-38"},{"hadith-eng":"Whenever a lady suffering from fever was brought to Asma' bint Abu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Messenger (ﷺ) used to order \nus to abate fever with water.\"","reference":"Sahih al-Bukhari 5724, Book 76, Hadith 39","grade":"","question #":"question #1","question":"What method did Asma' bint Abu Bakr use to help women suffering from fever?","id":"bukhari-76-39"},{"hadith-eng":"The Prophet (ﷺ) said, \"Fever is from the heat of Hell, so abate fever with water.\"","reference":"Sahih al-Bukhari 5725, Book 76, Hadith 40","grade":"","question #":"question #1","question":"What is the relationship between fever and the concept of Hell in Islamic teachings?","id":"bukhari-76-40"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Fever is from the heat of Hell, so abate fever with water.\"","reference":"Sahih al-Bukhari 5726, Book 76, Hadith 41","grade":"","question #":"question #1","question":"What is the relationship between fever and the heat of Hell according to Islamic teachings?","id":"bukhari-76-41"},{"hadith-eng":"Some people from the tribes of `Ukl and `Uraina came to Allah's Messenger (ﷺ) and embraced Islam and \nsaid, \"O Allah's Messenger (ﷺ)! We are owners of livestock and have never been farmers,\" and they found \nthe climate of Medina unsuitable for them. So Allah's Messenger (ﷺ) ordered that they be given some camels \nand a shepherd, and ordered them to go out with those camels and drink their milk and urine. So they \nset out, but when they reached a place called Al-Harra, they reverted to disbelief after their conversion \nto Islam, killed the shepherd and drove away the camels. When this news reached the Prophet (ﷺ) he sent \nin their pursuit (and they were caught and brought). The Prophet (ﷺ) ordered that their eyes be branded \nwith heated iron bars and their hands be cut off, and they were left at Al-Harra till they died in that \nstate.","reference":"Sahih al-Bukhari 5727, Book 76, Hadith 42","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take in response to the betrayal and murder committed by the tribes of `Ukl and `Uraina?","id":"bukhari-76-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"If you hear of an outbreak of plague in a land, do not enter it; but if the plague \nbreaks out in a place while you are in it, do not leave that place.\"","reference":"Sahih al-Bukhari 5728, Book 76, Hadith 43","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding travel during an outbreak of a contagious disease?","id":"bukhari-76-43"},{"hadith-eng":"`Umar bin Al-Khattab departed for Sham and when he reached Sargh, the commanders of the \n(Muslim) army, Abu 'Ubaida bin Al-Jarrah and his companions met him and told him that an epidemic \nhad broken out in Sham. `Umar said, \"Call for me the early emigrants.\" So `Umar called them, \nconsulted them and informed them that an epidemic had broken out in Sham. \nThose people differed in their opinions. Some of them said, \"We have come out for a purpose and we \ndo not think that it is proper to give it up,\" while others said (to `Umar), \"You have along with you. \nother people and the companions of Allah's Messenger (ﷺ) so do not advise that we take them to this \nepidemic.\" `Umar said to them, \"Leave me now.\" Then he said, \"Call the Ansar for me.\" I called them \nand he consulted them and they followed the way of the emigrants and differed as they did. He then \nsaid to them, Leave me now,\" and added, \"Call for me the old people of Quraish who emigrated in the \nyear of the Conquest of Mecca.\" \nI called them and they gave a unanimous opinion saying, \"We advise that you should return with the \npeople and do not take them to that (place) of epidemic.\" So `Umar made an announcement, \"I will \nride back to Medina in the morning, so you should do the same.\" Abu 'Ubaida bin Al-Jarrah said (to \n`Umar), \"Are you running away from what Allah had ordained?\" `Umar said, \"Would that someone \nelse had said such a thing, O Abu 'Ubaida! Yes, we are running from what Allah had ordained to what \nAllah has ordained. Don't you agree that if you had camels that went down a valley having two places, \none green and the other dry, you would graze them on the green one only if Allah had ordained that, \nand you would graze them on the dry one only if Allah had ordained that?\" \nAt that time `Abdur-Rahman bin `Auf, who had been absent because of some job, came and said, \"I \nhave some knowledge about this. I have heard Allah's Messenger (ﷺ) saying, 'If you hear about it (an \noutbreak of plague) in a land, do not go to it; but if plague breaks out in a country where you are \nstaying, do not run away from it.' \" `Umar thanked Allah and returned to Medina.","reference":"Sahih al-Bukhari 5729, Book 76, Hadith 44","grade":"","question #":"question #1","question":"What considerations should be taken into account when deciding whether to enter or leave a place experiencing an epidemic?","id":"bukhari-76-44"},{"hadith-eng":"`Umar went to Sham and when he reached Sargh, he got the news that an epidemic (of plague) had \r\nbroken out in Sham. `Abdur-Rahman bin `Auf told him that Allah's Messenger (ﷺ) said, \"If you hear that it \r\n(plague) has broken out in a land, do not go to it; but if it breaks out in a land where you are present, \r\ndo not go out escaping from it.\"","reference":"Sahih al-Bukhari 5730, Book 76, Hadith 45","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding travel to areas affected by an epidemic?","id":"bukhari-76-45"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Neither Messiah (Ad-Dajjal) nor plague will enter Medina.\"","reference":"Sahih al-Bukhari 5731, Book 76, Hadith 46","grade":"","question #":"question #1","question":"What protection does Medina have against certain calamities according to Islamic teachings?","id":"bukhari-76-46"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(Death from) plague is martyrdom for every Muslim.\"","reference":"Sahih al-Bukhari 5732, Book 76, Hadith 47","grade":"","question #":"question #1","question":"What is the significance of martyrdom in Islam, and how is it defined?","id":"bukhari-76-47"},{"hadith-eng":"The Prophet (ﷺ) said, \"He (a Muslim) who dies of an abdominal disease is a martyr, and he who dies of \r\nplague is a martyr.\"","reference":"Sahih al-Bukhari 5733, Book 76, Hadith 48","grade":"","question #":"question #1","question":"What are the conditions under which a Muslim is considered a martyr according to Islamic teachings?","id":"bukhari-76-48"},{"hadith-eng":"(the wife of the Prophet) that she asked Allah's Messenger (ﷺ) about plague, and Allah's Messenger (ﷺ) informed \nher saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made \nit a blessing for the believers. None (among the believers) remains patient in a land in which plague \nhas broken out and considers that nothing will befall him except what Allah has ordained for him, but \nthat Allah will grant him a reward similar to that of a martyr.\"","reference":"Sahih al-Bukhari 5734, Book 76, Hadith 49","grade":"","question #":"question #1","question":"How is plague perceived differently for believers compared to others in Islamic teachings?","id":"bukhari-76-49"},{"hadith-eng":"During the Prophet's fatal illness, he used to recite the Mu'auwidhat (Surat An-Nas and Surat Al- \nFalaq) and then blow his breath over his body. When his illness was aggravated, I used to recite those \ntwo Suras and blow my breath over him and make him rub his body with his own hand for its \nblessings.\" (Ma`mar asked Az-Zuhri: How did the Prophet (ﷺ) use to blow? Az-Zuhri said: He used to \nblow on his hands and then passed them over his face.)","reference":"Sahih al-Bukhari 5735, Book 76, Hadith 50","grade":"","question #":"question #1","question":"What is the significance of reciting Surat An-Nas and Surat Al-Falaq during illness in Islamic tradition?","id":"bukhari-76-50"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) came across a tribe amongst the tribes of the Arabs, and that \ntribe did not entertain them. While they were in that state, the chief of that tribe was bitten by a snake \n(or stung by a scorpion). They said, (to the companions of the Prophet (ﷺ) ), \"Have you got any medicine \nwith you or anybody who can treat with Ruqya?\" The Prophet's companions said, \"You refuse to \nentertain us, so we will not treat (your chief) unless you pay us for it.\" So they agreed to pay them a \nflock of sheep. One of them (the Prophet's companions) started reciting Surat-al-Fatiha and gathering \nhis saliva and spitting it (at the snake-bite). The patient got cured and his people presented the sheep \nto them, but they said, \"We will not take it unless we ask the Prophet (whether it is lawful).\" When \nthey asked him, he smiled and said, \"How do you know that Surat-al-Fatiha is a Ruqya? Take it (flock \nof sheep) and assign a share for me.\"","reference":"Sahih al-Bukhari 5736, Book 76, Hadith 51","grade":"","question #":"question #1","question":"What is the significance of using Surah Al-Fatiha as a form of Ruqya in Islamic tradition?","id":"bukhari-76-51"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) passed by some people staying at a place where there was \nwater, and one of those people had been stung by a scorpion. A man from those staying near the \nwater, came and said to the companions of the Prophet, \"Is there anyone among you who can do \nRuqya as near the water there is a person who has been stung by a scorpion.\" So one of the Prophet's \ncompanions went to him and recited Surat-al-Fatiha for a sheep as his fees. The patient got cured and \nthe man brought the sheep to his companions who disliked that and said, \"You have taken wages for \nreciting Allah's Book.\" When they arrived at Medina, they said, ' O Allah's Messenger (ﷺ)! (This person) has \ntaken wages for reciting Allah's Book\" On that Allah's Messenger (ﷺ) said, \"You are most entitled to take \nwages for doing a Ruqya with Allah's Book.\"","reference":"Sahih al-Bukhari 5737, Book 76, Hadith 52","grade":"","question #":"question #1","question":"What is the significance of using Surah Al-Fatiha in the practice of Ruqya?","id":"bukhari-76-52"},{"hadith-eng":"The Prophet (ﷺ) ordered me or somebody else to do Ruqya (if there was danger) from an evil eye.","reference":"Sahih al-Bukhari 5738, Book 76, Hadith 53","grade":"","question #":"question #1","question":"What is the significance of performing Ruqya in Islam?","id":"bukhari-76-53"},{"hadith-eng":"that the Prophet (ﷺ) saw in her house a girl whose face had a black spot. He said. \"She is under the effect \nof an evil eye; so treat her with a Ruqya.\"","reference":"Sahih al-Bukhari 5739, Book 76, Hadith 54","grade":"","question #":"question #1","question":"What is the significance of using Ruqya as a treatment in Islamic tradition?","id":"bukhari-76-54"},{"hadith-eng":"The Prophet (ﷺ) said, \"The effect of an evil eye is a fact.\" And he prohibited tattooing.","reference":"Sahih al-Bukhari 5740, Book 76, Hadith 55","grade":"","question #":"question #1","question":"What is the significance of the evil eye in Islamic teachings?","id":"bukhari-76-55"},{"hadith-eng":"I asked `Aisha about treating poisonous stings (a snake-bite or a scorpion sting) with a Ruqya. She \nsaid, \"The Prophet (ﷺ) allowed the treatment of poisonous sting with Ruqya.\"","reference":"Sahih al-Bukhari 5741, Book 76, Hadith 56","grade":"","question #":"question #1","question":"What is the Islamic perspective on using Ruqya for treating ailments such as poisonous stings?","id":"bukhari-76-56"},{"hadith-eng":"Thabit and I went to Anas bin Malik. Thabit said, \"O Abu Hamza! I am sick.\" On that Anas said, \n\"Shall I treat you with the Ruqya of Allah's Messenger (ﷺ)?\" Thabit said, \"Yes,\" Anas recited, \"O Allah! The \nLord of the people, the Remover of trouble! (Please) cure (Heal) (this patient), for You are the Healer. \nNone brings about healing but You; a healing that will leave behind no ailment.\"","reference":"Sahih al-Bukhari 5742, Book 76, Hadith 57","grade":"","question #":"question #1","question":"What is the significance of using Ruqya in Islamic healing practices?","id":"bukhari-76-57"},{"hadith-eng":"The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Allah, the Lord of the people! Remove the trouble and heal the patient, for You are the \nHealer. No healing is of any avail but Yours; healing that will leave behind no ailment.\"","reference":"Sahih al-Bukhari 5743, Book 76, Hadith 58","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) use when seeking healing for his family members?","id":"bukhari-76-58"},{"hadith-eng":"Allah's Messenger (ﷺ) used to treat with a Ruqya saying, \"O the Lord of the people! Remove the trouble The \ncure is in Your Hands, and there is none except You who can remove it (the disease) . \"","reference":"Sahih al-Bukhari 5744, Book 76, Hadith 59","grade":"","question #":"question #1","question":"What is the significance of seeking Allah's help in healing and curing diseases?","id":"bukhari-76-59"},{"hadith-eng":"The Prophet (ﷺ) used to say to the patient, \"In the Name of Allah The earth of our land and the saliva of \nsome of us cure our patient.\"","reference":"Sahih al-Bukhari 5745, Book 76, Hadith 60","grade":"","question #":"question #1","question":"What is the significance of invoking the name of Allah in seeking healing for a patient?","id":"bukhari-76-60"},{"hadith-eng":"Allah's Messenger (ﷺ) used to read in his Ruqya, \"In the Name of Allah\" The earth of our land and the saliva \nof some of us cure our patient with the permission of our Lord.\" with a slight shower of saliva) while \ntreating with a Ruqya.","reference":"Sahih al-Bukhari 5746, Book 76, Hadith 61","grade":"","question #":"question #1","question":"What is the significance of using the name of Allah in healing practices?","id":"bukhari-76-61"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"A good dream is from Allah, and a bad dream is from Satan. So if anyone \nof you sees (in a dream) something he dislikes, when he gets up he should blow thrice (on his left \nside) and seek refuge with Allah from its evil for then it will not harm him.\"","reference":"Sahih al-Bukhari 5747, Book 76, Hadith 62","grade":"","question #":"question #1","question":"What is the significance of distinguishing between good and bad dreams in Islamic teachings?","id":"bukhari-76-62"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to bed, he used to recite Surat-al-Ikhlas, Surat-al-Falaq and Surat-an- \nNas and then blow on his palms and pass them over his face and those parts of his body that his hands \ncould reach. And when he fell ill, he used to order me to do like that for him.","reference":"Sahih al-Bukhari 5748, Book 76, Hadith 63","grade":"","question #":"question #1","question":"What is the significance of reciting specific Surahs before going to sleep in Islamic tradition?","id":"bukhari-76-63"},{"hadith-eng":"A group of the companions of Allah's Messenger (ﷺ) proceeded on a journey till they dismounted near one of \nthe Arab tribes and requested them to entertain them as their guests, but they (the tribe people) refused \nto entertain them. Then the chief of that tribe was bitten by a snake (or stung by a scorpion) and he \nwas given all sorts of treatment, but all in vain. Some of them said, \"Will you go to the group (those \ntravelers) who have dismounted near you and see if one of them has something useful?\" They came to \nthem and said, \"O the group! Our leader has been bitten by a snake (or stung by a scorpion) and we \nhave treated him with everything but nothing benefited him Has anyone of you anything useful?\" One \nof them replied, \"Yes, by Allah, I know how to treat with a Ruqya. But. by Allah, we wanted you to \nreceive us as your guests but you refused. I will not treat your patient with a Ruqya till you fix for us \nsomething as wages.\" Consequently they agreed to give those travellers a flock of sheep. The man \nwent with them (the people of the tribe) and started spitting (on the bite) and reciting Surat-al-Fatiha \ntill the patient was healed and started walking as if he had not been sick. When the tribe people paid \nthem their wages they had agreed upon, some of them (the Prophet's companions) said, \"Distribute \n(the sheep).\" But the one who treated with the Ruqya said, \"Do not do that till we go to Allah's \nApostle and mention to him what has happened, and see what he will order us.\" So they came to \nAllah's Messenger (ﷺ) and mentioned the story to him and he said, \"How do you know that Surat-al-Fatiha is \na Ruqya? You have done the right thing. Divide (what you have got) and assign for me a share with \nyou.\"","reference":"Sahih al-Bukhari 5749, Book 76, Hadith 64","grade":"","question #":"question #1","question":"What is the significance of using Surah Al-Fatiha as a form of Ruqya in Islamic tradition?","id":"bukhari-76-64"},{"hadith-eng":"The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Lord of the people! Remove the difficulty and bring about healing as You are the \nHealer. There is no healing but Your Healing, a healing that will leave no ailment.\"","reference":"Sahih al-Bukhari 5750, Book 76, Hadith 65","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) use when seeking healing for his wives?","id":"bukhari-76-65"},{"hadith-eng":"The Prophet, during his fatal ailment used to blow (on his hands and pass them) over his body while \nreciting the Mu'auwidhat (Surat-an-Nas and Surat-al-Falaq). When his disease got aggravated, I used \nto recite them for him and blow (on his hands) and let him pass his hands over his body because of its \nblessing. (Ma`mar asked Ibn Shihab: How did he use to do Nafth? He said: He used to blow on his \nhands and then pass them over his face.)","reference":"Sahih al-Bukhari 5751, Book 76, Hadith 66","grade":"","question #":"question #1","question":"What is the significance of reciting Surat-an-Nas and Surat-al-Falaq for protection and healing in Islamic tradition?","id":"bukhari-76-66"},{"hadith-eng":"The Prophet (ﷺ) once came out to us and said, \"Some nations were displayed before me. A prophet would \npass in front of me with one man, and another with two men, and another with a group of people. and \nanother with nobody with him. Then I saw a great crowd covering the horizon and I wished that they \nwere my followers, but it was said to me, 'This is Moses and his followers.' Then it was said to me, \n'Look'' I looked and saw a big gathering with a large number of people covering the horizon. It was \nsaid, \"Look this way and that way.' So I saw a big crowd covering the horizon. Then it was said to me, \n\"These are your followers, and among them there are 70,000 who will enter Paradise without (being \nasked about their) accounts. \" Then the people dispersed and the Prophet (ﷺ) did not tell who those 70,000 \nwere. So the companions of the Prophet (ﷺ) started talking about that and some of them said, \"As regards \nus, we were born in the era of heathenism, but then we believed in Allah and His Apostle . We think \nhowever, that these (70,000) are our offspring.\" That talk reached the Prophet (ﷺ) who said, \"These \n(70,000) are the people who do not draw an evil omen from (birds) and do not get treated by branding \nthemselves and do not treat with Ruqya, but put their trust (only) in their Lord.\" then 'Ukasha bin \nMuhsin got up and said, \"O Allah's Messenger (ﷺ)! Am I one of those (70,000)?\" The Prophet (ﷺ) said, \"Yes.\" \nThen another person got up and said, \"Am I one of them?\" The Prophet (ﷺ) said, \" 'Ukasha has anticipated \nyou.\"","reference":"Sahih al-Bukhari 5752, Book 76, Hadith 67","grade":"","question #":"question #1","question":"What characteristics are mentioned as qualities of those who will enter Paradise without being questioned?","id":"bukhari-76-67"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There is neither 'Adwa (no contagious disease is conveyed to others without \nAllah's permission) nor Tiyara, but an evil omen may be in three a woman, a house or an animal.\"","reference":"Sahih al-Bukhari 5753, Book 76, Hadith 68","grade":"","question #":"question #1","question":"What is the Islamic perspective on the concept of contagious diseases and their transmission?","id":"bukhari-76-68"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There is no Tiyara, and the best omen is the Fal.\" They asked, \"What \nis the Fal?\" He said, \"A good word that one of you hears (and takes as a good omen).","reference":"Sahih al-Bukhari 5754, Book 76, Hadith 69","grade":"","question #":"question #1","question":"What is the concept of Tiyara in Islamic teachings and how is it viewed?","id":"bukhari-76-69"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no Tiyara and the best omen is the Fal,\" Somebody said, \"What is the Fal, \nO Allah's Messenger (ﷺ)?\" He said, \"A good word that one of you hears (and takes as a good omen).","reference":"Sahih al-Bukhari 5755, Book 76, Hadith 70","grade":"","question #":"question #1","question":"What is the Islamic perspective on omens and superstitions?","id":"bukhari-76-70"},{"hadith-eng":"The Prophet (ﷺ) said, \"No 'Adwa (no contagious disease is conveyed to others without Allah's permission), \nnor Tiyara, but I like the good Fal, i.e., the good word.\"","reference":"Sahih al-Bukhari 5756, Book 76, Hadith 71","grade":"","question #":"question #1","question":"What is the Islamic perspective on the concept of contagious diseases and divine permission?","id":"bukhari-76-71"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no 'Adwa, nor Tiyara, nor Hama, nor Safar.\"","reference":"Sahih al-Bukhari 5757, Book 76, Hadith 72","grade":"","question #":"question #1","question":"What are the beliefs or practices that the Prophet Muhammad (ﷺ) negated in this statement?","id":"bukhari-76-72"},{"hadith-eng":"Allah's Messenger (ﷺ) gave his verdict about two ladies of the Hudhail tribe who had fought each other and \none of them had hit the other with a stone. The stone hit her `Abdomen and as she was pregnant, the \nblow killed the child in her womb. They both filed their case with the Prophet (ﷺ) and he judged that the \nblood money for what was in her womb. was a slave or a female slave. The guardian of the lady who \nwas fined said, \"O Allah's Messenger (ﷺ)! Shall I be fined for a creature that has neither drunk nor eaten, \nneither spoke nor cried? A case like that should be nullified.\" On that the Prophet (ﷺ) said, \"This is one of \nthe brothers of soothsayers.","reference":"Sahih al-Bukhari 5758, Book 76, Hadith 73","grade":"","question #":"question #1","question":"What is the Islamic ruling on blood money for an unborn child in the case of accidental harm?","id":"bukhari-76-73"},{"hadith-eng":"Two ladies (had a fight) and one of them hit the other with a stone on the `Abdomen and caused her to \nabort. The Prophet (ﷺ) judged that the victim be given either a slave or a female slave (as blood-money). \nNarrated Ibn Shihab: Sa`id bin Al-Musayyab said, \"Allah's Messenger (ﷺ) judged that in case of child killed \nin the womb of its mother, the offender should give the mother a slave or a female slave in \nrecompense The offender said, How can I be fined for killing one who neither ate nor drank, neither \nspoke nor cried: a case like that should be denied ' On that Allah's Messenger (ﷺ) said 'He is one of the \nbrothers of the foretellers","reference":"Sahih al-Bukhari 5759, 5760, Book 76, Hadith 74","grade":"","question #":"question #1","question":"What is the Islamic ruling on causing harm that results in the loss of an unborn child?","id":"bukhari-76-74"},{"hadith-eng":"Two ladies (had a fight) and one of them hit the other with a stone on the `Abdomen and caused her to \nabort. The Prophet (ﷺ) judged that the victim be given either a slave or a female slave (as blood-money). \nNarrated Ibn Shihab: Sa`id bin Al-Musayyab said, \"Allah's Messenger (ﷺ) judged that in case of child killed \nin the womb of its mother, the offender should give the mother a slave or a female slave in \nrecompense The offender said, How can I be fined for killing one who neither ate nor drank, neither \nspoke nor cried: a case like that should be denied ' On that Allah's Messenger (ﷺ) said 'He is one of the \nbrothers of the foretellers","reference":"Sahih al-Bukhari 5759, 5760, Book 76, Hadith 74","grade":"","question #":"question #1","question":"What is the Islamic ruling on compensation for causing harm to an unborn child?","id":"bukhari-76-75"},{"hadith-eng":"The Prophet (ﷺ) forbade the utilization of the price of a dog, the earnings of prostitute and the earnings of \na foreteller.","reference":"Sahih al-Bukhari 5761, Book 76, Hadith 75","grade":"","question #":"question #1","question":"What types of earnings are considered forbidden in Islam according to the teachings of the Prophet (ﷺ)?","id":"bukhari-76-76"},{"hadith-eng":"Some people asked Allah's Messenger (ﷺ) about the fore-tellers He said. ' They are nothing\" They said, 'O \nAllah's Messenger (ﷺ)! Sometimes they tell us of a thing which turns out to be true.\" Allah's Messenger (ﷺ) said, \"A \nJinn snatches that true word and pours it Into the ear of his friend (the fore-teller) (as one puts \nsomething into a bottle) The foreteller then mixes with that word one hundred lies.\"","reference":"Sahih al-Bukhari 5762, Book 76, Hadith 76","grade":"","question #":"question #1","question":"What is the Islamic perspective on the reliability of fortune-tellers and their predictions?","id":"bukhari-76-77"},{"hadith-eng":"A man called Labid bin al-A'sam from the tribe of Bani Zaraiq worked magic on Allah's Messenger (ﷺ) till \nAllah's Messenger (ﷺ) started imagining that he had done a thing that he had not really done. One day or one \nnight he was with us, he invoked Allah and invoked for a long period, and then said, \"O `Aisha! Do \nyou know that Allah has instructed me concerning the matter I have asked him about? Two men came \nto me and one of them sat near my head and the other near my feet. One of them said to his \ncompanion, \"What is the disease of this man?\" The other replied, \"He is under the effect of magic.' \nThe first one asked, 'Who has worked the magic on him?' The other replied, \"Labid bin Al-A'sam.' \nThe first one asked, 'What material did he use?' The other replied, 'A comb and the hairs stuck to it \nand the skin of pollen of a male date palm.' The first one asked, 'Where is that?' The other replied, \n'(That is) in the well of Dharwan;' \" So Allah's Messenger (ﷺ) along with some of his companions went there \nand came back saying, \"O `Aisha, the color of its water is like the infusion of Henna leaves. The tops \nof the date-palm trees near it are like the heads of the devils.\" I asked. \"O Allah's Messenger (ﷺ)? Why did \nyou not show it (to the people)?\" He said, \"Since Allah cured me, I disliked to let evil spread among \nthe people.\" Then he ordered that the well be filled up with earth.","reference":"Sahih al-Bukhari 5763, Book 76, Hadith 77","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take upon discovering he was affected by magic?","id":"bukhari-76-78"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Avoid the Mubiqat, i.e., shirk and witchcraft.\"","reference":"Sahih al-Bukhari 5764, Book 76, Hadith 78","grade":"","question #":"question #1","question":"What are the major sins that should be avoided in Islam?","id":"bukhari-76-79"},{"hadith-eng":"Magic was worked on Allah's Messenger (ﷺ) so that he used to think that he had sexual relations with his \nwives while he actually had not (Sufyan said: That is the hardest kind of magic as it has such an \neffect). Then one day he said, \"O `Aisha do you know that Allah has instructed me concerning the \nmatter I asked Him about? Two men came to me and one of them sat near my head and the other sat \nnear my feet. The one near my head asked the other. What is wrong with this man?' The latter replied \nthe is under the effect of magic The first one asked, Who has worked magic on him?' The other \nreplied Labid bin Al-A'sam, a man from Bani Zuraiq who was an ally of the Jews and was a \nhypocrite.' The first one asked, What material did he use)?' The other replied, 'A comb and the hair \nstuck to it.' The first one asked, 'Where (is that)?' The other replied. 'In a skin of pollen of a male date \npalm tree kept under a stone in the well of Dharwan' '' So the Prophet (ﷺ) went to that well and took out \nthose things and said \"That was the well which was shown to me (in a dream) Its water looked like the \ninfusion of Henna leaves and its date-palm trees looked like the heads of devils.\" The Prophet (ﷺ) added, \n\"Then that thing was taken out' I said (to the Prophet (ﷺ) ) \"Why do you not treat yourself with Nashra?\" \nHe said, \"Allah has cured me; I dislike to let evil spread among my people.\"","reference":"Sahih al-Bukhari 5765, Book 76, Hadith 79","grade":"","question #":"question #1","question":"What is the significance of dreams in providing guidance or solutions to problems in Islamic tradition?","id":"bukhari-76-80"},{"hadith-eng":"Magic was worked on Allah's Messenger (ﷺ) so that he began to imagine that he had done something \nalthough he had not. One day while he was with me, he invoked Allah and invoked for a long period \nand then said, \"O `Aisha! Do you know that Allah has instructed me regarding the matter I asked Him \nabout?\" I asked, \"What is that, O Allah's Messenger (ﷺ)?\" He said, \"Two men came to me; one of them sat \nnear my head and the other sat near my feet. One of them asked his companion, 'What is the disease of \nthis man?' The other replied, 'He is under the effect of magic.' The first one asked, 'Who has worked \nmagic on him?\" The other replied, 'Labid bin A'sam, a Jew from the tribe of Bani Zuraiq.' The (first \none asked), 'With what has it been done?' The other replied, 'With a a comb and the hair stuck to it and \na skin of the pollen of a male datepalm tree.' The first one asked, 'Where is it?' The other replied, 'In \nthe well of Dharwan.' Then the Prophet (ﷺ) went along with some of his companions to that well and \nlooked at that and there were date palms near to it. Then he returned to me and said, 'By Allah the \nwater of that well was (red) like the infusion of Henna leaves and its date-palms were like the heads of \ndevils\" I said, O Allah's Messenger (ﷺ)! Did you take those materials out of the pollen skin?\" He said, 'No! \nAs for me Allah has healed me and cured me and I was afraid that (by Showing that to the people) I \nwould spread evil among them when he ordered that the well be filled up with earth, and it was filled \nup with earth \"","reference":"Sahih al-Bukhari 5766, Book 76, Hadith 80","grade":"","question #":"question #1","question":"What is the significance of seeking divine guidance and intervention in times of distress?","id":"bukhari-76-81"},{"hadith-eng":"Two men came from the East and addressed the people who wondered at their eloquent speeches On \nthat Allah's Messenger (ﷺ) said. Some eloquent speech is as effective as magic.'","reference":"Sahih al-Bukhari 5767, Book 76, Hadith 81","grade":"","question #":"question #1","question":"How can eloquent speech influence people according to Islamic teachings?","id":"bukhari-76-82"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody takes some `Ajwa dates every morning, he will not be affected by \npoison or magic on that day till night.\" (Another narrator said seven dates).","reference":"Sahih al-Bukhari 5768, Book 76, Hadith 82","grade":"","question #":"question #1","question":"What are the benefits of consuming Ajwa dates according to Islamic teachings?","id":"bukhari-76-83"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"If Somebody takes seven 'Ajwa dates in the morning, neither magic \nnor poison will hurt him that day.\"","reference":"Sahih al-Bukhari 5769, Book 76, Hadith 83","grade":"","question #":"question #1","question":"What are the benefits of consuming 'Ajwa dates according to Islamic teachings?","id":"bukhari-76-84"},{"hadith-eng":"The Prophet (ﷺ) said, 'No 'Adwa (i.e. no contagious disease is conveyed to\n     others without Allah's permission); nor (any evil omen in the month of)\n     Safar; nor Hama\" A bedouin said, \"O Allah's Messenger (ﷺ)! What about the \n     camels which, when on the sand (desert) look like deers, but when a \n     mangy camel mixes with them they all get infected with mange?\" On that\n     Allah s Apostle said, \"Then who conveyed the (mange) disease to the \n     first (mangy) camel?\"","reference":"Sahih al-Bukhari 5770, Book 76, Hadith 84","grade":"","question #":"question #1","question":"What is the Islamic perspective on the transmission of diseases and the role of divine will?","id":"bukhari-76-85"},{"hadith-eng":"Allah's Messenger (ﷺ) said: The cattle (sheep, cows, camels, etc.) suffering\n     from a disease should not be mixed up with healthy cattle, (or said: \n     \"Do not put a patient with a healthy person ). \" (as a precaution).","reference":"Sahih al-Bukhari 5771, Book 76, Hadith 85","grade":"","question #":"question #1","question":"What precautions should be taken to prevent the spread of disease among livestock?","id":"bukhari-76-86"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"there is neither 'Adwa nor Tiyara, and an evil omen is only in three: a horse, a \nwoman and a house.\"","reference":"Sahih al-Bukhari 5772, Book 76, Hadith 86","grade":"","question #":"question #1","question":"What are the beliefs regarding superstitions and omens in Islam?","id":"bukhari-76-87"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"No 'Adwa.\" Abu Huraira also said: The Prophet (ﷺ) said, \"The cattle suffering from \na disease should not be mixed up with healthy cattle (or said \"Do not put a patient with a healthy \nperson as a precaution.\") Abu Huraira also said: Allah's Messenger (ﷺ) said, \"No 'Adwa.\" A bedouin got up \nand said, \"Don't you see how camels on the sand look like deer but when a mangy camel mixes with \nthem, they all get infected with mange?\" On that the Prophet (ﷺ) said, \"Then who conveyed the (mange) \ndisease to the first camel?\"","reference":"Sahih al-Bukhari 5773-5775, Book 76, Hadith 87","grade":"","question #":"question #1","question":"What is the Islamic perspective on the concept of contagious diseases and their transmission?","id":"bukhari-76-88"},{"hadith-eng":"The Prophet (ﷺ) said, \"No 'Adwa nor Tiyara; but I like Fal.\" They said, \"What is the Fal?\" He said, \"A \ngood word.\"","reference":"Sahih al-Bukhari 5776, Book 76, Hadith 88","grade":"","question #":"question #1","question":"What is the significance of avoiding superstitions like 'Adwa and Tiyara in Islam?","id":"bukhari-76-89"},{"hadith-eng":"When Khaibar was conquered, Allah's Messenger (ﷺ) was presented with a poisoned (roasted) sheep. Allah's \nApostle said, \"Collect for me all the Jews present in this area.\" (When they were gathered) Allah's \nApostle said to them, \"I am going to ask you about something; will you tell me the truth?\" They \nreplied, \"Yes, O Abal-Qasim!\" Allah's Messenger (ﷺ) said to them, \"Who is your father?\" They said, \"Our \nfather is so-and-so.\" Allah's Messenger (ﷺ) said, \"You have told a lie. for your father is so-and-so,\" They \nsaid, \"No doubt, you have said the truth and done the correct thing.\" He again said to them, \"If I ask \nyou about something; will you tell me the truth?\" They replied, \"Yes, O Abal-Qasim! And if we \nshould tell a lie you will know it as you have known it regarding our father,\" Allah's Messenger (ﷺ) then \nasked, \"Who are the people of the (Hell) Fire?\" They replied, \"We will remain in the (Hell) Fire for a \nwhile and then you (Muslims) will replace us in it\" Allah's Messenger (ﷺ) said to them. ''You will abide in it \nwith ignominy. By Allah, we shall never replace you in it at all.\" Then he asked them again, \"If I ask \nyou something, will you tell me the truth?\" They replied, \"Yes.\" He asked. \"Have you put the poison \nin this roasted sheep?\" They replied, \"Yes,\" He asked, \"What made you do that?\" They replied, \"We \nintended to learn if you were a liar in which case we would be relieved from you, and if you were a \nprophet then it would not harm you.\"","reference":"Sahih al-Bukhari 5777, Book 76, Hadith 89","grade":"","question #":"question #1","question":"What was the reaction of the Jews when the Prophet Muhammad (ﷺ) confronted them about their ancestry?","id":"bukhari-76-90"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever purposely throws himself from a mountain and kills himself, will be in \nthe (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison \nand kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire \nwherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be \ncarrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will \nabide eternally forever.\"","reference":"Sahih al-Bukhari 5778, Book 76, Hadith 90","grade":"","question #":"question #1","question":"What are the consequences of committing suicide according to Islamic teachings?","id":"bukhari-76-91"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Whoever takes seven 'Ajwa dates in the morning will not be effected \nby magic or poison on that day.\"","reference":"Sahih al-Bukhari 5779, Book 76, Hadith 91","grade":"","question #":"question #1","question":"What are the benefits of consuming 'Ajwa dates according to Islamic teachings?","id":"bukhari-76-92"},{"hadith-eng":"The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this \nnarration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we \nperform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of \ncamels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. \nAs for the milk of she-asses, we have learnt that Allah's Messenger (ﷺ) forbade the eating of their meat, but \nwe have not received any information whether drinking of their milk is allowed or forbidden.\" As for \nthe bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Messenger (ﷺ) forbade \nthe eating of the flesh of every wild beast having fangs . \"","reference":"Sahih al-Bukhari 5780, 5781, Book 76, Hadith 92","grade":"","question #":"question #1","question":"What types of animals are prohibited for consumption in Islam according to the teachings of the Prophet (ﷺ)?","id":"bukhari-76-93"},{"hadith-eng":"The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this \nnarration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we \nperform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of \ncamels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. \nAs for the milk of she-asses, we have learnt that Allah's Messenger (ﷺ) forbade the eating of their meat, but \nwe have not received any information whether drinking of their milk is allowed or forbidden.\" As for \nthe bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Messenger (ﷺ) forbade \nthe eating of the flesh of every wild beast having fangs . \"","reference":"Sahih al-Bukhari 5780, 5781, Book 76, Hadith 92","grade":"","question #":"question #1","question":"What is the Islamic ruling on consuming the meat of wild animals with fangs?","id":"bukhari-76-94"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and \nthen throw it away, for in one of its wings there is a disease and in the other there is healing (antidote \nfor it) i e. the treatment for that disease.\"","reference":"Sahih al-Bukhari 5782, Book 76, Hadith 93","grade":"","question #":"question #1","question":"What is the significance of dipping a fly into a vessel according to Islamic teachings?","id":"bukhari-76-95"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no disease that Allah has created, except that He also has created its \ntreatment.\"","reference":"Sahih al-Bukhari 5678, Book 76, Hadith 1","grade":"","question #":"question #2","question":"How does this statement reflect the belief in Allah's wisdom and provision for human ailments?","id":"bukhari-76-96"},{"hadith-eng":"We used to go for Military expeditions along with Allah's Messenger (ﷺ) and provide the people with water, \nserve them and bring the dead and the wounded back to Medina.","reference":"Sahih al-Bukhari 5679, Book 76, Hadith 2","grade":"","question #":"question #2","question":"How were the wounded and deceased handled during the military campaigns led by the Prophet Muhammad (ﷺ)?","id":"bukhari-76-97"},{"hadith-eng":"(The Prophet (ﷺ) said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire \n(cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\"","reference":"Sahih al-Bukhari 5680, Book 76, Hadith 3","grade":"","question #":"question #2","question":"Why is branding with fire discouraged in Islamic teachings despite being considered a method of healing?","id":"bukhari-76-98"},{"hadith-eng":"The Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding \nwith fire) but I forbid my followers to use cauterization (branding with fire).","reference":"Sahih al-Bukhari 5681, Book 76, Hadith 4","grade":"","question #":"question #2","question":"Why is cauterization discouraged in the context of healing according to Islamic teachings?","id":"bukhari-76-99"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things and honey.","reference":"Sahih al-Bukhari 5682, Book 76, Hadith 5","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) view sweet foods and honey?","id":"bukhari-76-100"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If there is any healing in your medicines, then it is in cupping, a gulp of \nhoney or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) \nbranded with fire.\"","reference":"Sahih al-Bukhari 5683, Book 76, Hadith 6","grade":"","question #":"question #2","question":"What is the significance of cupping and honey in Islamic medicine?","id":"bukhari-76-101"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"My brother has some Abdominal trouble.\" The Prophet (ﷺ) said to \nhim \"Let him drink honey.\" The man came for the second time and the Prophet (ﷺ) said to him, 'Let him \ndrink honey.\" He came for the third time and the Prophet (ﷺ) said, \"Let him drink honey.\" He returned \nagain and said, \"I have done that ' The Prophet (ﷺ) then said, \"Allah has said the truth, but your brother's \n`Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.","reference":"Sahih al-Bukhari 5684, Book 76, Hadith 7","grade":"","question #":"question #2","question":"How does persistence in following prophetic advice relate to achieving desired outcomes?","id":"bukhari-76-102"},{"hadith-eng":"Some people were sick and they said, \"O Allah's Messenger (ﷺ)! Give us shelter and food. So when they \nbecame healthy they said, \"The weather of Medina is not suitable for us.\" So he sent them to Al-Harra \nwith some she-camels of his and said, \"Drink of their milk.\" But when they became healthy, they \nkilled the shepherd of the Prophet (ﷺ) and drove away his camels. The Prophet (ﷺ) sent some people in their \npursuit. Then he got their hands and feet cut and their eyes were branded with heated pieces of iron. I \nsaw one of them licking the earth with his tongue till he died.","reference":"Sahih al-Bukhari 5685, Book 76, Hadith 8","grade":"","question #":"question #2","question":"How does Islamic law address the punishment for severe crimes such as murder and theft?","id":"bukhari-76-103"},{"hadith-eng":"The climate of Medina did not suit some people, so the Prophet (ﷺ) ordered them to follow his shepherd, \ni.e. his camels, and drink their milk and urine (as a medicine). So they followed the shepherd that is \nthe camels and drank their milk and urine till their bodies became healthy. Then they killed the \nshepherd and drove away the camels. When the news reached the Prophet (ﷺ) he sent some people in their \npursuit. When they were brought, he cut their hands and feet and their eyes were branded with heated \npieces of iron.","reference":"Sahih al-Bukhari 5686, Book 76, Hadith 9","grade":"","question #":"question #2","question":"What were the consequences faced by those who harmed the Prophet's (ﷺ) shepherd and camels?","id":"bukhari-76-104"},{"hadith-eng":"We went out and Ghalib bin Abjar was accompanying us. He fell ill on the way and when we arrived \nat Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black \ncumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting \nmixture into both nostrils, for `Aisha has narrated to me that she heard the Prophet (ﷺ) saying, 'This black \ncumin is healing for all diseases except As-Sam.' Aisha said, 'What is As-Sam?' He said, 'Death.\"","reference":"Sahih al-Bukhari 5687, Book 76, Hadith 10","grade":"","question #":"question #2","question":"How is black cumin used as a treatment in Islamic medicine?","id":"bukhari-76-105"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There is healing in black cumin for all diseases except death.\"","reference":"Sahih al-Bukhari 5688, Book 76, Hadith 11","grade":"","question #":"question #2","question":"How is black cumin perceived in terms of its healing properties for various diseases?","id":"bukhari-76-106"},{"hadith-eng":"Aisha used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. \nShe used to say, \"I heard Allah's Messenger (ﷺ) saying, 'at-Talbina gives rest to the heart of the patient and \nmakes it active and relieves some of his sorrow and grief.'\"","reference":"Sahih al-Bukhari 5689, Book 76, Hadith 12","grade":"","question #":"question #2","question":"How can at-Talbina affect the emotional state of a person according to Islamic teachings?","id":"bukhari-76-107"},{"hadith-eng":"`Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is \nbeneficial.''","reference":"Sahih al-Bukhari 5690, Book 76, Hadith 13","grade":"","question #":"question #2","question":"How can something that is disliked by a patient still be beneficial for them?","id":"bukhari-76-108"},{"hadith-eng":"The Prophet (ﷺ) was cupped and he paid the wages to the one who had cupped him and then took Su'ut \n(Medicine sniffed by nose).","reference":"Sahih al-Bukhari 5691, Book 76, Hadith 14","grade":"","question #":"question #2","question":"How does this narration illustrate the Prophet's approach to compensating for services received?","id":"bukhari-76-109"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.","reference":"Sahih al-Bukhari 5692, 5693, Book 76, Hadith 15","grade":"","question #":"question #2","question":"How should one treat throat trouble and pleurisy as per the guidance of the Prophet (ﷺ)?","id":"bukhari-76-110"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.","reference":"Sahih al-Bukhari 5692, 5693, Book 76, Hadith 15","grade":"","question #":"question #2","question":"How should one treat throat trouble and pleurisy as per the guidance of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-111"},{"hadith-eng":"The Prophet (ﷺ) was cupped while he was fasting.","reference":"Sahih al-Bukhari 5694, Book 76, Hadith 16","grade":"","question #":"question #2","question":"How does the practice of cupping relate to the observance of fasting?","id":"bukhari-76-112"},{"hadith-eng":"The Prophet (ﷺ) was cupped while he was in a state of Ihram.","reference":"Sahih al-Bukhari 5695, Book 76, Hadith 17","grade":"","question #":"question #2","question":"How does the state of Ihram affect the permissibility of certain actions or treatments?","id":"bukhari-76-113"},{"hadith-eng":"that he was asked about the wages of the one who cups others. He said, 'Allah's Messenger (ﷺ) was cupped \nby `Abd Taiba, to whom he gave two Sa of food and interceded for him with his masters who \nconsequently reduced what they used to charge him daily. Then the Prophet (ﷺ) s said, \"The best \nmedicines you may treat yourselves with are cupping and sea incense.' He added, \"You should not \ntorture your children by treating tonsillitis by pressing the tonsils or the palate with the finger, but use \nincense.\"","reference":"Sahih al-Bukhari 5696, Book 76, Hadith 18","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate kindness and intercession for others in his community?","id":"bukhari-76-114"},{"hadith-eng":"that he paid Al-Muqanna a visit during his illness and said, \"I will not leave till he gets cupped, for I \nheard Allah's Messenger (ﷺ) saying, \"There is healing in cupping.\"","reference":"Sahih al-Bukhari 5697, Book 76, Hadith 19","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) demonstrate their trust in his guidance regarding health practices?","id":"bukhari-76-115"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.","reference":"Sahih al-Bukhari 5698, 5699, Book 76, Hadith 20","grade":"","question #":"question #2","question":"How does the practice of cupping relate to the actions of the Prophet Muhammad (ﷺ) during his journey to Mecca?","id":"bukhari-76-116"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.","reference":"Sahih al-Bukhari 5698, 5699, Book 76, Hadith 20","grade":"","question #":"question #2","question":"How does the practice of cupping relate to the health and well-being of an individual in Islamic teachings?","id":"bukhari-76-117"},{"hadith-eng":"The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .","reference":"Sahih al-Bukhari 5700, 5701, Book 76, Hadith 21","grade":"","question #":"question #2","question":"How does the state of Ihram affect the permissibility of medical treatments?","id":"bukhari-76-118"},{"hadith-eng":"The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .","reference":"Sahih al-Bukhari 5700, 5701, Book 76, Hadith 21","grade":"","question #":"question #2","question":"How does Islamic law view medical treatment while in a state of Ihram?","id":"bukhari-76-119"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If there is any good in your medicines, then it is in a gulp of honey, a \ncupping operation, or branding (cauterization), but I do not like to be (cauterized) branded.","reference":"Sahih al-Bukhari 5702, Book 76, Hadith 22","grade":"","question #":"question #2","question":"What is the significance of honey in Islamic medicine according to the Prophet (ﷺ)?","id":"bukhari-76-120"},{"hadith-eng":"The Prophet (ﷺ) came to me during the period of Al-Hudaibiya, while I was lighting fire underneath a \ncooking pot and lice were falling down my head. He said, \"Do your lice hurt your?\" I said, \"Yes.\" He \nsaid, \"Shave your head and fast for three days or feed six poor persons or slaughter a sheep as a \nsacrifice:\"","reference":"Sahih al-Bukhari 5703, Book 76, Hadith 23","grade":"","question #":"question #2","question":"How does Islamic teaching address personal hygiene issues during religious observances?","id":"bukhari-76-121"},{"hadith-eng":"The Prophet (ﷺ) said, \"If there is any healing in your medicines then it is a cupping operation, or branding \n(cauterization), but I do not like to be (cauterized) branded.\"","reference":"Sahih al-Bukhari 5704, Book 76, Hadith 24","grade":"","question #":"question #2","question":"What is the Islamic perspective on the practice of cupping as a form of treatment?","id":"bukhari-76-122"},{"hadith-eng":"Allah's Messenger (ﷺ) said, 'Nations were displayed before me; one or two prophets would pass by along \nwith a few followers. A prophet would pass by accompanied by nobody. Then a big crowd of people \npassed in front of me and I asked, Who are they Are they my followers?\" It was said, 'No. It is Moses \nand his followers It was said to me, 'Look at the horizon.'' Behold! There was a multitude of people \nfilling the horizon. Then it was said to me, 'Look there and there about the stretching sky! Behold! \nThere was a multitude filling the horizon,' It was said to me, 'This is your nation out of whom seventy \nthousand shall enter Paradise without reckoning.' \"Then the Prophet (ﷺ) entered his house without telling \nhis companions who they (the 70,000) were. So the people started talking about the issue and said, \"It \nis we who have believed in Allah and followed His Apostle; therefore those people are either \nourselves or our children who are born m the Islamic era, for we were born in the Pre-lslamic Period \nof Ignorance.'' When the Prophet (ﷺ) heard of that, he came out and said. \"Those people are those who do \nnot treat themselves with Ruqya, nor do they believe in bad or good omen (from birds etc.) nor do \nthey get themselves branded (Cauterized). but they put their trust (only) in their Lord \" On that \n'Ukasha bin Muhsin said. \"Am I one of them, O Allah's Messenger (ﷺ)?' The Prophet (ﷺ) said, \"Yes.\" Then \nanother person got up and said, \"Am I one of them?\" The Prophet (ﷺ) said, 'Ukasha has anticipated you.\"","reference":"Sahih al-Bukhari 5705, Book 76, Hadith 25","grade":"","question #":"question #2","question":"How does trust in Allah relate to the concept of entering Paradise without reckoning?","id":"bukhari-76-123"},{"hadith-eng":"The husband of a lady died and her eyes became sore and the people mentioned her story to the \nProphet They asked him whether it was permissible for her to use kohl as her eyes were exposed to \ndanger. He said, \"Previously, when one of you was bereaved by a husband she would stay in her dirty \nclothes in a bad unhealthy house (for one year), and when a dog passed by, she would throw a globe \nof dung. No, (she should observe the prescribed period Idda) for four months and ten days.'","reference":"Sahih al-Bukhari 5706, Book 76, Hadith 26","grade":"","question #":"question #2","question":"How did the traditional practices for widows change with the guidance of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-124"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(There is) no 'Adwa (no contagious disease is conveyed without Allah's permission). nor is there any bad omen (from birds), nor is there any Hamah, nor is there any bad omen in the month of Safar, and one should run away from the leper as one runs away from a lion.\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Sahih al-Bukhari 5707, Book 76, Hadith 27","grade":"","question #":"question #2","question":"How should Muslims approach the concept of bad omens and superstitions?","id":"bukhari-76-125"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Truffles are like Manna (i.e. they grow naturally without man's care) and \ntheir water heals eye diseases.\"","reference":"Sahih al-Bukhari 5708, Book 76, Hadith 28","grade":"","question #":"question #2","question":"How are truffles compared to Manna in terms of their growth and significance?","id":"bukhari-76-126"},{"hadith-eng":"Abu Bakr kissed (the forehead of) the Prophet (ﷺ) when he was dead. `Aisha added: We put medicine in \none side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He \ndislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not \nforbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just \nbecause a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be \nforced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had \nnot witnessed your deed.\"","reference":"Sahih al-Bukhari 5709-5712, Book 76, Hadith 29","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react to his instructions regarding medicine?","id":"bukhari-76-127"},{"hadith-eng":"Abu Bakr kissed (the forehead of) the Prophet (ﷺ) when he was dead. `Aisha added: We put medicine in \none side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He \ndislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not \nforbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just \nbecause a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be \nforced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had \nnot witnessed your deed.\"","reference":"Sahih al-Bukhari 5709-5712, Book 76, Hadith 29","grade":"","question #":"question #2","question":"How did the companions react to the Prophet's instructions regarding medicine?","id":"bukhari-76-128"},{"hadith-eng":"I went to Allah's Messenger (ﷺ) along with a a son of mine whose palate and tonsils I had pressed with my \nfinger as a treatment for a (throat and tonsil) disease. The Prophet (ﷺ) said, \"Why do you pain your \nchildren by pressing their throats! Use Ud Al-Hindi (certain Indian incense) for it cures seven \ndiseases, one of which is pleurisy. It is used as a snuff for treating throat and tonsil disease and it is \ninserted into one side of the mouth of one suffering from pleurisy.\"","reference":"Sahih al-Bukhari 5713, Book 76, Hadith 30","grade":"","question #":"question #2","question":"What are the benefits of using Ud Al-Hindi according to Islamic teachings?","id":"bukhari-76-129"},{"hadith-eng":"(the wife of the Prophet) \nWhen the health of Allah's Messenger (ﷺ) deteriorated and his condition became serious, he asked the \npermission of all his wives to allow him to be treated In my house, and they allowed him. He came \nout, supported by two men and his legs were dragging on the ground between `Abbas and another \nman. (The sub-narrator told Ibn `Abbas who said: Do you know who was the other man whom `Aisha \ndid not mention? The sub-narrator said: No. Ibn `Abbas said: It was `Ali.) `Aisha added: When the \nProphet entered my house and his disease became aggravated, he said, \"Pour on me seven water skins \nfull of water (the tying ribbons of which had not been untied) so that I may give some advice to the \npeople.\" So we made him sit in a tub belonging to Hafsa, the wife of the Prophet (ﷺ) and started pouring \nwater on him from those water skins till he waved us to stop. Then he went out to the people and led \nthem in prayer and delivered a speech before them.","reference":"Sahih al-Bukhari 5714, Book 76, Hadith 31","grade":"","question #":"question #2","question":"How did the Prophet demonstrate his commitment to his community even during his illness?","id":"bukhari-76-130"},{"hadith-eng":"that she took to Allah's Messenger (ﷺ) one of her sons whose palate and tonsils she had pressed because he \nhad throat trouble. The Prophet (ﷺ) said, \"Why do you pain your children by getting the palate pressed \nlike that? Use the Ud Al-Hindi (certain Indian incense) for it cures seven diseases one of which is \npleurisy.\"","reference":"Sahih al-Bukhari 5715, Book 76, Hadith 32","grade":"","question #":"question #2","question":"How does Islamic guidance address the care and treatment of children with illnesses?","id":"bukhari-76-131"},{"hadith-eng":"A man came to the prophet and said, 'My brother has got loose motions. The Prophet (ﷺ) said, Let him \ndrink honey.\" The man again (came) and said, 'I made him drink (honey) but that made him worse.' \nThe Prophet (ﷺ) said, 'Allah has said the Truth, and the `Abdomen of your brother has told a lie.\" (See \nHadith No. 88)","reference":"Sahih al-Bukhari 5716, Book 76, Hadith 33","grade":"","question #":"question #2","question":"How does this narration illustrate the relationship between divine truth and human perception?","id":"bukhari-76-132"},{"hadith-eng":"Allah's Messenger (ﷺ) said, 'There is no 'Adwa (no disease is conveyed from the sick to the healthy without \nAllah's permission), nor Safar, nor Hama.\" A bedouin stood up and said, \"Then what about my \ncamels? They are like deer on the sand, but when a mangy camel comes and mixes with them, they all \nget infected with mangy.\" The Prophet (ﷺ) said, \"Then who conveyed the (mange) disease to the first \none?\"","reference":"Sahih al-Bukhari 5717, Book 76, Hadith 34","grade":"","question #":"question #2","question":"How does the concept of divine permission relate to the spread of illnesses in Islam?","id":"bukhari-76-133"},{"hadith-eng":"that she took to Allah's Messenger (ﷺ) one of her sons whose palate and tonsils she had pressed to treat a \nthroat trouble. The Prophet (ﷺ) said, \"Be afraid of Allah! Why do you pain your children by having their \ntonsils pressed like that? Use the Ud Al-Hindi (a certain Indian incense) for it cures seven diseases, \none of which is pleurisy.\"","reference":"Sahih al-Bukhari 5718, Book 76, Hadith 35","grade":"","question #":"question #2","question":"What alternative remedy did the Prophet Muhammad (ﷺ) suggest for treating throat ailments?","id":"bukhari-76-134"},{"hadith-eng":"Allah's Messenger (ﷺ) allowed one of the Ansar families to treat persons who have taken poison and also \nwho are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for \npleurisy, when Allah's Messenger (ﷺ) was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit \nwitnessed that, and it was Abu Talha who branded (cauterized) me.","reference":"Sahih al-Bukhari 5719, 5720, 5721, Book 76, Hadith 36","grade":"","question #":"question #2","question":"How was the practice of cauterization viewed and utilized during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-135"},{"hadith-eng":"Allah's Messenger (ﷺ) allowed one of the Ansar families to treat persons who have taken poison and also \nwho are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for \npleurisy, when Allah's Messenger (ﷺ) was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit \nwitnessed that, and it was Abu Talha who branded (cauterized) me.","reference":"Sahih al-Bukhari 5719, 5720, 5721, Book 76, Hadith 36","grade":"","question #":"question #2","question":"How was the practice of cauterization viewed during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-136"},{"hadith-eng":"When the helmet broke on the head of the Prophet (ﷺ) and his face became covered with blood and his \nincisor tooth broke (i.e. during the battle of Uhud), `Ali used to bring water in his shield while Fatima \nwas washing the blood off his face. When Fatima saw that the bleeding increased because of the \nwater, she took a mat (of palm leaves), burnt it, and stuck it (the burnt ashes) on the wound of Allah's \nApostle, whereupon the bleeding stopped.","reference":"Sahih al-Bukhari 5722, Book 76, Hadith 37","grade":"","question #":"question #2","question":"How did Ali assist the Prophet when he was injured in the battle of Uhud?","id":"bukhari-76-137"},{"hadith-eng":"`Abdullah bin `Umar said, \"The Prophet (ﷺ) said, 'Fever is from the heat of Hell, so put it out (cool it) \nwith water.' \" Nafi` added: `Abdullah used to say, \"O Allah! Relieve us from the punishment,\" (when \nhe suffered from fever).","reference":"Sahih al-Bukhari 5723, Book 76, Hadith 38","grade":"","question #":"question #2","question":"How can water be used as a remedy for fever according to Islamic tradition?","id":"bukhari-76-138"},{"hadith-eng":"Whenever a lady suffering from fever was brought to Asma' bint Abu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Messenger (ﷺ) used to order \nus to abate fever with water.\"","reference":"Sahih al-Bukhari 5724, Book 76, Hadith 39","grade":"","question #":"question #2","question":"What practice did the Prophet Muhammad (ﷺ) recommend for reducing fever?","id":"bukhari-76-139"},{"hadith-eng":"The Prophet (ﷺ) said, \"Fever is from the heat of Hell, so abate fever with water.\"","reference":"Sahih al-Bukhari 5725, Book 76, Hadith 40","grade":"","question #":"question #2","question":"How is water used as a remedy for fever according to Islamic tradition?","id":"bukhari-76-140"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Fever is from the heat of Hell, so abate fever with water.\"","reference":"Sahih al-Bukhari 5726, Book 76, Hadith 41","grade":"","question #":"question #2","question":"How can water be used as a remedy for fever in Islamic tradition?","id":"bukhari-76-141"},{"hadith-eng":"Some people from the tribes of `Ukl and `Uraina came to Allah's Messenger (ﷺ) and embraced Islam and \nsaid, \"O Allah's Messenger (ﷺ)! We are owners of livestock and have never been farmers,\" and they found \nthe climate of Medina unsuitable for them. So Allah's Messenger (ﷺ) ordered that they be given some camels \nand a shepherd, and ordered them to go out with those camels and drink their milk and urine. So they \nset out, but when they reached a place called Al-Harra, they reverted to disbelief after their conversion \nto Islam, killed the shepherd and drove away the camels. When this news reached the Prophet (ﷺ) he sent \nin their pursuit (and they were caught and brought). The Prophet (ﷺ) ordered that their eyes be branded \nwith heated iron bars and their hands be cut off, and they were left at Al-Harra till they died in that \nstate.","reference":"Sahih al-Bukhari 5727, Book 76, Hadith 42","grade":"","question #":"question #2","question":"How did the people from the tribes of `Ukl and `Uraina initially respond to the climate of Medina after embracing Islam?","id":"bukhari-76-142"},{"hadith-eng":"The Prophet (ﷺ) said, \"If you hear of an outbreak of plague in a land, do not enter it; but if the plague \nbreaks out in a place while you are in it, do not leave that place.\"","reference":"Sahih al-Bukhari 5728, Book 76, Hadith 43","grade":"","question #":"question #2","question":"How should individuals respond if they find themselves in a location affected by a plague?","id":"bukhari-76-143"},{"hadith-eng":"`Umar bin Al-Khattab departed for Sham and when he reached Sargh, the commanders of the \n(Muslim) army, Abu 'Ubaida bin Al-Jarrah and his companions met him and told him that an epidemic \nhad broken out in Sham. `Umar said, \"Call for me the early emigrants.\" So `Umar called them, \nconsulted them and informed them that an epidemic had broken out in Sham. \nThose people differed in their opinions. Some of them said, \"We have come out for a purpose and we \ndo not think that it is proper to give it up,\" while others said (to `Umar), \"You have along with you. \nother people and the companions of Allah's Messenger (ﷺ) so do not advise that we take them to this \nepidemic.\" `Umar said to them, \"Leave me now.\" Then he said, \"Call the Ansar for me.\" I called them \nand he consulted them and they followed the way of the emigrants and differed as they did. He then \nsaid to them, Leave me now,\" and added, \"Call for me the old people of Quraish who emigrated in the \nyear of the Conquest of Mecca.\" \nI called them and they gave a unanimous opinion saying, \"We advise that you should return with the \npeople and do not take them to that (place) of epidemic.\" So `Umar made an announcement, \"I will \nride back to Medina in the morning, so you should do the same.\" Abu 'Ubaida bin Al-Jarrah said (to \n`Umar), \"Are you running away from what Allah had ordained?\" `Umar said, \"Would that someone \nelse had said such a thing, O Abu 'Ubaida! Yes, we are running from what Allah had ordained to what \nAllah has ordained. Don't you agree that if you had camels that went down a valley having two places, \none green and the other dry, you would graze them on the green one only if Allah had ordained that, \nand you would graze them on the dry one only if Allah had ordained that?\" \nAt that time `Abdur-Rahman bin `Auf, who had been absent because of some job, came and said, \"I \nhave some knowledge about this. I have heard Allah's Messenger (ﷺ) saying, 'If you hear about it (an \noutbreak of plague) in a land, do not go to it; but if plague breaks out in a country where you are \nstaying, do not run away from it.' \" `Umar thanked Allah and returned to Medina.","reference":"Sahih al-Bukhari 5729, Book 76, Hadith 44","grade":"","question #":"question #2","question":"How can consulting with different groups of people help in making a critical decision during a crisis?","id":"bukhari-76-144"},{"hadith-eng":"`Umar went to Sham and when he reached Sargh, he got the news that an epidemic (of plague) had \r\nbroken out in Sham. `Abdur-Rahman bin `Auf told him that Allah's Messenger (ﷺ) said, \"If you hear that it \r\n(plague) has broken out in a land, do not go to it; but if it breaks out in a land where you are present, \r\ndo not go out escaping from it.\"","reference":"Sahih al-Bukhari 5730, Book 76, Hadith 45","grade":"","question #":"question #2","question":"How should one behave if an epidemic breaks out in the area where they are currently residing?","id":"bukhari-76-145"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Neither Messiah (Ad-Dajjal) nor plague will enter Medina.\"","reference":"Sahih al-Bukhari 5731, Book 76, Hadith 46","grade":"","question #":"question #2","question":"Who is Ad-Dajjal and what is his significance in Islamic eschatology?","id":"bukhari-76-146"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(Death from) plague is martyrdom for every Muslim.\"","reference":"Sahih al-Bukhari 5732, Book 76, Hadith 47","grade":"","question #":"question #2","question":"How does Islam view the concept of death due to a plague?","id":"bukhari-76-147"},{"hadith-eng":"The Prophet (ﷺ) said, \"He (a Muslim) who dies of an abdominal disease is a martyr, and he who dies of \r\nplague is a martyr.\"","reference":"Sahih al-Bukhari 5733, Book 76, Hadith 48","grade":"","question #":"question #2","question":"How does Islam view the status of those who die from diseases like plague or abdominal ailments?","id":"bukhari-76-148"},{"hadith-eng":"(the wife of the Prophet) that she asked Allah's Messenger (ﷺ) about plague, and Allah's Messenger (ﷺ) informed \nher saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made \nit a blessing for the believers. None (among the believers) remains patient in a land in which plague \nhas broken out and considers that nothing will befall him except what Allah has ordained for him, but \nthat Allah will grant him a reward similar to that of a martyr.\"","reference":"Sahih al-Bukhari 5734, Book 76, Hadith 49","grade":"","question #":"question #2","question":"What is the significance of patience and faith during a plague according to Islamic belief?","id":"bukhari-76-149"},{"hadith-eng":"During the Prophet's fatal illness, he used to recite the Mu'auwidhat (Surat An-Nas and Surat Al- \nFalaq) and then blow his breath over his body. When his illness was aggravated, I used to recite those \ntwo Suras and blow my breath over him and make him rub his body with his own hand for its \nblessings.\" (Ma`mar asked Az-Zuhri: How did the Prophet (ﷺ) use to blow? Az-Zuhri said: He used to \nblow on his hands and then passed them over his face.)","reference":"Sahih al-Bukhari 5735, Book 76, Hadith 50","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) use his breath in seeking blessings during his illness?","id":"bukhari-76-150"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) came across a tribe amongst the tribes of the Arabs, and that \ntribe did not entertain them. While they were in that state, the chief of that tribe was bitten by a snake \n(or stung by a scorpion). They said, (to the companions of the Prophet (ﷺ) ), \"Have you got any medicine \nwith you or anybody who can treat with Ruqya?\" The Prophet's companions said, \"You refuse to \nentertain us, so we will not treat (your chief) unless you pay us for it.\" So they agreed to pay them a \nflock of sheep. One of them (the Prophet's companions) started reciting Surat-al-Fatiha and gathering \nhis saliva and spitting it (at the snake-bite). The patient got cured and his people presented the sheep \nto them, but they said, \"We will not take it unless we ask the Prophet (whether it is lawful).\" When \nthey asked him, he smiled and said, \"How do you know that Surat-al-Fatiha is a Ruqya? Take it (flock \nof sheep) and assign a share for me.\"","reference":"Sahih al-Bukhari 5736, Book 76, Hadith 51","grade":"","question #":"question #2","question":"How does the concept of compensation for spiritual healing appear in Islamic teachings?","id":"bukhari-76-151"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) passed by some people staying at a place where there was \nwater, and one of those people had been stung by a scorpion. A man from those staying near the \nwater, came and said to the companions of the Prophet, \"Is there anyone among you who can do \nRuqya as near the water there is a person who has been stung by a scorpion.\" So one of the Prophet's \ncompanions went to him and recited Surat-al-Fatiha for a sheep as his fees. The patient got cured and \nthe man brought the sheep to his companions who disliked that and said, \"You have taken wages for \nreciting Allah's Book.\" When they arrived at Medina, they said, ' O Allah's Messenger (ﷺ)! (This person) has \ntaken wages for reciting Allah's Book\" On that Allah's Messenger (ﷺ) said, \"You are most entitled to take \nwages for doing a Ruqya with Allah's Book.\"","reference":"Sahih al-Bukhari 5737, Book 76, Hadith 52","grade":"","question #":"question #2","question":"Is it permissible to accept compensation for performing Ruqya according to Islamic teachings?","id":"bukhari-76-152"},{"hadith-eng":"The Prophet (ﷺ) ordered me or somebody else to do Ruqya (if there was danger) from an evil eye.","reference":"Sahih al-Bukhari 5738, Book 76, Hadith 53","grade":"","question #":"question #2","question":"How does Islam address the concept of protection from the evil eye?","id":"bukhari-76-153"},{"hadith-eng":"that the Prophet (ﷺ) saw in her house a girl whose face had a black spot. He said. \"She is under the effect \nof an evil eye; so treat her with a Ruqya.\"","reference":"Sahih al-Bukhari 5739, Book 76, Hadith 54","grade":"","question #":"question #2","question":"How does Islam address the concept of the evil eye and its effects on individuals?","id":"bukhari-76-154"},{"hadith-eng":"The Prophet (ﷺ) said, \"The effect of an evil eye is a fact.\" And he prohibited tattooing.","reference":"Sahih al-Bukhari 5740, Book 76, Hadith 55","grade":"","question #":"question #2","question":"Why is tattooing prohibited in Islam according to the teachings of the Prophet?","id":"bukhari-76-155"},{"hadith-eng":"I asked `Aisha about treating poisonous stings (a snake-bite or a scorpion sting) with a Ruqya. She \nsaid, \"The Prophet (ﷺ) allowed the treatment of poisonous sting with Ruqya.\"","reference":"Sahih al-Bukhari 5741, Book 76, Hadith 56","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) view the use of spiritual healing methods like Ruqya in medical treatment?","id":"bukhari-76-156"},{"hadith-eng":"Thabit and I went to Anas bin Malik. Thabit said, \"O Abu Hamza! I am sick.\" On that Anas said, \n\"Shall I treat you with the Ruqya of Allah's Messenger (ﷺ)?\" Thabit said, \"Yes,\" Anas recited, \"O Allah! The \nLord of the people, the Remover of trouble! (Please) cure (Heal) (this patient), for You are the Healer. \nNone brings about healing but You; a healing that will leave behind no ailment.\"","reference":"Sahih al-Bukhari 5742, Book 76, Hadith 57","grade":"","question #":"question #2","question":"How does the invocation of Allah's attributes play a role in seeking healing?","id":"bukhari-76-157"},{"hadith-eng":"The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Allah, the Lord of the people! Remove the trouble and heal the patient, for You are the \nHealer. No healing is of any avail but Yours; healing that will leave behind no ailment.\"","reference":"Sahih al-Bukhari 5743, Book 76, Hadith 58","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate care and compassion towards his wives during illness?","id":"bukhari-76-158"},{"hadith-eng":"Allah's Messenger (ﷺ) used to treat with a Ruqya saying, \"O the Lord of the people! Remove the trouble The \ncure is in Your Hands, and there is none except You who can remove it (the disease) . \"","reference":"Sahih al-Bukhari 5744, Book 76, Hadith 59","grade":"","question #":"question #2","question":"How does the concept of Ruqya reflect the belief in Allah's power to heal?","id":"bukhari-76-159"},{"hadith-eng":"The Prophet (ﷺ) used to say to the patient, \"In the Name of Allah The earth of our land and the saliva of \nsome of us cure our patient.\"","reference":"Sahih al-Bukhari 5745, Book 76, Hadith 60","grade":"","question #":"question #2","question":"How does the use of natural elements like earth and saliva relate to traditional Islamic healing practices?","id":"bukhari-76-160"},{"hadith-eng":"Allah's Messenger (ﷺ) used to read in his Ruqya, \"In the Name of Allah\" The earth of our land and the saliva \nof some of us cure our patient with the permission of our Lord.\" with a slight shower of saliva) while \ntreating with a Ruqya.","reference":"Sahih al-Bukhari 5746, Book 76, Hadith 61","grade":"","question #":"question #2","question":"How does the concept of Ruqya relate to seeking healing in Islam?","id":"bukhari-76-161"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"A good dream is from Allah, and a bad dream is from Satan. So if anyone \nof you sees (in a dream) something he dislikes, when he gets up he should blow thrice (on his left \nside) and seek refuge with Allah from its evil for then it will not harm him.\"","reference":"Sahih al-Bukhari 5747, Book 76, Hadith 62","grade":"","question #":"question #2","question":"What actions are recommended to take upon experiencing a bad dream according to Islamic guidance?","id":"bukhari-76-162"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to bed, he used to recite Surat-al-Ikhlas, Surat-al-Falaq and Surat-an- \nNas and then blow on his palms and pass them over his face and those parts of his body that his hands \ncould reach. And when he fell ill, he used to order me to do like that for him.","reference":"Sahih al-Bukhari 5748, Book 76, Hadith 63","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate physical actions with recitation for protection and healing?","id":"bukhari-76-163"},{"hadith-eng":"A group of the companions of Allah's Messenger (ﷺ) proceeded on a journey till they dismounted near one of \nthe Arab tribes and requested them to entertain them as their guests, but they (the tribe people) refused \nto entertain them. Then the chief of that tribe was bitten by a snake (or stung by a scorpion) and he \nwas given all sorts of treatment, but all in vain. Some of them said, \"Will you go to the group (those \ntravelers) who have dismounted near you and see if one of them has something useful?\" They came to \nthem and said, \"O the group! Our leader has been bitten by a snake (or stung by a scorpion) and we \nhave treated him with everything but nothing benefited him Has anyone of you anything useful?\" One \nof them replied, \"Yes, by Allah, I know how to treat with a Ruqya. But. by Allah, we wanted you to \nreceive us as your guests but you refused. I will not treat your patient with a Ruqya till you fix for us \nsomething as wages.\" Consequently they agreed to give those travellers a flock of sheep. The man \nwent with them (the people of the tribe) and started spitting (on the bite) and reciting Surat-al-Fatiha \ntill the patient was healed and started walking as if he had not been sick. When the tribe people paid \nthem their wages they had agreed upon, some of them (the Prophet's companions) said, \"Distribute \n(the sheep).\" But the one who treated with the Ruqya said, \"Do not do that till we go to Allah's \nApostle and mention to him what has happened, and see what he will order us.\" So they came to \nAllah's Messenger (ﷺ) and mentioned the story to him and he said, \"How do you know that Surat-al-Fatiha is \na Ruqya? You have done the right thing. Divide (what you have got) and assign for me a share with \nyou.\"","reference":"Sahih al-Bukhari 5749, Book 76, Hadith 64","grade":"","question #":"question #2","question":"How does the concept of compensation for spiritual healing appear in Islamic teachings?","id":"bukhari-76-164"},{"hadith-eng":"The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Lord of the people! Remove the difficulty and bring about healing as You are the \nHealer. There is no healing but Your Healing, a healing that will leave no ailment.\"","reference":"Sahih al-Bukhari 5750, Book 76, Hadith 65","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate care for his family members during illness?","id":"bukhari-76-165"},{"hadith-eng":"The Prophet, during his fatal ailment used to blow (on his hands and pass them) over his body while \nreciting the Mu'auwidhat (Surat-an-Nas and Surat-al-Falaq). When his disease got aggravated, I used \nto recite them for him and blow (on his hands) and let him pass his hands over his body because of its \nblessing. (Ma`mar asked Ibn Shihab: How did he use to do Nafth? He said: He used to blow on his \nhands and then pass them over his face.)","reference":"Sahih al-Bukhari 5751, Book 76, Hadith 66","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) use his hands in the practice of seeking blessings and healing?","id":"bukhari-76-166"},{"hadith-eng":"The Prophet (ﷺ) once came out to us and said, \"Some nations were displayed before me. A prophet would \npass in front of me with one man, and another with two men, and another with a group of people. and \nanother with nobody with him. Then I saw a great crowd covering the horizon and I wished that they \nwere my followers, but it was said to me, 'This is Moses and his followers.' Then it was said to me, \n'Look'' I looked and saw a big gathering with a large number of people covering the horizon. It was \nsaid, \"Look this way and that way.' So I saw a big crowd covering the horizon. Then it was said to me, \n\"These are your followers, and among them there are 70,000 who will enter Paradise without (being \nasked about their) accounts. \" Then the people dispersed and the Prophet (ﷺ) did not tell who those 70,000 \nwere. So the companions of the Prophet (ﷺ) started talking about that and some of them said, \"As regards \nus, we were born in the era of heathenism, but then we believed in Allah and His Apostle . We think \nhowever, that these (70,000) are our offspring.\" That talk reached the Prophet (ﷺ) who said, \"These \n(70,000) are the people who do not draw an evil omen from (birds) and do not get treated by branding \nthemselves and do not treat with Ruqya, but put their trust (only) in their Lord.\" then 'Ukasha bin \nMuhsin got up and said, \"O Allah's Messenger (ﷺ)! Am I one of those (70,000)?\" The Prophet (ﷺ) said, \"Yes.\" \nThen another person got up and said, \"Am I one of them?\" The Prophet (ﷺ) said, \" 'Ukasha has anticipated \nyou.\"","reference":"Sahih al-Bukhari 5752, Book 76, Hadith 67","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react to the mention of 70,000 people entering Paradise without account?","id":"bukhari-76-167"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There is neither 'Adwa (no contagious disease is conveyed to others without \nAllah's permission) nor Tiyara, but an evil omen may be in three a woman, a house or an animal.\"","reference":"Sahih al-Bukhari 5753, Book 76, Hadith 68","grade":"","question #":"question #2","question":"How does Islam view superstitions and omens in relation to daily life?","id":"bukhari-76-168"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There is no Tiyara, and the best omen is the Fal.\" They asked, \"What \nis the Fal?\" He said, \"A good word that one of you hears (and takes as a good omen).","reference":"Sahih al-Bukhari 5754, Book 76, Hadith 69","grade":"","question #":"question #2","question":"What is considered the best type of omen according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-169"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no Tiyara and the best omen is the Fal,\" Somebody said, \"What is the Fal, \nO Allah's Messenger (ﷺ)?\" He said, \"A good word that one of you hears (and takes as a good omen).","reference":"Sahih al-Bukhari 5755, Book 76, Hadith 70","grade":"","question #":"question #2","question":"How can positive words influence a person's outlook according to Islamic teachings?","id":"bukhari-76-170"},{"hadith-eng":"The Prophet (ﷺ) said, \"No 'Adwa (no contagious disease is conveyed to others without Allah's permission), \nnor Tiyara, but I like the good Fal, i.e., the good word.\"","reference":"Sahih al-Bukhari 5756, Book 76, Hadith 71","grade":"","question #":"question #2","question":"How does Islam view superstitions and omens in daily life?","id":"bukhari-76-171"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no 'Adwa, nor Tiyara, nor Hama, nor Safar.\"","reference":"Sahih al-Bukhari 5757, Book 76, Hadith 72","grade":"","question #":"question #2","question":"How does Islam view superstitions and omens in light of this teaching?","id":"bukhari-76-172"},{"hadith-eng":"Allah's Messenger (ﷺ) gave his verdict about two ladies of the Hudhail tribe who had fought each other and \none of them had hit the other with a stone. The stone hit her `Abdomen and as she was pregnant, the \nblow killed the child in her womb. They both filed their case with the Prophet (ﷺ) and he judged that the \nblood money for what was in her womb. was a slave or a female slave. The guardian of the lady who \nwas fined said, \"O Allah's Messenger (ﷺ)! Shall I be fined for a creature that has neither drunk nor eaten, \nneither spoke nor cried? A case like that should be nullified.\" On that the Prophet (ﷺ) said, \"This is one of \nthe brothers of soothsayers.","reference":"Sahih al-Bukhari 5758, Book 76, Hadith 73","grade":"","question #":"question #2","question":"How does Islamic law address disputes involving harm to a pregnant woman and her unborn child?","id":"bukhari-76-173"},{"hadith-eng":"Two ladies (had a fight) and one of them hit the other with a stone on the `Abdomen and caused her to \nabort. The Prophet (ﷺ) judged that the victim be given either a slave or a female slave (as blood-money). \nNarrated Ibn Shihab: Sa`id bin Al-Musayyab said, \"Allah's Messenger (ﷺ) judged that in case of child killed \nin the womb of its mother, the offender should give the mother a slave or a female slave in \nrecompense The offender said, How can I be fined for killing one who neither ate nor drank, neither \nspoke nor cried: a case like that should be denied ' On that Allah's Messenger (ﷺ) said 'He is one of the \nbrothers of the foretellers","reference":"Sahih al-Bukhari 5759, 5760, Book 76, Hadith 74","grade":"","question #":"question #2","question":"How does Islamic law address compensation for harm caused to an unborn child?","id":"bukhari-76-174"},{"hadith-eng":"Two ladies (had a fight) and one of them hit the other with a stone on the `Abdomen and caused her to \nabort. The Prophet (ﷺ) judged that the victim be given either a slave or a female slave (as blood-money). \nNarrated Ibn Shihab: Sa`id bin Al-Musayyab said, \"Allah's Messenger (ﷺ) judged that in case of child killed \nin the womb of its mother, the offender should give the mother a slave or a female slave in \nrecompense The offender said, How can I be fined for killing one who neither ate nor drank, neither \nspoke nor cried: a case like that should be denied ' On that Allah's Messenger (ﷺ) said 'He is one of the \nbrothers of the foretellers","reference":"Sahih al-Bukhari 5759, 5760, Book 76, Hadith 74","grade":"","question #":"question #2","question":"How does Islamic law address disputes and compensation in cases of physical harm between individuals?","id":"bukhari-76-175"},{"hadith-eng":"The Prophet (ﷺ) forbade the utilization of the price of a dog, the earnings of prostitute and the earnings of \na foreteller.","reference":"Sahih al-Bukhari 5761, Book 76, Hadith 75","grade":"","question #":"question #2","question":"Why is the income from certain activities, such as fortune-telling, prohibited in Islamic teachings?","id":"bukhari-76-176"},{"hadith-eng":"Some people asked Allah's Messenger (ﷺ) about the fore-tellers He said. ' They are nothing\" They said, 'O \nAllah's Messenger (ﷺ)! Sometimes they tell us of a thing which turns out to be true.\" Allah's Messenger (ﷺ) said, \"A \nJinn snatches that true word and pours it Into the ear of his friend (the fore-teller) (as one puts \nsomething into a bottle) The foreteller then mixes with that word one hundred lies.\"","reference":"Sahih al-Bukhari 5762, Book 76, Hadith 76","grade":"","question #":"question #2","question":"How do jinn influence the information provided by fortune-tellers according to Islamic teachings?","id":"bukhari-76-177"},{"hadith-eng":"A man called Labid bin al-A'sam from the tribe of Bani Zaraiq worked magic on Allah's Messenger (ﷺ) till \nAllah's Messenger (ﷺ) started imagining that he had done a thing that he had not really done. One day or one \nnight he was with us, he invoked Allah and invoked for a long period, and then said, \"O `Aisha! Do \nyou know that Allah has instructed me concerning the matter I have asked him about? Two men came \nto me and one of them sat near my head and the other near my feet. One of them said to his \ncompanion, \"What is the disease of this man?\" The other replied, \"He is under the effect of magic.' \nThe first one asked, 'Who has worked the magic on him?' The other replied, \"Labid bin Al-A'sam.' \nThe first one asked, 'What material did he use?' The other replied, 'A comb and the hairs stuck to it \nand the skin of pollen of a male date palm.' The first one asked, 'Where is that?' The other replied, \n'(That is) in the well of Dharwan;' \" So Allah's Messenger (ﷺ) along with some of his companions went there \nand came back saying, \"O `Aisha, the color of its water is like the infusion of Henna leaves. The tops \nof the date-palm trees near it are like the heads of the devils.\" I asked. \"O Allah's Messenger (ﷺ)? Why did \nyou not show it (to the people)?\" He said, \"Since Allah cured me, I disliked to let evil spread among \nthe people.\" Then he ordered that the well be filled up with earth.","reference":"Sahih al-Bukhari 5763, Book 76, Hadith 77","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the knowledge of who cast magic on him?","id":"bukhari-76-178"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Avoid the Mubiqat, i.e., shirk and witchcraft.\"","reference":"Sahih al-Bukhari 5764, Book 76, Hadith 78","grade":"","question #":"question #2","question":"Why is shirk considered a grave sin in Islamic teachings?","id":"bukhari-76-179"},{"hadith-eng":"Magic was worked on Allah's Messenger (ﷺ) so that he used to think that he had sexual relations with his \nwives while he actually had not (Sufyan said: That is the hardest kind of magic as it has such an \neffect). Then one day he said, \"O `Aisha do you know that Allah has instructed me concerning the \nmatter I asked Him about? Two men came to me and one of them sat near my head and the other sat \nnear my feet. The one near my head asked the other. What is wrong with this man?' The latter replied \nthe is under the effect of magic The first one asked, Who has worked magic on him?' The other \nreplied Labid bin Al-A'sam, a man from Bani Zuraiq who was an ally of the Jews and was a \nhypocrite.' The first one asked, What material did he use)?' The other replied, 'A comb and the hair \nstuck to it.' The first one asked, 'Where (is that)?' The other replied. 'In a skin of pollen of a male date \npalm tree kept under a stone in the well of Dharwan' '' So the Prophet (ﷺ) went to that well and took out \nthose things and said \"That was the well which was shown to me (in a dream) Its water looked like the \ninfusion of Henna leaves and its date-palm trees looked like the heads of devils.\" The Prophet (ﷺ) added, \n\"Then that thing was taken out' I said (to the Prophet (ﷺ) ) \"Why do you not treat yourself with Nashra?\" \nHe said, \"Allah has cured me; I dislike to let evil spread among my people.\"","reference":"Sahih al-Bukhari 5765, Book 76, Hadith 79","grade":"","question #":"question #2","question":"How does Islam view the practice of magic and its effects on individuals?","id":"bukhari-76-180"},{"hadith-eng":"Magic was worked on Allah's Messenger (ﷺ) so that he began to imagine that he had done something \nalthough he had not. One day while he was with me, he invoked Allah and invoked for a long period \nand then said, \"O `Aisha! Do you know that Allah has instructed me regarding the matter I asked Him \nabout?\" I asked, \"What is that, O Allah's Messenger (ﷺ)?\" He said, \"Two men came to me; one of them sat \nnear my head and the other sat near my feet. One of them asked his companion, 'What is the disease of \nthis man?' The other replied, 'He is under the effect of magic.' The first one asked, 'Who has worked \nmagic on him?\" The other replied, 'Labid bin A'sam, a Jew from the tribe of Bani Zuraiq.' The (first \none asked), 'With what has it been done?' The other replied, 'With a a comb and the hair stuck to it and \na skin of the pollen of a male datepalm tree.' The first one asked, 'Where is it?' The other replied, 'In \nthe well of Dharwan.' Then the Prophet (ﷺ) went along with some of his companions to that well and \nlooked at that and there were date palms near to it. Then he returned to me and said, 'By Allah the \nwater of that well was (red) like the infusion of Henna leaves and its date-palms were like the heads of \ndevils\" I said, O Allah's Messenger (ﷺ)! Did you take those materials out of the pollen skin?\" He said, 'No! \nAs for me Allah has healed me and cured me and I was afraid that (by Showing that to the people) I \nwould spread evil among them when he ordered that the well be filled up with earth, and it was filled \nup with earth \"","reference":"Sahih al-Bukhari 5766, Book 76, Hadith 80","grade":"","question #":"question #2","question":"How can the effects of magic or harmful influences be addressed according to Islamic teachings?","id":"bukhari-76-181"},{"hadith-eng":"Two men came from the East and addressed the people who wondered at their eloquent speeches On \nthat Allah's Messenger (ﷺ) said. Some eloquent speech is as effective as magic.'","reference":"Sahih al-Bukhari 5767, Book 76, Hadith 81","grade":"","question #":"question #2","question":"What is the significance of eloquence in communication within Islam?","id":"bukhari-76-182"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody takes some `Ajwa dates every morning, he will not be affected by \npoison or magic on that day till night.\" (Another narrator said seven dates).","reference":"Sahih al-Bukhari 5768, Book 76, Hadith 82","grade":"","question #":"question #2","question":"How can one protect themselves from poison or magic through dietary practices in Islam?","id":"bukhari-76-183"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"If Somebody takes seven 'Ajwa dates in the morning, neither magic \nnor poison will hurt him that day.\"","reference":"Sahih al-Bukhari 5769, Book 76, Hadith 83","grade":"","question #":"question #2","question":"How can one protect themselves from magic and poison as per the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-184"},{"hadith-eng":"The Prophet (ﷺ) said, 'No 'Adwa (i.e. no contagious disease is conveyed to\n     others without Allah's permission); nor (any evil omen in the month of)\n     Safar; nor Hama\" A bedouin said, \"O Allah's Messenger (ﷺ)! What about the \n     camels which, when on the sand (desert) look like deers, but when a \n     mangy camel mixes with them they all get infected with mange?\" On that\n     Allah s Apostle said, \"Then who conveyed the (mange) disease to the \n     first (mangy) camel?\"","reference":"Sahih al-Bukhari 5770, Book 76, Hadith 84","grade":"","question #":"question #2","question":"How does the concept of divine permission relate to the occurrence of contagious diseases in Islam?","id":"bukhari-76-185"},{"hadith-eng":"Allah's Messenger (ﷺ) said: The cattle (sheep, cows, camels, etc.) suffering\n     from a disease should not be mixed up with healthy cattle, (or said: \n     \"Do not put a patient with a healthy person ). \" (as a precaution).","reference":"Sahih al-Bukhari 5771, Book 76, Hadith 85","grade":"","question #":"question #2","question":"How does Islamic teaching address the issue of mixing healthy and sick individuals or animals?","id":"bukhari-76-186"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"there is neither 'Adwa nor Tiyara, and an evil omen is only in three: a horse, a \nwoman and a house.\"","reference":"Sahih al-Bukhari 5772, Book 76, Hadith 86","grade":"","question #":"question #2","question":"How does Islam view the concept of evil omens associated with certain objects or beings?","id":"bukhari-76-187"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"No 'Adwa.\" Abu Huraira also said: The Prophet (ﷺ) said, \"The cattle suffering from \na disease should not be mixed up with healthy cattle (or said \"Do not put a patient with a healthy \nperson as a precaution.\") Abu Huraira also said: Allah's Messenger (ﷺ) said, \"No 'Adwa.\" A bedouin got up \nand said, \"Don't you see how camels on the sand look like deer but when a mangy camel mixes with \nthem, they all get infected with mange?\" On that the Prophet (ﷺ) said, \"Then who conveyed the (mange) \ndisease to the first camel?\"","reference":"Sahih al-Bukhari 5773-5775, Book 76, Hadith 87","grade":"","question #":"question #2","question":"How does Islamic teaching address the mixing of healthy and diseased animals or individuals?","id":"bukhari-76-188"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"No 'Adwa.\" Abu Huraira also said: The Prophet (ﷺ) said, \"The cattle suffering from \na disease should not be mixed up with healthy cattle (or said \"Do not put a patient with a healthy \nperson as a precaution.\") Abu Huraira also said: Allah's Messenger (ﷺ) said, \"No 'Adwa.\" A bedouin got up \nand said, \"Don't you see how camels on the sand look like deer but when a mangy camel mixes with \nthem, they all get infected with mange?\" On that the Prophet (ﷺ) said, \"Then who conveyed the (mange) \ndisease to the first camel?\"","reference":"Sahih al-Bukhari 5773-5775, Book 76, Hadith 87","grade":"","question #":"question #2","question":"How does the hadith address the issue of mixing healthy and diseased animals or individuals?","id":"bukhari-76-189"},{"hadith-eng":"The Prophet (ﷺ) said, \"No 'Adwa nor Tiyara; but I like Fal.\" They said, \"What is the Fal?\" He said, \"A \ngood word.\"","reference":"Sahih al-Bukhari 5776, Book 76, Hadith 88","grade":"","question #":"question #2","question":"How does the concept of 'Fal' relate to positive thinking in Islamic teachings?","id":"bukhari-76-190"},{"hadith-eng":"When Khaibar was conquered, Allah's Messenger (ﷺ) was presented with a poisoned (roasted) sheep. Allah's \nApostle said, \"Collect for me all the Jews present in this area.\" (When they were gathered) Allah's \nApostle said to them, \"I am going to ask you about something; will you tell me the truth?\" They \nreplied, \"Yes, O Abal-Qasim!\" Allah's Messenger (ﷺ) said to them, \"Who is your father?\" They said, \"Our \nfather is so-and-so.\" Allah's Messenger (ﷺ) said, \"You have told a lie. for your father is so-and-so,\" They \nsaid, \"No doubt, you have said the truth and done the correct thing.\" He again said to them, \"If I ask \nyou about something; will you tell me the truth?\" They replied, \"Yes, O Abal-Qasim! And if we \nshould tell a lie you will know it as you have known it regarding our father,\" Allah's Messenger (ﷺ) then \nasked, \"Who are the people of the (Hell) Fire?\" They replied, \"We will remain in the (Hell) Fire for a \nwhile and then you (Muslims) will replace us in it\" Allah's Messenger (ﷺ) said to them. ''You will abide in it \nwith ignominy. By Allah, we shall never replace you in it at all.\" Then he asked them again, \"If I ask \nyou something, will you tell me the truth?\" They replied, \"Yes.\" He asked. \"Have you put the poison \nin this roasted sheep?\" They replied, \"Yes,\" He asked, \"What made you do that?\" They replied, \"We \nintended to learn if you were a liar in which case we would be relieved from you, and if you were a \nprophet then it would not harm you.\"","reference":"Sahih al-Bukhari 5777, Book 76, Hadith 89","grade":"","question #":"question #2","question":"How did the Jews respond when asked about their belief regarding the people of Hellfire?","id":"bukhari-76-191"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever purposely throws himself from a mountain and kills himself, will be in \nthe (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison \nand kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire \nwherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be \ncarrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will \nabide eternally forever.\"","reference":"Sahih al-Bukhari 5778, Book 76, Hadith 90","grade":"","question #":"question #2","question":"How does Islam view the act of taking one's own life using different methods?","id":"bukhari-76-192"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Whoever takes seven 'Ajwa dates in the morning will not be effected \nby magic or poison on that day.\"","reference":"Sahih al-Bukhari 5779, Book 76, Hadith 91","grade":"","question #":"question #2","question":"How can one protect themselves from magic and poison as per the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-76-193"},{"hadith-eng":"The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this \nnarration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we \nperform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of \ncamels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. \nAs for the milk of she-asses, we have learnt that Allah's Messenger (ﷺ) forbade the eating of their meat, but \nwe have not received any information whether drinking of their milk is allowed or forbidden.\" As for \nthe bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Messenger (ﷺ) forbade \nthe eating of the flesh of every wild beast having fangs . \"","reference":"Sahih al-Bukhari 5780, 5781, Book 76, Hadith 92","grade":"","question #":"question #2","question":"What are the Islamic guidelines regarding the use of animal products for medicinal purposes?","id":"bukhari-76-194"},{"hadith-eng":"The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this \nnarration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we \nperform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of \ncamels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. \nAs for the milk of she-asses, we have learnt that Allah's Messenger (ﷺ) forbade the eating of their meat, but \nwe have not received any information whether drinking of their milk is allowed or forbidden.\" As for \nthe bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Messenger (ﷺ) forbade \nthe eating of the flesh of every wild beast having fangs . \"","reference":"Sahih al-Bukhari 5780, 5781, Book 76, Hadith 92","grade":"","question #":"question #2","question":"How did early Muslims view the use of animal products like milk and bile for medicinal purposes?","id":"bukhari-76-195"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and \nthen throw it away, for in one of its wings there is a disease and in the other there is healing (antidote \nfor it) i e. the treatment for that disease.\"","reference":"Sahih al-Bukhari 5782, Book 76, Hadith 93","grade":"","question #":"question #2","question":"How does the concept of disease and healing relate to the wings of a fly in Islamic tradition?","id":"bukhari-76-196"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no disease that Allah has created, except that He also has created its \ntreatment.\"","reference":"Sahih al-Bukhari 5678, Book 76, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of seeking medical treatment in light of this teaching?","id":"bukhari-76-197"},{"hadith-eng":"We used to go for Military expeditions along with Allah's Messenger (ﷺ) and provide the people with water, \nserve them and bring the dead and the wounded back to Medina.","reference":"Sahih al-Bukhari 5679, Book 76, Hadith 2","grade":"","question #":"question #3","question":"What kind of support services were provided to soldiers during the Prophet Muhammad's (ﷺ) military expeditions?","id":"bukhari-76-198"},{"hadith-eng":"(The Prophet (ﷺ) said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire \n(cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\"","reference":"Sahih al-Bukhari 5680, Book 76, Hadith 3","grade":"","question #":"question #3","question":"What is the significance of honey in traditional Islamic medicine?","id":"bukhari-76-199"},{"hadith-eng":"The Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding \nwith fire) but I forbid my followers to use cauterization (branding with fire).","reference":"Sahih al-Bukhari 5681, Book 76, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of honey in traditional Islamic medicine?","id":"bukhari-76-200"},{"hadith-eng":"The Prophet (ﷺ) used to like sweet edible things and honey.","reference":"Sahih al-Bukhari 5682, Book 76, Hadith 5","grade":"","question #":"question #3","question":"What can be learned about the dietary habits of the Prophet Muhammad (ﷺ) from his liking for sweet things?","id":"bukhari-76-201"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If there is any healing in your medicines, then it is in cupping, a gulp of \nhoney or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) \nbranded with fire.\"","reference":"Sahih al-Bukhari 5683, Book 76, Hadith 6","grade":"","question #":"question #3","question":"Why might cauterization be discouraged despite its potential healing properties?","id":"bukhari-76-202"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"My brother has some Abdominal trouble.\" The Prophet (ﷺ) said to \nhim \"Let him drink honey.\" The man came for the second time and the Prophet (ﷺ) said to him, 'Let him \ndrink honey.\" He came for the third time and the Prophet (ﷺ) said, \"Let him drink honey.\" He returned \nagain and said, \"I have done that ' The Prophet (ﷺ) then said, \"Allah has said the truth, but your brother's \n`Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.","reference":"Sahih al-Bukhari 5684, Book 76, Hadith 7","grade":"","question #":"question #3","question":"What can be learned about the relationship between divine truth and human perception from this story?","id":"bukhari-76-203"},{"hadith-eng":"Some people were sick and they said, \"O Allah's Messenger (ﷺ)! Give us shelter and food. So when they \nbecame healthy they said, \"The weather of Medina is not suitable for us.\" So he sent them to Al-Harra \nwith some she-camels of his and said, \"Drink of their milk.\" But when they became healthy, they \nkilled the shepherd of the Prophet (ﷺ) and drove away his camels. The Prophet (ﷺ) sent some people in their \npursuit. Then he got their hands and feet cut and their eyes were branded with heated pieces of iron. I \nsaw one of them licking the earth with his tongue till he died.","reference":"Sahih al-Bukhari 5685, Book 76, Hadith 8","grade":"","question #":"question #3","question":"What measures did the Prophet Muhammad (ﷺ) take in response to acts of treachery and violence?","id":"bukhari-76-204"},{"hadith-eng":"The climate of Medina did not suit some people, so the Prophet (ﷺ) ordered them to follow his shepherd, \ni.e. his camels, and drink their milk and urine (as a medicine). So they followed the shepherd that is \nthe camels and drank their milk and urine till their bodies became healthy. Then they killed the \nshepherd and drove away the camels. When the news reached the Prophet (ﷺ) he sent some people in their \npursuit. When they were brought, he cut their hands and feet and their eyes were branded with heated \npieces of iron.","reference":"Sahih al-Bukhari 5686, Book 76, Hadith 9","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) respond to the news of the shepherd's murder and the theft of the camels?","id":"bukhari-76-205"},{"hadith-eng":"We went out and Ghalib bin Abjar was accompanying us. He fell ill on the way and when we arrived \nat Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black \ncumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting \nmixture into both nostrils, for `Aisha has narrated to me that she heard the Prophet (ﷺ) saying, 'This black \ncumin is healing for all diseases except As-Sam.' Aisha said, 'What is As-Sam?' He said, 'Death.\"","reference":"Sahih al-Bukhari 5687, Book 76, Hadith 10","grade":"","question #":"question #3","question":"What is the significance of the term 'As-Sam' in the context of this narration?","id":"bukhari-76-206"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There is healing in black cumin for all diseases except death.\"","reference":"Sahih al-Bukhari 5688, Book 76, Hadith 11","grade":"","question #":"question #3","question":"What are the limitations of black cumin's healing abilities according to Islamic teachings?","id":"bukhari-76-207"},{"hadith-eng":"Aisha used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. \nShe used to say, \"I heard Allah's Messenger (ﷺ) saying, 'at-Talbina gives rest to the heart of the patient and \nmakes it active and relieves some of his sorrow and grief.'\"","reference":"Sahih al-Bukhari 5689, Book 76, Hadith 12","grade":"","question #":"question #3","question":"What did Aisha recommend for those experiencing sorrow and grief, and why?","id":"bukhari-76-208"},{"hadith-eng":"`Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is \nbeneficial.''","reference":"Sahih al-Bukhari 5690, Book 76, Hadith 13","grade":"","question #":"question #3","question":"What role does `Aisha play in the transmission of prophetic traditions related to health and medicine?","id":"bukhari-76-209"},{"hadith-eng":"The Prophet (ﷺ) was cupped and he paid the wages to the one who had cupped him and then took Su'ut \n(Medicine sniffed by nose).","reference":"Sahih al-Bukhari 5691, Book 76, Hadith 14","grade":"","question #":"question #3","question":"What can be learned from the Prophet's use of medicine in this narration?","id":"bukhari-76-210"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.","reference":"Sahih al-Bukhari 5692, 5693, Book 76, Hadith 15","grade":"","question #":"question #3","question":"What is the recommended way to clean an area where a child has urinated according to Islamic tradition?","id":"bukhari-76-211"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.","reference":"Sahih al-Bukhari 5692, 5693, Book 76, Hadith 15","grade":"","question #":"question #3","question":"What is the recommended way to clean a place where a child has urinated according to the Prophet's practice?","id":"bukhari-76-212"},{"hadith-eng":"The Prophet (ﷺ) was cupped while he was fasting.","reference":"Sahih al-Bukhari 5694, Book 76, Hadith 16","grade":"","question #":"question #3","question":"What are the implications of performing medical treatments like cupping during fasting hours?","id":"bukhari-76-213"},{"hadith-eng":"The Prophet (ﷺ) was cupped while he was in a state of Ihram.","reference":"Sahih al-Bukhari 5695, Book 76, Hadith 17","grade":"","question #":"question #3","question":"What are the implications of this narration on the understanding of Ihram restrictions?","id":"bukhari-76-214"},{"hadith-eng":"that he was asked about the wages of the one who cups others. He said, 'Allah's Messenger (ﷺ) was cupped \nby `Abd Taiba, to whom he gave two Sa of food and interceded for him with his masters who \nconsequently reduced what they used to charge him daily. Then the Prophet (ﷺ) s said, \"The best \nmedicines you may treat yourselves with are cupping and sea incense.' He added, \"You should not \ntorture your children by treating tonsillitis by pressing the tonsils or the palate with the finger, but use \nincense.\"","reference":"Sahih al-Bukhari 5696, Book 76, Hadith 18","grade":"","question #":"question #3","question":"What guidance is provided regarding the treatment of children with tonsillitis in Islamic teachings?","id":"bukhari-76-215"},{"hadith-eng":"that he paid Al-Muqanna a visit during his illness and said, \"I will not leave till he gets cupped, for I \nheard Allah's Messenger (ﷺ) saying, \"There is healing in cupping.\"","reference":"Sahih al-Bukhari 5697, Book 76, Hadith 19","grade":"","question #":"question #3","question":"What role does visiting the sick play in Islamic tradition and how is it exemplified by the actions of the companions?","id":"bukhari-76-216"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.","reference":"Sahih al-Bukhari 5698, 5699, Book 76, Hadith 20","grade":"","question #":"question #3","question":"What are the considerations for performing medical treatments like cupping while in the state of Ihram?","id":"bukhari-76-217"},{"hadith-eng":"Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.","reference":"Sahih al-Bukhari 5698, 5699, Book 76, Hadith 20","grade":"","question #":"question #3","question":"What are the considerations for performing medical treatments like cupping while in the state of Ihram during pilgrimage?","id":"bukhari-76-218"},{"hadith-eng":"The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .","reference":"Sahih al-Bukhari 5700, 5701, Book 76, Hadith 21","grade":"","question #":"question #3","question":"What are the considerations for performing medical procedures during Hajj or Umrah?","id":"bukhari-76-219"},{"hadith-eng":"The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .","reference":"Sahih al-Bukhari 5700, 5701, Book 76, Hadith 21","grade":"","question #":"question #3","question":"What are the permissible actions for someone in Ihram when dealing with ailments?","id":"bukhari-76-220"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"If there is any good in your medicines, then it is in a gulp of honey, a \ncupping operation, or branding (cauterization), but I do not like to be (cauterized) branded.","reference":"Sahih al-Bukhari 5702, Book 76, Hadith 22","grade":"","question #":"question #3","question":"Why might the Prophet (ﷺ) have expressed a dislike for cauterization despite acknowledging its potential benefits?","id":"bukhari-76-221"},{"hadith-eng":"The Prophet (ﷺ) came to me during the period of Al-Hudaibiya, while I was lighting fire underneath a \ncooking pot and lice were falling down my head. He said, \"Do your lice hurt your?\" I said, \"Yes.\" He \nsaid, \"Shave your head and fast for three days or feed six poor persons or slaughter a sheep as a \nsacrifice:\"","reference":"Sahih al-Bukhari 5703, Book 76, Hadith 23","grade":"","question #":"question #3","question":"What are the alternatives to shaving one's head as a form of expiation in Islamic practice?","id":"bukhari-76-222"},{"hadith-eng":"The Prophet (ﷺ) said, \"If there is any healing in your medicines then it is a cupping operation, or branding \n(cauterization), but I do not like to be (cauterized) branded.\"","reference":"Sahih al-Bukhari 5704, Book 76, Hadith 24","grade":"","question #":"question #3","question":"Why might branding (cauterization) be discouraged in Islamic medical practices?","id":"bukhari-76-223"},{"hadith-eng":"Allah's Messenger (ﷺ) said, 'Nations were displayed before me; one or two prophets would pass by along \nwith a few followers. A prophet would pass by accompanied by nobody. Then a big crowd of people \npassed in front of me and I asked, Who are they Are they my followers?\" It was said, 'No. It is Moses \nand his followers It was said to me, 'Look at the horizon.'' Behold! There was a multitude of people \nfilling the horizon. Then it was said to me, 'Look there and there about the stretching sky! Behold! \nThere was a multitude filling the horizon,' It was said to me, 'This is your nation out of whom seventy \nthousand shall enter Paradise without reckoning.' \"Then the Prophet (ﷺ) entered his house without telling \nhis companions who they (the 70,000) were. So the people started talking about the issue and said, \"It \nis we who have believed in Allah and followed His Apostle; therefore those people are either \nourselves or our children who are born m the Islamic era, for we were born in the Pre-lslamic Period \nof Ignorance.'' When the Prophet (ﷺ) heard of that, he came out and said. \"Those people are those who do \nnot treat themselves with Ruqya, nor do they believe in bad or good omen (from birds etc.) nor do \nthey get themselves branded (Cauterized). but they put their trust (only) in their Lord \" On that \n'Ukasha bin Muhsin said. \"Am I one of them, O Allah's Messenger (ﷺ)?' The Prophet (ﷺ) said, \"Yes.\" Then \nanother person got up and said, \"Am I one of them?\" The Prophet (ﷺ) said, 'Ukasha has anticipated you.\"","reference":"Sahih al-Bukhari 5705, Book 76, Hadith 25","grade":"","question #":"question #3","question":"What practices are mentioned as not being performed by those who will enter Paradise without reckoning?","id":"bukhari-76-224"},{"hadith-eng":"The husband of a lady died and her eyes became sore and the people mentioned her story to the \nProphet They asked him whether it was permissible for her to use kohl as her eyes were exposed to \ndanger. He said, \"Previously, when one of you was bereaved by a husband she would stay in her dirty \nclothes in a bad unhealthy house (for one year), and when a dog passed by, she would throw a globe \nof dung. No, (she should observe the prescribed period Idda) for four months and ten days.'","reference":"Sahih al-Bukhari 5706, Book 76, Hadith 26","grade":"","question #":"question #3","question":"What considerations are given to a widow's health and well-being during the Idda period?","id":"bukhari-76-225"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(There is) no 'Adwa (no contagious disease is conveyed without Allah's permission). nor is there any bad omen (from birds), nor is there any Hamah, nor is there any bad omen in the month of Safar, and one should run away from the leper as one runs away from a lion.\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Sahih al-Bukhari 5707, Book 76, Hadith 27","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding interaction with individuals who have contagious diseases?","id":"bukhari-76-226"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Truffles are like Manna (i.e. they grow naturally without man's care) and \ntheir water heals eye diseases.\"","reference":"Sahih al-Bukhari 5708, Book 76, Hadith 28","grade":"","question #":"question #3","question":"What is the significance of truffle water in treating eye diseases according to Islamic tradition?","id":"bukhari-76-227"},{"hadith-eng":"Abu Bakr kissed (the forehead of) the Prophet (ﷺ) when he was dead. `Aisha added: We put medicine in \none side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He \ndislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not \nforbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just \nbecause a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be \nforced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had \nnot witnessed your deed.\"","reference":"Sahih al-Bukhari 5709-5712, Book 76, Hadith 29","grade":"","question #":"question #3","question":"What was the consequence for those who administered medicine against the Prophet's (ﷺ) wishes?","id":"bukhari-76-228"},{"hadith-eng":"Abu Bakr kissed (the forehead of) the Prophet (ﷺ) when he was dead. `Aisha added: We put medicine in \none side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He \ndislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not \nforbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just \nbecause a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be \nforced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had \nnot witnessed your deed.\"","reference":"Sahih al-Bukhari 5709-5712, Book 76, Hadith 29","grade":"","question #":"question #3","question":"What was the consequence for those who administered medicine against the Prophet's wishes?","id":"bukhari-76-229"},{"hadith-eng":"I went to Allah's Messenger (ﷺ) along with a a son of mine whose palate and tonsils I had pressed with my \nfinger as a treatment for a (throat and tonsil) disease. The Prophet (ﷺ) said, \"Why do you pain your \nchildren by pressing their throats! Use Ud Al-Hindi (certain Indian incense) for it cures seven \ndiseases, one of which is pleurisy. It is used as a snuff for treating throat and tonsil disease and it is \ninserted into one side of the mouth of one suffering from pleurisy.\"","reference":"Sahih al-Bukhari 5713, Book 76, Hadith 30","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) address the issue of causing pain to children in medical treatments?","id":"bukhari-76-230"},{"hadith-eng":"(the wife of the Prophet) \nWhen the health of Allah's Messenger (ﷺ) deteriorated and his condition became serious, he asked the \npermission of all his wives to allow him to be treated In my house, and they allowed him. He came \nout, supported by two men and his legs were dragging on the ground between `Abbas and another \nman. (The sub-narrator told Ibn `Abbas who said: Do you know who was the other man whom `Aisha \ndid not mention? The sub-narrator said: No. Ibn `Abbas said: It was `Ali.) `Aisha added: When the \nProphet entered my house and his disease became aggravated, he said, \"Pour on me seven water skins \nfull of water (the tying ribbons of which had not been untied) so that I may give some advice to the \npeople.\" So we made him sit in a tub belonging to Hafsa, the wife of the Prophet (ﷺ) and started pouring \nwater on him from those water skins till he waved us to stop. Then he went out to the people and led \nthem in prayer and delivered a speech before them.","reference":"Sahih al-Bukhari 5714, Book 76, Hadith 31","grade":"","question #":"question #3","question":"What significance does the act of pouring water over the Prophet hold in this narration?","id":"bukhari-76-231"},{"hadith-eng":"that she took to Allah's Messenger (ﷺ) one of her sons whose palate and tonsils she had pressed because he \nhad throat trouble. The Prophet (ﷺ) said, \"Why do you pain your children by getting the palate pressed \nlike that? Use the Ud Al-Hindi (certain Indian incense) for it cures seven diseases one of which is \npleurisy.\"","reference":"Sahih al-Bukhari 5715, Book 76, Hadith 32","grade":"","question #":"question #3","question":"What is the significance of using Ud Al-Hindi in traditional Islamic medicine?","id":"bukhari-76-232"},{"hadith-eng":"A man came to the prophet and said, 'My brother has got loose motions. The Prophet (ﷺ) said, Let him \ndrink honey.\" The man again (came) and said, 'I made him drink (honey) but that made him worse.' \nThe Prophet (ﷺ) said, 'Allah has said the Truth, and the `Abdomen of your brother has told a lie.\" (See \nHadith No. 88)","reference":"Sahih al-Bukhari 5716, Book 76, Hadith 33","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to addressing health issues from this narration?","id":"bukhari-76-233"},{"hadith-eng":"Allah's Messenger (ﷺ) said, 'There is no 'Adwa (no disease is conveyed from the sick to the healthy without \nAllah's permission), nor Safar, nor Hama.\" A bedouin stood up and said, \"Then what about my \ncamels? They are like deer on the sand, but when a mangy camel comes and mixes with them, they all \nget infected with mangy.\" The Prophet (ﷺ) said, \"Then who conveyed the (mange) disease to the first \none?\"","reference":"Sahih al-Bukhari 5717, Book 76, Hadith 34","grade":"","question #":"question #3","question":"What lesson can be learned from the interaction between the Prophet and the bedouin regarding disease transmission?","id":"bukhari-76-234"},{"hadith-eng":"that she took to Allah's Messenger (ﷺ) one of her sons whose palate and tonsils she had pressed to treat a \nthroat trouble. The Prophet (ﷺ) said, \"Be afraid of Allah! Why do you pain your children by having their \ntonsils pressed like that? Use the Ud Al-Hindi (a certain Indian incense) for it cures seven diseases, \none of which is pleurisy.\"","reference":"Sahih al-Bukhari 5718, Book 76, Hadith 35","grade":"","question #":"question #3","question":"How does the use of Ud Al-Hindi relate to the treatment of multiple diseases in Islamic medicine?","id":"bukhari-76-235"},{"hadith-eng":"Allah's Messenger (ﷺ) allowed one of the Ansar families to treat persons who have taken poison and also \nwho are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for \npleurisy, when Allah's Messenger (ﷺ) was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit \nwitnessed that, and it was Abu Talha who branded (cauterized) me.","reference":"Sahih al-Bukhari 5719, 5720, 5721, Book 76, Hadith 36","grade":"","question #":"question #3","question":"What role did the Ansar play in providing medical treatments during the Prophet's time?","id":"bukhari-76-236"},{"hadith-eng":"Allah's Messenger (ﷺ) allowed one of the Ansar families to treat persons who have taken poison and also \nwho are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for \npleurisy, when Allah's Messenger (ﷺ) was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit \nwitnessed that, and it was Abu Talha who branded (cauterized) me.","reference":"Sahih al-Bukhari 5719, 5720, 5721, Book 76, Hadith 36","grade":"","question #":"question #3","question":"What role did the Ansar play in the medical practices during the Prophet's time?","id":"bukhari-76-237"},{"hadith-eng":"When the helmet broke on the head of the Prophet (ﷺ) and his face became covered with blood and his \nincisor tooth broke (i.e. during the battle of Uhud), `Ali used to bring water in his shield while Fatima \nwas washing the blood off his face. When Fatima saw that the bleeding increased because of the \nwater, she took a mat (of palm leaves), burnt it, and stuck it (the burnt ashes) on the wound of Allah's \nApostle, whereupon the bleeding stopped.","reference":"Sahih al-Bukhari 5722, Book 76, Hadith 37","grade":"","question #":"question #3","question":"What traditional methods were used to treat wounds during the time of the Prophet?","id":"bukhari-76-238"},{"hadith-eng":"`Abdullah bin `Umar said, \"The Prophet (ﷺ) said, 'Fever is from the heat of Hell, so put it out (cool it) \nwith water.' \" Nafi` added: `Abdullah used to say, \"O Allah! Relieve us from the punishment,\" (when \nhe suffered from fever).","reference":"Sahih al-Bukhari 5723, Book 76, Hadith 38","grade":"","question #":"question #3","question":"What supplication did Abdullah bin Umar make when experiencing fever?","id":"bukhari-76-239"},{"hadith-eng":"Whenever a lady suffering from fever was brought to Asma' bint Abu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Messenger (ﷺ) used to order \nus to abate fever with water.\"","reference":"Sahih al-Bukhari 5724, Book 76, Hadith 39","grade":"","question #":"question #3","question":"How can water be used as a remedy for fever according to Islamic tradition?","id":"bukhari-76-240"},{"hadith-eng":"The Prophet (ﷺ) said, \"Fever is from the heat of Hell, so abate fever with water.\"","reference":"Sahih al-Bukhari 5725, Book 76, Hadith 40","grade":"","question #":"question #3","question":"What does this teaching imply about the nature of fever in Islamic belief?","id":"bukhari-76-241"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Fever is from the heat of Hell, so abate fever with water.\"","reference":"Sahih al-Bukhari 5726, Book 76, Hadith 41","grade":"","question #":"question #3","question":"What did the Prophet Muhammad (ﷺ) advise regarding the treatment of fever?","id":"bukhari-76-242"},{"hadith-eng":"Some people from the tribes of `Ukl and `Uraina came to Allah's Messenger (ﷺ) and embraced Islam and \nsaid, \"O Allah's Messenger (ﷺ)! We are owners of livestock and have never been farmers,\" and they found \nthe climate of Medina unsuitable for them. So Allah's Messenger (ﷺ) ordered that they be given some camels \nand a shepherd, and ordered them to go out with those camels and drink their milk and urine. So they \nset out, but when they reached a place called Al-Harra, they reverted to disbelief after their conversion \nto Islam, killed the shepherd and drove away the camels. When this news reached the Prophet (ﷺ) he sent \nin their pursuit (and they were caught and brought). The Prophet (ﷺ) ordered that their eyes be branded \nwith heated iron bars and their hands be cut off, and they were left at Al-Harra till they died in that \nstate.","reference":"Sahih al-Bukhari 5727, Book 76, Hadith 42","grade":"","question #":"question #3","question":"What were the consequences faced by those who reverted to disbelief and committed murder after converting to Islam?","id":"bukhari-76-243"},{"hadith-eng":"The Prophet (ﷺ) said, \"If you hear of an outbreak of plague in a land, do not enter it; but if the plague \nbreaks out in a place while you are in it, do not leave that place.\"","reference":"Sahih al-Bukhari 5728, Book 76, Hadith 43","grade":"","question #":"question #3","question":"What measures are advised to prevent the spread of a plague according to Islamic teachings?","id":"bukhari-76-244"},{"hadith-eng":"`Umar bin Al-Khattab departed for Sham and when he reached Sargh, the commanders of the \n(Muslim) army, Abu 'Ubaida bin Al-Jarrah and his companions met him and told him that an epidemic \nhad broken out in Sham. `Umar said, \"Call for me the early emigrants.\" So `Umar called them, \nconsulted them and informed them that an epidemic had broken out in Sham. \nThose people differed in their opinions. Some of them said, \"We have come out for a purpose and we \ndo not think that it is proper to give it up,\" while others said (to `Umar), \"You have along with you. \nother people and the companions of Allah's Messenger (ﷺ) so do not advise that we take them to this \nepidemic.\" `Umar said to them, \"Leave me now.\" Then he said, \"Call the Ansar for me.\" I called them \nand he consulted them and they followed the way of the emigrants and differed as they did. He then \nsaid to them, Leave me now,\" and added, \"Call for me the old people of Quraish who emigrated in the \nyear of the Conquest of Mecca.\" \nI called them and they gave a unanimous opinion saying, \"We advise that you should return with the \npeople and do not take them to that (place) of epidemic.\" So `Umar made an announcement, \"I will \nride back to Medina in the morning, so you should do the same.\" Abu 'Ubaida bin Al-Jarrah said (to \n`Umar), \"Are you running away from what Allah had ordained?\" `Umar said, \"Would that someone \nelse had said such a thing, O Abu 'Ubaida! Yes, we are running from what Allah had ordained to what \nAllah has ordained. Don't you agree that if you had camels that went down a valley having two places, \none green and the other dry, you would graze them on the green one only if Allah had ordained that, \nand you would graze them on the dry one only if Allah had ordained that?\" \nAt that time `Abdur-Rahman bin `Auf, who had been absent because of some job, came and said, \"I \nhave some knowledge about this. I have heard Allah's Messenger (ﷺ) saying, 'If you hear about it (an \noutbreak of plague) in a land, do not go to it; but if plague breaks out in a country where you are \nstaying, do not run away from it.' \" `Umar thanked Allah and returned to Medina.","reference":"Sahih al-Bukhari 5729, Book 76, Hadith 44","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the movement of people during an outbreak of plague?","id":"bukhari-76-245"},{"hadith-eng":"`Umar went to Sham and when he reached Sargh, he got the news that an epidemic (of plague) had \r\nbroken out in Sham. `Abdur-Rahman bin `Auf told him that Allah's Messenger (ﷺ) said, \"If you hear that it \r\n(plague) has broken out in a land, do not go to it; but if it breaks out in a land where you are present, \r\ndo not go out escaping from it.\"","reference":"Sahih al-Bukhari 5730, Book 76, Hadith 45","grade":"","question #":"question #3","question":"What did the Prophet Muhammad (ﷺ) advise about dealing with the outbreak of a plague in a specific location?","id":"bukhari-76-246"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Neither Messiah (Ad-Dajjal) nor plague will enter Medina.\"","reference":"Sahih al-Bukhari 5731, Book 76, Hadith 46","grade":"","question #":"question #3","question":"What is the significance of Medina in Islamic tradition regarding divine protection?","id":"bukhari-76-247"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(Death from) plague is martyrdom for every Muslim.\"","reference":"Sahih al-Bukhari 5732, Book 76, Hadith 47","grade":"","question #":"question #3","question":"What are the spiritual benefits or rewards associated with dying from a plague in Islamic teachings?","id":"bukhari-76-248"},{"hadith-eng":"The Prophet (ﷺ) said, \"He (a Muslim) who dies of an abdominal disease is a martyr, and he who dies of \r\nplague is a martyr.\"","reference":"Sahih al-Bukhari 5733, Book 76, Hadith 48","grade":"","question #":"question #3","question":"What significance does martyrdom hold in Islam for those who die due to certain illnesses?","id":"bukhari-76-249"},{"hadith-eng":"(the wife of the Prophet) that she asked Allah's Messenger (ﷺ) about plague, and Allah's Messenger (ﷺ) informed \nher saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made \nit a blessing for the believers. None (among the believers) remains patient in a land in which plague \nhas broken out and considers that nothing will befall him except what Allah has ordained for him, but \nthat Allah will grant him a reward similar to that of a martyr.\"","reference":"Sahih al-Bukhari 5734, Book 76, Hadith 49","grade":"","question #":"question #3","question":"How does enduring a plague with patience and faith relate to the reward of a martyr in Islam?","id":"bukhari-76-250"},{"hadith-eng":"During the Prophet's fatal illness, he used to recite the Mu'auwidhat (Surat An-Nas and Surat Al- \nFalaq) and then blow his breath over his body. When his illness was aggravated, I used to recite those \ntwo Suras and blow my breath over him and make him rub his body with his own hand for its \nblessings.\" (Ma`mar asked Az-Zuhri: How did the Prophet (ﷺ) use to blow? Az-Zuhri said: He used to \nblow on his hands and then passed them over his face.)","reference":"Sahih al-Bukhari 5735, Book 76, Hadith 50","grade":"","question #":"question #3","question":"What role did Aisha play in caring for the Prophet (ﷺ) during his illness according to Islamic teachings?","id":"bukhari-76-251"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) came across a tribe amongst the tribes of the Arabs, and that \ntribe did not entertain them. While they were in that state, the chief of that tribe was bitten by a snake \n(or stung by a scorpion). They said, (to the companions of the Prophet (ﷺ) ), \"Have you got any medicine \nwith you or anybody who can treat with Ruqya?\" The Prophet's companions said, \"You refuse to \nentertain us, so we will not treat (your chief) unless you pay us for it.\" So they agreed to pay them a \nflock of sheep. One of them (the Prophet's companions) started reciting Surat-al-Fatiha and gathering \nhis saliva and spitting it (at the snake-bite). The patient got cured and his people presented the sheep \nto them, but they said, \"We will not take it unless we ask the Prophet (whether it is lawful).\" When \nthey asked him, he smiled and said, \"How do you know that Surat-al-Fatiha is a Ruqya? Take it (flock \nof sheep) and assign a share for me.\"","reference":"Sahih al-Bukhari 5736, Book 76, Hadith 51","grade":"","question #":"question #3","question":"What does this incident teach about the relationship between hospitality and assistance in Islam?","id":"bukhari-76-252"},{"hadith-eng":"Some of the companions of the Prophet (ﷺ) passed by some people staying at a place where there was \nwater, and one of those people had been stung by a scorpion. A man from those staying near the \nwater, came and said to the companions of the Prophet, \"Is there anyone among you who can do \nRuqya as near the water there is a person who has been stung by a scorpion.\" So one of the Prophet's \ncompanions went to him and recited Surat-al-Fatiha for a sheep as his fees. The patient got cured and \nthe man brought the sheep to his companions who disliked that and said, \"You have taken wages for \nreciting Allah's Book.\" When they arrived at Medina, they said, ' O Allah's Messenger (ﷺ)! (This person) has \ntaken wages for reciting Allah's Book\" On that Allah's Messenger (ﷺ) said, \"You are most entitled to take \nwages for doing a Ruqya with Allah's Book.\"","reference":"Sahih al-Bukhari 5737, Book 76, Hadith 52","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) react to the acceptance of wages for reciting the Quran in Ruqya?","id":"bukhari-76-253"},{"hadith-eng":"The Prophet (ﷺ) ordered me or somebody else to do Ruqya (if there was danger) from an evil eye.","reference":"Sahih al-Bukhari 5738, Book 76, Hadith 53","grade":"","question #":"question #3","question":"What actions are recommended when there is a perceived threat from the evil eye?","id":"bukhari-76-254"},{"hadith-eng":"that the Prophet (ﷺ) saw in her house a girl whose face had a black spot. He said. \"She is under the effect \nof an evil eye; so treat her with a Ruqya.\"","reference":"Sahih al-Bukhari 5739, Book 76, Hadith 54","grade":"","question #":"question #3","question":"What steps should be taken when someone is believed to be affected by the evil eye according to Islamic teachings?","id":"bukhari-76-255"},{"hadith-eng":"The Prophet (ﷺ) said, \"The effect of an evil eye is a fact.\" And he prohibited tattooing.","reference":"Sahih al-Bukhari 5740, Book 76, Hadith 55","grade":"","question #":"question #3","question":"How does Islamic tradition address the concept of harmful influences like the evil eye?","id":"bukhari-76-256"},{"hadith-eng":"I asked `Aisha about treating poisonous stings (a snake-bite or a scorpion sting) with a Ruqya. She \nsaid, \"The Prophet (ﷺ) allowed the treatment of poisonous sting with Ruqya.\"","reference":"Sahih al-Bukhari 5741, Book 76, Hadith 56","grade":"","question #":"question #3","question":"What are some permissible methods in Islam for treating snake or scorpion stings?","id":"bukhari-76-257"},{"hadith-eng":"Thabit and I went to Anas bin Malik. Thabit said, \"O Abu Hamza! I am sick.\" On that Anas said, \n\"Shall I treat you with the Ruqya of Allah's Messenger (ﷺ)?\" Thabit said, \"Yes,\" Anas recited, \"O Allah! The \nLord of the people, the Remover of trouble! (Please) cure (Heal) (this patient), for You are the Healer. \nNone brings about healing but You; a healing that will leave behind no ailment.\"","reference":"Sahih al-Bukhari 5742, Book 76, Hadith 57","grade":"","question #":"question #3","question":"What is the importance of faith in Allah as the ultimate healer in Islamic tradition?","id":"bukhari-76-258"},{"hadith-eng":"The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Allah, the Lord of the people! Remove the trouble and heal the patient, for You are the \nHealer. No healing is of any avail but Yours; healing that will leave behind no ailment.\"","reference":"Sahih al-Bukhari 5743, Book 76, Hadith 58","grade":"","question #":"question #3","question":"What is the significance of acknowledging Allah as the ultimate healer in Islamic teachings?","id":"bukhari-76-259"},{"hadith-eng":"Allah's Messenger (ﷺ) used to treat with a Ruqya saying, \"O the Lord of the people! Remove the trouble The \ncure is in Your Hands, and there is none except You who can remove it (the disease) . \"","reference":"Sahih al-Bukhari 5744, Book 76, Hadith 59","grade":"","question #":"question #3","question":"What role does faith play in the process of seeking a cure through supplication?","id":"bukhari-76-260"},{"hadith-eng":"The Prophet (ﷺ) used to say to the patient, \"In the Name of Allah The earth of our land and the saliva of \nsome of us cure our patient.\"","reference":"Sahih al-Bukhari 5745, Book 76, Hadith 60","grade":"","question #":"question #3","question":"What role does faith play in the process of healing according to Islamic teachings?","id":"bukhari-76-261"},{"hadith-eng":"Allah's Messenger (ﷺ) used to read in his Ruqya, \"In the Name of Allah\" The earth of our land and the saliva \nof some of us cure our patient with the permission of our Lord.\" with a slight shower of saliva) while \ntreating with a Ruqya.","reference":"Sahih al-Bukhari 5746, Book 76, Hadith 61","grade":"","question #":"question #3","question":"What role does faith play in the effectiveness of Ruqya as a healing method?","id":"bukhari-76-262"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"A good dream is from Allah, and a bad dream is from Satan. So if anyone \nof you sees (in a dream) something he dislikes, when he gets up he should blow thrice (on his left \nside) and seek refuge with Allah from its evil for then it will not harm him.\"","reference":"Sahih al-Bukhari 5747, Book 76, Hadith 62","grade":"","question #":"question #3","question":"How can seeking refuge with Allah protect a person from the harm of a bad dream?","id":"bukhari-76-263"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to bed, he used to recite Surat-al-Ikhlas, Surat-al-Falaq and Surat-an- \nNas and then blow on his palms and pass them over his face and those parts of his body that his hands \ncould reach. And when he fell ill, he used to order me to do like that for him.","reference":"Sahih al-Bukhari 5748, Book 76, Hadith 63","grade":"","question #":"question #3","question":"What practices are recommended for seeking protection and healing during illness according to Islamic teachings?","id":"bukhari-76-264"},{"hadith-eng":"A group of the companions of Allah's Messenger (ﷺ) proceeded on a journey till they dismounted near one of \nthe Arab tribes and requested them to entertain them as their guests, but they (the tribe people) refused \nto entertain them. Then the chief of that tribe was bitten by a snake (or stung by a scorpion) and he \nwas given all sorts of treatment, but all in vain. Some of them said, \"Will you go to the group (those \ntravelers) who have dismounted near you and see if one of them has something useful?\" They came to \nthem and said, \"O the group! Our leader has been bitten by a snake (or stung by a scorpion) and we \nhave treated him with everything but nothing benefited him Has anyone of you anything useful?\" One \nof them replied, \"Yes, by Allah, I know how to treat with a Ruqya. But. by Allah, we wanted you to \nreceive us as your guests but you refused. I will not treat your patient with a Ruqya till you fix for us \nsomething as wages.\" Consequently they agreed to give those travellers a flock of sheep. The man \nwent with them (the people of the tribe) and started spitting (on the bite) and reciting Surat-al-Fatiha \ntill the patient was healed and started walking as if he had not been sick. When the tribe people paid \nthem their wages they had agreed upon, some of them (the Prophet's companions) said, \"Distribute \n(the sheep).\" But the one who treated with the Ruqya said, \"Do not do that till we go to Allah's \nApostle and mention to him what has happened, and see what he will order us.\" So they came to \nAllah's Messenger (ﷺ) and mentioned the story to him and he said, \"How do you know that Surat-al-Fatiha is \na Ruqya? You have done the right thing. Divide (what you have got) and assign for me a share with \nyou.\"","reference":"Sahih al-Bukhari 5749, Book 76, Hadith 64","grade":"","question #":"question #3","question":"What role does seeking the Prophet's guidance play in the actions of his companions?","id":"bukhari-76-265"},{"hadith-eng":"The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Lord of the people! Remove the difficulty and bring about healing as You are the \nHealer. There is no healing but Your Healing, a healing that will leave no ailment.\"","reference":"Sahih al-Bukhari 5750, Book 76, Hadith 65","grade":"","question #":"question #3","question":"What is the significance of acknowledging Allah as the ultimate healer in Islamic teachings?","id":"bukhari-76-266"},{"hadith-eng":"The Prophet, during his fatal ailment used to blow (on his hands and pass them) over his body while \nreciting the Mu'auwidhat (Surat-an-Nas and Surat-al-Falaq). When his disease got aggravated, I used \nto recite them for him and blow (on his hands) and let him pass his hands over his body because of its \nblessing. (Ma`mar asked Ibn Shihab: How did he use to do Nafth? He said: He used to blow on his \nhands and then pass them over his face.)","reference":"Sahih al-Bukhari 5751, Book 76, Hadith 66","grade":"","question #":"question #3","question":"What role did Aisha play in assisting the Prophet during his illness according to Islamic teachings?","id":"bukhari-76-267"},{"hadith-eng":"The Prophet (ﷺ) once came out to us and said, \"Some nations were displayed before me. A prophet would \npass in front of me with one man, and another with two men, and another with a group of people. and \nanother with nobody with him. Then I saw a great crowd covering the horizon and I wished that they \nwere my followers, but it was said to me, 'This is Moses and his followers.' Then it was said to me, \n'Look'' I looked and saw a big gathering with a large number of people covering the horizon. It was \nsaid, \"Look this way and that way.' So I saw a big crowd covering the horizon. Then it was said to me, \n\"These are your followers, and among them there are 70,000 who will enter Paradise without (being \nasked about their) accounts. \" Then the people dispersed and the Prophet (ﷺ) did not tell who those 70,000 \nwere. So the companions of the Prophet (ﷺ) started talking about that and some of them said, \"As regards \nus, we were born in the era of heathenism, but then we believed in Allah and His Apostle . We think \nhowever, that these (70,000) are our offspring.\" That talk reached the Prophet (ﷺ) who said, \"These \n(70,000) are the people who do not draw an evil omen from (birds) and do not get treated by branding \nthemselves and do not treat with Ruqya, but put their trust (only) in their Lord.\" then 'Ukasha bin \nMuhsin got up and said, \"O Allah's Messenger (ﷺ)! Am I one of those (70,000)?\" The Prophet (ﷺ) said, \"Yes.\" \nThen another person got up and said, \"Am I one of them?\" The Prophet (ﷺ) said, \" 'Ukasha has anticipated \nyou.\"","reference":"Sahih al-Bukhari 5752, Book 76, Hadith 67","grade":"","question #":"question #3","question":"What does the hadith suggest about the importance of trust in Allah in relation to entering Paradise?","id":"bukhari-76-268"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There is neither 'Adwa (no contagious disease is conveyed to others without \nAllah's permission) nor Tiyara, but an evil omen may be in three a woman, a house or an animal.\"","reference":"Sahih al-Bukhari 5753, Book 76, Hadith 68","grade":"","question #":"question #3","question":"What are the potential sources of evil omens mentioned in Islamic teachings?","id":"bukhari-76-269"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"There is no Tiyara, and the best omen is the Fal.\" They asked, \"What \nis the Fal?\" He said, \"A good word that one of you hears (and takes as a good omen).","reference":"Sahih al-Bukhari 5754, Book 76, Hadith 69","grade":"","question #":"question #3","question":"How can a positive word or statement influence one's perception of future events in Islam?","id":"bukhari-76-270"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no Tiyara and the best omen is the Fal,\" Somebody said, \"What is the Fal, \nO Allah's Messenger (ﷺ)?\" He said, \"A good word that one of you hears (and takes as a good omen).","reference":"Sahih al-Bukhari 5755, Book 76, Hadith 70","grade":"","question #":"question #3","question":"What is considered a good omen in Islam?","id":"bukhari-76-271"},{"hadith-eng":"The Prophet (ﷺ) said, \"No 'Adwa (no contagious disease is conveyed to others without Allah's permission), \nnor Tiyara, but I like the good Fal, i.e., the good word.\"","reference":"Sahih al-Bukhari 5756, Book 76, Hadith 71","grade":"","question #":"question #3","question":"What is the significance of positive speech or good words in Islam?","id":"bukhari-76-272"},{"hadith-eng":"The Prophet (ﷺ) said, \"There is no 'Adwa, nor Tiyara, nor Hama, nor Safar.\"","reference":"Sahih al-Bukhari 5757, Book 76, Hadith 72","grade":"","question #":"question #3","question":"What is the significance of rejecting certain pre-Islamic beliefs in the context of Islamic teachings?","id":"bukhari-76-273"},{"hadith-eng":"Allah's Messenger (ﷺ) gave his verdict about two ladies of the Hudhail tribe who had fought each other and \none of them had hit the other with a stone. The stone hit her `Abdomen and as she was pregnant, the \nblow killed the child in her womb. They both filed their case with the Prophet (ﷺ) and he judged that the \nblood money for what was in her womb. was a slave or a female slave. The guardian of the lady who \nwas fined said, \"O Allah's Messenger (ﷺ)! Shall I be fined for a creature that has neither drunk nor eaten, \nneither spoke nor cried? A case like that should be nullified.\" On that the Prophet (ﷺ) said, \"This is one of \nthe brothers of soothsayers.","reference":"Sahih al-Bukhari 5758, Book 76, Hadith 73","grade":"","question #":"question #3","question":"What is the significance of the Prophet's response to the guardian's objection regarding the blood money ruling?","id":"bukhari-76-274"},{"hadith-eng":"Two ladies (had a fight) and one of them hit the other with a stone on the `Abdomen and caused her to \nabort. The Prophet (ﷺ) judged that the victim be given either a slave or a female slave (as blood-money). \nNarrated Ibn Shihab: Sa`id bin Al-Musayyab said, \"Allah's Messenger (ﷺ) judged that in case of child killed \nin the womb of its mother, the offender should give the mother a slave or a female slave in \nrecompense The offender said, How can I be fined for killing one who neither ate nor drank, neither \nspoke nor cried: a case like that should be denied ' On that Allah's Messenger (ﷺ) said 'He is one of the \nbrothers of the foretellers","reference":"Sahih al-Bukhari 5759, 5760, Book 76, Hadith 74","grade":"","question #":"question #3","question":"What is the significance of the Prophet's judgment in cases involving harm to an unborn child?","id":"bukhari-76-275"},{"hadith-eng":"The Prophet (ﷺ) forbade the utilization of the price of a dog, the earnings of prostitute and the earnings of \na foreteller.","reference":"Sahih al-Bukhari 5761, Book 76, Hadith 75","grade":"","question #":"question #3","question":"How does Islamic law view the earnings from immoral or unethical professions?","id":"bukhari-76-276"},{"hadith-eng":"Some people asked Allah's Messenger (ﷺ) about the fore-tellers He said. ' They are nothing\" They said, 'O \nAllah's Messenger (ﷺ)! Sometimes they tell us of a thing which turns out to be true.\" Allah's Messenger (ﷺ) said, \"A \nJinn snatches that true word and pours it Into the ear of his friend (the fore-teller) (as one puts \nsomething into a bottle) The foreteller then mixes with that word one hundred lies.\"","reference":"Sahih al-Bukhari 5762, Book 76, Hadith 76","grade":"","question #":"question #3","question":"Why is it important to be cautious about believing in predictions that sometimes come true?","id":"bukhari-76-277"},{"hadith-eng":"A man called Labid bin al-A'sam from the tribe of Bani Zaraiq worked magic on Allah's Messenger (ﷺ) till \nAllah's Messenger (ﷺ) started imagining that he had done a thing that he had not really done. One day or one \nnight he was with us, he invoked Allah and invoked for a long period, and then said, \"O `Aisha! Do \nyou know that Allah has instructed me concerning the matter I have asked him about? Two men came \nto me and one of them sat near my head and the other near my feet. One of them said to his \ncompanion, \"What is the disease of this man?\" The other replied, \"He is under the effect of magic.' \nThe first one asked, 'Who has worked the magic on him?' The other replied, \"Labid bin Al-A'sam.' \nThe first one asked, 'What material did he use?' The other replied, 'A comb and the hairs stuck to it \nand the skin of pollen of a male date palm.' The first one asked, 'Where is that?' The other replied, \n'(That is) in the well of Dharwan;' \" So Allah's Messenger (ﷺ) along with some of his companions went there \nand came back saying, \"O `Aisha, the color of its water is like the infusion of Henna leaves. The tops \nof the date-palm trees near it are like the heads of the devils.\" I asked. \"O Allah's Messenger (ﷺ)? Why did \nyou not show it (to the people)?\" He said, \"Since Allah cured me, I disliked to let evil spread among \nthe people.\" Then he ordered that the well be filled up with earth.","reference":"Sahih al-Bukhari 5763, Book 76, Hadith 77","grade":"","question #":"question #3","question":"What was the Prophet Muhammad's (ﷺ) reasoning for not revealing the source of the magic to the people?","id":"bukhari-76-278"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Avoid the Mubiqat, i.e., shirk and witchcraft.\"","reference":"Sahih al-Bukhari 5764, Book 76, Hadith 78","grade":"","question #":"question #3","question":"What is the Islamic perspective on witchcraft and its consequences?","id":"bukhari-76-279"},{"hadith-eng":"Magic was worked on Allah's Messenger (ﷺ) so that he used to think that he had sexual relations with his \nwives while he actually had not (Sufyan said: That is the hardest kind of magic as it has such an \neffect). Then one day he said, \"O `Aisha do you know that Allah has instructed me concerning the \nmatter I asked Him about? Two men came to me and one of them sat near my head and the other sat \nnear my feet. The one near my head asked the other. What is wrong with this man?' The latter replied \nthe is under the effect of magic The first one asked, Who has worked magic on him?' The other \nreplied Labid bin Al-A'sam, a man from Bani Zuraiq who was an ally of the Jews and was a \nhypocrite.' The first one asked, What material did he use)?' The other replied, 'A comb and the hair \nstuck to it.' The first one asked, 'Where (is that)?' The other replied. 'In a skin of pollen of a male date \npalm tree kept under a stone in the well of Dharwan' '' So the Prophet (ﷺ) went to that well and took out \nthose things and said \"That was the well which was shown to me (in a dream) Its water looked like the \ninfusion of Henna leaves and its date-palm trees looked like the heads of devils.\" The Prophet (ﷺ) added, \n\"Then that thing was taken out' I said (to the Prophet (ﷺ) ) \"Why do you not treat yourself with Nashra?\" \nHe said, \"Allah has cured me; I dislike to let evil spread among my people.\"","reference":"Sahih al-Bukhari 5765, Book 76, Hadith 79","grade":"","question #":"question #3","question":"What are the Islamic teachings on seeking medical or spiritual treatment for ailments?","id":"bukhari-76-280"},{"hadith-eng":"Magic was worked on Allah's Messenger (ﷺ) so that he began to imagine that he had done something \nalthough he had not. One day while he was with me, he invoked Allah and invoked for a long period \nand then said, \"O `Aisha! Do you know that Allah has instructed me regarding the matter I asked Him \nabout?\" I asked, \"What is that, O Allah's Messenger (ﷺ)?\" He said, \"Two men came to me; one of them sat \nnear my head and the other sat near my feet. One of them asked his companion, 'What is the disease of \nthis man?' The other replied, 'He is under the effect of magic.' The first one asked, 'Who has worked \nmagic on him?\" The other replied, 'Labid bin A'sam, a Jew from the tribe of Bani Zuraiq.' The (first \none asked), 'With what has it been done?' The other replied, 'With a a comb and the hair stuck to it and \na skin of the pollen of a male datepalm tree.' The first one asked, 'Where is it?' The other replied, 'In \nthe well of Dharwan.' Then the Prophet (ﷺ) went along with some of his companions to that well and \nlooked at that and there were date palms near to it. Then he returned to me and said, 'By Allah the \nwater of that well was (red) like the infusion of Henna leaves and its date-palms were like the heads of \ndevils\" I said, O Allah's Messenger (ﷺ)! Did you take those materials out of the pollen skin?\" He said, 'No! \nAs for me Allah has healed me and cured me and I was afraid that (by Showing that to the people) I \nwould spread evil among them when he ordered that the well be filled up with earth, and it was filled \nup with earth \"","reference":"Sahih al-Bukhari 5766, Book 76, Hadith 80","grade":"","question #":"question #3","question":"What considerations should be taken into account when dealing with matters that could cause public concern or fear?","id":"bukhari-76-281"},{"hadith-eng":"Two men came from the East and addressed the people who wondered at their eloquent speeches On \nthat Allah's Messenger (ﷺ) said. Some eloquent speech is as effective as magic.'","reference":"Sahih al-Bukhari 5767, Book 76, Hadith 81","grade":"","question #":"question #3","question":"In what ways can speech be as impactful as magic in Islamic perspective?","id":"bukhari-76-282"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody takes some `Ajwa dates every morning, he will not be affected by \npoison or magic on that day till night.\" (Another narrator said seven dates).","reference":"Sahih al-Bukhari 5768, Book 76, Hadith 82","grade":"","question #":"question #3","question":"What is the significance of the number seven in the context of consuming Ajwa dates for protection?","id":"bukhari-76-283"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"If Somebody takes seven 'Ajwa dates in the morning, neither magic \nnor poison will hurt him that day.\"","reference":"Sahih al-Bukhari 5769, Book 76, Hadith 83","grade":"","question #":"question #3","question":"What is the significance of consuming seven 'Ajwa dates in the morning in Islamic tradition?","id":"bukhari-76-284"},{"hadith-eng":"The Prophet (ﷺ) said, 'No 'Adwa (i.e. no contagious disease is conveyed to\n     others without Allah's permission); nor (any evil omen in the month of)\n     Safar; nor Hama\" A bedouin said, \"O Allah's Messenger (ﷺ)! What about the \n     camels which, when on the sand (desert) look like deers, but when a \n     mangy camel mixes with them they all get infected with mange?\" On that\n     Allah s Apostle said, \"Then who conveyed the (mange) disease to the \n     first (mangy) camel?\"","reference":"Sahih al-Bukhari 5770, Book 76, Hadith 84","grade":"","question #":"question #3","question":"What is the significance of questioning the origin of a disease in understanding its spread according to Islamic teachings?","id":"bukhari-76-285"},{"hadith-eng":"Allah's Messenger (ﷺ) said: The cattle (sheep, cows, camels, etc.) suffering\n     from a disease should not be mixed up with healthy cattle, (or said: \n     \"Do not put a patient with a healthy person ). \" (as a precaution).","reference":"Sahih al-Bukhari 5771, Book 76, Hadith 85","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the management of contagious diseases?","id":"bukhari-76-286"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"there is neither 'Adwa nor Tiyara, and an evil omen is only in three: a horse, a \nwoman and a house.\"","reference":"Sahih al-Bukhari 5772, Book 76, Hadith 86","grade":"","question #":"question #3","question":"What are the three things mentioned as potential sources of evil omens in Islamic teachings?","id":"bukhari-76-287"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"No 'Adwa.\" Abu Huraira also said: The Prophet (ﷺ) said, \"The cattle suffering from \na disease should not be mixed up with healthy cattle (or said \"Do not put a patient with a healthy \nperson as a precaution.\") Abu Huraira also said: Allah's Messenger (ﷺ) said, \"No 'Adwa.\" A bedouin got up \nand said, \"Don't you see how camels on the sand look like deer but when a mangy camel mixes with \nthem, they all get infected with mange?\" On that the Prophet (ﷺ) said, \"Then who conveyed the (mange) \ndisease to the first camel?\"","reference":"Sahih al-Bukhari 5773-5775, Book 76, Hadith 87","grade":"","question #":"question #3","question":"What lesson can be learned from the Prophet's response to the Bedouin regarding the spread of disease among camels?","id":"bukhari-76-288"},{"hadith-eng":"The Prophet (ﷺ) said, \"No 'Adwa nor Tiyara; but I like Fal.\" They said, \"What is the Fal?\" He said, \"A \ngood word.\"","reference":"Sahih al-Bukhari 5776, Book 76, Hadith 88","grade":"","question #":"question #3","question":"Why is speaking a good word encouraged in Islamic tradition?","id":"bukhari-76-289"},{"hadith-eng":"When Khaibar was conquered, Allah's Messenger (ﷺ) was presented with a poisoned (roasted) sheep. Allah's \nApostle said, \"Collect for me all the Jews present in this area.\" (When they were gathered) Allah's \nApostle said to them, \"I am going to ask you about something; will you tell me the truth?\" They \nreplied, \"Yes, O Abal-Qasim!\" Allah's Messenger (ﷺ) said to them, \"Who is your father?\" They said, \"Our \nfather is so-and-so.\" Allah's Messenger (ﷺ) said, \"You have told a lie. for your father is so-and-so,\" They \nsaid, \"No doubt, you have said the truth and done the correct thing.\" He again said to them, \"If I ask \nyou about something; will you tell me the truth?\" They replied, \"Yes, O Abal-Qasim! And if we \nshould tell a lie you will know it as you have known it regarding our father,\" Allah's Messenger (ﷺ) then \nasked, \"Who are the people of the (Hell) Fire?\" They replied, \"We will remain in the (Hell) Fire for a \nwhile and then you (Muslims) will replace us in it\" Allah's Messenger (ﷺ) said to them. ''You will abide in it \nwith ignominy. By Allah, we shall never replace you in it at all.\" Then he asked them again, \"If I ask \nyou something, will you tell me the truth?\" They replied, \"Yes.\" He asked. \"Have you put the poison \nin this roasted sheep?\" They replied, \"Yes,\" He asked, \"What made you do that?\" They replied, \"We \nintended to learn if you were a liar in which case we would be relieved from you, and if you were a \nprophet then it would not harm you.\"","reference":"Sahih al-Bukhari 5777, Book 76, Hadith 89","grade":"","question #":"question #3","question":"What was the motive behind the Jews poisoning the roasted sheep presented to the Prophet Muhammad (ﷺ)?","id":"bukhari-76-290"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever purposely throws himself from a mountain and kills himself, will be in \nthe (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison \nand kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire \nwherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be \ncarrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will \nabide eternally forever.\"","reference":"Sahih al-Bukhari 5778, Book 76, Hadith 90","grade":"","question #":"question #3","question":"What is the significance of eternal punishment in Hell for those who commit suicide in Islam?","id":"bukhari-76-291"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Whoever takes seven 'Ajwa dates in the morning will not be effected \nby magic or poison on that day.\"","reference":"Sahih al-Bukhari 5779, Book 76, Hadith 91","grade":"","question #":"question #3","question":"What is the significance of consuming specific foods in the morning in Islamic tradition?","id":"bukhari-76-292"},{"hadith-eng":"The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this \nnarration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we \nperform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of \ncamels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. \nAs for the milk of she-asses, we have learnt that Allah's Messenger (ﷺ) forbade the eating of their meat, but \nwe have not received any information whether drinking of their milk is allowed or forbidden.\" As for \nthe bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Messenger (ﷺ) forbade \nthe eating of the flesh of every wild beast having fangs . \"","reference":"Sahih al-Bukhari 5780, 5781, Book 76, Hadith 92","grade":"","question #":"question #3","question":"How does Islamic law address the consumption of milk from animals whose meat is forbidden?","id":"bukhari-76-293"},{"hadith-eng":"The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this \nnarration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we \nperform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of \ncamels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. \nAs for the milk of she-asses, we have learnt that Allah's Messenger (ﷺ) forbade the eating of their meat, but \nwe have not received any information whether drinking of their milk is allowed or forbidden.\" As for \nthe bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Messenger (ﷺ) forbade \nthe eating of the flesh of every wild beast having fangs . \"","reference":"Sahih al-Bukhari 5780, 5781, Book 76, Hadith 92","grade":"","question #":"question #3","question":"What are the dietary restrictions mentioned in Islamic teachings regarding animals with fangs?","id":"bukhari-76-294"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and \nthen throw it away, for in one of its wings there is a disease and in the other there is healing (antidote \nfor it) i e. the treatment for that disease.\"","reference":"Sahih al-Bukhari 5782, Book 76, Hadith 93","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding handling situations where a fly contaminates food or drink?","id":"bukhari-76-295"}]