[{"hadith-eng":"The Prophet (ﷺ) said, \"Allah created Adam in His picture, sixty cubits (about 30 meters) in height. When \nHe created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they \nwill say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went \nand) said, 'As-Salamu alaikum (Peace be upon you).' They replied, 'AsSalamu-'Alaika wa \nRahmatullah (Peace and Allah's Mercy be on you) So they increased 'Wa Rahmatullah' The Prophet (ﷺ) \nadded 'So whoever will enter Paradise, will be of the shape and picture of Adam Since then the \ncreation of Adam's (offspring) (i.e. stature of human beings is being diminished continuously) to the \npresent time.\"","reference":"Sahih al-Bukhari 6227, Book 79, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of the greeting 'As-Salamu alaikum' in Islamic tradition?","id":"bukhari-79-1"},{"hadith-eng":"Al-Fadl bin `Abbas rode behind the Prophet (ﷺ) as his companion rider on the back portion of his she \ncamel on the Day of Nahr (slaughtering of sacrifice, 10th Dhul-Hijja) and Al-Fadl was a handsome \nman. The Prophet (ﷺ) stopped to give the people verdicts. In the meantime, a beautiful woman From the \ntribe of Khath'am came, asking the verdict of Allah's Messenger (ﷺ). Al-Fadl started looking at her as her \nbeauty attracted him. The Prophet (ﷺ) looked behind while Al-Fadl was looking at her; so the Prophet (ﷺ) \nheld out his hand backwards and caught the chin of Al-Fadl and turned his face (to the owner sides in \norder that he should not gaze at her. She said, \"O Allah's Messenger (ﷺ)! The obligation of Performing Hajj \nenjoined by Allah on His worshipers, has become due (compulsory) on my father who is an old man \nand who cannot sit firmly on the riding animal. Will it be sufficient that I perform Hajj on his behalf?\" \nHe said, \"Yes.\"","reference":"Sahih al-Bukhari 6228, Book 79, Hadith 2","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding lowering one's gaze and modesty?","id":"bukhari-79-2"},{"hadith-eng":"The Prophet (ﷺ) said, 'Beware! Avoid sitting on the roads.\" They (the people) said, \"O Allah s Apostle! \nWe can't help sitting (on the roads) as these are (our places) here we have talks.\" The Prophet (ﷺ) said, ' l f \nyou refuse but to sit, then pay the road its right ' They said, \"What is the right of the road, O Allah's \nApostle?\" He said, 'Lowering your gaze, refraining from harming others, returning greeting, and \nenjoining what is good, and forbidding what is evil.\"","reference":"Sahih al-Bukhari 6229, Book 79, Hadith 3","grade":"","question #":"question #1","question":"What are the etiquettes one should observe while sitting on the roads according to Islamic teachings?","id":"bukhari-79-3"},{"hadith-eng":"When we prayed with the Prophet (ﷺ) we used to say: As-Salam be on Allah from His worshipers, As- \nSalam be on Gabriel, As-Salam be on Michael, As-Salam be on so-and-so. When the Prophet (ﷺ) finished \nhis prayer, he faced us and said, \"Allah Himself is As-Salam (Peace), so when one sits in the prayer, \none should say, 'at-Tahiyatu-li l-lahi Was-Salawatu, Wat-Taiyibatu, As-Salamu 'Alaika aiyuhan- \nNabiyyu wa Rah-matul-iahi wa Barakatuhu, As-Salamu 'Alaina wa 'ala 'Ibadillahi assalihin, for if he \nsays so, then it will be for all the pious slave of Allah in the Heavens and the Earth. (Then he should \nsay), 'Ash-hadu an la ilaha illalllahu wa ash-hadu anna Muhammadan `Abduhu wa rasulu-hu,' and \nthen he can choose whatever speech (i.e. invocation) he wishes \" (See Hadith No. 797, Vol. 1).","reference":"Sahih al-Bukhari 6230, Book 79, Hadith 4","grade":"","question #":"question #1","question":"What is the significance of saying 'As-Salamu 'Alaika aiyuhan-Nabiyyu' during prayer?","id":"bukhari-79-4"},{"hadith-eng":"The Prophet (ﷺ) said, \"The young should greet the old, the passer by should greet the sitting one, and the \nsmall group of persons should greet the large group of persons. \"","reference":"Sahih al-Bukhari 6231, Book 79, Hadith 5","grade":"","question #":"question #1","question":"What are the etiquettes of greeting others in Islam?","id":"bukhari-79-5"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The riding one should greet the walking one, and the walking one should greet \nthe sitting one, and the small number of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6232, Book 79, Hadith 6","grade":"","question #":"question #1","question":"What are the etiquettes of greeting others in Islam based on their position or number?","id":"bukhari-79-6"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The riding person should greet the walking one,\n     and the walking one should greet the sitting one, and the small number\n     of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6233, Book 79, Hadith 7","grade":"","question #":"question #1","question":"What is the etiquette of greeting others in different social situations according to Islamic teachings?","id":"bukhari-79-7"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The younger person should greet the older one, \n     and the walking person should greet the sitting one, and the small \n     number of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6234, Book 79, Hadith 8","grade":"","question #":"question #1","question":"What are the etiquettes of greeting others in Islam?","id":"bukhari-79-8"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven (things): to visit the sick, to\n     follow the funeral processions, to say Tashmit to a sneezer, to help \n     the weak, to help the oppressed ones, to propagate As-Salam \n     (greeting), and to help others to fulfill their oaths (if it is not \n     sinful). He forbade us to drink from silver utensils, to wear gold \n     rings, to ride on silken saddles, to wear silk clothes, Dibaj (thick \n     silk cloth), Qassiy and Istabraq (two kinds of silk). (See \n     Hadith No. 539, Vol. 7)","reference":"Sahih al-Bukhari 6235, Book 79, Hadith 9","grade":"","question #":"question #1","question":"What are some of the actions encouraged by the Prophet Muhammad (ﷺ) to promote social welfare and community support?","id":"bukhari-79-9"},{"hadith-eng":"A man asked the Prophet, \"What Islamic traits are the best?\" The \n     Prophet said, \"Feed the people, and greet those whom you know and \n     those whom you do not know.\"","reference":"Sahih al-Bukhari 6236, Book 79, Hadith 10","grade":"","question #":"question #1","question":"What are considered the best traits in Islam according to the teachings of the Prophet?","id":"bukhari-79-10"},{"hadith-eng":"The Prophet (ﷺ) said, \"It is not lawful for a Muslim to desert (not to speak to) his brother Muslim for more \nthan three days while meeting, one turns his face to one side and the other turns his face to the other \nside. Lo! The better of the two is the one who starts greeting the other.\"","reference":"Sahih al-Bukhari 6237, Book 79, Hadith 11","grade":"","question #":"question #1","question":"What is the maximum duration a Muslim is allowed to avoid speaking to another Muslim?","id":"bukhari-79-11"},{"hadith-eng":"that he was a boy of ten at the time when the Prophet (ﷺ) emigrated to Medina. He added: I served Allah's \nApostle for ten years (the last part of his life time) and I know more than the people about the \noccasion whereupon the order of Al-Hijab was revealed (to the Prophet). Ubai b n Ka`b used to ask \nme about it. It was revealed (for the first time) during the marriage of Allah's Messenger (ﷺ) with Zainab bint \nJahsh. In the morning, the Prophet (ﷺ) was a bride-groom of her and he Invited the people, who took their \nmeals and went away, but a group of them remained with Allah's Messenger (ﷺ) and they prolonged their \nstay. Allah's Messenger (ﷺ) got up and went out, and I too, went out along with him till he came to the lintel \nof `Aisha's dwelling place. Allah's Messenger (ﷺ) thought that those people had left by then, so he returned, \nand I too, returned with him till he entered upon Zainab and found that they were still sitting there and \nhad not yet gone. The Prophet (ﷺ) went out again, and so did I with him till he reached the lintel of \n`Aisha's dwelling place, and then he thought that those people must have left by then, so he returned, \nand so did I with him, and found those people had gone. At that time the Divine Verse of Al-Hijab \nwas revealed, and the Prophet (ﷺ) set a screen between me and him (his family).","reference":"Sahih al-Bukhari 6238, Book 79, Hadith 12","grade":"","question #":"question #1","question":"What was the significance of the event that led to the revelation of the verse of Al-Hijab?","id":"bukhari-79-12"},{"hadith-eng":"When the Prophet (ﷺ) married Zainab, the people came and were offered a meal, and then they sat down \n(after finishing their meals) and started chatting. The Prophet (ﷺ) showed as if he wanted to get up, but \nthey did not get up. When he noticed that, he got up, and some of the people also got up and went \naway, while some others kept on sitting. When the Prophet (ﷺ) returned to enter, he found the people still \nsitting, but then they got up and left. So I told the Prophet (ﷺ) of their departure and he came and went in. \nI intended to go in but the Prophet (ﷺ) put a screen between me and him, for Allah revealed:-- 'O you who \nbelieve! Enter not the Prophet's houses..' (33.53)","reference":"Sahih al-Bukhari 6239, Book 79, Hadith 13","grade":"","question #":"question #1","question":"What etiquette should be observed when visiting someone's home, especially in the context of Islamic teachings?","id":"bukhari-79-13"},{"hadith-eng":"(the wife of the Prophet) `Umar bin Al-Khattab used to say to Allah's Messenger (ﷺ) \"Let your wives be \nveiled\" But he did not do so. The wives of the Prophet (ﷺ) used to go out to answer the call of nature at \nnight only at Al-Manasi.' Once Sauda, the daughter of Zam`a went out and she was a tall woman. \n`Umar bin Al-Khattab saw her while he was in a gathering, and said, \"I have recognized you, O \nSauda!\" He (`Umar) said so as he was anxious for some Divine orders regarding the veil (the veiling \nof women.) So Allah revealed the Verse of veiling. (Al-Hijab; a complete body cover excluding the \neyes). (See Hadith No. 148, Vol. 1)","reference":"Sahih al-Bukhari 6240, Book 79, Hadith 14","grade":"","question #":"question #1","question":"What was the role of Umar bin Al-Khattab in the revelation of the verse regarding the veiling of women?","id":"bukhari-79-14"},{"hadith-eng":"A man peeped through a round hole into the dwelling place of the Prophet, while the Prophet (ﷺ) had a \nMidray (an iron comb) with which he was scratching his head. the Prophet (ﷺ) said, \" Had known you \nwere looking (through the hole), I would have pierced your eye with it (i.e., the comb).\" Verily! The \norder of taking permission to enter has been enjoined because of that sight, (that one should not look \nunlawfully at the state of others). (See Hadith No. 807, Vol. 7)","reference":"Sahih al-Bukhari 6241, Book 79, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of seeking permission before entering someone's private space in Islam?","id":"bukhari-79-15"},{"hadith-eng":"A man peeped into a room of the Prophet. The Prophet (ﷺ) stood up, holding an arrow head. It is as if I \nam just looking at him, trying to stab the man.","reference":"Sahih al-Bukhari 6242, Book 79, Hadith 16","grade":"","question #":"question #1","question":"What is the Islamic perspective on privacy and the consequences of invading someone's privacy?","id":"bukhari-79-16"},{"hadith-eng":"I have not seen a thing resembling 'lamam' (minor sins) than what Abu Huraira 'narrated from the \nProphet who said \"Allah has written for Adam's son his share of adultery which he commits \ninevitably. The adultery of the eyes is the sight (to gaze at a forbidden thing), the adultery of the \ntongue is the talk, and the inner self wishes and desires and the private parts testify all this or deny it.\"","reference":"Sahih al-Bukhari 6243, Book 79, Hadith 17","grade":"","question #":"question #1","question":"What are the different forms of adultery mentioned in the teachings of Islam?","id":"bukhari-79-17"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) greeted somebody, he used to greet him three times, and if he spoke a \nsentence, he used to repeat it thrice.","reference":"Sahih al-Bukhari 6244, Book 79, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of repeating greetings multiple times in Islamic etiquette?","id":"bukhari-79-18"},{"hadith-eng":"While I was present in one of the gatherings of the Ansar, Abu Musa came as if he was scared, and \nsaid, \"I asked permission to enter upon `Umar three times, but I was not given the permission, so I \nreturned.\" (When `Umar came to know about it) he said to Abu Musa, \"Why did you not enter?'. Abu \nMusa replied, \"I asked permission three times, and I was not given it, so I returned, for Allah's Messenger (ﷺ) \nsaid, \"If anyone of you asks the permission to enter thrice, and the permission is not given, then he \nshould return.' \" `Umar said, \"By Allah! We will ask Abu Musa to bring witnesses for it.\" (Abu Musa \nwent to a gathering of the Ansar and said). \"Did anyone of you hear this from the Prophet (ﷺ) ?\" Ubai bin \nKa`b said, \"By Allah, none will go with you but the youngest of the people (as a witness).\" (Abu \nSa`id) was the youngest of them, so I went with Abu Musa and informed `Umar that the Prophet (ﷺ) had \nsaid so. (See Hadith No. 277, Vol. 3)","reference":"Sahih al-Bukhari 6245, Book 79, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of seeking permission before entering someone's space in Islamic teachings?","id":"bukhari-79-19"},{"hadith-eng":"I entered (the house) along with Allah's Messenger (ﷺ) . There he found milk in a basin. He said, \"O Abu \nHirr! Go and call the people of Suffa to me.\" I went to them and invited them. They came and asked \npermission to enter, and when it was given, they entered. (See Hadith No. 459 for details)","reference":"Sahih al-Bukhari 6246, Book 79, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of inviting and sharing with others in Islamic teachings?","id":"bukhari-79-20"},{"hadith-eng":"that he passed by a group of boys and greeted them and said, \"The Prophet (ﷺ) used to do so.\"","reference":"Sahih al-Bukhari 6247, Book 79, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of greeting others in Islam, especially when it comes to children?","id":"bukhari-79-21"},{"hadith-eng":"Sahl said, \"We used to feel happy on Fridays.\" I asked Sahl, \"Why?\" He said, \"There was an old \nwoman of our acquaintance who used to send somebody to Buda'a (Ibn Maslama said, \"Buda'a was a \ngarden of date-palms at Medina). She used to pull out the silq (a kind of vegetable) from its roots and \nput it in a cooking pot, adding some powdered barley over it (and cook it). After finishing the Jumua \n(Friday) prayer we used to (pass by her and) greet her, whereupon she would present us with that \nmeal, so we used to feel happy because of that. We used to have neither a midday nap, nor meals, \nexcept after the Friday prayer.\" (See Hadith No. 60, Vol.2)","reference":"Sahih al-Bukhari 6248, Book 79, Hadith 22","grade":"","question #":"question #1","question":"What significance does Friday hold in the lives of Muslims according to Islamic tradition?","id":"bukhari-79-22"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O `Aisha! This is Gabriel sending his greetings to you.\" I said, \"Peace, and \nAllah's Mercy be on him (Gabriel). You see what we do not see.\" (She was addressing Allah's \nApostle).","reference":"Sahih al-Bukhari 6249, Book 79, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of Gabriel in Islamic tradition and how is he perceived by the companions of the Prophet?","id":"bukhari-79-23"},{"hadith-eng":"I came to the Prophet (ﷺ) in order to consult him regarding my father's debt. When I knocked on the door, \nhe asked, \"Who is that?\" I replied, \"I\" He said, \"I, I?\" He repeated it as if he disliked it.","reference":"Sahih al-Bukhari 6250, Book 79, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of identifying oneself clearly when seeking consultation or advice?","id":"bukhari-79-24"},{"hadith-eng":"A man entered the mosque while Allah's Messenger (ﷺ) was sitting in one side of the mosque. The man \nprayed, came, and greeted the Prophet. Allah's Messenger (ﷺ) said to him, \"Wa 'Alaikas Salam (returned his \ngreeting). Go back and pray as you have not prayed (properly).\" The man returned, repeated his \nprayer, came back and greeted the Prophet. The Prophet (ﷺ) said, \"Wa alaika-s-Salam (returned his \ngreeting). Go back and pray again as you have not prayed (properly).\" The man said at the second or \nthird time, \"O Allah's Messenger (ﷺ)! Kindly teach me how to pray\". The Prophet (ﷺ) said, \"When you stand for \nprayer, perform ablution properly and then face the Qibla and say Takbir (Allahu-Akbar), and then \nrecite what you know from the Qur'an, and then bow with calmness till you feel at ease then rise from \nbowing, till you stand straight, and then prostrate calmly (and remain in prostration) till you feel at \nease, and then raise (your head) and sit with calmness till you feel at ease and then prostrate with \ncalmness (and remain in prostration) till you feel at ease, and then raise (your head) and sit with \ncalmness till you feel at ease in the sitting position, and do likewise in whole of your prayer.\" And \nAbu Usama added, \"Till you stand straight.\" (See Hadith No. 759, Vol.1)","reference":"Sahih al-Bukhari 6251, Book 79, Hadith 25","grade":"","question #":"question #1","question":"What are the essential steps to perform a proper prayer in Islam?","id":"bukhari-79-25"},{"hadith-eng":"The Prophet (ﷺ) said (in the above narration No. 268), \"And then raise your head till you feel at ease \nwhile sitting. \"","reference":"Sahih al-Bukhari 6252, Book 79, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of feeling at ease during prayer according to Islamic teachings?","id":"bukhari-79-26"},{"hadith-eng":"That the Prophet (ﷺ) said to her, \"Gabriel sends Salam (greetings) to you.\" She replied, \"Wa 'alaihi-s- \nSalam Wa Rahmatu-l-lah.\" (Peace and Allah's Mercy be on him).","reference":"Sahih al-Bukhari 6253, Book 79, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of exchanging greetings of peace in Islam?","id":"bukhari-79-27"},{"hadith-eng":"Usama bin Zaid said, \"The Prophet (ﷺ) rode over a donkey with a saddle underneath which there was a \nthick soft Fadakiya velvet sheet. Usama bin Zaid was his companion rider, and he was going to pay a \nvisit to Sa`d bin Ubada (who was sick) at the dwelling place of Bani Al-Harith bin Al-Khazraj, and \nthis incident happened before the battle of Badr. The Prophet (ﷺ) passed by a gathering in which there \nwere Muslims and pagan idolators and Jews, and among them there was `Abdullah bin Ubai bin Salul, \nand there was `Abdullah bin Rawaha too. When a cloud of dust raised by the animal covered that \ngathering, `Abdullah bin Ubai covered his nose with his Rida (sheet) and said (to the Prophet), \"Don't \ncover us with dust.\" The Prophet (ﷺ) greeted them and then stopped, dismounted and invited them to \nAllah (i.e., to embrace Islam) and also recited to them the Holy Qur'an. `Abdullah bin Ubai' bin Salul \nsaid, \"O man! There is nothing better than what you say, if what you say is the truth. So do not trouble \nus in our gatherings. Go back to your mount (or house,) and if anyone of us comes to you, tell (your \ntales) to him.\" On that `Abdullah bin Rawaha said, \"(O Allah's Messenger (ﷺ)!) Come to us and bring it(what \nyou want to say) in our gatherings, for we love that.\" So the Muslims, the pagans and the Jews started \nquarreling till they were about to fight and clash with one another. The Prophet (ﷺ) kept on quietening \nthem (till they all became quiet). He then rode his animal, and proceeded till he entered upon Sa`d bin \n'Ubada, he said, \"O Sa`d, didn't you hear what Abu Habbab said? (He meant `Abdullah bin Ubai). He \nsaid so-and-so.\" Sa`d bin 'Ubada said, \"O Allah's Messenger (ﷺ)! Excuse and forgive him, for by Allah, \nAllah has given you what He has given you. The people of this town decided to crown him (as their \nchief) and make him their king. But when Allah prevented that with the Truth which He had given \nyou, it choked him, and that was what made him behave in the way you saw him behaving.\" So the \nProphet excused him.","reference":"Sahih al-Bukhari 6254, Book 79, Hadith 28","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle opposition and criticism during his mission?","id":"bukhari-79-28"},{"hadith-eng":"I heard Ka`b bin Malik narrating (when he did not join the battle of Tabuk): Allah's Messenger (ﷺ) forbade \nall the Muslims to speak to us. I would come to Allah's Messenger (ﷺ) and greet him, and I would wonder \nwhether the Prophet (ﷺ) did move his lips to return to my greetings or not till fifty nights passed away. \nThe Prophet (ﷺ) then announced (to the people) Allah's forgiveness for us (acceptance of our repentance) \nat the time when he had offered the Fajr (morning) prayer.","reference":"Sahih al-Bukhari 6255, Book 79, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of social boycott as a form of discipline in Islamic teachings?","id":"bukhari-79-29"},{"hadith-eng":"A group of Jews came to Allah's Messenger (ﷺ) and said, \"As-samu 'Alaika \" (Death be on you), and I \nunderstood it and said to them, \"Alaikum AsSamu wa-l-la'na (Death and curse be on you).\" Allah's \nApostle said, \"Be calm! O `Aisha, for Allah loves that one should be kind and lenient in all matters.\" I \nsaid. \"O Allah's Messenger (ﷺ)! Haven't you heard what they have said?\" Allah's Messenger (ﷺ) said, \"I have \n(already) said (to them), 'Alaikum (upon you).' \"","reference":"Sahih al-Bukhari 6256, Book 79, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of responding with calmness and leniency in the face of provocation?","id":"bukhari-79-30"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the Jews greet you, they usually say, 'As-Samu 'alaikum (Death be on \nyou),' so you should say (in reply to them), 'Wa'alaikum (And on you).","reference":"Sahih al-Bukhari 6257, Book 79, Hadith 31","grade":"","question #":"question #1","question":"How should Muslims respond to greetings from others that may have negative intentions?","id":"bukhari-79-31"},{"hadith-eng":"the Prophet (ﷺ) said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum \n(And on you).' \"","reference":"Sahih al-Bukhari 6258, Book 79, Hadith 32","grade":"","question #":"question #1","question":"How should Muslims respond to greetings from the People of the Scripture?","id":"bukhari-79-32"},{"hadith-eng":"Allah's Messenger (ﷺ) sent me, Az-Zubair bin Al-Awwam and Abu Marthad Al-Ghanawi, and all of us were \nhorsemen, and he said, \"Proceed till you reach Rawdat Khakh, where there is a woman from the \npagans carrying a letter sent by Hatib bin Abi Balta'a to the pagans (of Mecca).\" So we overtook her \nwhile she was proceeding on her camel at the same place as Allah's Messenger (ﷺ) told us. We said (to her) \n\"Where is the letter which is with you?\" She said, \"I have no letter with me.\" So we made her camel \nkneel down and searched her mount (baggage etc) but could not find anything. My two companions \nsaid, \"We do not see any letter.\" I said, \"I know that Allah's Messenger (ﷺ) did not tell a lie. By Allah, if you \n(the lady) do not bring out the letter, I will strip you of your clothes' When she noticed that I was \nserious, she put her hand into the knot of her waist sheet, for she was tying a sheet round herself, and \nbrought out the letter. So we proceeded to Allah's Messenger (ﷺ) with the letter. The Prophet (ﷺ) said (to Habib), \n\"What made you o what you have done, O Hatib?\" Hatib replied, \"I have done nothing except that I \nbelieve in Allah and His Apostle, and I have not changed or altered (my religion). But I wanted to do \nthe favor to the people (pagans of Mecca) through which Allah might protect my family and my \nproperty, as there is none among your companions but has someone in Mecca through whom Allah \nprotects his property (against harm). The Prophet (ﷺ) said, \"Habib has told you the truth, so do not say to \nhim (anything) but good.\" `Umar bin Al-Khattab said, \"Verily he has betrayed Allah, His Apostle, and \nthe believers! Allow me to chop his neck off!\" The Prophet (ﷺ) said, \"O `Umar! What do you know; \nperhaps Allah looked upon the Badr warriors and said, 'Do whatever you like, for I have ordained that \nyou will be in Paradise.'\" On that `Umar wept and said, \"Allah and His Apostle know best.\"","reference":"Sahih al-Bukhari 6259, Book 79, Hadith 33","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take when he suspected a betrayal among his companions?","id":"bukhari-79-33"},{"hadith-eng":"that Heraclius had sent for him to come along with a group of the Quraish who were trading in Sha'm, \nand they came to him. Then Abu Sufyan mentioned the whole narration and said, \"Heraclius asked for \nthe letter of Allah's Messenger (ﷺ) . When the letter was read, its contents were as follows: 'In the name of \nAllah, the Beneficent, the Merciful. From Muhammad, Allah's slave and His Apostle to Heraclius, the \nChief of Byzantines: Peace be upon him who follows the right path (guidance)! Amma ba'du (to \nproceed )...' (See Hadith No 6, Vol 1 for details)","reference":"Sahih al-Bukhari 6260, Book 79, Hadith 34","grade":"","question #":"question #1","question":"What was the significance of the letter sent by Prophet Muhammad to Heraclius?","id":"bukhari-79-34"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned a person from Bani Israel who took a piece of wood, made a hole in it, and put therein one thousand Dinar and letter from him to his friend. The Prophet (ﷺ) said, \"(That man) cut a piece of wood and put the money inside it and wrote a letter from such and such a person to such and such a person.\"","reference":"Sahih al-Bukhari 6261, Book 79, Hadith 35","grade":"","question #":"question #1","question":"What can be learned about the significance of trust and honesty in financial transactions from this story?","id":"bukhari-79-35"},{"hadith-eng":"The people of (the tribe of) Quraiza agreed upon to accept the verdict of Sa`d. The Prophet (ﷺ) sent for \nhim (Sa`d) and he came. The Prophet (ﷺ) said (to those people), \"Get up for your chief or the best among \nyou!\" Sa`d sat beside the Prophet (ﷺ) and the Prophet (ﷺ) said (to him), \"These people have agreed to accept \nyour verdict.\" Sa`d said, \"So I give my judgment that their warriors should be killed and their women \nand children should be taken as captives.\" The Prophet (ﷺ) said, \"You have judged according to the King's \n(Allah's) judgment.\" (See Hadith No. 447, Vol. 5)","reference":"Sahih al-Bukhari 6262, Book 79, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of respecting and honoring leaders or chiefs in Islamic tradition?","id":"bukhari-79-36"},{"hadith-eng":"I asked Anas, \"Was it a custom of the companions of the Prophet (ﷺ) to shake hands with one another?\" \nHe said, \"Yes.\"","reference":"Sahih al-Bukhari 6263, Book 79, Hadith 37","grade":"","question #":"question #1","question":"What was the practice of the companions of the Prophet regarding greeting each other?","id":"bukhari-79-37"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) and he was holding the hand of `Umar bin Al-Khattab.","reference":"Sahih al-Bukhari 6264, Book 79, Hadith 38","grade":"","question #":"question #1","question":"What is the significance of companionship with the Prophet Muhammad (ﷺ) in Islamic tradition?","id":"bukhari-79-38"},{"hadith-eng":"Allah's Messenger (ﷺ) taught me the Tashah-hud as he taught me a Sura from the Qur'an, while my hand was \nbetween his hands. (Tashah-hud was) all the best compliments and the prayers and the good things are \nfor Allah. Peace and Allah's Mercy and Blessings be on you, O Prophet! Peace be on us and on the \npious slaves of Allah, I testify that none has the right to be worshipped but Allah, and I also testify \nthat Muhammad is Allah's slave and His Apostle. (We used to recite this in the prayer) during the \nlifetime of the Prophet (ﷺ) , but when he had died, we used to say, \"Peace be on the Prophet.\"","reference":"Sahih al-Bukhari 6265, Book 79, Hadith 39","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) teach the Tashah-hud to his companions?","id":"bukhari-79-39"},{"hadith-eng":"`Ali bin Abu Talib came out of the house of the Prophet (ﷺ) during his fatal ailment. The people asked \n(`Ali), \"O Abu Hasan! How is the health of Allah's Messenger (ﷺ) this morning?\" `Ali said, \"This morning \nhe is better, with the grace of Allah.\" Al-`Abbas held `Ali by the hand and said, \"Don't you see him \n(about to die)? By Allah, within three days you will be the slave of the stick (i.e., under the command \nof another ruler). By Allah, I think that Allah's Messenger (ﷺ) will die from his present ailment, for I know \nthe signs of death on the faces of the offspring of `Abdul Muttalib. So let us go to Allah's Messenger (ﷺ) to \nask him who will take over the Caliphate. If the authority is given to us, we will know it, and if it is \ngiven to somebody else we will request him to recommend us to him. \" `Ali said, \"By Allah! If we ask \nAllah's Messenger (ﷺ) for the rulership and he refuses, then the people will never give it to us. Besides, I will \nnever ask Allah's Messenger (ﷺ) for it.\" (See Hadith No 728, Vol 5)","reference":"Sahih al-Bukhari 6266, Book 79, Hadith 40","grade":"","question #":"question #1","question":"What was the concern of Al-`Abbas regarding the leadership after the Prophet's ailment?","id":"bukhari-79-40"},{"hadith-eng":"While I was a companion rider with the Prophet (ﷺ) he said, \"O Mu`adh!\" I replied, \"Labbaik wa \nSa`daik.\" He repeated this call three times and then said, \"Do you know what Allah's Right on His \nslaves is?\" I replied, \"No.\" He said, Allah's Right on His slaves is that they should worship Him \n(Alone) and should not join partners in worship with Him.\" He said, \"O Mu`adh!\" I replied, \"Labbaik \nwa Sa`daik.\" He said, \"Do you know what the right of (Allah's) salves on Allah is, if they do that \n(worship Him Alone and join none in His worship)? It is that He will not punish them.\"\n\n(another chain through Mu'adh)","reference":"Sahih al-Bukhari 6267, Book 79, Hadith 41","grade":"","question #":"question #1","question":"What is the significance of worshiping Allah alone without associating partners with Him?","id":"bukhari-79-41"},{"hadith-eng":"While I was walking with the Prophet (ﷺ) at the Hurra of Medina in the evening, the mountain of Uhud \nappeared before us. The Prophet (ﷺ) said, \"O Abu Dhar! I would not like to have gold equal to Uhud \n(mountain) for me, unless nothing of it, not even a single Dinar remains of it with me, for more than \none day or three days, except that single Dinar which I will keep for repaying debts. I will spend all of \nit (the whole amount) among Allah's slaves like this and like this and like this.\" The Prophet (ﷺ) pointed \nout with his hand to illustrate it and then said, \"O Abu Dhar!\" I replied, \"Labbaik wa Sa`daik, O \nAllah's Messenger (ﷺ)!\" He said, \"Those who have much wealth (in this world) will be the least rewarded (in \nthe Hereafter) except those who do like this and like this (i.e., spend their money in charity).\" Then he \nordered me, \"Remain at your place and do not leave it, O Abu Dhar, till I come back.\" He went away \ntill he disappeared from me. Then I heard a voice and feared that something might have happened to \nAllah's Messenger (ﷺ), and I intended to go (to find out) but I remembered the statement of Allah's Messenger (ﷺ) \nthat I should not leave, my place, so I kept on waiting (and after a while the Prophet (ﷺ) came), and I said \nto him, \"O Allah's Messenger (ﷺ), I heard a voice and I was afraid that something might have happened to \nyou, but then I remembered your statement and stayed (there). The Prophet (ﷺ) said, \"That was Gabriel \nwho came to me and informed me that whoever among my followers died without joining others in \nworship with Allah, would enter Paradise.\" I said, \"O Allah's Messenger (ﷺ)! Even if he had committed \nillegal sexual intercourse and theft?\" He said, \"Even if he had committed illegal sexual intercourse and \ntheft.\"","reference":"Sahih al-Bukhari 6268, Book 79, Hadith 42","grade":"","question #":"question #1","question":"What is the significance of wealth and its distribution in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man should not make another man get up from his (the latter's) seat (in a \ngathering) in order to sit there.","reference":"Sahih al-Bukhari 6269, Book 79, Hadith 43","grade":"","question #":"question #1","question":"What does Islamic etiquette say about taking someone else's seat in a gathering?","id":"bukhari-79-43"},{"hadith-eng":"The Prophet (ﷺ) forbade that a man should be made to get up from his seat so that another might sit on it, \nbut one should make room and spread out. Ibn `Umar disliked that a man should get up from his seat \nand then somebody else sit at his place.","reference":"Sahih al-Bukhari 6270, Book 79, Hadith 44","grade":"","question #":"question #1","question":"What is the Islamic etiquette regarding seating arrangements in gatherings?","id":"bukhari-79-44"},{"hadith-eng":"When Allah's Messenger (ﷺ) married Zainab bint Jahsh, he invited the people who took their meals and then \nremained sitting and talking. The Prophet (ﷺ) pretended to be ready to get up, but the people did not get \nup. When he noticed that, he got up, and when he had got up, some of those people got up along with \nhim and there remained three (who kept on sitting). Then the Prophet (ﷺ) came back and found those \npeople still sitting. Later on those people got up and went away. So I went to the Prophet (ﷺ) and \ninformed him that they had left. \nThe Prophet (ﷺ) came, and entered (his house). I wanted to enter(along with him) but he dropped a curtain \nbetween me and him. Allah then revealed: 'O you who believe! Do not enter the Prophet's Houses \nuntil leave is given... (to His statement)... Verily! That shall be an enormity, in Allah's sight.' (33.53)","reference":"Sahih al-Bukhari 6271, Book 79, Hadith 45","grade":"","question #":"question #1","question":"What etiquette should be observed when visiting someone's home, especially in the context of Islamic teachings?","id":"bukhari-79-45"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) in the courtyard of the Ka`ba in the Ihtiba.' posture putting his hand round his \nlegs like this.","reference":"Sahih al-Bukhari 6272, Book 79, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of the Prophet's posture in the courtyard of the Ka'ba?","id":"bukhari-79-46"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Shall I inform you of the biggest of the great sins?\" They said, \"Yes, O Allah's \nApostle!\" He said, \"To join partners in worship with Allah, and to be undutiful to one's parents. \"","reference":"Sahih al-Bukhari 6273, Book 79, Hadith 47","grade":"","question #":"question #1","question":"What are considered the greatest sins in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-47"},{"hadith-eng":"as above (No. 290) adding: The Prophet (ﷺ) was reclining (leaning) and then he sat up saying, \"And I \nwarn you against giving a false statement.\" And he kept on saying that warning so much so that we \nsaid, \"Would that he had stopped.\"","reference":"Sahih al-Bukhari 6274, Book 79, Hadith 48","grade":"","question #":"question #1","question":"What is the significance of the Prophet's warning against giving false statements?","id":"bukhari-79-48"},{"hadith-eng":"Once the Prophet (ﷺ) offered the `Asr prayer and then he walked quickly and entered his house.","reference":"Sahih al-Bukhari 6275, Book 79, Hadith 49","grade":"","question #":"question #1","question":"What actions did the Prophet (ﷺ) take immediately after offering the `Asr prayer?","id":"bukhari-79-49"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer his prayer (while standing) in the midst of the bed, and I used to lie in \nfront of him between him and the Qibla It I had any necessity for getting up and I used to dislike to get \nup and face him (while he was in prayer), but I would gradually slip away from the bed.","reference":"Sahih al-Bukhari 6276, Book 79, Hadith 50","grade":"","question #":"question #1","question":"What does this narration indicate about the permissibility of movement during prayer?","id":"bukhari-79-50"},{"hadith-eng":"The news of my fasting was mentioned to the Prophet (ﷺ) . So he entered upon me and I put for him a \nleather cushion stuffed with palm-fibres. The Prophet (ﷺ) sat on the floor and the cushion was between me \nand him. He said to me, \"Isn't it sufficient for you (that you fast) three days a month?\" I said, \"O \nAllah's Messenger (ﷺ)! (I can fast more than this).\" He said, \"You may fast) five days a month.\" I said, \"O \nAllah's Messenger (ﷺ)! (I can fast more than this).\" He said, \"(You may fast) seven days.\" I said, \"O Allah's \nApostle!\" He said, \"Nine.\" I said, \"O Allah's Messenger (ﷺ)!\" He said, \"Eleven.\" I said, \"O Allah's Messenger (ﷺ)!\" \nHe said, \"No fasting is superior to the fasting of (the Prophet (ﷺ) David) which was one half of a year, and \nhe used, to fast on alternate days. (See Hadith No. 300, Vol 3)","reference":"Sahih al-Bukhari 6277, Book 79, Hadith 51","grade":"","question #":"question #1","question":"What is the recommended frequency of fasting according to the Prophet Muhammad (ﷺ)?","id":"bukhari-79-51"},{"hadith-eng":"'Alaqama went to Sham and came to the mosque and offered a two-rak`at prayer, and invoked Allah: \n\"O Allah! Bless me with a (pious) good companion.\" So he sat beside Abu Ad-Darda' who asked, \n\"From where are you?\" He said, \"From the people of Kufa.\" Abu Darda' said, \"Wasn't there among \nyou the person who keeps the secrets (of the Prophet (ﷺ) ) which nobody knew except him (i.e., Hudhaifa \n(bin Al-Yaman)). And isn't there among you the person whom Allah gave refuge from Satan through \nthe request (tongue) of Allah's Messenger (ﷺ)? (i.e., `Ammar). Isn't there among you the one who used to \ncarry the Siwak and the cushion (or pillows (of the Prophets)? (i.e., Ibn Mas`ud). How did Ibn Mas`ud \nuse to recite 'By the night as it conceals (the light)?\" (Sura 92). 'Alqama said, \"Wadhdhakari Wal \nUntha' (And by male and female.\") Abu Ad-Darda added. 'These people continued to argue with me \nregarding it till they were about to cause me to have doubts although I heard it from Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 6278, Book 79, Hadith 52","grade":"","question #":"question #1","question":"What significance do companions of the Prophet hold in Islamic tradition and how are they remembered?","id":"bukhari-79-52"},{"hadith-eng":"We used to have a midday nap and take our meals after the Jumua (prayer).","reference":"Sahih al-Bukhari 6279, Book 79, Hadith 53","grade":"","question #":"question #1","question":"What practices were common among the companions of the Prophet after the Friday prayer?","id":"bukhari-79-53"},{"hadith-eng":"There was no name dearer to `Ali than his nickname Abu Turab (the father of dust). He used to feel \nhappy whenever he was called by this name. Once Allah's Messenger (ﷺ) came to the house of Fatima but \ndid not find `Ali in the house. So he asked \"Where is your cousin?\" She replied, \"There was \nsomething (a quarrel) between me and him whereupon he got angry with me and went out without \nhaving a midday nap in my house.\" Allah's Messenger (ﷺ) asked a person to look for him. That person came, \nand said, \"O Allah's Messenger (ﷺ)! He (Ali) is sleeping in the mosque.\" So Allah's Messenger (ﷺ) went there and \nfound him lying. His upper body cover had fallen off to one side of his body, and so he was covered \nwith dust. Allah's Messenger (ﷺ) started cleaning the dust from him, saying, \"Get up, O Abu Turab! Get up, \nAbu Turab!\" (See Hadith No. 432, Vol 1)","reference":"Sahih al-Bukhari 6280, Book 79, Hadith 54","grade":"","question #":"question #1","question":"What significance does the nickname 'Abu Turab' hold for Ali and why was it dear to him?","id":"bukhari-79-54"},{"hadith-eng":"Anas said, \"Um Sulaim used to spread a leather sheet for the Prophet (ﷺ) and he used to take a midday \nnap on that leather sheet at her home.\" Anas added, \"When the Prophet (ﷺ) had slept, she would take \nsome of his sweat and hair and collect it (the sweat) in a bottle and then mix it with Suk (a kind of \nperfume) while he was still sleeping. \"When the death of Anas bin Malik approached, he advised that \nsome of that Suk be mixed with his Hanut (perfume for embalming the dead body), and it was mixed \nwith his Hanut.","reference":"Sahih al-Bukhari 6281, Book 79, Hadith 55","grade":"","question #":"question #1","question":"What significance did the companions of the Prophet (ﷺ) place on his personal belongings and physical attributes?","id":"bukhari-79-55"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to Quba, he used to visit Um Haram bint Milhan who would offer him \nmeals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered \nhim a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, \n'What makes you laugh, O Allah's Messenger (ﷺ)?' He said, 'Some people of my followers were displayed \nbefore me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, \n'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's \nApostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his \nhead and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Messenger (ﷺ)?' \nHe said, 'Some people of my followers were displayed before me as warriors fighting for Allah's \nCause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um \nHaram) said, 'O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.' He said, You will \nbe amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and \non coming out of the sea, she fell down from her riding animal and died.","reference":"Sahih al-Bukhari 6282, 6283, Book 79, Hadith 56","grade":"","question #":"question #1","question":"What significance does the act of warriors fighting for Allah's cause hold in Islamic teachings?","id":"bukhari-79-56"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to Quba, he used to visit Um Haram bint Milhan who would offer him \nmeals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered \nhim a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, \n'What makes you laugh, O Allah's Messenger (ﷺ)?' He said, 'Some people of my followers were displayed \nbefore me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, \n'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's \nApostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his \nhead and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Messenger (ﷺ)?' \nHe said, 'Some people of my followers were displayed before me as warriors fighting for Allah's \nCause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um \nHaram) said, 'O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.' He said, You will \nbe amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and \non coming out of the sea, she fell down from her riding animal and died.","reference":"Sahih al-Bukhari 6282, 6283, Book 79, Hadith 56","grade":"","question #":"question #1","question":"What significance does the act of smiling hold in the context of prophetic visions or dreams?","id":"bukhari-79-57"},{"hadith-eng":"The Prophet (ﷺ) forbade two kinds of dresses and two kinds of bargains; Ishtimal As-Samma and Al- \nIhtiba in one garment with no part of it covering one's private parts. (The two kinds of bargains were:) \nAl-Mulamasa and Al-Munabadha.","reference":"Sahih al-Bukhari 6284, Book 79, Hadith 57","grade":"","question #":"question #1","question":"What are the two types of clothing that are prohibited in Islamic teachings?","id":"bukhari-79-58"},{"hadith-eng":"Mother of the Believers: We, the wives of the Prophet (ﷺ) were all sitting with the Prophet (ﷺ) and none of us \nhad left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Messenger (ﷺ) \n.' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on \nhis right or his left, confided something to her, whereupon she wept bitterly. When he noticed her \nsorrow, he confided something else to her for the second time, and she started laughing. Only I from \namong the Prophet's wives said to her, \"(O Fatima), Allah's Messenger (ﷺ) selected you from among us for \nthe secret talk and still you weep?\" When Allah's Messenger (ﷺ) got up (and went away), I asked her, \"What \ndid he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Messenger (ﷺ)\" But when he died \nI asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the \nProphet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, \nsaying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an \nwith him once every year. \nHe added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has \napproached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the \nHereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet (ﷺ) saw me in \nthis sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased \nthat you will be chief of all the believing women (or chief of the women of this nation i.e. my \nfollowers?\")","reference":"Sahih al-Bukhari 6285, 6286, Book 79, Hadith 58","grade":"","question #":"question #1","question":"What significance does the Prophet's relationship with his daughter Fatima hold in Islamic tradition?","id":"bukhari-79-59"},{"hadith-eng":"Mother of the Believers: We, the wives of the Prophet (ﷺ) were all sitting with the Prophet (ﷺ) and none of us \nhad left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Messenger (ﷺ) \n.' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on \nhis right or his left, confided something to her, whereupon she wept bitterly. When he noticed her \nsorrow, he confided something else to her for the second time, and she started laughing. Only I from \namong the Prophet's wives said to her, \"(O Fatima), Allah's Messenger (ﷺ) selected you from among us for \nthe secret talk and still you weep?\" When Allah's Messenger (ﷺ) got up (and went away), I asked her, \"What \ndid he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Messenger (ﷺ)\" But when he died \nI asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the \nProphet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, \nsaying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an \nwith him once every year. \nHe added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has \napproached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the \nHereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet (ﷺ) saw me in \nthis sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased \nthat you will be chief of all the believing women (or chief of the women of this nation i.e. my \nfollowers?\")","reference":"Sahih al-Bukhari 6285, 6286, Book 79, Hadith 58","grade":"","question #":"question #1","question":"What significance does the Prophet's interaction with Fatima hold in terms of familial relationships in Islam?","id":"bukhari-79-60"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) lying on his back in the mosque and putting one of his legs over the other.","reference":"Sahih al-Bukhari 6287, Book 79, Hadith 59","grade":"","question #":"question #1","question":"What can be inferred about the Prophet's (ﷺ) behavior and demeanor in a mosque setting?","id":"bukhari-79-61"},{"hadith-eng":"the Prophet (ﷺ) said \"When three persons are together, then no two of them should hold secret counsel \nexcluding the third person.\"","reference":"Sahih al-Bukhari 6288, Book 79, Hadith 60","grade":"","question #":"question #1","question":"What is the significance of avoiding secret conversations in the presence of a third person?","id":"bukhari-79-62"},{"hadith-eng":"The Prophet (ﷺ) confided to me a secret which I did not disclose to anybody after him. And Um Sulaim \nasked me (about that secret) but I did not tell her.","reference":"Sahih al-Bukhari 6289, Book 79, Hadith 61","grade":"","question #":"question #1","question":"What is the significance of keeping a secret in Islam as demonstrated by the actions of the Prophet's companions?","id":"bukhari-79-63"},{"hadith-eng":"The Prophet (ﷺ) said, \"When you are three persons sitting together, then no two of you should hold secret \ncounsel excluding the third person until you are with some other people too, for that would grieve \nhim.\"","reference":"Sahih al-Bukhari 6290, Book 79, Hadith 62","grade":"","question #":"question #1","question":"What is the etiquette of communication in a group setting according to Islamic teachings?","id":"bukhari-79-64"},{"hadith-eng":"One day the Prophet (ﷺ) divided and distributed something amongst the people whereupon an Ansari man \nsaid, \"In this division Allah's Countenance has not been sought.\" I said, \"By Allah! I will go (and \ninform) the Prophet.\" So I went to him while he was with a group of people, and I secretly informed \nhim of that, whereupon he became so angry that his face became red, and he then said, \"May Allah \nbestow His Mercy on Moses (for) he was hurt more than that, yet he remained patient.\"","reference":"Sahih al-Bukhari 6291, Book 79, Hadith 63","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) react to criticism or accusations against his actions?","id":"bukhari-79-65"},{"hadith-eng":"The Iqama for the prayer was announced while a man was talking to Allah's Messenger (ﷺ) privately. He \ncontinued talking in that way till the Prophet's companions slept, and afterwards the Prophet (ﷺ) got up \nand offered the prayer with them.","reference":"Sahih al-Bukhari 6292, Book 79, Hadith 64","grade":"","question #":"question #1","question":"What is the significance of private conversations between individuals and the Prophet in Islamic tradition?","id":"bukhari-79-66"},{"hadith-eng":"The Prophet (ﷺ) said, \"Do not keep the fire burning in your houses when you go to bed.\"","reference":"Sahih al-Bukhari 6293, Book 79, Hadith 65","grade":"","question #":"question #1","question":"What safety precautions are advised in relation to fire in the household?","id":"bukhari-79-67"},{"hadith-eng":"One night a house in Medina was burnt with its occupants. The Prophet (ﷺ) spoke about them, saying, \n\"This fire is indeed your enemy, so whenever you go to bed, put it out to protect yourselves.\"","reference":"Sahih al-Bukhari 6294, Book 79, Hadith 66","grade":"","question #":"question #1","question":"What precautions should be taken regarding fire safety in the home according to Islamic teachings?","id":"bukhari-79-68"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(At bedtime) cover the utensils, close the doors, and put out the lights, lest the \nevil creature (the rat) should pull away the wick and thus burn the people of the house.\"","reference":"Sahih al-Bukhari 6295, Book 79, Hadith 67","grade":"","question #":"question #1","question":"What precautions should be taken at bedtime to ensure safety according to Islamic teachings?","id":"bukhari-79-69"},{"hadith-eng":"Allah s Apostle said, \"When you intend going to bed at night, put out the lights, close the doors, tie \nthe mouths of the water skins, and cover your food and drinks.\" Hamrnam said, \"I think he (the other \nnarrator) added, 'even with piece of wood across the utensil.'","reference":"Sahih al-Bukhari 6296, Book 79, Hadith 68","grade":"","question #":"question #1","question":"What precautions should be taken before going to bed according to Islamic teachings?","id":"bukhari-79-70"},{"hadith-eng":"The Prophet (ﷺ) said \"Five things are in accordance with Al Fitra (i.e. the tradition of prophets): to be \ncircumcised, to shave the pelvic region, to pull out the hair of the armpits, to cut short the moustaches, \nand to clip the nails.'","reference":"Sahih al-Bukhari 6297, Book 79, Hadith 69","grade":"","question #":"question #1","question":"What are the practices associated with Al Fitra according to Islamic tradition?","id":"bukhari-79-71"},{"hadith-eng":"Allah's Messenger (ﷺ) said \"The Prophet) Abraham circumcised himself after \n     he had passed the age of eighty years and he circumcised himself with \n     an adze.\"","reference":"Sahih al-Bukhari 6298, Book 79, Hadith 70","grade":"","question #":"question #1","question":"At what age did Prophet Abraham perform circumcision according to Islamic tradition?","id":"bukhari-79-72"},{"hadith-eng":"Ibn 'Abbas was asked, \"How old were you when\n     the Prophet (ﷺ) died?\" He replied. \"At that time I had been circumcised.\" \n     At that time, people did not circumcise the boys till they attained \n     the age of puberty. Sa'id bin Jubair said, \"Ibn 'Abbas said, 'When the\n     Prophet died, I had already been circumcised. \"","reference":"Sahih al-Bukhari 6299, Book 79, Hadith 71","grade":"","question #":"question #1","question":"What cultural practices regarding circumcision are mentioned in the context of the Prophet's time?","id":"bukhari-79-73"},{"hadith-eng":"Sa'id ibn Jubair said, \"Ibn 'Abbas said, 'When the Prophet (ﷺ) died, I had already been circumcised.' \"","reference":"Sahih al-Bukhari 6300, Book 79, Hadith 72","grade":"","question #":"question #1","question":"What does this narration indicate about the age of Ibn 'Abbas at the time of the Prophet's death?","id":"bukhari-79-74"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever among you takes an oath wherein he says, 'By Al-Lat and Al-`Uzza,' \nnames of two Idols worshipped by the Pagans, he should say, 'None has the right to be worshipped but \nAllah; And whoever says to his friend, 'Come, let me gamble with you ! He should give something in \ncharity. \" (See Hadith No. 645)","reference":"Sahih al-Bukhari 6301, Book 79, Hadith 73","grade":"","question #":"question #1","question":"What should a person do if they mistakenly take an oath by idols in Islam?","id":"bukhari-79-75"},{"hadith-eng":"During the life-time of the Prophet (ﷺ) I built a house with my own hands so that it might protect me from \nthe rain and shade me from the sun; and none of Allah's creatures assisted me in building it.","reference":"Sahih al-Bukhari 6302, Book 79, Hadith 74","grade":"","question #":"question #1","question":"What does this narration suggest about self-reliance and personal effort in achieving one's goals?","id":"bukhari-79-76"},{"hadith-eng":"Ibn `Umar said, \"By Allah, I have not put a brick over a brick (i.e. constructed a building) or planted \nany date-palm tree since the death of the Prophet.\" Sufyan (the sub narrator) said, \"I told this narration \n(of Ibn `Umar) to one of his (Ibn `Umar's) relatives, and he said, 'By Allah, he did build (something.' \n\"Sufyan added, \"I said, 'He must have said (the above narration) before he built.\"","reference":"Sahih al-Bukhari 6303, Book 79, Hadith 75","grade":"","question #":"question #1","question":"What does the statement of Ibn `Umar about not building or planting since the Prophet's death signify about his lifestyle or priorities?","id":"bukhari-79-77"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah created Adam in His picture, sixty cubits (about 30 meters) in height. When \nHe created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they \nwill say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went \nand) said, 'As-Salamu alaikum (Peace be upon you).' They replied, 'AsSalamu-'Alaika wa \nRahmatullah (Peace and Allah's Mercy be on you) So they increased 'Wa Rahmatullah' The Prophet (ﷺ) \nadded 'So whoever will enter Paradise, will be of the shape and picture of Adam Since then the \ncreation of Adam's (offspring) (i.e. stature of human beings is being diminished continuously) to the \npresent time.\"","reference":"Sahih al-Bukhari 6227, Book 79, Hadith 1","grade":"","question #":"question #2","question":"How does the stature of Adam compare to that of his descendants according to Islamic teachings?","id":"bukhari-79-78"},{"hadith-eng":"Al-Fadl bin `Abbas rode behind the Prophet (ﷺ) as his companion rider on the back portion of his she \ncamel on the Day of Nahr (slaughtering of sacrifice, 10th Dhul-Hijja) and Al-Fadl was a handsome \nman. The Prophet (ﷺ) stopped to give the people verdicts. In the meantime, a beautiful woman From the \ntribe of Khath'am came, asking the verdict of Allah's Messenger (ﷺ). Al-Fadl started looking at her as her \nbeauty attracted him. The Prophet (ﷺ) looked behind while Al-Fadl was looking at her; so the Prophet (ﷺ) \nheld out his hand backwards and caught the chin of Al-Fadl and turned his face (to the owner sides in \norder that he should not gaze at her. She said, \"O Allah's Messenger (ﷺ)! The obligation of Performing Hajj \nenjoined by Allah on His worshipers, has become due (compulsory) on my father who is an old man \nand who cannot sit firmly on the riding animal. Will it be sufficient that I perform Hajj on his behalf?\" \nHe said, \"Yes.\"","reference":"Sahih al-Bukhari 6228, Book 79, Hadith 2","grade":"","question #":"question #2","question":"Is it permissible for someone to perform Hajj on behalf of another person who is unable to do so?","id":"bukhari-79-79"},{"hadith-eng":"The Prophet (ﷺ) said, 'Beware! Avoid sitting on the roads.\" They (the people) said, \"O Allah s Apostle! \nWe can't help sitting (on the roads) as these are (our places) here we have talks.\" The Prophet (ﷺ) said, ' l f \nyou refuse but to sit, then pay the road its right ' They said, \"What is the right of the road, O Allah's \nApostle?\" He said, 'Lowering your gaze, refraining from harming others, returning greeting, and \nenjoining what is good, and forbidding what is evil.\"","reference":"Sahih al-Bukhari 6229, Book 79, Hadith 3","grade":"","question #":"question #2","question":"How can individuals contribute to a positive social environment in public spaces?","id":"bukhari-79-80"},{"hadith-eng":"When we prayed with the Prophet (ﷺ) we used to say: As-Salam be on Allah from His worshipers, As- \nSalam be on Gabriel, As-Salam be on Michael, As-Salam be on so-and-so. When the Prophet (ﷺ) finished \nhis prayer, he faced us and said, \"Allah Himself is As-Salam (Peace), so when one sits in the prayer, \none should say, 'at-Tahiyatu-li l-lahi Was-Salawatu, Wat-Taiyibatu, As-Salamu 'Alaika aiyuhan- \nNabiyyu wa Rah-matul-iahi wa Barakatuhu, As-Salamu 'Alaina wa 'ala 'Ibadillahi assalihin, for if he \nsays so, then it will be for all the pious slave of Allah in the Heavens and the Earth. (Then he should \nsay), 'Ash-hadu an la ilaha illalllahu wa ash-hadu anna Muhammadan `Abduhu wa rasulu-hu,' and \nthen he can choose whatever speech (i.e. invocation) he wishes \" (See Hadith No. 797, Vol. 1).","reference":"Sahih al-Bukhari 6230, Book 79, Hadith 4","grade":"","question #":"question #2","question":"How does the phrase 'As-Salamu 'Alaina wa 'ala 'Ibadillahi assalihin' benefit the pious slaves of Allah?","id":"bukhari-79-81"},{"hadith-eng":"The Prophet (ﷺ) said, \"The young should greet the old, the passer by should greet the sitting one, and the \nsmall group of persons should greet the large group of persons. \"","reference":"Sahih al-Bukhari 6231, Book 79, Hadith 5","grade":"","question #":"question #2","question":"How does Islam emphasize respect for elders through greetings?","id":"bukhari-79-82"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The riding one should greet the walking one, and the walking one should greet \nthe sitting one, and the small number of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6232, Book 79, Hadith 6","grade":"","question #":"question #2","question":"How does the act of greeting reflect social harmony and respect in Islamic teachings?","id":"bukhari-79-83"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The riding person should greet the walking one,\n     and the walking one should greet the sitting one, and the small number\n     of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6233, Book 79, Hadith 7","grade":"","question #":"question #2","question":"How should individuals of different statuses or positions initiate greetings in Islam?","id":"bukhari-79-84"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The younger person should greet the older one, \n     and the walking person should greet the sitting one, and the small \n     number of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6234, Book 79, Hadith 8","grade":"","question #":"question #2","question":"How does age influence the order of greeting in Islamic teachings?","id":"bukhari-79-85"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven (things): to visit the sick, to\n     follow the funeral processions, to say Tashmit to a sneezer, to help \n     the weak, to help the oppressed ones, to propagate As-Salam \n     (greeting), and to help others to fulfill their oaths (if it is not \n     sinful). He forbade us to drink from silver utensils, to wear gold \n     rings, to ride on silken saddles, to wear silk clothes, Dibaj (thick \n     silk cloth), Qassiy and Istabraq (two kinds of silk). (See \n     Hadith No. 539, Vol. 7)","reference":"Sahih al-Bukhari 6235, Book 79, Hadith 9","grade":"","question #":"question #2","question":"What are the prohibitions related to luxury and adornment mentioned in the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-86"},{"hadith-eng":"A man asked the Prophet, \"What Islamic traits are the best?\" The \n     Prophet said, \"Feed the people, and greet those whom you know and \n     those whom you do not know.\"","reference":"Sahih al-Bukhari 6236, Book 79, Hadith 10","grade":"","question #":"question #2","question":"How does Islam encourage interaction with both acquaintances and strangers?","id":"bukhari-79-87"},{"hadith-eng":"The Prophet (ﷺ) said, \"It is not lawful for a Muslim to desert (not to speak to) his brother Muslim for more \nthan three days while meeting, one turns his face to one side and the other turns his face to the other \nside. Lo! The better of the two is the one who starts greeting the other.\"","reference":"Sahih al-Bukhari 6237, Book 79, Hadith 11","grade":"","question #":"question #2","question":"Who is considered better when two Muslims have stopped speaking to each other?","id":"bukhari-79-88"},{"hadith-eng":"that he was a boy of ten at the time when the Prophet (ﷺ) emigrated to Medina. He added: I served Allah's \nApostle for ten years (the last part of his life time) and I know more than the people about the \noccasion whereupon the order of Al-Hijab was revealed (to the Prophet). Ubai b n Ka`b used to ask \nme about it. It was revealed (for the first time) during the marriage of Allah's Messenger (ﷺ) with Zainab bint \nJahsh. In the morning, the Prophet (ﷺ) was a bride-groom of her and he Invited the people, who took their \nmeals and went away, but a group of them remained with Allah's Messenger (ﷺ) and they prolonged their \nstay. Allah's Messenger (ﷺ) got up and went out, and I too, went out along with him till he came to the lintel \nof `Aisha's dwelling place. Allah's Messenger (ﷺ) thought that those people had left by then, so he returned, \nand I too, returned with him till he entered upon Zainab and found that they were still sitting there and \nhad not yet gone. The Prophet (ﷺ) went out again, and so did I with him till he reached the lintel of \n`Aisha's dwelling place, and then he thought that those people must have left by then, so he returned, \nand so did I with him, and found those people had gone. At that time the Divine Verse of Al-Hijab \nwas revealed, and the Prophet (ﷺ) set a screen between me and him (his family).","reference":"Sahih al-Bukhari 6238, Book 79, Hadith 12","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle the situation when guests overstayed their welcome?","id":"bukhari-79-89"},{"hadith-eng":"When the Prophet (ﷺ) married Zainab, the people came and were offered a meal, and then they sat down \n(after finishing their meals) and started chatting. The Prophet (ﷺ) showed as if he wanted to get up, but \nthey did not get up. When he noticed that, he got up, and some of the people also got up and went \naway, while some others kept on sitting. When the Prophet (ﷺ) returned to enter, he found the people still \nsitting, but then they got up and left. So I told the Prophet (ﷺ) of their departure and he came and went in. \nI intended to go in but the Prophet (ﷺ) put a screen between me and him, for Allah revealed:-- 'O you who \nbelieve! Enter not the Prophet's houses..' (33.53)","reference":"Sahih al-Bukhari 6239, Book 79, Hadith 13","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations where guests overstayed their welcome?","id":"bukhari-79-90"},{"hadith-eng":"(the wife of the Prophet) `Umar bin Al-Khattab used to say to Allah's Messenger (ﷺ) \"Let your wives be \nveiled\" But he did not do so. The wives of the Prophet (ﷺ) used to go out to answer the call of nature at \nnight only at Al-Manasi.' Once Sauda, the daughter of Zam`a went out and she was a tall woman. \n`Umar bin Al-Khattab saw her while he was in a gathering, and said, \"I have recognized you, O \nSauda!\" He (`Umar) said so as he was anxious for some Divine orders regarding the veil (the veiling \nof women.) So Allah revealed the Verse of veiling. (Al-Hijab; a complete body cover excluding the \neyes). (See Hadith No. 148, Vol. 1)","reference":"Sahih al-Bukhari 6240, Book 79, Hadith 14","grade":"","question #":"question #2","question":"How did the wives of the Prophet (ﷺ) manage their privacy before the revelation of the verse of veiling?","id":"bukhari-79-91"},{"hadith-eng":"A man peeped through a round hole into the dwelling place of the Prophet, while the Prophet (ﷺ) had a \nMidray (an iron comb) with which he was scratching his head. the Prophet (ﷺ) said, \" Had known you \nwere looking (through the hole), I would have pierced your eye with it (i.e., the comb).\" Verily! The \norder of taking permission to enter has been enjoined because of that sight, (that one should not look \nunlawfully at the state of others). (See Hadith No. 807, Vol. 7)","reference":"Sahih al-Bukhari 6241, Book 79, Hadith 15","grade":"","question #":"question #2","question":"How does Islam address the issue of privacy and respect for others' personal space?","id":"bukhari-79-92"},{"hadith-eng":"A man peeped into a room of the Prophet. The Prophet (ﷺ) stood up, holding an arrow head. It is as if I \nam just looking at him, trying to stab the man.","reference":"Sahih al-Bukhari 6242, Book 79, Hadith 16","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) react to someone invading his privacy, and what does this teach us about personal boundaries?","id":"bukhari-79-93"},{"hadith-eng":"I have not seen a thing resembling 'lamam' (minor sins) than what Abu Huraira 'narrated from the \nProphet who said \"Allah has written for Adam's son his share of adultery which he commits \ninevitably. The adultery of the eyes is the sight (to gaze at a forbidden thing), the adultery of the \ntongue is the talk, and the inner self wishes and desires and the private parts testify all this or deny it.\"","reference":"Sahih al-Bukhari 6243, Book 79, Hadith 17","grade":"","question #":"question #2","question":"How does Islam view the concept of minor sins in relation to human behavior?","id":"bukhari-79-94"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) greeted somebody, he used to greet him three times, and if he spoke a \nsentence, he used to repeat it thrice.","reference":"Sahih al-Bukhari 6244, Book 79, Hadith 18","grade":"","question #":"question #2","question":"How does repeating a statement multiple times affect communication and understanding in Islam?","id":"bukhari-79-95"},{"hadith-eng":"While I was present in one of the gatherings of the Ansar, Abu Musa came as if he was scared, and \nsaid, \"I asked permission to enter upon `Umar three times, but I was not given the permission, so I \nreturned.\" (When `Umar came to know about it) he said to Abu Musa, \"Why did you not enter?'. Abu \nMusa replied, \"I asked permission three times, and I was not given it, so I returned, for Allah's Messenger (ﷺ) \nsaid, \"If anyone of you asks the permission to enter thrice, and the permission is not given, then he \nshould return.' \" `Umar said, \"By Allah! We will ask Abu Musa to bring witnesses for it.\" (Abu Musa \nwent to a gathering of the Ansar and said). \"Did anyone of you hear this from the Prophet (ﷺ) ?\" Ubai bin \nKa`b said, \"By Allah, none will go with you but the youngest of the people (as a witness).\" (Abu \nSa`id) was the youngest of them, so I went with Abu Musa and informed `Umar that the Prophet (ﷺ) had \nsaid so. (See Hadith No. 277, Vol. 3)","reference":"Sahih al-Bukhari 6245, Book 79, Hadith 19","grade":"","question #":"question #2","question":"How should one respond if permission to enter is not granted after multiple requests?","id":"bukhari-79-96"},{"hadith-eng":"I entered (the house) along with Allah's Messenger (ﷺ) . There he found milk in a basin. He said, \"O Abu \nHirr! Go and call the people of Suffa to me.\" I went to them and invited them. They came and asked \npermission to enter, and when it was given, they entered. (See Hadith No. 459 for details)","reference":"Sahih al-Bukhari 6246, Book 79, Hadith 20","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate hospitality and generosity in his actions?","id":"bukhari-79-97"},{"hadith-eng":"that he passed by a group of boys and greeted them and said, \"The Prophet (ﷺ) used to do so.\"","reference":"Sahih al-Bukhari 6247, Book 79, Hadith 21","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate kindness and humility in his interactions with others?","id":"bukhari-79-98"},{"hadith-eng":"Sahl said, \"We used to feel happy on Fridays.\" I asked Sahl, \"Why?\" He said, \"There was an old \nwoman of our acquaintance who used to send somebody to Buda'a (Ibn Maslama said, \"Buda'a was a \ngarden of date-palms at Medina). She used to pull out the silq (a kind of vegetable) from its roots and \nput it in a cooking pot, adding some powdered barley over it (and cook it). After finishing the Jumua \n(Friday) prayer we used to (pass by her and) greet her, whereupon she would present us with that \nmeal, so we used to feel happy because of that. We used to have neither a midday nap, nor meals, \nexcept after the Friday prayer.\" (See Hadith No. 60, Vol.2)","reference":"Sahih al-Bukhari 6248, Book 79, Hadith 22","grade":"","question #":"question #2","question":"How did the community in Medina celebrate Fridays during the time of the Prophet?","id":"bukhari-79-99"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O `Aisha! This is Gabriel sending his greetings to you.\" I said, \"Peace, and \nAllah's Mercy be on him (Gabriel). You see what we do not see.\" (She was addressing Allah's \nApostle).","reference":"Sahih al-Bukhari 6249, Book 79, Hadith 23","grade":"","question #":"question #2","question":"How did the companions of the Prophet react to the presence of angels, according to Islamic teachings?","id":"bukhari-79-100"},{"hadith-eng":"I came to the Prophet (ﷺ) in order to consult him regarding my father's debt. When I knocked on the door, \nhe asked, \"Who is that?\" I replied, \"I\" He said, \"I, I?\" He repeated it as if he disliked it.","reference":"Sahih al-Bukhari 6250, Book 79, Hadith 24","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate the importance of clear communication in interactions?","id":"bukhari-79-101"},{"hadith-eng":"A man entered the mosque while Allah's Messenger (ﷺ) was sitting in one side of the mosque. The man \nprayed, came, and greeted the Prophet. Allah's Messenger (ﷺ) said to him, \"Wa 'Alaikas Salam (returned his \ngreeting). Go back and pray as you have not prayed (properly).\" The man returned, repeated his \nprayer, came back and greeted the Prophet. The Prophet (ﷺ) said, \"Wa alaika-s-Salam (returned his \ngreeting). Go back and pray again as you have not prayed (properly).\" The man said at the second or \nthird time, \"O Allah's Messenger (ﷺ)! Kindly teach me how to pray\". The Prophet (ﷺ) said, \"When you stand for \nprayer, perform ablution properly and then face the Qibla and say Takbir (Allahu-Akbar), and then \nrecite what you know from the Qur'an, and then bow with calmness till you feel at ease then rise from \nbowing, till you stand straight, and then prostrate calmly (and remain in prostration) till you feel at \nease, and then raise (your head) and sit with calmness till you feel at ease and then prostrate with \ncalmness (and remain in prostration) till you feel at ease, and then raise (your head) and sit with \ncalmness till you feel at ease in the sitting position, and do likewise in whole of your prayer.\" And \nAbu Usama added, \"Till you stand straight.\" (See Hadith No. 759, Vol.1)","reference":"Sahih al-Bukhari 6251, Book 79, Hadith 25","grade":"","question #":"question #2","question":"Why is it important to perform each movement in prayer with calmness and ease?","id":"bukhari-79-102"},{"hadith-eng":"The Prophet (ﷺ) said (in the above narration No. 268), \"And then raise your head till you feel at ease \nwhile sitting. \"","reference":"Sahih al-Bukhari 6252, Book 79, Hadith 26","grade":"","question #":"question #2","question":"How does the posture of sitting contribute to the overall experience of prayer in Islam?","id":"bukhari-79-103"},{"hadith-eng":"That the Prophet (ﷺ) said to her, \"Gabriel sends Salam (greetings) to you.\" She replied, \"Wa 'alaihi-s- \nSalam Wa Rahmatu-l-lah.\" (Peace and Allah's Mercy be on him).","reference":"Sahih al-Bukhari 6253, Book 79, Hadith 27","grade":"","question #":"question #2","question":"How is the relationship between the Prophet Muhammad (ﷺ) and Angel Gabriel depicted in Islamic teachings?","id":"bukhari-79-104"},{"hadith-eng":"Usama bin Zaid said, \"The Prophet (ﷺ) rode over a donkey with a saddle underneath which there was a \nthick soft Fadakiya velvet sheet. Usama bin Zaid was his companion rider, and he was going to pay a \nvisit to Sa`d bin Ubada (who was sick) at the dwelling place of Bani Al-Harith bin Al-Khazraj, and \nthis incident happened before the battle of Badr. The Prophet (ﷺ) passed by a gathering in which there \nwere Muslims and pagan idolators and Jews, and among them there was `Abdullah bin Ubai bin Salul, \nand there was `Abdullah bin Rawaha too. When a cloud of dust raised by the animal covered that \ngathering, `Abdullah bin Ubai covered his nose with his Rida (sheet) and said (to the Prophet), \"Don't \ncover us with dust.\" The Prophet (ﷺ) greeted them and then stopped, dismounted and invited them to \nAllah (i.e., to embrace Islam) and also recited to them the Holy Qur'an. `Abdullah bin Ubai' bin Salul \nsaid, \"O man! There is nothing better than what you say, if what you say is the truth. So do not trouble \nus in our gatherings. Go back to your mount (or house,) and if anyone of us comes to you, tell (your \ntales) to him.\" On that `Abdullah bin Rawaha said, \"(O Allah's Messenger (ﷺ)!) Come to us and bring it(what \nyou want to say) in our gatherings, for we love that.\" So the Muslims, the pagans and the Jews started \nquarreling till they were about to fight and clash with one another. The Prophet (ﷺ) kept on quietening \nthem (till they all became quiet). He then rode his animal, and proceeded till he entered upon Sa`d bin \n'Ubada, he said, \"O Sa`d, didn't you hear what Abu Habbab said? (He meant `Abdullah bin Ubai). He \nsaid so-and-so.\" Sa`d bin 'Ubada said, \"O Allah's Messenger (ﷺ)! Excuse and forgive him, for by Allah, \nAllah has given you what He has given you. The people of this town decided to crown him (as their \nchief) and make him their king. But when Allah prevented that with the Truth which He had given \nyou, it choked him, and that was what made him behave in the way you saw him behaving.\" So the \nProphet excused him.","reference":"Sahih al-Bukhari 6254, Book 79, Hadith 28","grade":"","question #":"question #2","question":"What was the reaction of different groups when the Prophet (ﷺ) invited them to Islam?","id":"bukhari-79-105"},{"hadith-eng":"I heard Ka`b bin Malik narrating (when he did not join the battle of Tabuk): Allah's Messenger (ﷺ) forbade \nall the Muslims to speak to us. I would come to Allah's Messenger (ﷺ) and greet him, and I would wonder \nwhether the Prophet (ﷺ) did move his lips to return to my greetings or not till fifty nights passed away. \nThe Prophet (ﷺ) then announced (to the people) Allah's forgiveness for us (acceptance of our repentance) \nat the time when he had offered the Fajr (morning) prayer.","reference":"Sahih al-Bukhari 6255, Book 79, Hadith 29","grade":"","question #":"question #2","question":"How does the process of repentance and forgiveness manifest in the context of community and leadership in Islam?","id":"bukhari-79-106"},{"hadith-eng":"A group of Jews came to Allah's Messenger (ﷺ) and said, \"As-samu 'Alaika \" (Death be on you), and I \nunderstood it and said to them, \"Alaikum AsSamu wa-l-la'na (Death and curse be on you).\" Allah's \nApostle said, \"Be calm! O `Aisha, for Allah loves that one should be kind and lenient in all matters.\" I \nsaid. \"O Allah's Messenger (ﷺ)! Haven't you heard what they have said?\" Allah's Messenger (ﷺ) said, \"I have \n(already) said (to them), 'Alaikum (upon you).' \"","reference":"Sahih al-Bukhari 6256, Book 79, Hadith 30","grade":"","question #":"question #2","question":"How does Islam emphasize kindness and leniency in interactions with others, even when faced with hostility?","id":"bukhari-79-107"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the Jews greet you, they usually say, 'As-Samu 'alaikum (Death be on \nyou),' so you should say (in reply to them), 'Wa'alaikum (And on you).","reference":"Sahih al-Bukhari 6257, Book 79, Hadith 31","grade":"","question #":"question #2","question":"What is the significance of responding with 'Wa'alaikum' in Islamic etiquette?","id":"bukhari-79-108"},{"hadith-eng":"the Prophet (ﷺ) said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum \n(And on you).' \"","reference":"Sahih al-Bukhari 6258, Book 79, Hadith 32","grade":"","question #":"question #2","question":"What is the significance of the phrase 'Wa'alaikum' in Islamic etiquette?","id":"bukhari-79-109"},{"hadith-eng":"Allah's Messenger (ﷺ) sent me, Az-Zubair bin Al-Awwam and Abu Marthad Al-Ghanawi, and all of us were \nhorsemen, and he said, \"Proceed till you reach Rawdat Khakh, where there is a woman from the \npagans carrying a letter sent by Hatib bin Abi Balta'a to the pagans (of Mecca).\" So we overtook her \nwhile she was proceeding on her camel at the same place as Allah's Messenger (ﷺ) told us. We said (to her) \n\"Where is the letter which is with you?\" She said, \"I have no letter with me.\" So we made her camel \nkneel down and searched her mount (baggage etc) but could not find anything. My two companions \nsaid, \"We do not see any letter.\" I said, \"I know that Allah's Messenger (ﷺ) did not tell a lie. By Allah, if you \n(the lady) do not bring out the letter, I will strip you of your clothes' When she noticed that I was \nserious, she put her hand into the knot of her waist sheet, for she was tying a sheet round herself, and \nbrought out the letter. So we proceeded to Allah's Messenger (ﷺ) with the letter. The Prophet (ﷺ) said (to Habib), \n\"What made you o what you have done, O Hatib?\" Hatib replied, \"I have done nothing except that I \nbelieve in Allah and His Apostle, and I have not changed or altered (my religion). But I wanted to do \nthe favor to the people (pagans of Mecca) through which Allah might protect my family and my \nproperty, as there is none among your companions but has someone in Mecca through whom Allah \nprotects his property (against harm). The Prophet (ﷺ) said, \"Habib has told you the truth, so do not say to \nhim (anything) but good.\" `Umar bin Al-Khattab said, \"Verily he has betrayed Allah, His Apostle, and \nthe believers! Allow me to chop his neck off!\" The Prophet (ﷺ) said, \"O `Umar! What do you know; \nperhaps Allah looked upon the Badr warriors and said, 'Do whatever you like, for I have ordained that \nyou will be in Paradise.'\" On that `Umar wept and said, \"Allah and His Apostle know best.\"","reference":"Sahih al-Bukhari 6259, Book 79, Hadith 33","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react to the discovery of the letter and what does it reveal about their loyalty?","id":"bukhari-79-110"},{"hadith-eng":"that Heraclius had sent for him to come along with a group of the Quraish who were trading in Sha'm, \nand they came to him. Then Abu Sufyan mentioned the whole narration and said, \"Heraclius asked for \nthe letter of Allah's Messenger (ﷺ) . When the letter was read, its contents were as follows: 'In the name of \nAllah, the Beneficent, the Merciful. From Muhammad, Allah's slave and His Apostle to Heraclius, the \nChief of Byzantines: Peace be upon him who follows the right path (guidance)! Amma ba'du (to \nproceed )...' (See Hadith No 6, Vol 1 for details)","reference":"Sahih al-Bukhari 6260, Book 79, Hadith 34","grade":"","question #":"question #2","question":"How did Heraclius respond to the message from Prophet Muhammad?","id":"bukhari-79-111"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned a person from Bani Israel who took a piece of wood, made a hole in it, and put therein one thousand Dinar and letter from him to his friend. The Prophet (ﷺ) said, \"(That man) cut a piece of wood and put the money inside it and wrote a letter from such and such a person to such and such a person.\"","reference":"Sahih al-Bukhari 6261, Book 79, Hadith 35","grade":"","question #":"question #2","question":"How does the story illustrate the importance of fulfilling promises and commitments?","id":"bukhari-79-112"},{"hadith-eng":"The people of (the tribe of) Quraiza agreed upon to accept the verdict of Sa`d. The Prophet (ﷺ) sent for \nhim (Sa`d) and he came. The Prophet (ﷺ) said (to those people), \"Get up for your chief or the best among \nyou!\" Sa`d sat beside the Prophet (ﷺ) and the Prophet (ﷺ) said (to him), \"These people have agreed to accept \nyour verdict.\" Sa`d said, \"So I give my judgment that their warriors should be killed and their women \nand children should be taken as captives.\" The Prophet (ﷺ) said, \"You have judged according to the King's \n(Allah's) judgment.\" (See Hadith No. 447, Vol. 5)","reference":"Sahih al-Bukhari 6262, Book 79, Hadith 36","grade":"","question #":"question #2","question":"How does Islamic jurisprudence address the treatment of captives in times of conflict?","id":"bukhari-79-113"},{"hadith-eng":"I asked Anas, \"Was it a custom of the companions of the Prophet (ﷺ) to shake hands with one another?\" \nHe said, \"Yes.\"","reference":"Sahih al-Bukhari 6263, Book 79, Hadith 37","grade":"","question #":"question #2","question":"How did the companions of the Prophet demonstrate camaraderie and brotherhood?","id":"bukhari-79-114"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) and he was holding the hand of `Umar bin Al-Khattab.","reference":"Sahih al-Bukhari 6264, Book 79, Hadith 38","grade":"","question #":"question #2","question":"How is the relationship between the Prophet Muhammad (ﷺ) and his companions depicted in Islamic teachings?","id":"bukhari-79-115"},{"hadith-eng":"Allah's Messenger (ﷺ) taught me the Tashah-hud as he taught me a Sura from the Qur'an, while my hand was \nbetween his hands. (Tashah-hud was) all the best compliments and the prayers and the good things are \nfor Allah. Peace and Allah's Mercy and Blessings be on you, O Prophet! Peace be on us and on the \npious slaves of Allah, I testify that none has the right to be worshipped but Allah, and I also testify \nthat Muhammad is Allah's slave and His Apostle. (We used to recite this in the prayer) during the \nlifetime of the Prophet (ﷺ) , but when he had died, we used to say, \"Peace be on the Prophet.\"","reference":"Sahih al-Bukhari 6265, Book 79, Hadith 39","grade":"","question #":"question #2","question":"What changes were made to the recitation of Tashah-hud after the death of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-116"},{"hadith-eng":"`Ali bin Abu Talib came out of the house of the Prophet (ﷺ) during his fatal ailment. The people asked \n(`Ali), \"O Abu Hasan! How is the health of Allah's Messenger (ﷺ) this morning?\" `Ali said, \"This morning \nhe is better, with the grace of Allah.\" Al-`Abbas held `Ali by the hand and said, \"Don't you see him \n(about to die)? By Allah, within three days you will be the slave of the stick (i.e., under the command \nof another ruler). By Allah, I think that Allah's Messenger (ﷺ) will die from his present ailment, for I know \nthe signs of death on the faces of the offspring of `Abdul Muttalib. So let us go to Allah's Messenger (ﷺ) to \nask him who will take over the Caliphate. If the authority is given to us, we will know it, and if it is \ngiven to somebody else we will request him to recommend us to him. \" `Ali said, \"By Allah! If we ask \nAllah's Messenger (ﷺ) for the rulership and he refuses, then the people will never give it to us. Besides, I will \nnever ask Allah's Messenger (ﷺ) for it.\" (See Hadith No 728, Vol 5)","reference":"Sahih al-Bukhari 6266, Book 79, Hadith 40","grade":"","question #":"question #2","question":"How did `Ali respond to the suggestion of asking the Prophet about the future leadership?","id":"bukhari-79-117"},{"hadith-eng":"While I was a companion rider with the Prophet (ﷺ) he said, \"O Mu`adh!\" I replied, \"Labbaik wa \nSa`daik.\" He repeated this call three times and then said, \"Do you know what Allah's Right on His \nslaves is?\" I replied, \"No.\" He said, Allah's Right on His slaves is that they should worship Him \n(Alone) and should not join partners in worship with Him.\" He said, \"O Mu`adh!\" I replied, \"Labbaik \nwa Sa`daik.\" He said, \"Do you know what the right of (Allah's) salves on Allah is, if they do that \n(worship Him Alone and join none in His worship)? It is that He will not punish them.\"\n\n(another chain through Mu'adh)","reference":"Sahih al-Bukhari 6267, Book 79, Hadith 41","grade":"","question #":"question #2","question":"What is the right of Allah's slaves on Him if they worship Him alone and do not associate partners with Him?","id":"bukhari-79-118"},{"hadith-eng":"While I was walking with the Prophet (ﷺ) at the Hurra of Medina in the evening, the mountain of Uhud \nappeared before us. The Prophet (ﷺ) said, \"O Abu Dhar! I would not like to have gold equal to Uhud \n(mountain) for me, unless nothing of it, not even a single Dinar remains of it with me, for more than \none day or three days, except that single Dinar which I will keep for repaying debts. I will spend all of \nit (the whole amount) among Allah's slaves like this and like this and like this.\" The Prophet (ﷺ) pointed \nout with his hand to illustrate it and then said, \"O Abu Dhar!\" I replied, \"Labbaik wa Sa`daik, O \nAllah's Messenger (ﷺ)!\" He said, \"Those who have much wealth (in this world) will be the least rewarded (in \nthe Hereafter) except those who do like this and like this (i.e., spend their money in charity).\" Then he \nordered me, \"Remain at your place and do not leave it, O Abu Dhar, till I come back.\" He went away \ntill he disappeared from me. Then I heard a voice and feared that something might have happened to \nAllah's Messenger (ﷺ), and I intended to go (to find out) but I remembered the statement of Allah's Messenger (ﷺ) \nthat I should not leave, my place, so I kept on waiting (and after a while the Prophet (ﷺ) came), and I said \nto him, \"O Allah's Messenger (ﷺ), I heard a voice and I was afraid that something might have happened to \nyou, but then I remembered your statement and stayed (there). The Prophet (ﷺ) said, \"That was Gabriel \nwho came to me and informed me that whoever among my followers died without joining others in \nworship with Allah, would enter Paradise.\" I said, \"O Allah's Messenger (ﷺ)! Even if he had committed \nillegal sexual intercourse and theft?\" He said, \"Even if he had committed illegal sexual intercourse and \ntheft.\"","reference":"Sahih al-Bukhari 6268, Book 79, Hadith 42","grade":"","question #":"question #2","question":"How does the concept of monotheism relate to the assurance of entering Paradise in Islamic belief?","id":"bukhari-79-119"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man should not make another man get up from his (the latter's) seat (in a \ngathering) in order to sit there.","reference":"Sahih al-Bukhari 6269, Book 79, Hadith 43","grade":"","question #":"question #2","question":"How should individuals behave in social gatherings to show respect for others?","id":"bukhari-79-120"},{"hadith-eng":"The Prophet (ﷺ) forbade that a man should be made to get up from his seat so that another might sit on it, \nbut one should make room and spread out. Ibn `Umar disliked that a man should get up from his seat \nand then somebody else sit at his place.","reference":"Sahih al-Bukhari 6270, Book 79, Hadith 44","grade":"","question #":"question #2","question":"How does Islam view the act of making space for others in social settings?","id":"bukhari-79-121"},{"hadith-eng":"When Allah's Messenger (ﷺ) married Zainab bint Jahsh, he invited the people who took their meals and then \nremained sitting and talking. The Prophet (ﷺ) pretended to be ready to get up, but the people did not get \nup. When he noticed that, he got up, and when he had got up, some of those people got up along with \nhim and there remained three (who kept on sitting). Then the Prophet (ﷺ) came back and found those \npeople still sitting. Later on those people got up and went away. So I went to the Prophet (ﷺ) and \ninformed him that they had left. \nThe Prophet (ﷺ) came, and entered (his house). I wanted to enter(along with him) but he dropped a curtain \nbetween me and him. Allah then revealed: 'O you who believe! Do not enter the Prophet's Houses \nuntil leave is given... (to His statement)... Verily! That shall be an enormity, in Allah's sight.' (33.53)","reference":"Sahih al-Bukhari 6271, Book 79, Hadith 45","grade":"","question #":"question #2","question":"How does the Quran address the issue of privacy and respect for personal space in the homes of others?","id":"bukhari-79-122"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) in the courtyard of the Ka`ba in the Ihtiba.' posture putting his hand round his \nlegs like this.","reference":"Sahih al-Bukhari 6272, Book 79, Hadith 46","grade":"","question #":"question #2","question":"How did the Prophet demonstrate humility and simplicity in his actions?","id":"bukhari-79-123"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Shall I inform you of the biggest of the great sins?\" They said, \"Yes, O Allah's \nApostle!\" He said, \"To join partners in worship with Allah, and to be undutiful to one's parents. \"","reference":"Sahih al-Bukhari 6273, Book 79, Hadith 47","grade":"","question #":"question #2","question":"Why is associating partners with Allah considered a major sin in Islam?","id":"bukhari-79-124"},{"hadith-eng":"as above (No. 290) adding: The Prophet (ﷺ) was reclining (leaning) and then he sat up saying, \"And I \nwarn you against giving a false statement.\" And he kept on saying that warning so much so that we \nsaid, \"Would that he had stopped.\"","reference":"Sahih al-Bukhari 6274, Book 79, Hadith 48","grade":"","question #":"question #2","question":"How did the Prophet emphasize the seriousness of false testimony?","id":"bukhari-79-125"},{"hadith-eng":"Once the Prophet (ﷺ) offered the `Asr prayer and then he walked quickly and entered his house.","reference":"Sahih al-Bukhari 6275, Book 79, Hadith 49","grade":"","question #":"question #2","question":"What can be inferred about the Prophet's (ﷺ) routine or urgency after the `Asr prayer?","id":"bukhari-79-126"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer his prayer (while standing) in the midst of the bed, and I used to lie in \nfront of him between him and the Qibla It I had any necessity for getting up and I used to dislike to get \nup and face him (while he was in prayer), but I would gradually slip away from the bed.","reference":"Sahih al-Bukhari 6276, Book 79, Hadith 50","grade":"","question #":"question #2","question":"How does this narration reflect the relationship and interaction between the Prophet and his family during prayer?","id":"bukhari-79-127"},{"hadith-eng":"The news of my fasting was mentioned to the Prophet (ﷺ) . So he entered upon me and I put for him a \nleather cushion stuffed with palm-fibres. The Prophet (ﷺ) sat on the floor and the cushion was between me \nand him. He said to me, \"Isn't it sufficient for you (that you fast) three days a month?\" I said, \"O \nAllah's Messenger (ﷺ)! (I can fast more than this).\" He said, \"You may fast) five days a month.\" I said, \"O \nAllah's Messenger (ﷺ)! (I can fast more than this).\" He said, \"(You may fast) seven days.\" I said, \"O Allah's \nApostle!\" He said, \"Nine.\" I said, \"O Allah's Messenger (ﷺ)!\" He said, \"Eleven.\" I said, \"O Allah's Messenger (ﷺ)!\" \nHe said, \"No fasting is superior to the fasting of (the Prophet (ﷺ) David) which was one half of a year, and \nhe used, to fast on alternate days. (See Hadith No. 300, Vol 3)","reference":"Sahih al-Bukhari 6277, Book 79, Hadith 51","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) compare different fasting practices?","id":"bukhari-79-128"},{"hadith-eng":"'Alaqama went to Sham and came to the mosque and offered a two-rak`at prayer, and invoked Allah: \n\"O Allah! Bless me with a (pious) good companion.\" So he sat beside Abu Ad-Darda' who asked, \n\"From where are you?\" He said, \"From the people of Kufa.\" Abu Darda' said, \"Wasn't there among \nyou the person who keeps the secrets (of the Prophet (ﷺ) ) which nobody knew except him (i.e., Hudhaifa \n(bin Al-Yaman)). And isn't there among you the person whom Allah gave refuge from Satan through \nthe request (tongue) of Allah's Messenger (ﷺ)? (i.e., `Ammar). Isn't there among you the one who used to \ncarry the Siwak and the cushion (or pillows (of the Prophets)? (i.e., Ibn Mas`ud). How did Ibn Mas`ud \nuse to recite 'By the night as it conceals (the light)?\" (Sura 92). 'Alqama said, \"Wadhdhakari Wal \nUntha' (And by male and female.\") Abu Ad-Darda added. 'These people continued to argue with me \nregarding it till they were about to cause me to have doubts although I heard it from Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 6278, Book 79, Hadith 52","grade":"","question #":"question #2","question":"How does the presence of pious individuals influence one's spiritual journey and prayers?","id":"bukhari-79-129"},{"hadith-eng":"We used to have a midday nap and take our meals after the Jumua (prayer).","reference":"Sahih al-Bukhari 6279, Book 79, Hadith 53","grade":"","question #":"question #2","question":"How did the companions of the Prophet manage their daily routines around the time of Jumu'ah prayer?","id":"bukhari-79-130"},{"hadith-eng":"There was no name dearer to `Ali than his nickname Abu Turab (the father of dust). He used to feel \nhappy whenever he was called by this name. Once Allah's Messenger (ﷺ) came to the house of Fatima but \ndid not find `Ali in the house. So he asked \"Where is your cousin?\" She replied, \"There was \nsomething (a quarrel) between me and him whereupon he got angry with me and went out without \nhaving a midday nap in my house.\" Allah's Messenger (ﷺ) asked a person to look for him. That person came, \nand said, \"O Allah's Messenger (ﷺ)! He (Ali) is sleeping in the mosque.\" So Allah's Messenger (ﷺ) went there and \nfound him lying. His upper body cover had fallen off to one side of his body, and so he was covered \nwith dust. Allah's Messenger (ﷺ) started cleaning the dust from him, saying, \"Get up, O Abu Turab! Get up, \nAbu Turab!\" (See Hadith No. 432, Vol 1)","reference":"Sahih al-Bukhari 6280, Book 79, Hadith 54","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the situation when he found Ali sleeping in the mosque?","id":"bukhari-79-131"},{"hadith-eng":"Anas said, \"Um Sulaim used to spread a leather sheet for the Prophet (ﷺ) and he used to take a midday \nnap on that leather sheet at her home.\" Anas added, \"When the Prophet (ﷺ) had slept, she would take \nsome of his sweat and hair and collect it (the sweat) in a bottle and then mix it with Suk (a kind of \nperfume) while he was still sleeping. \"When the death of Anas bin Malik approached, he advised that \nsome of that Suk be mixed with his Hanut (perfume for embalming the dead body), and it was mixed \nwith his Hanut.","reference":"Sahih al-Bukhari 6281, Book 79, Hadith 55","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) use his sweat and hair in their personal practices?","id":"bukhari-79-132"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to Quba, he used to visit Um Haram bint Milhan who would offer him \nmeals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered \nhim a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, \n'What makes you laugh, O Allah's Messenger (ﷺ)?' He said, 'Some people of my followers were displayed \nbefore me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, \n'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's \nApostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his \nhead and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Messenger (ﷺ)?' \nHe said, 'Some people of my followers were displayed before me as warriors fighting for Allah's \nCause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um \nHaram) said, 'O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.' He said, You will \nbe amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and \non coming out of the sea, she fell down from her riding animal and died.","reference":"Sahih al-Bukhari 6282, 6283, Book 79, Hadith 56","grade":"","question #":"question #2","question":"How does the concept of divine visions or dreams play a role in the life of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-133"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to Quba, he used to visit Um Haram bint Milhan who would offer him \nmeals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered \nhim a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, \n'What makes you laugh, O Allah's Messenger (ﷺ)?' He said, 'Some people of my followers were displayed \nbefore me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, \n'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's \nApostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his \nhead and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Messenger (ﷺ)?' \nHe said, 'Some people of my followers were displayed before me as warriors fighting for Allah's \nCause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um \nHaram) said, 'O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.' He said, You will \nbe amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and \non coming out of the sea, she fell down from her riding animal and died.","reference":"Sahih al-Bukhari 6282, 6283, Book 79, Hadith 56","grade":"","question #":"question #2","question":"How does the concept of martyrdom and fighting for Allah's cause manifest in Islamic teachings?","id":"bukhari-79-134"},{"hadith-eng":"The Prophet (ﷺ) forbade two kinds of dresses and two kinds of bargains; Ishtimal As-Samma and Al- \nIhtiba in one garment with no part of it covering one's private parts. (The two kinds of bargains were:) \nAl-Mulamasa and Al-Munabadha.","reference":"Sahih al-Bukhari 6284, Book 79, Hadith 57","grade":"","question #":"question #2","question":"What are the two types of transactions that are forbidden in Islam according to this narration?","id":"bukhari-79-135"},{"hadith-eng":"Mother of the Believers: We, the wives of the Prophet (ﷺ) were all sitting with the Prophet (ﷺ) and none of us \nhad left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Messenger (ﷺ) \n.' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on \nhis right or his left, confided something to her, whereupon she wept bitterly. When he noticed her \nsorrow, he confided something else to her for the second time, and she started laughing. Only I from \namong the Prophet's wives said to her, \"(O Fatima), Allah's Messenger (ﷺ) selected you from among us for \nthe secret talk and still you weep?\" When Allah's Messenger (ﷺ) got up (and went away), I asked her, \"What \ndid he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Messenger (ﷺ)\" But when he died \nI asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the \nProphet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, \nsaying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an \nwith him once every year. \nHe added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has \napproached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the \nHereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet (ﷺ) saw me in \nthis sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased \nthat you will be chief of all the believing women (or chief of the women of this nation i.e. my \nfollowers?\")","reference":"Sahih al-Bukhari 6285, 6286, Book 79, Hadith 58","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prepare his family for his impending death?","id":"bukhari-79-136"},{"hadith-eng":"Mother of the Believers: We, the wives of the Prophet (ﷺ) were all sitting with the Prophet (ﷺ) and none of us \nhad left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Messenger (ﷺ) \n.' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on \nhis right or his left, confided something to her, whereupon she wept bitterly. When he noticed her \nsorrow, he confided something else to her for the second time, and she started laughing. Only I from \namong the Prophet's wives said to her, \"(O Fatima), Allah's Messenger (ﷺ) selected you from among us for \nthe secret talk and still you weep?\" When Allah's Messenger (ﷺ) got up (and went away), I asked her, \"What \ndid he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Messenger (ﷺ)\" But when he died \nI asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the \nProphet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, \nsaying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an \nwith him once every year. \nHe added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has \napproached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the \nHereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet (ﷺ) saw me in \nthis sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased \nthat you will be chief of all the believing women (or chief of the women of this nation i.e. my \nfollowers?\")","reference":"Sahih al-Bukhari 6285, 6286, Book 79, Hadith 58","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prepare his family for his impending death according to Islamic teachings?","id":"bukhari-79-137"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) lying on his back in the mosque and putting one of his legs over the other.","reference":"Sahih al-Bukhari 6287, Book 79, Hadith 59","grade":"","question #":"question #2","question":"How does the posture of lying on one's back with a leg over the other relate to Islamic etiquette?","id":"bukhari-79-138"},{"hadith-eng":"the Prophet (ﷺ) said \"When three persons are together, then no two of them should hold secret counsel \nexcluding the third person.\"","reference":"Sahih al-Bukhari 6288, Book 79, Hadith 60","grade":"","question #":"question #2","question":"How can secretive discussions among a group affect the feelings of those excluded?","id":"bukhari-79-139"},{"hadith-eng":"The Prophet (ﷺ) confided to me a secret which I did not disclose to anybody after him. And Um Sulaim \nasked me (about that secret) but I did not tell her.","reference":"Sahih al-Bukhari 6289, Book 79, Hadith 61","grade":"","question #":"question #2","question":"How does the behavior of Anas bin Malik illustrate the importance of trustworthiness in Islamic teachings?","id":"bukhari-79-140"},{"hadith-eng":"The Prophet (ﷺ) said, \"When you are three persons sitting together, then no two of you should hold secret \ncounsel excluding the third person until you are with some other people too, for that would grieve \nhim.\"","reference":"Sahih al-Bukhari 6290, Book 79, Hadith 62","grade":"","question #":"question #2","question":"Why is it important to avoid excluding someone from a conversation in a small group?","id":"bukhari-79-141"},{"hadith-eng":"One day the Prophet (ﷺ) divided and distributed something amongst the people whereupon an Ansari man \nsaid, \"In this division Allah's Countenance has not been sought.\" I said, \"By Allah! I will go (and \ninform) the Prophet.\" So I went to him while he was with a group of people, and I secretly informed \nhim of that, whereupon he became so angry that his face became red, and he then said, \"May Allah \nbestow His Mercy on Moses (for) he was hurt more than that, yet he remained patient.\"","reference":"Sahih al-Bukhari 6291, Book 79, Hadith 63","grade":"","question #":"question #2","question":"What lesson can be learned from the Prophet's response to being hurt or criticized?","id":"bukhari-79-142"},{"hadith-eng":"The Iqama for the prayer was announced while a man was talking to Allah's Messenger (ﷺ) privately. He \ncontinued talking in that way till the Prophet's companions slept, and afterwards the Prophet (ﷺ) got up \nand offered the prayer with them.","reference":"Sahih al-Bukhari 6292, Book 79, Hadith 64","grade":"","question #":"question #2","question":"How did the companions of the Prophet react when he was engaged in a private conversation before prayer?","id":"bukhari-79-143"},{"hadith-eng":"The Prophet (ﷺ) said, \"Do not keep the fire burning in your houses when you go to bed.\"","reference":"Sahih al-Bukhari 6293, Book 79, Hadith 65","grade":"","question #":"question #2","question":"Why is it important to extinguish fires before going to sleep according to Islamic teachings?","id":"bukhari-79-144"},{"hadith-eng":"One night a house in Medina was burnt with its occupants. The Prophet (ﷺ) spoke about them, saying, \n\"This fire is indeed your enemy, so whenever you go to bed, put it out to protect yourselves.\"","reference":"Sahih al-Bukhari 6294, Book 79, Hadith 66","grade":"","question #":"question #2","question":"Why is fire considered an enemy in the context of household safety?","id":"bukhari-79-145"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(At bedtime) cover the utensils, close the doors, and put out the lights, lest the \nevil creature (the rat) should pull away the wick and thus burn the people of the house.\"","reference":"Sahih al-Bukhari 6295, Book 79, Hadith 67","grade":"","question #":"question #2","question":"How can covering utensils and closing doors at night contribute to household safety?","id":"bukhari-79-146"},{"hadith-eng":"Allah s Apostle said, \"When you intend going to bed at night, put out the lights, close the doors, tie \nthe mouths of the water skins, and cover your food and drinks.\" Hamrnam said, \"I think he (the other \nnarrator) added, 'even with piece of wood across the utensil.'","reference":"Sahih al-Bukhari 6296, Book 79, Hadith 68","grade":"","question #":"question #2","question":"Why is it important to cover food and drinks at night in Islam?","id":"bukhari-79-147"},{"hadith-eng":"The Prophet (ﷺ) said \"Five things are in accordance with Al Fitra (i.e. the tradition of prophets): to be \ncircumcised, to shave the pelvic region, to pull out the hair of the armpits, to cut short the moustaches, \nand to clip the nails.'","reference":"Sahih al-Bukhari 6297, Book 79, Hadith 69","grade":"","question #":"question #2","question":"Why is circumcision considered a part of the prophetic tradition in Islam?","id":"bukhari-79-148"},{"hadith-eng":"Allah's Messenger (ﷺ) said \"The Prophet) Abraham circumcised himself after \n     he had passed the age of eighty years and he circumcised himself with \n     an adze.\"","reference":"Sahih al-Bukhari 6298, Book 79, Hadith 70","grade":"","question #":"question #2","question":"What tool did Prophet Abraham use for circumcision as mentioned in Islamic teachings?","id":"bukhari-79-149"},{"hadith-eng":"Ibn 'Abbas was asked, \"How old were you when\n     the Prophet (ﷺ) died?\" He replied. \"At that time I had been circumcised.\" \n     At that time, people did not circumcise the boys till they attained \n     the age of puberty. Sa'id bin Jubair said, \"Ibn 'Abbas said, 'When the\n     Prophet died, I had already been circumcised. \"","reference":"Sahih al-Bukhari 6299, Book 79, Hadith 71","grade":"","question #":"question #2","question":"How does the age of circumcision relate to the age of puberty in historical Islamic context?","id":"bukhari-79-150"},{"hadith-eng":"Sa'id ibn Jubair said, \"Ibn 'Abbas said, 'When the Prophet (ﷺ) died, I had already been circumcised.' \"","reference":"Sahih al-Bukhari 6300, Book 79, Hadith 72","grade":"","question #":"question #2","question":"How does this narration contribute to understanding the timeline of events in the life of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-151"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever among you takes an oath wherein he says, 'By Al-Lat and Al-`Uzza,' \nnames of two Idols worshipped by the Pagans, he should say, 'None has the right to be worshipped but \nAllah; And whoever says to his friend, 'Come, let me gamble with you ! He should give something in \ncharity. \" (See Hadith No. 645)","reference":"Sahih al-Bukhari 6301, Book 79, Hadith 73","grade":"","question #":"question #2","question":"What is the recommended action for someone who invites another to gamble in Islam?","id":"bukhari-79-152"},{"hadith-eng":"During the life-time of the Prophet (ﷺ) I built a house with my own hands so that it might protect me from \nthe rain and shade me from the sun; and none of Allah's creatures assisted me in building it.","reference":"Sahih al-Bukhari 6302, Book 79, Hadith 74","grade":"","question #":"question #2","question":"How can building a house with one's own hands be seen as an act of independence and self-sufficiency?","id":"bukhari-79-153"},{"hadith-eng":"Ibn `Umar said, \"By Allah, I have not put a brick over a brick (i.e. constructed a building) or planted \nany date-palm tree since the death of the Prophet.\" Sufyan (the sub narrator) said, \"I told this narration \n(of Ibn `Umar) to one of his (Ibn `Umar's) relatives, and he said, 'By Allah, he did build (something.' \n\"Sufyan added, \"I said, 'He must have said (the above narration) before he built.\"","reference":"Sahih al-Bukhari 6303, Book 79, Hadith 75","grade":"","question #":"question #2","question":"How can differing accounts of a person's actions after their death affect the understanding of their character or intentions?","id":"bukhari-79-154"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah created Adam in His picture, sixty cubits (about 30 meters) in height. When \nHe created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they \nwill say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went \nand) said, 'As-Salamu alaikum (Peace be upon you).' They replied, 'AsSalamu-'Alaika wa \nRahmatullah (Peace and Allah's Mercy be on you) So they increased 'Wa Rahmatullah' The Prophet (ﷺ) \nadded 'So whoever will enter Paradise, will be of the shape and picture of Adam Since then the \ncreation of Adam's (offspring) (i.e. stature of human beings is being diminished continuously) to the \npresent time.\"","reference":"Sahih al-Bukhari 6227, Book 79, Hadith 1","grade":"","question #":"question #3","question":"What does the hadith imply about the physical form of those who will enter Paradise?","id":"bukhari-79-155"},{"hadith-eng":"Al-Fadl bin `Abbas rode behind the Prophet (ﷺ) as his companion rider on the back portion of his she \ncamel on the Day of Nahr (slaughtering of sacrifice, 10th Dhul-Hijja) and Al-Fadl was a handsome \nman. The Prophet (ﷺ) stopped to give the people verdicts. In the meantime, a beautiful woman From the \ntribe of Khath'am came, asking the verdict of Allah's Messenger (ﷺ). Al-Fadl started looking at her as her \nbeauty attracted him. The Prophet (ﷺ) looked behind while Al-Fadl was looking at her; so the Prophet (ﷺ) \nheld out his hand backwards and caught the chin of Al-Fadl and turned his face (to the owner sides in \norder that he should not gaze at her. She said, \"O Allah's Messenger (ﷺ)! The obligation of Performing Hajj \nenjoined by Allah on His worshipers, has become due (compulsory) on my father who is an old man \nand who cannot sit firmly on the riding animal. Will it be sufficient that I perform Hajj on his behalf?\" \nHe said, \"Yes.\"","reference":"Sahih al-Bukhari 6228, Book 79, Hadith 2","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) address situations involving attraction and modesty?","id":"bukhari-79-156"},{"hadith-eng":"The Prophet (ﷺ) said, 'Beware! Avoid sitting on the roads.\" They (the people) said, \"O Allah s Apostle! \nWe can't help sitting (on the roads) as these are (our places) here we have talks.\" The Prophet (ﷺ) said, ' l f \nyou refuse but to sit, then pay the road its right ' They said, \"What is the right of the road, O Allah's \nApostle?\" He said, 'Lowering your gaze, refraining from harming others, returning greeting, and \nenjoining what is good, and forbidding what is evil.\"","reference":"Sahih al-Bukhari 6229, Book 79, Hadith 3","grade":"","question #":"question #3","question":"What actions are encouraged to promote good and prevent harm in community settings?","id":"bukhari-79-157"},{"hadith-eng":"When we prayed with the Prophet (ﷺ) we used to say: As-Salam be on Allah from His worshipers, As- \nSalam be on Gabriel, As-Salam be on Michael, As-Salam be on so-and-so. When the Prophet (ﷺ) finished \nhis prayer, he faced us and said, \"Allah Himself is As-Salam (Peace), so when one sits in the prayer, \none should say, 'at-Tahiyatu-li l-lahi Was-Salawatu, Wat-Taiyibatu, As-Salamu 'Alaika aiyuhan- \nNabiyyu wa Rah-matul-iahi wa Barakatuhu, As-Salamu 'Alaina wa 'ala 'Ibadillahi assalihin, for if he \nsays so, then it will be for all the pious slave of Allah in the Heavens and the Earth. (Then he should \nsay), 'Ash-hadu an la ilaha illalllahu wa ash-hadu anna Muhammadan `Abduhu wa rasulu-hu,' and \nthen he can choose whatever speech (i.e. invocation) he wishes \" (See Hadith No. 797, Vol. 1).","reference":"Sahih al-Bukhari 6230, Book 79, Hadith 4","grade":"","question #":"question #3","question":"What is the importance of acknowledging Allah as As-Salam in the context of prayer?","id":"bukhari-79-158"},{"hadith-eng":"The Prophet (ﷺ) said, \"The young should greet the old, the passer by should greet the sitting one, and the \nsmall group of persons should greet the large group of persons. \"","reference":"Sahih al-Bukhari 6231, Book 79, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of initiating greetings in different social situations?","id":"bukhari-79-159"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The riding one should greet the walking one, and the walking one should greet \nthe sitting one, and the small number of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6232, Book 79, Hadith 6","grade":"","question #":"question #3","question":"What is the significance of initiating greetings in different social situations according to Islamic tradition?","id":"bukhari-79-160"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The riding person should greet the walking one,\n     and the walking one should greet the sitting one, and the small number\n     of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6233, Book 79, Hadith 7","grade":"","question #":"question #3","question":"What is the significance of greeting a larger group of people when you are in a smaller group?","id":"bukhari-79-161"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The younger person should greet the older one, \n     and the walking person should greet the sitting one, and the small \n     number of persons should greet the large number of persons.\"","reference":"Sahih al-Bukhari 6234, Book 79, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of greeting in different social situations according to Islamic tradition?","id":"bukhari-79-162"},{"hadith-eng":"Allah's Messenger (ﷺ) ordered us to do seven (things): to visit the sick, to\n     follow the funeral processions, to say Tashmit to a sneezer, to help \n     the weak, to help the oppressed ones, to propagate As-Salam \n     (greeting), and to help others to fulfill their oaths (if it is not \n     sinful). He forbade us to drink from silver utensils, to wear gold \n     rings, to ride on silken saddles, to wear silk clothes, Dibaj (thick \n     silk cloth), Qassiy and Istabraq (two kinds of silk). (See \n     Hadith No. 539, Vol. 7)","reference":"Sahih al-Bukhari 6235, Book 79, Hadith 9","grade":"","question #":"question #3","question":"How does the practice of visiting the sick and following funeral processions contribute to community solidarity in Islam?","id":"bukhari-79-163"},{"hadith-eng":"A man asked the Prophet, \"What Islamic traits are the best?\" The \n     Prophet said, \"Feed the people, and greet those whom you know and \n     those whom you do not know.\"","reference":"Sahih al-Bukhari 6236, Book 79, Hadith 10","grade":"","question #":"question #3","question":"What is the significance of feeding people in Islamic teachings?","id":"bukhari-79-164"},{"hadith-eng":"The Prophet (ﷺ) said, \"It is not lawful for a Muslim to desert (not to speak to) his brother Muslim for more \nthan three days while meeting, one turns his face to one side and the other turns his face to the other \nside. Lo! The better of the two is the one who starts greeting the other.\"","reference":"Sahih al-Bukhari 6237, Book 79, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of initiating greetings in Islam when there is a conflict between two Muslims?","id":"bukhari-79-165"},{"hadith-eng":"that he was a boy of ten at the time when the Prophet (ﷺ) emigrated to Medina. He added: I served Allah's \nApostle for ten years (the last part of his life time) and I know more than the people about the \noccasion whereupon the order of Al-Hijab was revealed (to the Prophet). Ubai b n Ka`b used to ask \nme about it. It was revealed (for the first time) during the marriage of Allah's Messenger (ﷺ) with Zainab bint \nJahsh. In the morning, the Prophet (ﷺ) was a bride-groom of her and he Invited the people, who took their \nmeals and went away, but a group of them remained with Allah's Messenger (ﷺ) and they prolonged their \nstay. Allah's Messenger (ﷺ) got up and went out, and I too, went out along with him till he came to the lintel \nof `Aisha's dwelling place. Allah's Messenger (ﷺ) thought that those people had left by then, so he returned, \nand I too, returned with him till he entered upon Zainab and found that they were still sitting there and \nhad not yet gone. The Prophet (ﷺ) went out again, and so did I with him till he reached the lintel of \n`Aisha's dwelling place, and then he thought that those people must have left by then, so he returned, \nand so did I with him, and found those people had gone. At that time the Divine Verse of Al-Hijab \nwas revealed, and the Prophet (ﷺ) set a screen between me and him (his family).","reference":"Sahih al-Bukhari 6238, Book 79, Hadith 12","grade":"","question #":"question #3","question":"What role did Anas bin Malik play in the events surrounding the revelation of the verse of Al-Hijab?","id":"bukhari-79-166"},{"hadith-eng":"When the Prophet (ﷺ) married Zainab, the people came and were offered a meal, and then they sat down \n(after finishing their meals) and started chatting. The Prophet (ﷺ) showed as if he wanted to get up, but \nthey did not get up. When he noticed that, he got up, and some of the people also got up and went \naway, while some others kept on sitting. When the Prophet (ﷺ) returned to enter, he found the people still \nsitting, but then they got up and left. So I told the Prophet (ﷺ) of their departure and he came and went in. \nI intended to go in but the Prophet (ﷺ) put a screen between me and him, for Allah revealed:-- 'O you who \nbelieve! Enter not the Prophet's houses..' (33.53)","reference":"Sahih al-Bukhari 6239, Book 79, Hadith 13","grade":"","question #":"question #3","question":"What is the significance of the Quranic verse revealed in relation to the Prophet's household and guest etiquette?","id":"bukhari-79-167"},{"hadith-eng":"(the wife of the Prophet) `Umar bin Al-Khattab used to say to Allah's Messenger (ﷺ) \"Let your wives be \nveiled\" But he did not do so. The wives of the Prophet (ﷺ) used to go out to answer the call of nature at \nnight only at Al-Manasi.' Once Sauda, the daughter of Zam`a went out and she was a tall woman. \n`Umar bin Al-Khattab saw her while he was in a gathering, and said, \"I have recognized you, O \nSauda!\" He (`Umar) said so as he was anxious for some Divine orders regarding the veil (the veiling \nof women.) So Allah revealed the Verse of veiling. (Al-Hijab; a complete body cover excluding the \neyes). (See Hadith No. 148, Vol. 1)","reference":"Sahih al-Bukhari 6240, Book 79, Hadith 14","grade":"","question #":"question #3","question":"What significance does the verse of veiling hold in Islamic teachings about modesty and privacy?","id":"bukhari-79-168"},{"hadith-eng":"A man peeped through a round hole into the dwelling place of the Prophet, while the Prophet (ﷺ) had a \nMidray (an iron comb) with which he was scratching his head. the Prophet (ﷺ) said, \" Had known you \nwere looking (through the hole), I would have pierced your eye with it (i.e., the comb).\" Verily! The \norder of taking permission to enter has been enjoined because of that sight, (that one should not look \nunlawfully at the state of others). (See Hadith No. 807, Vol. 7)","reference":"Sahih al-Bukhari 6241, Book 79, Hadith 15","grade":"","question #":"question #3","question":"What are the consequences of invading someone's privacy according to Islamic teachings?","id":"bukhari-79-169"},{"hadith-eng":"A man peeped into a room of the Prophet. The Prophet (ﷺ) stood up, holding an arrow head. It is as if I \nam just looking at him, trying to stab the man.","reference":"Sahih al-Bukhari 6242, Book 79, Hadith 16","grade":"","question #":"question #3","question":"What measures are permissible in Islam to protect one's privacy from intruders?","id":"bukhari-79-170"},{"hadith-eng":"I have not seen a thing resembling 'lamam' (minor sins) than what Abu Huraira 'narrated from the \nProphet who said \"Allah has written for Adam's son his share of adultery which he commits \ninevitably. The adultery of the eyes is the sight (to gaze at a forbidden thing), the adultery of the \ntongue is the talk, and the inner self wishes and desires and the private parts testify all this or deny it.\"","reference":"Sahih al-Bukhari 6243, Book 79, Hadith 17","grade":"","question #":"question #3","question":"What role do the eyes, tongue, and inner self play in committing sins according to Islamic teachings?","id":"bukhari-79-171"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) greeted somebody, he used to greet him three times, and if he spoke a \nsentence, he used to repeat it thrice.","reference":"Sahih al-Bukhari 6244, Book 79, Hadith 18","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) communication style from his practice of repeating greetings and statements?","id":"bukhari-79-172"},{"hadith-eng":"While I was present in one of the gatherings of the Ansar, Abu Musa came as if he was scared, and \nsaid, \"I asked permission to enter upon `Umar three times, but I was not given the permission, so I \nreturned.\" (When `Umar came to know about it) he said to Abu Musa, \"Why did you not enter?'. Abu \nMusa replied, \"I asked permission three times, and I was not given it, so I returned, for Allah's Messenger (ﷺ) \nsaid, \"If anyone of you asks the permission to enter thrice, and the permission is not given, then he \nshould return.' \" `Umar said, \"By Allah! We will ask Abu Musa to bring witnesses for it.\" (Abu Musa \nwent to a gathering of the Ansar and said). \"Did anyone of you hear this from the Prophet (ﷺ) ?\" Ubai bin \nKa`b said, \"By Allah, none will go with you but the youngest of the people (as a witness).\" (Abu \nSa`id) was the youngest of them, so I went with Abu Musa and informed `Umar that the Prophet (ﷺ) had \nsaid so. (See Hadith No. 277, Vol. 3)","reference":"Sahih al-Bukhari 6245, Book 79, Hadith 19","grade":"","question #":"question #3","question":"What is the importance of providing witnesses when quoting a saying of the Prophet in a dispute?","id":"bukhari-79-173"},{"hadith-eng":"I entered (the house) along with Allah's Messenger (ﷺ) . There he found milk in a basin. He said, \"O Abu \nHirr! Go and call the people of Suffa to me.\" I went to them and invited them. They came and asked \npermission to enter, and when it was given, they entered. (See Hadith No. 459 for details)","reference":"Sahih al-Bukhari 6246, Book 79, Hadith 20","grade":"","question #":"question #3","question":"What can be learned about the relationship between the Prophet (ﷺ) and the people of Suffa from this event?","id":"bukhari-79-174"},{"hadith-eng":"that he passed by a group of boys and greeted them and said, \"The Prophet (ﷺ) used to do so.\"","reference":"Sahih al-Bukhari 6247, Book 79, Hadith 21","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) behavior towards young people in terms of social conduct?","id":"bukhari-79-175"},{"hadith-eng":"Sahl said, \"We used to feel happy on Fridays.\" I asked Sahl, \"Why?\" He said, \"There was an old \nwoman of our acquaintance who used to send somebody to Buda'a (Ibn Maslama said, \"Buda'a was a \ngarden of date-palms at Medina). She used to pull out the silq (a kind of vegetable) from its roots and \nput it in a cooking pot, adding some powdered barley over it (and cook it). After finishing the Jumua \n(Friday) prayer we used to (pass by her and) greet her, whereupon she would present us with that \nmeal, so we used to feel happy because of that. We used to have neither a midday nap, nor meals, \nexcept after the Friday prayer.\" (See Hadith No. 60, Vol.2)","reference":"Sahih al-Bukhari 6248, Book 79, Hadith 22","grade":"","question #":"question #3","question":"What role did communal meals play in fostering happiness and social bonds among early Muslims?","id":"bukhari-79-176"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O `Aisha! This is Gabriel sending his greetings to you.\" I said, \"Peace, and \nAllah's Mercy be on him (Gabriel). You see what we do not see.\" (She was addressing Allah's \nApostle).","reference":"Sahih al-Bukhari 6249, Book 79, Hadith 23","grade":"","question #":"question #3","question":"What does the interaction between Aisha and the Prophet reveal about the unseen world in Islam?","id":"bukhari-79-177"},{"hadith-eng":"I came to the Prophet (ﷺ) in order to consult him regarding my father's debt. When I knocked on the door, \nhe asked, \"Who is that?\" I replied, \"I\" He said, \"I, I?\" He repeated it as if he disliked it.","reference":"Sahih al-Bukhari 6250, Book 79, Hadith 24","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) attitude towards vague or unclear responses?","id":"bukhari-79-178"},{"hadith-eng":"A man entered the mosque while Allah's Messenger (ﷺ) was sitting in one side of the mosque. The man \nprayed, came, and greeted the Prophet. Allah's Messenger (ﷺ) said to him, \"Wa 'Alaikas Salam (returned his \ngreeting). Go back and pray as you have not prayed (properly).\" The man returned, repeated his \nprayer, came back and greeted the Prophet. The Prophet (ﷺ) said, \"Wa alaika-s-Salam (returned his \ngreeting). Go back and pray again as you have not prayed (properly).\" The man said at the second or \nthird time, \"O Allah's Messenger (ﷺ)! Kindly teach me how to pray\". The Prophet (ﷺ) said, \"When you stand for \nprayer, perform ablution properly and then face the Qibla and say Takbir (Allahu-Akbar), and then \nrecite what you know from the Qur'an, and then bow with calmness till you feel at ease then rise from \nbowing, till you stand straight, and then prostrate calmly (and remain in prostration) till you feel at \nease, and then raise (your head) and sit with calmness till you feel at ease and then prostrate with \ncalmness (and remain in prostration) till you feel at ease, and then raise (your head) and sit with \ncalmness till you feel at ease in the sitting position, and do likewise in whole of your prayer.\" And \nAbu Usama added, \"Till you stand straight.\" (See Hadith No. 759, Vol.1)","reference":"Sahih al-Bukhari 6251, Book 79, Hadith 25","grade":"","question #":"question #3","question":"How does one ensure that their prayer is performed correctly according to Islamic teachings?","id":"bukhari-79-179"},{"hadith-eng":"The Prophet (ﷺ) said (in the above narration No. 268), \"And then raise your head till you feel at ease \nwhile sitting. \"","reference":"Sahih al-Bukhari 6252, Book 79, Hadith 26","grade":"","question #":"question #3","question":"Why is it important to raise one's head and feel at ease during the prayer ritual?","id":"bukhari-79-180"},{"hadith-eng":"That the Prophet (ﷺ) said to her, \"Gabriel sends Salam (greetings) to you.\" She replied, \"Wa 'alaihi-s- \nSalam Wa Rahmatu-l-lah.\" (Peace and Allah's Mercy be on him).","reference":"Sahih al-Bukhari 6253, Book 79, Hadith 27","grade":"","question #":"question #3","question":"What is the appropriate response when someone sends greetings of peace in Islamic tradition?","id":"bukhari-79-181"},{"hadith-eng":"Usama bin Zaid said, \"The Prophet (ﷺ) rode over a donkey with a saddle underneath which there was a \nthick soft Fadakiya velvet sheet. Usama bin Zaid was his companion rider, and he was going to pay a \nvisit to Sa`d bin Ubada (who was sick) at the dwelling place of Bani Al-Harith bin Al-Khazraj, and \nthis incident happened before the battle of Badr. The Prophet (ﷺ) passed by a gathering in which there \nwere Muslims and pagan idolators and Jews, and among them there was `Abdullah bin Ubai bin Salul, \nand there was `Abdullah bin Rawaha too. When a cloud of dust raised by the animal covered that \ngathering, `Abdullah bin Ubai covered his nose with his Rida (sheet) and said (to the Prophet), \"Don't \ncover us with dust.\" The Prophet (ﷺ) greeted them and then stopped, dismounted and invited them to \nAllah (i.e., to embrace Islam) and also recited to them the Holy Qur'an. `Abdullah bin Ubai' bin Salul \nsaid, \"O man! There is nothing better than what you say, if what you say is the truth. So do not trouble \nus in our gatherings. Go back to your mount (or house,) and if anyone of us comes to you, tell (your \ntales) to him.\" On that `Abdullah bin Rawaha said, \"(O Allah's Messenger (ﷺ)!) Come to us and bring it(what \nyou want to say) in our gatherings, for we love that.\" So the Muslims, the pagans and the Jews started \nquarreling till they were about to fight and clash with one another. The Prophet (ﷺ) kept on quietening \nthem (till they all became quiet). He then rode his animal, and proceeded till he entered upon Sa`d bin \n'Ubada, he said, \"O Sa`d, didn't you hear what Abu Habbab said? (He meant `Abdullah bin Ubai). He \nsaid so-and-so.\" Sa`d bin 'Ubada said, \"O Allah's Messenger (ﷺ)! Excuse and forgive him, for by Allah, \nAllah has given you what He has given you. The people of this town decided to crown him (as their \nchief) and make him their king. But when Allah prevented that with the Truth which He had given \nyou, it choked him, and that was what made him behave in the way you saw him behaving.\" So the \nProphet excused him.","reference":"Sahih al-Bukhari 6254, Book 79, Hadith 28","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) demonstrate forgiveness and understanding towards those who opposed him?","id":"bukhari-79-182"},{"hadith-eng":"I heard Ka`b bin Malik narrating (when he did not join the battle of Tabuk): Allah's Messenger (ﷺ) forbade \nall the Muslims to speak to us. I would come to Allah's Messenger (ﷺ) and greet him, and I would wonder \nwhether the Prophet (ﷺ) did move his lips to return to my greetings or not till fifty nights passed away. \nThe Prophet (ﷺ) then announced (to the people) Allah's forgiveness for us (acceptance of our repentance) \nat the time when he had offered the Fajr (morning) prayer.","reference":"Sahih al-Bukhari 6255, Book 79, Hadith 29","grade":"","question #":"question #3","question":"What role does the timing of prayers play in the announcement of significant events in Islamic tradition?","id":"bukhari-79-183"},{"hadith-eng":"A group of Jews came to Allah's Messenger (ﷺ) and said, \"As-samu 'Alaika \" (Death be on you), and I \nunderstood it and said to them, \"Alaikum AsSamu wa-l-la'na (Death and curse be on you).\" Allah's \nApostle said, \"Be calm! O `Aisha, for Allah loves that one should be kind and lenient in all matters.\" I \nsaid. \"O Allah's Messenger (ﷺ)! Haven't you heard what they have said?\" Allah's Messenger (ﷺ) said, \"I have \n(already) said (to them), 'Alaikum (upon you).' \"","reference":"Sahih al-Bukhari 6256, Book 79, Hadith 30","grade":"","question #":"question #3","question":"What lessons can be learned about handling insults or negative remarks from others in a manner that aligns with Islamic teachings?","id":"bukhari-79-184"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When the Jews greet you, they usually say, 'As-Samu 'alaikum (Death be on \nyou),' so you should say (in reply to them), 'Wa'alaikum (And on you).","reference":"Sahih al-Bukhari 6257, Book 79, Hadith 31","grade":"","question #":"question #3","question":"How does this teaching reflect the Prophet's guidance on dealing with hostility or ill intentions?","id":"bukhari-79-185"},{"hadith-eng":"the Prophet (ﷺ) said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum \n(And on you).' \"","reference":"Sahih al-Bukhari 6258, Book 79, Hadith 32","grade":"","question #":"question #3","question":"How does Islamic teaching guide interactions with people of other faiths?","id":"bukhari-79-186"},{"hadith-eng":"Allah's Messenger (ﷺ) sent me, Az-Zubair bin Al-Awwam and Abu Marthad Al-Ghanawi, and all of us were \nhorsemen, and he said, \"Proceed till you reach Rawdat Khakh, where there is a woman from the \npagans carrying a letter sent by Hatib bin Abi Balta'a to the pagans (of Mecca).\" So we overtook her \nwhile she was proceeding on her camel at the same place as Allah's Messenger (ﷺ) told us. We said (to her) \n\"Where is the letter which is with you?\" She said, \"I have no letter with me.\" So we made her camel \nkneel down and searched her mount (baggage etc) but could not find anything. My two companions \nsaid, \"We do not see any letter.\" I said, \"I know that Allah's Messenger (ﷺ) did not tell a lie. By Allah, if you \n(the lady) do not bring out the letter, I will strip you of your clothes' When she noticed that I was \nserious, she put her hand into the knot of her waist sheet, for she was tying a sheet round herself, and \nbrought out the letter. So we proceeded to Allah's Messenger (ﷺ) with the letter. The Prophet (ﷺ) said (to Habib), \n\"What made you o what you have done, O Hatib?\" Hatib replied, \"I have done nothing except that I \nbelieve in Allah and His Apostle, and I have not changed or altered (my religion). But I wanted to do \nthe favor to the people (pagans of Mecca) through which Allah might protect my family and my \nproperty, as there is none among your companions but has someone in Mecca through whom Allah \nprotects his property (against harm). The Prophet (ﷺ) said, \"Habib has told you the truth, so do not say to \nhim (anything) but good.\" `Umar bin Al-Khattab said, \"Verily he has betrayed Allah, His Apostle, and \nthe believers! Allow me to chop his neck off!\" The Prophet (ﷺ) said, \"O `Umar! What do you know; \nperhaps Allah looked upon the Badr warriors and said, 'Do whatever you like, for I have ordained that \nyou will be in Paradise.'\" On that `Umar wept and said, \"Allah and His Apostle know best.\"","reference":"Sahih al-Bukhari 6259, Book 79, Hadith 33","grade":"","question #":"question #3","question":"What was the significance of the Prophet's (ﷺ) response to Hatib's actions and how did it reflect his understanding of human nature?","id":"bukhari-79-187"},{"hadith-eng":"that Heraclius had sent for him to come along with a group of the Quraish who were trading in Sha'm, \nand they came to him. Then Abu Sufyan mentioned the whole narration and said, \"Heraclius asked for \nthe letter of Allah's Messenger (ﷺ) . When the letter was read, its contents were as follows: 'In the name of \nAllah, the Beneficent, the Merciful. From Muhammad, Allah's slave and His Apostle to Heraclius, the \nChief of Byzantines: Peace be upon him who follows the right path (guidance)! Amma ba'du (to \nproceed )...' (See Hadith No 6, Vol 1 for details)","reference":"Sahih al-Bukhari 6260, Book 79, Hadith 34","grade":"","question #":"question #3","question":"What role did Abu Sufyan play in the interaction between Heraclius and the Prophet's message?","id":"bukhari-79-188"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned a person from Bani Israel who took a piece of wood, made a hole in it, and put therein one thousand Dinar and letter from him to his friend. The Prophet (ﷺ) said, \"(That man) cut a piece of wood and put the money inside it and wrote a letter from such and such a person to such and such a person.\"","reference":"Sahih al-Bukhari 6261, Book 79, Hadith 35","grade":"","question #":"question #3","question":"What role does creativity and resourcefulness play in ensuring the safety and delivery of entrusted items?","id":"bukhari-79-189"},{"hadith-eng":"The people of (the tribe of) Quraiza agreed upon to accept the verdict of Sa`d. The Prophet (ﷺ) sent for \nhim (Sa`d) and he came. The Prophet (ﷺ) said (to those people), \"Get up for your chief or the best among \nyou!\" Sa`d sat beside the Prophet (ﷺ) and the Prophet (ﷺ) said (to him), \"These people have agreed to accept \nyour verdict.\" Sa`d said, \"So I give my judgment that their warriors should be killed and their women \nand children should be taken as captives.\" The Prophet (ﷺ) said, \"You have judged according to the King's \n(Allah's) judgment.\" (See Hadith No. 447, Vol. 5)","reference":"Sahih al-Bukhari 6262, Book 79, Hadith 36","grade":"","question #":"question #3","question":"What role does divine guidance play in the judgments made by leaders in Islamic history?","id":"bukhari-79-190"},{"hadith-eng":"I asked Anas, \"Was it a custom of the companions of the Prophet (ﷺ) to shake hands with one another?\" \nHe said, \"Yes.\"","reference":"Sahih al-Bukhari 6263, Book 79, Hadith 37","grade":"","question #":"question #3","question":"What significance does shaking hands hold in Islamic tradition among the companions of the Prophet?","id":"bukhari-79-191"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) and he was holding the hand of `Umar bin Al-Khattab.","reference":"Sahih al-Bukhari 6264, Book 79, Hadith 38","grade":"","question #":"question #3","question":"What can be learned from the interactions between the Prophet Muhammad (ﷺ) and his companions?","id":"bukhari-79-192"},{"hadith-eng":"Allah's Messenger (ﷺ) taught me the Tashah-hud as he taught me a Sura from the Qur'an, while my hand was \nbetween his hands. (Tashah-hud was) all the best compliments and the prayers and the good things are \nfor Allah. Peace and Allah's Mercy and Blessings be on you, O Prophet! Peace be on us and on the \npious slaves of Allah, I testify that none has the right to be worshipped but Allah, and I also testify \nthat Muhammad is Allah's slave and His Apostle. (We used to recite this in the prayer) during the \nlifetime of the Prophet (ﷺ) , but when he had died, we used to say, \"Peace be on the Prophet.\"","reference":"Sahih al-Bukhari 6265, Book 79, Hadith 39","grade":"","question #":"question #3","question":"What is the significance of the Tashah-hud in Islamic prayer?","id":"bukhari-79-193"},{"hadith-eng":"`Ali bin Abu Talib came out of the house of the Prophet (ﷺ) during his fatal ailment. The people asked \n(`Ali), \"O Abu Hasan! How is the health of Allah's Messenger (ﷺ) this morning?\" `Ali said, \"This morning \nhe is better, with the grace of Allah.\" Al-`Abbas held `Ali by the hand and said, \"Don't you see him \n(about to die)? By Allah, within three days you will be the slave of the stick (i.e., under the command \nof another ruler). By Allah, I think that Allah's Messenger (ﷺ) will die from his present ailment, for I know \nthe signs of death on the faces of the offspring of `Abdul Muttalib. So let us go to Allah's Messenger (ﷺ) to \nask him who will take over the Caliphate. If the authority is given to us, we will know it, and if it is \ngiven to somebody else we will request him to recommend us to him. \" `Ali said, \"By Allah! If we ask \nAllah's Messenger (ﷺ) for the rulership and he refuses, then the people will never give it to us. Besides, I will \nnever ask Allah's Messenger (ﷺ) for it.\" (See Hadith No 728, Vol 5)","reference":"Sahih al-Bukhari 6266, Book 79, Hadith 40","grade":"","question #":"question #3","question":"What does this narration reveal about the attitudes towards leadership and succession among the companions of the Prophet?","id":"bukhari-79-194"},{"hadith-eng":"While I was a companion rider with the Prophet (ﷺ) he said, \"O Mu`adh!\" I replied, \"Labbaik wa \nSa`daik.\" He repeated this call three times and then said, \"Do you know what Allah's Right on His \nslaves is?\" I replied, \"No.\" He said, Allah's Right on His slaves is that they should worship Him \n(Alone) and should not join partners in worship with Him.\" He said, \"O Mu`adh!\" I replied, \"Labbaik \nwa Sa`daik.\" He said, \"Do you know what the right of (Allah's) salves on Allah is, if they do that \n(worship Him Alone and join none in His worship)? It is that He will not punish them.\"\n\n(another chain through Mu'adh)","reference":"Sahih al-Bukhari 6267, Book 79, Hadith 41","grade":"","question #":"question #3","question":"How does the concept of divine rights and responsibilities manifest in the relationship between Allah and His slaves?","id":"bukhari-79-195"},{"hadith-eng":"While I was walking with the Prophet (ﷺ) at the Hurra of Medina in the evening, the mountain of Uhud \nappeared before us. The Prophet (ﷺ) said, \"O Abu Dhar! I would not like to have gold equal to Uhud \n(mountain) for me, unless nothing of it, not even a single Dinar remains of it with me, for more than \none day or three days, except that single Dinar which I will keep for repaying debts. I will spend all of \nit (the whole amount) among Allah's slaves like this and like this and like this.\" The Prophet (ﷺ) pointed \nout with his hand to illustrate it and then said, \"O Abu Dhar!\" I replied, \"Labbaik wa Sa`daik, O \nAllah's Messenger (ﷺ)!\" He said, \"Those who have much wealth (in this world) will be the least rewarded (in \nthe Hereafter) except those who do like this and like this (i.e., spend their money in charity).\" Then he \nordered me, \"Remain at your place and do not leave it, O Abu Dhar, till I come back.\" He went away \ntill he disappeared from me. Then I heard a voice and feared that something might have happened to \nAllah's Messenger (ﷺ), and I intended to go (to find out) but I remembered the statement of Allah's Messenger (ﷺ) \nthat I should not leave, my place, so I kept on waiting (and after a while the Prophet (ﷺ) came), and I said \nto him, \"O Allah's Messenger (ﷺ), I heard a voice and I was afraid that something might have happened to \nyou, but then I remembered your statement and stayed (there). The Prophet (ﷺ) said, \"That was Gabriel \nwho came to me and informed me that whoever among my followers died without joining others in \nworship with Allah, would enter Paradise.\" I said, \"O Allah's Messenger (ﷺ)! Even if he had committed \nillegal sexual intercourse and theft?\" He said, \"Even if he had committed illegal sexual intercourse and \ntheft.\"","reference":"Sahih al-Bukhari 6268, Book 79, Hadith 42","grade":"","question #":"question #3","question":"What is the role of obedience to the Prophet's instructions in the life of a Muslim, as demonstrated by Abu Dhar's experience?","id":"bukhari-79-196"},{"hadith-eng":"The Prophet (ﷺ) said, \"A man should not make another man get up from his (the latter's) seat (in a \ngathering) in order to sit there.","reference":"Sahih al-Bukhari 6269, Book 79, Hadith 43","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding personal space and respect in communal settings?","id":"bukhari-79-197"},{"hadith-eng":"The Prophet (ﷺ) forbade that a man should be made to get up from his seat so that another might sit on it, \nbut one should make room and spread out. Ibn `Umar disliked that a man should get up from his seat \nand then somebody else sit at his place.","reference":"Sahih al-Bukhari 6270, Book 79, Hadith 44","grade":"","question #":"question #3","question":"What are the implications of disliking someone taking another person's seat in Islamic teachings?","id":"bukhari-79-198"},{"hadith-eng":"When Allah's Messenger (ﷺ) married Zainab bint Jahsh, he invited the people who took their meals and then \nremained sitting and talking. The Prophet (ﷺ) pretended to be ready to get up, but the people did not get \nup. When he noticed that, he got up, and when he had got up, some of those people got up along with \nhim and there remained three (who kept on sitting). Then the Prophet (ﷺ) came back and found those \npeople still sitting. Later on those people got up and went away. So I went to the Prophet (ﷺ) and \ninformed him that they had left. \nThe Prophet (ﷺ) came, and entered (his house). I wanted to enter(along with him) but he dropped a curtain \nbetween me and him. Allah then revealed: 'O you who believe! Do not enter the Prophet's Houses \nuntil leave is given... (to His statement)... Verily! That shall be an enormity, in Allah's sight.' (33.53)","reference":"Sahih al-Bukhari 6271, Book 79, Hadith 45","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's behavior regarding hospitality and social gatherings?","id":"bukhari-79-199"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) in the courtyard of the Ka`ba in the Ihtiba.' posture putting his hand round his \nlegs like this.","reference":"Sahih al-Bukhari 6272, Book 79, Hadith 46","grade":"","question #":"question #3","question":"What can be learned from the Prophet's behavior in sacred places like the Ka'ba?","id":"bukhari-79-200"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Shall I inform you of the biggest of the great sins?\" They said, \"Yes, O Allah's \nApostle!\" He said, \"To join partners in worship with Allah, and to be undutiful to one's parents. \"","reference":"Sahih al-Bukhari 6273, Book 79, Hadith 47","grade":"","question #":"question #3","question":"How is being undutiful to one's parents viewed in Islamic teachings?","id":"bukhari-79-201"},{"hadith-eng":"as above (No. 290) adding: The Prophet (ﷺ) was reclining (leaning) and then he sat up saying, \"And I \nwarn you against giving a false statement.\" And he kept on saying that warning so much so that we \nsaid, \"Would that he had stopped.\"","reference":"Sahih al-Bukhari 6274, Book 79, Hadith 48","grade":"","question #":"question #3","question":"What impact did the Prophet's repeated warning have on his listeners?","id":"bukhari-79-202"},{"hadith-eng":"Once the Prophet (ﷺ) offered the `Asr prayer and then he walked quickly and entered his house.","reference":"Sahih al-Bukhari 6275, Book 79, Hadith 49","grade":"","question #":"question #3","question":"How does the Prophet's (ﷺ) behavior after prayer reflect on his personal or family life?","id":"bukhari-79-203"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer his prayer (while standing) in the midst of the bed, and I used to lie in \nfront of him between him and the Qibla It I had any necessity for getting up and I used to dislike to get \nup and face him (while he was in prayer), but I would gradually slip away from the bed.","reference":"Sahih al-Bukhari 6276, Book 79, Hadith 50","grade":"","question #":"question #3","question":"What can be inferred about the spatial arrangement and etiquette in the Prophet's household during prayer times?","id":"bukhari-79-204"},{"hadith-eng":"The news of my fasting was mentioned to the Prophet (ﷺ) . So he entered upon me and I put for him a \nleather cushion stuffed with palm-fibres. The Prophet (ﷺ) sat on the floor and the cushion was between me \nand him. He said to me, \"Isn't it sufficient for you (that you fast) three days a month?\" I said, \"O \nAllah's Messenger (ﷺ)! (I can fast more than this).\" He said, \"You may fast) five days a month.\" I said, \"O \nAllah's Messenger (ﷺ)! (I can fast more than this).\" He said, \"(You may fast) seven days.\" I said, \"O Allah's \nApostle!\" He said, \"Nine.\" I said, \"O Allah's Messenger (ﷺ)!\" He said, \"Eleven.\" I said, \"O Allah's Messenger (ﷺ)!\" \nHe said, \"No fasting is superior to the fasting of (the Prophet (ﷺ) David) which was one half of a year, and \nhe used, to fast on alternate days. (See Hadith No. 300, Vol 3)","reference":"Sahih al-Bukhari 6277, Book 79, Hadith 51","grade":"","question #":"question #3","question":"What is the significance of the fasting practice of Prophet David in Islamic tradition?","id":"bukhari-79-205"},{"hadith-eng":"'Alaqama went to Sham and came to the mosque and offered a two-rak`at prayer, and invoked Allah: \n\"O Allah! Bless me with a (pious) good companion.\" So he sat beside Abu Ad-Darda' who asked, \n\"From where are you?\" He said, \"From the people of Kufa.\" Abu Darda' said, \"Wasn't there among \nyou the person who keeps the secrets (of the Prophet (ﷺ) ) which nobody knew except him (i.e., Hudhaifa \n(bin Al-Yaman)). And isn't there among you the person whom Allah gave refuge from Satan through \nthe request (tongue) of Allah's Messenger (ﷺ)? (i.e., `Ammar). Isn't there among you the one who used to \ncarry the Siwak and the cushion (or pillows (of the Prophets)? (i.e., Ibn Mas`ud). How did Ibn Mas`ud \nuse to recite 'By the night as it conceals (the light)?\" (Sura 92). 'Alqama said, \"Wadhdhakari Wal \nUntha' (And by male and female.\") Abu Ad-Darda added. 'These people continued to argue with me \nregarding it till they were about to cause me to have doubts although I heard it from Allah's Messenger (ﷺ).\"","reference":"Sahih al-Bukhari 6278, Book 79, Hadith 52","grade":"","question #":"question #3","question":"What challenges might arise when there are differing recitations or interpretations of Quranic verses?","id":"bukhari-79-206"},{"hadith-eng":"We used to have a midday nap and take our meals after the Jumua (prayer).","reference":"Sahih al-Bukhari 6279, Book 79, Hadith 53","grade":"","question #":"question #3","question":"What is the significance of taking a midday nap in Islamic tradition?","id":"bukhari-79-207"},{"hadith-eng":"There was no name dearer to `Ali than his nickname Abu Turab (the father of dust). He used to feel \nhappy whenever he was called by this name. Once Allah's Messenger (ﷺ) came to the house of Fatima but \ndid not find `Ali in the house. So he asked \"Where is your cousin?\" She replied, \"There was \nsomething (a quarrel) between me and him whereupon he got angry with me and went out without \nhaving a midday nap in my house.\" Allah's Messenger (ﷺ) asked a person to look for him. That person came, \nand said, \"O Allah's Messenger (ﷺ)! He (Ali) is sleeping in the mosque.\" So Allah's Messenger (ﷺ) went there and \nfound him lying. His upper body cover had fallen off to one side of his body, and so he was covered \nwith dust. Allah's Messenger (ﷺ) started cleaning the dust from him, saying, \"Get up, O Abu Turab! Get up, \nAbu Turab!\" (See Hadith No. 432, Vol 1)","reference":"Sahih al-Bukhari 6280, Book 79, Hadith 54","grade":"","question #":"question #3","question":"What does this incident reveal about the relationship between the Prophet Muhammad (ﷺ) and Ali?","id":"bukhari-79-208"},{"hadith-eng":"Anas said, \"Um Sulaim used to spread a leather sheet for the Prophet (ﷺ) and he used to take a midday \nnap on that leather sheet at her home.\" Anas added, \"When the Prophet (ﷺ) had slept, she would take \nsome of his sweat and hair and collect it (the sweat) in a bottle and then mix it with Suk (a kind of \nperfume) while he was still sleeping. \"When the death of Anas bin Malik approached, he advised that \nsome of that Suk be mixed with his Hanut (perfume for embalming the dead body), and it was mixed \nwith his Hanut.","reference":"Sahih al-Bukhari 6281, Book 79, Hadith 55","grade":"","question #":"question #3","question":"What practices were followed by the companions of the Prophet (ﷺ) in preparing for their own death?","id":"bukhari-79-209"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to Quba, he used to visit Um Haram bint Milhan who would offer him \nmeals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered \nhim a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, \n'What makes you laugh, O Allah's Messenger (ﷺ)?' He said, 'Some people of my followers were displayed \nbefore me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, \n'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's \nApostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his \nhead and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Messenger (ﷺ)?' \nHe said, 'Some people of my followers were displayed before me as warriors fighting for Allah's \nCause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um \nHaram) said, 'O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.' He said, You will \nbe amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and \non coming out of the sea, she fell down from her riding animal and died.","reference":"Sahih al-Bukhari 6282, 6283, Book 79, Hadith 56","grade":"","question #":"question #3","question":"What can be learned about the role of women in early Islamic history from the story of Um Haram?","id":"bukhari-79-210"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to Quba, he used to visit Um Haram bint Milhan who would offer him \nmeals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered \nhim a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, \n'What makes you laugh, O Allah's Messenger (ﷺ)?' He said, 'Some people of my followers were displayed \nbefore me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, \n'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's \nApostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his \nhead and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Messenger (ﷺ)?' \nHe said, 'Some people of my followers were displayed before me as warriors fighting for Allah's \nCause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um \nHaram) said, 'O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.' He said, You will \nbe amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and \non coming out of the sea, she fell down from her riding animal and died.","reference":"Sahih al-Bukhari 6282, 6283, Book 79, Hadith 56","grade":"","question #":"question #3","question":"What role do women play in the early Islamic battles and expeditions according to historical narrations?","id":"bukhari-79-211"},{"hadith-eng":"The Prophet (ﷺ) forbade two kinds of dresses and two kinds of bargains; Ishtimal As-Samma and Al- \nIhtiba in one garment with no part of it covering one's private parts. (The two kinds of bargains were:) \nAl-Mulamasa and Al-Munabadha.","reference":"Sahih al-Bukhari 6284, Book 79, Hadith 57","grade":"","question #":"question #3","question":"Why is it important to cover one's private parts in Islamic dress code?","id":"bukhari-79-212"},{"hadith-eng":"Mother of the Believers: We, the wives of the Prophet (ﷺ) were all sitting with the Prophet (ﷺ) and none of us \nhad left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Messenger (ﷺ) \n.' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on \nhis right or his left, confided something to her, whereupon she wept bitterly. When he noticed her \nsorrow, he confided something else to her for the second time, and she started laughing. Only I from \namong the Prophet's wives said to her, \"(O Fatima), Allah's Messenger (ﷺ) selected you from among us for \nthe secret talk and still you weep?\" When Allah's Messenger (ﷺ) got up (and went away), I asked her, \"What \ndid he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Messenger (ﷺ)\" But when he died \nI asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the \nProphet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, \nsaying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an \nwith him once every year. \nHe added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has \napproached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the \nHereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet (ﷺ) saw me in \nthis sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased \nthat you will be chief of all the believing women (or chief of the women of this nation i.e. my \nfollowers?\")","reference":"Sahih al-Bukhari 6285, 6286, Book 79, Hadith 58","grade":"","question #":"question #3","question":"What role does confidentiality play in the interactions between the Prophet Muhammad (ﷺ) and his family?","id":"bukhari-79-213"},{"hadith-eng":"Mother of the Believers: We, the wives of the Prophet (ﷺ) were all sitting with the Prophet (ﷺ) and none of us \nhad left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Messenger (ﷺ) \n.' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on \nhis right or his left, confided something to her, whereupon she wept bitterly. When he noticed her \nsorrow, he confided something else to her for the second time, and she started laughing. Only I from \namong the Prophet's wives said to her, \"(O Fatima), Allah's Messenger (ﷺ) selected you from among us for \nthe secret talk and still you weep?\" When Allah's Messenger (ﷺ) got up (and went away), I asked her, \"What \ndid he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Messenger (ﷺ)\" But when he died \nI asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the \nProphet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, \nsaying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an \nwith him once every year. \nHe added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has \napproached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the \nHereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet (ﷺ) saw me in \nthis sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased \nthat you will be chief of all the believing women (or chief of the women of this nation i.e. my \nfollowers?\")","reference":"Sahih al-Bukhari 6285, 6286, Book 79, Hadith 58","grade":"","question #":"question #3","question":"What role does patience and fear of Allah play in dealing with the news of a loved one's approaching death in Islam?","id":"bukhari-79-214"},{"hadith-eng":"I saw Allah's Messenger (ﷺ) lying on his back in the mosque and putting one of his legs over the other.","reference":"Sahih al-Bukhari 6287, Book 79, Hadith 59","grade":"","question #":"question #3","question":"What does this narration suggest about the permissibility of certain postures in a mosque?","id":"bukhari-79-215"},{"hadith-eng":"the Prophet (ﷺ) said \"When three persons are together, then no two of them should hold secret counsel \nexcluding the third person.\"","reference":"Sahih al-Bukhari 6288, Book 79, Hadith 60","grade":"","question #":"question #3","question":"What ethical considerations should be taken into account when communicating in a group setting?","id":"bukhari-79-216"},{"hadith-eng":"The Prophet (ﷺ) confided to me a secret which I did not disclose to anybody after him. And Um Sulaim \nasked me (about that secret) but I did not tell her.","reference":"Sahih al-Bukhari 6289, Book 79, Hadith 61","grade":"","question #":"question #3","question":"What can be learned about the relationship between the Prophet and his companions from the act of confiding secrets?","id":"bukhari-79-217"},{"hadith-eng":"The Prophet (ﷺ) said, \"When you are three persons sitting together, then no two of you should hold secret \ncounsel excluding the third person until you are with some other people too, for that would grieve \nhim.\"","reference":"Sahih al-Bukhari 6290, Book 79, Hadith 62","grade":"","question #":"question #3","question":"How can secretive communication among a few individuals affect the feelings of others in a group?","id":"bukhari-79-218"},{"hadith-eng":"One day the Prophet (ﷺ) divided and distributed something amongst the people whereupon an Ansari man \nsaid, \"In this division Allah's Countenance has not been sought.\" I said, \"By Allah! I will go (and \ninform) the Prophet.\" So I went to him while he was with a group of people, and I secretly informed \nhim of that, whereupon he became so angry that his face became red, and he then said, \"May Allah \nbestow His Mercy on Moses (for) he was hurt more than that, yet he remained patient.\"","reference":"Sahih al-Bukhari 6291, Book 79, Hadith 63","grade":"","question #":"question #3","question":"How does the example of Prophet Moses serve as a reminder of patience in the face of adversity?","id":"bukhari-79-219"},{"hadith-eng":"The Iqama for the prayer was announced while a man was talking to Allah's Messenger (ﷺ) privately. He \ncontinued talking in that way till the Prophet's companions slept, and afterwards the Prophet (ﷺ) got up \nand offered the prayer with them.","reference":"Sahih al-Bukhari 6292, Book 79, Hadith 64","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's priorities when it comes to personal interactions and communal obligations?","id":"bukhari-79-220"},{"hadith-eng":"The Prophet (ﷺ) said, \"Do not keep the fire burning in your houses when you go to bed.\"","reference":"Sahih al-Bukhari 6293, Book 79, Hadith 65","grade":"","question #":"question #3","question":"How does this guidance reflect the Prophet's concern for the safety and well-being of his followers?","id":"bukhari-79-221"},{"hadith-eng":"One night a house in Medina was burnt with its occupants. The Prophet (ﷺ) spoke about them, saying, \n\"This fire is indeed your enemy, so whenever you go to bed, put it out to protect yourselves.\"","reference":"Sahih al-Bukhari 6294, Book 79, Hadith 66","grade":"","question #":"question #3","question":"What advice did the Prophet Muhammad (ﷺ) give concerning fire safety before sleeping?","id":"bukhari-79-222"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(At bedtime) cover the utensils, close the doors, and put out the lights, lest the \nevil creature (the rat) should pull away the wick and thus burn the people of the house.\"","reference":"Sahih al-Bukhari 6295, Book 79, Hadith 67","grade":"","question #":"question #3","question":"What is the significance of extinguishing lights before sleeping in Islamic tradition?","id":"bukhari-79-223"},{"hadith-eng":"Allah s Apostle said, \"When you intend going to bed at night, put out the lights, close the doors, tie \nthe mouths of the water skins, and cover your food and drinks.\" Hamrnam said, \"I think he (the other \nnarrator) added, 'even with piece of wood across the utensil.'","reference":"Sahih al-Bukhari 6296, Book 79, Hadith 68","grade":"","question #":"question #3","question":"What are the recommended actions regarding household safety in Islamic tradition?","id":"bukhari-79-224"},{"hadith-eng":"The Prophet (ﷺ) said \"Five things are in accordance with Al Fitra (i.e. the tradition of prophets): to be \ncircumcised, to shave the pelvic region, to pull out the hair of the armpits, to cut short the moustaches, \nand to clip the nails.'","reference":"Sahih al-Bukhari 6297, Book 79, Hadith 69","grade":"","question #":"question #3","question":"How do personal grooming habits relate to religious practices in Islam?","id":"bukhari-79-225"},{"hadith-eng":"Allah's Messenger (ﷺ) said \"The Prophet) Abraham circumcised himself after \n     he had passed the age of eighty years and he circumcised himself with \n     an adze.\"","reference":"Sahih al-Bukhari 6298, Book 79, Hadith 70","grade":"","question #":"question #3","question":"What significance does the act of circumcision hold in the life of Prophet Abraham?","id":"bukhari-79-226"},{"hadith-eng":"Ibn 'Abbas was asked, \"How old were you when\n     the Prophet (ﷺ) died?\" He replied. \"At that time I had been circumcised.\" \n     At that time, people did not circumcise the boys till they attained \n     the age of puberty. Sa'id bin Jubair said, \"Ibn 'Abbas said, 'When the\n     Prophet died, I had already been circumcised. \"","reference":"Sahih al-Bukhari 6299, Book 79, Hadith 71","grade":"","question #":"question #3","question":"What can be inferred about Ibn 'Abbas's age at the time of the Prophet's death based on his circumcision status?","id":"bukhari-79-227"},{"hadith-eng":"Sa'id ibn Jubair said, \"Ibn 'Abbas said, 'When the Prophet (ﷺ) died, I had already been circumcised.' \"","reference":"Sahih al-Bukhari 6300, Book 79, Hadith 72","grade":"","question #":"question #3","question":"What can be inferred about the cultural or religious practices related to circumcision during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-79-228"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever among you takes an oath wherein he says, 'By Al-Lat and Al-`Uzza,' \nnames of two Idols worshipped by the Pagans, he should say, 'None has the right to be worshipped but \nAllah; And whoever says to his friend, 'Come, let me gamble with you ! He should give something in \ncharity. \" (See Hadith No. 645)","reference":"Sahih al-Bukhari 6301, Book 79, Hadith 73","grade":"","question #":"question #3","question":"How does Islam view the act of swearing by idols and what is the corrective measure?","id":"bukhari-79-229"},{"hadith-eng":"During the life-time of the Prophet (ﷺ) I built a house with my own hands so that it might protect me from \nthe rain and shade me from the sun; and none of Allah's creatures assisted me in building it.","reference":"Sahih al-Bukhari 6302, Book 79, Hadith 74","grade":"","question #":"question #3","question":"What lessons can be learned about the value of hard work and individual initiative from this account?","id":"bukhari-79-230"},{"hadith-eng":"Ibn `Umar said, \"By Allah, I have not put a brick over a brick (i.e. constructed a building) or planted \nany date-palm tree since the death of the Prophet.\" Sufyan (the sub narrator) said, \"I told this narration \n(of Ibn `Umar) to one of his (Ibn `Umar's) relatives, and he said, 'By Allah, he did build (something.' \n\"Sufyan added, \"I said, 'He must have said (the above narration) before he built.\"","reference":"Sahih al-Bukhari 6303, Book 79, Hadith 75","grade":"","question #":"question #3","question":"What might be the reasons for a person to refrain from certain activities after the passing of a significant figure in their life?","id":"bukhari-79-231"}]