[{"hadith-eng":"Allah's Messenger (ﷺ) said, \"For every prophet there is one (special \n     invocation (that will not be rejected) with which he appeals (to \n     Allah), and I want to keep such an invocation for interceding for my \n     followers in the Hereafter.\"","reference":"Sahih al-Bukhari 6304, Book 80, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of a special invocation granted to each prophet?","id":"bukhari-80-1"},{"hadith-eng":"that the Prophet (ﷺ) said, \"For every prophet there is an invocation that \n     surely will be responded by Allah,\" (or said), \"For every prophet \n     there was an invocation with which he appealed to Allah, and his \n     invocation was accepted (in his lifetime), but I kept my (this \n     special) invocation to intercede for my followers on the Day of \n     Resurrection.\"","reference":"Sahih al-Bukhari 6305, Book 80, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of a prophet's special invocation in Islam?","id":"bukhari-80-2"},{"hadith-eng":"The Prophet (ﷺ) said \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta \nRabbi la ilaha illa anta, Khalaqtani wa ana `Abduka, wa ana `ala `ahdika wa wa`dika mastata`tu, \nA`udhu bika min Sharri ma sana`tu, abu'u Laka bini`matika `alaiya, wa abu'u laka bidhanbi faghfir lee \nfa innahu la yaghfiru adhdhunuba illa anta.\" The Prophet (ﷺ) added. \"If somebody recites it during the day \nwith firm faith in it, and dies on the same day before the evening, he will be from the people of \nParadise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will \nbe from the people of Paradise.\"","reference":"Sahih al-Bukhari 6306, Book 80, Hadith 3","grade":"","question #":"question #1","question":"What is considered the most superior way of seeking forgiveness from Allah?","id":"bukhari-80-3"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying.\" By Allah! I ask for forgiveness from Allah and turn to Him in \nrepentance more than seventy times a day.\"","reference":"Sahih al-Bukhari 6307, Book 80, Hadith 4","grade":"","question #":"question #1","question":"How frequently did the Prophet Muhammad (ﷺ) seek forgiveness and repentance from Allah?","id":"bukhari-80-4"},{"hadith-eng":"`Abdullah bin Mas`ud related to us two narrations: One from the Prophet (ﷺ) and the other from himself, \nsaying: A believer sees his sins as if he were sitting under a mountain which, he is afraid, may fall on \nhim; whereas the wicked person considers his sins as flies passing over his nose and he just drives \nthem away like this.\" Abu Shihab (the sub-narrator) moved his hand over his nose in illustration. (Ibn \nMas`ud added): Allah's Messenger (ﷺ) said, \"Allah is more pleased with the repentance of His slave than a \nman who encamps at a place where his life is jeopardized, but he has his riding beast carrying his food \nand water. He then rests his head and sleeps for a short while and wakes to find his riding beast gone. \n(He starts looking for it) and suffers from severe heat and thirst or what Allah wished (him to suffer \nfrom). He then says, 'I will go back to my place.' He returns and sleeps again, and then (getting up), he \nraises his head to find his riding beast standing beside him.\"","reference":"Sahih al-Bukhari 6308, Book 80, Hadith 5","grade":"","question #":"question #1","question":"How does a believer perceive their sins compared to a wicked person?","id":"bukhari-80-5"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah is more pleased with the repentance of His slave than anyone of you is \npleased with finding his camel which he had lost in the desert. \"","reference":"Sahih al-Bukhari 6309, Book 80, Hadith 6","grade":"","question #":"question #1","question":"How does the concept of repentance bring joy to Allah according to Islamic teachings?","id":"bukhari-80-6"},{"hadith-eng":"The Prophet (ﷺ) used to pray eleven rak`at in the late part of the night, and when dawn appeared, he \nwould offer two rak`at and then lie on his right side till the Muadhdhin came to inform him (that the \nmorning prayer was due).","reference":"Sahih al-Bukhari 6310, Book 80, Hadith 7","grade":"","question #":"question #1","question":"What was the Prophet's (ﷺ) routine for night prayers and how many rak`at did he perform?","id":"bukhari-80-7"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"When you want to go to bed, perform ablution as you do for prayer, then \r\nlie down on your right side and say: 'Allahumma aslamtu wajhi ilaika, wa fawwadtu 'amri ilaika wa \r\nalja'tu dhahri ilaika, raghbatan wa rahbatan ilaika, la malja'a wa la manja minka illa ilaika. Amantu \r\nbikitabik al-ladhi anzalta wa binabiyyika al-ladhi arsalta'. If you should die then (after reciting this) you \r\nwill die on the religion of Islam (i.e., as a Muslim); so let these words be the last you say (before \r\ngoing to bed)\" While I was memorizing it, I said, \"Wa birasulika al-ladhi arsalta (in Your Apostle \r\nwhom You have sent).' The Prophet (ﷺ) said, \"No, but say: Wa binabiyyika al-ladhi arsalta (in Your \r\nProphet whom You have sent).","reference":"Sahih al-Bukhari 6311, Book 80, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of performing ablution before going to bed in Islam?","id":"bukhari-80-8"},{"hadith-eng":"When the Prophet (ﷺ) went to bed, he would say: \"Bismika amutu wa ahya.\" and when he got up he \nwould say:\" Al-hamdu li l-lahil-ladhi ahyana ba'da ma amatana wa ilaihin-nushur.\"","reference":"Sahih al-Bukhari 6312, Book 80, Hadith 9","grade":"","question #":"question #1","question":"What are the recommended supplications to say before sleeping and upon waking up?","id":"bukhari-80-9"},{"hadith-eng":"That the Prophet (ﷺ) advised a man, saying, \"If you intend to lie down (i.e. go to bed), say, 'Allahumma \naslamtu nafsi ilaika wa fauwadtu `Amri ilaika, wa wajjahtu wajhi ilaika wa alja'tu zahri ilaika, \nreghbatan wa rahbatan ilaika. La malja'a wa la manja minka illa ilaika. Amantu bikitabikal-ladhi \nanzalta; wa nabiyyikalladhi arsalta.' And if you should die then (after reciting this before going to bed) \nyou will die on the religion of Islam\"","reference":"Sahih al-Bukhari 6313, Book 80, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of reciting specific supplications before going to sleep in Islam?","id":"bukhari-80-10"},{"hadith-eng":"When the Prophet (ﷺ) went to bed at night, he would put his hand under his cheek and then say, \n\"Allahumma bismika amutu wa ahya,\" and when he got up, he would say, \"Al-Hamdu lil-lahi al-ladhi \nahyana ba'da ma amatana, wa ilaihi an-nushur.\"","reference":"Sahih al-Bukhari 6314, Book 80, Hadith 11","grade":"","question #":"question #1","question":"What supplication did the Prophet (ﷺ) recite before sleeping and upon waking up?","id":"bukhari-80-11"},{"hadith-eng":"When Allah's Messenger (ﷺ) went to bed, he used to sleep on his right side and then say, \"All-ahumma \naslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu zahri ilaika, \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Amantu bikitabika al-ladhi \nanzalta wa nabiyyika al-ladhi arsalta! Allah's Messenger (ﷺ) said, \"Whoever recites these words (before \ngoing to bed) and dies the same night, he will die on the Islamic religion (as a Muslim).","reference":"Sahih al-Bukhari 6315, Book 80, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of reciting specific supplications before going to sleep in Islam?","id":"bukhari-80-12"},{"hadith-eng":"One night I slept at the house of Maimuna. The Prophet (ﷺ) woke up, answered the call of nature, washed \nhis face and hands, and then slept. He got up (late at night), went to a water skin, opened the mouth \nthereof and performed ablution not using much water, yet he washed all the parts properly and then \noffered the prayer. I got up and straightened my back in order that the Prophet (ﷺ) might not feel that I \nwas watching him, and then I performed the ablution, and when he got up to offer the prayer, I stood on \nhis left. He caught hold of my ear and brought me over to his right side. He offered thirteen rak`at in \nall and then lay down and slept till he started blowing out his breath as he used to do when he slept. In \nthe meantime Bilal informed the Prophet (ﷺ) of the approaching time for the (Fajr) prayer, and the \nProphet offered the Fajr (Morning) prayer without performing new ablution. He used to say in his \ninvocation, Allahumma ij`al fi qalbi nuran wa fi basari nuran, wa fi sam`i nuran, wa`an yamini nuran, \nwa`an yasari nuran, wa fawqi nuran, wa tahti nuran, wa amami nuran, wa khalfi nuran, waj`al li \nnuran.\" Kuraib (a sub narrator) said, \"I have forgotten seven other words, (which the Prophet (ﷺ) \nmentioned in this invocation). I met a man from the offspring of Al-`Abbas and he narrated those \nseven things to me, mentioning, '(Let there be light in) my nerves, my flesh, my blood, my hair and \nmy body,' and he also mentioned two other things.\"","reference":"Sahih al-Bukhari 6316, Book 80, Hadith 13","grade":"","question #":"question #1","question":"What practices did the Prophet Muhammad (ﷺ) follow during his night prayers?","id":"bukhari-80-13"},{"hadith-eng":"When the Prophet (ﷺ) got up at night to offer the night prayer, he used to say: \"Allahumma laka l-hamdu; \nAnta nuras-samawati wal ardi wa man fihinna. wa laka l-hamdu; Anta qaiyim as-samawati wal ardi \nwa man flhinna. Wa lakaI-hamdu; Anta-l-,haqqun, wa wa'daka haqqun, wa qauluka haqqun, wa \nliqauka haqqun, wal-jannatu haqqun, wannaru haqqun, was-sa atu haqqun, wan-nabiyyuna huqqun, \nMahammadun haqqun, Allahumma laka aslamtu, wa Alaika tawakkaltu, wa bika amantu, wa ilaika \nanabtu, wa bika Khasamtu, wa ilaika hakamtu, faghfirli ma qaddamtu wa ma akh-khartu, wa ma \nasrartu, wa ma a'lantu. Anta al-muqaddimu, wa anta al-mu-'akhkhiru. La ilaha il-la anta (or La ilaha \nghairuka)\"","reference":"Sahih al-Bukhari 6317, Book 80, Hadith 14","grade":"","question #":"question #1","question":"What are some of the attributes of Allah mentioned in the supplication recited by the Prophet during the night prayer?","id":"bukhari-80-14"},{"hadith-eng":"Fatima complained about the blisters on her hand because of using a mill-stone. She went to ask the \nProphet for servant, but she did not find him (at home) and had to inform `Aisha of her need. When he \ncame, `Aisha informed him about it. `Ali added: The Prophet (ﷺ) came to us when we had gone to our \nbeds. When I was going to get up, he said, \"'Stay in your places,\" and sat between us, till I felt the \ncoolness of the feet on my chest. The Prophet (ﷺ) then said, \"Shall I not tell you of a thing which is better \nfor you than a servant? When you (both) go to your beds, say 'Allahu Akbar' thirty-three times, and \n'Subhan Allah' thirty-three times, 'Al hamdu 'illah' thirty-three times, for that is better for you than a \nservant.\" Ibn Seereen said, \"Subhan Allah' (is to be said for) thirty-four times.\"","reference":"Sahih al-Bukhari 6318, Book 80, Hadith 15","grade":"","question #":"question #1","question":"What alternative did the Prophet Muhammad (ﷺ) suggest instead of acquiring a servant for household help?","id":"bukhari-80-15"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to bed, he used to blow on his hands while reciting the Mu'auwidhat ( \ni.e. Suratal-Falaq 113 and Surat-an-Nas 114) and then pass his hands over his body.","reference":"Sahih al-Bukhari 6319, Book 80, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of reciting Surah Al-Falaq and Surah An-Nas before sleeping?","id":"bukhari-80-16"},{"hadith-eng":"The Prophet (ﷺ) said, \"When anyone of you go to bed, he should shake out his bed with the inside of his \nwaist sheet, for he does not know what has come on to it after him, and then he should say: 'Bismika \nRabbi Wada`tu Janbi wa bika arfa'uhu, In amsakta nafsi farhamha wa in arsaltaha fahfazha bima \ntahfazu bihi ibadakas-salihin.\"","reference":"Sahih al-Bukhari 6320, Book 80, Hadith 17","grade":"","question #":"question #1","question":"What precautionary measure is recommended before going to bed according to Islamic teachings?","id":"bukhari-80-17"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When it is the last third of the night, our Lord, the Blessed, the Superior, \ndescends every night to the heaven of the world and says, 'Is there anyone who invokes Me (demand \nanything from Me), that I may respond to his invocation; Is there anyone who asks Me for something \nthat I may give (it to) him; Is there anyone who asks My forgiveness that I may forgive him?' \"","reference":"Sahih al-Bukhari 6321, Book 80, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of the last third of the night in Islamic worship and supplication?","id":"bukhari-80-18"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to the lavatory, he used to say: \"Allahumma inni a`udhu bika min al-khubuthi wal khaba'ith.\"","reference":"Sahih al-Bukhari 6322, Book 80, Hadith 19","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) recite before entering the lavatory?","id":"bukhari-80-19"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta \nRabbi la ilaha illa anta. Khalaqtani wa ana `Abduka, wa ana 'ala 'ahdika wa Wa'dika mastata'tu abu'u \nLaka bi ni 'matika wa abu'u Laka bidhanbi; faghfirli fa'innahu la yaghfiru-dh-dhunuba ill a ant a. \nA'uidhu bika min sharri ma sana'tu.' If somebody recites this invocation during the night, and if he \nshould die then, he will go to Paradise (or he will be from the people of Paradise). And if he recites it \nin the morning, and if he should die on the same day, he will have the same fate.\"","reference":"Sahih al-Bukhari 6323, Book 80, Hadith 20","grade":"","question #":"question #1","question":"What is considered the most superior way of seeking forgiveness from Allah?","id":"bukhari-80-20"},{"hadith-eng":"Whenever the Prophet (ﷺ) intended to go to bed, he would recite: \"Bismika Allahumma amutu wa ahya \n(With Your name, O Allah, I die and I live).\" And when he woke up from his sleep, he would say: \n\"Al-hamdu lil-lahil-ladhi ahyana ba'da ma amatana; wa ilaihi an-nushur (All the Praises are for Allah \nWho has made us alive after He made us die (sleep) and unto Him is the Resurrection). \"","reference":"Sahih al-Bukhari 6324, Book 80, Hadith 21","grade":"","question #":"question #1","question":"What supplications did the Prophet Muhammad (ﷺ) recite before sleeping and upon waking up?","id":"bukhari-80-21"},{"hadith-eng":"Whenever the Prophet (ﷺ) lay on his bed, he used to say: \"Allahumma bismika amutu wa ahya,\" and when \nhe woke up he would say: \"Al-hamdu lil-lahilladhi ahyana ba'da ma an atana, wa ilaihi an-nushur.\"","reference":"Sahih al-Bukhari 6325, Book 80, Hadith 22","grade":"","question #":"question #1","question":"What supplication did the Prophet (ﷺ) recite before sleeping?","id":"bukhari-80-22"},{"hadith-eng":"Abu Bakr As-Siddiq said to the Prophet, \"Teach me an invocation with which I may invoke (Allah) in \nmy prayer.\" The Prophet (ﷺ) said, \"Say: Allahumma inni zalamtu nafsi zulman kathiran wala yaghfirudhdhunuba \nilla anta, Faghfirli maghfiratan min indika war-hamni, innaka antalGhafur-Rahim.\"","reference":"Sahih al-Bukhari 6326, Book 80, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of seeking specific invocations for prayer in Islam?","id":"bukhari-80-23"},{"hadith-eng":"The Verse: 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) was revealed as regards \ninvocation.","reference":"Sahih al-Bukhari 6327, Book 80, Hadith 24","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the volume of one's voice during prayer?","id":"bukhari-80-24"},{"hadith-eng":"We used to say in the prayer: 'AsSalam be on Allah, As-Salam be on so-and so.' So one day the \nProphet said to us, \"Allah Himself is As-Salam; when anyone of you sits during his prayer, he should \nsay: 'at-tah, iyyatu-li l-lahi,' up to 'As-Salihin,' (All the compliments are for Allah ...righteous people) \nfor when he recites this, then he says his Salam to all the righteous people present in the heavens and \non the earth. Then he should say, 'I testify that none has the right to be worshipped except Allah, and \nthat Muhammad is His slave and His Apostle,' and then he can select whatever he likes to celebrate \n(Allah's) Praises.\"","reference":"Sahih al-Bukhari 6328, Book 80, Hadith 25","grade":"","question #":"question #1","question":"What is the significance of addressing Allah as 'As-Salam' during prayer?","id":"bukhari-80-25"},{"hadith-eng":"The people said, \"O Allah's Messenger (ﷺ)! The rich people have got the highest degrees of prestige and the \npermanent pleasures (in this life and the life to come in the Hereafter).\" He said, \"How is that?\" They \nsaid, \"The rich pray as we pray, and strive in Allah's Cause as we do, and spend from their surplus \nwealth in charity, while we have no wealth (to spend likewise).\" He said, \"Shall I not tell you a thing, \nby doing which, you will catch up with those who are ahead of you and supersede those who will \ncome after you; and nobody will be able to do such a good deed as you do except the one who does \nthe same (deed as you do). That deed is to recite 'Subhan Allah ten times, and 'Al-Hamduli l-lah ten \ntimes, and 'AllahuAkbar' ten times after every prayer.\"","reference":"Sahih al-Bukhari 6329, Book 80, Hadith 26","grade":"","question #":"question #1","question":"What are some ways to attain spiritual rewards and prestige without wealth?","id":"bukhari-80-26"},{"hadith-eng":"(the freed slave of Al-Mughira bin Shu`ba) Al-Mughira wrote to Muawiya bin Abu Sufyan that \nAllah's Messenger (ﷺ) used to say at the end of every prayer after the Taslim, \"La ilaha illa-l-lahu wahdahu la \nsharika lahu; lahu-l-mulk wa lahu-l-hamd, wahuwa 'ala kulli shai'n qadir. Allahumma la mani'a Lima \na taita, wa la mu'ta Lima mana'ta, wa la yanfa'u dhal-jaddu minkal-jadd.","reference":"Sahih al-Bukhari 6330, Book 80, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of reciting specific phrases after completing the prayer?","id":"bukhari-80-27"},{"hadith-eng":"We went out with the Prophet (ﷺ) to Khaibar. A man among the people said, \"O 'Amir! Will you please \nrecite to us some of your poetic verses?\" So 'Amir got down and started chanting among them, saying, \n\"By Allah! Had it not been for Allah, we would not have been guided.\" 'Amir also said other poetic \nverses which I do not remember. Allah's Messenger (ﷺ) said, \"Who is this (camel) driver?\" The people said, \n\"He is 'Amir bin Al-Akwa`,\" He said, \"May Allah bestow His Mercy on him.\" A man from the People \nsaid, \"O Allah's Messenger (ﷺ)! Would that you let us enjoy his company longer.\" When the people \n(Muslims) lined up, the battle started, and 'Amir was struck with his own sword (by chance) by \nhimself and died. In the evening, the people made a large number of fires (for cooking meals). Allah's \nApostle said, \"What is this fire? What are you making the fire for?\" They said, \"For cooking the meat \nof donkeys.\" He said, \"Throw away what is in the pots and break the pots!\" A man said, \"O Allah's \nProphet! May we throw away what is in them and wash them?\" He said, \"Never mind, you may do \nso.\" (See Hadith No. 509, Vol. 5).","reference":"Sahih al-Bukhari 6331, Book 80, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of poetry and chanting in Islamic tradition during expeditions?","id":"bukhari-80-28"},{"hadith-eng":"Whenever a man brought his alms to the Prophet, the Prophet (ﷺ) would say, \"O Allah! Bestow Your \nBlessing upon the family of so-and-so.\" When my father came to him (with his alms), he said, \"O \nAllah! Bestow Your Blessings upon the family of Abi `Aufa.\"","reference":"Sahih al-Bukhari 6332, Book 80, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of giving alms in Islam and how is it rewarded?","id":"bukhari-80-29"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me. \"Will you relieve me from Dhi-al-Khalasa? \" Dhi-al-Khalasa was an idol \nwhich the people used to worship and it was called Al-Ka`ba al Yamaniyya. I said, \"O Allah's Messenger (ﷺ) \nI am a man who can't sit firm on horses.\" So he stroked my chest (with his hand) and said, \"O Allah! \nMake him firm and make him a guiding and well-guided man.\" So I went out with fifty (men) from \nmy tribe of Ahrnas. (The sub-narrator, Sufyan, quoting Jarir, perhaps said, \"I went out with a group of \nmen from my nation.\") and came to Dhi-al-Khalasa and burnt it, and then came to the Prophet (ﷺ) and \nsaid, \"O Allah's Messenger (ﷺ)! I have not come to you till I left it like a camel with a skin disease.\" The \nProphet then invoked good upon Ahmas and their cavalry (fighters).","reference":"Sahih al-Bukhari 6333, Book 80, Hadith 30","grade":"","question #":"question #1","question":"What is the significance of destroying idols in the context of Islamic teachings?","id":"bukhari-80-30"},{"hadith-eng":"Um Sulaim said to the Prophet (ﷺ) \"Anas is your servant.\" The Prophet (ﷺ) said, \"O Allah! increase his \nwealth and offspring, and bless (for him) what ever you give him.\"","reference":"Sahih al-Bukhari 6334, Book 80, Hadith 31","grade":"","question #":"question #1","question":"What is the significance of making supplications for others in Islam?","id":"bukhari-80-31"},{"hadith-eng":"The Prophet (ﷺ) heard a man reciting (the Qur'an) in the mosque. He said,\" May Allah bestow His Mercy \non him, as he made me remember such and-such Verse which I had missed in such-and-such Sura.\"","reference":"Sahih al-Bukhari 6335, Book 80, Hadith 32","grade":"","question #":"question #1","question":"How can listening to others recite the Qur'an benefit one's own understanding and memory of the verses?","id":"bukhari-80-32"},{"hadith-eng":"The Prophet (ﷺ) divided something (among the Muslims) and distributed the shares (of the booty). A man \nsaid, \"This division has not been made to please Allah.\" When I informed the Prophet (ﷺ) about it, he \nbecame so furious that I noticed the signs of anger on his face and he then said, \"May Allah bestow \nHis Mercy on Moses, for he was hurt with more than this, yet he remained patient.\"","reference":"Sahih al-Bukhari 6336, Book 80, Hadith 33","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) react to criticism regarding the distribution of shares among Muslims?","id":"bukhari-80-33"},{"hadith-eng":"Ibn `Abbas said, \"Preach to the people once a week, and if you won't, then preach them twice, but if \nyou want to preach more, then let it be three times (a week only), and do not make the people fed-up \nwith this Qur'an. If you come to some people who are engaged in a talk, don't start interrupting their \ntalk by preaching, lest you should cause them to be bored. You should rather keep quiet, and if they \nask you, then preach to them at the time when they are eager to hear what you say. And avoid the use \nof rhymed prose in invocation for I noticed that Allah's Messenger (ﷺ) and his companions always avoided \nit.\"","reference":"Sahih al-Bukhari 6337, Book 80, Hadith 34","grade":"","question #":"question #1","question":"What is the recommended frequency for preaching to people to avoid causing them boredom?","id":"bukhari-80-34"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When anyone of you appeal to Allah for something, he should ask with \ndetermination and should not say, 'O Allah, if You wish, give me.', for nobody can force Allah to do \nsomething against His Will.","reference":"Sahih al-Bukhari 6338, Book 80, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of asking Allah with determination in supplications?","id":"bukhari-80-35"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"None of you should say: 'O Allah, forgive me if You wish; O Allah, be merciful \nto me if You wish,' but he should always appeal to Allah with determination, for nobody can force \nAllah to do something against His Will.\"","reference":"Sahih al-Bukhari 6339, Book 80, Hadith 36","grade":"","question #":"question #1","question":"Why is it important to make supplications to Allah with determination?","id":"bukhari-80-36"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The invocation of anyone of you is granted (by Allah) if he does not show \nimpatience (by saying, \"I invoked Allah but my request has not been granted.\")","reference":"Sahih al-Bukhari 6340, Book 80, Hadith 37","grade":"","question #":"question #1","question":"What is the significance of patience in the acceptance of supplications in Islam?","id":"bukhari-80-37"},{"hadith-eng":"Narrated Anas, \"The Prophet (ﷺ) raised his hands (in invocation) till I saw the whiteness of his armpits.\"","reference":"Sahih al-Bukhari 6341, Book 80, Hadith 38","grade":"","question #":"question #1","question":"What is the significance of raising hands during supplication in Islamic practice?","id":"bukhari-80-38"},{"hadith-eng":"While the Prophet (ﷺ) was delivering a sermon on a Friday, a man stood up and said, \"O Allah's Messenger (ﷺ)! \nInvoke Allah to bless us with rain.\" (The Prophet (ﷺ) invoked Allah for rain.) So, the sky became overcast \nand it started raining till one could hardly reach one's home. It kept on raining till the next Friday \nwhen the same man or another man got up and said (to the Prophet), \"Invoke Allah to withhold the \nrain from us, for we have been drowned (with heavy rain ).\" The Prophet (ﷺ) said, \"O Allah! Let it rain \naround us and not on us.\" Then the clouds started dispersing around Medina and rain ceased to fall on \nthe people of Medina.","reference":"Sahih al-Bukhari 6342, Book 80, Hadith 39","grade":"","question #":"question #1","question":"How does the Prophet Muhammad (ﷺ) demonstrate the power of supplication in response to community needs?","id":"bukhari-80-39"},{"hadith-eng":"Allah's Messenger (ﷺ) went out to this Musalla (praying place) to offer the prayer of Istisqa.' He invoked \nAllah for rain and then faced the Qibla and turned his Rida' (upper garment) inside out.","reference":"Sahih al-Bukhari 6343, Book 80, Hadith 40","grade":"","question #":"question #1","question":"What is the significance of facing the Qibla during the prayer for rain?","id":"bukhari-80-40"},{"hadith-eng":"My mother said, \"O Allah's Messenger (ﷺ)! Please invoke Allah on behalf of your servant.\" He said, \"O \nAllah! Increase his wealth and children, and bestow Your Blessing on whatever You give him.\" a time \nof distress.","reference":"Sahih al-Bukhari 6344, Book 80, Hadith 41","grade":"","question #":"question #1","question":"What is the significance of seeking blessings for someone in Islam?","id":"bukhari-80-41"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah at the time of distress, saying, \"La ilaha illal-lahu Al-`Azim, al- \nHalim, La ilaha illal-lahu Rabbu-s-samawati wal-ard wa Rabbu-l-arsh il-azim.\"","reference":"Sahih al-Bukhari 6345, Book 80, Hadith 42","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) recite during times of distress?","id":"bukhari-80-42"},{"hadith-eng":"Allah's Messenger (ﷺ) used to say at a time of distress, \"La ilaha illal-lahu Rabbul-l-'arsh il-'azim, La ilaha \nillallahu Rabbu-s-samawati wa Rabbu-l-ard, Rabbu-l-'arsh-il-Karim.\"","reference":"Sahih al-Bukhari 6346, Book 80, Hadith 43","grade":"","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) recite during times of distress?","id":"bukhari-80-43"},{"hadith-eng":"Allah's Messenger (ﷺ) used to seek refuge with Allah from the difficult moment of a calamity and from being \novertaken by destruction and from being destined to an evil end, and from the malicious joy of \nenemies. Sufyan said, \"This narration contained three items only, but I added one. I do not know \nwhich one that was.\"","reference":"Sahih al-Bukhari 6347, Book 80, Hadith 44","grade":"","question #":"question #1","question":"What are the specific things from which the Prophet Muhammad (ﷺ) sought refuge in his supplications?","id":"bukhari-80-44"},{"hadith-eng":"When Allah's Messenger (ﷺ) was healthy, he used to say, \"No prophet dies till he is shown his place in \nParadise, and then he is given the option (to live or die).\" So when death approached him(during his \nillness), and while his head was on my thigh, he became unconscious for a while, and when he \nrecovered, he fixed his eyes on the ceiling and said, \"O Allah! (Let me join) the Highest Companions \n(see Qur'an 4:69),\" I said, \"So, he does not choose us.\" Then I realized that it was the application of \nthe statement he used to relate to us when he was healthy. So that was his last utterance (before he \ndied), i.e. \"O Allah! (Let me join) the Highest Companions.\"","reference":"Sahih al-Bukhari 6348, Book 80, Hadith 45","grade":"","question #":"question #1","question":"What is the significance of a prophet being shown their place in Paradise before death?","id":"bukhari-80-45"},{"hadith-eng":"I came to Khabbab who had been branded with seven brands(1) and he said, \"Had Allah's Messenger (ﷺ) not \nforbidden us to invoke (Allah) for death, I would have invoked (Allah) for it.\"","reference":"Sahih al-Bukhari 6349, Book 80, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of patience and endurance in the face of suffering in Islam?","id":"bukhari-80-46"},{"hadith-eng":"I came to Khabbab who had been branded with seven brands over his `Abdomen, and I heard him \nsaying, \"If the Prophet: had not forbidden us to invoke (Allah) for death, I would have invoked Allah \nfor it.\"","reference":"Sahih al-Bukhari 6350, Book 80, Hadith 47","grade":"","question #":"question #1","question":"What is the significance of patience and endurance in the face of suffering in Islam?","id":"bukhari-80-47"},{"hadith-eng":"Allah's Messenger (ﷺ) said,\" None of you should long for death because of a calamity that had befallen him, \nand if he cannot, but long for death, then he should say, 'O Allah! Let me live as long as life is better \nfor me, and take my life if death is better for me.' \"","reference":"Sahih al-Bukhari 6351, Book 80, Hadith 48","grade":"","question #":"question #1","question":"What guidance does Islam provide for dealing with calamities and hardships in life?","id":"bukhari-80-48"},{"hadith-eng":"My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My sister's son is sick.\" So he \npassed his hand over my head and invoked for Allah's blessing upon me and then performed the \nablution. I drank from the water of his ablution and I stood behind him and looked at his Khatam (the \nseal of Prophethood) between his shoulders (and its size was) like the button of a tent.","reference":"Sahih al-Bukhari 6352, Book 80, Hadith 49","grade":"","question #":"question #1","question":"What significance does the seal of Prophethood hold in Islamic tradition?","id":"bukhari-80-49"},{"hadith-eng":"that his grandfather. `Abdullah bin Hisham used to take him from the market or to the market (the \nnarrator is in doubt) and used to buy grain and when Ibn Az-Zubair and Ibn `Umar met him, they \nwould say to him, \"Let us be your partners (in trading) as the Prophet (ﷺ) invoked for Allah's blessing \nupon you.\" He would then take them as partners and he would Sometimes gain a whole load carried \nby an animal which he would send home.","reference":"Sahih al-Bukhari 6353, Book 80, Hadith 50","grade":"","question #":"question #1","question":"What is the significance of seeking partnerships in trade according to Islamic teachings?","id":"bukhari-80-50"},{"hadith-eng":"On whose face Allah's Messenger (ﷺ) had thrown water from his mouth, the water having been taken from \ntheir well while he was still a young boy (who has not yet attained the age of puberty).","reference":"Sahih al-Bukhari 6354, Book 80, Hadith 51","grade":"","question #":"question #1","question":"What significance does the act of the Prophet (ﷺ) throwing water from his mouth hold in Islamic tradition?","id":"bukhari-80-51"},{"hadith-eng":"The boys used to be brought to the Prophet (ﷺ) and he used to invoke for Allah's blessing upon them. \nOnce an infant was brought to him and it urinated on his clothes. He asked for water and poured it \nover the place of the urine and did not wash his clothes.","reference":"Sahih al-Bukhari 6355, Book 80, Hadith 52","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle situations when infants urinated on his clothes?","id":"bukhari-80-52"},{"hadith-eng":"whose eye Allah's Messenger (ﷺ) had touched, that he had seen Sa`d bin Abi Waqqas offering one rak`a only \nfor the witr prayer.","reference":"Sahih al-Bukhari 6356, Book 80, Hadith 53","grade":"","question #":"question #1","question":"What is the significance of performing the witr prayer in Islam?","id":"bukhari-80-53"},{"hadith-eng":"Ka`b bin 'Ujra met me and said, \"Shall I give you a present? Once the Prophet (ﷺ) came to us and we said, \n'O Allah's Messenger (ﷺ) ! We know how to greet you; but how to send 'Salat' upon you? He said, 'Say: \nAllahumma Salli ala Muhammadin wa 'ala `Ali Muhammadin, kama sal-laita 'ala all Ibrahima innaka \nHamidun Majid. Allahumma barik 'ala Muhammadin wa 'ala all Muhammadin, kama barakta 'ala all \nIbrahima, innaka Hamidun Majid.\"","reference":"Sahih al-Bukhari 6357, Book 80, Hadith 54","grade":"","question #":"question #1","question":"What is the significance of sending Salat upon the Prophet Muhammad (ﷺ) in Islamic practice?","id":"bukhari-80-54"},{"hadith-eng":"We said, \"O Allah's Messenger (ﷺ) This is (i.e. we know) the greeting to you; will you tell us how to send \nSalat on you?\" He said, \"Say: 'Allahumma Salli 'ala Muhammadin `Abdika wa rasulika kama sal-laita \n'ala Ibrahima wa barik 'ala Muhammadin wa all Muhammadin kama barakta 'ala Ibrahima wa `Ali \nIbrahim.\"","reference":"Sahih al-Bukhari 6358, Book 80, Hadith 55","grade":"","question #":"question #1","question":"What is the significance of sending Salat on the Prophet Muhammad (ﷺ) in Islamic practice?","id":"bukhari-80-55"},{"hadith-eng":"Whenever somebody brought alms to the Prophet (ﷺ) the used to say, \"Allahumma Salli 'Alaihi (O Allah! \nSend Your Salat (Grace and Honor) on him).\" Once when my father brought his alms to him, he said, \n\"O Allah! Send Your Salat (Grace and Honor) on the family of Abi `Aufa.\"","reference":"Sahih al-Bukhari 6359, Book 80, Hadith 56","grade":"","question #":"question #1","question":"What is the significance of giving alms in Islam and how is it rewarded by the Prophet's supplication?","id":"bukhari-80-56"},{"hadith-eng":"The people said, \"O Allah's Messenger (ﷺ) ! How may we send Salat on you?\" He said, \"Say: Allahumma \nSalli 'ala- Muhammadin wa azwajihi wa dhurriyyatihi kama sal-laita 'ala `Ali Ibrahim; wa barik 'ala \nMuhammadin wa azwajihi wa dhurriyyatihi kamabarakta 'ala `Ali Ibrahim innaka hamidun majid.\"","reference":"Sahih al-Bukhari 6360, Book 80, Hadith 57","grade":"","question #":"question #1","question":"What is the significance of sending Salat on the Prophet Muhammad and his family in Islamic practice?","id":"bukhari-80-57"},{"hadith-eng":"that he heard the Prophet (ﷺ) saying, \"O Allah! If I should ever abuse a believer, please let that be a means \nof bringing him near to You on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 6361, Book 80, Hadith 58","grade":"","question #":"question #1","question":"What is the significance of seeking Allah's mercy for unintentional harm caused to others?","id":"bukhari-80-58"},{"hadith-eng":"Once the people started asking Allah's Messenger (ﷺ) questions, and they asked so many questions that he \nbecame angry and ascended the pulpit and said, \"I will answer whatever questions you may ask me \ntoday.\" I looked right and left and saw everyone covering his face with his garment and weeping. \nBehold ! There was a man who, on quarreling with the people, used to be called as a son of a person \nother than h is father. He said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your \nfather is Hudhaifa.\" And then `Umar got up and said, \"We accept Allah as our Lord, and Islam as \n(our) religion, and Muhammad as (our) Apostle; and we seek refuge with Allah from the afflictions.\" \nAllah's Messenger (ﷺ) said, \" I have never seen a day like today in its good and its evil for Paradise and the \nHell Fire were displayed in front of me, till I saw them just beyond this wall.\" Qatada, when relating \nthis Hadith, used to mention the following Verse:-- \n'O you who believe! Ask not questions about things which, If made plain to you, May cause you \ntrouble. (5.101)","reference":"Sahih al-Bukhari 6362, Book 80, Hadith 59","grade":"","question #":"question #1","question":"What are the consequences of asking too many questions in matters of faith according to Islamic teachings?","id":"bukhari-80-59"},{"hadith-eng":"The Prophet (ﷺ) said to Abu Talha, \"Choose one of your boys to serve me.\" So Abu Talha took me (to \nserve the Prophet (ﷺ) ) by giving me a ride behind him (on his camel). So I used to serve Allah's Messenger (ﷺ) \nwhenever he stayed somewhere. I used to hear him saying, \"O Allah! I seek refuge with you (Allah) \nfrom (worries) care and grief, from incapacity and laziness, from miserliness and cowardice, from \nbeing heavily in debt and from being overpowered by other men.\" I kept on serving him till he \nreturned from (the battle of) Khaibar. He then brought Safiya, the daughter of Huyay whom he had \ngot (from the booty). I saw him making a kind of cushion with a cloak or a garment for her. He then \nlet her ride behind him. When we reached a place called As-Sahba', he prepared (a special meal \ncalled) Hais, and asked me to invite the men who (came and) ate, and that was the marriage banquet \ngiven on the consummation of his marriage to her. Then he proceeded till the mountain of Uhud \nappeared, whereupon he said, \"This mountain loves us and we love it.\" When he approached Medina, \nhe said, \"O Allah! I make the land between its (i.e., Medina's) two mountains a sanctuary, as the \nprophet Abraham made Mecca a sanctuary. O Allah! Bless them (the people of Medina) in their Mudd \nand the Sa' (units of measuring).","reference":"Sahih al-Bukhari 6363, Book 80, Hadith 60","grade":"","question #":"question #1","question":"What are the supplications the Prophet Muhammad (ﷺ) used to seek refuge from various difficulties and challenges?","id":"bukhari-80-60"},{"hadith-eng":"I heard the Prophet (ﷺ) seeking refuge with Allah from the punishment of the grave.","reference":"Sahih al-Bukhari 6364, Book 80, Hadith 61","grade":"","question #":"question #1","question":"What is the significance of seeking refuge with Allah in Islamic teachings?","id":"bukhari-80-61"},{"hadith-eng":"Sa`d used to recommend five (statements) and mentioned that the Prophet (ﷺ) I used to recommend it. (It \nwas) \"O Allah! I seek refuge with You from miserliness; and seek refuge with You from cowardice; \nand seek refuge with You from being sent back to geriatric old age; and I seek refuge with You from \nthe affliction of this world (i.e., the affliction of Ad-Dajjal etc.); and seek refuge with You from the \npunishment of the grave.\"","reference":"Sahih al-Bukhari 6365, Book 80, Hadith 62","grade":"","question #":"question #1","question":"What are the specific things from which one should seek refuge in Allah according to the teachings of the Prophet?","id":"bukhari-80-62"},{"hadith-eng":"Two old ladies from among the Jewish ladies entered upon me and said' \"The dead are punished in \ntheir graves,\" but I thought they were telling a lie and did not believe them in the beginning. When \nthey went away and the Prophet (ﷺ) entered upon me, I said, \"O Allah's Messenger (ﷺ)! Two old ladies..\" and \ntold him the whole story. He said, \"They told the truth; the dead are really punished, to the extent that \nall the animals hear (the sound resulting from) their punishment.\" Since then I always saw him \nseeking refuge with Allah from the punishment of the grave in his prayers.","reference":"Sahih al-Bukhari 6366, Book 80, Hadith 63","grade":"","question #":"question #1","question":"What is the significance of seeking refuge from the punishment of the grave in Islamic prayers?","id":"bukhari-80-63"},{"hadith-eng":"Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from \ncowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I \nseek refuge with You from the afflictions of life and death.\"","reference":"Sahih al-Bukhari 6367, Book 80, Hadith 64","grade":"","question #":"question #1","question":"What are the specific things from which the Prophet sought refuge in his supplications?","id":"bukhari-80-64"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness and geriatric old age, from \nall kinds of sins and from being in debt; from the trial and affliction of the grave and from the punishment in the \ngrave; from the affliction of the Fire and from the punishment of the \nFire; and from the evil of the affliction of wealth; and I seek refuge with You from the affliction of \npoverty, and I seek refuge with You from the affliction of Al-Mesiah Ad-Dajjal. O Allah! Wash away \nmy sins with the water of snow and hail, and cleanse my heart from all the sins as a white garment is \ncleansed from the filth, and let there be a long distance between me and my sins, as You made East \nand West far from each other.\"","reference":"Sahih al-Bukhari 6368, Book 80, Hadith 65","grade":"","question #":"question #1","question":"What are the different types of afflictions and trials from which one should seek refuge in Allah?","id":"bukhari-80-65"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from worry and grief, from incapacity and \nlaziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by \n(other) men.\" (See Hadith No. 374)","reference":"Sahih al-Bukhari 6369, Book 80, Hadith 66","grade":"","question #":"question #1","question":"What are the specific things from which the Prophet (ﷺ) sought refuge in his supplications?","id":"bukhari-80-66"},{"hadith-eng":"Sa`d bin Abi Waqqas used to recommend these five (statements) and say that the Prophet (ﷺ) said so (and \nthey are): \"O Allah! I seek refuge with You from miserliness, and seek refuge with You from \ncowardice, and seek refuge with You from being brought back to geriatric old age, and seek refuge \nwith You from the afflictions of the world, and seek refuge with You from the punishment of the \ngrave.\"","reference":"Sahih al-Bukhari 6370, Book 80, Hadith 67","grade":"","question #":"question #1","question":"What are the specific things from which one should seek refuge according to the teachings of the Prophet (ﷺ)?","id":"bukhari-80-67"},{"hadith-eng":"Allah's Messenger (ﷺ) used to seek refuge with Allah saying, \"O Allah! I seek refuge with You from \nlaziness, and seek refuge with You from cowardice, and seek refuge with You from geriatric old age, \nand seek refuge with You from miserliness.\"","reference":"Sahih al-Bukhari 6371, Book 80, Hadith 68","grade":"","question #":"question #1","question":"What are the specific qualities from which the Prophet Muhammad (ﷺ) sought refuge in his supplications?","id":"bukhari-80-68"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Make us love Medina as You made us love Mecca, or more, and transfer \nthe fever that is in it, to Al-Juhfa. O Allah! Bless our Mudd and our Sam' (kinds of measures).","reference":"Sahih al-Bukhari 6372, Book 80, Hadith 69","grade":"","question #":"question #1","question":"What significance does the Prophet's prayer for Medina hold in terms of love and affection for a place?","id":"bukhari-80-69"},{"hadith-eng":"that his father said, \"In the year of Hajjatal-Wada`, the Prophet (ﷺ) paid me a visit while I was suffering \nfrom an ailment that had brought me to the verge of death. I said, 'O Allah's Messenger (ﷺ)! My sickness has \nreduced me to the (bad) state as you see, and I am a rich man, but have no heirs except one daughter. \nShall I give 2/3 of my property in charity?' He said, 'No.' I said, 'Then 1/2 of it?' He said, 'Even 1/3 is \ntoo much, for, to leave your inheritors wealthy is better than to leave them in poverty, begging from \npeople. And (know that) whatever you spend in Allah's Cause, you will get reward for it, even for the \nmorsel of food which you put in your wife's mouth.' I said, 'O Allah's Messenger (ﷺ)! Will I be left behind \nmy companions (in Mecca)?' He said, 'If you remain behind, whatever good deed you will do for \nAllah's Sake, will raise and upgrade you to a higher position (in Allah's Sight). May be you will live \nlonger so that some people may benefit by you, and some e others (pagans) may get harmed by you. O \nAllah! Complete the migration of my companions and do not turn them on their heels; But (we pity) \nthe poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca)\" Allah's Messenger (ﷺ) lamented \n(or pitied) for him as he died in Mecca. (See Hadith No. 693, Vol. 5)","reference":"Sahih al-Bukhari 6373, Book 80, Hadith 70","grade":"","question #":"question #1","question":"What is the significance of leaving wealth for one's heirs in Islam?","id":"bukhari-80-70"},{"hadith-eng":"Seek refuge with Allah by saying the words which the Prophet (ﷺ) used to say while seeking refuge with \nAllah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, \nand seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from \nthe afflictions of the world and from the punishment in the grave.\"","reference":"Sahih al-Bukhari 6374, Book 80, Hadith 71","grade":"","question #":"question #1","question":"What are the specific things from which one should seek refuge in Allah according to the teachings of the Prophet (ﷺ)?","id":"bukhari-80-71"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness from geriatric old age, from \nbeing in debt, and from committing sins. O Allah! I seek refuge with You from the punishment of the \nFire, the afflictions of the grave, the punishment in the grave, and the evil of the affliction of poverty \nand from the evil of the affliction caused by Al-Masih Ad-Dajjal. O Allah! Wash away my sins with \nthe water of snow and hail, and cleanse my heart from the sins as a white garment is cleansed of filth, \nand let there be a far away distance between me and my sins as You have set far away the East and the \nWest from each other.\"","reference":"Sahih al-Bukhari 6375, Book 80, Hadith 72","grade":"","question #":"question #1","question":"What are the specific things from which the Prophet sought refuge in his supplications?","id":"bukhari-80-72"},{"hadith-eng":"The Prophet (ﷺ) used to seek refuge with Allah (by saying), \"O Allah! I seek refuge with You from the \naffliction of the Fire and from the punishment in the Fire, and seek refuge with You from the affliction \nof the grave, and I seek refuge with You from the affliction of wealth, and I seek refuge with You \nfrom the affliction of poverty, and seek refuge with You from the affliction of Al-Masih Ad-Dajjal.\"","reference":"Sahih al-Bukhari 6376, Book 80, Hadith 73","grade":"","question #":"question #1","question":"What are the different afflictions from which the Prophet (ﷺ) sought refuge in his supplications?","id":"bukhari-80-73"},{"hadith-eng":"The Prophet (ﷺ) used to say, 'O Allah! I seek refuge with You from the affliction of the Fire, the \npunishment of the Fire, the affliction of the grave, the punishment of the grave, and the evil of the \naffliction of poverty. O Allah! I seek refuge with You from the evil of the affliction of Al-Masih Ad- \nDajjal, O Allah! Cleanse my heart with the water of snow and hail, and cleanse my heart from all sins \nas a white garment is cleansed from filth, and let there be a far away distance between me and my sins \nas You made the East and West far away from each other. O Allah! I seek refuge with You from \nlaziness, sins, and from being in debt.\"","reference":"Sahih al-Bukhari 6377, Book 80, Hadith 74","grade":"","question #":"question #1","question":"What are the different afflictions and evils from which the Prophet (ﷺ) sought refuge in his supplications?","id":"bukhari-80-74"},{"hadith-eng":"that she said, \"O Allah's Messenger (ﷺ)! Anas is your servant, so please invoke for Allah's blessing for him.\" \nThe Prophet (ﷺ) said, \"O Allah! Increase his wealth and offspring and bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6378, 6379, Book 80, Hadith 75","grade":"","question #":"question #1","question":"What is the significance of invoking blessings for others in Islam?","id":"bukhari-80-75"},{"hadith-eng":"Um Sulaim said (to the Prophet), \"Anas is your servant; so please invoke for Allah's blessings for \nhim.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6380, 6381, Book 80, Hadith 76","grade":"","question #":"question #1","question":"What is the significance of seeking blessings for others in Islam?","id":"bukhari-80-76"},{"hadith-eng":"Um Sulaim said (to the Prophet), \"Anas is your servant; so please invoke for Allah's blessings for \nhim.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6380, 6381, Book 80, Hadith 76","grade":"","question #":"question #1","question":"What is the significance of seeking blessings for someone in Islam?","id":"bukhari-80-77"},{"hadith-eng":"The Prophet (ﷺ) used to teach us the Istikhara for each and every matter as he used to teach us the Suras \nfrom the Holy Qur'an. (He used to say), \"If anyone of you intends to do something, he should offer a \ntwo-rak`at prayer other than the obligatory prayer, and then say: 'Allahumma inni astakhiruka \nbi'ilmika, wa astaqdiruka biqudratika, wa as'aluka min fadlika-l-'azim, fa innaka taqdiru wala aqdiru, \nwa ta'lamu wala a'lamu, wa anta'allamu-l-ghuyub. Allahumma in kunta ta'lamu anna hadha-lamra \nkhairun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi 'ajili `Amri wa ajilihi) fa-qdurhu li, Wa in \nkunta ta'lamu anna ha-dha-l-amra sharrun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi ajili `Amri \nwa ajilihi) fasrifhu 'anni was-rifni 'anhu wa aqdur li alkhaira haithu kana, thumma Raddani bihi,\" Then \nhe should mention his matter (need).","reference":"Sahih al-Bukhari 6382, Book 80, Hadith 77","grade":"","question #":"question #1","question":"How is the practice of Istikhara prayer significant in decision-making for Muslims?","id":"bukhari-80-78"},{"hadith-eng":"The Prophet (ﷺ) asked for some water and performed the ablution, and then raised his hands (towards the \nsky) and said, \"O Allah! Forgive `Ubaid Abi 'Amir.\" I saw the whiteness of his armpits (while he was \nraising his hands) and he added, \"O Allah! Upgrade him over many of Your human creatures on the \nDay of Resurrection.\"","reference":"Sahih al-Bukhari 6383, Book 80, Hadith 78","grade":"","question #":"question #1","question":"What is the significance of raising hands during supplication in Islamic practice?","id":"bukhari-80-79"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on a journey, and whenever we ascended a high place, we \nused to say Takbir (in a loud voice). The Prophet (ﷺ) said, \"O people! Be kind to yourselves, for you are \nnot calling upon a deaf or an absent one, but You are calling an All-Hearer, and an All-Seer.\" Then he \ncame to me as I was reciting silently, \"La haul a wala quwwata illa bil-lah.\" He said, \"O `Abdullah bin \nQais! Say: La haul a walaquwata illa bil-lah, for it is one of the treasures of Paradise.\" Or he said, \n\"Shall I tell you a word which is one of the treasures of Paradise? It is: La haul a wala quwwata illa \nbil-lah.\"","reference":"Sahih al-Bukhari 6384, Book 80, Hadith 79","grade":"","question #":"question #1","question":"What is the significance of saying 'La haul a wala quwwata illa bil-lah' in Islam?","id":"bukhari-80-80"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa or Hajj or `Umra, he used to say, \"Allahu Akbar,\" \nthree times; whenever he went up a high place, he used to say, \"La ilaha illal-lahu wahdahu la sharika \nlahu, lahu-l-mulk wa lahu-l-hamd, wa huwa'ala kulli Shai 'in qadir. Ayibuna ta'ibuna 'abiduna \nlirabbina hamidun. Sadaqa-l-lahu wa'dahu, wa nasara`Abdahu wa hazama-l-ahzaba wahdahu.\"","reference":"Sahih al-Bukhari 6385, Book 80, Hadith 80","grade":"","question #":"question #1","question":"What phrases did the Prophet Muhammad (ﷺ) recite when returning from a journey such as Ghazwa, Hajj, or `Umra?","id":"bukhari-80-81"},{"hadith-eng":"The Prophet (ﷺ) seeing a yellow mark (of perfume) on the clothes of `Abdur-Rahman bin `Auf, said, \n\"What about you?\" `Abdur-Rahman replied, \"I have married a woman with a Mahr of gold equal to a \ndate-stone.\" The Prophet (ﷺ) said, \"May Allah bestow His Blessing on you (in your marriage). Give a \nwedding banquet, (Walima) even with one sheep.\"","reference":"Sahih al-Bukhari 6386, Book 80, Hadith 81","grade":"","question #":"question #1","question":"What is the significance of giving a wedding banquet in Islam?","id":"bukhari-80-82"},{"hadith-eng":"My father died and left behind seven or nine daughters, and I married a woman. The Prophet (ﷺ) said, \n\"Did you get married, O Jabir?\" I replied, \"Yes.\" He asked, \"Is she a virgin or a matron?\" I replied, \n\"She is a matron.\" He said, \"Why didn't you marry a virgin girl so that you might play with her and \nshe with you (or, you might make her laugh and she make you laugh)?\" I said, \"My father died, \nleaving seven or nine girls (orphans) and I did not like to bring a young girl like them, so I married a \nwoman who can look after them.\" He said, \"May Allah bestow His Blessing on you.\"","reference":"Sahih al-Bukhari 6387, Book 80, Hadith 82","grade":"","question #":"question #1","question":"What considerations might influence a person's choice between marrying a virgin or a matron?","id":"bukhari-80-83"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you, when intending to have a sexual intercourse with his wife, says: \n'Bismillah, Allahumma jannibna-sh-shaitan, wa jannibi-sh-shaitan ma razaqtana,' and if the couple are \ndestined to have a child (out of that very sexual relation), then Satan will never be able to harm that \nchild.\"","reference":"Sahih al-Bukhari 6388, Book 80, Hadith 83","grade":"","question #":"question #1","question":"What is the significance of reciting a specific supplication before engaging in marital relations in Islam?","id":"bukhari-80-84"},{"hadith-eng":"The most frequent invocation of The Prophet (ﷺ) was: \"O Allah! Give to us in the world that which is \ngood and in the Hereafter that which is good, and save us from the torment of the Fire.\" (2.201)","reference":"Sahih al-Bukhari 6389, Book 80, Hadith 84","grade":"","question #":"question #1","question":"What is the significance of asking for goodness in both this world and the Hereafter in Islamic supplications?","id":"bukhari-80-85"},{"hadith-eng":"The Prophet (ﷺ) used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek \nrefuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with \nYou from being brought back to (senile) geriatric old age, and seek refuge with You from the \naffliction of the world and from the punishment in the Hereafter.\"","reference":"Sahih al-Bukhari 6390, Book 80, Hadith 85","grade":"","question #":"question #1","question":"What are the specific supplications the Prophet (ﷺ) taught to seek refuge from certain negative traits and conditions?","id":"bukhari-80-86"},{"hadith-eng":"that Allah's Messenger (ﷺ) was affected by magic, so much that he used to think that he had done something \nwhich in fact, he did not do, and he invoked his Lord (for a remedy). Then (one day) he said, \"O \n`Aisha!) Do you know that Allah has advised me as to the problem I consulted Him about?\" `Aisha \nsaid, \"O Allah's Messenger (ﷺ)! What's that?\" He said, \"Two men came to me and one of them sat at my \nhead and the other at my feet, and one of them asked his companion, 'What is wrong with this man?' \nThe latter replied, 'He is under the effect of magic.' The former asked, 'Who has worked magic on \nhim?' The latter replied, 'Labid bin Al-A'sam.' The former asked, 'With what did he work the magic?' \nThe latter replied, 'With a comb and the hair, which are stuck to the comb, and the skin of pollen of a \ndate-palm tree.' The former asked, 'Where is that?' The latter replied, 'It is in Dharwan.' Dharwan was \na well in the dwelling place of the (tribe of) Bani Zuraiq. Allah's Messenger (ﷺ) went to that well and \nreturned to `Aisha, saying, 'By Allah, the water (of the well) was as red as the infusion of Hinna, (1) \nand the date-palm trees look like the heads of devils.' `Aisha added, Allah's Messenger (ﷺ) came to me and \ninformed me about the well. I asked the Prophet, 'O Allah's Messenger (ﷺ), why didn't you take out the skin \nof pollen?' He said, 'As for me, Allah has cured me and I hated to draw the attention of the people to \nsuch evil (which they might learn and harm others with).' \" \nNarrated Hisham's father: `Aisha said, \"Allah's Messenger (ﷺ) was bewitched, so he invoked Allah \nrepeatedly requesting Him to cure him from that magic).\" Hisham then narrated the above narration. \n(See Hadith No. 658, Vol. 7)","reference":"Sahih al-Bukhari 6391, Book 80, Hadith 86","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) respond to being affected by magic according to Islamic teachings?","id":"bukhari-80-87"},{"hadith-eng":"Allah's Messenger (ﷺ) asked for Allah's wrath upon the Ahzab (confederates), saying, \"O Allah, the Revealer \nof the Holy Book, and the One swift at reckoning! Defeat the confederates; Defeat them and shake \nthem.\"","reference":"Sahih al-Bukhari 6392, Book 80, Hadith 87","grade":"","question #":"question #1","question":"What is the significance of invoking Allah's attributes when making supplications during times of distress?","id":"bukhari-80-88"},{"hadith-eng":"When the Prophet (ﷺ) said, \"Sami' al-lahu liman hamidah (Allah heard him who sent his praises to Him)\" \nin the last rak`a of the `Isha' prayer, he used to invoke Allah, saying, \"O Allah! Save `Aiyash bin Abi \nRabi`a; O Allah! Save Al-Walid bin Al-Walid; O Allah! Save the weak people among the believers; O \nAllah! Be hard on the Tribe of Mudar; O Allah! Inflict years of drought upon them like the years (of \ndrought) of the Prophet (ﷺ) Joseph.\"","reference":"Sahih al-Bukhari 6393, Book 80, Hadith 88","grade":"","question #":"question #1","question":"What is the significance of invoking Allah for the protection and aid of specific individuals during prayer?","id":"bukhari-80-89"},{"hadith-eng":"The Prophet (ﷺ) sent a Sariya (an army detachment) consisting of men called Al-Qurra', and all of them \nwere martyred. I had never seen the Prophet (ﷺ) so sad over anything as he was over them. So he said \nQunut (invocation in the prayer) for one month in the Fajr prayer, invoking for Allah's wrath upon the \ntribe of 'Usaiya, and he used to say, \"The people of 'Usaiya have disobeyed Allah and His Apostle.\"","reference":"Sahih al-Bukhari 6394, Book 80, Hadith 89","grade":"","question #":"question #1","question":"What is the significance of the Prophet's emotional response to the martyrdom of his companions?","id":"bukhari-80-90"},{"hadith-eng":"The Jews used to greet the Prophet (ﷺ) by saying, \"As-Samu 'Alaika (i.e., death be upon you), so I \nunderstood what they said, and I said to them, \"As-Samu 'alaikum wal-la'na (i.e. Death and Allah's \nCurse be upon you).\" The Prophet (ﷺ) said, \"Be gentle and calm, O `Aisha, as Allah likes gentleness in all \naffairs.\" I said, \"O Allah's Prophet! Didn't you hear what they said?\" He said, \"Didn't you hear me \nanswering them back by saying, 'Alaikum (i.e., the same be upon you)?\"","reference":"Sahih al-Bukhari 6395, Book 80, Hadith 90","grade":"","question #":"question #1","question":"How does Islam emphasize the importance of gentleness and calmness in interactions with others?","id":"bukhari-80-91"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on the day (of the battle) of Al-Khandaq (the Trench). The \nProphet said, \"May Allah fill their (the infidels') graves and houses with fire, as they have kept us so \nbusy that we could not offer the middle prayer till the sun had set; and that prayer was the `Asr \nprayer.\"","reference":"Sahih al-Bukhari 6396, Book 80, Hadith 91","grade":"","question #":"question #1","question":"What challenges did the Muslims face during the Battle of Al-Khandaq that affected their prayer schedule?","id":"bukhari-80-92"},{"hadith-eng":"at-Tufail bin `Amr came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The tribe of Daus has \ndisobeyed (Allah and His Apostle) and refused (to embrace Islam), therefore, invoke Allah's wrath for \nthem.\" The people thought that the Prophet (ﷺ) would invoke Allah's wrath for them, but he said, \"O \nAllah! Guide the tribe Of Daus and let them come to us.\"","reference":"Sahih al-Bukhari 6397, Book 80, Hadith 92","grade":"","question #":"question #1","question":"How does the Prophet Muhammad (ﷺ) demonstrate mercy and compassion towards those who have disobeyed?","id":"bukhari-80-93"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah with the following invocation: 'Rabbi-ghfir-li Khati 'ati wa jahli wa \nisrafi fi `Amri kullihi, wa ma anta a'lamu bihi minni. Allahumma ighfirli khatayaya wa 'amdi, wa jahli \nwa jiddi, wa kullu dhalika'indi. Allahumma ighrifli ma qaddamtu wa ma akhartu wa ma asrartu wa ma \na'lantu. Anta-l-muqaddimu wa anta-l-mu'akh-khiru, wa anta 'ala kulli shai'in qadir.'","reference":"Sahih al-Bukhari 6398, Book 80, Hadith 93","grade":"","question #":"question #1","question":"What are the key elements of the supplication used by the Prophet (ﷺ) for seeking forgiveness?","id":"bukhari-80-94"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah, saying, \"Allahumma ighfirli khati'ati wa jahli wa israfi fi `Amri, wa \nma anta a-'lamu bihi minni. Allahumma ighfirli hazali wa jiddi wa khata'i wa amdi, wa kullu dhalika \n'indi.\"","reference":"Sahih al-Bukhari 6399, Book 80, Hadith 94","grade":"","question #":"question #1","question":"What are the different aspects of human behavior for which the Prophet sought forgiveness from Allah?","id":"bukhari-80-95"},{"hadith-eng":"Abu-l-Qasim (the Prophet) said, \"On Friday there is a particular time. If a Muslim happens to be \npraying and invoking Allah for something good during that time, Allah will surely fulfill his request.\" \nThe Prophet (ﷺ) pointed out with his hand. We thought that he wanted to illustrate how short that time \nwas.","reference":"Sahih al-Bukhari 6400, Book 80, Hadith 95","grade":"","question #":"question #1","question":"What is the significance of a specific time on Friday for Muslims in terms of prayer and supplication?","id":"bukhari-80-96"},{"hadith-eng":"`Aisha said, \"The Jews came to the Prophet (ﷺ) and said to him, \"As-Samu 'Alaika (i.e., Death be upon \nyou).\" He replied, 'The same on you.' \" `Aisha said to them, \"Death be upon you, and may Allah curse \nyou and shower His wrath upon you!\" Allah's Messenger (ﷺ) I said, \"Be gentle and calm, O `Aisha! Be \ngentle and beware of being harsh and of saying evil things.\" She said, \"Didn't you hear what they \nsaid?\" He said, \"Didn't you hear what I replied (to them)? have returned their statement to them, and \nmy invocation against them will be accepted but theirs against me will not be accepted.\"","reference":"Sahih al-Bukhari 6401, Book 80, Hadith 96","grade":"","question #":"question #1","question":"What is the significance of responding to insults with calmness and gentleness in Islam?","id":"bukhari-80-97"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the Imam says 'Amin', then you should all say 'Amin', for the angels say \n'Amin' at that time, and he whose 'Amin' coincides with the 'Amin' of the angels, all his past sins will \nbe forgiven.\"","reference":"Sahih al-Bukhari 6402, Book 80, Hadith 97","grade":"","question #":"question #1","question":"What is the significance of saying 'Amin' during prayer in Islam?","id":"bukhari-80-98"},{"hadith-eng":"Allah's Messenger (ﷺ) said,\" Whoever says: \"La ilaha illal-lah wahdahu la sharika lahu, lahu-l-mulk wa lahul- \nhamd wa huwa 'ala kulli shai'in qadir,\" one hundred times will get the same reward as given for \nmanumitting ten slaves; and one hundred good deeds will be written in his accounts, and one hundred \nsins will be deducted from his accounts, and it (his saying) will be a shield for him from Satan on that \nday till night, and nobody will be able to do a better deed except the one who does more than he.\"","reference":"Sahih al-Bukhari 6403, Book 80, Hadith 98","grade":"","question #":"question #1","question":"What are the spiritual benefits of reciting the phrase 'La ilaha illal-lah wahdahu la sharika lahu, lahu-l-mulk wa lahul-hamd wa huwa 'ala kulli shai'in qadir' one hundred times?","id":"bukhari-80-99"},{"hadith-eng":"Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted \none of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet (ﷺ) saying, \n\"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"","reference":"Sahih al-Bukhari 6404, Book 80, Hadith 99","grade":"","question #":"question #1","question":"What is the significance of reciting certain invocations multiple times in Islam?","id":"bukhari-80-100"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever says, 'Subhan Allah wa bihamdihi,' one hundred times a day, will be \nforgiven all his sins even if they were as much as the foam of the sea.","reference":"Sahih al-Bukhari 6405, Book 80, Hadith 100","grade":"","question #":"question #1","question":"What is the significance of reciting 'Subhan Allah wa bihamdihi' in seeking forgiveness for sins?","id":"bukhari-80-101"},{"hadith-eng":"The Prophet (ﷺ) said, \"There are two expressions which are very easy for the tongue to say, but they are \nvery heavy in the balance and are very dear to The Beneficent (Allah), and they are, 'Subhan Allah Al- \n`Azim and 'Subhan Allah wa bihamdihi.'\"","reference":"Sahih al-Bukhari 6406, Book 80, Hadith 101","grade":"","question #":"question #1","question":"What are the benefits of reciting certain expressions that are easy to say but have great significance in Islam?","id":"bukhari-80-102"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of the one who celebrates the Praises of his Lord (Allah) in \ncomparison to the one who does not celebrate the Praises of his Lord, is that of a living creature \ncompared to a dead one.\"","reference":"Sahih al-Bukhari 6407, Book 80, Hadith 102","grade":"","question #":"question #1","question":"What is the significance of remembering and praising Allah in one's daily life?","id":"bukhari-80-103"},{"hadith-eng":"Allah 's Apostle said, \"Allah has some angels who look for those who celebrate the Praises of Allah \non the roads and paths. And when they find some people celebrating the Praises of Allah, they call \neach other, saying, \"Come to the object of your pursuit.' \" He added, \"Then the angels encircle them \nwith their wings up to the sky of the world.\" He added. \"(after those people celebrated the Praises of \nAllah, and the angels go back), their Lord, asks them (those angels)----though He knows better than \nthem----'What do My slaves say?' The angels reply, 'They say: Subhan Allah, Allahu Akbar, and \nAlham-du-li l-lah, Allah then says 'Did they see Me?' The angels reply, 'No! By Allah, they didn't see \nYou.' \nAllah says, How it would have been if they saw Me?' The angels reply, 'If they saw You, they would \nworship You more devoutly and celebrate Your Glory more deeply, and declare Your freedom from \nany resemblance to anything more often.' Allah says (to the angels), 'What do they ask Me for?' The \nangels reply, 'They ask You for Paradise.' Allah says (to the angels), 'Did they see it?' The angels say, \n'No! By Allah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The \nangels say, 'If they saw it, they would have greater covetousness for it and would seek It with greater \nzeal and would have greater desire for it.' Allah says, 'From what do they seek refuge?' The angels \nreply, 'They seek refuge from the (Hell) Fire.' Allah says, 'Did they see it?' The angels say, 'No By \nAllah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The angels \nsay, 'If they saw it they would flee from it with the extreme fleeing and would have extreme fear from \nit.' Then Allah says, 'I make you witnesses that I have forgiven them.\"' Allah's Messenger (ﷺ) added, \"One of \nthe angels would say, 'There was so-and-so amongst them, and he was not one of them, but he had just \ncome for some need.' Allah would say, 'These are those people whose companions will not be reduced \nto misery.' \"","reference":"Sahih al-Bukhari 6408, Book 80, Hadith 103","grade":"","question #":"question #1","question":"What is the significance of angels in Islam when it comes to the remembrance of Allah?","id":"bukhari-80-104"},{"hadith-eng":"The Prophet (ﷺ) started ascending a high place or hill. A man (amongst his companions) ascended it and \nshouted in a loud voice, \"La ilaha illal-lahu wallahu Akbar.\" (At that time) Allah's Messenger (ﷺ) was riding \nhis mule. Allah's Messenger (ﷺ) said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu \nMusa (or, O `Abdullah)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He \nsaid, \"La haul a wala quwwata illa billah,\"","reference":"Sahih al-Bukhari 6409, Book 80, Hadith 104","grade":"","question #":"question #1","question":"What is the significance of the phrase 'La haul a wala quwwata illa billah' in Islamic teachings?","id":"bukhari-80-105"},{"hadith-eng":"Allah has ninety-nine Names, i.e., one hundred minus one, and whoever believes in their meanings \nand acts accordingly, will enter Paradise; and Allah is witr (one) and loves 'the witr' (i.e., odd \nnumbers).","reference":"Sahih al-Bukhari 6410, Book 80, Hadith 105","grade":"","question #":"question #1","question":"What is the significance of understanding and acting upon the meanings of Allah's ninety-nine names?","id":"bukhari-80-106"},{"hadith-eng":"While we were waiting for `Abdullah (bin Mas`ud). Yazid bin Muawiya came. I said (to him), \"Will \nyou sit down?\" He said, \"No, but I will go into the house (of Ibn Mas`ud) and let your companion (Ibn \nMas`ud) come out to you; and if he should not (come out), I will come out and sit (with you).\" Then \n`Abdullah came out, holding the hand of Yazid, addressed us, saying, \"I know that you are assembled \nhere, but the reason that prevents me from coming out to you, is that Allah's Messenger (ﷺ) used to preach to \nus at intervals during the days, lest we should become bored.\"","reference":"Sahih al-Bukhari 6411, Book 80, Hadith 106","grade":"","question #":"question #1","question":"Why did the Prophet Muhammad (ﷺ) choose to preach at intervals rather than continuously?","id":"bukhari-80-107"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"For every prophet there is one (special \n     invocation (that will not be rejected) with which he appeals (to \n     Allah), and I want to keep such an invocation for interceding for my \n     followers in the Hereafter.\"","reference":"Sahih al-Bukhari 6304, Book 80, Hadith 1","grade":"","question #":"question #2","question":"How does the concept of intercession play a role in the Hereafter according to Islamic teachings?","id":"bukhari-80-108"},{"hadith-eng":"that the Prophet (ﷺ) said, \"For every prophet there is an invocation that \n     surely will be responded by Allah,\" (or said), \"For every prophet \n     there was an invocation with which he appealed to Allah, and his \n     invocation was accepted (in his lifetime), but I kept my (this \n     special) invocation to intercede for my followers on the Day of \n     Resurrection.\"","reference":"Sahih al-Bukhari 6305, Book 80, Hadith 2","grade":"","question #":"question #2","question":"How does the concept of intercession play a role in the Day of Resurrection according to Islamic teachings?","id":"bukhari-80-109"},{"hadith-eng":"The Prophet (ﷺ) said \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta \nRabbi la ilaha illa anta, Khalaqtani wa ana `Abduka, wa ana `ala `ahdika wa wa`dika mastata`tu, \nA`udhu bika min Sharri ma sana`tu, abu'u Laka bini`matika `alaiya, wa abu'u laka bidhanbi faghfir lee \nfa innahu la yaghfiru adhdhunuba illa anta.\" The Prophet (ﷺ) added. \"If somebody recites it during the day \nwith firm faith in it, and dies on the same day before the evening, he will be from the people of \nParadise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will \nbe from the people of Paradise.\"","reference":"Sahih al-Bukhari 6306, Book 80, Hadith 3","grade":"","question #":"question #2","question":"What are the benefits of reciting a specific supplication for forgiveness with firm faith?","id":"bukhari-80-110"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying.\" By Allah! I ask for forgiveness from Allah and turn to Him in \nrepentance more than seventy times a day.\"","reference":"Sahih al-Bukhari 6307, Book 80, Hadith 4","grade":"","question #":"question #2","question":"What is the significance of regularly asking for forgiveness in Islam?","id":"bukhari-80-111"},{"hadith-eng":"`Abdullah bin Mas`ud related to us two narrations: One from the Prophet (ﷺ) and the other from himself, \nsaying: A believer sees his sins as if he were sitting under a mountain which, he is afraid, may fall on \nhim; whereas the wicked person considers his sins as flies passing over his nose and he just drives \nthem away like this.\" Abu Shihab (the sub-narrator) moved his hand over his nose in illustration. (Ibn \nMas`ud added): Allah's Messenger (ﷺ) said, \"Allah is more pleased with the repentance of His slave than a \nman who encamps at a place where his life is jeopardized, but he has his riding beast carrying his food \nand water. He then rests his head and sleeps for a short while and wakes to find his riding beast gone. \n(He starts looking for it) and suffers from severe heat and thirst or what Allah wished (him to suffer \nfrom). He then says, 'I will go back to my place.' He returns and sleeps again, and then (getting up), he \nraises his head to find his riding beast standing beside him.\"","reference":"Sahih al-Bukhari 6308, Book 80, Hadith 5","grade":"","question #":"question #2","question":"What analogy is used to describe Allah's pleasure with a repentant servant?","id":"bukhari-80-112"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah is more pleased with the repentance of His slave than anyone of you is \npleased with finding his camel which he had lost in the desert. \"","reference":"Sahih al-Bukhari 6309, Book 80, Hadith 6","grade":"","question #":"question #2","question":"What analogy is used to describe Allah's pleasure with a repentant servant?","id":"bukhari-80-113"},{"hadith-eng":"The Prophet (ﷺ) used to pray eleven rak`at in the late part of the night, and when dawn appeared, he \nwould offer two rak`at and then lie on his right side till the Muadhdhin came to inform him (that the \nmorning prayer was due).","reference":"Sahih al-Bukhari 6310, Book 80, Hadith 7","grade":"","question #":"question #2","question":"What actions did the Prophet (ﷺ) take after completing his night prayers before the morning prayer?","id":"bukhari-80-114"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"When you want to go to bed, perform ablution as you do for prayer, then \r\nlie down on your right side and say: 'Allahumma aslamtu wajhi ilaika, wa fawwadtu 'amri ilaika wa \r\nalja'tu dhahri ilaika, raghbatan wa rahbatan ilaika, la malja'a wa la manja minka illa ilaika. Amantu \r\nbikitabik al-ladhi anzalta wa binabiyyika al-ladhi arsalta'. If you should die then (after reciting this) you \r\nwill die on the religion of Islam (i.e., as a Muslim); so let these words be the last you say (before \r\ngoing to bed)\" While I was memorizing it, I said, \"Wa birasulika al-ladhi arsalta (in Your Apostle \r\nwhom You have sent).' The Prophet (ﷺ) said, \"No, but say: Wa binabiyyika al-ladhi arsalta (in Your \r\nProphet whom You have sent).","reference":"Sahih al-Bukhari 6311, Book 80, Hadith 8","grade":"","question #":"question #2","question":"Why is it important to recite specific supplications before sleeping according to Islamic teachings?","id":"bukhari-80-115"},{"hadith-eng":"When the Prophet (ﷺ) went to bed, he would say: \"Bismika amutu wa ahya.\" and when he got up he \nwould say:\" Al-hamdu li l-lahil-ladhi ahyana ba'da ma amatana wa ilaihin-nushur.\"","reference":"Sahih al-Bukhari 6312, Book 80, Hadith 9","grade":"","question #":"question #2","question":"How does the practice of reciting specific prayers before sleep and upon waking reflect a Muslim's faith in Allah?","id":"bukhari-80-116"},{"hadith-eng":"That the Prophet (ﷺ) advised a man, saying, \"If you intend to lie down (i.e. go to bed), say, 'Allahumma \naslamtu nafsi ilaika wa fauwadtu `Amri ilaika, wa wajjahtu wajhi ilaika wa alja'tu zahri ilaika, \nreghbatan wa rahbatan ilaika. La malja'a wa la manja minka illa ilaika. Amantu bikitabikal-ladhi \nanzalta; wa nabiyyikalladhi arsalta.' And if you should die then (after reciting this before going to bed) \nyou will die on the religion of Islam\"","reference":"Sahih al-Bukhari 6313, Book 80, Hadith 10","grade":"","question #":"question #2","question":"How does one express submission and trust in Allah before sleeping according to Islamic teachings?","id":"bukhari-80-117"},{"hadith-eng":"When the Prophet (ﷺ) went to bed at night, he would put his hand under his cheek and then say, \n\"Allahumma bismika amutu wa ahya,\" and when he got up, he would say, \"Al-Hamdu lil-lahi al-ladhi \nahyana ba'da ma amatana, wa ilaihi an-nushur.\"","reference":"Sahih al-Bukhari 6314, Book 80, Hadith 11","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) express gratitude to Allah upon waking up?","id":"bukhari-80-118"},{"hadith-eng":"When Allah's Messenger (ﷺ) went to bed, he used to sleep on his right side and then say, \"All-ahumma \naslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu zahri ilaika, \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Amantu bikitabika al-ladhi \nanzalta wa nabiyyika al-ladhi arsalta! Allah's Messenger (ﷺ) said, \"Whoever recites these words (before \ngoing to bed) and dies the same night, he will die on the Islamic religion (as a Muslim).","reference":"Sahih al-Bukhari 6315, Book 80, Hadith 12","grade":"","question #":"question #2","question":"How does sleeping on the right side relate to the practices of the Prophet Muhammad (ﷺ)?","id":"bukhari-80-119"},{"hadith-eng":"One night I slept at the house of Maimuna. The Prophet (ﷺ) woke up, answered the call of nature, washed \nhis face and hands, and then slept. He got up (late at night), went to a water skin, opened the mouth \nthereof and performed ablution not using much water, yet he washed all the parts properly and then \noffered the prayer. I got up and straightened my back in order that the Prophet (ﷺ) might not feel that I \nwas watching him, and then I performed the ablution, and when he got up to offer the prayer, I stood on \nhis left. He caught hold of my ear and brought me over to his right side. He offered thirteen rak`at in \nall and then lay down and slept till he started blowing out his breath as he used to do when he slept. In \nthe meantime Bilal informed the Prophet (ﷺ) of the approaching time for the (Fajr) prayer, and the \nProphet offered the Fajr (Morning) prayer without performing new ablution. He used to say in his \ninvocation, Allahumma ij`al fi qalbi nuran wa fi basari nuran, wa fi sam`i nuran, wa`an yamini nuran, \nwa`an yasari nuran, wa fawqi nuran, wa tahti nuran, wa amami nuran, wa khalfi nuran, waj`al li \nnuran.\" Kuraib (a sub narrator) said, \"I have forgotten seven other words, (which the Prophet (ﷺ) \nmentioned in this invocation). I met a man from the offspring of Al-`Abbas and he narrated those \nseven things to me, mentioning, '(Let there be light in) my nerves, my flesh, my blood, my hair and \nmy body,' and he also mentioned two other things.\"","reference":"Sahih al-Bukhari 6316, Book 80, Hadith 13","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform ablution and what can be learned from his method?","id":"bukhari-80-120"},{"hadith-eng":"When the Prophet (ﷺ) got up at night to offer the night prayer, he used to say: \"Allahumma laka l-hamdu; \nAnta nuras-samawati wal ardi wa man fihinna. wa laka l-hamdu; Anta qaiyim as-samawati wal ardi \nwa man flhinna. Wa lakaI-hamdu; Anta-l-,haqqun, wa wa'daka haqqun, wa qauluka haqqun, wa \nliqauka haqqun, wal-jannatu haqqun, wannaru haqqun, was-sa atu haqqun, wan-nabiyyuna huqqun, \nMahammadun haqqun, Allahumma laka aslamtu, wa Alaika tawakkaltu, wa bika amantu, wa ilaika \nanabtu, wa bika Khasamtu, wa ilaika hakamtu, faghfirli ma qaddamtu wa ma akh-khartu, wa ma \nasrartu, wa ma a'lantu. Anta al-muqaddimu, wa anta al-mu-'akhkhiru. La ilaha il-la anta (or La ilaha \nghairuka)\"","reference":"Sahih al-Bukhari 6317, Book 80, Hadith 14","grade":"","question #":"question #2","question":"How does the Prophet express his submission and reliance on Allah in his night prayer?","id":"bukhari-80-121"},{"hadith-eng":"Fatima complained about the blisters on her hand because of using a mill-stone. She went to ask the \nProphet for servant, but she did not find him (at home) and had to inform `Aisha of her need. When he \ncame, `Aisha informed him about it. `Ali added: The Prophet (ﷺ) came to us when we had gone to our \nbeds. When I was going to get up, he said, \"'Stay in your places,\" and sat between us, till I felt the \ncoolness of the feet on my chest. The Prophet (ﷺ) then said, \"Shall I not tell you of a thing which is better \nfor you than a servant? When you (both) go to your beds, say 'Allahu Akbar' thirty-three times, and \n'Subhan Allah' thirty-three times, 'Al hamdu 'illah' thirty-three times, for that is better for you than a \nservant.\" Ibn Seereen said, \"Subhan Allah' (is to be said for) thirty-four times.\"","reference":"Sahih al-Bukhari 6318, Book 80, Hadith 15","grade":"","question #":"question #2","question":"How can the practice of specific dhikr (remembrance of Allah) be beneficial in daily life according to Islamic teachings?","id":"bukhari-80-122"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to bed, he used to blow on his hands while reciting the Mu'auwidhat ( \ni.e. Suratal-Falaq 113 and Surat-an-Nas 114) and then pass his hands over his body.","reference":"Sahih al-Bukhari 6319, Book 80, Hadith 16","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate physical actions with recitation for protection before sleep?","id":"bukhari-80-123"},{"hadith-eng":"The Prophet (ﷺ) said, \"When anyone of you go to bed, he should shake out his bed with the inside of his \nwaist sheet, for he does not know what has come on to it after him, and then he should say: 'Bismika \nRabbi Wada`tu Janbi wa bika arfa'uhu, In amsakta nafsi farhamha wa in arsaltaha fahfazha bima \ntahfazu bihi ibadakas-salihin.\"","reference":"Sahih al-Bukhari 6320, Book 80, Hadith 17","grade":"","question #":"question #2","question":"What is the significance of reciting a specific supplication before sleeping in Islam?","id":"bukhari-80-124"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When it is the last third of the night, our Lord, the Blessed, the Superior, \ndescends every night to the heaven of the world and says, 'Is there anyone who invokes Me (demand \nanything from Me), that I may respond to his invocation; Is there anyone who asks Me for something \nthat I may give (it to) him; Is there anyone who asks My forgiveness that I may forgive him?' \"","reference":"Sahih al-Bukhari 6321, Book 80, Hadith 18","grade":"","question #":"question #2","question":"How does the concept of Allah descending to the heaven of the world relate to the practice of seeking forgiveness?","id":"bukhari-80-125"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to the lavatory, he used to say: \"Allahumma inni a`udhu bika min al-khubuthi wal khaba'ith.\"","reference":"Sahih al-Bukhari 6322, Book 80, Hadith 19","grade":"","question #":"question #2","question":"Why is it important to seek protection from evil before using the lavatory in Islam?","id":"bukhari-80-126"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta \nRabbi la ilaha illa anta. Khalaqtani wa ana `Abduka, wa ana 'ala 'ahdika wa Wa'dika mastata'tu abu'u \nLaka bi ni 'matika wa abu'u Laka bidhanbi; faghfirli fa'innahu la yaghfiru-dh-dhunuba ill a ant a. \nA'uidhu bika min sharri ma sana'tu.' If somebody recites this invocation during the night, and if he \nshould die then, he will go to Paradise (or he will be from the people of Paradise). And if he recites it \nin the morning, and if he should die on the same day, he will have the same fate.\"","reference":"Sahih al-Bukhari 6323, Book 80, Hadith 20","grade":"","question #":"question #2","question":"What are the benefits of reciting a specific invocation for forgiveness during the night or morning?","id":"bukhari-80-127"},{"hadith-eng":"Whenever the Prophet (ﷺ) intended to go to bed, he would recite: \"Bismika Allahumma amutu wa ahya \n(With Your name, O Allah, I die and I live).\" And when he woke up from his sleep, he would say: \n\"Al-hamdu lil-lahil-ladhi ahyana ba'da ma amatana; wa ilaihi an-nushur (All the Praises are for Allah \nWho has made us alive after He made us die (sleep) and unto Him is the Resurrection). \"","reference":"Sahih al-Bukhari 6324, Book 80, Hadith 21","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) acknowledge the cycle of life and death in his daily routine?","id":"bukhari-80-128"},{"hadith-eng":"Whenever the Prophet (ﷺ) lay on his bed, he used to say: \"Allahumma bismika amutu wa ahya,\" and when \nhe woke up he would say: \"Al-hamdu lil-lahilladhi ahyana ba'da ma an atana, wa ilaihi an-nushur.\"","reference":"Sahih al-Bukhari 6325, Book 80, Hadith 22","grade":"","question #":"question #2","question":"What is the significance of expressing gratitude upon waking up according to the Prophet (ﷺ)?","id":"bukhari-80-129"},{"hadith-eng":"Abu Bakr As-Siddiq said to the Prophet, \"Teach me an invocation with which I may invoke (Allah) in \nmy prayer.\" The Prophet (ﷺ) said, \"Say: Allahumma inni zalamtu nafsi zulman kathiran wala yaghfirudhdhunuba \nilla anta, Faghfirli maghfiratan min indika war-hamni, innaka antalGhafur-Rahim.\"","reference":"Sahih al-Bukhari 6326, Book 80, Hadith 23","grade":"","question #":"question #2","question":"How does one acknowledge their own wrongdoing and seek forgiveness in Islamic teachings?","id":"bukhari-80-130"},{"hadith-eng":"The Verse: 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) was revealed as regards \ninvocation.","reference":"Sahih al-Bukhari 6327, Book 80, Hadith 24","grade":"","question #":"question #2","question":"How does the Quran address the manner of making invocations during prayer?","id":"bukhari-80-131"},{"hadith-eng":"We used to say in the prayer: 'AsSalam be on Allah, As-Salam be on so-and so.' So one day the \nProphet said to us, \"Allah Himself is As-Salam; when anyone of you sits during his prayer, he should \nsay: 'at-tah, iyyatu-li l-lahi,' up to 'As-Salihin,' (All the compliments are for Allah ...righteous people) \nfor when he recites this, then he says his Salam to all the righteous people present in the heavens and \non the earth. Then he should say, 'I testify that none has the right to be worshipped except Allah, and \nthat Muhammad is His slave and His Apostle,' and then he can select whatever he likes to celebrate \n(Allah's) Praises.\"","reference":"Sahih al-Bukhari 6328, Book 80, Hadith 25","grade":"","question #":"question #2","question":"How does one properly conclude their prayer according to the teachings of the Prophet Muhammad?","id":"bukhari-80-132"},{"hadith-eng":"The people said, \"O Allah's Messenger (ﷺ)! The rich people have got the highest degrees of prestige and the \npermanent pleasures (in this life and the life to come in the Hereafter).\" He said, \"How is that?\" They \nsaid, \"The rich pray as we pray, and strive in Allah's Cause as we do, and spend from their surplus \nwealth in charity, while we have no wealth (to spend likewise).\" He said, \"Shall I not tell you a thing, \nby doing which, you will catch up with those who are ahead of you and supersede those who will \ncome after you; and nobody will be able to do such a good deed as you do except the one who does \nthe same (deed as you do). That deed is to recite 'Subhan Allah ten times, and 'Al-Hamduli l-lah ten \ntimes, and 'AllahuAkbar' ten times after every prayer.\"","reference":"Sahih al-Bukhari 6329, Book 80, Hadith 26","grade":"","question #":"question #2","question":"How can the repetition of certain phrases after prayer impact one's spiritual standing?","id":"bukhari-80-133"},{"hadith-eng":"(the freed slave of Al-Mughira bin Shu`ba) Al-Mughira wrote to Muawiya bin Abu Sufyan that \nAllah's Messenger (ﷺ) used to say at the end of every prayer after the Taslim, \"La ilaha illa-l-lahu wahdahu la \nsharika lahu; lahu-l-mulk wa lahu-l-hamd, wahuwa 'ala kulli shai'n qadir. Allahumma la mani'a Lima \na taita, wa la mu'ta Lima mana'ta, wa la yanfa'u dhal-jaddu minkal-jadd.","reference":"Sahih al-Bukhari 6330, Book 80, Hadith 27","grade":"","question #":"question #2","question":"How does acknowledging Allah's sovereignty and power influence a believer's supplication?","id":"bukhari-80-134"},{"hadith-eng":"We went out with the Prophet (ﷺ) to Khaibar. A man among the people said, \"O 'Amir! Will you please \nrecite to us some of your poetic verses?\" So 'Amir got down and started chanting among them, saying, \n\"By Allah! Had it not been for Allah, we would not have been guided.\" 'Amir also said other poetic \nverses which I do not remember. Allah's Messenger (ﷺ) said, \"Who is this (camel) driver?\" The people said, \n\"He is 'Amir bin Al-Akwa`,\" He said, \"May Allah bestow His Mercy on him.\" A man from the People \nsaid, \"O Allah's Messenger (ﷺ)! Would that you let us enjoy his company longer.\" When the people \n(Muslims) lined up, the battle started, and 'Amir was struck with his own sword (by chance) by \nhimself and died. In the evening, the people made a large number of fires (for cooking meals). Allah's \nApostle said, \"What is this fire? What are you making the fire for?\" They said, \"For cooking the meat \nof donkeys.\" He said, \"Throw away what is in the pots and break the pots!\" A man said, \"O Allah's \nProphet! May we throw away what is in them and wash them?\" He said, \"Never mind, you may do \nso.\" (See Hadith No. 509, Vol. 5).","reference":"Sahih al-Bukhari 6331, Book 80, Hadith 28","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the accidental death of a companion in battle?","id":"bukhari-80-135"},{"hadith-eng":"Whenever a man brought his alms to the Prophet, the Prophet (ﷺ) would say, \"O Allah! Bestow Your \nBlessing upon the family of so-and-so.\" When my father came to him (with his alms), he said, \"O \nAllah! Bestow Your Blessings upon the family of Abi `Aufa.\"","reference":"Sahih al-Bukhari 6332, Book 80, Hadith 29","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) pray for those who gave charity?","id":"bukhari-80-136"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me. \"Will you relieve me from Dhi-al-Khalasa? \" Dhi-al-Khalasa was an idol \nwhich the people used to worship and it was called Al-Ka`ba al Yamaniyya. I said, \"O Allah's Messenger (ﷺ) \nI am a man who can't sit firm on horses.\" So he stroked my chest (with his hand) and said, \"O Allah! \nMake him firm and make him a guiding and well-guided man.\" So I went out with fifty (men) from \nmy tribe of Ahrnas. (The sub-narrator, Sufyan, quoting Jarir, perhaps said, \"I went out with a group of \nmen from my nation.\") and came to Dhi-al-Khalasa and burnt it, and then came to the Prophet (ﷺ) and \nsaid, \"O Allah's Messenger (ﷺ)! I have not come to you till I left it like a camel with a skin disease.\" The \nProphet then invoked good upon Ahmas and their cavalry (fighters).","reference":"Sahih al-Bukhari 6333, Book 80, Hadith 30","grade":"","question #":"question #2","question":"How can a prayer or blessing from the Prophet Muhammad (ﷺ) impact a person's abilities and guidance?","id":"bukhari-80-137"},{"hadith-eng":"Um Sulaim said to the Prophet (ﷺ) \"Anas is your servant.\" The Prophet (ﷺ) said, \"O Allah! increase his \nwealth and offspring, and bless (for him) what ever you give him.\"","reference":"Sahih al-Bukhari 6334, Book 80, Hadith 31","grade":"","question #":"question #2","question":"How can prayers impact a person's wealth and offspring according to Islamic teachings?","id":"bukhari-80-138"},{"hadith-eng":"The Prophet (ﷺ) heard a man reciting (the Qur'an) in the mosque. He said,\" May Allah bestow His Mercy \non him, as he made me remember such and-such Verse which I had missed in such-and-such Sura.\"","reference":"Sahih al-Bukhari 6335, Book 80, Hadith 32","grade":"","question #":"question #2","question":"What is the significance of invoking Allah's mercy upon someone who helps in recalling forgotten verses of the Qur'an?","id":"bukhari-80-139"},{"hadith-eng":"The Prophet (ﷺ) divided something (among the Muslims) and distributed the shares (of the booty). A man \nsaid, \"This division has not been made to please Allah.\" When I informed the Prophet (ﷺ) about it, he \nbecame so furious that I noticed the signs of anger on his face and he then said, \"May Allah bestow \nHis Mercy on Moses, for he was hurt with more than this, yet he remained patient.\"","reference":"Sahih al-Bukhari 6336, Book 80, Hadith 33","grade":"","question #":"question #2","question":"What lesson can be learned from the Prophet's reference to the patience of Moses in the face of criticism?","id":"bukhari-80-140"},{"hadith-eng":"Ibn `Abbas said, \"Preach to the people once a week, and if you won't, then preach them twice, but if \nyou want to preach more, then let it be three times (a week only), and do not make the people fed-up \nwith this Qur'an. If you come to some people who are engaged in a talk, don't start interrupting their \ntalk by preaching, lest you should cause them to be bored. You should rather keep quiet, and if they \nask you, then preach to them at the time when they are eager to hear what you say. And avoid the use \nof rhymed prose in invocation for I noticed that Allah's Messenger (ﷺ) and his companions always avoided \nit.\"","reference":"Sahih al-Bukhari 6337, Book 80, Hadith 34","grade":"","question #":"question #2","question":"How should one approach a group of people engaged in conversation when intending to preach?","id":"bukhari-80-141"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When anyone of you appeal to Allah for something, he should ask with \ndetermination and should not say, 'O Allah, if You wish, give me.', for nobody can force Allah to do \nsomething against His Will.","reference":"Sahih al-Bukhari 6338, Book 80, Hadith 35","grade":"","question #":"question #2","question":"Why should one avoid using conditional phrases like 'if You wish' when making dua to Allah?","id":"bukhari-80-142"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"None of you should say: 'O Allah, forgive me if You wish; O Allah, be merciful \nto me if You wish,' but he should always appeal to Allah with determination, for nobody can force \nAllah to do something against His Will.\"","reference":"Sahih al-Bukhari 6339, Book 80, Hadith 36","grade":"","question #":"question #2","question":"What does this hadith teach about the nature of Allah's will and human requests?","id":"bukhari-80-143"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The invocation of anyone of you is granted (by Allah) if he does not show \nimpatience (by saying, \"I invoked Allah but my request has not been granted.\")","reference":"Sahih al-Bukhari 6340, Book 80, Hadith 37","grade":"","question #":"question #2","question":"How does impatience affect the outcome of one's prayers according to Islamic teachings?","id":"bukhari-80-144"},{"hadith-eng":"Narrated Anas, \"The Prophet (ﷺ) raised his hands (in invocation) till I saw the whiteness of his armpits.\"","reference":"Sahih al-Bukhari 6341, Book 80, Hadith 38","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) describe his manner of making du'a (supplication)?","id":"bukhari-80-145"},{"hadith-eng":"While the Prophet (ﷺ) was delivering a sermon on a Friday, a man stood up and said, \"O Allah's Messenger (ﷺ)! \nInvoke Allah to bless us with rain.\" (The Prophet (ﷺ) invoked Allah for rain.) So, the sky became overcast \nand it started raining till one could hardly reach one's home. It kept on raining till the next Friday \nwhen the same man or another man got up and said (to the Prophet), \"Invoke Allah to withhold the \nrain from us, for we have been drowned (with heavy rain ).\" The Prophet (ﷺ) said, \"O Allah! Let it rain \naround us and not on us.\" Then the clouds started dispersing around Medina and rain ceased to fall on \nthe people of Medina.","reference":"Sahih al-Bukhari 6342, Book 80, Hadith 39","grade":"","question #":"question #2","question":"What can be learned about the relationship between human requests and divine intervention from this event?","id":"bukhari-80-146"},{"hadith-eng":"Allah's Messenger (ﷺ) went out to this Musalla (praying place) to offer the prayer of Istisqa.' He invoked \nAllah for rain and then faced the Qibla and turned his Rida' (upper garment) inside out.","reference":"Sahih al-Bukhari 6343, Book 80, Hadith 40","grade":"","question #":"question #2","question":"What actions did the Prophet Muhammad (ﷺ) perform during the prayer for rain?","id":"bukhari-80-147"},{"hadith-eng":"My mother said, \"O Allah's Messenger (ﷺ)! Please invoke Allah on behalf of your servant.\" He said, \"O \nAllah! Increase his wealth and children, and bestow Your Blessing on whatever You give him.\" a time \nof distress.","reference":"Sahih al-Bukhari 6344, Book 80, Hadith 41","grade":"","question #":"question #2","question":"How can a prayer for increased wealth and children be interpreted in Islamic teachings?","id":"bukhari-80-148"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah at the time of distress, saying, \"La ilaha illal-lahu Al-`Azim, al- \nHalim, La ilaha illal-lahu Rabbu-s-samawati wal-ard wa Rabbu-l-arsh il-azim.\"","reference":"Sahih al-Bukhari 6345, Book 80, Hadith 42","grade":"","question #":"question #2","question":"What attributes of Allah are highlighted in the supplication used by the Prophet during distress?","id":"bukhari-80-149"},{"hadith-eng":"Allah's Messenger (ﷺ) used to say at a time of distress, \"La ilaha illal-lahu Rabbul-l-'arsh il-'azim, La ilaha \nillallahu Rabbu-s-samawati wa Rabbu-l-ard, Rabbu-l-'arsh-il-Karim.\"","reference":"Sahih al-Bukhari 6346, Book 80, Hadith 43","grade":"","question #":"question #2","question":"What are the attributes of Allah mentioned in the supplication for distress?","id":"bukhari-80-150"},{"hadith-eng":"Allah's Messenger (ﷺ) used to seek refuge with Allah from the difficult moment of a calamity and from being \novertaken by destruction and from being destined to an evil end, and from the malicious joy of \nenemies. Sufyan said, \"This narration contained three items only, but I added one. I do not know \nwhich one that was.\"","reference":"Sahih al-Bukhari 6347, Book 80, Hadith 44","grade":"","question #":"question #2","question":"Why is it important to seek protection from the malicious joy of enemies according to Islamic teachings?","id":"bukhari-80-151"},{"hadith-eng":"When Allah's Messenger (ﷺ) was healthy, he used to say, \"No prophet dies till he is shown his place in \nParadise, and then he is given the option (to live or die).\" So when death approached him(during his \nillness), and while his head was on my thigh, he became unconscious for a while, and when he \nrecovered, he fixed his eyes on the ceiling and said, \"O Allah! (Let me join) the Highest Companions \n(see Qur'an 4:69),\" I said, \"So, he does not choose us.\" Then I realized that it was the application of \nthe statement he used to relate to us when he was healthy. So that was his last utterance (before he \ndied), i.e. \"O Allah! (Let me join) the Highest Companions.\"","reference":"Sahih al-Bukhari 6348, Book 80, Hadith 45","grade":"","question #":"question #2","question":"How does the concept of choice between life and death manifest in the lives of prophets?","id":"bukhari-80-152"},{"hadith-eng":"I came to Khabbab who had been branded with seven brands(1) and he said, \"Had Allah's Messenger (ﷺ) not \nforbidden us to invoke (Allah) for death, I would have invoked (Allah) for it.\"","reference":"Sahih al-Bukhari 6349, Book 80, Hadith 46","grade":"","question #":"question #2","question":"Why might a person refrain from praying for death despite experiencing severe hardship?","id":"bukhari-80-153"},{"hadith-eng":"I came to Khabbab who had been branded with seven brands over his `Abdomen, and I heard him \nsaying, \"If the Prophet: had not forbidden us to invoke (Allah) for death, I would have invoked Allah \nfor it.\"","reference":"Sahih al-Bukhari 6350, Book 80, Hadith 47","grade":"","question #":"question #2","question":"Why might a person be discouraged from praying for death according to Islamic teachings?","id":"bukhari-80-154"},{"hadith-eng":"Allah's Messenger (ﷺ) said,\" None of you should long for death because of a calamity that had befallen him, \nand if he cannot, but long for death, then he should say, 'O Allah! Let me live as long as life is better \nfor me, and take my life if death is better for me.' \"","reference":"Sahih al-Bukhari 6351, Book 80, Hadith 48","grade":"","question #":"question #2","question":"How should a person approach the concept of life and death in times of distress according to Islamic teachings?","id":"bukhari-80-155"},{"hadith-eng":"My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My sister's son is sick.\" So he \npassed his hand over my head and invoked for Allah's blessing upon me and then performed the \nablution. I drank from the water of his ablution and I stood behind him and looked at his Khatam (the \nseal of Prophethood) between his shoulders (and its size was) like the button of a tent.","reference":"Sahih al-Bukhari 6352, Book 80, Hadith 49","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate care and compassion towards the sick?","id":"bukhari-80-156"},{"hadith-eng":"that his grandfather. `Abdullah bin Hisham used to take him from the market or to the market (the \nnarrator is in doubt) and used to buy grain and when Ibn Az-Zubair and Ibn `Umar met him, they \nwould say to him, \"Let us be your partners (in trading) as the Prophet (ﷺ) invoked for Allah's blessing \nupon you.\" He would then take them as partners and he would Sometimes gain a whole load carried \nby an animal which he would send home.","reference":"Sahih al-Bukhari 6353, Book 80, Hadith 50","grade":"","question #":"question #2","question":"How can the invocation of blessings by the Prophet (ﷺ) impact a person's business dealings?","id":"bukhari-80-157"},{"hadith-eng":"On whose face Allah's Messenger (ﷺ) had thrown water from his mouth, the water having been taken from \ntheir well while he was still a young boy (who has not yet attained the age of puberty).","reference":"Sahih al-Bukhari 6354, Book 80, Hadith 51","grade":"","question #":"question #2","question":"How are childhood interactions with the Prophet (ﷺ) remembered and recorded in Islamic history?","id":"bukhari-80-158"},{"hadith-eng":"The boys used to be brought to the Prophet (ﷺ) and he used to invoke for Allah's blessing upon them. \nOnce an infant was brought to him and it urinated on his clothes. He asked for water and poured it \nover the place of the urine and did not wash his clothes.","reference":"Sahih al-Bukhari 6355, Book 80, Hadith 52","grade":"","question #":"question #2","question":"What is the significance of invoking Allah's blessing upon children in Islamic tradition?","id":"bukhari-80-159"},{"hadith-eng":"whose eye Allah's Messenger (ﷺ) had touched, that he had seen Sa`d bin Abi Waqqas offering one rak`a only \nfor the witr prayer.","reference":"Sahih al-Bukhari 6356, Book 80, Hadith 53","grade":"","question #":"question #2","question":"How many rak'ahs are typically performed in the witr prayer?","id":"bukhari-80-160"},{"hadith-eng":"Ka`b bin 'Ujra met me and said, \"Shall I give you a present? Once the Prophet (ﷺ) came to us and we said, \n'O Allah's Messenger (ﷺ) ! We know how to greet you; but how to send 'Salat' upon you? He said, 'Say: \nAllahumma Salli ala Muhammadin wa 'ala `Ali Muhammadin, kama sal-laita 'ala all Ibrahima innaka \nHamidun Majid. Allahumma barik 'ala Muhammadin wa 'ala all Muhammadin, kama barakta 'ala all \nIbrahima, innaka Hamidun Majid.\"","reference":"Sahih al-Bukhari 6357, Book 80, Hadith 54","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) learn to send blessings upon him?","id":"bukhari-80-161"},{"hadith-eng":"We said, \"O Allah's Messenger (ﷺ) This is (i.e. we know) the greeting to you; will you tell us how to send \nSalat on you?\" He said, \"Say: 'Allahumma Salli 'ala Muhammadin `Abdika wa rasulika kama sal-laita \n'ala Ibrahima wa barik 'ala Muhammadin wa all Muhammadin kama barakta 'ala Ibrahima wa `Ali \nIbrahim.\"","reference":"Sahih al-Bukhari 6358, Book 80, Hadith 55","grade":"","question #":"question #2","question":"How does the invocation for blessings on the Prophet Muhammad (ﷺ) compare to that on Prophet Ibrahim (Abraham)?","id":"bukhari-80-162"},{"hadith-eng":"Whenever somebody brought alms to the Prophet (ﷺ) the used to say, \"Allahumma Salli 'Alaihi (O Allah! \nSend Your Salat (Grace and Honor) on him).\" Once when my father brought his alms to him, he said, \n\"O Allah! Send Your Salat (Grace and Honor) on the family of Abi `Aufa.\"","reference":"Sahih al-Bukhari 6359, Book 80, Hadith 56","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) express gratitude towards those who give charity?","id":"bukhari-80-163"},{"hadith-eng":"The people said, \"O Allah's Messenger (ﷺ) ! How may we send Salat on you?\" He said, \"Say: Allahumma \nSalli 'ala- Muhammadin wa azwajihi wa dhurriyyatihi kama sal-laita 'ala `Ali Ibrahim; wa barik 'ala \nMuhammadin wa azwajihi wa dhurriyyatihi kamabarakta 'ala `Ali Ibrahim innaka hamidun majid.\"","reference":"Sahih al-Bukhari 6360, Book 80, Hadith 57","grade":"","question #":"question #2","question":"How is the Salat on the Prophet Muhammad and his family performed according to the teachings of Islam?","id":"bukhari-80-164"},{"hadith-eng":"that he heard the Prophet (ﷺ) saying, \"O Allah! If I should ever abuse a believer, please let that be a means \nof bringing him near to You on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 6361, Book 80, Hadith 58","grade":"","question #":"question #2","question":"How can a believer's unintentional abuse be transformed into a positive outcome on the Day of Resurrection?","id":"bukhari-80-165"},{"hadith-eng":"Once the people started asking Allah's Messenger (ﷺ) questions, and they asked so many questions that he \nbecame angry and ascended the pulpit and said, \"I will answer whatever questions you may ask me \ntoday.\" I looked right and left and saw everyone covering his face with his garment and weeping. \nBehold ! There was a man who, on quarreling with the people, used to be called as a son of a person \nother than h is father. He said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your \nfather is Hudhaifa.\" And then `Umar got up and said, \"We accept Allah as our Lord, and Islam as \n(our) religion, and Muhammad as (our) Apostle; and we seek refuge with Allah from the afflictions.\" \nAllah's Messenger (ﷺ) said, \" I have never seen a day like today in its good and its evil for Paradise and the \nHell Fire were displayed in front of me, till I saw them just beyond this wall.\" Qatada, when relating \nthis Hadith, used to mention the following Verse:-- \n'O you who believe! Ask not questions about things which, If made plain to you, May cause you \ntrouble. (5.101)","reference":"Sahih al-Bukhari 6362, Book 80, Hadith 59","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to excessive questioning from his followers?","id":"bukhari-80-166"},{"hadith-eng":"The Prophet (ﷺ) said to Abu Talha, \"Choose one of your boys to serve me.\" So Abu Talha took me (to \nserve the Prophet (ﷺ) ) by giving me a ride behind him (on his camel). So I used to serve Allah's Messenger (ﷺ) \nwhenever he stayed somewhere. I used to hear him saying, \"O Allah! I seek refuge with you (Allah) \nfrom (worries) care and grief, from incapacity and laziness, from miserliness and cowardice, from \nbeing heavily in debt and from being overpowered by other men.\" I kept on serving him till he \nreturned from (the battle of) Khaibar. He then brought Safiya, the daughter of Huyay whom he had \ngot (from the booty). I saw him making a kind of cushion with a cloak or a garment for her. He then \nlet her ride behind him. When we reached a place called As-Sahba', he prepared (a special meal \ncalled) Hais, and asked me to invite the men who (came and) ate, and that was the marriage banquet \ngiven on the consummation of his marriage to her. Then he proceeded till the mountain of Uhud \nappeared, whereupon he said, \"This mountain loves us and we love it.\" When he approached Medina, \nhe said, \"O Allah! I make the land between its (i.e., Medina's) two mountains a sanctuary, as the \nprophet Abraham made Mecca a sanctuary. O Allah! Bless them (the people of Medina) in their Mudd \nand the Sa' (units of measuring).","reference":"Sahih al-Bukhari 6363, Book 80, Hadith 60","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate kindness and consideration towards his companions and family members?","id":"bukhari-80-167"},{"hadith-eng":"I heard the Prophet (ﷺ) seeking refuge with Allah from the punishment of the grave.","reference":"Sahih al-Bukhari 6364, Book 80, Hadith 61","grade":"","question #":"question #2","question":"Why is the punishment of the grave a concern in Islamic belief?","id":"bukhari-80-168"},{"hadith-eng":"Sa`d used to recommend five (statements) and mentioned that the Prophet (ﷺ) I used to recommend it. (It \nwas) \"O Allah! I seek refuge with You from miserliness; and seek refuge with You from cowardice; \nand seek refuge with You from being sent back to geriatric old age; and I seek refuge with You from \nthe affliction of this world (i.e., the affliction of Ad-Dajjal etc.); and seek refuge with You from the \npunishment of the grave.\"","reference":"Sahih al-Bukhari 6365, Book 80, Hadith 62","grade":"","question #":"question #2","question":"Why is it important to seek protection from miserliness and cowardice in Islamic teachings?","id":"bukhari-80-169"},{"hadith-eng":"Two old ladies from among the Jewish ladies entered upon me and said' \"The dead are punished in \ntheir graves,\" but I thought they were telling a lie and did not believe them in the beginning. When \nthey went away and the Prophet (ﷺ) entered upon me, I said, \"O Allah's Messenger (ﷺ)! Two old ladies..\" and \ntold him the whole story. He said, \"They told the truth; the dead are really punished, to the extent that \nall the animals hear (the sound resulting from) their punishment.\" Since then I always saw him \nseeking refuge with Allah from the punishment of the grave in his prayers.","reference":"Sahih al-Bukhari 6366, Book 80, Hadith 63","grade":"","question #":"question #2","question":"How does the belief in the punishment of the grave influence a Muslim's daily practices and prayers?","id":"bukhari-80-170"},{"hadith-eng":"Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from \ncowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I \nseek refuge with You from the afflictions of life and death.\"","reference":"Sahih al-Bukhari 6367, Book 80, Hadith 64","grade":"","question #":"question #2","question":"Why is it important to seek protection from the afflictions of life and death in Islamic teachings?","id":"bukhari-80-171"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness and geriatric old age, from \nall kinds of sins and from being in debt; from the trial and affliction of the grave and from the punishment in the \ngrave; from the affliction of the Fire and from the punishment of the \nFire; and from the evil of the affliction of wealth; and I seek refuge with You from the affliction of \npoverty, and I seek refuge with You from the affliction of Al-Mesiah Ad-Dajjal. O Allah! Wash away \nmy sins with the water of snow and hail, and cleanse my heart from all the sins as a white garment is \ncleansed from the filth, and let there be a long distance between me and my sins, as You made East \nand West far from each other.\"","reference":"Sahih al-Bukhari 6368, Book 80, Hadith 65","grade":"","question #":"question #2","question":"How does seeking refuge in Allah help in dealing with sins and their consequences?","id":"bukhari-80-172"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from worry and grief, from incapacity and \nlaziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by \n(other) men.\" (See Hadith No. 374)","reference":"Sahih al-Bukhari 6369, Book 80, Hadith 66","grade":"","question #":"question #2","question":"How can seeking refuge in Allah help in overcoming personal challenges such as worry and grief?","id":"bukhari-80-173"},{"hadith-eng":"Sa`d bin Abi Waqqas used to recommend these five (statements) and say that the Prophet (ﷺ) said so (and \nthey are): \"O Allah! I seek refuge with You from miserliness, and seek refuge with You from \ncowardice, and seek refuge with You from being brought back to geriatric old age, and seek refuge \nwith You from the afflictions of the world, and seek refuge with You from the punishment of the \ngrave.\"","reference":"Sahih al-Bukhari 6370, Book 80, Hadith 67","grade":"","question #":"question #2","question":"Why is it important to seek protection from miserliness and cowardice in Islamic teachings?","id":"bukhari-80-174"},{"hadith-eng":"Allah's Messenger (ﷺ) used to seek refuge with Allah saying, \"O Allah! I seek refuge with You from \nlaziness, and seek refuge with You from cowardice, and seek refuge with You from geriatric old age, \nand seek refuge with You from miserliness.\"","reference":"Sahih al-Bukhari 6371, Book 80, Hadith 68","grade":"","question #":"question #2","question":"Why is seeking refuge from laziness and cowardice significant in Islamic teachings?","id":"bukhari-80-175"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Make us love Medina as You made us love Mecca, or more, and transfer \nthe fever that is in it, to Al-Juhfa. O Allah! Bless our Mudd and our Sam' (kinds of measures).","reference":"Sahih al-Bukhari 6372, Book 80, Hadith 69","grade":"","question #":"question #2","question":"How does the Prophet's supplication reflect concern for the well-being and health of the inhabitants of Medina?","id":"bukhari-80-176"},{"hadith-eng":"that his father said, \"In the year of Hajjatal-Wada`, the Prophet (ﷺ) paid me a visit while I was suffering \nfrom an ailment that had brought me to the verge of death. I said, 'O Allah's Messenger (ﷺ)! My sickness has \nreduced me to the (bad) state as you see, and I am a rich man, but have no heirs except one daughter. \nShall I give 2/3 of my property in charity?' He said, 'No.' I said, 'Then 1/2 of it?' He said, 'Even 1/3 is \ntoo much, for, to leave your inheritors wealthy is better than to leave them in poverty, begging from \npeople. And (know that) whatever you spend in Allah's Cause, you will get reward for it, even for the \nmorsel of food which you put in your wife's mouth.' I said, 'O Allah's Messenger (ﷺ)! Will I be left behind \nmy companions (in Mecca)?' He said, 'If you remain behind, whatever good deed you will do for \nAllah's Sake, will raise and upgrade you to a higher position (in Allah's Sight). May be you will live \nlonger so that some people may benefit by you, and some e others (pagans) may get harmed by you. O \nAllah! Complete the migration of my companions and do not turn them on their heels; But (we pity) \nthe poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca)\" Allah's Messenger (ﷺ) lamented \n(or pitied) for him as he died in Mecca. (See Hadith No. 693, Vol. 5)","reference":"Sahih al-Bukhari 6373, Book 80, Hadith 70","grade":"","question #":"question #2","question":"How does Islam view the act of giving charity in relation to one's family obligations?","id":"bukhari-80-177"},{"hadith-eng":"Seek refuge with Allah by saying the words which the Prophet (ﷺ) used to say while seeking refuge with \nAllah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, \nand seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from \nthe afflictions of the world and from the punishment in the grave.\"","reference":"Sahih al-Bukhari 6374, Book 80, Hadith 71","grade":"","question #":"question #2","question":"Why is it important to seek protection from cowardice and miserliness in Islamic teachings?","id":"bukhari-80-178"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness from geriatric old age, from \nbeing in debt, and from committing sins. O Allah! I seek refuge with You from the punishment of the \nFire, the afflictions of the grave, the punishment in the grave, and the evil of the affliction of poverty \nand from the evil of the affliction caused by Al-Masih Ad-Dajjal. O Allah! Wash away my sins with \nthe water of snow and hail, and cleanse my heart from the sins as a white garment is cleansed of filth, \nand let there be a far away distance between me and my sins as You have set far away the East and the \nWest from each other.\"","reference":"Sahih al-Bukhari 6375, Book 80, Hadith 72","grade":"","question #":"question #2","question":"How does the Prophet describe the process of cleansing one's heart from sins?","id":"bukhari-80-179"},{"hadith-eng":"The Prophet (ﷺ) used to seek refuge with Allah (by saying), \"O Allah! I seek refuge with You from the \naffliction of the Fire and from the punishment in the Fire, and seek refuge with You from the affliction \nof the grave, and I seek refuge with You from the affliction of wealth, and I seek refuge with You \nfrom the affliction of poverty, and seek refuge with You from the affliction of Al-Masih Ad-Dajjal.\"","reference":"Sahih al-Bukhari 6376, Book 80, Hadith 73","grade":"","question #":"question #2","question":"Why is seeking refuge from the afflictions of wealth and poverty significant in Islamic teachings?","id":"bukhari-80-180"},{"hadith-eng":"The Prophet (ﷺ) used to say, 'O Allah! I seek refuge with You from the affliction of the Fire, the \npunishment of the Fire, the affliction of the grave, the punishment of the grave, and the evil of the \naffliction of poverty. O Allah! I seek refuge with You from the evil of the affliction of Al-Masih Ad- \nDajjal, O Allah! Cleanse my heart with the water of snow and hail, and cleanse my heart from all sins \nas a white garment is cleansed from filth, and let there be a far away distance between me and my sins \nas You made the East and West far away from each other. O Allah! I seek refuge with You from \nlaziness, sins, and from being in debt.\"","reference":"Sahih al-Bukhari 6377, Book 80, Hadith 74","grade":"","question #":"question #2","question":"How does the Prophet (ﷺ) describe the process of cleansing the heart from sins in his prayers?","id":"bukhari-80-181"},{"hadith-eng":"that she said, \"O Allah's Messenger (ﷺ)! Anas is your servant, so please invoke for Allah's blessing for him.\" \nThe Prophet (ﷺ) said, \"O Allah! Increase his wealth and offspring and bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6378, 6379, Book 80, Hadith 75","grade":"","question #":"question #2","question":"How can prayers for increased wealth and offspring be understood in the context of Islamic teachings?","id":"bukhari-80-182"},{"hadith-eng":"Um Sulaim said (to the Prophet), \"Anas is your servant; so please invoke for Allah's blessings for \nhim.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6380, 6381, Book 80, Hadith 76","grade":"","question #":"question #2","question":"How can supplications impact a person's wealth and offspring according to Islamic teachings?","id":"bukhari-80-183"},{"hadith-eng":"Um Sulaim said (to the Prophet), \"Anas is your servant; so please invoke for Allah's blessings for \nhim.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6380, 6381, Book 80, Hadith 76","grade":"","question #":"question #2","question":"How can a prayer for increased wealth and offspring be understood in the context of Islamic teachings?","id":"bukhari-80-184"},{"hadith-eng":"The Prophet (ﷺ) used to teach us the Istikhara for each and every matter as he used to teach us the Suras \nfrom the Holy Qur'an. (He used to say), \"If anyone of you intends to do something, he should offer a \ntwo-rak`at prayer other than the obligatory prayer, and then say: 'Allahumma inni astakhiruka \nbi'ilmika, wa astaqdiruka biqudratika, wa as'aluka min fadlika-l-'azim, fa innaka taqdiru wala aqdiru, \nwa ta'lamu wala a'lamu, wa anta'allamu-l-ghuyub. Allahumma in kunta ta'lamu anna hadha-lamra \nkhairun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi 'ajili `Amri wa ajilihi) fa-qdurhu li, Wa in \nkunta ta'lamu anna ha-dha-l-amra sharrun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi ajili `Amri \nwa ajilihi) fasrifhu 'anni was-rifni 'anhu wa aqdur li alkhaira haithu kana, thumma Raddani bihi,\" Then \nhe should mention his matter (need).","reference":"Sahih al-Bukhari 6382, Book 80, Hadith 77","grade":"","question #":"question #2","question":"What is the procedure for performing Istikhara prayer according to Islamic teachings?","id":"bukhari-80-185"},{"hadith-eng":"The Prophet (ﷺ) asked for some water and performed the ablution, and then raised his hands (towards the \nsky) and said, \"O Allah! Forgive `Ubaid Abi 'Amir.\" I saw the whiteness of his armpits (while he was \nraising his hands) and he added, \"O Allah! Upgrade him over many of Your human creatures on the \nDay of Resurrection.\"","reference":"Sahih al-Bukhari 6383, Book 80, Hadith 78","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate the act of seeking forgiveness for others?","id":"bukhari-80-186"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on a journey, and whenever we ascended a high place, we \nused to say Takbir (in a loud voice). The Prophet (ﷺ) said, \"O people! Be kind to yourselves, for you are \nnot calling upon a deaf or an absent one, but You are calling an All-Hearer, and an All-Seer.\" Then he \ncame to me as I was reciting silently, \"La haul a wala quwwata illa bil-lah.\" He said, \"O `Abdullah bin \nQais! Say: La haul a walaquwata illa bil-lah, for it is one of the treasures of Paradise.\" Or he said, \n\"Shall I tell you a word which is one of the treasures of Paradise? It is: La haul a wala quwwata illa \nbil-lah.\"","reference":"Sahih al-Bukhari 6384, Book 80, Hadith 79","grade":"","question #":"question #2","question":"How does the concept of Allah being All-Hearer and All-Seer affect the way Muslims should call upon Him?","id":"bukhari-80-187"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa or Hajj or `Umra, he used to say, \"Allahu Akbar,\" \nthree times; whenever he went up a high place, he used to say, \"La ilaha illal-lahu wahdahu la sharika \nlahu, lahu-l-mulk wa lahu-l-hamd, wa huwa'ala kulli Shai 'in qadir. Ayibuna ta'ibuna 'abiduna \nlirabbina hamidun. Sadaqa-l-lahu wa'dahu, wa nasara`Abdahu wa hazama-l-ahzaba wahdahu.\"","reference":"Sahih al-Bukhari 6385, Book 80, Hadith 80","grade":"","question #":"question #2","question":"What is the significance of saying 'Allahu Akbar' three times in Islamic practice?","id":"bukhari-80-188"},{"hadith-eng":"The Prophet (ﷺ) seeing a yellow mark (of perfume) on the clothes of `Abdur-Rahman bin `Auf, said, \n\"What about you?\" `Abdur-Rahman replied, \"I have married a woman with a Mahr of gold equal to a \ndate-stone.\" The Prophet (ﷺ) said, \"May Allah bestow His Blessing on you (in your marriage). Give a \nwedding banquet, (Walima) even with one sheep.\"","reference":"Sahih al-Bukhari 6386, Book 80, Hadith 81","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) view the use of perfume or adornment in relation to marriage?","id":"bukhari-80-189"},{"hadith-eng":"My father died and left behind seven or nine daughters, and I married a woman. The Prophet (ﷺ) said, \n\"Did you get married, O Jabir?\" I replied, \"Yes.\" He asked, \"Is she a virgin or a matron?\" I replied, \n\"She is a matron.\" He said, \"Why didn't you marry a virgin girl so that you might play with her and \nshe with you (or, you might make her laugh and she make you laugh)?\" I said, \"My father died, \nleaving seven or nine girls (orphans) and I did not like to bring a young girl like them, so I married a \nwoman who can look after them.\" He said, \"May Allah bestow His Blessing on you.\"","reference":"Sahih al-Bukhari 6387, Book 80, Hadith 82","grade":"","question #":"question #2","question":"How can marriage decisions be influenced by family responsibilities and the welfare of siblings?","id":"bukhari-80-190"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you, when intending to have a sexual intercourse with his wife, says: \n'Bismillah, Allahumma jannibna-sh-shaitan, wa jannibi-sh-shaitan ma razaqtana,' and if the couple are \ndestined to have a child (out of that very sexual relation), then Satan will never be able to harm that \nchild.\"","reference":"Sahih al-Bukhari 6388, Book 80, Hadith 83","grade":"","question #":"question #2","question":"How can a supplication protect a child from the influence of Satan according to Islamic teachings?","id":"bukhari-80-191"},{"hadith-eng":"The most frequent invocation of The Prophet (ﷺ) was: \"O Allah! Give to us in the world that which is \ngood and in the Hereafter that which is good, and save us from the torment of the Fire.\" (2.201)","reference":"Sahih al-Bukhari 6389, Book 80, Hadith 84","grade":"","question #":"question #2","question":"How does seeking protection from the torment of the Fire reflect the priorities in a Muslim's prayers?","id":"bukhari-80-192"},{"hadith-eng":"The Prophet (ﷺ) used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek \nrefuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with \nYou from being brought back to (senile) geriatric old age, and seek refuge with You from the \naffliction of the world and from the punishment in the Hereafter.\"","reference":"Sahih al-Bukhari 6390, Book 80, Hadith 85","grade":"","question #":"question #2","question":"Why is it important to seek refuge from miserliness and cowardice in Islamic teachings?","id":"bukhari-80-193"},{"hadith-eng":"that Allah's Messenger (ﷺ) was affected by magic, so much that he used to think that he had done something \nwhich in fact, he did not do, and he invoked his Lord (for a remedy). Then (one day) he said, \"O \n`Aisha!) Do you know that Allah has advised me as to the problem I consulted Him about?\" `Aisha \nsaid, \"O Allah's Messenger (ﷺ)! What's that?\" He said, \"Two men came to me and one of them sat at my \nhead and the other at my feet, and one of them asked his companion, 'What is wrong with this man?' \nThe latter replied, 'He is under the effect of magic.' The former asked, 'Who has worked magic on \nhim?' The latter replied, 'Labid bin Al-A'sam.' The former asked, 'With what did he work the magic?' \nThe latter replied, 'With a comb and the hair, which are stuck to the comb, and the skin of pollen of a \ndate-palm tree.' The former asked, 'Where is that?' The latter replied, 'It is in Dharwan.' Dharwan was \na well in the dwelling place of the (tribe of) Bani Zuraiq. Allah's Messenger (ﷺ) went to that well and \nreturned to `Aisha, saying, 'By Allah, the water (of the well) was as red as the infusion of Hinna, (1) \nand the date-palm trees look like the heads of devils.' `Aisha added, Allah's Messenger (ﷺ) came to me and \ninformed me about the well. I asked the Prophet, 'O Allah's Messenger (ﷺ), why didn't you take out the skin \nof pollen?' He said, 'As for me, Allah has cured me and I hated to draw the attention of the people to \nsuch evil (which they might learn and harm others with).' \" \nNarrated Hisham's father: `Aisha said, \"Allah's Messenger (ﷺ) was bewitched, so he invoked Allah \nrepeatedly requesting Him to cure him from that magic).\" Hisham then narrated the above narration. \n(See Hadith No. 658, Vol. 7)","reference":"Sahih al-Bukhari 6391, Book 80, Hadith 86","grade":"","question #":"question #2","question":"What measures did the Prophet Muhammad (ﷺ) take to seek a remedy for the effects of magic?","id":"bukhari-80-194"},{"hadith-eng":"Allah's Messenger (ﷺ) asked for Allah's wrath upon the Ahzab (confederates), saying, \"O Allah, the Revealer \nof the Holy Book, and the One swift at reckoning! Defeat the confederates; Defeat them and shake \nthem.\"","reference":"Sahih al-Bukhari 6392, Book 80, Hadith 87","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) seek divine assistance against his adversaries?","id":"bukhari-80-195"},{"hadith-eng":"When the Prophet (ﷺ) said, \"Sami' al-lahu liman hamidah (Allah heard him who sent his praises to Him)\" \nin the last rak`a of the `Isha' prayer, he used to invoke Allah, saying, \"O Allah! Save `Aiyash bin Abi \nRabi`a; O Allah! Save Al-Walid bin Al-Walid; O Allah! Save the weak people among the believers; O \nAllah! Be hard on the Tribe of Mudar; O Allah! Inflict years of drought upon them like the years (of \ndrought) of the Prophet (ﷺ) Joseph.\"","reference":"Sahih al-Bukhari 6393, Book 80, Hadith 88","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate concern for the well-being of the weak among the believers?","id":"bukhari-80-196"},{"hadith-eng":"The Prophet (ﷺ) sent a Sariya (an army detachment) consisting of men called Al-Qurra', and all of them \nwere martyred. I had never seen the Prophet (ﷺ) so sad over anything as he was over them. So he said \nQunut (invocation in the prayer) for one month in the Fajr prayer, invoking for Allah's wrath upon the \ntribe of 'Usaiya, and he used to say, \"The people of 'Usaiya have disobeyed Allah and His Apostle.\"","reference":"Sahih al-Bukhari 6394, Book 80, Hadith 89","grade":"","question #":"question #2","question":"How did the Prophet express his grief and seek divine intervention after the loss of his companions?","id":"bukhari-80-197"},{"hadith-eng":"The Jews used to greet the Prophet (ﷺ) by saying, \"As-Samu 'Alaika (i.e., death be upon you), so I \nunderstood what they said, and I said to them, \"As-Samu 'alaikum wal-la'na (i.e. Death and Allah's \nCurse be upon you).\" The Prophet (ﷺ) said, \"Be gentle and calm, O `Aisha, as Allah likes gentleness in all \naffairs.\" I said, \"O Allah's Prophet! Didn't you hear what they said?\" He said, \"Didn't you hear me \nanswering them back by saying, 'Alaikum (i.e., the same be upon you)?\"","reference":"Sahih al-Bukhari 6395, Book 80, Hadith 90","grade":"","question #":"question #2","question":"What is the appropriate way to respond to hostility or insults according to Islamic teachings?","id":"bukhari-80-198"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on the day (of the battle) of Al-Khandaq (the Trench). The \nProphet said, \"May Allah fill their (the infidels') graves and houses with fire, as they have kept us so \nbusy that we could not offer the middle prayer till the sun had set; and that prayer was the `Asr \nprayer.\"","reference":"Sahih al-Bukhari 6396, Book 80, Hadith 91","grade":"","question #":"question #2","question":"What is the significance of the 'Asr prayer in Islam, and how does missing it impact a believer?","id":"bukhari-80-199"},{"hadith-eng":"at-Tufail bin `Amr came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The tribe of Daus has \ndisobeyed (Allah and His Apostle) and refused (to embrace Islam), therefore, invoke Allah's wrath for \nthem.\" The people thought that the Prophet (ﷺ) would invoke Allah's wrath for them, but he said, \"O \nAllah! Guide the tribe Of Daus and let them come to us.\"","reference":"Sahih al-Bukhari 6397, Book 80, Hadith 92","grade":"","question #":"question #2","question":"What is the significance of praying for guidance instead of punishment for those who refuse to embrace Islam?","id":"bukhari-80-200"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah with the following invocation: 'Rabbi-ghfir-li Khati 'ati wa jahli wa \nisrafi fi `Amri kullihi, wa ma anta a'lamu bihi minni. Allahumma ighfirli khatayaya wa 'amdi, wa jahli \nwa jiddi, wa kullu dhalika'indi. Allahumma ighrifli ma qaddamtu wa ma akhartu wa ma asrartu wa ma \na'lantu. Anta-l-muqaddimu wa anta-l-mu'akh-khiru, wa anta 'ala kulli shai'in qadir.'","reference":"Sahih al-Bukhari 6398, Book 80, Hadith 93","grade":"","question #":"question #2","question":"How does the Prophet (ﷺ) acknowledge his own limitations and seek Allah's forgiveness for both known and unknown faults?","id":"bukhari-80-201"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah, saying, \"Allahumma ighfirli khati'ati wa jahli wa israfi fi `Amri, wa \nma anta a-'lamu bihi minni. Allahumma ighfirli hazali wa jiddi wa khata'i wa amdi, wa kullu dhalika \n'indi.\"","reference":"Sahih al-Bukhari 6399, Book 80, Hadith 94","grade":"","question #":"question #2","question":"How does the Prophet's invocation reflect the comprehensive nature of seeking forgiveness in Islam?","id":"bukhari-80-202"},{"hadith-eng":"Abu-l-Qasim (the Prophet) said, \"On Friday there is a particular time. If a Muslim happens to be \npraying and invoking Allah for something good during that time, Allah will surely fulfill his request.\" \nThe Prophet (ﷺ) pointed out with his hand. We thought that he wanted to illustrate how short that time \nwas.","reference":"Sahih al-Bukhari 6400, Book 80, Hadith 95","grade":"","question #":"question #2","question":"How does the timing of a prayer affect its acceptance according to Islamic teachings?","id":"bukhari-80-203"},{"hadith-eng":"`Aisha said, \"The Jews came to the Prophet (ﷺ) and said to him, \"As-Samu 'Alaika (i.e., Death be upon \nyou).\" He replied, 'The same on you.' \" `Aisha said to them, \"Death be upon you, and may Allah curse \nyou and shower His wrath upon you!\" Allah's Messenger (ﷺ) I said, \"Be gentle and calm, O `Aisha! Be \ngentle and beware of being harsh and of saying evil things.\" She said, \"Didn't you hear what they \nsaid?\" He said, \"Didn't you hear what I replied (to them)? have returned their statement to them, and \nmy invocation against them will be accepted but theirs against me will not be accepted.\"","reference":"Sahih al-Bukhari 6401, Book 80, Hadith 96","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate the importance of avoiding harshness in speech?","id":"bukhari-80-204"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the Imam says 'Amin', then you should all say 'Amin', for the angels say \n'Amin' at that time, and he whose 'Amin' coincides with the 'Amin' of the angels, all his past sins will \nbe forgiven.\"","reference":"Sahih al-Bukhari 6402, Book 80, Hadith 97","grade":"","question #":"question #2","question":"How does the timing of saying 'Amin' affect the forgiveness of sins?","id":"bukhari-80-205"},{"hadith-eng":"Allah's Messenger (ﷺ) said,\" Whoever says: \"La ilaha illal-lah wahdahu la sharika lahu, lahu-l-mulk wa lahul- \nhamd wa huwa 'ala kulli shai'in qadir,\" one hundred times will get the same reward as given for \nmanumitting ten slaves; and one hundred good deeds will be written in his accounts, and one hundred \nsins will be deducted from his accounts, and it (his saying) will be a shield for him from Satan on that \nday till night, and nobody will be able to do a better deed except the one who does more than he.\"","reference":"Sahih al-Bukhari 6403, Book 80, Hadith 98","grade":"","question #":"question #2","question":"How does the recitation of a specific phrase act as a protection against Satan throughout the day?","id":"bukhari-80-206"},{"hadith-eng":"Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted \none of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet (ﷺ) saying, \n\"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"","reference":"Sahih al-Bukhari 6404, Book 80, Hadith 99","grade":"","question #":"question #2","question":"How is the act of manumitting a descendant of Ishmael viewed in Islamic teachings?","id":"bukhari-80-207"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever says, 'Subhan Allah wa bihamdihi,' one hundred times a day, will be \nforgiven all his sins even if they were as much as the foam of the sea.","reference":"Sahih al-Bukhari 6405, Book 80, Hadith 100","grade":"","question #":"question #2","question":"How does the repetition of certain phrases contribute to the forgiveness of sins in Islam?","id":"bukhari-80-208"},{"hadith-eng":"The Prophet (ﷺ) said, \"There are two expressions which are very easy for the tongue to say, but they are \nvery heavy in the balance and are very dear to The Beneficent (Allah), and they are, 'Subhan Allah Al- \n`Azim and 'Subhan Allah wa bihamdihi.'\"","reference":"Sahih al-Bukhari 6406, Book 80, Hadith 101","grade":"","question #":"question #2","question":"Why are the phrases 'Subhan Allah Al-`Azim' and 'Subhan Allah wa bihamdihi' considered dear to Allah?","id":"bukhari-80-209"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of the one who celebrates the Praises of his Lord (Allah) in \ncomparison to the one who does not celebrate the Praises of his Lord, is that of a living creature \ncompared to a dead one.\"","reference":"Sahih al-Bukhari 6407, Book 80, Hadith 102","grade":"","question #":"question #2","question":"How does the act of celebrating the praises of Allah affect a person's spiritual state?","id":"bukhari-80-210"},{"hadith-eng":"Allah 's Apostle said, \"Allah has some angels who look for those who celebrate the Praises of Allah \non the roads and paths. And when they find some people celebrating the Praises of Allah, they call \neach other, saying, \"Come to the object of your pursuit.' \" He added, \"Then the angels encircle them \nwith their wings up to the sky of the world.\" He added. \"(after those people celebrated the Praises of \nAllah, and the angels go back), their Lord, asks them (those angels)----though He knows better than \nthem----'What do My slaves say?' The angels reply, 'They say: Subhan Allah, Allahu Akbar, and \nAlham-du-li l-lah, Allah then says 'Did they see Me?' The angels reply, 'No! By Allah, they didn't see \nYou.' \nAllah says, How it would have been if they saw Me?' The angels reply, 'If they saw You, they would \nworship You more devoutly and celebrate Your Glory more deeply, and declare Your freedom from \nany resemblance to anything more often.' Allah says (to the angels), 'What do they ask Me for?' The \nangels reply, 'They ask You for Paradise.' Allah says (to the angels), 'Did they see it?' The angels say, \n'No! By Allah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The \nangels say, 'If they saw it, they would have greater covetousness for it and would seek It with greater \nzeal and would have greater desire for it.' Allah says, 'From what do they seek refuge?' The angels \nreply, 'They seek refuge from the (Hell) Fire.' Allah says, 'Did they see it?' The angels say, 'No By \nAllah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The angels \nsay, 'If they saw it they would flee from it with the extreme fleeing and would have extreme fear from \nit.' Then Allah says, 'I make you witnesses that I have forgiven them.\"' Allah's Messenger (ﷺ) added, \"One of \nthe angels would say, 'There was so-and-so amongst them, and he was not one of them, but he had just \ncome for some need.' Allah would say, 'These are those people whose companions will not be reduced \nto misery.' \"","reference":"Sahih al-Bukhari 6408, Book 80, Hadith 103","grade":"","question #":"question #2","question":"How does the act of praising Allah influence one's spiritual state and relationship with the divine?","id":"bukhari-80-211"},{"hadith-eng":"The Prophet (ﷺ) started ascending a high place or hill. A man (amongst his companions) ascended it and \nshouted in a loud voice, \"La ilaha illal-lahu wallahu Akbar.\" (At that time) Allah's Messenger (ﷺ) was riding \nhis mule. Allah's Messenger (ﷺ) said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu \nMusa (or, O `Abdullah)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He \nsaid, \"La haul a wala quwwata illa billah,\"","reference":"Sahih al-Bukhari 6409, Book 80, Hadith 104","grade":"","question #":"question #2","question":"How does the hadith emphasize the closeness of Allah to His servants?","id":"bukhari-80-212"},{"hadith-eng":"Allah has ninety-nine Names, i.e., one hundred minus one, and whoever believes in their meanings \nand acts accordingly, will enter Paradise; and Allah is witr (one) and loves 'the witr' (i.e., odd \nnumbers).","reference":"Sahih al-Bukhari 6410, Book 80, Hadith 105","grade":"","question #":"question #2","question":"How does the concept of 'witr' relate to Allah's attributes and preferences?","id":"bukhari-80-213"},{"hadith-eng":"While we were waiting for `Abdullah (bin Mas`ud). Yazid bin Muawiya came. I said (to him), \"Will \nyou sit down?\" He said, \"No, but I will go into the house (of Ibn Mas`ud) and let your companion (Ibn \nMas`ud) come out to you; and if he should not (come out), I will come out and sit (with you).\" Then \n`Abdullah came out, holding the hand of Yazid, addressed us, saying, \"I know that you are assembled \nhere, but the reason that prevents me from coming out to you, is that Allah's Messenger (ﷺ) used to preach to \nus at intervals during the days, lest we should become bored.\"","reference":"Sahih al-Bukhari 6411, Book 80, Hadith 106","grade":"","question #":"question #2","question":"What can be the impact of frequent preaching on the audience according to Islamic teachings?","id":"bukhari-80-214"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"For every prophet there is one (special \n     invocation (that will not be rejected) with which he appeals (to \n     Allah), and I want to keep such an invocation for interceding for my \n     followers in the Hereafter.\"","reference":"Sahih al-Bukhari 6304, Book 80, Hadith 1","grade":"","question #":"question #3","question":"What does the desire of the Prophet Muhammad (ﷺ) to reserve his special invocation for his followers indicate about his concern for them?","id":"bukhari-80-215"},{"hadith-eng":"that the Prophet (ﷺ) said, \"For every prophet there is an invocation that \n     surely will be responded by Allah,\" (or said), \"For every prophet \n     there was an invocation with which he appealed to Allah, and his \n     invocation was accepted (in his lifetime), but I kept my (this \n     special) invocation to intercede for my followers on the Day of \n     Resurrection.\"","reference":"Sahih al-Bukhari 6305, Book 80, Hadith 2","grade":"","question #":"question #3","question":"What does this narration imply about the unique privileges granted to prophets in Islam?","id":"bukhari-80-216"},{"hadith-eng":"The Prophet (ﷺ) said \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta \nRabbi la ilaha illa anta, Khalaqtani wa ana `Abduka, wa ana `ala `ahdika wa wa`dika mastata`tu, \nA`udhu bika min Sharri ma sana`tu, abu'u Laka bini`matika `alaiya, wa abu'u laka bidhanbi faghfir lee \nfa innahu la yaghfiru adhdhunuba illa anta.\" The Prophet (ﷺ) added. \"If somebody recites it during the day \nwith firm faith in it, and dies on the same day before the evening, he will be from the people of \nParadise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will \nbe from the people of Paradise.\"","reference":"Sahih al-Bukhari 6306, Book 80, Hadith 3","grade":"","question #":"question #3","question":"How does one's faith impact the effectiveness of supplications for forgiveness?","id":"bukhari-80-217"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying.\" By Allah! I ask for forgiveness from Allah and turn to Him in \nrepentance more than seventy times a day.\"","reference":"Sahih al-Bukhari 6307, Book 80, Hadith 4","grade":"","question #":"question #3","question":"How does the practice of seeking forgiveness reflect on a person's relationship with Allah?","id":"bukhari-80-218"},{"hadith-eng":"`Abdullah bin Mas`ud related to us two narrations: One from the Prophet (ﷺ) and the other from himself, \nsaying: A believer sees his sins as if he were sitting under a mountain which, he is afraid, may fall on \nhim; whereas the wicked person considers his sins as flies passing over his nose and he just drives \nthem away like this.\" Abu Shihab (the sub-narrator) moved his hand over his nose in illustration. (Ibn \nMas`ud added): Allah's Messenger (ﷺ) said, \"Allah is more pleased with the repentance of His slave than a \nman who encamps at a place where his life is jeopardized, but he has his riding beast carrying his food \nand water. He then rests his head and sleeps for a short while and wakes to find his riding beast gone. \n(He starts looking for it) and suffers from severe heat and thirst or what Allah wished (him to suffer \nfrom). He then says, 'I will go back to my place.' He returns and sleeps again, and then (getting up), he \nraises his head to find his riding beast standing beside him.\"","reference":"Sahih al-Bukhari 6308, Book 80, Hadith 5","grade":"","question #":"question #3","question":"What lesson can be learned about the importance of repentance in Islam?","id":"bukhari-80-219"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah is more pleased with the repentance of His slave than anyone of you is \npleased with finding his camel which he had lost in the desert. \"","reference":"Sahih al-Bukhari 6309, Book 80, Hadith 6","grade":"","question #":"question #3","question":"Why is repentance considered significant in Islam?","id":"bukhari-80-220"},{"hadith-eng":"The Prophet (ﷺ) used to pray eleven rak`at in the late part of the night, and when dawn appeared, he \nwould offer two rak`at and then lie on his right side till the Muadhdhin came to inform him (that the \nmorning prayer was due).","reference":"Sahih al-Bukhari 6310, Book 80, Hadith 7","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) prepare for the morning prayer after performing night prayers?","id":"bukhari-80-221"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"When you want to go to bed, perform ablution as you do for prayer, then \r\nlie down on your right side and say: 'Allahumma aslamtu wajhi ilaika, wa fawwadtu 'amri ilaika wa \r\nalja'tu dhahri ilaika, raghbatan wa rahbatan ilaika, la malja'a wa la manja minka illa ilaika. Amantu \r\nbikitabik al-ladhi anzalta wa binabiyyika al-ladhi arsalta'. If you should die then (after reciting this) you \r\nwill die on the religion of Islam (i.e., as a Muslim); so let these words be the last you say (before \r\ngoing to bed)\" While I was memorizing it, I said, \"Wa birasulika al-ladhi arsalta (in Your Apostle \r\nwhom You have sent).' The Prophet (ﷺ) said, \"No, but say: Wa binabiyyika al-ladhi arsalta (in Your \r\nProphet whom You have sent).","reference":"Sahih al-Bukhari 6311, Book 80, Hadith 8","grade":"","question #":"question #3","question":"How does the choice of words in supplications reflect one's faith in Islam?","id":"bukhari-80-222"},{"hadith-eng":"When the Prophet (ﷺ) went to bed, he would say: \"Bismika amutu wa ahya.\" and when he got up he \nwould say:\" Al-hamdu li l-lahil-ladhi ahyana ba'da ma amatana wa ilaihin-nushur.\"","reference":"Sahih al-Bukhari 6312, Book 80, Hadith 9","grade":"","question #":"question #3","question":"What is the significance of acknowledging life and death in daily supplications?","id":"bukhari-80-223"},{"hadith-eng":"That the Prophet (ﷺ) advised a man, saying, \"If you intend to lie down (i.e. go to bed), say, 'Allahumma \naslamtu nafsi ilaika wa fauwadtu `Amri ilaika, wa wajjahtu wajhi ilaika wa alja'tu zahri ilaika, \nreghbatan wa rahbatan ilaika. La malja'a wa la manja minka illa ilaika. Amantu bikitabikal-ladhi \nanzalta; wa nabiyyikalladhi arsalta.' And if you should die then (after reciting this before going to bed) \nyou will die on the religion of Islam\"","reference":"Sahih al-Bukhari 6313, Book 80, Hadith 10","grade":"","question #":"question #3","question":"What are the benefits of reciting a particular dua before sleeping in terms of one's faith?","id":"bukhari-80-224"},{"hadith-eng":"When the Prophet (ﷺ) went to bed at night, he would put his hand under his cheek and then say, \n\"Allahumma bismika amutu wa ahya,\" and when he got up, he would say, \"Al-Hamdu lil-lahi al-ladhi \nahyana ba'da ma amatana, wa ilaihi an-nushur.\"","reference":"Sahih al-Bukhari 6314, Book 80, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of the Prophet (ﷺ) placing his hand under his cheek before sleeping?","id":"bukhari-80-225"},{"hadith-eng":"When Allah's Messenger (ﷺ) went to bed, he used to sleep on his right side and then say, \"All-ahumma \naslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu zahri ilaika, \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Amantu bikitabika al-ladhi \nanzalta wa nabiyyika al-ladhi arsalta! Allah's Messenger (ﷺ) said, \"Whoever recites these words (before \ngoing to bed) and dies the same night, he will die on the Islamic religion (as a Muslim).","reference":"Sahih al-Bukhari 6315, Book 80, Hadith 12","grade":"","question #":"question #3","question":"What is the importance of entrusting oneself to Allah before sleeping according to Islamic teachings?","id":"bukhari-80-226"},{"hadith-eng":"One night I slept at the house of Maimuna. The Prophet (ﷺ) woke up, answered the call of nature, washed \nhis face and hands, and then slept. He got up (late at night), went to a water skin, opened the mouth \nthereof and performed ablution not using much water, yet he washed all the parts properly and then \noffered the prayer. I got up and straightened my back in order that the Prophet (ﷺ) might not feel that I \nwas watching him, and then I performed the ablution, and when he got up to offer the prayer, I stood on \nhis left. He caught hold of my ear and brought me over to his right side. He offered thirteen rak`at in \nall and then lay down and slept till he started blowing out his breath as he used to do when he slept. In \nthe meantime Bilal informed the Prophet (ﷺ) of the approaching time for the (Fajr) prayer, and the \nProphet offered the Fajr (Morning) prayer without performing new ablution. He used to say in his \ninvocation, Allahumma ij`al fi qalbi nuran wa fi basari nuran, wa fi sam`i nuran, wa`an yamini nuran, \nwa`an yasari nuran, wa fawqi nuran, wa tahti nuran, wa amami nuran, wa khalfi nuran, waj`al li \nnuran.\" Kuraib (a sub narrator) said, \"I have forgotten seven other words, (which the Prophet (ﷺ) \nmentioned in this invocation). I met a man from the offspring of Al-`Abbas and he narrated those \nseven things to me, mentioning, '(Let there be light in) my nerves, my flesh, my blood, my hair and \nmy body,' and he also mentioned two other things.\"","reference":"Sahih al-Bukhari 6316, Book 80, Hadith 13","grade":"","question #":"question #3","question":"What is the significance of the invocation for light in various parts of the body as mentioned by the Prophet Muhammad (ﷺ)?","id":"bukhari-80-227"},{"hadith-eng":"When the Prophet (ﷺ) got up at night to offer the night prayer, he used to say: \"Allahumma laka l-hamdu; \nAnta nuras-samawati wal ardi wa man fihinna. wa laka l-hamdu; Anta qaiyim as-samawati wal ardi \nwa man flhinna. Wa lakaI-hamdu; Anta-l-,haqqun, wa wa'daka haqqun, wa qauluka haqqun, wa \nliqauka haqqun, wal-jannatu haqqun, wannaru haqqun, was-sa atu haqqun, wan-nabiyyuna huqqun, \nMahammadun haqqun, Allahumma laka aslamtu, wa Alaika tawakkaltu, wa bika amantu, wa ilaika \nanabtu, wa bika Khasamtu, wa ilaika hakamtu, faghfirli ma qaddamtu wa ma akh-khartu, wa ma \nasrartu, wa ma a'lantu. Anta al-muqaddimu, wa anta al-mu-'akhkhiru. La ilaha il-la anta (or La ilaha \nghairuka)\"","reference":"Sahih al-Bukhari 6317, Book 80, Hadith 14","grade":"","question #":"question #3","question":"What elements of faith and belief are affirmed in the Prophet's night prayer supplication?","id":"bukhari-80-228"},{"hadith-eng":"Fatima complained about the blisters on her hand because of using a mill-stone. She went to ask the \nProphet for servant, but she did not find him (at home) and had to inform `Aisha of her need. When he \ncame, `Aisha informed him about it. `Ali added: The Prophet (ﷺ) came to us when we had gone to our \nbeds. When I was going to get up, he said, \"'Stay in your places,\" and sat between us, till I felt the \ncoolness of the feet on my chest. The Prophet (ﷺ) then said, \"Shall I not tell you of a thing which is better \nfor you than a servant? When you (both) go to your beds, say 'Allahu Akbar' thirty-three times, and \n'Subhan Allah' thirty-three times, 'Al hamdu 'illah' thirty-three times, for that is better for you than a \nservant.\" Ibn Seereen said, \"Subhan Allah' (is to be said for) thirty-four times.\"","reference":"Sahih al-Bukhari 6318, Book 80, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of reciting 'Allahu Akbar', 'Subhan Allah', and 'Al hamdu 'illah' before sleeping in Islam?","id":"bukhari-80-229"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) went to bed, he used to blow on his hands while reciting the Mu'auwidhat ( \ni.e. Suratal-Falaq 113 and Surat-an-Nas 114) and then pass his hands over his body.","reference":"Sahih al-Bukhari 6319, Book 80, Hadith 16","grade":"","question #":"question #3","question":"What practices can be derived from the Prophet's bedtime routine for spiritual protection?","id":"bukhari-80-230"},{"hadith-eng":"The Prophet (ﷺ) said, \"When anyone of you go to bed, he should shake out his bed with the inside of his \nwaist sheet, for he does not know what has come on to it after him, and then he should say: 'Bismika \nRabbi Wada`tu Janbi wa bika arfa'uhu, In amsakta nafsi farhamha wa in arsaltaha fahfazha bima \ntahfazu bihi ibadakas-salihin.\"","reference":"Sahih al-Bukhari 6320, Book 80, Hadith 17","grade":"","question #":"question #3","question":"How does Islam emphasize cleanliness and safety in daily routines such as sleeping?","id":"bukhari-80-231"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When it is the last third of the night, our Lord, the Blessed, the Superior, \ndescends every night to the heaven of the world and says, 'Is there anyone who invokes Me (demand \nanything from Me), that I may respond to his invocation; Is there anyone who asks Me for something \nthat I may give (it to) him; Is there anyone who asks My forgiveness that I may forgive him?' \"","reference":"Sahih al-Bukhari 6321, Book 80, Hadith 18","grade":"","question #":"question #3","question":"What actions are encouraged during the last third of the night according to Islamic teachings?","id":"bukhari-80-232"},{"hadith-eng":"Whenever the Prophet (ﷺ) went to the lavatory, he used to say: \"Allahumma inni a`udhu bika min al-khubuthi wal khaba'ith.\"","reference":"Sahih al-Bukhari 6322, Book 80, Hadith 19","grade":"","question #":"question #3","question":"What are the spiritual benefits of reciting specific prayers before performing daily activities in Islam?","id":"bukhari-80-233"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta \nRabbi la ilaha illa anta. Khalaqtani wa ana `Abduka, wa ana 'ala 'ahdika wa Wa'dika mastata'tu abu'u \nLaka bi ni 'matika wa abu'u Laka bidhanbi; faghfirli fa'innahu la yaghfiru-dh-dhunuba ill a ant a. \nA'uidhu bika min sharri ma sana'tu.' If somebody recites this invocation during the night, and if he \nshould die then, he will go to Paradise (or he will be from the people of Paradise). And if he recites it \nin the morning, and if he should die on the same day, he will have the same fate.\"","reference":"Sahih al-Bukhari 6323, Book 80, Hadith 20","grade":"","question #":"question #3","question":"How does the recitation of a particular supplication relate to one's fate in the afterlife according to Islamic teachings?","id":"bukhari-80-234"},{"hadith-eng":"Whenever the Prophet (ﷺ) intended to go to bed, he would recite: \"Bismika Allahumma amutu wa ahya \n(With Your name, O Allah, I die and I live).\" And when he woke up from his sleep, he would say: \n\"Al-hamdu lil-lahil-ladhi ahyana ba'da ma amatana; wa ilaihi an-nushur (All the Praises are for Allah \nWho has made us alive after He made us die (sleep) and unto Him is the Resurrection). \"","reference":"Sahih al-Bukhari 6324, Book 80, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of remembering Allah before sleep and after waking up in Islam?","id":"bukhari-80-235"},{"hadith-eng":"Whenever the Prophet (ﷺ) lay on his bed, he used to say: \"Allahumma bismika amutu wa ahya,\" and when \nhe woke up he would say: \"Al-hamdu lil-lahilladhi ahyana ba'da ma an atana, wa ilaihi an-nushur.\"","reference":"Sahih al-Bukhari 6325, Book 80, Hadith 22","grade":"","question #":"question #3","question":"How does the Prophet (ﷺ) acknowledge the cycle of life and death in his daily routine?","id":"bukhari-80-236"},{"hadith-eng":"Abu Bakr As-Siddiq said to the Prophet, \"Teach me an invocation with which I may invoke (Allah) in \nmy prayer.\" The Prophet (ﷺ) said, \"Say: Allahumma inni zalamtu nafsi zulman kathiran wala yaghfirudhdhunuba \nilla anta, Faghfirli maghfiratan min indika war-hamni, innaka antalGhafur-Rahim.\"","reference":"Sahih al-Bukhari 6326, Book 80, Hadith 23","grade":"","question #":"question #3","question":"What are the attributes of Allah mentioned in the invocation taught by the Prophet to Abu Bakr?","id":"bukhari-80-237"},{"hadith-eng":"The Verse: 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) was revealed as regards \ninvocation.","reference":"Sahih al-Bukhari 6327, Book 80, Hadith 24","grade":"","question #":"question #3","question":"What is the significance of balancing the tone of voice in prayer according to Islamic teachings?","id":"bukhari-80-238"},{"hadith-eng":"We used to say in the prayer: 'AsSalam be on Allah, As-Salam be on so-and so.' So one day the \nProphet said to us, \"Allah Himself is As-Salam; when anyone of you sits during his prayer, he should \nsay: 'at-tah, iyyatu-li l-lahi,' up to 'As-Salihin,' (All the compliments are for Allah ...righteous people) \nfor when he recites this, then he says his Salam to all the righteous people present in the heavens and \non the earth. Then he should say, 'I testify that none has the right to be worshipped except Allah, and \nthat Muhammad is His slave and His Apostle,' and then he can select whatever he likes to celebrate \n(Allah's) Praises.\"","reference":"Sahih al-Bukhari 6328, Book 80, Hadith 25","grade":"","question #":"question #3","question":"What is the importance of testifying the oneness of Allah and the prophethood of Muhammad in prayer?","id":"bukhari-80-239"},{"hadith-eng":"The people said, \"O Allah's Messenger (ﷺ)! The rich people have got the highest degrees of prestige and the \npermanent pleasures (in this life and the life to come in the Hereafter).\" He said, \"How is that?\" They \nsaid, \"The rich pray as we pray, and strive in Allah's Cause as we do, and spend from their surplus \nwealth in charity, while we have no wealth (to spend likewise).\" He said, \"Shall I not tell you a thing, \nby doing which, you will catch up with those who are ahead of you and supersede those who will \ncome after you; and nobody will be able to do such a good deed as you do except the one who does \nthe same (deed as you do). That deed is to recite 'Subhan Allah ten times, and 'Al-Hamduli l-lah ten \ntimes, and 'AllahuAkbar' ten times after every prayer.\"","reference":"Sahih al-Bukhari 6329, Book 80, Hadith 26","grade":"","question #":"question #3","question":"What is the significance of reciting 'Subhan Allah', 'Al-Hamduli l-lah', and 'Allahu Akbar' after prayers?","id":"bukhari-80-240"},{"hadith-eng":"(the freed slave of Al-Mughira bin Shu`ba) Al-Mughira wrote to Muawiya bin Abu Sufyan that \nAllah's Messenger (ﷺ) used to say at the end of every prayer after the Taslim, \"La ilaha illa-l-lahu wahdahu la \nsharika lahu; lahu-l-mulk wa lahu-l-hamd, wahuwa 'ala kulli shai'n qadir. Allahumma la mani'a Lima \na taita, wa la mu'ta Lima mana'ta, wa la yanfa'u dhal-jaddu minkal-jadd.","reference":"Sahih al-Bukhari 6330, Book 80, Hadith 27","grade":"","question #":"question #3","question":"What is the impact of recognizing that no one can withhold what Allah grants or grant what He withholds?","id":"bukhari-80-241"},{"hadith-eng":"We went out with the Prophet (ﷺ) to Khaibar. A man among the people said, \"O 'Amir! Will you please \nrecite to us some of your poetic verses?\" So 'Amir got down and started chanting among them, saying, \n\"By Allah! Had it not been for Allah, we would not have been guided.\" 'Amir also said other poetic \nverses which I do not remember. Allah's Messenger (ﷺ) said, \"Who is this (camel) driver?\" The people said, \n\"He is 'Amir bin Al-Akwa`,\" He said, \"May Allah bestow His Mercy on him.\" A man from the People \nsaid, \"O Allah's Messenger (ﷺ)! Would that you let us enjoy his company longer.\" When the people \n(Muslims) lined up, the battle started, and 'Amir was struck with his own sword (by chance) by \nhimself and died. In the evening, the people made a large number of fires (for cooking meals). Allah's \nApostle said, \"What is this fire? What are you making the fire for?\" They said, \"For cooking the meat \nof donkeys.\" He said, \"Throw away what is in the pots and break the pots!\" A man said, \"O Allah's \nProphet! May we throw away what is in them and wash them?\" He said, \"Never mind, you may do \nso.\" (See Hadith No. 509, Vol. 5).","reference":"Sahih al-Bukhari 6331, Book 80, Hadith 28","grade":"","question #":"question #3","question":"What was the Prophet Muhammad's (ﷺ) instruction regarding the consumption of donkey meat during the expedition?","id":"bukhari-80-242"},{"hadith-eng":"Whenever a man brought his alms to the Prophet, the Prophet (ﷺ) would say, \"O Allah! Bestow Your \nBlessing upon the family of so-and-so.\" When my father came to him (with his alms), he said, \"O \nAllah! Bestow Your Blessings upon the family of Abi `Aufa.\"","reference":"Sahih al-Bukhari 6332, Book 80, Hadith 29","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) supplications for individuals and their families?","id":"bukhari-80-243"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me. \"Will you relieve me from Dhi-al-Khalasa? \" Dhi-al-Khalasa was an idol \nwhich the people used to worship and it was called Al-Ka`ba al Yamaniyya. I said, \"O Allah's Messenger (ﷺ) \nI am a man who can't sit firm on horses.\" So he stroked my chest (with his hand) and said, \"O Allah! \nMake him firm and make him a guiding and well-guided man.\" So I went out with fifty (men) from \nmy tribe of Ahrnas. (The sub-narrator, Sufyan, quoting Jarir, perhaps said, \"I went out with a group of \nmen from my nation.\") and came to Dhi-al-Khalasa and burnt it, and then came to the Prophet (ﷺ) and \nsaid, \"O Allah's Messenger (ﷺ)! I have not come to you till I left it like a camel with a skin disease.\" The \nProphet then invoked good upon Ahmas and their cavalry (fighters).","reference":"Sahih al-Bukhari 6333, Book 80, Hadith 30","grade":"","question #":"question #3","question":"What role did the tribe of Ahmas play in the mission to destroy Dhi-al-Khalasa?","id":"bukhari-80-244"},{"hadith-eng":"Um Sulaim said to the Prophet (ﷺ) \"Anas is your servant.\" The Prophet (ﷺ) said, \"O Allah! increase his \nwealth and offspring, and bless (for him) what ever you give him.\"","reference":"Sahih al-Bukhari 6334, Book 80, Hadith 31","grade":"","question #":"question #3","question":"What is the role of blessings in the life of a believer as understood in Islamic tradition?","id":"bukhari-80-245"},{"hadith-eng":"The Prophet (ﷺ) heard a man reciting (the Qur'an) in the mosque. He said,\" May Allah bestow His Mercy \non him, as he made me remember such and-such Verse which I had missed in such-and-such Sura.\"","reference":"Sahih al-Bukhari 6335, Book 80, Hadith 32","grade":"","question #":"question #3","question":"In what ways can the recitation of the Qur'an in a mosque impact those who hear it?","id":"bukhari-80-246"},{"hadith-eng":"The Prophet (ﷺ) divided something (among the Muslims) and distributed the shares (of the booty). A man \nsaid, \"This division has not been made to please Allah.\" When I informed the Prophet (ﷺ) about it, he \nbecame so furious that I noticed the signs of anger on his face and he then said, \"May Allah bestow \nHis Mercy on Moses, for he was hurt with more than this, yet he remained patient.\"","reference":"Sahih al-Bukhari 6336, Book 80, Hadith 33","grade":"","question #":"question #3","question":"What is the significance of patience when dealing with unjust criticism or accusations in Islam?","id":"bukhari-80-247"},{"hadith-eng":"Ibn `Abbas said, \"Preach to the people once a week, and if you won't, then preach them twice, but if \nyou want to preach more, then let it be three times (a week only), and do not make the people fed-up \nwith this Qur'an. If you come to some people who are engaged in a talk, don't start interrupting their \ntalk by preaching, lest you should cause them to be bored. You should rather keep quiet, and if they \nask you, then preach to them at the time when they are eager to hear what you say. And avoid the use \nof rhymed prose in invocation for I noticed that Allah's Messenger (ﷺ) and his companions always avoided \nit.\"","reference":"Sahih al-Bukhari 6337, Book 80, Hadith 34","grade":"","question #":"question #3","question":"Why is it advised to avoid using rhymed prose in invocations according to the companions of the Prophet (ﷺ)?","id":"bukhari-80-248"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"When anyone of you appeal to Allah for something, he should ask with \ndetermination and should not say, 'O Allah, if You wish, give me.', for nobody can force Allah to do \nsomething against His Will.","reference":"Sahih al-Bukhari 6338, Book 80, Hadith 35","grade":"","question #":"question #3","question":"How does the concept of Allah's will relate to the way believers should make their requests in prayers?","id":"bukhari-80-249"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"None of you should say: 'O Allah, forgive me if You wish; O Allah, be merciful \nto me if You wish,' but he should always appeal to Allah with determination, for nobody can force \nAllah to do something against His Will.\"","reference":"Sahih al-Bukhari 6339, Book 80, Hadith 36","grade":"","question #":"question #3","question":"How should one approach asking for forgiveness and mercy from Allah?","id":"bukhari-80-250"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The invocation of anyone of you is granted (by Allah) if he does not show \nimpatience (by saying, \"I invoked Allah but my request has not been granted.\")","reference":"Sahih al-Bukhari 6340, Book 80, Hadith 37","grade":"","question #":"question #3","question":"What attitude should a believer maintain after making a supplication to Allah?","id":"bukhari-80-251"},{"hadith-eng":"Narrated Anas, \"The Prophet (ﷺ) raised his hands (in invocation) till I saw the whiteness of his armpits.\"","reference":"Sahih al-Bukhari 6341, Book 80, Hadith 38","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) physical gestures during prayer from the companions' observations?","id":"bukhari-80-252"},{"hadith-eng":"While the Prophet (ﷺ) was delivering a sermon on a Friday, a man stood up and said, \"O Allah's Messenger (ﷺ)! \nInvoke Allah to bless us with rain.\" (The Prophet (ﷺ) invoked Allah for rain.) So, the sky became overcast \nand it started raining till one could hardly reach one's home. It kept on raining till the next Friday \nwhen the same man or another man got up and said (to the Prophet), \"Invoke Allah to withhold the \nrain from us, for we have been drowned (with heavy rain ).\" The Prophet (ﷺ) said, \"O Allah! Let it rain \naround us and not on us.\" Then the clouds started dispersing around Medina and rain ceased to fall on \nthe people of Medina.","reference":"Sahih al-Bukhari 6342, Book 80, Hadith 39","grade":"","question #":"question #3","question":"How does this incident illustrate the responsiveness of Allah to the prayers of His Prophet and the community?","id":"bukhari-80-253"},{"hadith-eng":"Allah's Messenger (ﷺ) went out to this Musalla (praying place) to offer the prayer of Istisqa.' He invoked \nAllah for rain and then faced the Qibla and turned his Rida' (upper garment) inside out.","reference":"Sahih al-Bukhari 6343, Book 80, Hadith 40","grade":"","question #":"question #3","question":"What is the purpose of turning the upper garment inside out during the prayer for rain?","id":"bukhari-80-254"},{"hadith-eng":"My mother said, \"O Allah's Messenger (ﷺ)! Please invoke Allah on behalf of your servant.\" He said, \"O \nAllah! Increase his wealth and children, and bestow Your Blessing on whatever You give him.\" a time \nof distress.","reference":"Sahih al-Bukhari 6344, Book 80, Hadith 41","grade":"","question #":"question #3","question":"What is the role of a mother's supplication for her child in Islamic tradition?","id":"bukhari-80-255"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah at the time of distress, saying, \"La ilaha illal-lahu Al-`Azim, al- \nHalim, La ilaha illal-lahu Rabbu-s-samawati wal-ard wa Rabbu-l-arsh il-azim.\"","reference":"Sahih al-Bukhari 6345, Book 80, Hadith 42","grade":"","question #":"question #3","question":"How can invoking Allah's names and attributes provide comfort during difficult times?","id":"bukhari-80-256"},{"hadith-eng":"Allah's Messenger (ﷺ) used to say at a time of distress, \"La ilaha illal-lahu Rabbul-l-'arsh il-'azim, La ilaha \nillallahu Rabbu-s-samawati wa Rabbu-l-ard, Rabbu-l-'arsh-il-Karim.\"","reference":"Sahih al-Bukhari 6346, Book 80, Hadith 43","grade":"","question #":"question #3","question":"How can reciting specific supplications help a believer during difficult times?","id":"bukhari-80-257"},{"hadith-eng":"Allah's Messenger (ﷺ) used to seek refuge with Allah from the difficult moment of a calamity and from being \novertaken by destruction and from being destined to an evil end, and from the malicious joy of \nenemies. Sufyan said, \"This narration contained three items only, but I added one. I do not know \nwhich one that was.\"","reference":"Sahih al-Bukhari 6347, Book 80, Hadith 44","grade":"","question #":"question #3","question":"How does seeking refuge from an evil end reflect on a believer's understanding of destiny and divine decree?","id":"bukhari-80-258"},{"hadith-eng":"When Allah's Messenger (ﷺ) was healthy, he used to say, \"No prophet dies till he is shown his place in \nParadise, and then he is given the option (to live or die).\" So when death approached him(during his \nillness), and while his head was on my thigh, he became unconscious for a while, and when he \nrecovered, he fixed his eyes on the ceiling and said, \"O Allah! (Let me join) the Highest Companions \n(see Qur'an 4:69),\" I said, \"So, he does not choose us.\" Then I realized that it was the application of \nthe statement he used to relate to us when he was healthy. So that was his last utterance (before he \ndied), i.e. \"O Allah! (Let me join) the Highest Companions.\"","reference":"Sahih al-Bukhari 6348, Book 80, Hadith 45","grade":"","question #":"question #3","question":"What can be understood from the Prophet's last utterance about his desire to join the Highest Companions?","id":"bukhari-80-259"},{"hadith-eng":"I came to Khabbab who had been branded with seven brands(1) and he said, \"Had Allah's Messenger (ﷺ) not \nforbidden us to invoke (Allah) for death, I would have invoked (Allah) for it.\"","reference":"Sahih al-Bukhari 6349, Book 80, Hadith 46","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding supplication during times of extreme distress?","id":"bukhari-80-260"},{"hadith-eng":"I came to Khabbab who had been branded with seven brands over his `Abdomen, and I heard him \nsaying, \"If the Prophet: had not forbidden us to invoke (Allah) for death, I would have invoked Allah \nfor it.\"","reference":"Sahih al-Bukhari 6350, Book 80, Hadith 47","grade":"","question #":"question #3","question":"How does the concept of divine decree influence a believer's response to hardship?","id":"bukhari-80-261"},{"hadith-eng":"Allah's Messenger (ﷺ) said,\" None of you should long for death because of a calamity that had befallen him, \nand if he cannot, but long for death, then he should say, 'O Allah! Let me live as long as life is better \nfor me, and take my life if death is better for me.' \"","reference":"Sahih al-Bukhari 6351, Book 80, Hadith 48","grade":"","question #":"question #3","question":"What is the recommended supplication for someone who is struggling with the desire for death due to difficulties?","id":"bukhari-80-262"},{"hadith-eng":"My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My sister's son is sick.\" So he \npassed his hand over my head and invoked for Allah's blessing upon me and then performed the \nablution. I drank from the water of his ablution and I stood behind him and looked at his Khatam (the \nseal of Prophethood) between his shoulders (and its size was) like the button of a tent.","reference":"Sahih al-Bukhari 6352, Book 80, Hadith 49","grade":"","question #":"question #3","question":"What is the significance of the Prophet's ablution water in Islamic belief?","id":"bukhari-80-263"},{"hadith-eng":"that his grandfather. `Abdullah bin Hisham used to take him from the market or to the market (the \nnarrator is in doubt) and used to buy grain and when Ibn Az-Zubair and Ibn `Umar met him, they \nwould say to him, \"Let us be your partners (in trading) as the Prophet (ﷺ) invoked for Allah's blessing \nupon you.\" He would then take them as partners and he would Sometimes gain a whole load carried \nby an animal which he would send home.","reference":"Sahih al-Bukhari 6353, Book 80, Hadith 50","grade":"","question #":"question #3","question":"What role do companions of the Prophet (ﷺ) play in the context of trade and blessings?","id":"bukhari-80-264"},{"hadith-eng":"On whose face Allah's Messenger (ﷺ) had thrown water from his mouth, the water having been taken from \ntheir well while he was still a young boy (who has not yet attained the age of puberty).","reference":"Sahih al-Bukhari 6354, Book 80, Hadith 51","grade":"","question #":"question #3","question":"What is the importance of personal experiences with the Prophet (ﷺ) in the preservation of hadiths?","id":"bukhari-80-265"},{"hadith-eng":"The boys used to be brought to the Prophet (ﷺ) and he used to invoke for Allah's blessing upon them. \nOnce an infant was brought to him and it urinated on his clothes. He asked for water and poured it \nover the place of the urine and did not wash his clothes.","reference":"Sahih al-Bukhari 6355, Book 80, Hadith 52","grade":"","question #":"question #3","question":"What does the Prophet's reaction to the infant's urine indicate about cleanliness and purification in Islam?","id":"bukhari-80-266"},{"hadith-eng":"whose eye Allah's Messenger (ﷺ) had touched, that he had seen Sa`d bin Abi Waqqas offering one rak`a only \nfor the witr prayer.","reference":"Sahih al-Bukhari 6356, Book 80, Hadith 53","grade":"","question #":"question #3","question":"What can be learned from the actions of Sa'd bin Abi Waqqas regarding the witr prayer?","id":"bukhari-80-267"},{"hadith-eng":"Ka`b bin 'Ujra met me and said, \"Shall I give you a present? Once the Prophet (ﷺ) came to us and we said, \n'O Allah's Messenger (ﷺ) ! We know how to greet you; but how to send 'Salat' upon you? He said, 'Say: \nAllahumma Salli ala Muhammadin wa 'ala `Ali Muhammadin, kama sal-laita 'ala all Ibrahima innaka \nHamidun Majid. Allahumma barik 'ala Muhammadin wa 'ala all Muhammadin, kama barakta 'ala all \nIbrahima, innaka Hamidun Majid.\"","reference":"Sahih al-Bukhari 6357, Book 80, Hadith 54","grade":"","question #":"question #3","question":"What are the specific words recommended for sending Salat upon the Prophet Muhammad (ﷺ)?","id":"bukhari-80-268"},{"hadith-eng":"We said, \"O Allah's Messenger (ﷺ) This is (i.e. we know) the greeting to you; will you tell us how to send \nSalat on you?\" He said, \"Say: 'Allahumma Salli 'ala Muhammadin `Abdika wa rasulika kama sal-laita \n'ala Ibrahima wa barik 'ala Muhammadin wa all Muhammadin kama barakta 'ala Ibrahima wa `Ali \nIbrahim.\"","reference":"Sahih al-Bukhari 6358, Book 80, Hadith 55","grade":"","question #":"question #3","question":"What are the specific words recommended for sending blessings on the Prophet Muhammad (ﷺ)?","id":"bukhari-80-269"},{"hadith-eng":"Whenever somebody brought alms to the Prophet (ﷺ) the used to say, \"Allahumma Salli 'Alaihi (O Allah! \nSend Your Salat (Grace and Honor) on him).\" Once when my father brought his alms to him, he said, \n\"O Allah! Send Your Salat (Grace and Honor) on the family of Abi `Aufa.\"","reference":"Sahih al-Bukhari 6359, Book 80, Hadith 56","grade":"","question #":"question #3","question":"What is the importance of invoking blessings upon individuals and their families in Islamic tradition?","id":"bukhari-80-270"},{"hadith-eng":"The people said, \"O Allah's Messenger (ﷺ) ! How may we send Salat on you?\" He said, \"Say: Allahumma \nSalli 'ala- Muhammadin wa azwajihi wa dhurriyyatihi kama sal-laita 'ala `Ali Ibrahim; wa barik 'ala \nMuhammadin wa azwajihi wa dhurriyyatihi kamabarakta 'ala `Ali Ibrahim innaka hamidun majid.\"","reference":"Sahih al-Bukhari 6360, Book 80, Hadith 57","grade":"","question #":"question #3","question":"Why is it important to include the family of the Prophet Muhammad when sending Salat upon him?","id":"bukhari-80-271"},{"hadith-eng":"that he heard the Prophet (ﷺ) saying, \"O Allah! If I should ever abuse a believer, please let that be a means \nof bringing him near to You on the Day of Resurrection.\"","reference":"Sahih al-Bukhari 6361, Book 80, Hadith 58","grade":"","question #":"question #3","question":"What does this narration imply about the Prophet's concern for the well-being of believers in the hereafter?","id":"bukhari-80-272"},{"hadith-eng":"Once the people started asking Allah's Messenger (ﷺ) questions, and they asked so many questions that he \nbecame angry and ascended the pulpit and said, \"I will answer whatever questions you may ask me \ntoday.\" I looked right and left and saw everyone covering his face with his garment and weeping. \nBehold ! There was a man who, on quarreling with the people, used to be called as a son of a person \nother than h is father. He said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your \nfather is Hudhaifa.\" And then `Umar got up and said, \"We accept Allah as our Lord, and Islam as \n(our) religion, and Muhammad as (our) Apostle; and we seek refuge with Allah from the afflictions.\" \nAllah's Messenger (ﷺ) said, \" I have never seen a day like today in its good and its evil for Paradise and the \nHell Fire were displayed in front of me, till I saw them just beyond this wall.\" Qatada, when relating \nthis Hadith, used to mention the following Verse:-- \n'O you who believe! Ask not questions about things which, If made plain to you, May cause you \ntrouble. (5.101)","reference":"Sahih al-Bukhari 6362, Book 80, Hadith 59","grade":"","question #":"question #3","question":"What is the significance of accepting Allah as Lord, Islam as religion, and Muhammad as Apostle in times of trial?","id":"bukhari-80-273"},{"hadith-eng":"The Prophet (ﷺ) said to Abu Talha, \"Choose one of your boys to serve me.\" So Abu Talha took me (to \nserve the Prophet (ﷺ) ) by giving me a ride behind him (on his camel). So I used to serve Allah's Messenger (ﷺ) \nwhenever he stayed somewhere. I used to hear him saying, \"O Allah! I seek refuge with you (Allah) \nfrom (worries) care and grief, from incapacity and laziness, from miserliness and cowardice, from \nbeing heavily in debt and from being overpowered by other men.\" I kept on serving him till he \nreturned from (the battle of) Khaibar. He then brought Safiya, the daughter of Huyay whom he had \ngot (from the booty). I saw him making a kind of cushion with a cloak or a garment for her. He then \nlet her ride behind him. When we reached a place called As-Sahba', he prepared (a special meal \ncalled) Hais, and asked me to invite the men who (came and) ate, and that was the marriage banquet \ngiven on the consummation of his marriage to her. Then he proceeded till the mountain of Uhud \nappeared, whereupon he said, \"This mountain loves us and we love it.\" When he approached Medina, \nhe said, \"O Allah! I make the land between its (i.e., Medina's) two mountains a sanctuary, as the \nprophet Abraham made Mecca a sanctuary. O Allah! Bless them (the people of Medina) in their Mudd \nand the Sa' (units of measuring).","reference":"Sahih al-Bukhari 6363, Book 80, Hadith 60","grade":"","question #":"question #3","question":"What significance does the Prophet Muhammad (ﷺ) attribute to the city of Medina and its people?","id":"bukhari-80-274"},{"hadith-eng":"I heard the Prophet (ﷺ) seeking refuge with Allah from the punishment of the grave.","reference":"Sahih al-Bukhari 6364, Book 80, Hadith 61","grade":"","question #":"question #3","question":"How can one seek protection from spiritual or unseen harms in Islam?","id":"bukhari-80-275"},{"hadith-eng":"Sa`d used to recommend five (statements) and mentioned that the Prophet (ﷺ) I used to recommend it. (It \nwas) \"O Allah! I seek refuge with You from miserliness; and seek refuge with You from cowardice; \nand seek refuge with You from being sent back to geriatric old age; and I seek refuge with You from \nthe affliction of this world (i.e., the affliction of Ad-Dajjal etc.); and seek refuge with You from the \npunishment of the grave.\"","reference":"Sahih al-Bukhari 6365, Book 80, Hadith 62","grade":"","question #":"question #3","question":"What significance does seeking refuge from the punishment of the grave hold in Islamic belief?","id":"bukhari-80-276"},{"hadith-eng":"Two old ladies from among the Jewish ladies entered upon me and said' \"The dead are punished in \ntheir graves,\" but I thought they were telling a lie and did not believe them in the beginning. When \nthey went away and the Prophet (ﷺ) entered upon me, I said, \"O Allah's Messenger (ﷺ)! Two old ladies..\" and \ntold him the whole story. He said, \"They told the truth; the dead are really punished, to the extent that \nall the animals hear (the sound resulting from) their punishment.\" Since then I always saw him \nseeking refuge with Allah from the punishment of the grave in his prayers.","reference":"Sahih al-Bukhari 6366, Book 80, Hadith 63","grade":"","question #":"question #3","question":"What role do narrations from other religious traditions play in understanding Islamic beliefs about the afterlife?","id":"bukhari-80-277"},{"hadith-eng":"Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from \ncowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I \nseek refuge with You from the afflictions of life and death.\"","reference":"Sahih al-Bukhari 6367, Book 80, Hadith 64","grade":"","question #":"question #3","question":"How does seeking refuge from incapacity and laziness reflect on a person's character and faith?","id":"bukhari-80-278"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness and geriatric old age, from \nall kinds of sins and from being in debt; from the trial and affliction of the grave and from the punishment in the \ngrave; from the affliction of the Fire and from the punishment of the \nFire; and from the evil of the affliction of wealth; and I seek refuge with You from the affliction of \npoverty, and I seek refuge with You from the affliction of Al-Mesiah Ad-Dajjal. O Allah! Wash away \nmy sins with the water of snow and hail, and cleanse my heart from all the sins as a white garment is \ncleansed from the filth, and let there be a long distance between me and my sins, as You made East \nand West far from each other.\"","reference":"Sahih al-Bukhari 6368, Book 80, Hadith 65","grade":"","question #":"question #3","question":"What is the significance of cleansing one's heart and distancing oneself from sins in Islamic teachings?","id":"bukhari-80-279"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from worry and grief, from incapacity and \nlaziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by \n(other) men.\" (See Hadith No. 374)","reference":"Sahih al-Bukhari 6369, Book 80, Hadith 66","grade":"","question #":"question #3","question":"What are the negative traits and situations mentioned in the supplication that one should seek protection from?","id":"bukhari-80-280"},{"hadith-eng":"Sa`d bin Abi Waqqas used to recommend these five (statements) and say that the Prophet (ﷺ) said so (and \nthey are): \"O Allah! I seek refuge with You from miserliness, and seek refuge with You from \ncowardice, and seek refuge with You from being brought back to geriatric old age, and seek refuge \nwith You from the afflictions of the world, and seek refuge with You from the punishment of the \ngrave.\"","reference":"Sahih al-Bukhari 6370, Book 80, Hadith 67","grade":"","question #":"question #3","question":"How does seeking refuge from the afflictions of the world and the punishment of the grave reflect on a Muslim's spiritual priorities?","id":"bukhari-80-281"},{"hadith-eng":"Allah's Messenger (ﷺ) used to seek refuge with Allah saying, \"O Allah! I seek refuge with You from \nlaziness, and seek refuge with You from cowardice, and seek refuge with You from geriatric old age, \nand seek refuge with You from miserliness.\"","reference":"Sahih al-Bukhari 6371, Book 80, Hadith 68","grade":"","question #":"question #3","question":"How does seeking refuge from geriatric old age and miserliness reflect on a person's character and faith?","id":"bukhari-80-282"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Make us love Medina as You made us love Mecca, or more, and transfer \nthe fever that is in it, to Al-Juhfa. O Allah! Bless our Mudd and our Sam' (kinds of measures).","reference":"Sahih al-Bukhari 6372, Book 80, Hadith 69","grade":"","question #":"question #3","question":"What is the importance of seeking blessings for specific measures or resources in Islamic tradition?","id":"bukhari-80-283"},{"hadith-eng":"that his father said, \"In the year of Hajjatal-Wada`, the Prophet (ﷺ) paid me a visit while I was suffering \nfrom an ailment that had brought me to the verge of death. I said, 'O Allah's Messenger (ﷺ)! My sickness has \nreduced me to the (bad) state as you see, and I am a rich man, but have no heirs except one daughter. \nShall I give 2/3 of my property in charity?' He said, 'No.' I said, 'Then 1/2 of it?' He said, 'Even 1/3 is \ntoo much, for, to leave your inheritors wealthy is better than to leave them in poverty, begging from \npeople. And (know that) whatever you spend in Allah's Cause, you will get reward for it, even for the \nmorsel of food which you put in your wife's mouth.' I said, 'O Allah's Messenger (ﷺ)! Will I be left behind \nmy companions (in Mecca)?' He said, 'If you remain behind, whatever good deed you will do for \nAllah's Sake, will raise and upgrade you to a higher position (in Allah's Sight). May be you will live \nlonger so that some people may benefit by you, and some e others (pagans) may get harmed by you. O \nAllah! Complete the migration of my companions and do not turn them on their heels; But (we pity) \nthe poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca)\" Allah's Messenger (ﷺ) lamented \n(or pitied) for him as he died in Mecca. (See Hadith No. 693, Vol. 5)","reference":"Sahih al-Bukhari 6373, Book 80, Hadith 70","grade":"","question #":"question #3","question":"What is the importance of good deeds in elevating one's status in the sight of Allah?","id":"bukhari-80-284"},{"hadith-eng":"Seek refuge with Allah by saying the words which the Prophet (ﷺ) used to say while seeking refuge with \nAllah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, \nand seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from \nthe afflictions of the world and from the punishment in the grave.\"","reference":"Sahih al-Bukhari 6374, Book 80, Hadith 71","grade":"","question #":"question #3","question":"How does seeking refuge from the afflictions of the world and the punishment in the grave reflect on a Muslim's faith and awareness of the Hereafter?","id":"bukhari-80-285"},{"hadith-eng":"The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness from geriatric old age, from \nbeing in debt, and from committing sins. O Allah! I seek refuge with You from the punishment of the \nFire, the afflictions of the grave, the punishment in the grave, and the evil of the affliction of poverty \nand from the evil of the affliction caused by Al-Masih Ad-Dajjal. O Allah! Wash away my sins with \nthe water of snow and hail, and cleanse my heart from the sins as a white garment is cleansed of filth, \nand let there be a far away distance between me and my sins as You have set far away the East and the \nWest from each other.\"","reference":"Sahih al-Bukhari 6375, Book 80, Hadith 72","grade":"","question #":"question #3","question":"What significance does the Prophet place on the concept of distance between oneself and sins in his prayers?","id":"bukhari-80-286"},{"hadith-eng":"The Prophet (ﷺ) used to seek refuge with Allah (by saying), \"O Allah! I seek refuge with You from the \naffliction of the Fire and from the punishment in the Fire, and seek refuge with You from the affliction \nof the grave, and I seek refuge with You from the affliction of wealth, and I seek refuge with You \nfrom the affliction of poverty, and seek refuge with You from the affliction of Al-Masih Ad-Dajjal.\"","reference":"Sahih al-Bukhari 6376, Book 80, Hadith 73","grade":"","question #":"question #3","question":"What is the significance of seeking protection from Al-Masih Ad-Dajjal in Islamic eschatology?","id":"bukhari-80-287"},{"hadith-eng":"The Prophet (ﷺ) used to say, 'O Allah! I seek refuge with You from the affliction of the Fire, the \npunishment of the Fire, the affliction of the grave, the punishment of the grave, and the evil of the \naffliction of poverty. O Allah! I seek refuge with You from the evil of the affliction of Al-Masih Ad- \nDajjal, O Allah! Cleanse my heart with the water of snow and hail, and cleanse my heart from all sins \nas a white garment is cleansed from filth, and let there be a far away distance between me and my sins \nas You made the East and West far away from each other. O Allah! I seek refuge with You from \nlaziness, sins, and from being in debt.\"","reference":"Sahih al-Bukhari 6377, Book 80, Hadith 74","grade":"","question #":"question #3","question":"What significance does the Prophet (ﷺ) place on seeking refuge from laziness and debt in his supplications?","id":"bukhari-80-288"},{"hadith-eng":"that she said, \"O Allah's Messenger (ﷺ)! Anas is your servant, so please invoke for Allah's blessing for him.\" \nThe Prophet (ﷺ) said, \"O Allah! Increase his wealth and offspring and bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6378, 6379, Book 80, Hadith 75","grade":"","question #":"question #3","question":"What does this narration suggest about the relationship between a servant and the Prophet (ﷺ)?","id":"bukhari-80-289"},{"hadith-eng":"that she said, \"O Allah's Messenger (ﷺ)! Anas is your servant, so please invoke for Allah's blessing for him.\" \nThe Prophet (ﷺ) said, \"O Allah! Increase his wealth and offspring and bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6378, 6379, Book 80, Hadith 75","grade":"","question #":"question #3","question":"What does this narration suggest about the relationship between a servant and their master in Islam?","id":"bukhari-80-290"},{"hadith-eng":"Um Sulaim said (to the Prophet), \"Anas is your servant; so please invoke for Allah's blessings for \nhim.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6380, 6381, Book 80, Hadith 76","grade":"","question #":"question #3","question":"What role does a servant play in the household of a Muslim family in the context of Islamic teachings?","id":"bukhari-80-291"},{"hadith-eng":"Um Sulaim said (to the Prophet), \"Anas is your servant; so please invoke for Allah's blessings for \nhim.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give \nhim.\"","reference":"Sahih al-Bukhari 6380, 6381, Book 80, Hadith 76","grade":"","question #":"question #3","question":"What does this narration suggest about the relationship between a servant and their master in Islamic tradition?","id":"bukhari-80-292"},{"hadith-eng":"The Prophet (ﷺ) used to teach us the Istikhara for each and every matter as he used to teach us the Suras \nfrom the Holy Qur'an. (He used to say), \"If anyone of you intends to do something, he should offer a \ntwo-rak`at prayer other than the obligatory prayer, and then say: 'Allahumma inni astakhiruka \nbi'ilmika, wa astaqdiruka biqudratika, wa as'aluka min fadlika-l-'azim, fa innaka taqdiru wala aqdiru, \nwa ta'lamu wala a'lamu, wa anta'allamu-l-ghuyub. Allahumma in kunta ta'lamu anna hadha-lamra \nkhairun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi 'ajili `Amri wa ajilihi) fa-qdurhu li, Wa in \nkunta ta'lamu anna ha-dha-l-amra sharrun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi ajili `Amri \nwa ajilihi) fasrifhu 'anni was-rifni 'anhu wa aqdur li alkhaira haithu kana, thumma Raddani bihi,\" Then \nhe should mention his matter (need).","reference":"Sahih al-Bukhari 6382, Book 80, Hadith 77","grade":"","question #":"question #3","question":"Why is it important to seek Allah's guidance and knowledge before making decisions?","id":"bukhari-80-293"},{"hadith-eng":"The Prophet (ﷺ) asked for some water and performed the ablution, and then raised his hands (towards the \nsky) and said, \"O Allah! Forgive `Ubaid Abi 'Amir.\" I saw the whiteness of his armpits (while he was \nraising his hands) and he added, \"O Allah! Upgrade him over many of Your human creatures on the \nDay of Resurrection.\"","reference":"Sahih al-Bukhari 6383, Book 80, Hadith 78","grade":"","question #":"question #3","question":"What can be inferred about the status of individuals on the Day of Resurrection from this narration?","id":"bukhari-80-294"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on a journey, and whenever we ascended a high place, we \nused to say Takbir (in a loud voice). The Prophet (ﷺ) said, \"O people! Be kind to yourselves, for you are \nnot calling upon a deaf or an absent one, but You are calling an All-Hearer, and an All-Seer.\" Then he \ncame to me as I was reciting silently, \"La haul a wala quwwata illa bil-lah.\" He said, \"O `Abdullah bin \nQais! Say: La haul a walaquwata illa bil-lah, for it is one of the treasures of Paradise.\" Or he said, \n\"Shall I tell you a word which is one of the treasures of Paradise? It is: La haul a wala quwwata illa \nbil-lah.\"","reference":"Sahih al-Bukhari 6384, Book 80, Hadith 79","grade":"","question #":"question #3","question":"What is the appropriate way to remember Allah during a journey according to Islamic teachings?","id":"bukhari-80-295"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) returned from a Ghazwa or Hajj or `Umra, he used to say, \"Allahu Akbar,\" \nthree times; whenever he went up a high place, he used to say, \"La ilaha illal-lahu wahdahu la sharika \nlahu, lahu-l-mulk wa lahu-l-hamd, wa huwa'ala kulli Shai 'in qadir. Ayibuna ta'ibuna 'abiduna \nlirabbina hamidun. Sadaqa-l-lahu wa'dahu, wa nasara`Abdahu wa hazama-l-ahzaba wahdahu.\"","reference":"Sahih al-Bukhari 6385, Book 80, Hadith 80","grade":"","question #":"question #3","question":"How does the recitation of specific phrases reflect gratitude and acknowledgment of Allah's power and assistance?","id":"bukhari-80-296"},{"hadith-eng":"The Prophet (ﷺ) seeing a yellow mark (of perfume) on the clothes of `Abdur-Rahman bin `Auf, said, \n\"What about you?\" `Abdur-Rahman replied, \"I have married a woman with a Mahr of gold equal to a \ndate-stone.\" The Prophet (ﷺ) said, \"May Allah bestow His Blessing on you (in your marriage). Give a \nwedding banquet, (Walima) even with one sheep.\"","reference":"Sahih al-Bukhari 6386, Book 80, Hadith 81","grade":"","question #":"question #3","question":"What is the role of Mahr in an Islamic marriage and how is it determined?","id":"bukhari-80-297"},{"hadith-eng":"My father died and left behind seven or nine daughters, and I married a woman. The Prophet (ﷺ) said, \n\"Did you get married, O Jabir?\" I replied, \"Yes.\" He asked, \"Is she a virgin or a matron?\" I replied, \n\"She is a matron.\" He said, \"Why didn't you marry a virgin girl so that you might play with her and \nshe with you (or, you might make her laugh and she make you laugh)?\" I said, \"My father died, \nleaving seven or nine girls (orphans) and I did not like to bring a young girl like them, so I married a \nwoman who can look after them.\" He said, \"May Allah bestow His Blessing on you.\"","reference":"Sahih al-Bukhari 6387, Book 80, Hadith 82","grade":"","question #":"question #3","question":"What blessings can be invoked for someone who makes a marriage decision based on family needs?","id":"bukhari-80-298"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you, when intending to have a sexual intercourse with his wife, says: \n'Bismillah, Allahumma jannibna-sh-shaitan, wa jannibi-sh-shaitan ma razaqtana,' and if the couple are \ndestined to have a child (out of that very sexual relation), then Satan will never be able to harm that \nchild.\"","reference":"Sahih al-Bukhari 6388, Book 80, Hadith 83","grade":"","question #":"question #3","question":"What role does intention and prayer play in safeguarding one's family from spiritual harm in Islam?","id":"bukhari-80-299"},{"hadith-eng":"The most frequent invocation of The Prophet (ﷺ) was: \"O Allah! Give to us in the world that which is \ngood and in the Hereafter that which is good, and save us from the torment of the Fire.\" (2.201)","reference":"Sahih al-Bukhari 6389, Book 80, Hadith 84","grade":"","question #":"question #3","question":"Why is it important to balance worldly and spiritual requests in daily prayers according to Islamic teachings?","id":"bukhari-80-300"},{"hadith-eng":"The Prophet (ﷺ) used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek \nrefuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with \nYou from being brought back to (senile) geriatric old age, and seek refuge with You from the \naffliction of the world and from the punishment in the Hereafter.\"","reference":"Sahih al-Bukhari 6390, Book 80, Hadith 85","grade":"","question #":"question #3","question":"What are the potential afflictions of the world and punishments in the Hereafter from which one should seek refuge?","id":"bukhari-80-301"},{"hadith-eng":"that Allah's Messenger (ﷺ) was affected by magic, so much that he used to think that he had done something \nwhich in fact, he did not do, and he invoked his Lord (for a remedy). Then (one day) he said, \"O \n`Aisha!) Do you know that Allah has advised me as to the problem I consulted Him about?\" `Aisha \nsaid, \"O Allah's Messenger (ﷺ)! What's that?\" He said, \"Two men came to me and one of them sat at my \nhead and the other at my feet, and one of them asked his companion, 'What is wrong with this man?' \nThe latter replied, 'He is under the effect of magic.' The former asked, 'Who has worked magic on \nhim?' The latter replied, 'Labid bin Al-A'sam.' The former asked, 'With what did he work the magic?' \nThe latter replied, 'With a comb and the hair, which are stuck to the comb, and the skin of pollen of a \ndate-palm tree.' The former asked, 'Where is that?' The latter replied, 'It is in Dharwan.' Dharwan was \na well in the dwelling place of the (tribe of) Bani Zuraiq. Allah's Messenger (ﷺ) went to that well and \nreturned to `Aisha, saying, 'By Allah, the water (of the well) was as red as the infusion of Hinna, (1) \nand the date-palm trees look like the heads of devils.' `Aisha added, Allah's Messenger (ﷺ) came to me and \ninformed me about the well. I asked the Prophet, 'O Allah's Messenger (ﷺ), why didn't you take out the skin \nof pollen?' He said, 'As for me, Allah has cured me and I hated to draw the attention of the people to \nsuch evil (which they might learn and harm others with).' \" \nNarrated Hisham's father: `Aisha said, \"Allah's Messenger (ﷺ) was bewitched, so he invoked Allah \nrepeatedly requesting Him to cure him from that magic).\" Hisham then narrated the above narration. \n(See Hadith No. 658, Vol. 7)","reference":"Sahih al-Bukhari 6391, Book 80, Hadith 86","grade":"","question #":"question #3","question":"Why did the Prophet Muhammad (ﷺ) choose not to disclose the details of the magic to the people?","id":"bukhari-80-302"},{"hadith-eng":"Allah's Messenger (ﷺ) asked for Allah's wrath upon the Ahzab (confederates), saying, \"O Allah, the Revealer \nof the Holy Book, and the One swift at reckoning! Defeat the confederates; Defeat them and shake \nthem.\"","reference":"Sahih al-Bukhari 6392, Book 80, Hadith 87","grade":"","question #":"question #3","question":"What can be learned about the power of prayer in overcoming challenges from the Prophet's supplication against the confederates?","id":"bukhari-80-303"},{"hadith-eng":"When the Prophet (ﷺ) said, \"Sami' al-lahu liman hamidah (Allah heard him who sent his praises to Him)\" \nin the last rak`a of the `Isha' prayer, he used to invoke Allah, saying, \"O Allah! Save `Aiyash bin Abi \nRabi`a; O Allah! Save Al-Walid bin Al-Walid; O Allah! Save the weak people among the believers; O \nAllah! Be hard on the Tribe of Mudar; O Allah! Inflict years of drought upon them like the years (of \ndrought) of the Prophet (ﷺ) Joseph.\"","reference":"Sahih al-Bukhari 6393, Book 80, Hadith 88","grade":"","question #":"question #3","question":"What can be learned from the Prophet's supplication against the Tribe of Mudar in terms of seeking justice and divine intervention?","id":"bukhari-80-304"},{"hadith-eng":"The Prophet (ﷺ) sent a Sariya (an army detachment) consisting of men called Al-Qurra', and all of them \nwere martyred. I had never seen the Prophet (ﷺ) so sad over anything as he was over them. So he said \nQunut (invocation in the prayer) for one month in the Fajr prayer, invoking for Allah's wrath upon the \ntribe of 'Usaiya, and he used to say, \"The people of 'Usaiya have disobeyed Allah and His Apostle.\"","reference":"Sahih al-Bukhari 6394, Book 80, Hadith 89","grade":"","question #":"question #3","question":"What can be learned about the consequences of disobedience to Allah and His Messenger from this event?","id":"bukhari-80-305"},{"hadith-eng":"The Jews used to greet the Prophet (ﷺ) by saying, \"As-Samu 'Alaika (i.e., death be upon you), so I \nunderstood what they said, and I said to them, \"As-Samu 'alaikum wal-la'na (i.e. Death and Allah's \nCurse be upon you).\" The Prophet (ﷺ) said, \"Be gentle and calm, O `Aisha, as Allah likes gentleness in all \naffairs.\" I said, \"O Allah's Prophet! Didn't you hear what they said?\" He said, \"Didn't you hear me \nanswering them back by saying, 'Alaikum (i.e., the same be upon you)?\"","reference":"Sahih al-Bukhari 6395, Book 80, Hadith 90","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) demonstrate patience and wisdom in dealing with adversaries?","id":"bukhari-80-306"},{"hadith-eng":"We were in the company of the Prophet (ﷺ) on the day (of the battle) of Al-Khandaq (the Trench). The \nProphet said, \"May Allah fill their (the infidels') graves and houses with fire, as they have kept us so \nbusy that we could not offer the middle prayer till the sun had set; and that prayer was the `Asr \nprayer.\"","reference":"Sahih al-Bukhari 6396, Book 80, Hadith 91","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) express his frustration towards the infidels during the Battle of Al-Khandaq?","id":"bukhari-80-307"},{"hadith-eng":"at-Tufail bin `Amr came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The tribe of Daus has \ndisobeyed (Allah and His Apostle) and refused (to embrace Islam), therefore, invoke Allah's wrath for \nthem.\" The people thought that the Prophet (ﷺ) would invoke Allah's wrath for them, but he said, \"O \nAllah! Guide the tribe Of Daus and let them come to us.\"","reference":"Sahih al-Bukhari 6397, Book 80, Hadith 92","grade":"","question #":"question #3","question":"How can leaders respond to disobedience and refusal in a way that aligns with Islamic teachings?","id":"bukhari-80-308"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah with the following invocation: 'Rabbi-ghfir-li Khati 'ati wa jahli wa \nisrafi fi `Amri kullihi, wa ma anta a'lamu bihi minni. Allahumma ighfirli khatayaya wa 'amdi, wa jahli \nwa jiddi, wa kullu dhalika'indi. Allahumma ighrifli ma qaddamtu wa ma akhartu wa ma asrartu wa ma \na'lantu. Anta-l-muqaddimu wa anta-l-mu'akh-khiru, wa anta 'ala kulli shai'in qadir.'","reference":"Sahih al-Bukhari 6398, Book 80, Hadith 93","grade":"","question #":"question #3","question":"What does the invocation reveal about the comprehensive nature of seeking forgiveness in Islam?","id":"bukhari-80-309"},{"hadith-eng":"The Prophet (ﷺ) used to invoke Allah, saying, \"Allahumma ighfirli khati'ati wa jahli wa israfi fi `Amri, wa \nma anta a-'lamu bihi minni. Allahumma ighfirli hazali wa jiddi wa khata'i wa amdi, wa kullu dhalika \n'indi.\"","reference":"Sahih al-Bukhari 6399, Book 80, Hadith 94","grade":"","question #":"question #3","question":"What does the Prophet's prayer teach about acknowledging one's own limitations and mistakes?","id":"bukhari-80-310"},{"hadith-eng":"Abu-l-Qasim (the Prophet) said, \"On Friday there is a particular time. If a Muslim happens to be \npraying and invoking Allah for something good during that time, Allah will surely fulfill his request.\" \nThe Prophet (ﷺ) pointed out with his hand. We thought that he wanted to illustrate how short that time \nwas.","reference":"Sahih al-Bukhari 6400, Book 80, Hadith 95","grade":"","question #":"question #3","question":"What actions should a Muslim take to ensure their supplications are fulfilled on Fridays?","id":"bukhari-80-311"},{"hadith-eng":"`Aisha said, \"The Jews came to the Prophet (ﷺ) and said to him, \"As-Samu 'Alaika (i.e., Death be upon \nyou).\" He replied, 'The same on you.' \" `Aisha said to them, \"Death be upon you, and may Allah curse \nyou and shower His wrath upon you!\" Allah's Messenger (ﷺ) I said, \"Be gentle and calm, O `Aisha! Be \ngentle and beware of being harsh and of saying evil things.\" She said, \"Didn't you hear what they \nsaid?\" He said, \"Didn't you hear what I replied (to them)? have returned their statement to them, and \nmy invocation against them will be accepted but theirs against me will not be accepted.\"","reference":"Sahih al-Bukhari 6401, Book 80, Hadith 96","grade":"","question #":"question #3","question":"What can be learned about the effectiveness of prayers and invocations in Islam from this interaction?","id":"bukhari-80-312"},{"hadith-eng":"The Prophet (ﷺ) said, \"When the Imam says 'Amin', then you should all say 'Amin', for the angels say \n'Amin' at that time, and he whose 'Amin' coincides with the 'Amin' of the angels, all his past sins will \nbe forgiven.\"","reference":"Sahih al-Bukhari 6402, Book 80, Hadith 97","grade":"","question #":"question #3","question":"What is the role of angels in the acceptance of prayers in Islamic teachings?","id":"bukhari-80-313"},{"hadith-eng":"Allah's Messenger (ﷺ) said,\" Whoever says: \"La ilaha illal-lah wahdahu la sharika lahu, lahu-l-mulk wa lahul- \nhamd wa huwa 'ala kulli shai'in qadir,\" one hundred times will get the same reward as given for \nmanumitting ten slaves; and one hundred good deeds will be written in his accounts, and one hundred \nsins will be deducted from his accounts, and it (his saying) will be a shield for him from Satan on that \nday till night, and nobody will be able to do a better deed except the one who does more than he.\"","reference":"Sahih al-Bukhari 6403, Book 80, Hadith 98","grade":"","question #":"question #3","question":"What is the significance of the reward of manumitting ten slaves in relation to reciting a particular phrase in Islam?","id":"bukhari-80-314"},{"hadith-eng":"Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted \none of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet (ﷺ) saying, \n\"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"","reference":"Sahih al-Bukhari 6404, Book 80, Hadith 99","grade":"","question #":"question #3","question":"What are the spiritual benefits associated with specific acts of worship in Islam?","id":"bukhari-80-315"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever says, 'Subhan Allah wa bihamdihi,' one hundred times a day, will be \nforgiven all his sins even if they were as much as the foam of the sea.","reference":"Sahih al-Bukhari 6405, Book 80, Hadith 100","grade":"","question #":"question #3","question":"What is the impact of consistent daily remembrance of Allah on a person's spiritual state?","id":"bukhari-80-316"},{"hadith-eng":"The Prophet (ﷺ) said, \"There are two expressions which are very easy for the tongue to say, but they are \nvery heavy in the balance and are very dear to The Beneficent (Allah), and they are, 'Subhan Allah Al- \n`Azim and 'Subhan Allah wa bihamdihi.'\"","reference":"Sahih al-Bukhari 6406, Book 80, Hadith 101","grade":"","question #":"question #3","question":"How do simple expressions impact one's spiritual balance according to Islamic teachings?","id":"bukhari-80-317"},{"hadith-eng":"The Prophet (ﷺ) said, \"The example of the one who celebrates the Praises of his Lord (Allah) in \ncomparison to the one who does not celebrate the Praises of his Lord, is that of a living creature \ncompared to a dead one.\"","reference":"Sahih al-Bukhari 6407, Book 80, Hadith 102","grade":"","question #":"question #3","question":"What is the comparison made between those who praise Allah and those who do not?","id":"bukhari-80-318"},{"hadith-eng":"Allah 's Apostle said, \"Allah has some angels who look for those who celebrate the Praises of Allah \non the roads and paths. And when they find some people celebrating the Praises of Allah, they call \neach other, saying, \"Come to the object of your pursuit.' \" He added, \"Then the angels encircle them \nwith their wings up to the sky of the world.\" He added. \"(after those people celebrated the Praises of \nAllah, and the angels go back), their Lord, asks them (those angels)----though He knows better than \nthem----'What do My slaves say?' The angels reply, 'They say: Subhan Allah, Allahu Akbar, and \nAlham-du-li l-lah, Allah then says 'Did they see Me?' The angels reply, 'No! By Allah, they didn't see \nYou.' \nAllah says, How it would have been if they saw Me?' The angels reply, 'If they saw You, they would \nworship You more devoutly and celebrate Your Glory more deeply, and declare Your freedom from \nany resemblance to anything more often.' Allah says (to the angels), 'What do they ask Me for?' The \nangels reply, 'They ask You for Paradise.' Allah says (to the angels), 'Did they see it?' The angels say, \n'No! By Allah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The \nangels say, 'If they saw it, they would have greater covetousness for it and would seek It with greater \nzeal and would have greater desire for it.' Allah says, 'From what do they seek refuge?' The angels \nreply, 'They seek refuge from the (Hell) Fire.' Allah says, 'Did they see it?' The angels say, 'No By \nAllah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The angels \nsay, 'If they saw it they would flee from it with the extreme fleeing and would have extreme fear from \nit.' Then Allah says, 'I make you witnesses that I have forgiven them.\"' Allah's Messenger (ﷺ) added, \"One of \nthe angels would say, 'There was so-and-so amongst them, and he was not one of them, but he had just \ncome for some need.' Allah would say, 'These are those people whose companions will not be reduced \nto misery.' \"","reference":"Sahih al-Bukhari 6408, Book 80, Hadith 103","grade":"","question #":"question #3","question":"What are the benefits of being in the company of those who remember and praise Allah?","id":"bukhari-80-319"},{"hadith-eng":"The Prophet (ﷺ) started ascending a high place or hill. A man (amongst his companions) ascended it and \nshouted in a loud voice, \"La ilaha illal-lahu wallahu Akbar.\" (At that time) Allah's Messenger (ﷺ) was riding \nhis mule. Allah's Messenger (ﷺ) said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu \nMusa (or, O `Abdullah)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He \nsaid, \"La haul a wala quwwata illa billah,\"","reference":"Sahih al-Bukhari 6409, Book 80, Hadith 104","grade":"","question #":"question #3","question":"What is the importance of acknowledging Allah's power and strength in a believer's life?","id":"bukhari-80-320"},{"hadith-eng":"Allah has ninety-nine Names, i.e., one hundred minus one, and whoever believes in their meanings \nand acts accordingly, will enter Paradise; and Allah is witr (one) and loves 'the witr' (i.e., odd \nnumbers).","reference":"Sahih al-Bukhari 6410, Book 80, Hadith 105","grade":"","question #":"question #3","question":"What is the reward for those who believe in and act according to the meanings of Allah's names?","id":"bukhari-80-321"},{"hadith-eng":"While we were waiting for `Abdullah (bin Mas`ud). Yazid bin Muawiya came. I said (to him), \"Will \nyou sit down?\" He said, \"No, but I will go into the house (of Ibn Mas`ud) and let your companion (Ibn \nMas`ud) come out to you; and if he should not (come out), I will come out and sit (with you).\" Then \n`Abdullah came out, holding the hand of Yazid, addressed us, saying, \"I know that you are assembled \nhere, but the reason that prevents me from coming out to you, is that Allah's Messenger (ﷺ) used to preach to \nus at intervals during the days, lest we should become bored.\"","reference":"Sahih al-Bukhari 6411, Book 80, Hadith 106","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) manage their time and interactions with him to avoid boredom?","id":"bukhari-80-322"}]