[{"hadith-eng":"We came to the Prophet (ﷺ) and we were young men nearly of equal ages and we stayed with him for \ntwenty nights. Allah's Messenger (ﷺ) was a very kind man and when he realized our longing for our families, \nhe asked us about those whom we had left behind. When we informed him, he said, \"Go back to your \nfamilies and stay with them and teach them (religion) and order them (to do good deeds). The Prophet (ﷺ) \nmentioned things some of which I remembered and some I did not. Then he said, \"Pray as you have \nseen me praying, and when it is the time of prayer, one of you should pronounce the call (Adhan) for \nthe prayer and the eldest of you should lead the prayer. \"","reference":"Sahih al-Bukhari 7246, Book 95, Hadith 1","grade":"","question #":"question #1","question":"What qualities did the Prophet Muhammad (ﷺ) exhibit when interacting with young companions?","id":"bukhari-95-1"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The (call for prayer) Adhan of Bilal should not stop anyone of you from taking \nhis Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, \nmay return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn \n(when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).","reference":"Sahih al-Bukhari 7247, Book 95, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of the Adhan of Bilal in relation to Suhur and night prayer?","id":"bukhari-95-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"Bilal pronounces the Adhan at night so that you may eat and drink till Ibn Um \nMaktum pronounces the Adhan (for the Fajr prayer).","reference":"Sahih al-Bukhari 7248, Book 95, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of the timing of the Adhan in relation to eating and drinking before Fajr prayer?","id":"bukhari-95-3"},{"hadith-eng":"The Prophet (ﷺ) led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had \nbeen increased.\" He (the Prophet (ﷺ) ) said, \"And what is that?\" They (the people) replied, \"You have \nprayed five rak`at.\" Then the Prophet (ﷺ) offered two prostrations (of Sahu) after he had finished his \nprayer with the Taslim.","reference":"Sahih al-Bukhari 7249, Book 95, Hadith 4","grade":"","question #":"question #1","question":"What should be done if a mistake is made during the prayer?","id":"bukhari-95-4"},{"hadith-eng":"Allah's Messenger (ﷺ) finished his prayer after offerings two rak`at only. Dhul-Yaddain asked him whether \nthe prayer had been reduced, or you had forgotten?\" The Prophet (ﷺ) said, \"Is Dhul-Yaddain speaking the \ntruth?\" The people said, \"Yes.\" Then Allah's Messenger (ﷺ) stood up and performed another two rak`at and \nthen finished prayer with Taslim, and then said the Takbir and performed a prostration similar to or \nlonger than his ordinary prostrations; then he raised his head, said Takbir and prostrated and then \nraised his head (Sahu prostrations).","reference":"Sahih al-Bukhari 7250, Book 95, Hadith 5","grade":"","question #":"question #1","question":"What should be done if a mistake is made during the prayer?","id":"bukhari-95-5"},{"hadith-eng":"While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \n\"Tonight Divine Inspiration has been revealed to Allah's Messenger (ﷺ) and he has been ordered to face the \nKa`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they \nturned their faces towards the Ka`ba (at Mecca).","reference":"Sahih al-Bukhari 7251, Book 95, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of the change in the Qibla direction in Islamic history?","id":"bukhari-95-6"},{"hadith-eng":"When Allah's Messenger (ﷺ) arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months \nbut he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- \n'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a \nprayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man \nprayed the `Asr prayer with the Prophet (ﷺ) and then went out, and passing by some people from the \nAnsar, he said, \"I testify. that I have prayed with the Prophet (ﷺ) and he (the Prophet) has prayed facing \nthe Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.","reference":"Sahih al-Bukhari 7252, Book 95, Hadith 7","grade":"","question #":"question #1","question":"What was the initial direction of prayer for Muslims before facing the Ka'ba?","id":"bukhari-95-7"},{"hadith-eng":"I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah \nand Ubai bin Ka`b. Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" \nAbii Talha then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar \nbelonging to us, and hit the jars with its lower part till they broke.","reference":"Sahih al-Bukhari 7253, Book 95, Hadith 8","grade":"","question #":"question #1","question":"What actions did the companions take upon learning about the prohibition of alcoholic drinks?","id":"bukhari-95-8"},{"hadith-eng":"The Prophet (ﷺ) said to the people of Najran, \"I will send to you an honest person who is really \ntrustworthy.\" The Companion, of the Prophet (ﷺ) each desired to be that person, but the Prophet (ﷺ) sent Abu \n'Ubaida.","reference":"Sahih al-Bukhari 7254, Book 95, Hadith 9","grade":"","question #":"question #1","question":"What qualities did the Prophet Muhammad (ﷺ) emphasize when selecting a representative for a task?","id":"bukhari-95-9"},{"hadith-eng":"The Prophet (ﷺ) said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of \nthis nation is Abu 'Ubaida.\"","reference":"Sahih al-Bukhari 7255, Book 95, Hadith 10","grade":"","question #":"question #1","question":"Who is considered the trustworthy person for the Muslim nation according to the Prophet Muhammad (ﷺ)?","id":"bukhari-95-10"},{"hadith-eng":"There was a man from the Ansar (who was a friend of mine). If he was not present in the company of \nAllah's Messenger (ﷺ) I used to be present with Allah's Messenger (ﷺ), I would tell him what I used to hear from \nAllah's Messenger (ﷺ), and when I was absent from Allah's Messenger (ﷺ) he used to be present with him, and he \nwould tell me what he used to hear from Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 7256, Book 95, Hadith 11","grade":"","question #":"question #1","question":"How did companions of the Prophet (ﷺ) ensure they shared knowledge of his teachings with each other?","id":"bukhari-95-11"},{"hadith-eng":"The Prophet (ﷺ) , sent an army and appointed some man their commander The man made a fire and then \nsaid (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have \nrun away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the \nProphet, and he said about people who had intended to enter the fire. ''If they had entered it, they \nwould have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil \ndeeds, obedience is required only in what is good .\"","reference":"Sahih al-Bukhari 7257, Book 95, Hadith 12","grade":"","question #":"question #1","question":"What is the Islamic perspective on obeying commands that involve evil deeds?","id":"bukhari-95-12"},{"hadith-eng":"Two men sued each other before the Prophet.","reference":"Sahih al-Bukhari 7258, 7259, Book 95, Hadith 13","grade":"","question #":"question #1","question":"What is the process of resolving disputes in Islam according to the teachings of the Prophet?","id":"bukhari-95-13"},{"hadith-eng":"Two men sued each other before the Prophet.","reference":"Sahih al-Bukhari 7258, 7259, Book 95, Hadith 13","grade":"","question #":"question #1","question":"What is the process followed when two individuals have a legal dispute in Islamic tradition?","id":"bukhari-95-14"},{"hadith-eng":"While we were with Allah's Messenger (ﷺ) a bedouin got up and said, \"O Allah's Messenger (ﷺ)! Settle my case \naccording to Allah's Book (Laws).\" Then his opponent got up and said, \"O Allah's Messenger (ﷺ)! He has \nsaid the truth! Settle his case according to Allah's Book (Laws.) and allow me to speak,\" He said, \"My \nson was a laborer for this man and he committed illegal sexual intercourse with his wife. The people \ntold me that my son should be stoned to death but I ransomed him with one-hundred sheep and a slave \ngirl. Then I asked the religious learned people and they told me that his wife should be stoned to death \nand my son should receive one-hundred lashes and be sentenced to one year of exile.' The Prophet (ﷺ) \nsaid, \"By Him in Whose Hands my life is, I will judge between you according to Allah's Book (Laws): \nAs for the slave girl and the sheep, they are to be returned; and as for your son, he shall receive onehundred \nlashes and will be exiled for one year. You, O Unais!\" addressing a man from Bani Aslam, \n\"Go tomorrow morning to the wife of this (man) and if she confesses, then stone her to death.\" The \nnext morning Unais went to the wife and she confessed, and he stoned her to death.","reference":"Sahih al-Bukhari 7260, Book 95, Hadith 14","grade":"","question #":"question #1","question":"How does Islamic law address cases of illegal sexual intercourse and what are the prescribed punishments?","id":"bukhari-95-15"},{"hadith-eng":"On the day of (the battle of) the Trench, the Prophet (ﷺ) called the people (to bring news about the \nenemy). Az-Zubair responded to his call. He called them again and Az-Zubair responded to his call \nagain; then he called them for the third time and again Az-Zubair responded to his call whereupon the \nProphet said, \"Every prophet has his Hawairi (helper), and Az-Zubair is my Hawari.\"","reference":"Sahih al-Bukhari 7261, Book 95, Hadith 15","grade":"","question #":"question #1","question":"What qualities make someone a close companion or helper of a prophet?","id":"bukhari-95-16"},{"hadith-eng":"The Prophet (ﷺ) entered a garden and told me to guard its gate. Then a man came and asked permission to \nenter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" \nBehold! It was Abu Bakr. Then `Umar came, and the Prophet (ﷺ) said, \"Admit him and give him the good \nnews that he will enter Paradise.\" Then `Uthman came and the Prophet (ﷺ) said, \"Admit him and give him \nthe good news that he will enter Paradise. \"","reference":"Sahih al-Bukhari 7262, Book 95, Hadith 16","grade":"","question #":"question #1","question":"What significance does the Prophet's assurance of Paradise hold for Abu Bakr, Umar, and Uthman?","id":"bukhari-95-17"},{"hadith-eng":"I came and behold, Allah's Messenger (ﷺ) was staying on a Mashroba (attic room) and a black slave of \nAllah's Messenger (ﷺ) was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- \nKhattab (asking for permission to enter).\" Then he admitted me.","reference":"Sahih al-Bukhari 7263, Book 95, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of seeking permission before entering someone's private space in Islamic teachings?","id":"bukhari-95-18"},{"hadith-eng":"Allah's Messenger (ﷺ) sent a letter to Khosrau and told his messenger to give it first to the ruler of Bahrain, \nand tell him to deliver it to Khosrau. When Khosrau had read it, he tore it into pieces. (Az-Zuhri said: \nI think Ibn Al-Musaiyab said, \"Allah's Messenger (ﷺ) invoked Allah to tear them (Khosrau and his followers) \ninto pieces.\"","reference":"Sahih al-Bukhari 7264, Book 95, Hadith 18","grade":"","question #":"question #1","question":"What was the reaction of Khosrau upon receiving the letter from the Prophet Muhammad (ﷺ)?","id":"bukhari-95-19"},{"hadith-eng":"Allah's Messenger (ﷺ) said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the \npeople) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the \nrest of the day; and whoever has not eaten anything, should complete his fast.' \"","reference":"Sahih al-Bukhari 7265, Book 95, Hadith 19","grade":"","question #":"question #1","question":"What instructions did the Prophet Muhammad (ﷺ) give regarding fasting on the day of 'Ashura'?","id":"bukhari-95-20"},{"hadith-eng":"When the delegate of `Abd Al-Qais came to Allah's Messenger (ﷺ), he said, \"Who are the delegate?\" They \nsaid, \"The delegate are from the tribe of Rabi`a.\" The Prophet (ﷺ) said, \"Welcome, O the delegate, and \nwelcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's \nApostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do \nsomething good (religious deeds) that by acting on them we may enter Paradise, and that we may \ninform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. \nHe forbade them from four things and ordered them to do four things. He ordered them to believe in \nAllah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His \nApostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the \nOne, Who has no partners with Him, and that Muhammad is Allah's Messenger (ﷺ); and to offer prayers \nperfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give \none-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 \nHantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet (ﷺ) said, \n\"Remember all these things by heart and preach it to those whom you have left behind.\"","reference":"Sahih al-Bukhari 7266, Book 95, Hadith 20","grade":"","question #":"question #1","question":"What are the fundamental beliefs and practices that lead to entering Paradise according to Islamic teachings?","id":"bukhari-95-21"},{"hadith-eng":"Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I \r\nstayed with Ibn `Umar for about two or one-and-half years and I did not hear him narrating any thing \r\nfrom the Prophet (ﷺ) except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet (ﷺ) \r\nincluding Sa`d, were going to eat meat, but one of the wives of the Prophet (ﷺ) called them, saying, 'It is \r\nthe meat of a Mastigure.' The people then stopped eating it. On that Allah's Messenger (ﷺ) said, 'Carry on \r\neating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"","reference":"Sahih al-Bukhari 7267, Book 95, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of the Prophet's companions seeking his guidance on dietary matters?","id":"bukhari-95-22"},{"hadith-eng":"We came to the Prophet (ﷺ) and we were young men nearly of equal ages and we stayed with him for \ntwenty nights. Allah's Messenger (ﷺ) was a very kind man and when he realized our longing for our families, \nhe asked us about those whom we had left behind. When we informed him, he said, \"Go back to your \nfamilies and stay with them and teach them (religion) and order them (to do good deeds). The Prophet (ﷺ) \nmentioned things some of which I remembered and some I did not. Then he said, \"Pray as you have \nseen me praying, and when it is the time of prayer, one of you should pronounce the call (Adhan) for \nthe prayer and the eldest of you should lead the prayer. \"","reference":"Sahih al-Bukhari 7246, Book 95, Hadith 1","grade":"","question #":"question #2","question":"What instructions did the Prophet Muhammad (ﷺ) give to his companions regarding family and religious duties?","id":"bukhari-95-23"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The (call for prayer) Adhan of Bilal should not stop anyone of you from taking \nhis Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, \nmay return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn \n(when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).","reference":"Sahih al-Bukhari 7247, Book 95, Hadith 2","grade":"","question #":"question #2","question":"How does the timing of the Adhan affect those who are praying or sleeping during the night?","id":"bukhari-95-24"},{"hadith-eng":"The Prophet (ﷺ) said, \"Bilal pronounces the Adhan at night so that you may eat and drink till Ibn Um \nMaktum pronounces the Adhan (for the Fajr prayer).","reference":"Sahih al-Bukhari 7248, Book 95, Hadith 3","grade":"","question #":"question #2","question":"How does the practice of pronouncing the Adhan at different times by different individuals affect the daily routine of Muslims?","id":"bukhari-95-25"},{"hadith-eng":"The Prophet (ﷺ) led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had \nbeen increased.\" He (the Prophet (ﷺ) ) said, \"And what is that?\" They (the people) replied, \"You have \nprayed five rak`at.\" Then the Prophet (ﷺ) offered two prostrations (of Sahu) after he had finished his \nprayer with the Taslim.","reference":"Sahih al-Bukhari 7249, Book 95, Hadith 4","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond when he was informed of an error in the number of rak'ahs during prayer?","id":"bukhari-95-26"},{"hadith-eng":"Allah's Messenger (ﷺ) finished his prayer after offerings two rak`at only. Dhul-Yaddain asked him whether \nthe prayer had been reduced, or you had forgotten?\" The Prophet (ﷺ) said, \"Is Dhul-Yaddain speaking the \ntruth?\" The people said, \"Yes.\" Then Allah's Messenger (ﷺ) stood up and performed another two rak`at and \nthen finished prayer with Taslim, and then said the Takbir and performed a prostration similar to or \nlonger than his ordinary prostrations; then he raised his head, said Takbir and prostrated and then \nraised his head (Sahu prostrations).","reference":"Sahih al-Bukhari 7250, Book 95, Hadith 5","grade":"","question #":"question #2","question":"How did the companions confirm the truth of Dhul-Yaddain's statement to the Prophet?","id":"bukhari-95-27"},{"hadith-eng":"While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \n\"Tonight Divine Inspiration has been revealed to Allah's Messenger (ﷺ) and he has been ordered to face the \nKa`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they \nturned their faces towards the Ka`ba (at Mecca).","reference":"Sahih al-Bukhari 7251, Book 95, Hadith 6","grade":"","question #":"question #2","question":"How did the early Muslims respond to the revelation about changing the direction of prayer?","id":"bukhari-95-28"},{"hadith-eng":"When Allah's Messenger (ﷺ) arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months \nbut he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- \n'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a \nprayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man \nprayed the `Asr prayer with the Prophet (ﷺ) and then went out, and passing by some people from the \nAnsar, he said, \"I testify. that I have prayed with the Prophet (ﷺ) and he (the Prophet) has prayed facing \nthe Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.","reference":"Sahih al-Bukhari 7252, Book 95, Hadith 7","grade":"","question #":"question #2","question":"How did the revelation of the new Qibla direction impact the prayer practices of the early Muslims?","id":"bukhari-95-29"},{"hadith-eng":"I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah \nand Ubai bin Ka`b. Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" \nAbii Talha then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar \nbelonging to us, and hit the jars with its lower part till they broke.","reference":"Sahih al-Bukhari 7253, Book 95, Hadith 8","grade":"","question #":"question #2","question":"How did the companions demonstrate their obedience to new Islamic rulings?","id":"bukhari-95-30"},{"hadith-eng":"The Prophet (ﷺ) said to the people of Najran, \"I will send to you an honest person who is really \ntrustworthy.\" The Companion, of the Prophet (ﷺ) each desired to be that person, but the Prophet (ﷺ) sent Abu \n'Ubaida.","reference":"Sahih al-Bukhari 7254, Book 95, Hadith 9","grade":"","question #":"question #2","question":"Why is trustworthiness considered an important trait in Islamic leadership?","id":"bukhari-95-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of \nthis nation is Abu 'Ubaida.\"","reference":"Sahih al-Bukhari 7255, Book 95, Hadith 10","grade":"","question #":"question #2","question":"What qualities are associated with being an Amin in Islamic teachings?","id":"bukhari-95-32"},{"hadith-eng":"There was a man from the Ansar (who was a friend of mine). If he was not present in the company of \nAllah's Messenger (ﷺ) I used to be present with Allah's Messenger (ﷺ), I would tell him what I used to hear from \nAllah's Messenger (ﷺ), and when I was absent from Allah's Messenger (ﷺ) he used to be present with him, and he \nwould tell me what he used to hear from Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 7256, Book 95, Hadith 11","grade":"","question #":"question #2","question":"What methods were used by the companions to stay informed about the teachings of the Prophet (ﷺ) when they were absent?","id":"bukhari-95-33"},{"hadith-eng":"The Prophet (ﷺ) , sent an army and appointed some man their commander The man made a fire and then \nsaid (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have \nrun away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the \nProphet, and he said about people who had intended to enter the fire. ''If they had entered it, they \nwould have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil \ndeeds, obedience is required only in what is good .\"","reference":"Sahih al-Bukhari 7257, Book 95, Hadith 12","grade":"","question #":"question #2","question":"How does Islam view the concept of obedience to authority in relation to moral and ethical actions?","id":"bukhari-95-34"},{"hadith-eng":"Two men sued each other before the Prophet.","reference":"Sahih al-Bukhari 7258, 7259, Book 95, Hadith 13","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle legal cases brought before him?","id":"bukhari-95-35"},{"hadith-eng":"Two men sued each other before the Prophet.","reference":"Sahih al-Bukhari 7258, 7259, Book 95, Hadith 13","grade":"","question #":"question #2","question":"How does Islamic jurisprudence address conflicts between individuals?","id":"bukhari-95-36"},{"hadith-eng":"While we were with Allah's Messenger (ﷺ) a bedouin got up and said, \"O Allah's Messenger (ﷺ)! Settle my case \naccording to Allah's Book (Laws).\" Then his opponent got up and said, \"O Allah's Messenger (ﷺ)! He has \nsaid the truth! Settle his case according to Allah's Book (Laws.) and allow me to speak,\" He said, \"My \nson was a laborer for this man and he committed illegal sexual intercourse with his wife. The people \ntold me that my son should be stoned to death but I ransomed him with one-hundred sheep and a slave \ngirl. Then I asked the religious learned people and they told me that his wife should be stoned to death \nand my son should receive one-hundred lashes and be sentenced to one year of exile.' The Prophet (ﷺ) \nsaid, \"By Him in Whose Hands my life is, I will judge between you according to Allah's Book (Laws): \nAs for the slave girl and the sheep, they are to be returned; and as for your son, he shall receive onehundred \nlashes and will be exiled for one year. You, O Unais!\" addressing a man from Bani Aslam, \n\"Go tomorrow morning to the wife of this (man) and if she confesses, then stone her to death.\" The \nnext morning Unais went to the wife and she confessed, and he stoned her to death.","reference":"Sahih al-Bukhari 7260, Book 95, Hadith 14","grade":"","question #":"question #2","question":"What is the significance of seeking judgment according to Allah's Book in resolving disputes?","id":"bukhari-95-37"},{"hadith-eng":"On the day of (the battle of) the Trench, the Prophet (ﷺ) called the people (to bring news about the \nenemy). Az-Zubair responded to his call. He called them again and Az-Zubair responded to his call \nagain; then he called them for the third time and again Az-Zubair responded to his call whereupon the \nProphet said, \"Every prophet has his Hawairi (helper), and Az-Zubair is my Hawari.\"","reference":"Sahih al-Bukhari 7261, Book 95, Hadith 15","grade":"","question #":"question #2","question":"How did Az-Zubair demonstrate his loyalty and dedication during the battle of the Trench?","id":"bukhari-95-38"},{"hadith-eng":"The Prophet (ﷺ) entered a garden and told me to guard its gate. Then a man came and asked permission to \nenter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" \nBehold! It was Abu Bakr. Then `Umar came, and the Prophet (ﷺ) said, \"Admit him and give him the good \nnews that he will enter Paradise.\" Then `Uthman came and the Prophet (ﷺ) said, \"Admit him and give him \nthe good news that he will enter Paradise. \"","reference":"Sahih al-Bukhari 7262, Book 95, Hadith 16","grade":"","question #":"question #2","question":"How does the concept of giving good news of Paradise reflect the status of certain companions in Islam?","id":"bukhari-95-39"},{"hadith-eng":"I came and behold, Allah's Messenger (ﷺ) was staying on a Mashroba (attic room) and a black slave of \nAllah's Messenger (ﷺ) was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- \nKhattab (asking for permission to enter).\" Then he admitted me.","reference":"Sahih al-Bukhari 7263, Book 95, Hadith 17","grade":"","question #":"question #2","question":"How does the interaction between Umar and the Prophet's servant reflect the social dynamics of the time?","id":"bukhari-95-40"},{"hadith-eng":"Allah's Messenger (ﷺ) sent a letter to Khosrau and told his messenger to give it first to the ruler of Bahrain, \nand tell him to deliver it to Khosrau. When Khosrau had read it, he tore it into pieces. (Az-Zuhri said: \nI think Ibn Al-Musaiyab said, \"Allah's Messenger (ﷺ) invoked Allah to tear them (Khosrau and his followers) \ninto pieces.\"","reference":"Sahih al-Bukhari 7264, Book 95, Hadith 18","grade":"","question #":"question #2","question":"What was the instruction given by the Prophet Muhammad (ﷺ) regarding the delivery of his letter to Khosrau?","id":"bukhari-95-41"},{"hadith-eng":"Allah's Messenger (ﷺ) said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the \npeople) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the \nrest of the day; and whoever has not eaten anything, should complete his fast.' \"","reference":"Sahih al-Bukhari 7265, Book 95, Hadith 19","grade":"","question #":"question #2","question":"How should individuals who have already eaten on the day of 'Ashura' observe the fast?","id":"bukhari-95-42"},{"hadith-eng":"When the delegate of `Abd Al-Qais came to Allah's Messenger (ﷺ), he said, \"Who are the delegate?\" They \nsaid, \"The delegate are from the tribe of Rabi`a.\" The Prophet (ﷺ) said, \"Welcome, O the delegate, and \nwelcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's \nApostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do \nsomething good (religious deeds) that by acting on them we may enter Paradise, and that we may \ninform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. \nHe forbade them from four things and ordered them to do four things. He ordered them to believe in \nAllah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His \nApostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the \nOne, Who has no partners with Him, and that Muhammad is Allah's Messenger (ﷺ); and to offer prayers \nperfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give \none-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 \nHantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet (ﷺ) said, \n\"Remember all these things by heart and preach it to those whom you have left behind.\"","reference":"Sahih al-Bukhari 7266, Book 95, Hadith 20","grade":"","question #":"question #2","question":"What are the specific prohibitions related to drinking utensils mentioned in Islamic teachings?","id":"bukhari-95-43"},{"hadith-eng":"Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I \r\nstayed with Ibn `Umar for about two or one-and-half years and I did not hear him narrating any thing \r\nfrom the Prophet (ﷺ) except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet (ﷺ) \r\nincluding Sa`d, were going to eat meat, but one of the wives of the Prophet (ﷺ) called them, saying, 'It is \r\nthe meat of a Mastigure.' The people then stopped eating it. On that Allah's Messenger (ﷺ) said, 'Carry on \r\neating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"","reference":"Sahih al-Bukhari 7267, Book 95, Hadith 21","grade":"","question #":"question #2","question":"How does the Prophet's response reflect the permissibility of certain foods in Islam?","id":"bukhari-95-44"},{"hadith-eng":"We came to the Prophet (ﷺ) and we were young men nearly of equal ages and we stayed with him for \ntwenty nights. Allah's Messenger (ﷺ) was a very kind man and when he realized our longing for our families, \nhe asked us about those whom we had left behind. When we informed him, he said, \"Go back to your \nfamilies and stay with them and teach them (religion) and order them (to do good deeds). The Prophet (ﷺ) \nmentioned things some of which I remembered and some I did not. Then he said, \"Pray as you have \nseen me praying, and when it is the time of prayer, one of you should pronounce the call (Adhan) for \nthe prayer and the eldest of you should lead the prayer. \"","reference":"Sahih al-Bukhari 7246, Book 95, Hadith 1","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide on how to perform prayers and lead them?","id":"bukhari-95-45"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The (call for prayer) Adhan of Bilal should not stop anyone of you from taking \nhis Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, \nmay return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn \n(when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).","reference":"Sahih al-Bukhari 7247, Book 95, Hadith 2","grade":"","question #":"question #3","question":"What guidance is provided regarding the consumption of Suhur before the dawn prayer?","id":"bukhari-95-46"},{"hadith-eng":"The Prophet (ﷺ) said, \"Bilal pronounces the Adhan at night so that you may eat and drink till Ibn Um \nMaktum pronounces the Adhan (for the Fajr prayer).","reference":"Sahih al-Bukhari 7248, Book 95, Hadith 3","grade":"","question #":"question #3","question":"What role does the Adhan play in regulating the pre-dawn activities of Muslims during Ramadan?","id":"bukhari-95-47"},{"hadith-eng":"The Prophet (ﷺ) led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had \nbeen increased.\" He (the Prophet (ﷺ) ) said, \"And what is that?\" They (the people) replied, \"You have \nprayed five rak`at.\" Then the Prophet (ﷺ) offered two prostrations (of Sahu) after he had finished his \nprayer with the Taslim.","reference":"Sahih al-Bukhari 7249, Book 95, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of performing prostrations of forgetfulness (Sahu) in Islamic prayer?","id":"bukhari-95-48"},{"hadith-eng":"Allah's Messenger (ﷺ) finished his prayer after offerings two rak`at only. Dhul-Yaddain asked him whether \nthe prayer had been reduced, or you had forgotten?\" The Prophet (ﷺ) said, \"Is Dhul-Yaddain speaking the \ntruth?\" The people said, \"Yes.\" Then Allah's Messenger (ﷺ) stood up and performed another two rak`at and \nthen finished prayer with Taslim, and then said the Takbir and performed a prostration similar to or \nlonger than his ordinary prostrations; then he raised his head, said Takbir and prostrated and then \nraised his head (Sahu prostrations).","reference":"Sahih al-Bukhari 7250, Book 95, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of performing Sahu prostrations in prayer?","id":"bukhari-95-49"},{"hadith-eng":"While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \n\"Tonight Divine Inspiration has been revealed to Allah's Messenger (ﷺ) and he has been ordered to face the \nKa`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they \nturned their faces towards the Ka`ba (at Mecca).","reference":"Sahih al-Bukhari 7251, Book 95, Hadith 6","grade":"","question #":"question #3","question":"What does the immediate response of the people at Quba indicate about their faith and obedience?","id":"bukhari-95-50"},{"hadith-eng":"When Allah's Messenger (ﷺ) arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months \nbut he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- \n'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a \nprayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man \nprayed the `Asr prayer with the Prophet (ﷺ) and then went out, and passing by some people from the \nAnsar, he said, \"I testify. that I have prayed with the Prophet (ﷺ) and he (the Prophet) has prayed facing \nthe Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.","reference":"Sahih al-Bukhari 7252, Book 95, Hadith 7","grade":"","question #":"question #3","question":"What does the change in Qibla direction signify about the relationship between divine guidance and prophetic wishes?","id":"bukhari-95-51"},{"hadith-eng":"I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah \nand Ubai bin Ka`b. Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" \nAbii Talha then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar \nbelonging to us, and hit the jars with its lower part till they broke.","reference":"Sahih al-Bukhari 7253, Book 95, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of immediate compliance with Islamic prohibitions as shown by the companions?","id":"bukhari-95-52"},{"hadith-eng":"The Prophet (ﷺ) said to the people of Najran, \"I will send to you an honest person who is really \ntrustworthy.\" The Companion, of the Prophet (ﷺ) each desired to be that person, but the Prophet (ﷺ) sent Abu \n'Ubaida.","reference":"Sahih al-Bukhari 7254, Book 95, Hadith 9","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) react to the prospect of being chosen for a significant responsibility?","id":"bukhari-95-53"},{"hadith-eng":"The Prophet (ﷺ) said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of \nthis nation is Abu 'Ubaida.\"","reference":"Sahih al-Bukhari 7255, Book 95, Hadith 10","grade":"","question #":"question #3","question":"Why is trustworthiness emphasized in the leadership of a nation in Islam?","id":"bukhari-95-54"},{"hadith-eng":"There was a man from the Ansar (who was a friend of mine). If he was not present in the company of \nAllah's Messenger (ﷺ) I used to be present with Allah's Messenger (ﷺ), I would tell him what I used to hear from \nAllah's Messenger (ﷺ), and when I was absent from Allah's Messenger (ﷺ) he used to be present with him, and he \nwould tell me what he used to hear from Allah's Messenger (ﷺ) .","reference":"Sahih al-Bukhari 7256, Book 95, Hadith 11","grade":"","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) collaborate to preserve and transmit his teachings?","id":"bukhari-95-55"},{"hadith-eng":"The Prophet (ﷺ) , sent an army and appointed some man their commander The man made a fire and then \nsaid (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have \nrun away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the \nProphet, and he said about people who had intended to enter the fire. ''If they had entered it, they \nwould have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil \ndeeds, obedience is required only in what is good .\"","reference":"Sahih al-Bukhari 7257, Book 95, Hadith 12","grade":"","question #":"question #3","question":"What are the consequences of following commands that contradict Islamic teachings?","id":"bukhari-95-56"},{"hadith-eng":"Two men sued each other before the Prophet.","reference":"Sahih al-Bukhari 7258, 7259, Book 95, Hadith 13","grade":"","question #":"question #3","question":"What role do witnesses and evidence play in Islamic legal proceedings?","id":"bukhari-95-57"},{"hadith-eng":"Two men sued each other before the Prophet.","reference":"Sahih al-Bukhari 7258, 7259, Book 95, Hadith 13","grade":"","question #":"question #3","question":"What role does the Prophet play in resolving disputes according to Islamic teachings?","id":"bukhari-95-58"},{"hadith-eng":"While we were with Allah's Messenger (ﷺ) a bedouin got up and said, \"O Allah's Messenger (ﷺ)! Settle my case \naccording to Allah's Book (Laws).\" Then his opponent got up and said, \"O Allah's Messenger (ﷺ)! He has \nsaid the truth! Settle his case according to Allah's Book (Laws.) and allow me to speak,\" He said, \"My \nson was a laborer for this man and he committed illegal sexual intercourse with his wife. The people \ntold me that my son should be stoned to death but I ransomed him with one-hundred sheep and a slave \ngirl. Then I asked the religious learned people and they told me that his wife should be stoned to death \nand my son should receive one-hundred lashes and be sentenced to one year of exile.' The Prophet (ﷺ) \nsaid, \"By Him in Whose Hands my life is, I will judge between you according to Allah's Book (Laws): \nAs for the slave girl and the sheep, they are to be returned; and as for your son, he shall receive onehundred \nlashes and will be exiled for one year. You, O Unais!\" addressing a man from Bani Aslam, \n\"Go tomorrow morning to the wife of this (man) and if she confesses, then stone her to death.\" The \nnext morning Unais went to the wife and she confessed, and he stoned her to death.","reference":"Sahih al-Bukhari 7260, Book 95, Hadith 14","grade":"","question #":"question #3","question":"What role does confession play in the implementation of Islamic legal punishments?","id":"bukhari-95-59"},{"hadith-eng":"On the day of (the battle of) the Trench, the Prophet (ﷺ) called the people (to bring news about the \nenemy). Az-Zubair responded to his call. He called them again and Az-Zubair responded to his call \nagain; then he called them for the third time and again Az-Zubair responded to his call whereupon the \nProphet said, \"Every prophet has his Hawairi (helper), and Az-Zubair is my Hawari.\"","reference":"Sahih al-Bukhari 7261, Book 95, Hadith 15","grade":"","question #":"question #3","question":"What significance does the title 'Hawari' hold in Islamic tradition?","id":"bukhari-95-60"},{"hadith-eng":"The Prophet (ﷺ) entered a garden and told me to guard its gate. Then a man came and asked permission to \nenter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" \nBehold! It was Abu Bakr. Then `Umar came, and the Prophet (ﷺ) said, \"Admit him and give him the good \nnews that he will enter Paradise.\" Then `Uthman came and the Prophet (ﷺ) said, \"Admit him and give him \nthe good news that he will enter Paradise. \"","reference":"Sahih al-Bukhari 7262, Book 95, Hadith 16","grade":"","question #":"question #3","question":"What role did Abu Musa play in the event where the Prophet gave glad tidings of Paradise to certain individuals?","id":"bukhari-95-61"},{"hadith-eng":"I came and behold, Allah's Messenger (ﷺ) was staying on a Mashroba (attic room) and a black slave of \nAllah's Messenger (ﷺ) was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- \nKhattab (asking for permission to enter).\" Then he admitted me.","reference":"Sahih al-Bukhari 7263, Book 95, Hadith 17","grade":"","question #":"question #3","question":"What can be learned about the Prophet's living conditions from this narration?","id":"bukhari-95-62"},{"hadith-eng":"Allah's Messenger (ﷺ) sent a letter to Khosrau and told his messenger to give it first to the ruler of Bahrain, \nand tell him to deliver it to Khosrau. When Khosrau had read it, he tore it into pieces. (Az-Zuhri said: \nI think Ibn Al-Musaiyab said, \"Allah's Messenger (ﷺ) invoked Allah to tear them (Khosrau and his followers) \ninto pieces.\"","reference":"Sahih al-Bukhari 7264, Book 95, Hadith 18","grade":"","question #":"question #3","question":"What was the consequence mentioned in the hadith for Khosrau's action of tearing the letter?","id":"bukhari-95-63"},{"hadith-eng":"Allah's Messenger (ﷺ) said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the \npeople) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the \nrest of the day; and whoever has not eaten anything, should complete his fast.' \"","reference":"Sahih al-Bukhari 7265, Book 95, Hadith 19","grade":"","question #":"question #3","question":"What guidance is provided for those who have not eaten on the day of 'Ashura'?","id":"bukhari-95-64"},{"hadith-eng":"When the delegate of `Abd Al-Qais came to Allah's Messenger (ﷺ), he said, \"Who are the delegate?\" They \nsaid, \"The delegate are from the tribe of Rabi`a.\" The Prophet (ﷺ) said, \"Welcome, O the delegate, and \nwelcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's \nApostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do \nsomething good (religious deeds) that by acting on them we may enter Paradise, and that we may \ninform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. \nHe forbade them from four things and ordered them to do four things. He ordered them to believe in \nAllah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His \nApostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the \nOne, Who has no partners with Him, and that Muhammad is Allah's Messenger (ﷺ); and to offer prayers \nperfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give \none-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 \nHantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet (ﷺ) said, \n\"Remember all these things by heart and preach it to those whom you have left behind.\"","reference":"Sahih al-Bukhari 7266, Book 95, Hadith 20","grade":"","question #":"question #3","question":"How important is it to convey religious teachings to others in Islam?","id":"bukhari-95-65"},{"hadith-eng":"Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I \r\nstayed with Ibn `Umar for about two or one-and-half years and I did not hear him narrating any thing \r\nfrom the Prophet (ﷺ) except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet (ﷺ) \r\nincluding Sa`d, were going to eat meat, but one of the wives of the Prophet (ﷺ) called them, saying, 'It is \r\nthe meat of a Mastigure.' The people then stopped eating it. On that Allah's Messenger (ﷺ) said, 'Carry on \r\neating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"","reference":"Sahih al-Bukhari 7267, Book 95, Hadith 21","grade":"","question #":"question #3","question":"What can be inferred about the dietary preferences of the Prophet from this narration?","id":"bukhari-95-66"}]