[{"hadith-eng":"A Jew said to `Umar, \"O Chief of the Believers, if this verse: 'This day I have perfected your religion \nfor you, completed My favors upon you, and have chosen for you, Islam as your religion.' (5.3) had \nbeen revealed upon us, we would have taken that day as an `Id (festival) day.\" `Umar said, \"I know \ndefinitely on what day this Verse was revealed; it was revealed on the day of `Arafat, on a Friday.\"","reference":"Sahih al-Bukhari 7268, Book 96, Hadith 1","grade":"","question #":"question #1","question":"What significance does the verse 'This day I have perfected your religion for you' hold in Islam?","id":"bukhari-96-1"},{"hadith-eng":"That he heard `Umar speaking while standing on the pulpit of the Prophet (ﷺ) in the morning (following \nthe death of the Prophet), when the people had sworn allegiance to Abu Bakr. He said the Tashah-hud \nbefore Abu Bakr, and said, \"Amma Ba'du (then after) Allah has chosen for his Apostle what is with \nHim (Paradise) rather than what is with you (the world). This is that Book (Qur'an) with which Allah \nguided your Apostle, so stick to it, for then you will be guided on the right path as Allah guided His \nApostle with it.\"","reference":"Sahih al-Bukhari 7269, Book 96, Hadith 2","grade":"","question #":"question #1","question":"What significance does the Qur'an hold in guiding the followers of Islam according to the teachings of the Prophet?","id":"bukhari-96-2"},{"hadith-eng":"The Prophet (ﷺ) embraced me and said, \"O Allah! Teach him (the knowledge of) the Book (Qur'an).\"","reference":"Sahih al-Bukhari 7270, Book 96, Hadith 3","grade":"","question #":"question #1","question":"What significance does the Prophet's supplication hold in the context of seeking knowledge?","id":"bukhari-96-3"},{"hadith-eng":"Abu Barza said, \"(O people!) Allah makes you self-sufficient or has raised you high with Islam and \nwith Muhammad.\"","reference":"Sahih al-Bukhari 7271, Book 96, Hadith 4","grade":"","question #":"question #1","question":"How does Islam contribute to the self-sufficiency and elevation of individuals?","id":"bukhari-96-4"},{"hadith-eng":"`Abdullah Bin `Umar wrote to `Abdul Malik bin Marwan, swearing allegiance to him: 'I swear \nallegiance to you in that I will listen and obey what is in accordance with the Laws of Allah and the \nTradition of His Apostle as much as I can.'","reference":"Sahih al-Bukhari 7272, Book 96, Hadith 5","grade":"","question #":"question #1","question":"What is the significance of swearing allegiance in Islam, particularly in relation to obedience to Allah's laws and the Prophet's traditions?","id":"bukhari-96-5"},{"hadith-eng":"Abu Huraira said that Allah's Messenger (ﷺ) said, \"I have been sent with 'Jawami-al-Kalim ' (the shortest \nexpression with the widest meaning) and have been made victorious with awe (cast in my enemy's \nhearts), and while I was sleeping, I saw that the keys of the treasures of the world were placed in my \nhand.\" Abu Huraira added: Allah's Messenger (ﷺ) has gone, and you people are utilizing those treasures, or \ndigging those treasures out.\" or said a similar sentence.","reference":"Sahih al-Bukhari 7273, Book 96, Hadith 6","grade":"","question #":"question #1","question":"What does the term 'Jawami-al-Kalim' signify in the context of the Prophet's teachings?","id":"bukhari-96-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"There was no prophet among the prophets but was given miracles because of \nwhich people had security or had belief, but what I was given was the Divine Inspiration which Allah \nrevealed to me. So I hope that my followers will be more than those of any other prophet on the Day \nof Resurrection.\"","reference":"Sahih al-Bukhari 7274, Book 96, Hadith 7","grade":"","question #":"question #1","question":"What distinguishes the miracles given to Prophet Muhammad from those given to other prophets?","id":"bukhari-96-7"},{"hadith-eng":"I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar once sat beside me here \nas you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the \nKa`ba) among the Muslims'. I said, 'You cannot do that.' `Umar said, 'Why?' I said, 'Your two \n(previous) companions (the Prophet (ﷺ) and Abu Bakr) did not do it. `Umar said, 'They are the two \npersons whom one must follow.'\" (See Hadith No. 664, Vol. 2)","reference":"Sahih al-Bukhari 7275, Book 96, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of following the actions of the Prophet Muhammad and his companions in decision-making?","id":"bukhari-96-8"},{"hadith-eng":"Allah's Messenger (ﷺ) said to us, \"Honesty descended from the Heavens and settled in the roots of the hearts \nof men (faithful believers), and then the Qur'an was revealed and the people read the Qur'an, (and \nlearnt it from it) and also learnt it from the Sunna.\" Both Qur'an and Sunna strengthened their (the \nfaithful believers') honesty. (See Hadith No. 208)","reference":"Sahih al-Bukhari 7276, Book 96, Hadith 9","grade":"","question #":"question #1","question":"How does honesty relate to the faith of believers according to Islamic teachings?","id":"bukhari-96-9"},{"hadith-eng":"The best talk (speech) is Allah's Book 'Qur'an), and the best way is the way of Muhammad, and the \nworst matters are the heresies (those new things which are introduced into the religion); and whatever \nyou have been promised will surely come to pass, and you cannot escape (it).","reference":"Sahih al-Bukhari 7277, Book 96, Hadith 10","grade":"","question #":"question #1","question":"What is considered the best form of speech in Islam?","id":"bukhari-96-10"},{"hadith-eng":"We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's \nBook (Laws).\"","reference":"Sahih al-Bukhari 7278, 7279, Book 96, Hadith 11","grade":"","question #":"question #1","question":"How does the Prophet Muhammad (ﷺ) approach judgment and decision-making according to Islamic teachings?","id":"bukhari-96-11"},{"hadith-eng":"We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's \nBook (Laws).\"","reference":"Sahih al-Bukhari 7278, 7279, Book 96, Hadith 11","grade":"","question #":"question #1","question":"How does the Prophet Muhammad (ﷺ) emphasize the importance of judging disputes according to the Book of Allah?","id":"bukhari-96-12"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"All my followers will enter Paradise except those who refuse.\" They said, \"O \nAllah's Messenger (ﷺ)! Who will refuse?\" He said, \"Whoever obeys me will enter Paradise, and whoever \ndisobeys me is the one who refuses (to enter it).\"","reference":"Sahih al-Bukhari 7280, Book 96, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of obedience to the Prophet Muhammad (ﷺ) in attaining Paradise?","id":"bukhari-96-13"},{"hadith-eng":"Some angels came to the Prophet (ﷺ) while he was sleeping. Some of them said, \"He is sleeping.\" Others \nsaid, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this \ncompanion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He \nis sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His \nexample is that of a man who has built a house and then offered therein a banquet and sent an inviter \n(messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house \nand ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the \nhouse, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he \nmay understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but \nhis heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is \nMuhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, \ndisobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished \nfrom the bad, and the believers from the disbelievers).","reference":"Sahih al-Bukhari 7281, Book 96, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of the metaphor of a house and a banquet in understanding the message of Islam?","id":"bukhari-96-14"},{"hadith-eng":"Hudhaifa said, \"O the Group of Al-Qurra! Follow the straight path, for then you have taken a great \nlead (and will be the leaders), but if you divert right or left, then you will go astray far away.\"","reference":"Sahih al-Bukhari 7282, Book 96, Hadith 14","grade":"","question #":"question #1","question":"What is the significance of following the straight path in Islam?","id":"bukhari-96-15"},{"hadith-eng":"The Prophet (ﷺ) said, \"My example and the example of what I have been sent with is that of a man who \ncame to some people and said, 'O people! I have seen the enemy's army with my own eyes, and I am \nthe naked warner; so protect yourselves!' Then a group of his people obeyed him and fled at night \nproceeding stealthily till they were safe, while another group of them disbelieved him and stayed at \ntheir places till morning when the army came upon them, and killed and ruined them completely So \nthis is the example of that person who obeys me and follows what I have brought (the Qur'an and the \nSunna), and the example of the one who disobeys me and disbelieves the truth I have brought.\"","reference":"Sahih al-Bukhari 7283, Book 96, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of heeding warnings and taking precautionary actions in the context of faith?","id":"bukhari-96-16"},{"hadith-eng":"When Allah's Messenger (ﷺ) died and Abu Bakr was elected as a Caliph after him, some of the Arabs \nreverted to disbelief, `Umar said to Abu Bakr, \"How dare you fight the people while Allah's Messenger (ﷺ) \nsaid, I have been ordered to fight the people till they say 'None has the right to be worshipped but \nAllah' And whoever says: None has the right to be worshipped but Allah.' waves his wealth and his \nlife from me unless he deserves a legal punishment lusty, and his account will be with Allah! Abu \nBakr said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the \nCompulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope \nwhich they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar said, 'By \nAllah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr to the fight, and I \ncame to know for certain that was the truth.\"","reference":"Sahih al-Bukhari 7284, 7285, Book 96, Hadith 16","grade":"","question #":"question #1","question":"What was Abu Bakr's stance on those who refused to pay Zakat after the death of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-17"},{"hadith-eng":"When Allah's Messenger (ﷺ) died and Abu Bakr was elected as a Caliph after him, some of the Arabs \nreverted to disbelief, `Umar said to Abu Bakr, \"How dare you fight the people while Allah's Messenger (ﷺ) \nsaid, I have been ordered to fight the people till they say 'None has the right to be worshipped but \nAllah' And whoever says: None has the right to be worshipped but Allah.' waves his wealth and his \nlife from me unless he deserves a legal punishment lusty, and his account will be with Allah! Abu \nBakr said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the \nCompulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope \nwhich they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar said, 'By \nAllah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr to the fight, and I \ncame to know for certain that was the truth.\"","reference":"Sahih al-Bukhari 7284, 7285, Book 96, Hadith 16","grade":"","question #":"question #1","question":"What was the stance of Abu Bakr regarding those who refused to pay Zakat after the death of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-18"},{"hadith-eng":"Uyaina bin Hisn bin Hudhaifa bin Badr came and stayed (at Medina) with his nephew Al-Hurr bin \nQais bin Hisn who was one of those whom `Umar used to keep near him, as the Qurra' (learned men \nknowing Qur'an by heart) were the people of `Umar's meetings and his advisors whether they were old \nor young. 'Uyaina said to his nephew, \"O my nephew! Have you an approach to this chief so as to get \nfor me the permission to see him?\" His nephew said, \"I will get the permission for you to see him.\" \n(Ibn `Abbas added: ) So he took the permission for 'Uyaina, and when the latter entered, he said, \"O \nthe son of Al-Khattab! By Allah, you neither give us sufficient provision nor judge among us with \njustice.\" On that `Umar became so furious that he intended to harm him. Al-Hurr, said, \"O Chief of \nthe Believers!\" Allah said to His Apostle 'Hold to forgiveness, command what is good (right), and \nleave the foolish (i.e. do not punish them).' (7.199) and this person is among the foolish.\" By Allah, \n`Umar did not overlook that Verse when Al-Hurr recited it before him, and `Umar said to observe (the \norders of) Allah's Book strictly.\" (See Hadith No. 166, Vol. 6)","reference":"Sahih al-Bukhari 7286, Book 96, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of having learned individuals as advisors in leadership according to Islamic teachings?","id":"bukhari-96-19"},{"hadith-eng":"I came to `Aisha during the solar eclipse. The people were standing (offering prayer) and she too, was \nstanding and offering prayer. I asked, \"What is wrong with the people?\" She pointed towards the sky \nwith her hand and said, Subhan Allah!'' I asked her, \"Is there a sign?\" She nodded with her head \nmeaning, yes. When Allah's Messenger (ﷺ) finished (the prayer), he glorified and praised Allah and said, \n\"There is not anything that I have not seen before but I have seen now at this place of mine, even \nParadise and Hell. It has been revealed to me that you people will be put to trial nearly like the trial of \nAd-Dajjal, in your graves. As for the true believer or a Muslim (the sub-narrator is not sure as to \nwhich of the two (words Asma' had said) he will say, 'Muhammad came with clear signs from Allah, \nand we responded to him (accepted his teachings) and believed (what he said)' It will be said (to him) \n'Sleep in peace; we have known that you were a true believer who believed with certainty.' As for a \nhypocrite or a doubtful person, (the sub-narrator is not sure as to which word Asma' said) he will say, \n'I do not know, but I heard the people saying something and so I said the same.' \"","reference":"Sahih al-Bukhari 7287, Book 96, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of solar eclipses in Islamic tradition and how should Muslims respond to them?","id":"bukhari-96-20"},{"hadith-eng":"The Prophet (ﷺ) said, \"Leave me as I leave you, for the people who were before you were ruined because \nof their questions and their differences over their prophets. So, if I forbid you to do something, then \nkeep away from it. And if I order you to do something, then do of it as much as you can.\"","reference":"Sahih al-Bukhari 7288, Book 96, Hadith 19","grade":"","question #":"question #1","question":"What are the consequences of excessive questioning and disputes over religious matters according to Islamic teachings?","id":"bukhari-96-21"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most sinful person among the Muslims is the one who asked about something \nwhich had not been prohibited, but was prohibited because of his asking.\"","reference":"Sahih al-Bukhari 7289, Book 96, Hadith 20","grade":"","question #":"question #1","question":"What are the consequences of asking unnecessary questions in Islam?","id":"bukhari-96-22"},{"hadith-eng":"The Prophet (ﷺ) took a room made of date palm leaves mats in the mosque. Allah's Messenger (ﷺ) prayed in it \nfor a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the \n4th night the people did not hear his voice and they thought he had slept, so some of them started \nhumming in order that he might come out. The Prophet (ﷺ) then said, \"You continued doing what I saw \nyou doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined \non you, you would not continue performing it. Therefore, O people! Perform your prayers at your \nhomes, for the best prayer of a person is what is performed at his home except the compulsory \ncongregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)","reference":"Sahih al-Bukhari 7290, Book 96, Hadith 21","grade":"","question #":"question #1","question":"What is the significance of performing prayers at home according to Islamic teachings?","id":"bukhari-96-23"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about things which he disliked, and when the people asked too many \nquestions, he became angry and said, \"Ask me (any question).\" A man got up and said, \"O Allah's \nApostle! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then another man got up \nand said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) said, \"Your father is Salim, Maula \nShaiba.\" When `Umar saw the signs of anger on the face of Allah's Messenger (ﷺ), he said, \"We repent to \nAllah.\"","reference":"Sahih al-Bukhari 7291, Book 96, Hadith 22","grade":"","question #":"question #1","question":"What is the significance of asking meaningful questions in Islam?","id":"bukhari-96-24"},{"hadith-eng":"(The clerk of Al-Mughira) Muawiya wrote to Al-Mughira 'Write to me what you have heard from \nAllah's Messenger (ﷺ).' So he (Al-Mughira) wrote to him: Allah's Prophet used to say at the end of each \nprayer: \"La ilaha illalla-h wahdahu la sharika lahu, lahul Mulku, wa lahul Hamdu wa hula ala kulli \nshai'in qadir. 'Allahumma la mani' a lima a'taita, wala mu'tiya lima mana'ta, wala yanfa'u dhuljadd \nminkal-jadd.\" He also wrote to him that the Prophet (ﷺ) used to forbid (1) Qil and Qal (idle useless talk or \nthat you talk too much about others), (2) Asking too many questions (in disputed Religious matters); \n(3) And wasting one's wealth by extravagance; (4) and to be undutiful to one's mother (5) and to bury \nthe daughters alive (6) and to prevent your favors (benevolence to others (i.e. not to pay the rights of \nothers (7) And asking others for something (except when it is unavoidable).","reference":"Sahih al-Bukhari 7292, Book 96, Hadith 23","grade":"","question #":"question #1","question":"What are the recommended supplications to say at the end of each prayer according to the Prophet's teachings?","id":"bukhari-96-25"},{"hadith-eng":"We were with `Umar and he said, \"We have been forbidden to undertake a difficult task beyond our \ncapability (i.e. to exceed the religious limits e.g., to clean the inside of the eyes while doing ablution).","reference":"Sahih al-Bukhari 7293, Book 96, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of adhering to one's capabilities in religious practices?","id":"bukhari-96-26"},{"hadith-eng":"The Prophet (ﷺ) came out after the sun had declined and offered the Zuhr prayer (in congregation). After \nfinishing it with Taslim, he stood on the pulpit and mentioned the Hour and mentioned there would \nhappen great events before it. Then he said, \"Whoever wants to ask me any question, may do so, for \nby Allah, you will not ask me about anything but I will inform you of its answer as long as I am at this \nplace of mine.\" On this, the Ansar wept violently, and Allah's Messenger (ﷺ) kept on saying, \"Ask Me! \" \nThen a man got up and asked, ''Where will my entrance be, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \n\"(You will go to) the Fire.\" Then `Abdullah bin Hudhaifa got up and asked, \"Who is my father, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" The Prophet (ﷺ) then kept on saying \n(angrily), \"Ask me! Ask me!\" `Umar then knelt on his knees and said, \"We have accepted Allah as our \nLord and Islam as our religion and Muhammad as an Apostle.\" Allah's Messenger (ﷺ) became quiet when \n`Umar said that. Then Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, Paradise and Hell \nwere displayed before me across this wall while I was praying, and I never saw such good and evil as \nI have seen today.\"","reference":"Sahih al-Bukhari 7294, Book 96, Hadith 25","grade":"","question #":"question #1","question":"What significance does the Prophet's ability to answer any question hold in Islamic teachings?","id":"bukhari-96-27"},{"hadith-eng":"A man said, \"O Allah's Prophet! Who is my father?\" The Prophet (ﷺ) said, \"Your father is so-and-so.\" \nAnd then the Divine Verse:-- 'O you who believe! Ask not questions about things..(5.101)","reference":"Sahih al-Bukhari 7295, Book 96, Hadith 26","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding asking unnecessary questions?","id":"bukhari-96-28"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"People will not stop asking questions till they say, 'This is Allah, the Creator of \neverything, then who created Allah?' \"","reference":"Sahih al-Bukhari 7296, Book 96, Hadith 27","grade":"","question #":"question #1","question":"What is the significance of questioning in matters of faith and belief?","id":"bukhari-96-29"},{"hadith-eng":"I was with the Prophet (ﷺ) at one of the farms of Medina while he was leaning on a date palm leaf-stalk. \nHe passed by a group of Jews and some of them said to the other, Ask him (the Prophet) about the \nspirit. Some others said, \"Do not ask him, lest he should tell you what you dislike\" But they went up \nto him and said, \"O Abal Qasim! Inform us bout the spirit.\" The Prophet (ﷺ) stood up for a while, waiting. \nI realized that he was being Divinely Inspired, so I kept away from him till the inspiration was over. \nThen the Prophet (ﷺ) said, \"(O Muhammad) they ask you regarding the spirit, Say: The spirit its \nknowledge is with my Lord (i.e., nobody has its knowledge except Allah)\" (17.85) (This is a miracle \nof the Qur'an that all the scientists up till now do not know about the spirit, i.e, how life comes to a \nbody and how it goes away at its death) (See Hadith No. 245, Vol. 6)","reference":"Sahih al-Bukhari 7297, Book 96, Hadith 28","grade":"","question #":"question #1","question":"What does the Quran say about the knowledge of the spirit and who possesses it?","id":"bukhari-96-30"},{"hadith-eng":"The Prophet (ﷺ) wore a gold ring and then the people followed him and wore gold rings too. Then the \nProphet said, \"I had this golden ring made for myself. He then threw it away and said, \"I shall never \nput it on.\" Thereupon the people also threw their rings away.","reference":"Sahih al-Bukhari 7298, Book 96, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of the Prophet's actions in influencing the behavior of his followers?","id":"bukhari-96-31"},{"hadith-eng":"The Prophet (ﷺ) said (to his companions), \"Do not fast Al-Wisal.\" They said, \"But you fast Al-Wisail.\" \nHe said, \"I am not like you, for at night my Lord feeds me and makes me drink.\" But the people did \nnot give up Al-Wisal, so the Prophet (ﷺ) fasted Al-Wisal with them for two days or two nights, and then \nthey saw the crescent whereupon the Prophet (ﷺ) said, \"If the crescent had delayed, I would have \ncontinued fasting (because of you),\" as if he wanted to vanquish them completely (because they had \nrefused to give up Al Wisal).","reference":"Sahih al-Bukhari 7299, Book 96, Hadith 30","grade":"","question #":"question #1","question":"What is the practice of Al-Wisal in fasting and why was it discouraged by the Prophet (ﷺ)?","id":"bukhari-96-32"},{"hadith-eng":"`Ali addressed us while he was standing on a brick pulpit and carrying a sword from which was hanging a scroll He said \"By Allah, we have no book to read except Allah's Book and whatever is on this scroll,\" And then he unrolled it, and behold, in it was written what sort of camels were to be given as blood money, and there was also written in it: 'Medina is a sanctuary form 'Air (mountain) to such \nand such place so whoever innovates in it an heresy or commits a sin therein, he will incur the curse of Allah, the angels, and all the people and Allah will not accept his compulsory or optional good deeds.' \nThere was also written in it: 'The asylum (pledge of protection) granted by any Muslims is one and the \nsame, (even a Muslim of the lowest status is to be secured and respected by all the other Muslims, and \nwhoever betrays a Muslim in this respect (by violating the pledge) will incur the curse of Allah, the \nangels, and all the people, and Allah will not accept his compulsory or optional good deeds.' There \nwas also written in it: 'Whoever (freed slave) befriends (takes as masters) other than his real masters \n(manumitters) without their permission will incur the curse of Allah, the angels, and all the people, \nand Allah will not accept his compulsory or optional good deeds. ' (See Hadith No. 94, Vol. 3)","reference":"Sahih al-Bukhari 7300, Book 96, Hadith 31","grade":"","question #":"question #1","question":"What are the consequences of innovating or committing sins in the sanctuary of Medina?","id":"bukhari-96-33"},{"hadith-eng":"The Prophet (ﷺ) did something as it was allowed from the religious point of view but some people \nrefrained from it. When the Prophet (ﷺ) heard of that, he, after glorifying and praising Allah, said, \"Why \ndo some people refrain from doing something which I do? By Allah, I know Allah more than they.\"","reference":"Sahih al-Bukhari 7301, Book 96, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of following the actions of the Prophet (ﷺ) in Islam?","id":"bukhari-96-34"},{"hadith-eng":"Once the two righteous men, i.e., Abu Bakr and `Umar were on the verge of destruction (and that was \nbecause): When the delegate of Bani Tamim came to the Prophet, one of them (either Abu Bakr or \n`Umar) recommended Al-Aqra' bin H`Abis at-Tamimi Al-Hanzali, the brother of Bani Majashi (to be \nappointed as their chief), while the other recommended somebody else. Abu Bakr said to `Umar, \"You \nintended only to oppose me.\" `Umar said, \"I did not intend to oppose you!\" Then their voices grew \nlouder in front of the Prophet (ﷺ) whereupon there was revealed: 'O you who believe! Do not raise your \nvoices above the voice of the Prophet..a great reward.' (49.2-3) Ibn Az-Zubair said, 'Thence forward \nwhen `Umar talked to the Prophet, he would talk like one who whispered a secret and would even fail \nto make the Prophet (ﷺ) hear him, in which case the Prophet (ﷺ) would ask him (to repeat his words).","reference":"Sahih al-Bukhari 7302, Book 96, Hadith 33","grade":"","question #":"question #1","question":"What lesson can be learned about the importance of respecting the Prophet's presence and authority?","id":"bukhari-96-35"},{"hadith-eng":"(the mother of believers) Allah's Messenger (ﷺ) during his fatal ailment said, \"Order Abu Bakr to lead the \npeople in prayer.\" I said, \"If Abu Bakr stood at your place (in prayers, the people will not be able to \nhear him because of his weeping, so order `Umar to lead the people in prayer.\" He again said, \"Order \nAbu Bakr to lead the people in prayer \" Then I said to Hafsa, \"Will you say (to the Prophet), 'If Abu \nBakr stood at your place, the people will not be able to hear him be cause of his weeping, so order \n`Umar to lead the people in prayer?\" Hafsa did so, whereupon Allah's Messenger (ﷺ) said, \"You are like the \ncompanions of Joseph (See Qur'an, 12:30-32). Order Abu Bakr to lead the people in prayer.\" Hafsa \nthen said to me, \"I have never received any good from you!\"","reference":"Sahih al-Bukhari 7303, Book 96, Hadith 34","grade":"","question #":"question #1","question":"What qualities did the Prophet Muhammad (ﷺ) see in Abu Bakr that made him suitable to lead the prayer?","id":"bukhari-96-36"},{"hadith-eng":"'Uwaimir Al-`Ajlani came to `Asim bin `Adi and said, \"If a man found another man with his wife and \nkilled him, would you sentence the husband to death (in Qisas,) i.e., equality in punishment)? O \n`Asim! Please ask Allah's Messenger (ﷺ) about this matter on my behalf.\" `Asim asked the Prophet (ﷺ) but the \nProphet disliked the question and disapproved of it. `Asim returned and informed 'Uwaimir that the \nProphet disliked that type of question. 'Uwaimir said, \"By Allah, I will go (personally) to the Prophet.\" \n'Uwaimir came to the Prophet (ﷺ) when Allah had already revealed Qur'anic Verses (in that respect), after \n`Asim had left (the Prophet (ﷺ) ). So the Prophet (ﷺ) said to 'Uwaimir, \"Allah has revealed Qur'anic Verses \nregarding you and your wife.\" The Prophet (ﷺ) then called for them, and they came and carried out the \norder of Lian. \nThen 'Uwaimir said, \"O Allah's Messenger (ﷺ)! Now if I kept her with me, I would be accused of telling a \nlie.\" So 'Uwaimir divorced her although the Prophet (ﷺ) did not order him to do so. Later on this practice \nof divorcing became the tradition of couples involved in a case of Li'an. The Prophet (ﷺ) said (to the \npeople). \"Wait for her! If she delivers a red short (small) child like a Wahra (a short red animal). then \nI will be of the opinion that he ('Uwaimir) has told a lie but if she delivered a black big-eyed one with \nbig buttocks, then I will be of the opinion that he has told the truth about her.\" 'Ultimately she gave \nbirth to a child that proved the accusation. (See Hadith No. 269, Vol. 6)","reference":"Sahih al-Bukhari 7304, Book 96, Hadith 35","grade":"","question #":"question #1","question":"What is the significance of the Qur'anic revelation in resolving disputes between spouses in Islamic law?","id":"bukhari-96-37"},{"hadith-eng":"I proceeded till I entered upon `Umar (and while I was sitting there), his gate-keeper Yarfa came to \nhim and said, \" `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d ask your permission to come in.\" \n`Umar allowed them. So they entered, greeted, and sat down. (After a while the gatekeeper came) and \nsaid, \"Shall I admit `Ali and `Abbas?'' `Umar allowed them to enter. Al-`Abbas said \"O Chief of the \nbelievers! Judge between me and the oppressor (`Ali).\" Then there was a dispute (regarding the \nproperty of Bani Nadir) between them (`Abbas and `Ali). `Uthman and his companions said, \"O Chief \nof the Believers! Judge between them and relieve one from the other.\" `Umar said, \"Be patient! \nbeseech you by Allah, with Whose permission the Heaven and the Earth Exist! Do you know that \nAllah's Messenger (ﷺ) said, 'Our property is not to be inherited, and whatever we leave is to be given in \ncharity,' and by this Allah's Messenger (ﷺ) meant himself?\" On that the group said, \"He verily said so.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, do you both know that \nAllah's Messenger (ﷺ) said so?\" They both replied, \"Yes\". `Umar then said, \"Now I am talking to you about \nthis matter (in detail) . Allah favored Allah's Messenger (ﷺ) with some of this wealth which He did not give \nto anybody else, as Allah said: 'What Allah bestowed as Fai (Booty on His Apostle for which you \nmade no expedition... ' (59.6) \nSo that property was totally meant for Allah's Messenger (ﷺ), yet he did not collect it and ignore you, nor did \nhe withhold it with your exclusion, but he gave it to you and distributed it among you till this much of \nit was left behind, and the Prophet, used to spend of this as the yearly expenditures of his family and \nthen take what remained of it and spent it as he did with (other) Allah's wealth. The Prophet (ﷺ) did so \nduring all his lifetime, and I beseech you by Allah, do you know that?\" They replied, \"Yes.\" `Umar \nthen addressed `Ali and `Abbas, saying, \"I beseech you both by Allah, do you know that?\" Both of \nthem replied, \"Yes.\" `Umar added, \"Then Allah took His Apostle unto Him. Abu Bakr then said 'I am \nthe successor of Allah's Messenger (ﷺ)' and took over all the Prophet's property and disposed of it in the \nsame way as Allah's Messenger (ﷺ) used to do, and you were present then.\" Then he turned to `Ali and \n`Abbas and said, \"You both claim that Abu Bakr did so-and-so in managing the property, but Allah \nknows that Abu Bakr was honest, righteous, intelligent, and a follower of what is right in managing it. \nThen Allah took Abu Bakr unto Him, 'I said: I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' So \nI took over the property for two years and managed it in the same way as Allah's Messenger (ﷺ), and Abu \nBakr used to do. Then you both (`Ali and `Abbas) came to me and asked for the same thing! (O \n`Abbas! You came to me to ask me for your share from nephew's property; and this (`Ali) came to me \nasking for his wives share from her father's property, and I said to you both, 'If you wish, I will place \nit in your custody on condition that you both will manage it in the same way as Allah's Messenger (ﷺ) and \nAbu Bakr did and as I have been doing since I took charge of managing it; otherwise, do not speak to \nme anymore about it.' \nThen you both said, 'Give it to us on that (condition).' So I gave it to you on that condition. Now I \nbeseech you by Allah, did I not give it to them on that condition?\" The group (whom he had been \naddressing) replied, \"Yes.\" `Umar then addressed `Abbas and `Ali saying, \"I beseech you both by \nAllah, didn't I give you all that property on that condition?\" They said, \"Yes.\" `Umar then said, \"Are \nyou now seeking a verdict from me other than that? By Him with Whose Permission the Heaven and \nthe Earth exists I will not give any verdict other than that till the Hour is established; and if you both \nare unable to manage this property, then you can hand it back to me, and I will be sufficient for it on \nyour behalf.\" (See, Hadith No. 326, Vol. 4)","reference":"Sahih al-Bukhari 7305, Book 96, Hadith 36","grade":"","question #":"question #1","question":"What is the significance of the property of the Prophet Muhammad (ﷺ) not being inherited according to Islamic teachings?","id":"bukhari-96-38"},{"hadith-eng":"I said to Anas, \"Did Allah's Messenger (ﷺ) make Medina a sanctuary?\" He replied, \"Yes, (Medina is a \nsanctuary from such-and-such place to such-and-such place. It is forbidden to cut its trees, and \nwhoever innovates an heresy in it or commits a sin therein, will incur the curse of Allah, the angels, \nand all the people.\" Then Musa bin Anas told me that Anas added, \"..... or gives refuge to such an \nheretic or a sinner...\"","reference":"Sahih al-Bukhari 7306, Book 96, Hadith 37","grade":"","question #":"question #1","question":"What are the boundaries and rules regarding the sanctuary status of Medina?","id":"bukhari-96-39"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Allah will not deprive you of knowledge after he has given it to you, but \nit will be taken away through the death of the religious learned men with their knowledge. Then there \nwill remain ignorant people who, when consulted, will give verdicts according to their opinions \nwhereby they will mislead others and go astray.\"","reference":"Sahih al-Bukhari 7307, Book 96, Hadith 38","grade":"","question #":"question #1","question":"What are the consequences of the loss of religious scholars on the understanding of Islamic knowledge?","id":"bukhari-96-40"},{"hadith-eng":"I asked Abu Wail, \"Did you witness the battle of Siffin between `Ali and Muawiya?\" He said, \"Yes,\" \nand added, \"Then I heard Sahl bin Hunaif saying, 'O people! Blame your personal opinions in your \nreligion. No doubt, I remember myself on the day of Abi Jandal; if I had the power to refuse the order \nof Allah's Messenger (ﷺ), I would have refused it. \nWe have never put our swords on our shoulders to get involved in a situation that might have been \nhorrible for us, but those swords brought us to victory and peace, except this present situation.' \" Abu \nWail said, \"I witnessed the battle of Siffin, and how nasty Siffin was!\"","reference":"Sahih al-Bukhari 7308, Book 96, Hadith 39","grade":"","question #":"question #1","question":"What lessons can be learned about relying on personal opinions in religious matters?","id":"bukhari-96-41"},{"hadith-eng":"I fell ill, Allah's Messenger (ﷺ) and Abu Bakr came to visit me on foot. The Prophet (ﷺ) came to me while I was \nunconscious. Allah's Messenger (ﷺ) performed ablution and poured the Remaining water of his ablution over \nme whereupon I became conscious and said, 'O Allah's Messenger (ﷺ)! How should I spend my wealth? Or \nhow should I deal with my wealth?\" But the Prophet (ﷺ) did not give me any reply till the Verse of the \nlaws of inheritance was revealed.","reference":"Sahih al-Bukhari 7309, Book 96, Hadith 40","grade":"","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take when visiting a sick person according to this narration?","id":"bukhari-96-42"},{"hadith-eng":"A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Men (only) benefit by your teachings, \nso please devote to us from (some of) your time, a day on which we may come to you so that you may \nteach us of what Allah has taught you.\" Allah's Messenger (ﷺ) said, \"Gather on such-and-such a day at suchand- \nsuch a place.\" They gathered and Allah's Messenger (ﷺ) came to them and taught them of what Allah \nhad taught him. He then said, \"No woman among you who has lost her three children (died) but that \nthey will screen her from the Fire.\" A woman among them said, \"O Allah's Messenger (ﷺ)! If she lost two \nchildren?\" She repeated her question twice, whereupon the Prophet (ﷺ) said, \"Even two, even two, even \ntwo!\" (See Hadith No. 341, Vol. 2)","reference":"Sahih al-Bukhari 7310, Book 96, Hadith 41","grade":"","question #":"question #1","question":"What does this narration suggest about the importance of women's education in Islam?","id":"bukhari-96-43"},{"hadith-eng":"The Prophet (ﷺ) said, \"A group of my follower swill remain predominant (victorious) till Allah's Order \n(the Hour) comes upon them while they are still predominant (victorious).","reference":"Sahih al-Bukhari 7311, Book 96, Hadith 42","grade":"","question #":"question #1","question":"What does it mean for a group of followers to remain predominant until the Hour?","id":"bukhari-96-44"},{"hadith-eng":"I heard Muawiya bin Abi Sufyan delivering a sermon. He said, \"I heard the Prophet (ﷺ) saying, \"If Allah \nwants to do a favor to somebody, He bestows on him, the gift of understanding the Qur'an and Sunna. \nI am but a distributor, and Allah is the Giver. The state of this nation will remain good till the Hour is \nestablished, or till Allah's Order comes.\"","reference":"Sahih al-Bukhari 7312, Book 96, Hadith 43","grade":"","question #":"question #1","question":"What is considered a divine favor in terms of understanding religious teachings?","id":"bukhari-96-45"},{"hadith-eng":"When the (following) Verse was revealed to Allah's Messenger (ﷺ): 'Say: He has power to send torment on \nyou from above,'..(6.65) he said, \"O Allah! I seek refuge with Your Face (from that punishment).\" \nAnd when this was revealed: '..or from beneath your feet.' (6.65) he said, \"O Allah! I seek refuge with \nYour Face (from that).\" And when this Verse was revealed: '..or to cover you with confusion in partystrife, \nand make you to taste the violence of one another,'...(6.65) he said: \"These two warnings are \neasier (than the previous ones).","reference":"Sahih al-Bukhari 7313, Book 96, Hadith 44","grade":"","question #":"question #1","question":"What is the significance of seeking refuge in Allah's Face from different forms of torment?","id":"bukhari-96-46"},{"hadith-eng":"A bedouin came to Allah's Messenger (ﷺ) and said, \"My wife has delivered a black boy, and I suspect that he \nis not my child.\" Allah's Messenger (ﷺ) said to him, \"Have you got camels?\" The bedouin said, \"Yes.\" The \nProphet said, \"What color are they?\" The bedouin said, \"They are red.\" The Prophet (ﷺ) said, \"Are any of \nthem Grey?\" He said, \"There are Grey ones among them.\" The Prophet (ﷺ) said, \"Whence do you think \nthis color came to them?\" The bedouin said, \"O Allah's Messenger (ﷺ)! It resulted from hereditary \ndisposition.\" The Prophet (ﷺ) said, \"And this (i.e., your child) has inherited his color from his ancestors.\" \nThe Prophet (ﷺ) did not allow him to deny his paternity of the child.","reference":"Sahih al-Bukhari 7314, Book 96, Hadith 45","grade":"","question #":"question #1","question":"How does the concept of hereditary traits explain variations in physical characteristics within families?","id":"bukhari-96-47"},{"hadith-eng":"A woman came to the Prophet (ﷺ) and said, \"My mother vowed to perform the Hajj but she died before \nperforming it. Should I perform the Hajj on her behalf?\" He said, \"Yes! Perform the Hajj on her \nbehalf. See, if your mother had been in debt, would you have paid her debt?\" She said, \"Yes.\" He said, \n\"So you should pay what is for Him as Allah has more right that one should fulfill one's obligations to \nHim. \"","reference":"Sahih al-Bukhari 7315, Book 96, Hadith 46","grade":"","question #":"question #1","question":"What is the ruling on performing Hajj on behalf of a deceased person who had vowed to perform it?","id":"bukhari-96-48"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Do not wish to be like anybody except in two cases: The case of a man whom \nAllah has given wealth and he spends it in the right way, and that of a man whom Allah has given \nreligious wisdom (i.e., Qur'an and Sunna) and he gives his verdicts according to it and teaches it.\" (to \nothers i.e., religious knowledge of Qur'an and Sunna (Prophet's Traditions)). \"","reference":"Sahih al-Bukhari 7316, Book 96, Hadith 47","grade":"","question #":"question #1","question":"In what situations is it considered commendable to aspire to be like someone else?","id":"bukhari-96-49"},{"hadith-eng":"`Umar bin Al-Khattab asked (the people) about the Imlas of a woman, i.e., a woman who has an \nabortion because of having been beaten on her `Abdomen, saying, \"Who among you has heard \nanything about it from the Prophet?\" I said, \"I did.'' He said, \"What is that?\" I said, \"I heard the \nProphet saying, \"Its Diya (blood money) is either a male or a female slave.' \" `Umar said, \"Do not \nleave till you present witness in support of your statement.\" So I went out, and found Muhammad bin \nMaslama. I brought him, and he bore witness with me that he had heard the Prophet (ﷺ) saying, \"Its Diya \n(blood money) is either a male slave or a female slave.\"","reference":"Sahih al-Bukhari 7317, 7318, Book 96, Hadith 48","grade":"","question #":"question #1","question":"What is the significance of providing witnesses in Islamic legal matters?","id":"bukhari-96-50"},{"hadith-eng":"The Prophet (ﷺ) said, \"The Hour will not be established till my followers copy the deeds of the previous \nnations and follow them very closely, span by span, and cubit by cubit (i.e., inch by inch).\" It was \nsaid, \"O Allah's Messenger (ﷺ)! Do you mean by those (nations) the Persians and the Byzantines?\" The \nProphet said, \"Who can it be other than they?\"","reference":"Sahih al-Bukhari 7319, Book 96, Hadith 49","grade":"","question #":"question #1","question":"What are the signs mentioned that indicate the approach of the Hour in Islamic eschatology?","id":"bukhari-96-51"},{"hadith-eng":"The Prophet (ﷺ) said, \"You will follow the ways of those nations who were before you, span by span and \ncubit by cubit (i.e., inch by inch) so much so that even if they entered a hole of a mastigure, you \nwould follow them.\" We said, \"O Allah's Messenger (ﷺ)! (Do you mean) the Jews and the Christians?\" He \nsaid, \"Whom else?\"","reference":"Sahih al-Bukhari 7320, Book 96, Hadith 50","grade":"","question #":"question #1","question":"What does the hadith imply about the tendency of Muslims to imitate previous nations?","id":"bukhari-96-52"},{"hadith-eng":"The Prophet (ﷺ) said, \"None is killed unjustly, but the first son of Adam will have a part of its burden.\" \nSufyan said, \"..a part of its blood because he was the first to establish the tradition of murdering\"","reference":"Sahih al-Bukhari 7321, Book 96, Hadith 51","grade":"","question #":"question #1","question":"What is the significance of the first son of Adam in the context of unjust killings?","id":"bukhari-96-53"},{"hadith-eng":"A bedouin gave the Pledge of allegiance for embracing Islam to Allah's Messenger (ﷺ), and then he got an attack of fever in Medina and came to Allah's Messenger (ﷺ): and said, \"O Allah's Messenger (ﷺ)! Cancel my pledge.\" Allah's Messenger (ﷺ) refused to do so. The bedouin came to him again and said, \"Cancel my pledge,\" but he refused again, and then again, the bedouin came to him and said, \"Cancel my pledge,\" and Allah's Messenger (ﷺ) refused. The bedouin finally went away, and Allah's Messenger (ﷺ) said, \"Medina is like a pair of bellows (furnace), it expels its impurities while it brightens and clears its good.'","reference":"Sahih al-Bukhari 7322, Book 96, Hadith 52","grade":"","question #":"question #1","question":"What is the significance of the Pledge of Allegiance in Islam and its implications for a new convert?","id":"bukhari-96-54"},{"hadith-eng":"I used to teach Qur'an to 'Abdur-Rahman bin Auf. When Umar performed his last Hajj, 'Abdur-Rahman said (to me) at Mina, \"Would that you had seen Chief of the believers today! A man came to him and said, \"So-and-so has said, \"If Chief of the Believers died, we will give the oath of allegiance to such-and-such person,' 'Umar said, 'I will get up tonight and warn those who want to usurp the people's rights.' I said, 'Do not do so, for the season (of Hajj) gathers the riffraff mob who will form the majority of your audience, and I am afraid that they will not understand (the meaning of) your saying properly and may spread (an incorrect statement) everywhere. You should wait till we reach Medina, the place of migration and the place of the Sunna (the Prophet's Traditions). There you will meet the companions of Allah's Messenger (ﷺ) from the Muhajirin and the Ansar who will understand your statement and place it in its proper position' 'Umar said, 'By Allah, I shall do so the first time I stand (to address the people) in Medina.' When we reached Medina, 'Umar (in a Friday Khutba-sermon) said, \"No doubt, Allah sent Muhammad with the Truth and revealed to him the Book (Quran), and among what was revealed, was the Verse of Ar-Rajm (stoning adulterers to death).'\" (See Hadith No. 817,Vol. 8)","reference":"Sahih al-Bukhari 7323, Book 96, Hadith 53","grade":"","question #":"question #1","question":"What considerations should be taken into account when addressing sensitive issues in a public gathering?","id":"bukhari-96-55"},{"hadith-eng":"We were with Abu Huraira while he was wearing two linen garments dyed with red clay. He cleaned \nhis nose with his garment, saying, \"Bravo! Bravo! Abu Huraira is cleaning his nose with linen! There \ncame a time when I would fall senseless between the pulpit of Allah's Messenger (ﷺ) and `Aisha's dwelling \nwhereupon a passerby would come and put his foot on my neck, considering me a mad man, but in \nfact, I had no madness, I suffered nothing but hunger.\"","reference":"Sahih al-Bukhari 7324, Book 96, Hadith 54","grade":"","question #":"question #1","question":"What challenges did Abu Huraira face during his time with the Prophet Muhammad (ﷺ)?","id":"bukhari-96-56"},{"hadith-eng":"Ibn `Abbas was asked, \"Did you offer the Id prayer with the Prophet?\" He said, \"Yes, had it not been \nfor my close relation to the Prophet, I would not have performed it (with him) because of my being \ntoo young The Prophet (ﷺ) came to the mark which is near the home of Kathir bin As-Salt and offered the \nId prayer and then delivered the sermon. I do not remember if any Adhan or Iqama were pronounced \nfor the prayer. Then the Prophet (ﷺ) ordered (the women) to give alms, and they started stretching out \ntheir hands towards their ears and throats (giving their ornaments in charity), and the Prophet (ﷺ) ordered \nBilal to go to them (to collect the alms), and then Bilal returned to the Prophet.","reference":"Sahih al-Bukhari 7325, Book 96, Hadith 55","grade":"","question #":"question #1","question":"What is the significance of the Id prayer in Islam and how was it performed by the Prophet?","id":"bukhari-96-57"},{"hadith-eng":"The Prophet (ﷺ) used to go to the Quba' mosque, sometimes walking, sometimes riding.","reference":"Sahih al-Bukhari 7326, Book 96, Hadith 56","grade":"","question #":"question #1","question":"What significance does the Quba' mosque hold in Islamic tradition?","id":"bukhari-96-58"},{"hadith-eng":"`Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the \nProphet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as \nsanctified (just for being buried there).'' \nNarrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried \nwith my two companions (the Prophet (ﷺ) and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her \nhabit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to \nallow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to \nbe buried with them.\"","reference":"Sahih al-Bukhari 7327, 7328, Book 96, Hadith 57","grade":"","question #":"question #1","question":"What considerations did Aisha have regarding her burial place and how does it reflect her humility?","id":"bukhari-96-59"},{"hadith-eng":"`Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the \nProphet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as \nsanctified (just for being buried there).'' \nNarrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried \nwith my two companions (the Prophet (ﷺ) and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her \nhabit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to \nallow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to \nbe buried with them.\"","reference":"Sahih al-Bukhari 7327, 7328, Book 96, Hadith 57","grade":"","question #":"question #1","question":"What was Aisha's reasoning for wanting to be buried with her female companions rather than with the Prophet?","id":"bukhari-96-60"},{"hadith-eng":"Allah's Messenger (ﷺ) used to perform the `Asr prayer and then one could reach the `Awali (a place in the \noutskirts of Medina) while the sun was still quite high. \nNarrated Yunus: The distance of the `Awali (from Medina) was four or three miles.","reference":"Sahih al-Bukhari 7329, Book 96, Hadith 58","grade":"","question #":"question #1","question":"What does this narration indicate about the timing of the `Asr prayer during the Prophet's time?","id":"bukhari-96-61"},{"hadith-eng":"The Sa' (a kind of measure) during the lifetime of the Prophet (ﷺ) used to be equal to the one Mudd \n(another kind of measure) and one third of a Mudd which we use today, but the Sa' of today has \nbecome large.","reference":"Sahih al-Bukhari 7330, Book 96, Hadith 59","grade":"","question #":"question #1","question":"How have measurements used during the Prophet's time changed over the years?","id":"bukhari-96-62"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, and bestow Your Blessings \non their Sa' and Mudd.\" He meant those of the people of Medina.","reference":"Sahih al-Bukhari 7331, Book 96, Hadith 60","grade":"","question #":"question #1","question":"What is the significance of invoking blessings on the measures of a community in Islamic teachings?","id":"bukhari-96-63"},{"hadith-eng":"The Jews brought a man and a woman who had committed illegal sexual intercourse, to the Prophet (ﷺ) \nand the Prophet (ﷺ) ordered them to be stoned to death, and they were stoned to death near the mosque \nwhere the biers used to be placed.","reference":"Sahih al-Bukhari 7332, Book 96, Hadith 61","grade":"","question #":"question #1","question":"What was the punishment for illegal sexual intercourse according to Islamic law during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-64"},{"hadith-eng":"The Mountain of Uhud came in sight of Allah's Messenger (ﷺ) who then said, \"This is a mountain that loves \nus and is loved by us. O Allah! Abraham made Mecca a sanctuary and I make the area between its \n(Medina's) two mountains a sanctuary.\"","reference":"Sahih al-Bukhari 7333, Book 96, Hadith 62","grade":"","question #":"question #1","question":"What significance does the Mountain of Uhud hold in Islamic tradition?","id":"bukhari-96-65"},{"hadith-eng":"The distance between the pulpit and the wall of the mosque on the side of the Qibla was just sufficient \nfor a sheep to pass through.","reference":"Sahih al-Bukhari 7334, Book 96, Hadith 63","grade":"","question #":"question #1","question":"What can be inferred about the size and layout of the Prophet's mosque from the description of the space between the pulpit and the wall?","id":"bukhari-96-66"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from one of the gardens of \nParadise, and my pulpit is over my Lake-Tank. (Kauthar);","reference":"Sahih al-Bukhari 7335, Book 96, Hadith 64","grade":"","question #":"question #1","question":"What is the significance of the area between the Prophet's house and pulpit in Islamic tradition?","id":"bukhari-96-67"},{"hadith-eng":"`Abdullah said, \"The Prophet (ﷺ) arranged for a horse race, and the prepared horses were given less food \nfor a few days before the race to win the race, and were allowed to run from Al-Hafya to Thaniyat-al- \nWada`, and the unprepared horses were allowed to run between Thaniyat-al-Wada` and the mosque of \nBani Zuraiq,\" `Abdullah was one of those who participated in the race.","reference":"Sahih al-Bukhari 7336, Book 96, Hadith 65","grade":"","question #":"question #1","question":"What considerations were made for the preparation of horses in Islamic horse racing?","id":"bukhari-96-68"},{"hadith-eng":"I heard `Umar (delivering a sermon) on the pulpit of the Prophet.","reference":"Sahih al-Bukhari 7337, Book 96, Hadith 66","grade":"","question #":"question #1","question":"What is the significance of delivering sermons from the pulpit of the Prophet in Islamic tradition?","id":"bukhari-96-69"},{"hadith-eng":"That he heard `Uthman bin `Affan delivering a sermon on the pulpit of the Prophet","reference":"Sahih al-Bukhari 7338, Book 96, Hadith 67","grade":"","question #":"question #1","question":"What is the significance of delivering sermons from the pulpit of the Prophet in Islamic tradition?","id":"bukhari-96-70"},{"hadith-eng":"This big copper vessel used to be put for me and Allah's Messenger (ﷺ) and we would take water from it \ntogether (on taking a bath) .","reference":"Sahih al-Bukhari 7339, Book 96, Hadith 68","grade":"","question #":"question #1","question":"What does this narration indicate about the shared practices of the Prophet Muhammad (ﷺ) and his family?","id":"bukhari-96-71"},{"hadith-eng":"The Prophet (ﷺ) brought the Ansar and the Quarish people into alliance in my house at Medina, and he \ninvoked Allah for one month against the tribe of Bani Sulaim in (the last rak`a of each compulsory) \nprayer.","reference":"Sahih al-Bukhari 7340, 7341, Book 96, Hadith 69","grade":"","question #":"question #1","question":"What is the significance of forming alliances between different tribes in Islam?","id":"bukhari-96-72"},{"hadith-eng":"When I arrived at Medina, `Abdullah bin Salam met me and said to me, \"Accompany me to my house \nso that I may make you drink from a bowl from which Allah's Messenger (ﷺ) used to drink, and that you may \noffer prayer in the mosque in which the Prophet (ﷺ) used to pray.\" I accompanied him, and he made me \ndrink Sawiq and gave me dates to eat, and then I prayed in his mosque.","reference":"Sahih al-Bukhari 7342, Book 96, Hadith 70","grade":"","question #":"question #1","question":"What significance do historical places and objects hold in Islamic tradition?","id":"bukhari-96-73"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Someone came to me tonight from my Lord while I was in the 'Aqiq \n(valley), and said to me, \"Offer prayer in this blessed valley and say: 'Labbaik' for the (performance \nof) `Umra and Hajj.\"","reference":"Sahih al-Bukhari 7343, Book 96, Hadith 71","grade":"","question #":"question #1","question":"What is the significance of the 'Aqiq valley in Islamic rituals?","id":"bukhari-96-74"},{"hadith-eng":"Ibn `Umar said, \"The Prophet (ﷺ) fixed Qarn as the Miqat (for assuming the Ihram) for the people of \nNajd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar \nadded, \"I heard this from the Prophet, and I have been informed that the Prophet (ﷺ) said, 'The Miqat for \nthe Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim \ncountry.\"","reference":"Sahih al-Bukhari 7344, Book 96, Hadith 72","grade":"","question #":"question #1","question":"What are the designated Miqat locations for assuming Ihram for people from different regions?","id":"bukhari-96-75"},{"hadith-eng":"The Prophet (ﷺ) had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n \nthe dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).","reference":"Sahih al-Bukhari 7345, Book 96, Hadith 73","grade":"","question #":"question #1","question":"What significance do dreams hold in Islamic tradition, especially those experienced by the Prophet?","id":"bukhari-96-76"},{"hadith-eng":"That he heard the Prophet, after raising his head from the bowing in morning prayer, saying, \"O Allah, \nour Lord! All the praises are for you.\" And in the last (rak`a) he said, \"O Allah! Curse so-and-so and \nso--and-so.\" And then Allah revealed:-- 'Not for you (O Muhammad) is the decision, (but for Allah), \nwhether He turns in mercy to them or punish them, for they are indeed wrongdoers.' (3.128)","reference":"Sahih al-Bukhari 7346, Book 96, Hadith 74","grade":"","question #":"question #1","question":"What is the significance of praising Allah during prayer according to Islamic teachings?","id":"bukhari-96-77"},{"hadith-eng":"That Allah's Messenger (ﷺ) came to him and Fatima the daughter of Allah's Messenger (ﷺ) at their house at night \nand said, \"Won't you pray?\" `Ali replied, \"O Allah's Messenger (ﷺ)! Our souls are in the Hands of Allah and \nwhen he wants us to get up, He makes us get up.\" When `Ali said that to him, Allah's Messenger (ﷺ) left \nwithout saying anything to him. While the Prophet (ﷺ) was leaving, `Ali heard him striking his thigh (with \nhis hand) and saying, \"But man is quarrelsome more than anything else.\" (18.54)","reference":"Sahih al-Bukhari 7347, Book 96, Hadith 75","grade":"","question #":"question #1","question":"What does this narration suggest about human nature and its tendency to argue or make excuses?","id":"bukhari-96-78"},{"hadith-eng":"While we were in the mosque, Allah's Messenger (ﷺ) came out and said, \"Let us proceed to the Jews.\" So we \nwent out with him till we came to Bait-al-Midras. The Prophet (ﷺ) stood up there and called them, saying, \n\"O assembly of Jews! Surrender to Allah (embrace Islam) and you will be safe!\" They said, \"You \nhave conveyed Allah's message, O Aba-al-Qasim\" Allah's Messenger (ﷺ) then said to them, \"That is what I \nwant; embrace Islam and you will be safe.\" They said, \"You have conveyed the message, O Aba-al- \nQasim.\" Allah's Messenger (ﷺ) then said to them, \"That is what I want,\" and repeated his words for the third \ntime and added, \"Know that the earth is for Allah and I want to exile you from this land, so whoever \namong you has property he should sell it, otherwise, know that the land is for Allah and His Apostle.\"","reference":"Sahih al-Bukhari 7348, Book 96, Hadith 76","grade":"","question #":"question #1","question":"What was the Prophet Muhammad's approach when inviting people of other faiths to Islam?","id":"bukhari-96-79"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be \nasked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation \nwill be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to \nus.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) \nMuhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" \nThen the Prophet (ﷺ) recited: 'And thus We have made of you (Muslims) a just and the best nation, that \nyou might be witness over the nations, and the Apostle a witness over you.' (2.143)","reference":"Sahih al-Bukhari 7349, Book 96, Hadith 77","grade":"","question #":"question #1","question":"What is the significance of Muslims being witnesses over other nations on the Day of Resurrection?","id":"bukhari-96-80"},{"hadith-eng":"Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the \nman returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of \nKhaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) \ndates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take \none Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind \n(of dates), and you should do the same in weighing.\"","reference":"Sahih al-Bukhari 7350, 7351, Book 96, Hadith 78","grade":"","question #":"question #1","question":"What is the Islamic perspective on fair trade and exchange of goods?","id":"bukhari-96-81"},{"hadith-eng":"Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the \nman returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of \nKhaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) \ndates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take \none Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind \n(of dates), and you should do the same in weighing.\"","reference":"Sahih al-Bukhari 7350, 7351, Book 96, Hadith 78","grade":"","question #":"question #1","question":"What is the Islamic perspective on trading goods of different qualities or types?","id":"bukhari-96-82"},{"hadith-eng":"That he heard Allah's Messenger (ﷺ) saying, \"If a judge gives a verdict according to the best of his \nknowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a \ndouble reward, and if he gives a verdict according to the best of his knowledge and his verdict is \nwrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"","reference":"Sahih al-Bukhari 7352, Book 96, Hadith 79","grade":"","question #":"question #1","question":"What are the rewards for a judge who makes a correct verdict according to Islamic teachings?","id":"bukhari-96-83"},{"hadith-eng":"Abu Musa asked permission to enter upon `Umar, but seeing that he was busy, he went away. `Umar \nthen said, \"Didn't I hear the voice of `Abdullah bin Qais? Allow him to come in.\" He was called in and \n`Umar said to him, \"What made you do what you did.\" He replied, \"We have been instructed thus by \nthe Prophet\" `Umar said, \"Bring proof (witness) for this, other wise I will do so-and-so to you.\" Then \n`Abdullah bin Qais went to a gathering of the Ansar who then said, \"None but the youngest of us will \ngive the witness for it.\" So Abu Sa`id Al-Khudri got up and said, \"We used to be instructed thus (by \nthe Prophet).\" `Umar said, \"This tradition of the Prophet (ﷺ) remained hidden from me. Business in the \nmarket kept me busy.\"","reference":"Sahih al-Bukhari 7353, Book 96, Hadith 80","grade":"","question #":"question #1","question":"What is the significance of seeking proof or witnesses when someone claims a teaching from the Prophet?","id":"bukhari-96-84"},{"hadith-eng":"Abu Huraira said, \"You people claim that Abu Huraira narrates many narrations of Allah's Messenger (ﷺ). \n(Anyhow) with Allah will be our appointment. I was a poor man, and used to stick to Allah's Messenger (ﷺ) \ncontented with what will fill my stomach, and the Muhajirin (emigrants) used to be busy trading in the \nmarkets, and the Ansar used to be busy looking after their properties. One-day I heard Allah's Messenger (ﷺ) \nsaying, 'Who will spread his Rida' (a garment covering the upper part of the body) till I finished my \nspeech and then fold it, (i.e. wrap it over your body), in which case he will never forget anything he \nhad heard from me.\" So I spread my garment which I was wearing; and by Him Who sent Muhammad \nwith the Truth, ever since, I have never forgotten whatever I heard from him (the Prophet)\" (See, \nHadith No. 119, Vol. 1)","reference":"Sahih al-Bukhari 7354, Book 96, Hadith 81","grade":"","question #":"question #1","question":"What was the lifestyle of Abu Huraira that allowed him to narrate many hadiths of the Prophet (ﷺ)?","id":"bukhari-96-85"},{"hadith-eng":"I saw Jabir bin `Abdullah swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can \nyou swear by Allah?\" Jabir said, \"I have heard `Umar swearing by Allah regarding this matter in the \npresence of the Prophet (ﷺ) and the Prophet (ﷺ) did not disapprove of it.\"","reference":"Sahih al-Bukhari 7355, Book 96, Hadith 82","grade":"","question #":"question #1","question":"What is the significance of swearing by Allah in Islamic tradition?","id":"bukhari-96-86"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Horses may be used for three purposes: For a man they may be a source of \nreward (in the Hereafter); for another, a means of protection; and for another, a source of sin. The man \nfor whom they are a source of reward, is the one who keeps them for Allah's Cause and ties them with \nlong ropes and lets them graze in a pasture or garden. Whatever those long ropes allow them to eat of \nthat pasture or garden, will be written as good deeds for him and if they break their ropes and run one \nor two rounds, then all their footsteps and dung will be written as good deeds for him, and if they pass \na river and drink from it though he has had no intention of watering them, even then, that will be \nwritten as good deeds for him. So such horses are a source of reward for that man. For the man who \nkeeps horses for his livelihood in order not to ask others for help or beg his bread, and at the same \ntime he does not forget Allah's right of what he earns through them and of their backs (that he presents \nit to be used in Allah's Cause), such horses are a shelter for him (from poverty). For the man who \nkeeps them just out of pride and for showing off, they are a source of sin.\" Then Allah's Messenger (ﷺ) was \nasked about donkeys. He said, \"Allah has not revealed anything to me regarding them except this \ncomprehensive Verse: \n\"Then anyone who has done good, equal to the weight of an atom (or a small ant) shall see it, and any \none who has done evil, equal to the weight of an atom (or a small ant) shall see it.\" (99.7-8)","reference":"Sahih al-Bukhari 7356, Book 96, Hadith 83","grade":"","question #":"question #1","question":"What are the different purposes for which horses can be used according to Islamic teachings?","id":"bukhari-96-87"},{"hadith-eng":"A woman asked the Prophet (Hadith 456).Narrated `Aisha:A woman asked the Prophet (ﷺ) about the periods: How to take a bath after the periods. He said, \"Take a \nperfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself\" She said again, \"How shall I clean myself, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself with it.\" Then I knew what Allah's Messenger (ﷺ) \nmeant. So I pulled her aside and explained it to her.","reference":"Sahih al-Bukhari 7357, Book 96, Hadith 84","grade":"","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding purification after menstruation?","id":"bukhari-96-88"},{"hadith-eng":"Um Hufaid bint Al-Harith bin Hazn presented the Prophet (ﷺ) with some butter, dried yoghurt (curd milk) \nand mastigures as a gift. The Prophet (ﷺ) then asked for a meal (mastigures etc. to be put) and it was eaten \nover his table cloth, but the Prophet (ﷺ) did not eat of it, as he had aversion to it. But if it had been illegal \nto eat, it would not have been eaten over his table cloth nor would he have ordered that (mastigures \nmeat) to be eaten.","reference":"Sahih al-Bukhari 7358, Book 96, Hadith 85","grade":"","question #":"question #1","question":"What can be inferred about the permissibility of eating certain foods based on the Prophet's actions?","id":"bukhari-96-89"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep \naway from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked \nvegetables was brought to the Prophet (ﷺ) at Badr. Detecting a bad smell from it, he asked about the dish \nand was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was \nbrought near to one of his companions who was with him. When the Prophet (ﷺ) saw it, he disliked \neating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\"","reference":"Sahih al-Bukhari 7359, Book 96, Hadith 86","grade":"","question #":"question #1","question":"What is the significance of avoiding certain foods before attending communal prayers in Islam?","id":"bukhari-96-90"},{"hadith-eng":"A lady came to Allah's Messenger (ﷺ) and she talked to him about something, and he gave her some order. \nShe said, \"O Allah's Messenger (ﷺ)! If I should not find you?\" He said, \"If you should not find me, then go to \nAbu Bakr.\" Ibrahim bin Sa`d said, \"As if she meant the death (of the Prophet).","reference":"Sahih al-Bukhari 7360, Book 96, Hadith 87","grade":"","question #":"question #1","question":"Who did the Prophet Muhammad (ﷺ) recommend as a leader or guide in his absence?","id":"bukhari-96-91"},{"hadith-eng":"Narrated Humaid bin 'Abdur-Rahman that he heard Mu'awiya talking to a group of people from Quraish at Al-Madina, and on mentioning Ka'b Al-Ashbar, he said, \"He was one of the most truthful of those who used to talk about the people of the Scripture, yet we used to detect certain faults in his information.\"","reference":"Sahih al-Bukhari 7361, Book 96, Hadith 88","grade":"","question #":"question #1","question":"What is the significance of verifying the truthfulness of information from people of the Scripture?","id":"bukhari-96-92"},{"hadith-eng":"The people of the Book used to read the Torah in Hebrew and then explain it in Arabic to the \nMuslims. Allah's Messenger (ﷺ) said (to the Muslims). \"Do not believe the people of the Book, nor \ndisbelieve them, but say, 'We believe in Allah and whatever is revealed to us, and whatever is \nrevealed to you.' \"","reference":"Sahih al-Bukhari 7362, Book 96, Hadith 89","grade":"","question #":"question #1","question":"How should Muslims approach the teachings of the People of the Book according to Islamic guidance?","id":"bukhari-96-93"},{"hadith-eng":"Ibn `Abbas said, \"Why do you ask the people of the scripture about anything while your Book \n(Qur'an) which has been revealed to Allah's Messenger (ﷺ) is newer and the latest? You read it pure, \nundistorted and unchanged, and Allah has told you that the people of the scripture (Jews and \nChristians) changed their scripture and distorted it, and wrote the scripture with their own hands and \nsaid, 'It is from Allah,' to sell it for a little gain. Does not the knowledge which has come to you \nprevent you from asking them about anything? No, by Allah, we have never seen any man from them \nasking you regarding what has been revealed to you!\"","reference":"Sahih al-Bukhari 7363, Book 96, Hadith 90","grade":"","question #":"question #1","question":"What is the significance of relying on the Qur'an as a primary source of guidance for Muslims?","id":"bukhari-96-94"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as you are in agreement as to its \ninterpretation and meanings, but when you have differences regarding its interpretation and meanings, \nthen you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)","reference":"Sahih al-Bukhari 7364, Book 96, Hadith 91","grade":"","question #":"question #1","question":"What should be done when there are disagreements in the interpretation and meanings of the Qur'an?","id":"bukhari-96-95"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as your hearts are in agreement as to its \nmeanings, but if you have differences as regards its meaning, stop reading it then.\"","reference":"Sahih al-Bukhari 7365, Book 96, Hadith 92","grade":"","question #":"question #1","question":"What should be done when there are disagreements in understanding the meanings of the Qur'an?","id":"bukhari-96-96"},{"hadith-eng":"When the time of the death of the Prophet (ﷺ) approached while there were some men in the house, and \namong them was `Umar bin Al-Khatttab, the Prophet (ﷺ) said, \"Come near let me write for you a writing \nafter which you will never go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill, and you have the \nQur'an, so Allah's Book is sufficient for us.\" The people in the house differed and disputed. Some of \nthem said, \"Come near so that Allah's Messenger (ﷺ) may write for you a writing after which you will not go \nastray,\" while some of them said what `Umar said. When they made much noise and differed greatly \nbefore the Prophet, he said to them, \"Go away and leave me.\" Ibn `Abbas used to say, \"It was a great \ndisaster that their difference and noise prevented Allah's Messenger (ﷺ) from writing that writing for them.","reference":"Sahih al-Bukhari 7366, Book 96, Hadith 93","grade":"","question #":"question #1","question":"What was the significance of the Prophet's intention to write something for his followers before his death?","id":"bukhari-96-97"},{"hadith-eng":"I heard Jabir bin `Abdullah in a gathering saying, \"We, the companions of Allah's Messenger (ﷺ) assumed \nthe state of Ihram to perform only Hajj without `Umra.\" Jabir added, \"The Prophet (ﷺ) arrived (at Mecca) \non the fourth of Dhul-Hijja. And when we arrived (in Mecca) the Prophet (ﷺ) ordered us to finish the state \nof Ihram, saying, \"Finish your lhram and go to your wives (for sexual relation).\" Jabir added, \"The \nProphet did not oblige us (to go to our wives) but he only made that legal for us. Then he heard that \nwe were saying, \"When there remains only five days between us and the Day of `Arafat he orders us \nto finish our Ihram by sleeping with our wives in which case we will proceed to `Arafat with our male \norgans dribbling with semen?' (Jabir pointed out with his hand illustrating what he was saying). \nAllah's Messenger (ﷺ) stood up and said, 'You (People) know that I am the most Allah-fearing, the most \ntruthful and the best doer of good deeds (pious) from among you. If I had not brought the Hadi with \nme, I would have finished my Ihram as you will do, so finish your Ihram. If I had formerly known \nwhat I came to know lately, I would not have brought the Hadi with me.' So we finished our Ihram \nand listened to the Prophet (ﷺ) and obeyed him.\" (See Hadith No. 713, Vol. 2)","reference":"Sahih al-Bukhari 7367, Book 96, Hadith 94","grade":"","question #":"question #1","question":"What is the significance of the Prophet's instruction to the companions regarding the completion of Ihram during Hajj?","id":"bukhari-96-98"},{"hadith-eng":"The Prophet (ﷺ) said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and \nthe third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna \n(tradition). (See Hadith No. 277, Vol. 2)","reference":"Sahih al-Bukhari 7368, Book 96, Hadith 95","grade":"","question #":"question #1","question":"What is the significance of performing optional prayers before the Maghrib prayer?","id":"bukhari-96-99"},{"hadith-eng":"After the slanderers had given a forged statement against her, Allah's Messenger (ﷺ) called `Ali bin Abi Talib \nand Usama bin Zaid when the Divine Inspiration was delayed. He wanted to ask them and consult \nthem about the question of divorcing me. Usama gave his evidence that was based on what he knew \nabout my innocence, but `Ali said, \"Allah has not put restrictions on you and there are many women \nother than her. Furthermore you may ask the slave girl who will tell you the truth.\" So the Prophet (ﷺ) \nasked Barira (my salve girl), \"Have you seen anything that may arouse your suspicion?\" She replied, \n\"I have not seen anything more than that she is a little girl who sleeps, leaving the dough of her family \n(unguarded) that the domestic goats come and eat it.\" Then the Prophet (ﷺ) stood on the pulpit and said, \n\"O Muslims! Who will help me against the man who has harmed me by slandering my wife? By \nAllah, I know nothing about my family except good.\" The narrator added: Then the Prophet (ﷺ) \nmentioned the innocence of `Aisha. (See Hadith No. 274, Vol. 6)","reference":"Sahih al-Bukhari 7369, Book 96, Hadith 96","grade":"","question #":"question #1","question":"What role does consultation play in decision-making according to Islamic teachings?","id":"bukhari-96-100"},{"hadith-eng":"Allah's Messenger (ﷺ) addressed the people, and after praising and glorifying Allah, he said, \"What do you \nsuggest me regarding those people who are abusing my wife? I have never known anything bad about \nher.\" The sub-narrator, `Urwa, said: When `Aisha was told of the slander, she said, \"O Allah's \nApostle! Will you allow me to go to my parents' home?\" He allowed her and sent a slave along with \nher. An Ansari man said, \"Subhanaka! It is not right for us to speak about this. Subhanaka! This is a \ngreat lie!\"","reference":"Sahih al-Bukhari 7370, Book 96, Hadith 97","grade":"","question #":"question #1","question":"How should one respond to slander and false accusations in a community?","id":"bukhari-96-101"},{"hadith-eng":"A Jew said to `Umar, \"O Chief of the Believers, if this verse: 'This day I have perfected your religion \nfor you, completed My favors upon you, and have chosen for you, Islam as your religion.' (5.3) had \nbeen revealed upon us, we would have taken that day as an `Id (festival) day.\" `Umar said, \"I know \ndefinitely on what day this Verse was revealed; it was revealed on the day of `Arafat, on a Friday.\"","reference":"Sahih al-Bukhari 7268, Book 96, Hadith 1","grade":"","question #":"question #2","question":"Why might the day of the revelation of a significant verse be considered a festival day?","id":"bukhari-96-102"},{"hadith-eng":"That he heard `Umar speaking while standing on the pulpit of the Prophet (ﷺ) in the morning (following \nthe death of the Prophet), when the people had sworn allegiance to Abu Bakr. He said the Tashah-hud \nbefore Abu Bakr, and said, \"Amma Ba'du (then after) Allah has chosen for his Apostle what is with \nHim (Paradise) rather than what is with you (the world). This is that Book (Qur'an) with which Allah \nguided your Apostle, so stick to it, for then you will be guided on the right path as Allah guided His \nApostle with it.\"","reference":"Sahih al-Bukhari 7269, Book 96, Hadith 2","grade":"","question #":"question #2","question":"How did the early Muslim community respond to the leadership transition after the Prophet's death?","id":"bukhari-96-103"},{"hadith-eng":"The Prophet (ﷺ) embraced me and said, \"O Allah! Teach him (the knowledge of) the Book (Qur'an).\"","reference":"Sahih al-Bukhari 7270, Book 96, Hadith 3","grade":"","question #":"question #2","question":"How does the Prophet's interaction with his companions reflect his concern for their spiritual and educational growth?","id":"bukhari-96-104"},{"hadith-eng":"Abu Barza said, \"(O people!) Allah makes you self-sufficient or has raised you high with Islam and \nwith Muhammad.\"","reference":"Sahih al-Bukhari 7271, Book 96, Hadith 4","grade":"","question #":"question #2","question":"What significance does the Prophet Muhammad hold in the elevation of the Muslim community?","id":"bukhari-96-105"},{"hadith-eng":"`Abdullah Bin `Umar wrote to `Abdul Malik bin Marwan, swearing allegiance to him: 'I swear \nallegiance to you in that I will listen and obey what is in accordance with the Laws of Allah and the \nTradition of His Apostle as much as I can.'","reference":"Sahih al-Bukhari 7272, Book 96, Hadith 5","grade":"","question #":"question #2","question":"How does one balance personal capability with the commitment to follow Islamic laws and traditions?","id":"bukhari-96-106"},{"hadith-eng":"Abu Huraira said that Allah's Messenger (ﷺ) said, \"I have been sent with 'Jawami-al-Kalim ' (the shortest \nexpression with the widest meaning) and have been made victorious with awe (cast in my enemy's \nhearts), and while I was sleeping, I saw that the keys of the treasures of the world were placed in my \nhand.\" Abu Huraira added: Allah's Messenger (ﷺ) has gone, and you people are utilizing those treasures, or \ndigging those treasures out.\" or said a similar sentence.","reference":"Sahih al-Bukhari 7273, Book 96, Hadith 6","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) describe his victory over his enemies?","id":"bukhari-96-107"},{"hadith-eng":"The Prophet (ﷺ) said, \"There was no prophet among the prophets but was given miracles because of \nwhich people had security or had belief, but what I was given was the Divine Inspiration which Allah \nrevealed to me. So I hope that my followers will be more than those of any other prophet on the Day \nof Resurrection.\"","reference":"Sahih al-Bukhari 7274, Book 96, Hadith 7","grade":"","question #":"question #2","question":"How does Divine Inspiration play a role in the belief and security of the followers of Prophet Muhammad?","id":"bukhari-96-108"},{"hadith-eng":"I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar once sat beside me here \nas you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the \nKa`ba) among the Muslims'. I said, 'You cannot do that.' `Umar said, 'Why?' I said, 'Your two \n(previous) companions (the Prophet (ﷺ) and Abu Bakr) did not do it. `Umar said, 'They are the two \npersons whom one must follow.'\" (See Hadith No. 664, Vol. 2)","reference":"Sahih al-Bukhari 7275, Book 96, Hadith 8","grade":"","question #":"question #2","question":"How does the concept of leadership and consultation appear in the context of distributing wealth in Islam?","id":"bukhari-96-109"},{"hadith-eng":"Allah's Messenger (ﷺ) said to us, \"Honesty descended from the Heavens and settled in the roots of the hearts \nof men (faithful believers), and then the Qur'an was revealed and the people read the Qur'an, (and \nlearnt it from it) and also learnt it from the Sunna.\" Both Qur'an and Sunna strengthened their (the \nfaithful believers') honesty. (See Hadith No. 208)","reference":"Sahih al-Bukhari 7276, Book 96, Hadith 9","grade":"","question #":"question #2","question":"What is the significance of the Qur'an and Sunna in reinforcing honesty among believers?","id":"bukhari-96-110"},{"hadith-eng":"The best talk (speech) is Allah's Book 'Qur'an), and the best way is the way of Muhammad, and the \nworst matters are the heresies (those new things which are introduced into the religion); and whatever \nyou have been promised will surely come to pass, and you cannot escape (it).","reference":"Sahih al-Bukhari 7277, Book 96, Hadith 10","grade":"","question #":"question #2","question":"Why is it important to follow the way of Prophet Muhammad in Islam?","id":"bukhari-96-111"},{"hadith-eng":"We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's \nBook (Laws).\"","reference":"Sahih al-Bukhari 7278, 7279, Book 96, Hadith 11","grade":"","question #":"question #2","question":"What is the significance of using Allah's Book as a basis for judgment in Islam?","id":"bukhari-96-112"},{"hadith-eng":"We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's \nBook (Laws).\"","reference":"Sahih al-Bukhari 7278, 7279, Book 96, Hadith 11","grade":"","question #":"question #2","question":"What is the significance of using divine laws in resolving conflicts between individuals?","id":"bukhari-96-113"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"All my followers will enter Paradise except those who refuse.\" They said, \"O \nAllah's Messenger (ﷺ)! Who will refuse?\" He said, \"Whoever obeys me will enter Paradise, and whoever \ndisobeys me is the one who refuses (to enter it).\"","reference":"Sahih al-Bukhari 7280, Book 96, Hadith 12","grade":"","question #":"question #2","question":"How does disobedience to the Prophet Muhammad (ﷺ) relate to refusing entry into Paradise?","id":"bukhari-96-114"},{"hadith-eng":"Some angels came to the Prophet (ﷺ) while he was sleeping. Some of them said, \"He is sleeping.\" Others \nsaid, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this \ncompanion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He \nis sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His \nexample is that of a man who has built a house and then offered therein a banquet and sent an inviter \n(messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house \nand ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the \nhouse, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he \nmay understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but \nhis heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is \nMuhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, \ndisobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished \nfrom the bad, and the believers from the disbelievers).","reference":"Sahih al-Bukhari 7281, Book 96, Hadith 13","grade":"","question #":"question #2","question":"How does the obedience to the Prophet Muhammad relate to obedience to Allah in Islamic teachings?","id":"bukhari-96-115"},{"hadith-eng":"Hudhaifa said, \"O the Group of Al-Qurra! Follow the straight path, for then you have taken a great \nlead (and will be the leaders), but if you divert right or left, then you will go astray far away.\"","reference":"Sahih al-Bukhari 7282, Book 96, Hadith 14","grade":"","question #":"question #2","question":"What are the consequences of deviating from the straight path according to Islamic teachings?","id":"bukhari-96-116"},{"hadith-eng":"The Prophet (ﷺ) said, \"My example and the example of what I have been sent with is that of a man who \ncame to some people and said, 'O people! I have seen the enemy's army with my own eyes, and I am \nthe naked warner; so protect yourselves!' Then a group of his people obeyed him and fled at night \nproceeding stealthily till they were safe, while another group of them disbelieved him and stayed at \ntheir places till morning when the army came upon them, and killed and ruined them completely So \nthis is the example of that person who obeys me and follows what I have brought (the Qur'an and the \nSunna), and the example of the one who disobeys me and disbelieves the truth I have brought.\"","reference":"Sahih al-Bukhari 7283, Book 96, Hadith 15","grade":"","question #":"question #2","question":"How does belief in the Prophet's message relate to one's spiritual safety and well-being?","id":"bukhari-96-117"},{"hadith-eng":"When Allah's Messenger (ﷺ) died and Abu Bakr was elected as a Caliph after him, some of the Arabs \nreverted to disbelief, `Umar said to Abu Bakr, \"How dare you fight the people while Allah's Messenger (ﷺ) \nsaid, I have been ordered to fight the people till they say 'None has the right to be worshipped but \nAllah' And whoever says: None has the right to be worshipped but Allah.' waves his wealth and his \nlife from me unless he deserves a legal punishment lusty, and his account will be with Allah! Abu \nBakr said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the \nCompulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope \nwhich they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar said, 'By \nAllah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr to the fight, and I \ncame to know for certain that was the truth.\"","reference":"Sahih al-Bukhari 7284, 7285, Book 96, Hadith 16","grade":"","question #":"question #2","question":"How did Umar's perspective change regarding Abu Bakr's decision to fight those who discriminated between Zakat and prayers?","id":"bukhari-96-118"},{"hadith-eng":"When Allah's Messenger (ﷺ) died and Abu Bakr was elected as a Caliph after him, some of the Arabs \nreverted to disbelief, `Umar said to Abu Bakr, \"How dare you fight the people while Allah's Messenger (ﷺ) \nsaid, I have been ordered to fight the people till they say 'None has the right to be worshipped but \nAllah' And whoever says: None has the right to be worshipped but Allah.' waves his wealth and his \nlife from me unless he deserves a legal punishment lusty, and his account will be with Allah! Abu \nBakr said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the \nCompulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope \nwhich they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar said, 'By \nAllah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr to the fight, and I \ncame to know for certain that was the truth.\"","reference":"Sahih al-Bukhari 7284, 7285, Book 96, Hadith 16","grade":"","question #":"question #2","question":"How did Umar's perspective change regarding Abu Bakr's decision to fight those who withheld Zakat?","id":"bukhari-96-119"},{"hadith-eng":"Uyaina bin Hisn bin Hudhaifa bin Badr came and stayed (at Medina) with his nephew Al-Hurr bin \nQais bin Hisn who was one of those whom `Umar used to keep near him, as the Qurra' (learned men \nknowing Qur'an by heart) were the people of `Umar's meetings and his advisors whether they were old \nor young. 'Uyaina said to his nephew, \"O my nephew! Have you an approach to this chief so as to get \nfor me the permission to see him?\" His nephew said, \"I will get the permission for you to see him.\" \n(Ibn `Abbas added: ) So he took the permission for 'Uyaina, and when the latter entered, he said, \"O \nthe son of Al-Khattab! By Allah, you neither give us sufficient provision nor judge among us with \njustice.\" On that `Umar became so furious that he intended to harm him. Al-Hurr, said, \"O Chief of \nthe Believers!\" Allah said to His Apostle 'Hold to forgiveness, command what is good (right), and \nleave the foolish (i.e. do not punish them).' (7.199) and this person is among the foolish.\" By Allah, \n`Umar did not overlook that Verse when Al-Hurr recited it before him, and `Umar said to observe (the \norders of) Allah's Book strictly.\" (See Hadith No. 166, Vol. 6)","reference":"Sahih al-Bukhari 7286, Book 96, Hadith 17","grade":"","question #":"question #2","question":"How should a leader respond to criticism or harsh words from others in light of Islamic principles?","id":"bukhari-96-120"},{"hadith-eng":"I came to `Aisha during the solar eclipse. The people were standing (offering prayer) and she too, was \nstanding and offering prayer. I asked, \"What is wrong with the people?\" She pointed towards the sky \nwith her hand and said, Subhan Allah!'' I asked her, \"Is there a sign?\" She nodded with her head \nmeaning, yes. When Allah's Messenger (ﷺ) finished (the prayer), he glorified and praised Allah and said, \n\"There is not anything that I have not seen before but I have seen now at this place of mine, even \nParadise and Hell. It has been revealed to me that you people will be put to trial nearly like the trial of \nAd-Dajjal, in your graves. As for the true believer or a Muslim (the sub-narrator is not sure as to \nwhich of the two (words Asma' had said) he will say, 'Muhammad came with clear signs from Allah, \nand we responded to him (accepted his teachings) and believed (what he said)' It will be said (to him) \n'Sleep in peace; we have known that you were a true believer who believed with certainty.' As for a \nhypocrite or a doubtful person, (the sub-narrator is not sure as to which word Asma' said) he will say, \n'I do not know, but I heard the people saying something and so I said the same.' \"","reference":"Sahih al-Bukhari 7287, Book 96, Hadith 18","grade":"","question #":"question #2","question":"How does the hadith describe the trials faced by believers and hypocrites in their graves?","id":"bukhari-96-121"},{"hadith-eng":"The Prophet (ﷺ) said, \"Leave me as I leave you, for the people who were before you were ruined because \nof their questions and their differences over their prophets. So, if I forbid you to do something, then \nkeep away from it. And if I order you to do something, then do of it as much as you can.\"","reference":"Sahih al-Bukhari 7288, Book 96, Hadith 19","grade":"","question #":"question #2","question":"How should Muslims approach commands and prohibitions given by the Prophet Muhammad (ﷺ)?","id":"bukhari-96-122"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most sinful person among the Muslims is the one who asked about something \nwhich had not been prohibited, but was prohibited because of his asking.\"","reference":"Sahih al-Bukhari 7289, Book 96, Hadith 20","grade":"","question #":"question #2","question":"How can asking certain questions lead to prohibitions in Islamic law?","id":"bukhari-96-123"},{"hadith-eng":"The Prophet (ﷺ) took a room made of date palm leaves mats in the mosque. Allah's Messenger (ﷺ) prayed in it \nfor a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the \n4th night the people did not hear his voice and they thought he had slept, so some of them started \nhumming in order that he might come out. The Prophet (ﷺ) then said, \"You continued doing what I saw \nyou doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined \non you, you would not continue performing it. Therefore, O people! Perform your prayers at your \nhomes, for the best prayer of a person is what is performed at his home except the compulsory \ncongregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)","reference":"Sahih al-Bukhari 7290, Book 96, Hadith 21","grade":"","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) express concern about the Tarawih prayer becoming obligatory?","id":"bukhari-96-124"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about things which he disliked, and when the people asked too many \nquestions, he became angry and said, \"Ask me (any question).\" A man got up and said, \"O Allah's \nApostle! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then another man got up \nand said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) said, \"Your father is Salim, Maula \nShaiba.\" When `Umar saw the signs of anger on the face of Allah's Messenger (ﷺ), he said, \"We repent to \nAllah.\"","reference":"Sahih al-Bukhari 7291, Book 96, Hadith 22","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to questions that were unnecessary or excessive?","id":"bukhari-96-125"},{"hadith-eng":"(The clerk of Al-Mughira) Muawiya wrote to Al-Mughira 'Write to me what you have heard from \nAllah's Messenger (ﷺ).' So he (Al-Mughira) wrote to him: Allah's Prophet used to say at the end of each \nprayer: \"La ilaha illalla-h wahdahu la sharika lahu, lahul Mulku, wa lahul Hamdu wa hula ala kulli \nshai'in qadir. 'Allahumma la mani' a lima a'taita, wala mu'tiya lima mana'ta, wala yanfa'u dhuljadd \nminkal-jadd.\" He also wrote to him that the Prophet (ﷺ) used to forbid (1) Qil and Qal (idle useless talk or \nthat you talk too much about others), (2) Asking too many questions (in disputed Religious matters); \n(3) And wasting one's wealth by extravagance; (4) and to be undutiful to one's mother (5) and to bury \nthe daughters alive (6) and to prevent your favors (benevolence to others (i.e. not to pay the rights of \nothers (7) And asking others for something (except when it is unavoidable).","reference":"Sahih al-Bukhari 7292, Book 96, Hadith 23","grade":"","question #":"question #2","question":"What behaviors and actions are discouraged by the Prophet in order to maintain a righteous lifestyle?","id":"bukhari-96-126"},{"hadith-eng":"We were with `Umar and he said, \"We have been forbidden to undertake a difficult task beyond our \ncapability (i.e. to exceed the religious limits e.g., to clean the inside of the eyes while doing ablution).","reference":"Sahih al-Bukhari 7293, Book 96, Hadith 24","grade":"","question #":"question #2","question":"Why is it important to avoid exceeding religious limits in Islamic practices?","id":"bukhari-96-127"},{"hadith-eng":"The Prophet (ﷺ) came out after the sun had declined and offered the Zuhr prayer (in congregation). After \nfinishing it with Taslim, he stood on the pulpit and mentioned the Hour and mentioned there would \nhappen great events before it. Then he said, \"Whoever wants to ask me any question, may do so, for \nby Allah, you will not ask me about anything but I will inform you of its answer as long as I am at this \nplace of mine.\" On this, the Ansar wept violently, and Allah's Messenger (ﷺ) kept on saying, \"Ask Me! \" \nThen a man got up and asked, ''Where will my entrance be, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \n\"(You will go to) the Fire.\" Then `Abdullah bin Hudhaifa got up and asked, \"Who is my father, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" The Prophet (ﷺ) then kept on saying \n(angrily), \"Ask me! Ask me!\" `Umar then knelt on his knees and said, \"We have accepted Allah as our \nLord and Islam as our religion and Muhammad as an Apostle.\" Allah's Messenger (ﷺ) became quiet when \n`Umar said that. Then Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, Paradise and Hell \nwere displayed before me across this wall while I was praying, and I never saw such good and evil as \nI have seen today.\"","reference":"Sahih al-Bukhari 7294, Book 96, Hadith 25","grade":"","question #":"question #2","question":"How did the companions of the Prophet react when he invited them to ask questions about the Hour?","id":"bukhari-96-128"},{"hadith-eng":"A man said, \"O Allah's Prophet! Who is my father?\" The Prophet (ﷺ) said, \"Your father is so-and-so.\" \nAnd then the Divine Verse:-- 'O you who believe! Ask not questions about things..(5.101)","reference":"Sahih al-Bukhari 7295, Book 96, Hadith 26","grade":"","question #":"question #2","question":"How does the Quran address the issue of questioning matters that may cause distress or confusion?","id":"bukhari-96-129"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"People will not stop asking questions till they say, 'This is Allah, the Creator of \neverything, then who created Allah?' \"","reference":"Sahih al-Bukhari 7296, Book 96, Hadith 27","grade":"","question #":"question #2","question":"How should one approach questions that challenge the concept of Allah's existence?","id":"bukhari-96-130"},{"hadith-eng":"I was with the Prophet (ﷺ) at one of the farms of Medina while he was leaning on a date palm leaf-stalk. \nHe passed by a group of Jews and some of them said to the other, Ask him (the Prophet) about the \nspirit. Some others said, \"Do not ask him, lest he should tell you what you dislike\" But they went up \nto him and said, \"O Abal Qasim! Inform us bout the spirit.\" The Prophet (ﷺ) stood up for a while, waiting. \nI realized that he was being Divinely Inspired, so I kept away from him till the inspiration was over. \nThen the Prophet (ﷺ) said, \"(O Muhammad) they ask you regarding the spirit, Say: The spirit its \nknowledge is with my Lord (i.e., nobody has its knowledge except Allah)\" (17.85) (This is a miracle \nof the Qur'an that all the scientists up till now do not know about the spirit, i.e, how life comes to a \nbody and how it goes away at its death) (See Hadith No. 245, Vol. 6)","reference":"Sahih al-Bukhari 7297, Book 96, Hadith 28","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to questions about matters beyond human understanding?","id":"bukhari-96-131"},{"hadith-eng":"The Prophet (ﷺ) wore a gold ring and then the people followed him and wore gold rings too. Then the \nProphet said, \"I had this golden ring made for myself. He then threw it away and said, \"I shall never \nput it on.\" Thereupon the people also threw their rings away.","reference":"Sahih al-Bukhari 7298, Book 96, Hadith 29","grade":"","question #":"question #2","question":"How does the Prophet's decision to discard the gold ring reflect on the permissibility of wearing gold for men in Islam?","id":"bukhari-96-132"},{"hadith-eng":"The Prophet (ﷺ) said (to his companions), \"Do not fast Al-Wisal.\" They said, \"But you fast Al-Wisail.\" \nHe said, \"I am not like you, for at night my Lord feeds me and makes me drink.\" But the people did \nnot give up Al-Wisal, so the Prophet (ﷺ) fasted Al-Wisal with them for two days or two nights, and then \nthey saw the crescent whereupon the Prophet (ﷺ) said, \"If the crescent had delayed, I would have \ncontinued fasting (because of you),\" as if he wanted to vanquish them completely (because they had \nrefused to give up Al Wisal).","reference":"Sahih al-Bukhari 7299, Book 96, Hadith 30","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) demonstrate his unique relationship with Allah during fasting?","id":"bukhari-96-133"},{"hadith-eng":"`Ali addressed us while he was standing on a brick pulpit and carrying a sword from which was hanging a scroll He said \"By Allah, we have no book to read except Allah's Book and whatever is on this scroll,\" And then he unrolled it, and behold, in it was written what sort of camels were to be given as blood money, and there was also written in it: 'Medina is a sanctuary form 'Air (mountain) to such \nand such place so whoever innovates in it an heresy or commits a sin therein, he will incur the curse of Allah, the angels, and all the people and Allah will not accept his compulsory or optional good deeds.' \nThere was also written in it: 'The asylum (pledge of protection) granted by any Muslims is one and the \nsame, (even a Muslim of the lowest status is to be secured and respected by all the other Muslims, and \nwhoever betrays a Muslim in this respect (by violating the pledge) will incur the curse of Allah, the \nangels, and all the people, and Allah will not accept his compulsory or optional good deeds.' There \nwas also written in it: 'Whoever (freed slave) befriends (takes as masters) other than his real masters \n(manumitters) without their permission will incur the curse of Allah, the angels, and all the people, \nand Allah will not accept his compulsory or optional good deeds. ' (See Hadith No. 94, Vol. 3)","reference":"Sahih al-Bukhari 7300, Book 96, Hadith 31","grade":"","question #":"question #2","question":"How is the pledge of protection among Muslims described and what are the consequences of violating it?","id":"bukhari-96-134"},{"hadith-eng":"The Prophet (ﷺ) did something as it was allowed from the religious point of view but some people \nrefrained from it. When the Prophet (ﷺ) heard of that, he, after glorifying and praising Allah, said, \"Why \ndo some people refrain from doing something which I do? By Allah, I know Allah more than they.\"","reference":"Sahih al-Bukhari 7301, Book 96, Hadith 32","grade":"","question #":"question #2","question":"How does the Prophet (ﷺ) emphasize his understanding and knowledge of Allah compared to others?","id":"bukhari-96-135"},{"hadith-eng":"Once the two righteous men, i.e., Abu Bakr and `Umar were on the verge of destruction (and that was \nbecause): When the delegate of Bani Tamim came to the Prophet, one of them (either Abu Bakr or \n`Umar) recommended Al-Aqra' bin H`Abis at-Tamimi Al-Hanzali, the brother of Bani Majashi (to be \nappointed as their chief), while the other recommended somebody else. Abu Bakr said to `Umar, \"You \nintended only to oppose me.\" `Umar said, \"I did not intend to oppose you!\" Then their voices grew \nlouder in front of the Prophet (ﷺ) whereupon there was revealed: 'O you who believe! Do not raise your \nvoices above the voice of the Prophet..a great reward.' (49.2-3) Ibn Az-Zubair said, 'Thence forward \nwhen `Umar talked to the Prophet, he would talk like one who whispered a secret and would even fail \nto make the Prophet (ﷺ) hear him, in which case the Prophet (ﷺ) would ask him (to repeat his words).","reference":"Sahih al-Bukhari 7302, Book 96, Hadith 33","grade":"","question #":"question #2","question":"How did the revelation of certain verses impact the behavior of the companions towards the Prophet?","id":"bukhari-96-136"},{"hadith-eng":"(the mother of believers) Allah's Messenger (ﷺ) during his fatal ailment said, \"Order Abu Bakr to lead the \npeople in prayer.\" I said, \"If Abu Bakr stood at your place (in prayers, the people will not be able to \nhear him because of his weeping, so order `Umar to lead the people in prayer.\" He again said, \"Order \nAbu Bakr to lead the people in prayer \" Then I said to Hafsa, \"Will you say (to the Prophet), 'If Abu \nBakr stood at your place, the people will not be able to hear him be cause of his weeping, so order \n`Umar to lead the people in prayer?\" Hafsa did so, whereupon Allah's Messenger (ﷺ) said, \"You are like the \ncompanions of Joseph (See Qur'an, 12:30-32). Order Abu Bakr to lead the people in prayer.\" Hafsa \nthen said to me, \"I have never received any good from you!\"","reference":"Sahih al-Bukhari 7303, Book 96, Hadith 34","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to suggestions about changing his decision regarding leadership in prayer?","id":"bukhari-96-137"},{"hadith-eng":"'Uwaimir Al-`Ajlani came to `Asim bin `Adi and said, \"If a man found another man with his wife and \nkilled him, would you sentence the husband to death (in Qisas,) i.e., equality in punishment)? O \n`Asim! Please ask Allah's Messenger (ﷺ) about this matter on my behalf.\" `Asim asked the Prophet (ﷺ) but the \nProphet disliked the question and disapproved of it. `Asim returned and informed 'Uwaimir that the \nProphet disliked that type of question. 'Uwaimir said, \"By Allah, I will go (personally) to the Prophet.\" \n'Uwaimir came to the Prophet (ﷺ) when Allah had already revealed Qur'anic Verses (in that respect), after \n`Asim had left (the Prophet (ﷺ) ). So the Prophet (ﷺ) said to 'Uwaimir, \"Allah has revealed Qur'anic Verses \nregarding you and your wife.\" The Prophet (ﷺ) then called for them, and they came and carried out the \norder of Lian. \nThen 'Uwaimir said, \"O Allah's Messenger (ﷺ)! Now if I kept her with me, I would be accused of telling a \nlie.\" So 'Uwaimir divorced her although the Prophet (ﷺ) did not order him to do so. Later on this practice \nof divorcing became the tradition of couples involved in a case of Li'an. The Prophet (ﷺ) said (to the \npeople). \"Wait for her! If she delivers a red short (small) child like a Wahra (a short red animal). then \nI will be of the opinion that he ('Uwaimir) has told a lie but if she delivered a black big-eyed one with \nbig buttocks, then I will be of the opinion that he has told the truth about her.\" 'Ultimately she gave \nbirth to a child that proved the accusation. (See Hadith No. 269, Vol. 6)","reference":"Sahih al-Bukhari 7304, Book 96, Hadith 35","grade":"","question #":"question #2","question":"How does the practice of Li'an address accusations of infidelity in a marriage?","id":"bukhari-96-138"},{"hadith-eng":"I proceeded till I entered upon `Umar (and while I was sitting there), his gate-keeper Yarfa came to \nhim and said, \" `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d ask your permission to come in.\" \n`Umar allowed them. So they entered, greeted, and sat down. (After a while the gatekeeper came) and \nsaid, \"Shall I admit `Ali and `Abbas?'' `Umar allowed them to enter. Al-`Abbas said \"O Chief of the \nbelievers! Judge between me and the oppressor (`Ali).\" Then there was a dispute (regarding the \nproperty of Bani Nadir) between them (`Abbas and `Ali). `Uthman and his companions said, \"O Chief \nof the Believers! Judge between them and relieve one from the other.\" `Umar said, \"Be patient! \nbeseech you by Allah, with Whose permission the Heaven and the Earth Exist! Do you know that \nAllah's Messenger (ﷺ) said, 'Our property is not to be inherited, and whatever we leave is to be given in \ncharity,' and by this Allah's Messenger (ﷺ) meant himself?\" On that the group said, \"He verily said so.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, do you both know that \nAllah's Messenger (ﷺ) said so?\" They both replied, \"Yes\". `Umar then said, \"Now I am talking to you about \nthis matter (in detail) . Allah favored Allah's Messenger (ﷺ) with some of this wealth which He did not give \nto anybody else, as Allah said: 'What Allah bestowed as Fai (Booty on His Apostle for which you \nmade no expedition... ' (59.6) \nSo that property was totally meant for Allah's Messenger (ﷺ), yet he did not collect it and ignore you, nor did \nhe withhold it with your exclusion, but he gave it to you and distributed it among you till this much of \nit was left behind, and the Prophet, used to spend of this as the yearly expenditures of his family and \nthen take what remained of it and spent it as he did with (other) Allah's wealth. The Prophet (ﷺ) did so \nduring all his lifetime, and I beseech you by Allah, do you know that?\" They replied, \"Yes.\" `Umar \nthen addressed `Ali and `Abbas, saying, \"I beseech you both by Allah, do you know that?\" Both of \nthem replied, \"Yes.\" `Umar added, \"Then Allah took His Apostle unto Him. Abu Bakr then said 'I am \nthe successor of Allah's Messenger (ﷺ)' and took over all the Prophet's property and disposed of it in the \nsame way as Allah's Messenger (ﷺ) used to do, and you were present then.\" Then he turned to `Ali and \n`Abbas and said, \"You both claim that Abu Bakr did so-and-so in managing the property, but Allah \nknows that Abu Bakr was honest, righteous, intelligent, and a follower of what is right in managing it. \nThen Allah took Abu Bakr unto Him, 'I said: I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' So \nI took over the property for two years and managed it in the same way as Allah's Messenger (ﷺ), and Abu \nBakr used to do. Then you both (`Ali and `Abbas) came to me and asked for the same thing! (O \n`Abbas! You came to me to ask me for your share from nephew's property; and this (`Ali) came to me \nasking for his wives share from her father's property, and I said to you both, 'If you wish, I will place \nit in your custody on condition that you both will manage it in the same way as Allah's Messenger (ﷺ) and \nAbu Bakr did and as I have been doing since I took charge of managing it; otherwise, do not speak to \nme anymore about it.' \nThen you both said, 'Give it to us on that (condition).' So I gave it to you on that condition. Now I \nbeseech you by Allah, did I not give it to them on that condition?\" The group (whom he had been \naddressing) replied, \"Yes.\" `Umar then addressed `Abbas and `Ali saying, \"I beseech you both by \nAllah, didn't I give you all that property on that condition?\" They said, \"Yes.\" `Umar then said, \"Are \nyou now seeking a verdict from me other than that? By Him with Whose Permission the Heaven and \nthe Earth exists I will not give any verdict other than that till the Hour is established; and if you both \nare unable to manage this property, then you can hand it back to me, and I will be sufficient for it on \nyour behalf.\" (See, Hadith No. 326, Vol. 4)","reference":"Sahih al-Bukhari 7305, Book 96, Hadith 36","grade":"","question #":"question #2","question":"How did the early caliphs manage the property left by the Prophet Muhammad (ﷺ) after his passing?","id":"bukhari-96-139"},{"hadith-eng":"I said to Anas, \"Did Allah's Messenger (ﷺ) make Medina a sanctuary?\" He replied, \"Yes, (Medina is a \nsanctuary from such-and-such place to such-and-such place. It is forbidden to cut its trees, and \nwhoever innovates an heresy in it or commits a sin therein, will incur the curse of Allah, the angels, \nand all the people.\" Then Musa bin Anas told me that Anas added, \"..... or gives refuge to such an \nheretic or a sinner...\"","reference":"Sahih al-Bukhari 7306, Book 96, Hadith 37","grade":"","question #":"question #2","question":"What are the consequences of innovating heresy or committing sins in Medina?","id":"bukhari-96-140"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Allah will not deprive you of knowledge after he has given it to you, but \nit will be taken away through the death of the religious learned men with their knowledge. Then there \nwill remain ignorant people who, when consulted, will give verdicts according to their opinions \nwhereby they will mislead others and go astray.\"","reference":"Sahih al-Bukhari 7307, Book 96, Hadith 38","grade":"","question #":"question #2","question":"How can the absence of knowledgeable religious leaders lead to misguidance in a community?","id":"bukhari-96-141"},{"hadith-eng":"I asked Abu Wail, \"Did you witness the battle of Siffin between `Ali and Muawiya?\" He said, \"Yes,\" \nand added, \"Then I heard Sahl bin Hunaif saying, 'O people! Blame your personal opinions in your \nreligion. No doubt, I remember myself on the day of Abi Jandal; if I had the power to refuse the order \nof Allah's Messenger (ﷺ), I would have refused it. \nWe have never put our swords on our shoulders to get involved in a situation that might have been \nhorrible for us, but those swords brought us to victory and peace, except this present situation.' \" Abu \nWail said, \"I witnessed the battle of Siffin, and how nasty Siffin was!\"","reference":"Sahih al-Bukhari 7308, Book 96, Hadith 39","grade":"","question #":"question #2","question":"How can historical battles like Siffin influence our understanding of conflict resolution in Islam?","id":"bukhari-96-142"},{"hadith-eng":"I fell ill, Allah's Messenger (ﷺ) and Abu Bakr came to visit me on foot. The Prophet (ﷺ) came to me while I was \nunconscious. Allah's Messenger (ﷺ) performed ablution and poured the Remaining water of his ablution over \nme whereupon I became conscious and said, 'O Allah's Messenger (ﷺ)! How should I spend my wealth? Or \nhow should I deal with my wealth?\" But the Prophet (ﷺ) did not give me any reply till the Verse of the \nlaws of inheritance was revealed.","reference":"Sahih al-Bukhari 7309, Book 96, Hadith 40","grade":"","question #":"question #2","question":"How did the revelation of the laws of inheritance come about in this context?","id":"bukhari-96-143"},{"hadith-eng":"A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Men (only) benefit by your teachings, \nso please devote to us from (some of) your time, a day on which we may come to you so that you may \nteach us of what Allah has taught you.\" Allah's Messenger (ﷺ) said, \"Gather on such-and-such a day at suchand- \nsuch a place.\" They gathered and Allah's Messenger (ﷺ) came to them and taught them of what Allah \nhad taught him. He then said, \"No woman among you who has lost her three children (died) but that \nthey will screen her from the Fire.\" A woman among them said, \"O Allah's Messenger (ﷺ)! If she lost two \nchildren?\" She repeated her question twice, whereupon the Prophet (ﷺ) said, \"Even two, even two, even \ntwo!\" (See Hadith No. 341, Vol. 2)","reference":"Sahih al-Bukhari 7310, Book 96, Hadith 41","grade":"","question #":"question #2","question":"How does the loss of children relate to a woman's protection from the Fire according to this teaching?","id":"bukhari-96-144"},{"hadith-eng":"The Prophet (ﷺ) said, \"A group of my follower swill remain predominant (victorious) till Allah's Order \n(the Hour) comes upon them while they are still predominant (victorious).","reference":"Sahih al-Bukhari 7311, Book 96, Hadith 42","grade":"","question #":"question #2","question":"How is the concept of victory and predominance understood in the context of Islamic teachings?","id":"bukhari-96-145"},{"hadith-eng":"I heard Muawiya bin Abi Sufyan delivering a sermon. He said, \"I heard the Prophet (ﷺ) saying, \"If Allah \nwants to do a favor to somebody, He bestows on him, the gift of understanding the Qur'an and Sunna. \nI am but a distributor, and Allah is the Giver. The state of this nation will remain good till the Hour is \nestablished, or till Allah's Order comes.\"","reference":"Sahih al-Bukhari 7312, Book 96, Hadith 43","grade":"","question #":"question #2","question":"How does the distribution of knowledge relate to divine will according to Islamic teachings?","id":"bukhari-96-146"},{"hadith-eng":"When the (following) Verse was revealed to Allah's Messenger (ﷺ): 'Say: He has power to send torment on \nyou from above,'..(6.65) he said, \"O Allah! I seek refuge with Your Face (from that punishment).\" \nAnd when this was revealed: '..or from beneath your feet.' (6.65) he said, \"O Allah! I seek refuge with \nYour Face (from that).\" And when this Verse was revealed: '..or to cover you with confusion in partystrife, \nand make you to taste the violence of one another,'...(6.65) he said: \"These two warnings are \neasier (than the previous ones).","reference":"Sahih al-Bukhari 7313, Book 96, Hadith 44","grade":"","question #":"question #2","question":"How does the Quran describe the different types of punishments that can befall a community?","id":"bukhari-96-147"},{"hadith-eng":"A bedouin came to Allah's Messenger (ﷺ) and said, \"My wife has delivered a black boy, and I suspect that he \nis not my child.\" Allah's Messenger (ﷺ) said to him, \"Have you got camels?\" The bedouin said, \"Yes.\" The \nProphet said, \"What color are they?\" The bedouin said, \"They are red.\" The Prophet (ﷺ) said, \"Are any of \nthem Grey?\" He said, \"There are Grey ones among them.\" The Prophet (ﷺ) said, \"Whence do you think \nthis color came to them?\" The bedouin said, \"O Allah's Messenger (ﷺ)! It resulted from hereditary \ndisposition.\" The Prophet (ﷺ) said, \"And this (i.e., your child) has inherited his color from his ancestors.\" \nThe Prophet (ﷺ) did not allow him to deny his paternity of the child.","reference":"Sahih al-Bukhari 7314, Book 96, Hadith 45","grade":"","question #":"question #2","question":"What is the Islamic perspective on denying paternity based on physical appearance?","id":"bukhari-96-148"},{"hadith-eng":"A woman came to the Prophet (ﷺ) and said, \"My mother vowed to perform the Hajj but she died before \nperforming it. Should I perform the Hajj on her behalf?\" He said, \"Yes! Perform the Hajj on her \nbehalf. See, if your mother had been in debt, would you have paid her debt?\" She said, \"Yes.\" He said, \n\"So you should pay what is for Him as Allah has more right that one should fulfill one's obligations to \nHim. \"","reference":"Sahih al-Bukhari 7315, Book 96, Hadith 46","grade":"","question #":"question #2","question":"How does fulfilling obligations to Allah compare to settling debts of a deceased person?","id":"bukhari-96-149"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Do not wish to be like anybody except in two cases: The case of a man whom \nAllah has given wealth and he spends it in the right way, and that of a man whom Allah has given \nreligious wisdom (i.e., Qur'an and Sunna) and he gives his verdicts according to it and teaches it.\" (to \nothers i.e., religious knowledge of Qur'an and Sunna (Prophet's Traditions)). \"","reference":"Sahih al-Bukhari 7316, Book 96, Hadith 47","grade":"","question #":"question #2","question":"What are the virtues of spending wealth in the right way according to Islamic teachings?","id":"bukhari-96-150"},{"hadith-eng":"`Umar bin Al-Khattab asked (the people) about the Imlas of a woman, i.e., a woman who has an \nabortion because of having been beaten on her `Abdomen, saying, \"Who among you has heard \nanything about it from the Prophet?\" I said, \"I did.'' He said, \"What is that?\" I said, \"I heard the \nProphet saying, \"Its Diya (blood money) is either a male or a female slave.' \" `Umar said, \"Do not \nleave till you present witness in support of your statement.\" So I went out, and found Muhammad bin \nMaslama. I brought him, and he bore witness with me that he had heard the Prophet (ﷺ) saying, \"Its Diya \n(blood money) is either a male slave or a female slave.\"","reference":"Sahih al-Bukhari 7317, 7318, Book 96, Hadith 48","grade":"","question #":"question #2","question":"How is blood money determined in the case of a woman who has an abortion due to being harmed?","id":"bukhari-96-151"},{"hadith-eng":"The Prophet (ﷺ) said, \"The Hour will not be established till my followers copy the deeds of the previous \nnations and follow them very closely, span by span, and cubit by cubit (i.e., inch by inch).\" It was \nsaid, \"O Allah's Messenger (ﷺ)! Do you mean by those (nations) the Persians and the Byzantines?\" The \nProphet said, \"Who can it be other than they?\"","reference":"Sahih al-Bukhari 7319, Book 96, Hadith 49","grade":"","question #":"question #2","question":"How does the imitation of previous nations by the followers of Islam relate to the concept of the end times?","id":"bukhari-96-152"},{"hadith-eng":"The Prophet (ﷺ) said, \"You will follow the ways of those nations who were before you, span by span and \ncubit by cubit (i.e., inch by inch) so much so that even if they entered a hole of a mastigure, you \nwould follow them.\" We said, \"O Allah's Messenger (ﷺ)! (Do you mean) the Jews and the Christians?\" He \nsaid, \"Whom else?\"","reference":"Sahih al-Bukhari 7320, Book 96, Hadith 50","grade":"","question #":"question #2","question":"How does the hadith highlight the influence of Jewish and Christian practices on Muslims?","id":"bukhari-96-153"},{"hadith-eng":"The Prophet (ﷺ) said, \"None is killed unjustly, but the first son of Adam will have a part of its burden.\" \nSufyan said, \"..a part of its blood because he was the first to establish the tradition of murdering\"","reference":"Sahih al-Bukhari 7321, Book 96, Hadith 51","grade":"","question #":"question #2","question":"How does the concept of bearing a part of the burden relate to the actions of the first murderer?","id":"bukhari-96-154"},{"hadith-eng":"A bedouin gave the Pledge of allegiance for embracing Islam to Allah's Messenger (ﷺ), and then he got an attack of fever in Medina and came to Allah's Messenger (ﷺ): and said, \"O Allah's Messenger (ﷺ)! Cancel my pledge.\" Allah's Messenger (ﷺ) refused to do so. The bedouin came to him again and said, \"Cancel my pledge,\" but he refused again, and then again, the bedouin came to him and said, \"Cancel my pledge,\" and Allah's Messenger (ﷺ) refused. The bedouin finally went away, and Allah's Messenger (ﷺ) said, \"Medina is like a pair of bellows (furnace), it expels its impurities while it brightens and clears its good.'","reference":"Sahih al-Bukhari 7322, Book 96, Hadith 52","grade":"","question #":"question #2","question":"How does the environment of Medina affect the faith and commitment of its inhabitants according to Islamic teachings?","id":"bukhari-96-155"},{"hadith-eng":"I used to teach Qur'an to 'Abdur-Rahman bin Auf. When Umar performed his last Hajj, 'Abdur-Rahman said (to me) at Mina, \"Would that you had seen Chief of the believers today! A man came to him and said, \"So-and-so has said, \"If Chief of the Believers died, we will give the oath of allegiance to such-and-such person,' 'Umar said, 'I will get up tonight and warn those who want to usurp the people's rights.' I said, 'Do not do so, for the season (of Hajj) gathers the riffraff mob who will form the majority of your audience, and I am afraid that they will not understand (the meaning of) your saying properly and may spread (an incorrect statement) everywhere. You should wait till we reach Medina, the place of migration and the place of the Sunna (the Prophet's Traditions). There you will meet the companions of Allah's Messenger (ﷺ) from the Muhajirin and the Ansar who will understand your statement and place it in its proper position' 'Umar said, 'By Allah, I shall do so the first time I stand (to address the people) in Medina.' When we reached Medina, 'Umar (in a Friday Khutba-sermon) said, \"No doubt, Allah sent Muhammad with the Truth and revealed to him the Book (Quran), and among what was revealed, was the Verse of Ar-Rajm (stoning adulterers to death).'\" (See Hadith No. 817,Vol. 8)","reference":"Sahih al-Bukhari 7323, Book 96, Hadith 53","grade":"","question #":"question #2","question":"How can the timing and location of delivering a message impact its reception and understanding?","id":"bukhari-96-156"},{"hadith-eng":"We were with Abu Huraira while he was wearing two linen garments dyed with red clay. He cleaned \nhis nose with his garment, saying, \"Bravo! Bravo! Abu Huraira is cleaning his nose with linen! There \ncame a time when I would fall senseless between the pulpit of Allah's Messenger (ﷺ) and `Aisha's dwelling \nwhereupon a passerby would come and put his foot on my neck, considering me a mad man, but in \nfact, I had no madness, I suffered nothing but hunger.\"","reference":"Sahih al-Bukhari 7324, Book 96, Hadith 54","grade":"","question #":"question #2","question":"How did Abu Huraira describe his experiences of poverty and hunger?","id":"bukhari-96-157"},{"hadith-eng":"Ibn `Abbas was asked, \"Did you offer the Id prayer with the Prophet?\" He said, \"Yes, had it not been \nfor my close relation to the Prophet, I would not have performed it (with him) because of my being \ntoo young The Prophet (ﷺ) came to the mark which is near the home of Kathir bin As-Salt and offered the \nId prayer and then delivered the sermon. I do not remember if any Adhan or Iqama were pronounced \nfor the prayer. Then the Prophet (ﷺ) ordered (the women) to give alms, and they started stretching out \ntheir hands towards their ears and throats (giving their ornaments in charity), and the Prophet (ﷺ) ordered \nBilal to go to them (to collect the alms), and then Bilal returned to the Prophet.","reference":"Sahih al-Bukhari 7325, Book 96, Hadith 55","grade":"","question #":"question #2","question":"How did the Prophet encourage charity among women during the Id prayer?","id":"bukhari-96-158"},{"hadith-eng":"The Prophet (ﷺ) used to go to the Quba' mosque, sometimes walking, sometimes riding.","reference":"Sahih al-Bukhari 7326, Book 96, Hadith 56","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate flexibility in his mode of travel to the mosque?","id":"bukhari-96-159"},{"hadith-eng":"`Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the \nProphet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as \nsanctified (just for being buried there).'' \nNarrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried \nwith my two companions (the Prophet (ﷺ) and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her \nhabit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to \nallow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to \nbe buried with them.\"","reference":"Sahih al-Bukhari 7327, 7328, Book 96, Hadith 57","grade":"","question #":"question #2","question":"How did Aisha respond to requests from companions of the Prophet regarding burial in the Prophet's house?","id":"bukhari-96-160"},{"hadith-eng":"`Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the \nProphet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as \nsanctified (just for being buried there).'' \nNarrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried \nwith my two companions (the Prophet (ﷺ) and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her \nhabit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to \nallow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to \nbe buried with them.\"","reference":"Sahih al-Bukhari 7327, 7328, Book 96, Hadith 57","grade":"","question #":"question #2","question":"How did Aisha respond to Umar's request to be buried with the Prophet and Abu Bakr?","id":"bukhari-96-161"},{"hadith-eng":"Allah's Messenger (ﷺ) used to perform the `Asr prayer and then one could reach the `Awali (a place in the \noutskirts of Medina) while the sun was still quite high. \nNarrated Yunus: The distance of the `Awali (from Medina) was four or three miles.","reference":"Sahih al-Bukhari 7329, Book 96, Hadith 58","grade":"","question #":"question #2","question":"How does the geographical location of `Awali relate to the timing of prayers in Medina?","id":"bukhari-96-162"},{"hadith-eng":"The Sa' (a kind of measure) during the lifetime of the Prophet (ﷺ) used to be equal to the one Mudd \n(another kind of measure) and one third of a Mudd which we use today, but the Sa' of today has \nbecome large.","reference":"Sahih al-Bukhari 7330, Book 96, Hadith 59","grade":"","question #":"question #2","question":"What is the significance of understanding historical measures in Islamic tradition?","id":"bukhari-96-163"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, and bestow Your Blessings \non their Sa' and Mudd.\" He meant those of the people of Medina.","reference":"Sahih al-Bukhari 7331, Book 96, Hadith 60","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate care for the economic well-being of the people of Medina?","id":"bukhari-96-164"},{"hadith-eng":"The Jews brought a man and a woman who had committed illegal sexual intercourse, to the Prophet (ﷺ) \nand the Prophet (ﷺ) ordered them to be stoned to death, and they were stoned to death near the mosque \nwhere the biers used to be placed.","reference":"Sahih al-Bukhari 7332, Book 96, Hadith 61","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle cases brought to him by people of other faiths, such as the Jews?","id":"bukhari-96-165"},{"hadith-eng":"The Mountain of Uhud came in sight of Allah's Messenger (ﷺ) who then said, \"This is a mountain that loves \nus and is loved by us. O Allah! Abraham made Mecca a sanctuary and I make the area between its \n(Medina's) two mountains a sanctuary.\"","reference":"Sahih al-Bukhari 7333, Book 96, Hadith 62","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) express his affection for the Mountain of Uhud?","id":"bukhari-96-166"},{"hadith-eng":"The distance between the pulpit and the wall of the mosque on the side of the Qibla was just sufficient \nfor a sheep to pass through.","reference":"Sahih al-Bukhari 7334, Book 96, Hadith 63","grade":"","question #":"question #2","question":"How does the physical structure of the mosque relate to the practices and rituals performed within it?","id":"bukhari-96-167"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from one of the gardens of \nParadise, and my pulpit is over my Lake-Tank. (Kauthar);","reference":"Sahih al-Bukhari 7335, Book 96, Hadith 64","grade":"","question #":"question #2","question":"How is the concept of Paradise represented in the physical locations associated with the Prophet Muhammad?","id":"bukhari-96-168"},{"hadith-eng":"`Abdullah said, \"The Prophet (ﷺ) arranged for a horse race, and the prepared horses were given less food \nfor a few days before the race to win the race, and were allowed to run from Al-Hafya to Thaniyat-al- \nWada`, and the unprepared horses were allowed to run between Thaniyat-al-Wada` and the mosque of \nBani Zuraiq,\" `Abdullah was one of those who participated in the race.","reference":"Sahih al-Bukhari 7336, Book 96, Hadith 65","grade":"","question #":"question #2","question":"How were different categories of horses treated in terms of race distance in early Islamic competitions?","id":"bukhari-96-169"},{"hadith-eng":"I heard `Umar (delivering a sermon) on the pulpit of the Prophet.","reference":"Sahih al-Bukhari 7337, Book 96, Hadith 66","grade":"","question #":"question #2","question":"Who was known to deliver sermons from the Prophet's pulpit according to Islamic history?","id":"bukhari-96-170"},{"hadith-eng":"That he heard `Uthman bin `Affan delivering a sermon on the pulpit of the Prophet","reference":"Sahih al-Bukhari 7338, Book 96, Hadith 67","grade":"","question #":"question #2","question":"Who was Uthman bin Affan and what role did he play in early Islamic history?","id":"bukhari-96-171"},{"hadith-eng":"This big copper vessel used to be put for me and Allah's Messenger (ﷺ) and we would take water from it \ntogether (on taking a bath) .","reference":"Sahih al-Bukhari 7339, Book 96, Hadith 68","grade":"","question #":"question #2","question":"How does this narration reflect the domestic life and simplicity of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-172"},{"hadith-eng":"The Prophet (ﷺ) brought the Ansar and the Quarish people into alliance in my house at Medina, and he \ninvoked Allah for one month against the tribe of Bani Sulaim in (the last rak`a of each compulsory) \nprayer.","reference":"Sahih al-Bukhari 7340, 7341, Book 96, Hadith 69","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his support for the Ansar and the Quraysh?","id":"bukhari-96-173"},{"hadith-eng":"When I arrived at Medina, `Abdullah bin Salam met me and said to me, \"Accompany me to my house \nso that I may make you drink from a bowl from which Allah's Messenger (ﷺ) used to drink, and that you may \noffer prayer in the mosque in which the Prophet (ﷺ) used to pray.\" I accompanied him, and he made me \ndrink Sawiq and gave me dates to eat, and then I prayed in his mosque.","reference":"Sahih al-Bukhari 7342, Book 96, Hadith 70","grade":"","question #":"question #2","question":"How can sharing experiences related to the Prophet Muhammad (ﷺ) enhance one's spiritual connection?","id":"bukhari-96-174"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Someone came to me tonight from my Lord while I was in the 'Aqiq \n(valley), and said to me, \"Offer prayer in this blessed valley and say: 'Labbaik' for the (performance \nof) `Umra and Hajj.\"","reference":"Sahih al-Bukhari 7343, Book 96, Hadith 71","grade":"","question #":"question #2","question":"How does one prepare for the performance of Umra and Hajj according to Islamic teachings?","id":"bukhari-96-175"},{"hadith-eng":"Ibn `Umar said, \"The Prophet (ﷺ) fixed Qarn as the Miqat (for assuming the Ihram) for the people of \nNajd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar \nadded, \"I heard this from the Prophet, and I have been informed that the Prophet (ﷺ) said, 'The Miqat for \nthe Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim \ncountry.\"","reference":"Sahih al-Bukhari 7344, Book 96, Hadith 72","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) specify the Miqat for people traveling from Yemen?","id":"bukhari-96-176"},{"hadith-eng":"The Prophet (ﷺ) had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n \nthe dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).","reference":"Sahih al-Bukhari 7345, Book 96, Hadith 73","grade":"","question #":"question #2","question":"What is the importance of specific locations, such as valleys, in Islamic history and spirituality?","id":"bukhari-96-177"},{"hadith-eng":"That he heard the Prophet, after raising his head from the bowing in morning prayer, saying, \"O Allah, \nour Lord! All the praises are for you.\" And in the last (rak`a) he said, \"O Allah! Curse so-and-so and \nso--and-so.\" And then Allah revealed:-- 'Not for you (O Muhammad) is the decision, (but for Allah), \nwhether He turns in mercy to them or punish them, for they are indeed wrongdoers.' (3.128)","reference":"Sahih al-Bukhari 7346, Book 96, Hadith 74","grade":"","question #":"question #2","question":"How does the concept of divine decision-making manifest in Islamic belief?","id":"bukhari-96-178"},{"hadith-eng":"That Allah's Messenger (ﷺ) came to him and Fatima the daughter of Allah's Messenger (ﷺ) at their house at night \nand said, \"Won't you pray?\" `Ali replied, \"O Allah's Messenger (ﷺ)! Our souls are in the Hands of Allah and \nwhen he wants us to get up, He makes us get up.\" When `Ali said that to him, Allah's Messenger (ﷺ) left \nwithout saying anything to him. While the Prophet (ﷺ) was leaving, `Ali heard him striking his thigh (with \nhis hand) and saying, \"But man is quarrelsome more than anything else.\" (18.54)","reference":"Sahih al-Bukhari 7347, Book 96, Hadith 75","grade":"","question #":"question #2","question":"How does this interaction between the Prophet and Ali reflect on the concept of personal responsibility in Islam?","id":"bukhari-96-179"},{"hadith-eng":"While we were in the mosque, Allah's Messenger (ﷺ) came out and said, \"Let us proceed to the Jews.\" So we \nwent out with him till we came to Bait-al-Midras. The Prophet (ﷺ) stood up there and called them, saying, \n\"O assembly of Jews! Surrender to Allah (embrace Islam) and you will be safe!\" They said, \"You \nhave conveyed Allah's message, O Aba-al-Qasim\" Allah's Messenger (ﷺ) then said to them, \"That is what I \nwant; embrace Islam and you will be safe.\" They said, \"You have conveyed the message, O Aba-al- \nQasim.\" Allah's Messenger (ﷺ) then said to them, \"That is what I want,\" and repeated his words for the third \ntime and added, \"Know that the earth is for Allah and I want to exile you from this land, so whoever \namong you has property he should sell it, otherwise, know that the land is for Allah and His Apostle.\"","reference":"Sahih al-Bukhari 7348, Book 96, Hadith 76","grade":"","question #":"question #2","question":"How did the Prophet Muhammad address the Jewish community regarding their safety and property?","id":"bukhari-96-180"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be \nasked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation \nwill be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to \nus.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) \nMuhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" \nThen the Prophet (ﷺ) recited: 'And thus We have made of you (Muslims) a just and the best nation, that \nyou might be witness over the nations, and the Apostle a witness over you.' (2.143)","reference":"Sahih al-Bukhari 7349, Book 96, Hadith 77","grade":"","question #":"question #2","question":"How does the concept of bearing witness relate to the responsibility of conveying Allah's message?","id":"bukhari-96-181"},{"hadith-eng":"Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the \nman returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of \nKhaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) \ndates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take \none Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind \n(of dates), and you should do the same in weighing.\"","reference":"Sahih al-Bukhari 7350, 7351, Book 96, Hadith 78","grade":"","question #":"question #2","question":"How should one conduct transactions to ensure fairness and avoid exploitation in trade?","id":"bukhari-96-182"},{"hadith-eng":"Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the \nman returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of \nKhaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) \ndates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take \none Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind \n(of dates), and you should do the same in weighing.\"","reference":"Sahih al-Bukhari 7350, 7351, Book 96, Hadith 78","grade":"","question #":"question #2","question":"How should one conduct transactions involving different types of dates according to Islamic teachings?","id":"bukhari-96-183"},{"hadith-eng":"That he heard Allah's Messenger (ﷺ) saying, \"If a judge gives a verdict according to the best of his \nknowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a \ndouble reward, and if he gives a verdict according to the best of his knowledge and his verdict is \nwrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"","reference":"Sahih al-Bukhari 7352, Book 96, Hadith 79","grade":"","question #":"question #2","question":"How is a judge rewarded if his verdict is incorrect despite his best efforts in Islamic jurisprudence?","id":"bukhari-96-184"},{"hadith-eng":"Abu Musa asked permission to enter upon `Umar, but seeing that he was busy, he went away. `Umar \nthen said, \"Didn't I hear the voice of `Abdullah bin Qais? Allow him to come in.\" He was called in and \n`Umar said to him, \"What made you do what you did.\" He replied, \"We have been instructed thus by \nthe Prophet\" `Umar said, \"Bring proof (witness) for this, other wise I will do so-and-so to you.\" Then \n`Abdullah bin Qais went to a gathering of the Ansar who then said, \"None but the youngest of us will \ngive the witness for it.\" So Abu Sa`id Al-Khudri got up and said, \"We used to be instructed thus (by \nthe Prophet).\" `Umar said, \"This tradition of the Prophet (ﷺ) remained hidden from me. Business in the \nmarket kept me busy.\"","reference":"Sahih al-Bukhari 7353, Book 96, Hadith 80","grade":"","question #":"question #2","question":"How can being occupied with worldly matters affect one's knowledge of religious teachings?","id":"bukhari-96-185"},{"hadith-eng":"Abu Huraira said, \"You people claim that Abu Huraira narrates many narrations of Allah's Messenger (ﷺ). \n(Anyhow) with Allah will be our appointment. I was a poor man, and used to stick to Allah's Messenger (ﷺ) \ncontented with what will fill my stomach, and the Muhajirin (emigrants) used to be busy trading in the \nmarkets, and the Ansar used to be busy looking after their properties. One-day I heard Allah's Messenger (ﷺ) \nsaying, 'Who will spread his Rida' (a garment covering the upper part of the body) till I finished my \nspeech and then fold it, (i.e. wrap it over your body), in which case he will never forget anything he \nhad heard from me.\" So I spread my garment which I was wearing; and by Him Who sent Muhammad \nwith the Truth, ever since, I have never forgotten whatever I heard from him (the Prophet)\" (See, \nHadith No. 119, Vol. 1)","reference":"Sahih al-Bukhari 7354, Book 96, Hadith 81","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) ensure that his teachings were remembered by his companions?","id":"bukhari-96-186"},{"hadith-eng":"I saw Jabir bin `Abdullah swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can \nyou swear by Allah?\" Jabir said, \"I have heard `Umar swearing by Allah regarding this matter in the \npresence of the Prophet (ﷺ) and the Prophet (ﷺ) did not disapprove of it.\"","reference":"Sahih al-Bukhari 7355, Book 96, Hadith 82","grade":"","question #":"question #2","question":"How does the approval or disapproval of the Prophet (ﷺ) influence the understanding of a situation?","id":"bukhari-96-187"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Horses may be used for three purposes: For a man they may be a source of \nreward (in the Hereafter); for another, a means of protection; and for another, a source of sin. The man \nfor whom they are a source of reward, is the one who keeps them for Allah's Cause and ties them with \nlong ropes and lets them graze in a pasture or garden. Whatever those long ropes allow them to eat of \nthat pasture or garden, will be written as good deeds for him and if they break their ropes and run one \nor two rounds, then all their footsteps and dung will be written as good deeds for him, and if they pass \na river and drink from it though he has had no intention of watering them, even then, that will be \nwritten as good deeds for him. So such horses are a source of reward for that man. For the man who \nkeeps horses for his livelihood in order not to ask others for help or beg his bread, and at the same \ntime he does not forget Allah's right of what he earns through them and of their backs (that he presents \nit to be used in Allah's Cause), such horses are a shelter for him (from poverty). For the man who \nkeeps them just out of pride and for showing off, they are a source of sin.\" Then Allah's Messenger (ﷺ) was \nasked about donkeys. He said, \"Allah has not revealed anything to me regarding them except this \ncomprehensive Verse: \n\"Then anyone who has done good, equal to the weight of an atom (or a small ant) shall see it, and any \none who has done evil, equal to the weight of an atom (or a small ant) shall see it.\" (99.7-8)","reference":"Sahih al-Bukhari 7356, Book 96, Hadith 83","grade":"","question #":"question #2","question":"How can keeping horses become a source of reward or sin for a person?","id":"bukhari-96-188"},{"hadith-eng":"A woman asked the Prophet (Hadith 456).Narrated `Aisha:A woman asked the Prophet (ﷺ) about the periods: How to take a bath after the periods. He said, \"Take a \nperfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself\" She said again, \"How shall I clean myself, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself with it.\" Then I knew what Allah's Messenger (ﷺ) \nmeant. So I pulled her aside and explained it to her.","reference":"Sahih al-Bukhari 7357, Book 96, Hadith 84","grade":"","question #":"question #2","question":"How did Aisha assist in clarifying the Prophet's instructions to the woman?","id":"bukhari-96-189"},{"hadith-eng":"Um Hufaid bint Al-Harith bin Hazn presented the Prophet (ﷺ) with some butter, dried yoghurt (curd milk) \nand mastigures as a gift. The Prophet (ﷺ) then asked for a meal (mastigures etc. to be put) and it was eaten \nover his table cloth, but the Prophet (ﷺ) did not eat of it, as he had aversion to it. But if it had been illegal \nto eat, it would not have been eaten over his table cloth nor would he have ordered that (mastigures \nmeat) to be eaten.","reference":"Sahih al-Bukhari 7358, Book 96, Hadith 85","grade":"","question #":"question #2","question":"How does the Prophet's personal preference influence the dietary practices of his followers?","id":"bukhari-96-190"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep \naway from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked \nvegetables was brought to the Prophet (ﷺ) at Badr. Detecting a bad smell from it, he asked about the dish \nand was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was \nbrought near to one of his companions who was with him. When the Prophet (ﷺ) saw it, he disliked \neating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\"","reference":"Sahih al-Bukhari 7359, Book 96, Hadith 86","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate consideration for others in communal settings?","id":"bukhari-96-191"},{"hadith-eng":"A lady came to Allah's Messenger (ﷺ) and she talked to him about something, and he gave her some order. \nShe said, \"O Allah's Messenger (ﷺ)! If I should not find you?\" He said, \"If you should not find me, then go to \nAbu Bakr.\" Ibrahim bin Sa`d said, \"As if she meant the death (of the Prophet).","reference":"Sahih al-Bukhari 7360, Book 96, Hadith 87","grade":"","question #":"question #2","question":"What does this narration suggest about the succession after the Prophet Muhammad (ﷺ)?","id":"bukhari-96-192"},{"hadith-eng":"Narrated Humaid bin 'Abdur-Rahman that he heard Mu'awiya talking to a group of people from Quraish at Al-Madina, and on mentioning Ka'b Al-Ashbar, he said, \"He was one of the most truthful of those who used to talk about the people of the Scripture, yet we used to detect certain faults in his information.\"","reference":"Sahih al-Bukhari 7361, Book 96, Hadith 88","grade":"","question #":"question #2","question":"How can one assess the reliability of narrators when discussing historical or religious texts?","id":"bukhari-96-193"},{"hadith-eng":"The people of the Book used to read the Torah in Hebrew and then explain it in Arabic to the \nMuslims. Allah's Messenger (ﷺ) said (to the Muslims). \"Do not believe the people of the Book, nor \ndisbelieve them, but say, 'We believe in Allah and whatever is revealed to us, and whatever is \nrevealed to you.' \"","reference":"Sahih al-Bukhari 7362, Book 96, Hadith 89","grade":"","question #":"question #2","question":"What is the recommended attitude towards the scriptures of other faiths in Islam?","id":"bukhari-96-194"},{"hadith-eng":"Ibn `Abbas said, \"Why do you ask the people of the scripture about anything while your Book \n(Qur'an) which has been revealed to Allah's Messenger (ﷺ) is newer and the latest? You read it pure, \nundistorted and unchanged, and Allah has told you that the people of the scripture (Jews and \nChristians) changed their scripture and distorted it, and wrote the scripture with their own hands and \nsaid, 'It is from Allah,' to sell it for a little gain. Does not the knowledge which has come to you \nprevent you from asking them about anything? No, by Allah, we have never seen any man from them \nasking you regarding what has been revealed to you!\"","reference":"Sahih al-Bukhari 7363, Book 96, Hadith 90","grade":"","question #":"question #2","question":"Why is it important to be cautious about the authenticity of scriptures from other religious traditions?","id":"bukhari-96-195"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as you are in agreement as to its \ninterpretation and meanings, but when you have differences regarding its interpretation and meanings, \nthen you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)","reference":"Sahih al-Bukhari 7364, Book 96, Hadith 91","grade":"","question #":"question #2","question":"How important is consensus in understanding the Qur'an according to Islamic teachings?","id":"bukhari-96-196"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as your hearts are in agreement as to its \nmeanings, but if you have differences as regards its meaning, stop reading it then.\"","reference":"Sahih al-Bukhari 7365, Book 96, Hadith 92","grade":"","question #":"question #2","question":"How important is it to have a unified understanding of the Qur'an among believers?","id":"bukhari-96-197"},{"hadith-eng":"When the time of the death of the Prophet (ﷺ) approached while there were some men in the house, and \namong them was `Umar bin Al-Khatttab, the Prophet (ﷺ) said, \"Come near let me write for you a writing \nafter which you will never go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill, and you have the \nQur'an, so Allah's Book is sufficient for us.\" The people in the house differed and disputed. Some of \nthem said, \"Come near so that Allah's Messenger (ﷺ) may write for you a writing after which you will not go \nastray,\" while some of them said what `Umar said. When they made much noise and differed greatly \nbefore the Prophet, he said to them, \"Go away and leave me.\" Ibn `Abbas used to say, \"It was a great \ndisaster that their difference and noise prevented Allah's Messenger (ﷺ) from writing that writing for them.","reference":"Sahih al-Bukhari 7366, Book 96, Hadith 93","grade":"","question #":"question #2","question":"How did the companions react to the Prophet's request to write a guidance for them?","id":"bukhari-96-198"},{"hadith-eng":"I heard Jabir bin `Abdullah in a gathering saying, \"We, the companions of Allah's Messenger (ﷺ) assumed \nthe state of Ihram to perform only Hajj without `Umra.\" Jabir added, \"The Prophet (ﷺ) arrived (at Mecca) \non the fourth of Dhul-Hijja. And when we arrived (in Mecca) the Prophet (ﷺ) ordered us to finish the state \nof Ihram, saying, \"Finish your lhram and go to your wives (for sexual relation).\" Jabir added, \"The \nProphet did not oblige us (to go to our wives) but he only made that legal for us. Then he heard that \nwe were saying, \"When there remains only five days between us and the Day of `Arafat he orders us \nto finish our Ihram by sleeping with our wives in which case we will proceed to `Arafat with our male \norgans dribbling with semen?' (Jabir pointed out with his hand illustrating what he was saying). \nAllah's Messenger (ﷺ) stood up and said, 'You (People) know that I am the most Allah-fearing, the most \ntruthful and the best doer of good deeds (pious) from among you. If I had not brought the Hadi with \nme, I would have finished my Ihram as you will do, so finish your Ihram. If I had formerly known \nwhat I came to know lately, I would not have brought the Hadi with me.' So we finished our Ihram \nand listened to the Prophet (ﷺ) and obeyed him.\" (See Hadith No. 713, Vol. 2)","reference":"Sahih al-Bukhari 7367, Book 96, Hadith 94","grade":"","question #":"question #2","question":"How does the Prophet demonstrate his piety and truthfulness in the context of Hajj rituals?","id":"bukhari-96-199"},{"hadith-eng":"The Prophet (ﷺ) said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and \nthe third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna \n(tradition). (See Hadith No. 277, Vol. 2)","reference":"Sahih al-Bukhari 7368, Book 96, Hadith 95","grade":"","question #":"question #2","question":"Why did the Prophet emphasize the optional prayer before Maghrib three times?","id":"bukhari-96-200"},{"hadith-eng":"After the slanderers had given a forged statement against her, Allah's Messenger (ﷺ) called `Ali bin Abi Talib \nand Usama bin Zaid when the Divine Inspiration was delayed. He wanted to ask them and consult \nthem about the question of divorcing me. Usama gave his evidence that was based on what he knew \nabout my innocence, but `Ali said, \"Allah has not put restrictions on you and there are many women \nother than her. Furthermore you may ask the slave girl who will tell you the truth.\" So the Prophet (ﷺ) \nasked Barira (my salve girl), \"Have you seen anything that may arouse your suspicion?\" She replied, \n\"I have not seen anything more than that she is a little girl who sleeps, leaving the dough of her family \n(unguarded) that the domestic goats come and eat it.\" Then the Prophet (ﷺ) stood on the pulpit and said, \n\"O Muslims! Who will help me against the man who has harmed me by slandering my wife? By \nAllah, I know nothing about my family except good.\" The narrator added: Then the Prophet (ﷺ) \nmentioned the innocence of `Aisha. (See Hadith No. 274, Vol. 6)","reference":"Sahih al-Bukhari 7369, Book 96, Hadith 96","grade":"","question #":"question #2","question":"How should one respond to false accusations and slander in Islam?","id":"bukhari-96-201"},{"hadith-eng":"Allah's Messenger (ﷺ) addressed the people, and after praising and glorifying Allah, he said, \"What do you \nsuggest me regarding those people who are abusing my wife? I have never known anything bad about \nher.\" The sub-narrator, `Urwa, said: When `Aisha was told of the slander, she said, \"O Allah's \nApostle! Will you allow me to go to my parents' home?\" He allowed her and sent a slave along with \nher. An Ansari man said, \"Subhanaka! It is not right for us to speak about this. Subhanaka! This is a \ngreat lie!\"","reference":"Sahih al-Bukhari 7370, Book 96, Hadith 97","grade":"","question #":"question #2","question":"What is the significance of seeking advice and counsel when faced with personal challenges?","id":"bukhari-96-202"},{"hadith-eng":"A Jew said to `Umar, \"O Chief of the Believers, if this verse: 'This day I have perfected your religion \nfor you, completed My favors upon you, and have chosen for you, Islam as your religion.' (5.3) had \nbeen revealed upon us, we would have taken that day as an `Id (festival) day.\" `Umar said, \"I know \ndefinitely on what day this Verse was revealed; it was revealed on the day of `Arafat, on a Friday.\"","reference":"Sahih al-Bukhari 7268, Book 96, Hadith 1","grade":"","question #":"question #3","question":"What is the importance of the day of 'Arafat in Islamic tradition?","id":"bukhari-96-203"},{"hadith-eng":"That he heard `Umar speaking while standing on the pulpit of the Prophet (ﷺ) in the morning (following \nthe death of the Prophet), when the people had sworn allegiance to Abu Bakr. He said the Tashah-hud \nbefore Abu Bakr, and said, \"Amma Ba'du (then after) Allah has chosen for his Apostle what is with \nHim (Paradise) rather than what is with you (the world). This is that Book (Qur'an) with which Allah \nguided your Apostle, so stick to it, for then you will be guided on the right path as Allah guided His \nApostle with it.\"","reference":"Sahih al-Bukhari 7269, Book 96, Hadith 2","grade":"","question #":"question #3","question":"What role does the Tashah-hud play in Islamic practices and speeches?","id":"bukhari-96-204"},{"hadith-eng":"The Prophet (ﷺ) embraced me and said, \"O Allah! Teach him (the knowledge of) the Book (Qur'an).\"","reference":"Sahih al-Bukhari 7270, Book 96, Hadith 3","grade":"","question #":"question #3","question":"What can be inferred about the importance of the Qur'an in Islamic education from the Prophet's prayer for Ibn `Abbas?","id":"bukhari-96-205"},{"hadith-eng":"Abu Barza said, \"(O people!) Allah makes you self-sufficient or has raised you high with Islam and \nwith Muhammad.\"","reference":"Sahih al-Bukhari 7271, Book 96, Hadith 4","grade":"","question #":"question #3","question":"In what ways does embracing Islam impact a person's status and self-reliance?","id":"bukhari-96-206"},{"hadith-eng":"`Abdullah Bin `Umar wrote to `Abdul Malik bin Marwan, swearing allegiance to him: 'I swear \nallegiance to you in that I will listen and obey what is in accordance with the Laws of Allah and the \nTradition of His Apostle as much as I can.'","reference":"Sahih al-Bukhari 7272, Book 96, Hadith 5","grade":"","question #":"question #3","question":"What are the responsibilities of a Muslim when pledging allegiance to a leader in the context of Islamic teachings?","id":"bukhari-96-207"},{"hadith-eng":"Abu Huraira said that Allah's Messenger (ﷺ) said, \"I have been sent with 'Jawami-al-Kalim ' (the shortest \nexpression with the widest meaning) and have been made victorious with awe (cast in my enemy's \nhearts), and while I was sleeping, I saw that the keys of the treasures of the world were placed in my \nhand.\" Abu Huraira added: Allah's Messenger (ﷺ) has gone, and you people are utilizing those treasures, or \ndigging those treasures out.\" or said a similar sentence.","reference":"Sahih al-Bukhari 7273, Book 96, Hadith 6","grade":"","question #":"question #3","question":"What is the significance of the vision of the keys of the treasures of the world in Islamic teachings?","id":"bukhari-96-208"},{"hadith-eng":"The Prophet (ﷺ) said, \"There was no prophet among the prophets but was given miracles because of \nwhich people had security or had belief, but what I was given was the Divine Inspiration which Allah \nrevealed to me. So I hope that my followers will be more than those of any other prophet on the Day \nof Resurrection.\"","reference":"Sahih al-Bukhari 7274, Book 96, Hadith 7","grade":"","question #":"question #3","question":"Why does Prophet Muhammad hope that his followers will be more numerous than those of other prophets on the Day of Resurrection?","id":"bukhari-96-209"},{"hadith-eng":"I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar once sat beside me here \nas you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the \nKa`ba) among the Muslims'. I said, 'You cannot do that.' `Umar said, 'Why?' I said, 'Your two \n(previous) companions (the Prophet (ﷺ) and Abu Bakr) did not do it. `Umar said, 'They are the two \npersons whom one must follow.'\" (See Hadith No. 664, Vol. 2)","reference":"Sahih al-Bukhari 7275, Book 96, Hadith 8","grade":"","question #":"question #3","question":"What role does the Ka'ba play in the economic and spiritual life of Muslims according to Islamic teachings?","id":"bukhari-96-210"},{"hadith-eng":"Allah's Messenger (ﷺ) said to us, \"Honesty descended from the Heavens and settled in the roots of the hearts \nof men (faithful believers), and then the Qur'an was revealed and the people read the Qur'an, (and \nlearnt it from it) and also learnt it from the Sunna.\" Both Qur'an and Sunna strengthened their (the \nfaithful believers') honesty. (See Hadith No. 208)","reference":"Sahih al-Bukhari 7276, Book 96, Hadith 9","grade":"","question #":"question #3","question":"How is the concept of honesty described as descending from the heavens in Islamic tradition?","id":"bukhari-96-211"},{"hadith-eng":"The best talk (speech) is Allah's Book 'Qur'an), and the best way is the way of Muhammad, and the \nworst matters are the heresies (those new things which are introduced into the religion); and whatever \nyou have been promised will surely come to pass, and you cannot escape (it).","reference":"Sahih al-Bukhari 7277, Book 96, Hadith 10","grade":"","question #":"question #3","question":"What are the implications of introducing new practices into the religion according to Islamic teachings?","id":"bukhari-96-212"},{"hadith-eng":"We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's \nBook (Laws).\"","reference":"Sahih al-Bukhari 7278, 7279, Book 96, Hadith 11","grade":"","question #":"question #3","question":"What role do companions play in the context of the Prophet's judgments and teachings?","id":"bukhari-96-213"},{"hadith-eng":"We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's \nBook (Laws).\"","reference":"Sahih al-Bukhari 7278, 7279, Book 96, Hadith 11","grade":"","question #":"question #3","question":"How does the role of a judge in Islam relate to the application of Allah's laws?","id":"bukhari-96-214"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"All my followers will enter Paradise except those who refuse.\" They said, \"O \nAllah's Messenger (ﷺ)! Who will refuse?\" He said, \"Whoever obeys me will enter Paradise, and whoever \ndisobeys me is the one who refuses (to enter it).\"","reference":"Sahih al-Bukhari 7280, Book 96, Hadith 12","grade":"","question #":"question #3","question":"What are the consequences of refusing to follow the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-215"},{"hadith-eng":"Some angels came to the Prophet (ﷺ) while he was sleeping. Some of them said, \"He is sleeping.\" Others \nsaid, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this \ncompanion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He \nis sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His \nexample is that of a man who has built a house and then offered therein a banquet and sent an inviter \n(messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house \nand ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the \nhouse, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he \nmay understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but \nhis heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is \nMuhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, \ndisobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished \nfrom the bad, and the believers from the disbelievers).","reference":"Sahih al-Bukhari 7281, Book 96, Hadith 13","grade":"","question #":"question #3","question":"What role does the Prophet Muhammad play in distinguishing between believers and disbelievers according to Islamic belief?","id":"bukhari-96-216"},{"hadith-eng":"Hudhaifa said, \"O the Group of Al-Qurra! Follow the straight path, for then you have taken a great \nlead (and will be the leaders), but if you divert right or left, then you will go astray far away.\"","reference":"Sahih al-Bukhari 7282, Book 96, Hadith 14","grade":"","question #":"question #3","question":"How can one ensure they are leading others correctly in their religious practices?","id":"bukhari-96-217"},{"hadith-eng":"The Prophet (ﷺ) said, \"My example and the example of what I have been sent with is that of a man who \ncame to some people and said, 'O people! I have seen the enemy's army with my own eyes, and I am \nthe naked warner; so protect yourselves!' Then a group of his people obeyed him and fled at night \nproceeding stealthily till they were safe, while another group of them disbelieved him and stayed at \ntheir places till morning when the army came upon them, and killed and ruined them completely So \nthis is the example of that person who obeys me and follows what I have brought (the Qur'an and the \nSunna), and the example of the one who disobeys me and disbelieves the truth I have brought.\"","reference":"Sahih al-Bukhari 7283, Book 96, Hadith 15","grade":"","question #":"question #3","question":"What are the consequences of ignoring prophetic guidance according to Islamic teachings?","id":"bukhari-96-218"},{"hadith-eng":"When Allah's Messenger (ﷺ) died and Abu Bakr was elected as a Caliph after him, some of the Arabs \nreverted to disbelief, `Umar said to Abu Bakr, \"How dare you fight the people while Allah's Messenger (ﷺ) \nsaid, I have been ordered to fight the people till they say 'None has the right to be worshipped but \nAllah' And whoever says: None has the right to be worshipped but Allah.' waves his wealth and his \nlife from me unless he deserves a legal punishment lusty, and his account will be with Allah! Abu \nBakr said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the \nCompulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope \nwhich they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar said, 'By \nAllah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr to the fight, and I \ncame to know for certain that was the truth.\"","reference":"Sahih al-Bukhari 7284, 7285, Book 96, Hadith 16","grade":"","question #":"question #3","question":"What does this narration indicate about the significance of Zakat in early Islamic governance?","id":"bukhari-96-219"},{"hadith-eng":"When Allah's Messenger (ﷺ) died and Abu Bakr was elected as a Caliph after him, some of the Arabs \nreverted to disbelief, `Umar said to Abu Bakr, \"How dare you fight the people while Allah's Messenger (ﷺ) \nsaid, I have been ordered to fight the people till they say 'None has the right to be worshipped but \nAllah' And whoever says: None has the right to be worshipped but Allah.' waves his wealth and his \nlife from me unless he deserves a legal punishment lusty, and his account will be with Allah! Abu \nBakr said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the \nCompulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope \nwhich they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar said, 'By \nAllah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr to the fight, and I \ncame to know for certain that was the truth.\"","reference":"Sahih al-Bukhari 7284, 7285, Book 96, Hadith 16","grade":"","question #":"question #3","question":"What is the significance of Zakat in Islam as demonstrated by the actions of Abu Bakr after the Prophet's death?","id":"bukhari-96-220"},{"hadith-eng":"Uyaina bin Hisn bin Hudhaifa bin Badr came and stayed (at Medina) with his nephew Al-Hurr bin \nQais bin Hisn who was one of those whom `Umar used to keep near him, as the Qurra' (learned men \nknowing Qur'an by heart) were the people of `Umar's meetings and his advisors whether they were old \nor young. 'Uyaina said to his nephew, \"O my nephew! Have you an approach to this chief so as to get \nfor me the permission to see him?\" His nephew said, \"I will get the permission for you to see him.\" \n(Ibn `Abbas added: ) So he took the permission for 'Uyaina, and when the latter entered, he said, \"O \nthe son of Al-Khattab! By Allah, you neither give us sufficient provision nor judge among us with \njustice.\" On that `Umar became so furious that he intended to harm him. Al-Hurr, said, \"O Chief of \nthe Believers!\" Allah said to His Apostle 'Hold to forgiveness, command what is good (right), and \nleave the foolish (i.e. do not punish them).' (7.199) and this person is among the foolish.\" By Allah, \n`Umar did not overlook that Verse when Al-Hurr recited it before him, and `Umar said to observe (the \norders of) Allah's Book strictly.\" (See Hadith No. 166, Vol. 6)","reference":"Sahih al-Bukhari 7286, Book 96, Hadith 17","grade":"","question #":"question #3","question":"What role does the Quran play in guiding the actions and decisions of a leader in Islam?","id":"bukhari-96-221"},{"hadith-eng":"I came to `Aisha during the solar eclipse. The people were standing (offering prayer) and she too, was \nstanding and offering prayer. I asked, \"What is wrong with the people?\" She pointed towards the sky \nwith her hand and said, Subhan Allah!'' I asked her, \"Is there a sign?\" She nodded with her head \nmeaning, yes. When Allah's Messenger (ﷺ) finished (the prayer), he glorified and praised Allah and said, \n\"There is not anything that I have not seen before but I have seen now at this place of mine, even \nParadise and Hell. It has been revealed to me that you people will be put to trial nearly like the trial of \nAd-Dajjal, in your graves. As for the true believer or a Muslim (the sub-narrator is not sure as to \nwhich of the two (words Asma' had said) he will say, 'Muhammad came with clear signs from Allah, \nand we responded to him (accepted his teachings) and believed (what he said)' It will be said (to him) \n'Sleep in peace; we have known that you were a true believer who believed with certainty.' As for a \nhypocrite or a doubtful person, (the sub-narrator is not sure as to which word Asma' said) he will say, \n'I do not know, but I heard the people saying something and so I said the same.' \"","reference":"Sahih al-Bukhari 7287, Book 96, Hadith 18","grade":"","question #":"question #3","question":"What is the importance of having certainty in faith according to Islamic teachings?","id":"bukhari-96-222"},{"hadith-eng":"The Prophet (ﷺ) said, \"Leave me as I leave you, for the people who were before you were ruined because \nof their questions and their differences over their prophets. So, if I forbid you to do something, then \nkeep away from it. And if I order you to do something, then do of it as much as you can.\"","reference":"Sahih al-Bukhari 7288, Book 96, Hadith 19","grade":"","question #":"question #3","question":"What is the significance of doing as much as one can when following religious obligations in Islam?","id":"bukhari-96-223"},{"hadith-eng":"The Prophet (ﷺ) said, \"The most sinful person among the Muslims is the one who asked about something \nwhich had not been prohibited, but was prohibited because of his asking.\"","reference":"Sahih al-Bukhari 7289, Book 96, Hadith 20","grade":"","question #":"question #3","question":"What is the significance of being cautious about inquiries in religious matters?","id":"bukhari-96-224"},{"hadith-eng":"The Prophet (ﷺ) took a room made of date palm leaves mats in the mosque. Allah's Messenger (ﷺ) prayed in it \nfor a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the \n4th night the people did not hear his voice and they thought he had slept, so some of them started \nhumming in order that he might come out. The Prophet (ﷺ) then said, \"You continued doing what I saw \nyou doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined \non you, you would not continue performing it. Therefore, O people! Perform your prayers at your \nhomes, for the best prayer of a person is what is performed at his home except the compulsory \ncongregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)","reference":"Sahih al-Bukhari 7290, Book 96, Hadith 21","grade":"","question #":"question #3","question":"How does the practice of praying at home relate to the concept of voluntary and obligatory prayers in Islam?","id":"bukhari-96-225"},{"hadith-eng":"Allah's Messenger (ﷺ) was asked about things which he disliked, and when the people asked too many \nquestions, he became angry and said, \"Ask me (any question).\" A man got up and said, \"O Allah's \nApostle! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then another man got up \nand said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) said, \"Your father is Salim, Maula \nShaiba.\" When `Umar saw the signs of anger on the face of Allah's Messenger (ﷺ), he said, \"We repent to \nAllah.\"","reference":"Sahih al-Bukhari 7291, Book 96, Hadith 22","grade":"","question #":"question #3","question":"What can be learned from Umar's reaction to the Prophet's (ﷺ) anger in this situation?","id":"bukhari-96-226"},{"hadith-eng":"(The clerk of Al-Mughira) Muawiya wrote to Al-Mughira 'Write to me what you have heard from \nAllah's Messenger (ﷺ).' So he (Al-Mughira) wrote to him: Allah's Prophet used to say at the end of each \nprayer: \"La ilaha illalla-h wahdahu la sharika lahu, lahul Mulku, wa lahul Hamdu wa hula ala kulli \nshai'in qadir. 'Allahumma la mani' a lima a'taita, wala mu'tiya lima mana'ta, wala yanfa'u dhuljadd \nminkal-jadd.\" He also wrote to him that the Prophet (ﷺ) used to forbid (1) Qil and Qal (idle useless talk or \nthat you talk too much about others), (2) Asking too many questions (in disputed Religious matters); \n(3) And wasting one's wealth by extravagance; (4) and to be undutiful to one's mother (5) and to bury \nthe daughters alive (6) and to prevent your favors (benevolence to others (i.e. not to pay the rights of \nothers (7) And asking others for something (except when it is unavoidable).","reference":"Sahih al-Bukhari 7292, Book 96, Hadith 23","grade":"","question #":"question #3","question":"Why is it important to avoid idle talk and excessive questioning in religious matters?","id":"bukhari-96-227"},{"hadith-eng":"We were with `Umar and he said, \"We have been forbidden to undertake a difficult task beyond our \ncapability (i.e. to exceed the religious limits e.g., to clean the inside of the eyes while doing ablution).","reference":"Sahih al-Bukhari 7293, Book 96, Hadith 24","grade":"","question #":"question #3","question":"How does Islam guide individuals in balancing religious duties with personal capabilities?","id":"bukhari-96-228"},{"hadith-eng":"The Prophet (ﷺ) came out after the sun had declined and offered the Zuhr prayer (in congregation). After \nfinishing it with Taslim, he stood on the pulpit and mentioned the Hour and mentioned there would \nhappen great events before it. Then he said, \"Whoever wants to ask me any question, may do so, for \nby Allah, you will not ask me about anything but I will inform you of its answer as long as I am at this \nplace of mine.\" On this, the Ansar wept violently, and Allah's Messenger (ﷺ) kept on saying, \"Ask Me! \" \nThen a man got up and asked, ''Where will my entrance be, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \n\"(You will go to) the Fire.\" Then `Abdullah bin Hudhaifa got up and asked, \"Who is my father, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" The Prophet (ﷺ) then kept on saying \n(angrily), \"Ask me! Ask me!\" `Umar then knelt on his knees and said, \"We have accepted Allah as our \nLord and Islam as our religion and Muhammad as an Apostle.\" Allah's Messenger (ﷺ) became quiet when \n`Umar said that. Then Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, Paradise and Hell \nwere displayed before me across this wall while I was praying, and I never saw such good and evil as \nI have seen today.\"","reference":"Sahih al-Bukhari 7294, Book 96, Hadith 25","grade":"","question #":"question #3","question":"What does the display of Paradise and Hell to the Prophet during prayer signify in Islamic belief?","id":"bukhari-96-229"},{"hadith-eng":"A man said, \"O Allah's Prophet! Who is my father?\" The Prophet (ﷺ) said, \"Your father is so-and-so.\" \nAnd then the Divine Verse:-- 'O you who believe! Ask not questions about things..(5.101)","reference":"Sahih al-Bukhari 7295, Book 96, Hadith 26","grade":"","question #":"question #3","question":"What can be learned about the Prophet's response to personal inquiries from his companions?","id":"bukhari-96-230"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"People will not stop asking questions till they say, 'This is Allah, the Creator of \neverything, then who created Allah?' \"","reference":"Sahih al-Bukhari 7296, Book 96, Hadith 27","grade":"","question #":"question #3","question":"What are the potential dangers of excessive questioning in religious matters?","id":"bukhari-96-231"},{"hadith-eng":"I was with the Prophet (ﷺ) at one of the farms of Medina while he was leaning on a date palm leaf-stalk. \nHe passed by a group of Jews and some of them said to the other, Ask him (the Prophet) about the \nspirit. Some others said, \"Do not ask him, lest he should tell you what you dislike\" But they went up \nto him and said, \"O Abal Qasim! Inform us bout the spirit.\" The Prophet (ﷺ) stood up for a while, waiting. \nI realized that he was being Divinely Inspired, so I kept away from him till the inspiration was over. \nThen the Prophet (ﷺ) said, \"(O Muhammad) they ask you regarding the spirit, Say: The spirit its \nknowledge is with my Lord (i.e., nobody has its knowledge except Allah)\" (17.85) (This is a miracle \nof the Qur'an that all the scientists up till now do not know about the spirit, i.e, how life comes to a \nbody and how it goes away at its death) (See Hadith No. 245, Vol. 6)","reference":"Sahih al-Bukhari 7297, Book 96, Hadith 28","grade":"","question #":"question #3","question":"What is the significance of divine inspiration in the context of the Prophet's responses to challenging questions?","id":"bukhari-96-232"},{"hadith-eng":"The Prophet (ﷺ) wore a gold ring and then the people followed him and wore gold rings too. Then the \nProphet said, \"I had this golden ring made for myself. He then threw it away and said, \"I shall never \nput it on.\" Thereupon the people also threw their rings away.","reference":"Sahih al-Bukhari 7298, Book 96, Hadith 29","grade":"","question #":"question #3","question":"What can be learned from the Prophet's example regarding the adoption and abandonment of certain practices?","id":"bukhari-96-233"},{"hadith-eng":"The Prophet (ﷺ) said (to his companions), \"Do not fast Al-Wisal.\" They said, \"But you fast Al-Wisail.\" \nHe said, \"I am not like you, for at night my Lord feeds me and makes me drink.\" But the people did \nnot give up Al-Wisal, so the Prophet (ﷺ) fasted Al-Wisal with them for two days or two nights, and then \nthey saw the crescent whereupon the Prophet (ﷺ) said, \"If the crescent had delayed, I would have \ncontinued fasting (because of you),\" as if he wanted to vanquish them completely (because they had \nrefused to give up Al Wisal).","reference":"Sahih al-Bukhari 7299, Book 96, Hadith 30","grade":"","question #":"question #3","question":"What lesson can be learned from the Prophet's (ﷺ) response to his companions' persistence in fasting Al-Wisal?","id":"bukhari-96-234"},{"hadith-eng":"`Ali addressed us while he was standing on a brick pulpit and carrying a sword from which was hanging a scroll He said \"By Allah, we have no book to read except Allah's Book and whatever is on this scroll,\" And then he unrolled it, and behold, in it was written what sort of camels were to be given as blood money, and there was also written in it: 'Medina is a sanctuary form 'Air (mountain) to such \nand such place so whoever innovates in it an heresy or commits a sin therein, he will incur the curse of Allah, the angels, and all the people and Allah will not accept his compulsory or optional good deeds.' \nThere was also written in it: 'The asylum (pledge of protection) granted by any Muslims is one and the \nsame, (even a Muslim of the lowest status is to be secured and respected by all the other Muslims, and \nwhoever betrays a Muslim in this respect (by violating the pledge) will incur the curse of Allah, the \nangels, and all the people, and Allah will not accept his compulsory or optional good deeds.' There \nwas also written in it: 'Whoever (freed slave) befriends (takes as masters) other than his real masters \n(manumitters) without their permission will incur the curse of Allah, the angels, and all the people, \nand Allah will not accept his compulsory or optional good deeds. ' (See Hadith No. 94, Vol. 3)","reference":"Sahih al-Bukhari 7300, Book 96, Hadith 31","grade":"","question #":"question #3","question":"What is the significance of loyalty to one's real masters in the context of freed slaves according to Islamic teachings?","id":"bukhari-96-235"},{"hadith-eng":"The Prophet (ﷺ) did something as it was allowed from the religious point of view but some people \nrefrained from it. When the Prophet (ﷺ) heard of that, he, after glorifying and praising Allah, said, \"Why \ndo some people refrain from doing something which I do? By Allah, I know Allah more than they.\"","reference":"Sahih al-Bukhari 7301, Book 96, Hadith 32","grade":"","question #":"question #3","question":"Why might some people refrain from actions that are religiously permissible, and how does the Prophet (ﷺ) address this behavior?","id":"bukhari-96-236"},{"hadith-eng":"Once the two righteous men, i.e., Abu Bakr and `Umar were on the verge of destruction (and that was \nbecause): When the delegate of Bani Tamim came to the Prophet, one of them (either Abu Bakr or \n`Umar) recommended Al-Aqra' bin H`Abis at-Tamimi Al-Hanzali, the brother of Bani Majashi (to be \nappointed as their chief), while the other recommended somebody else. Abu Bakr said to `Umar, \"You \nintended only to oppose me.\" `Umar said, \"I did not intend to oppose you!\" Then their voices grew \nlouder in front of the Prophet (ﷺ) whereupon there was revealed: 'O you who believe! Do not raise your \nvoices above the voice of the Prophet..a great reward.' (49.2-3) Ibn Az-Zubair said, 'Thence forward \nwhen `Umar talked to the Prophet, he would talk like one who whispered a secret and would even fail \nto make the Prophet (ﷺ) hear him, in which case the Prophet (ﷺ) would ask him (to repeat his words).","reference":"Sahih al-Bukhari 7302, Book 96, Hadith 33","grade":"","question #":"question #3","question":"What can be inferred about the consequences of raising one's voice in the presence of the Prophet?","id":"bukhari-96-237"},{"hadith-eng":"(the mother of believers) Allah's Messenger (ﷺ) during his fatal ailment said, \"Order Abu Bakr to lead the \npeople in prayer.\" I said, \"If Abu Bakr stood at your place (in prayers, the people will not be able to \nhear him because of his weeping, so order `Umar to lead the people in prayer.\" He again said, \"Order \nAbu Bakr to lead the people in prayer \" Then I said to Hafsa, \"Will you say (to the Prophet), 'If Abu \nBakr stood at your place, the people will not be able to hear him be cause of his weeping, so order \n`Umar to lead the people in prayer?\" Hafsa did so, whereupon Allah's Messenger (ﷺ) said, \"You are like the \ncompanions of Joseph (See Qur'an, 12:30-32). Order Abu Bakr to lead the people in prayer.\" Hafsa \nthen said to me, \"I have never received any good from you!\"","reference":"Sahih al-Bukhari 7303, Book 96, Hadith 34","grade":"","question #":"question #3","question":"What does the interaction between Aisha, Hafsa, and the Prophet Muhammad (ﷺ) reveal about the dynamics among the Prophet's companions?","id":"bukhari-96-238"},{"hadith-eng":"'Uwaimir Al-`Ajlani came to `Asim bin `Adi and said, \"If a man found another man with his wife and \nkilled him, would you sentence the husband to death (in Qisas,) i.e., equality in punishment)? O \n`Asim! Please ask Allah's Messenger (ﷺ) about this matter on my behalf.\" `Asim asked the Prophet (ﷺ) but the \nProphet disliked the question and disapproved of it. `Asim returned and informed 'Uwaimir that the \nProphet disliked that type of question. 'Uwaimir said, \"By Allah, I will go (personally) to the Prophet.\" \n'Uwaimir came to the Prophet (ﷺ) when Allah had already revealed Qur'anic Verses (in that respect), after \n`Asim had left (the Prophet (ﷺ) ). So the Prophet (ﷺ) said to 'Uwaimir, \"Allah has revealed Qur'anic Verses \nregarding you and your wife.\" The Prophet (ﷺ) then called for them, and they came and carried out the \norder of Lian. \nThen 'Uwaimir said, \"O Allah's Messenger (ﷺ)! Now if I kept her with me, I would be accused of telling a \nlie.\" So 'Uwaimir divorced her although the Prophet (ﷺ) did not order him to do so. Later on this practice \nof divorcing became the tradition of couples involved in a case of Li'an. The Prophet (ﷺ) said (to the \npeople). \"Wait for her! If she delivers a red short (small) child like a Wahra (a short red animal). then \nI will be of the opinion that he ('Uwaimir) has told a lie but if she delivered a black big-eyed one with \nbig buttocks, then I will be of the opinion that he has told the truth about her.\" 'Ultimately she gave \nbirth to a child that proved the accusation. (See Hadith No. 269, Vol. 6)","reference":"Sahih al-Bukhari 7304, Book 96, Hadith 35","grade":"","question #":"question #3","question":"What are the implications of a husband divorcing his wife in the context of Li'an without a direct order from the Prophet?","id":"bukhari-96-239"},{"hadith-eng":"I proceeded till I entered upon `Umar (and while I was sitting there), his gate-keeper Yarfa came to \nhim and said, \" `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d ask your permission to come in.\" \n`Umar allowed them. So they entered, greeted, and sat down. (After a while the gatekeeper came) and \nsaid, \"Shall I admit `Ali and `Abbas?'' `Umar allowed them to enter. Al-`Abbas said \"O Chief of the \nbelievers! Judge between me and the oppressor (`Ali).\" Then there was a dispute (regarding the \nproperty of Bani Nadir) between them (`Abbas and `Ali). `Uthman and his companions said, \"O Chief \nof the Believers! Judge between them and relieve one from the other.\" `Umar said, \"Be patient! \nbeseech you by Allah, with Whose permission the Heaven and the Earth Exist! Do you know that \nAllah's Messenger (ﷺ) said, 'Our property is not to be inherited, and whatever we leave is to be given in \ncharity,' and by this Allah's Messenger (ﷺ) meant himself?\" On that the group said, \"He verily said so.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, do you both know that \nAllah's Messenger (ﷺ) said so?\" They both replied, \"Yes\". `Umar then said, \"Now I am talking to you about \nthis matter (in detail) . Allah favored Allah's Messenger (ﷺ) with some of this wealth which He did not give \nto anybody else, as Allah said: 'What Allah bestowed as Fai (Booty on His Apostle for which you \nmade no expedition... ' (59.6) \nSo that property was totally meant for Allah's Messenger (ﷺ), yet he did not collect it and ignore you, nor did \nhe withhold it with your exclusion, but he gave it to you and distributed it among you till this much of \nit was left behind, and the Prophet, used to spend of this as the yearly expenditures of his family and \nthen take what remained of it and spent it as he did with (other) Allah's wealth. The Prophet (ﷺ) did so \nduring all his lifetime, and I beseech you by Allah, do you know that?\" They replied, \"Yes.\" `Umar \nthen addressed `Ali and `Abbas, saying, \"I beseech you both by Allah, do you know that?\" Both of \nthem replied, \"Yes.\" `Umar added, \"Then Allah took His Apostle unto Him. Abu Bakr then said 'I am \nthe successor of Allah's Messenger (ﷺ)' and took over all the Prophet's property and disposed of it in the \nsame way as Allah's Messenger (ﷺ) used to do, and you were present then.\" Then he turned to `Ali and \n`Abbas and said, \"You both claim that Abu Bakr did so-and-so in managing the property, but Allah \nknows that Abu Bakr was honest, righteous, intelligent, and a follower of what is right in managing it. \nThen Allah took Abu Bakr unto Him, 'I said: I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' So \nI took over the property for two years and managed it in the same way as Allah's Messenger (ﷺ), and Abu \nBakr used to do. Then you both (`Ali and `Abbas) came to me and asked for the same thing! (O \n`Abbas! You came to me to ask me for your share from nephew's property; and this (`Ali) came to me \nasking for his wives share from her father's property, and I said to you both, 'If you wish, I will place \nit in your custody on condition that you both will manage it in the same way as Allah's Messenger (ﷺ) and \nAbu Bakr did and as I have been doing since I took charge of managing it; otherwise, do not speak to \nme anymore about it.' \nThen you both said, 'Give it to us on that (condition).' So I gave it to you on that condition. Now I \nbeseech you by Allah, did I not give it to them on that condition?\" The group (whom he had been \naddressing) replied, \"Yes.\" `Umar then addressed `Abbas and `Ali saying, \"I beseech you both by \nAllah, didn't I give you all that property on that condition?\" They said, \"Yes.\" `Umar then said, \"Are \nyou now seeking a verdict from me other than that? By Him with Whose Permission the Heaven and \nthe Earth exists I will not give any verdict other than that till the Hour is established; and if you both \nare unable to manage this property, then you can hand it back to me, and I will be sufficient for it on \nyour behalf.\" (See, Hadith No. 326, Vol. 4)","reference":"Sahih al-Bukhari 7305, Book 96, Hadith 36","grade":"","question #":"question #3","question":"What role did Umar play in resolving disputes regarding the management of the Prophet's property?","id":"bukhari-96-240"},{"hadith-eng":"I said to Anas, \"Did Allah's Messenger (ﷺ) make Medina a sanctuary?\" He replied, \"Yes, (Medina is a \nsanctuary from such-and-such place to such-and-such place. It is forbidden to cut its trees, and \nwhoever innovates an heresy in it or commits a sin therein, will incur the curse of Allah, the angels, \nand all the people.\" Then Musa bin Anas told me that Anas added, \"..... or gives refuge to such an \nheretic or a sinner...\"","reference":"Sahih al-Bukhari 7306, Book 96, Hadith 37","grade":"","question #":"question #3","question":"What is the significance of not cutting trees in the sanctuary of Medina?","id":"bukhari-96-241"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Allah will not deprive you of knowledge after he has given it to you, but \nit will be taken away through the death of the religious learned men with their knowledge. Then there \nwill remain ignorant people who, when consulted, will give verdicts according to their opinions \nwhereby they will mislead others and go astray.\"","reference":"Sahih al-Bukhari 7307, Book 96, Hadith 38","grade":"","question #":"question #3","question":"What is the impact of consulting ignorant individuals for religious verdicts on society?","id":"bukhari-96-242"},{"hadith-eng":"I asked Abu Wail, \"Did you witness the battle of Siffin between `Ali and Muawiya?\" He said, \"Yes,\" \nand added, \"Then I heard Sahl bin Hunaif saying, 'O people! Blame your personal opinions in your \nreligion. No doubt, I remember myself on the day of Abi Jandal; if I had the power to refuse the order \nof Allah's Messenger (ﷺ), I would have refused it. \nWe have never put our swords on our shoulders to get involved in a situation that might have been \nhorrible for us, but those swords brought us to victory and peace, except this present situation.' \" Abu \nWail said, \"I witnessed the battle of Siffin, and how nasty Siffin was!\"","reference":"Sahih al-Bukhari 7308, Book 96, Hadith 39","grade":"","question #":"question #3","question":"What is the significance of obedience to the Prophet's orders even when personal opinions differ?","id":"bukhari-96-243"},{"hadith-eng":"I fell ill, Allah's Messenger (ﷺ) and Abu Bakr came to visit me on foot. The Prophet (ﷺ) came to me while I was \nunconscious. Allah's Messenger (ﷺ) performed ablution and poured the Remaining water of his ablution over \nme whereupon I became conscious and said, 'O Allah's Messenger (ﷺ)! How should I spend my wealth? Or \nhow should I deal with my wealth?\" But the Prophet (ﷺ) did not give me any reply till the Verse of the \nlaws of inheritance was revealed.","reference":"Sahih al-Bukhari 7309, Book 96, Hadith 40","grade":"","question #":"question #3","question":"What significance does the act of performing ablution have in this narration?","id":"bukhari-96-244"},{"hadith-eng":"A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Men (only) benefit by your teachings, \nso please devote to us from (some of) your time, a day on which we may come to you so that you may \nteach us of what Allah has taught you.\" Allah's Messenger (ﷺ) said, \"Gather on such-and-such a day at suchand- \nsuch a place.\" They gathered and Allah's Messenger (ﷺ) came to them and taught them of what Allah \nhad taught him. He then said, \"No woman among you who has lost her three children (died) but that \nthey will screen her from the Fire.\" A woman among them said, \"O Allah's Messenger (ﷺ)! If she lost two \nchildren?\" She repeated her question twice, whereupon the Prophet (ﷺ) said, \"Even two, even two, even \ntwo!\" (See Hadith No. 341, Vol. 2)","reference":"Sahih al-Bukhari 7310, Book 96, Hadith 41","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) approach to addressing the needs of women in his community?","id":"bukhari-96-245"},{"hadith-eng":"The Prophet (ﷺ) said, \"A group of my follower swill remain predominant (victorious) till Allah's Order \n(the Hour) comes upon them while they are still predominant (victorious).","reference":"Sahih al-Bukhari 7311, Book 96, Hadith 42","grade":"","question #":"question #3","question":"What significance does the Hour hold in Islamic eschatology?","id":"bukhari-96-246"},{"hadith-eng":"I heard Muawiya bin Abi Sufyan delivering a sermon. He said, \"I heard the Prophet (ﷺ) saying, \"If Allah \nwants to do a favor to somebody, He bestows on him, the gift of understanding the Qur'an and Sunna. \nI am but a distributor, and Allah is the Giver. The state of this nation will remain good till the Hour is \nestablished, or till Allah's Order comes.\"","reference":"Sahih al-Bukhari 7312, Book 96, Hadith 43","grade":"","question #":"question #3","question":"What is the significance of the state of the nation in relation to the establishment of the Hour?","id":"bukhari-96-247"},{"hadith-eng":"When the (following) Verse was revealed to Allah's Messenger (ﷺ): 'Say: He has power to send torment on \nyou from above,'..(6.65) he said, \"O Allah! I seek refuge with Your Face (from that punishment).\" \nAnd when this was revealed: '..or from beneath your feet.' (6.65) he said, \"O Allah! I seek refuge with \nYour Face (from that).\" And when this Verse was revealed: '..or to cover you with confusion in partystrife, \nand make you to taste the violence of one another,'...(6.65) he said: \"These two warnings are \neasier (than the previous ones).","reference":"Sahih al-Bukhari 7313, Book 96, Hadith 44","grade":"","question #":"question #3","question":"What can be understood about the severity of divine warnings and their impact on believers?","id":"bukhari-96-248"},{"hadith-eng":"A bedouin came to Allah's Messenger (ﷺ) and said, \"My wife has delivered a black boy, and I suspect that he \nis not my child.\" Allah's Messenger (ﷺ) said to him, \"Have you got camels?\" The bedouin said, \"Yes.\" The \nProphet said, \"What color are they?\" The bedouin said, \"They are red.\" The Prophet (ﷺ) said, \"Are any of \nthem Grey?\" He said, \"There are Grey ones among them.\" The Prophet (ﷺ) said, \"Whence do you think \nthis color came to them?\" The bedouin said, \"O Allah's Messenger (ﷺ)! It resulted from hereditary \ndisposition.\" The Prophet (ﷺ) said, \"And this (i.e., your child) has inherited his color from his ancestors.\" \nThe Prophet (ﷺ) did not allow him to deny his paternity of the child.","reference":"Sahih al-Bukhari 7314, Book 96, Hadith 45","grade":"","question #":"question #3","question":"How can understanding genetics help in resolving doubts about parentage in Islamic teachings?","id":"bukhari-96-249"},{"hadith-eng":"A woman came to the Prophet (ﷺ) and said, \"My mother vowed to perform the Hajj but she died before \nperforming it. Should I perform the Hajj on her behalf?\" He said, \"Yes! Perform the Hajj on her \nbehalf. See, if your mother had been in debt, would you have paid her debt?\" She said, \"Yes.\" He said, \n\"So you should pay what is for Him as Allah has more right that one should fulfill one's obligations to \nHim. \"","reference":"Sahih al-Bukhari 7315, Book 96, Hadith 46","grade":"","question #":"question #3","question":"What is the significance of fulfilling vows made to Allah after a person's death?","id":"bukhari-96-250"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Do not wish to be like anybody except in two cases: The case of a man whom \nAllah has given wealth and he spends it in the right way, and that of a man whom Allah has given \nreligious wisdom (i.e., Qur'an and Sunna) and he gives his verdicts according to it and teaches it.\" (to \nothers i.e., religious knowledge of Qur'an and Sunna (Prophet's Traditions)). \"","reference":"Sahih al-Bukhari 7316, Book 96, Hadith 47","grade":"","question #":"question #3","question":"How is religious wisdom defined and what is its significance in making judgments and teaching others?","id":"bukhari-96-251"},{"hadith-eng":"`Umar bin Al-Khattab asked (the people) about the Imlas of a woman, i.e., a woman who has an \nabortion because of having been beaten on her `Abdomen, saying, \"Who among you has heard \nanything about it from the Prophet?\" I said, \"I did.'' He said, \"What is that?\" I said, \"I heard the \nProphet saying, \"Its Diya (blood money) is either a male or a female slave.' \" `Umar said, \"Do not \nleave till you present witness in support of your statement.\" So I went out, and found Muhammad bin \nMaslama. I brought him, and he bore witness with me that he had heard the Prophet (ﷺ) saying, \"Its Diya \n(blood money) is either a male slave or a female slave.\"","reference":"Sahih al-Bukhari 7317, 7318, Book 96, Hadith 48","grade":"","question #":"question #3","question":"What role does the testimony of companions play in verifying the sayings of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-252"},{"hadith-eng":"`Umar bin Al-Khattab asked (the people) about the Imlas of a woman, i.e., a woman who has an \nabortion because of having been beaten on her `Abdomen, saying, \"Who among you has heard \nanything about it from the Prophet?\" I said, \"I did.'' He said, \"What is that?\" I said, \"I heard the \nProphet saying, \"Its Diya (blood money) is either a male or a female slave.' \" `Umar said, \"Do not \nleave till you present witness in support of your statement.\" So I went out, and found Muhammad bin \nMaslama. I brought him, and he bore witness with me that he had heard the Prophet (ﷺ) saying, \"Its Diya \n(blood money) is either a male slave or a female slave.\"","reference":"Sahih al-Bukhari 7317, 7318, Book 96, Hadith 48","grade":"","question #":"question #3","question":"What role does the testimony of companions play in understanding the rulings of the Prophet?","id":"bukhari-96-253"},{"hadith-eng":"The Prophet (ﷺ) said, \"The Hour will not be established till my followers copy the deeds of the previous \nnations and follow them very closely, span by span, and cubit by cubit (i.e., inch by inch).\" It was \nsaid, \"O Allah's Messenger (ﷺ)! Do you mean by those (nations) the Persians and the Byzantines?\" The \nProphet said, \"Who can it be other than they?\"","reference":"Sahih al-Bukhari 7319, Book 96, Hadith 49","grade":"","question #":"question #3","question":"What is the significance of the Prophet's mention of Persians and Byzantines in the context of following previous nations?","id":"bukhari-96-254"},{"hadith-eng":"The Prophet (ﷺ) said, \"You will follow the ways of those nations who were before you, span by span and \ncubit by cubit (i.e., inch by inch) so much so that even if they entered a hole of a mastigure, you \nwould follow them.\" We said, \"O Allah's Messenger (ﷺ)! (Do you mean) the Jews and the Christians?\" He \nsaid, \"Whom else?\"","reference":"Sahih al-Bukhari 7320, Book 96, Hadith 50","grade":"","question #":"question #3","question":"What warning does the hadith provide regarding following the practices of other nations?","id":"bukhari-96-255"},{"hadith-eng":"The Prophet (ﷺ) said, \"None is killed unjustly, but the first son of Adam will have a part of its burden.\" \nSufyan said, \"..a part of its blood because he was the first to establish the tradition of murdering\"","reference":"Sahih al-Bukhari 7321, Book 96, Hadith 51","grade":"","question #":"question #3","question":"What are the implications of establishing a harmful tradition according to Islamic teachings?","id":"bukhari-96-256"},{"hadith-eng":"A bedouin gave the Pledge of allegiance for embracing Islam to Allah's Messenger (ﷺ), and then he got an attack of fever in Medina and came to Allah's Messenger (ﷺ): and said, \"O Allah's Messenger (ﷺ)! Cancel my pledge.\" Allah's Messenger (ﷺ) refused to do so. The bedouin came to him again and said, \"Cancel my pledge,\" but he refused again, and then again, the bedouin came to him and said, \"Cancel my pledge,\" and Allah's Messenger (ﷺ) refused. The bedouin finally went away, and Allah's Messenger (ﷺ) said, \"Medina is like a pair of bellows (furnace), it expels its impurities while it brightens and clears its good.'","reference":"Sahih al-Bukhari 7322, Book 96, Hadith 52","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's (ﷺ) response to the bedouin's request to cancel his pledge?","id":"bukhari-96-257"},{"hadith-eng":"I used to teach Qur'an to 'Abdur-Rahman bin Auf. When Umar performed his last Hajj, 'Abdur-Rahman said (to me) at Mina, \"Would that you had seen Chief of the believers today! A man came to him and said, \"So-and-so has said, \"If Chief of the Believers died, we will give the oath of allegiance to such-and-such person,' 'Umar said, 'I will get up tonight and warn those who want to usurp the people's rights.' I said, 'Do not do so, for the season (of Hajj) gathers the riffraff mob who will form the majority of your audience, and I am afraid that they will not understand (the meaning of) your saying properly and may spread (an incorrect statement) everywhere. You should wait till we reach Medina, the place of migration and the place of the Sunna (the Prophet's Traditions). There you will meet the companions of Allah's Messenger (ﷺ) from the Muhajirin and the Ansar who will understand your statement and place it in its proper position' 'Umar said, 'By Allah, I shall do so the first time I stand (to address the people) in Medina.' When we reached Medina, 'Umar (in a Friday Khutba-sermon) said, \"No doubt, Allah sent Muhammad with the Truth and revealed to him the Book (Quran), and among what was revealed, was the Verse of Ar-Rajm (stoning adulterers to death).'\" (See Hadith No. 817,Vol. 8)","reference":"Sahih al-Bukhari 7323, Book 96, Hadith 53","grade":"","question #":"question #3","question":"What role do the companions of the Prophet play in preserving and conveying Islamic teachings?","id":"bukhari-96-258"},{"hadith-eng":"We were with Abu Huraira while he was wearing two linen garments dyed with red clay. He cleaned \nhis nose with his garment, saying, \"Bravo! Bravo! Abu Huraira is cleaning his nose with linen! There \ncame a time when I would fall senseless between the pulpit of Allah's Messenger (ﷺ) and `Aisha's dwelling \nwhereupon a passerby would come and put his foot on my neck, considering me a mad man, but in \nfact, I had no madness, I suffered nothing but hunger.\"","reference":"Sahih al-Bukhari 7324, Book 96, Hadith 54","grade":"","question #":"question #3","question":"What does Abu Huraira's story tell us about the early companions' dedication and sacrifices?","id":"bukhari-96-259"},{"hadith-eng":"Ibn `Abbas was asked, \"Did you offer the Id prayer with the Prophet?\" He said, \"Yes, had it not been \nfor my close relation to the Prophet, I would not have performed it (with him) because of my being \ntoo young The Prophet (ﷺ) came to the mark which is near the home of Kathir bin As-Salt and offered the \nId prayer and then delivered the sermon. I do not remember if any Adhan or Iqama were pronounced \nfor the prayer. Then the Prophet (ﷺ) ordered (the women) to give alms, and they started stretching out \ntheir hands towards their ears and throats (giving their ornaments in charity), and the Prophet (ﷺ) ordered \nBilal to go to them (to collect the alms), and then Bilal returned to the Prophet.","reference":"Sahih al-Bukhari 7325, Book 96, Hadith 55","grade":"","question #":"question #3","question":"What role did Bilal play in the collection of alms during the Id prayer?","id":"bukhari-96-260"},{"hadith-eng":"The Prophet (ﷺ) used to go to the Quba' mosque, sometimes walking, sometimes riding.","reference":"Sahih al-Bukhari 7326, Book 96, Hadith 56","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) practice of visiting the mosque regularly?","id":"bukhari-96-261"},{"hadith-eng":"`Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the \nProphet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as \nsanctified (just for being buried there).'' \nNarrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried \nwith my two companions (the Prophet (ﷺ) and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her \nhabit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to \nallow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to \nbe buried with them.\"","reference":"Sahih al-Bukhari 7327, 7328, Book 96, Hadith 57","grade":"","question #":"question #3","question":"What does the interaction between Umar and Aisha reveal about the respect and decision-making regarding burial places in Islam?","id":"bukhari-96-262"},{"hadith-eng":"`Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the \nProphet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as \nsanctified (just for being buried there).'' \nNarrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried \nwith my two companions (the Prophet (ﷺ) and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her \nhabit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to \nallow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to \nbe buried with them.\"","reference":"Sahih al-Bukhari 7327, 7328, Book 96, Hadith 57","grade":"","question #":"question #3","question":"What was Aisha's general policy regarding requests from the companions to be buried with the Prophet and Abu Bakr?","id":"bukhari-96-263"},{"hadith-eng":"Allah's Messenger (ﷺ) used to perform the `Asr prayer and then one could reach the `Awali (a place in the \noutskirts of Medina) while the sun was still quite high. \nNarrated Yunus: The distance of the `Awali (from Medina) was four or three miles.","reference":"Sahih al-Bukhari 7329, Book 96, Hadith 58","grade":"","question #":"question #3","question":"What can be inferred about the travel distance and time between Medina and `Awali during the Prophet's era?","id":"bukhari-96-264"},{"hadith-eng":"The Sa' (a kind of measure) during the lifetime of the Prophet (ﷺ) used to be equal to the one Mudd \n(another kind of measure) and one third of a Mudd which we use today, but the Sa' of today has \nbecome large.","reference":"Sahih al-Bukhari 7330, Book 96, Hadith 59","grade":"","question #":"question #3","question":"Why is it important to know the original measurements used during the Prophet's era?","id":"bukhari-96-265"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, and bestow Your Blessings \non their Sa' and Mudd.\" He meant those of the people of Medina.","reference":"Sahih al-Bukhari 7331, Book 96, Hadith 60","grade":"","question #":"question #3","question":"What role do specific prayers play in seeking prosperity for a community in Islam?","id":"bukhari-96-266"},{"hadith-eng":"The Jews brought a man and a woman who had committed illegal sexual intercourse, to the Prophet (ﷺ) \nand the Prophet (ﷺ) ordered them to be stoned to death, and they were stoned to death near the mosque \nwhere the biers used to be placed.","reference":"Sahih al-Bukhari 7332, Book 96, Hadith 61","grade":"","question #":"question #3","question":"What significance does the location of carrying out a punishment hold in Islamic tradition?","id":"bukhari-96-267"},{"hadith-eng":"The Mountain of Uhud came in sight of Allah's Messenger (ﷺ) who then said, \"This is a mountain that loves \nus and is loved by us. O Allah! Abraham made Mecca a sanctuary and I make the area between its \n(Medina's) two mountains a sanctuary.\"","reference":"Sahih al-Bukhari 7333, Book 96, Hadith 62","grade":"","question #":"question #3","question":"What is the concept of a sanctuary in Islam, and how did the Prophet Muhammad (ﷺ) establish one in Medina?","id":"bukhari-96-268"},{"hadith-eng":"The distance between the pulpit and the wall of the mosque on the side of the Qibla was just sufficient \nfor a sheep to pass through.","reference":"Sahih al-Bukhari 7334, Book 96, Hadith 63","grade":"","question #":"question #3","question":"What significance does the specific measurement of space in the mosque hold in Islamic tradition?","id":"bukhari-96-269"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from one of the gardens of \nParadise, and my pulpit is over my Lake-Tank. (Kauthar);","reference":"Sahih al-Bukhari 7335, Book 96, Hadith 64","grade":"","question #":"question #3","question":"What is the importance of the Prophet's pulpit in relation to the Lake-Tank (Kauthar) in Islamic eschatology?","id":"bukhari-96-270"},{"hadith-eng":"`Abdullah said, \"The Prophet (ﷺ) arranged for a horse race, and the prepared horses were given less food \nfor a few days before the race to win the race, and were allowed to run from Al-Hafya to Thaniyat-al- \nWada`, and the unprepared horses were allowed to run between Thaniyat-al-Wada` and the mosque of \nBani Zuraiq,\" `Abdullah was one of those who participated in the race.","reference":"Sahih al-Bukhari 7336, Book 96, Hadith 65","grade":"","question #":"question #3","question":"What can be learned about the organization and rules of horse racing during the time of the Prophet Muhammad (ﷺ)?","id":"bukhari-96-271"},{"hadith-eng":"I heard `Umar (delivering a sermon) on the pulpit of the Prophet.","reference":"Sahih al-Bukhari 7337, Book 96, Hadith 66","grade":"","question #":"question #3","question":"What role did Ibn `Umar play in the transmission of Islamic teachings?","id":"bukhari-96-272"},{"hadith-eng":"That he heard `Uthman bin `Affan delivering a sermon on the pulpit of the Prophet","reference":"Sahih al-Bukhari 7338, Book 96, Hadith 67","grade":"","question #":"question #3","question":"How are sermons used as a means of conveying religious teachings in Islam?","id":"bukhari-96-273"},{"hadith-eng":"This big copper vessel used to be put for me and Allah's Messenger (ﷺ) and we would take water from it \ntogether (on taking a bath) .","reference":"Sahih al-Bukhari 7339, Book 96, Hadith 68","grade":"","question #":"question #3","question":"What can be inferred about the use of resources and communal living from this narration?","id":"bukhari-96-274"},{"hadith-eng":"The Prophet (ﷺ) brought the Ansar and the Quarish people into alliance in my house at Medina, and he \ninvoked Allah for one month against the tribe of Bani Sulaim in (the last rak`a of each compulsory) \nprayer.","reference":"Sahih al-Bukhari 7340, 7341, Book 96, Hadith 69","grade":"","question #":"question #3","question":"What is the role of supplication in seeking divine intervention against adversaries in Islamic tradition?","id":"bukhari-96-275"},{"hadith-eng":"When I arrived at Medina, `Abdullah bin Salam met me and said to me, \"Accompany me to my house \nso that I may make you drink from a bowl from which Allah's Messenger (ﷺ) used to drink, and that you may \noffer prayer in the mosque in which the Prophet (ﷺ) used to pray.\" I accompanied him, and he made me \ndrink Sawiq and gave me dates to eat, and then I prayed in his mosque.","reference":"Sahih al-Bukhari 7342, Book 96, Hadith 70","grade":"","question #":"question #3","question":"What is the importance of hospitality and sharing in Islamic culture as demonstrated by companions of the Prophet?","id":"bukhari-96-276"},{"hadith-eng":"The Prophet (ﷺ) said to me, \"Someone came to me tonight from my Lord while I was in the 'Aqiq \n(valley), and said to me, \"Offer prayer in this blessed valley and say: 'Labbaik' for the (performance \nof) `Umra and Hajj.\"","reference":"Sahih al-Bukhari 7343, Book 96, Hadith 71","grade":"","question #":"question #3","question":"What is the importance of responding to divine instructions in Islam?","id":"bukhari-96-277"},{"hadith-eng":"Ibn `Umar said, \"The Prophet (ﷺ) fixed Qarn as the Miqat (for assuming the Ihram) for the people of \nNajd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar \nadded, \"I heard this from the Prophet, and I have been informed that the Prophet (ﷺ) said, 'The Miqat for \nthe Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim \ncountry.\"","reference":"Sahih al-Bukhari 7344, Book 96, Hadith 72","grade":"","question #":"question #3","question":"What was the status of Iraq during the time of the Prophet Muhammad (ﷺ) in relation to Islam?","id":"bukhari-96-278"},{"hadith-eng":"The Prophet (ﷺ) had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n \nthe dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).","reference":"Sahih al-Bukhari 7345, Book 96, Hadith 73","grade":"","question #":"question #3","question":"How are dreams interpreted in Islam, particularly those involving the Prophet Muhammad?","id":"bukhari-96-279"},{"hadith-eng":"That he heard the Prophet, after raising his head from the bowing in morning prayer, saying, \"O Allah, \nour Lord! All the praises are for you.\" And in the last (rak`a) he said, \"O Allah! Curse so-and-so and \nso--and-so.\" And then Allah revealed:-- 'Not for you (O Muhammad) is the decision, (but for Allah), \nwhether He turns in mercy to them or punish them, for they are indeed wrongdoers.' (3.128)","reference":"Sahih al-Bukhari 7346, Book 96, Hadith 74","grade":"","question #":"question #3","question":"What is the role of supplication in prayer, and how does it relate to divine mercy and punishment?","id":"bukhari-96-280"},{"hadith-eng":"That Allah's Messenger (ﷺ) came to him and Fatima the daughter of Allah's Messenger (ﷺ) at their house at night \nand said, \"Won't you pray?\" `Ali replied, \"O Allah's Messenger (ﷺ)! Our souls are in the Hands of Allah and \nwhen he wants us to get up, He makes us get up.\" When `Ali said that to him, Allah's Messenger (ﷺ) left \nwithout saying anything to him. While the Prophet (ﷺ) was leaving, `Ali heard him striking his thigh (with \nhis hand) and saying, \"But man is quarrelsome more than anything else.\" (18.54)","reference":"Sahih al-Bukhari 7347, Book 96, Hadith 75","grade":"","question #":"question #3","question":"What can be learned from the Prophet's response to Ali's statement about waking up for prayer?","id":"bukhari-96-281"},{"hadith-eng":"While we were in the mosque, Allah's Messenger (ﷺ) came out and said, \"Let us proceed to the Jews.\" So we \nwent out with him till we came to Bait-al-Midras. The Prophet (ﷺ) stood up there and called them, saying, \n\"O assembly of Jews! Surrender to Allah (embrace Islam) and you will be safe!\" They said, \"You \nhave conveyed Allah's message, O Aba-al-Qasim\" Allah's Messenger (ﷺ) then said to them, \"That is what I \nwant; embrace Islam and you will be safe.\" They said, \"You have conveyed the message, O Aba-al- \nQasim.\" Allah's Messenger (ﷺ) then said to them, \"That is what I want,\" and repeated his words for the third \ntime and added, \"Know that the earth is for Allah and I want to exile you from this land, so whoever \namong you has property he should sell it, otherwise, know that the land is for Allah and His Apostle.\"","reference":"Sahih al-Bukhari 7348, Book 96, Hadith 76","grade":"","question #":"question #3","question":"What does the hadith imply about the ownership of land according to Islamic teachings?","id":"bukhari-96-282"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be \nasked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation \nwill be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to \nus.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) \nMuhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" \nThen the Prophet (ﷺ) recited: 'And thus We have made of you (Muslims) a just and the best nation, that \nyou might be witness over the nations, and the Apostle a witness over you.' (2.143)","reference":"Sahih al-Bukhari 7349, Book 96, Hadith 77","grade":"","question #":"question #3","question":"What does it mean for Muslims to be described as a 'just and the best nation' in the context of this narration?","id":"bukhari-96-283"},{"hadith-eng":"Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the \nman returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of \nKhaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) \ndates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take \none Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind \n(of dates), and you should do the same in weighing.\"","reference":"Sahih al-Bukhari 7350, 7351, Book 96, Hadith 78","grade":"","question #":"question #3","question":"What guidance does Islam provide on the exchange of goods with different qualities or values?","id":"bukhari-96-284"},{"hadith-eng":"Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the \nman returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of \nKhaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) \ndates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take \none Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind \n(of dates), and you should do the same in weighing.\"","reference":"Sahih al-Bukhari 7350, 7351, Book 96, Hadith 78","grade":"","question #":"question #3","question":"What guidance does Islam provide on ensuring fairness in trade and commerce?","id":"bukhari-96-285"},{"hadith-eng":"That he heard Allah's Messenger (ﷺ) saying, \"If a judge gives a verdict according to the best of his \nknowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a \ndouble reward, and if he gives a verdict according to the best of his knowledge and his verdict is \nwrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"","reference":"Sahih al-Bukhari 7352, Book 96, Hadith 79","grade":"","question #":"question #3","question":"What does this narration imply about the importance of intention and effort in making judicial decisions in Islam?","id":"bukhari-96-286"},{"hadith-eng":"Abu Musa asked permission to enter upon `Umar, but seeing that he was busy, he went away. `Umar \nthen said, \"Didn't I hear the voice of `Abdullah bin Qais? Allow him to come in.\" He was called in and \n`Umar said to him, \"What made you do what you did.\" He replied, \"We have been instructed thus by \nthe Prophet\" `Umar said, \"Bring proof (witness) for this, other wise I will do so-and-so to you.\" Then \n`Abdullah bin Qais went to a gathering of the Ansar who then said, \"None but the youngest of us will \ngive the witness for it.\" So Abu Sa`id Al-Khudri got up and said, \"We used to be instructed thus (by \nthe Prophet).\" `Umar said, \"This tradition of the Prophet (ﷺ) remained hidden from me. Business in the \nmarket kept me busy.\"","reference":"Sahih al-Bukhari 7353, Book 96, Hadith 80","grade":"","question #":"question #3","question":"What role do companions play in preserving and verifying the teachings of the Prophet?","id":"bukhari-96-287"},{"hadith-eng":"Abu Huraira said, \"You people claim that Abu Huraira narrates many narrations of Allah's Messenger (ﷺ). \n(Anyhow) with Allah will be our appointment. I was a poor man, and used to stick to Allah's Messenger (ﷺ) \ncontented with what will fill my stomach, and the Muhajirin (emigrants) used to be busy trading in the \nmarkets, and the Ansar used to be busy looking after their properties. One-day I heard Allah's Messenger (ﷺ) \nsaying, 'Who will spread his Rida' (a garment covering the upper part of the body) till I finished my \nspeech and then fold it, (i.e. wrap it over your body), in which case he will never forget anything he \nhad heard from me.\" So I spread my garment which I was wearing; and by Him Who sent Muhammad \nwith the Truth, ever since, I have never forgotten whatever I heard from him (the Prophet)\" (See, \nHadith No. 119, Vol. 1)","reference":"Sahih al-Bukhari 7354, Book 96, Hadith 81","grade":"","question #":"question #3","question":"What role did the economic activities of the Muhajirin and Ansar play in their engagement with the Prophet's teachings?","id":"bukhari-96-288"},{"hadith-eng":"I saw Jabir bin `Abdullah swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can \nyou swear by Allah?\" Jabir said, \"I have heard `Umar swearing by Allah regarding this matter in the \npresence of the Prophet (ﷺ) and the Prophet (ﷺ) did not disapprove of it.\"","reference":"Sahih al-Bukhari 7355, Book 96, Hadith 82","grade":"","question #":"question #3","question":"What role does the testimony of companions play in confirming or denying claims in Islam?","id":"bukhari-96-289"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Horses may be used for three purposes: For a man they may be a source of \nreward (in the Hereafter); for another, a means of protection; and for another, a source of sin. The man \nfor whom they are a source of reward, is the one who keeps them for Allah's Cause and ties them with \nlong ropes and lets them graze in a pasture or garden. Whatever those long ropes allow them to eat of \nthat pasture or garden, will be written as good deeds for him and if they break their ropes and run one \nor two rounds, then all their footsteps and dung will be written as good deeds for him, and if they pass \na river and drink from it though he has had no intention of watering them, even then, that will be \nwritten as good deeds for him. So such horses are a source of reward for that man. For the man who \nkeeps horses for his livelihood in order not to ask others for help or beg his bread, and at the same \ntime he does not forget Allah's right of what he earns through them and of their backs (that he presents \nit to be used in Allah's Cause), such horses are a shelter for him (from poverty). For the man who \nkeeps them just out of pride and for showing off, they are a source of sin.\" Then Allah's Messenger (ﷺ) was \nasked about donkeys. He said, \"Allah has not revealed anything to me regarding them except this \ncomprehensive Verse: \n\"Then anyone who has done good, equal to the weight of an atom (or a small ant) shall see it, and any \none who has done evil, equal to the weight of an atom (or a small ant) shall see it.\" (99.7-8)","reference":"Sahih al-Bukhari 7356, Book 96, Hadith 83","grade":"","question #":"question #3","question":"What is the significance of intention in the use of animals like horses in Islam?","id":"bukhari-96-290"},{"hadith-eng":"A woman asked the Prophet (Hadith 456).Narrated `Aisha:A woman asked the Prophet (ﷺ) about the periods: How to take a bath after the periods. He said, \"Take a \nperfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself\" She said again, \"How shall I clean myself, O \nAllah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself with it.\" Then I knew what Allah's Messenger (ﷺ) \nmeant. So I pulled her aside and explained it to her.","reference":"Sahih al-Bukhari 7357, Book 96, Hadith 84","grade":"","question #":"question #3","question":"What is the significance of using a perfumed piece of cloth in the purification process after menstruation?","id":"bukhari-96-291"},{"hadith-eng":"Um Hufaid bint Al-Harith bin Hazn presented the Prophet (ﷺ) with some butter, dried yoghurt (curd milk) \nand mastigures as a gift. The Prophet (ﷺ) then asked for a meal (mastigures etc. to be put) and it was eaten \nover his table cloth, but the Prophet (ﷺ) did not eat of it, as he had aversion to it. But if it had been illegal \nto eat, it would not have been eaten over his table cloth nor would he have ordered that (mastigures \nmeat) to be eaten.","reference":"Sahih al-Bukhari 7358, Book 96, Hadith 85","grade":"","question #":"question #3","question":"What is the significance of the Prophet allowing certain foods to be eaten on his table despite his personal aversion?","id":"bukhari-96-292"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep \naway from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked \nvegetables was brought to the Prophet (ﷺ) at Badr. Detecting a bad smell from it, he asked about the dish \nand was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was \nbrought near to one of his companions who was with him. When the Prophet (ﷺ) saw it, he disliked \neating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\"","reference":"Sahih al-Bukhari 7359, Book 96, Hadith 86","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) interactions with unseen beings from his statement regarding eating certain foods?","id":"bukhari-96-293"},{"hadith-eng":"A lady came to Allah's Messenger (ﷺ) and she talked to him about something, and he gave her some order. \nShe said, \"O Allah's Messenger (ﷺ)! If I should not find you?\" He said, \"If you should not find me, then go to \nAbu Bakr.\" Ibrahim bin Sa`d said, \"As if she meant the death (of the Prophet).","reference":"Sahih al-Bukhari 7360, Book 96, Hadith 87","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) address concerns about his absence or passing in this narration?","id":"bukhari-96-294"},{"hadith-eng":"Narrated Humaid bin 'Abdur-Rahman that he heard Mu'awiya talking to a group of people from Quraish at Al-Madina, and on mentioning Ka'b Al-Ashbar, he said, \"He was one of the most truthful of those who used to talk about the people of the Scripture, yet we used to detect certain faults in his information.\"","reference":"Sahih al-Bukhari 7361, Book 96, Hadith 88","grade":"","question #":"question #3","question":"What challenges might arise when interpreting information from previous scriptures or narrators?","id":"bukhari-96-295"},{"hadith-eng":"The people of the Book used to read the Torah in Hebrew and then explain it in Arabic to the \nMuslims. Allah's Messenger (ﷺ) said (to the Muslims). \"Do not believe the people of the Book, nor \ndisbelieve them, but say, 'We believe in Allah and whatever is revealed to us, and whatever is \nrevealed to you.' \"","reference":"Sahih al-Bukhari 7362, Book 96, Hadith 89","grade":"","question #":"question #3","question":"How does Islam instruct its followers to express their belief in divine revelations?","id":"bukhari-96-296"},{"hadith-eng":"Ibn `Abbas said, \"Why do you ask the people of the scripture about anything while your Book \n(Qur'an) which has been revealed to Allah's Messenger (ﷺ) is newer and the latest? You read it pure, \nundistorted and unchanged, and Allah has told you that the people of the scripture (Jews and \nChristians) changed their scripture and distorted it, and wrote the scripture with their own hands and \nsaid, 'It is from Allah,' to sell it for a little gain. Does not the knowledge which has come to you \nprevent you from asking them about anything? No, by Allah, we have never seen any man from them \nasking you regarding what has been revealed to you!\"","reference":"Sahih al-Bukhari 7363, Book 96, Hadith 90","grade":"","question #":"question #3","question":"How does the Qur'an address the issue of distortion in previous scriptures?","id":"bukhari-96-297"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as you are in agreement as to its \ninterpretation and meanings, but when you have differences regarding its interpretation and meanings, \nthen you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)","reference":"Sahih al-Bukhari 7364, Book 96, Hadith 91","grade":"","question #":"question #3","question":"What is the recommended approach when studying the Qur'an to avoid conflicts in interpretation?","id":"bukhari-96-298"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as your hearts are in agreement as to its \nmeanings, but if you have differences as regards its meaning, stop reading it then.\"","reference":"Sahih al-Bukhari 7365, Book 96, Hadith 92","grade":"","question #":"question #3","question":"What is the recommended approach to studying the Qur'an according to Islamic teachings?","id":"bukhari-96-299"},{"hadith-eng":"When the time of the death of the Prophet (ﷺ) approached while there were some men in the house, and \namong them was `Umar bin Al-Khatttab, the Prophet (ﷺ) said, \"Come near let me write for you a writing \nafter which you will never go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill, and you have the \nQur'an, so Allah's Book is sufficient for us.\" The people in the house differed and disputed. Some of \nthem said, \"Come near so that Allah's Messenger (ﷺ) may write for you a writing after which you will not go \nastray,\" while some of them said what `Umar said. When they made much noise and differed greatly \nbefore the Prophet, he said to them, \"Go away and leave me.\" Ibn `Abbas used to say, \"It was a great \ndisaster that their difference and noise prevented Allah's Messenger (ﷺ) from writing that writing for them.","reference":"Sahih al-Bukhari 7366, Book 96, Hadith 93","grade":"","question #":"question #3","question":"What impact did the disagreement among the companions have on the Prophet's final instructions?","id":"bukhari-96-300"},{"hadith-eng":"I heard Jabir bin `Abdullah in a gathering saying, \"We, the companions of Allah's Messenger (ﷺ) assumed \nthe state of Ihram to perform only Hajj without `Umra.\" Jabir added, \"The Prophet (ﷺ) arrived (at Mecca) \non the fourth of Dhul-Hijja. And when we arrived (in Mecca) the Prophet (ﷺ) ordered us to finish the state \nof Ihram, saying, \"Finish your lhram and go to your wives (for sexual relation).\" Jabir added, \"The \nProphet did not oblige us (to go to our wives) but he only made that legal for us. Then he heard that \nwe were saying, \"When there remains only five days between us and the Day of `Arafat he orders us \nto finish our Ihram by sleeping with our wives in which case we will proceed to `Arafat with our male \norgans dribbling with semen?' (Jabir pointed out with his hand illustrating what he was saying). \nAllah's Messenger (ﷺ) stood up and said, 'You (People) know that I am the most Allah-fearing, the most \ntruthful and the best doer of good deeds (pious) from among you. If I had not brought the Hadi with \nme, I would have finished my Ihram as you will do, so finish your Ihram. If I had formerly known \nwhat I came to know lately, I would not have brought the Hadi with me.' So we finished our Ihram \nand listened to the Prophet (ﷺ) and obeyed him.\" (See Hadith No. 713, Vol. 2)","reference":"Sahih al-Bukhari 7367, Book 96, Hadith 94","grade":"","question #":"question #3","question":"What role does obedience to the Prophet's guidance play in the practice of Hajj according to the companions' experience?","id":"bukhari-96-301"},{"hadith-eng":"The Prophet (ﷺ) said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and \nthe third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna \n(tradition). (See Hadith No. 277, Vol. 2)","reference":"Sahih al-Bukhari 7368, Book 96, Hadith 95","grade":"","question #":"question #3","question":"How does the Prophet's guidance prevent people from considering certain optional prayers as obligatory traditions?","id":"bukhari-96-302"},{"hadith-eng":"After the slanderers had given a forged statement against her, Allah's Messenger (ﷺ) called `Ali bin Abi Talib \nand Usama bin Zaid when the Divine Inspiration was delayed. He wanted to ask them and consult \nthem about the question of divorcing me. Usama gave his evidence that was based on what he knew \nabout my innocence, but `Ali said, \"Allah has not put restrictions on you and there are many women \nother than her. Furthermore you may ask the slave girl who will tell you the truth.\" So the Prophet (ﷺ) \nasked Barira (my salve girl), \"Have you seen anything that may arouse your suspicion?\" She replied, \n\"I have not seen anything more than that she is a little girl who sleeps, leaving the dough of her family \n(unguarded) that the domestic goats come and eat it.\" Then the Prophet (ﷺ) stood on the pulpit and said, \n\"O Muslims! Who will help me against the man who has harmed me by slandering my wife? By \nAllah, I know nothing about my family except good.\" The narrator added: Then the Prophet (ﷺ) \nmentioned the innocence of `Aisha. (See Hadith No. 274, Vol. 6)","reference":"Sahih al-Bukhari 7369, Book 96, Hadith 96","grade":"","question #":"question #3","question":"What is the significance of seeking evidence and testimony in resolving disputes in Islam?","id":"bukhari-96-303"},{"hadith-eng":"Allah's Messenger (ﷺ) addressed the people, and after praising and glorifying Allah, he said, \"What do you \nsuggest me regarding those people who are abusing my wife? I have never known anything bad about \nher.\" The sub-narrator, `Urwa, said: When `Aisha was told of the slander, she said, \"O Allah's \nApostle! Will you allow me to go to my parents' home?\" He allowed her and sent a slave along with \nher. An Ansari man said, \"Subhanaka! It is not right for us to speak about this. Subhanaka! This is a \ngreat lie!\"","reference":"Sahih al-Bukhari 7370, Book 96, Hadith 97","grade":"","question #":"question #3","question":"How does the reaction of the community reflect their values and beliefs in the face of slander?","id":"bukhari-96-304"}]