{"number":71,"edition":"tr.diyanet","ayahs":[{"number":1,"text":"Milletine can yakıcı bir azap gelmezden önce onları uyar\" diye Nuh'u milletine gönderdik"},{"number":2,"text":"O da şöyle söyledi: \"Ey Milletim! Şüphesiz ben, size gönderilmiş apaçık bir uyarıcıyım"},{"number":3,"text":"Allah'a kulluk edin; O'ndan sakının ve bana itaat edin ki Allah günahlarınızı size bağışlasın ve sizi belli bir süreye kadar ertelesin; doğrusu Allah'ın belirttiği süre gelince geri bırakılamaz; keşke bilseniz"},{"number":4,"text":"Allah'a kulluk edin; O'ndan sakının ve bana itaat edin ki Allah günahlarınızı size bağışlasın ve sizi belli bir süreye kadar ertelesin; doğrusu Allah'ın belirttiği süre gelince geri bırakılamaz; keşke bilseniz"},{"number":5,"text":"Nuh dedi ki: \"Rabbim! Doğrusu ben, milletimi gece gündüz çağırdım"},{"number":6,"text":"Fakat benim çağırmam, sadece benden uzaklıklarını artırdı"},{"number":7,"text":"Doğrusu ben Senin onları bağışlaman için kendilerini her çağırışımda, parmaklarını kulaklarına tıkadılar, elbiselerine büründüler, direndiler, büyüklendikçe büyüklendiler"},{"number":8,"text":"Sonra, doğrusu ben onları açıkça çağırdım"},{"number":9,"text":"Sonra onlara açıktan açığa, gizliden gizliye de söyledim"},{"number":10,"text":"Dedim ki: \"Rabbinizden bağışlanma dileyin; doğrusu O, çok bağışlayandır. Size gökten bol bol yağmur indirsin"},{"number":11,"text":"Dedim ki: \"Rabbinizden bağışlanma dileyin; doğrusu O, çok bağışlayandır. Size gökten bol bol yağmur indirsin"},{"number":12,"text":"Sizi, mallar ve oğullarla desteklesin; sizin için bahçeler var etsin, ırmaklar akıtsın"},{"number":13,"text":"Ne oluyorsunuz ki Allah'a büyüklüğü yakıştıramıyorsunuz"},{"number":14,"text":"Oysa sizi merhalelerden geçirerek O yaratmıştır"},{"number":15,"text":"Allah'ın, göğü yedi kat üzerine nasıl yarattığını görmez misiniz"},{"number":16,"text":"Aralarında aya aydınlık vermiş ve güneşin ışık saçmasını sağlamıştır"},{"number":17,"text":"Allah sizi yerden bitirir gibi yetiştirmiştir"},{"number":18,"text":"Sonra sizi oraya döndürür ve yine oradan çıkarır"},{"number":19,"text":"Yeryüzünde dolaşabilmeniz, orada yollar ve geniş geçitlerden geçebilmeniz için, onu size yayan O'dur"},{"number":20,"text":"Yeryüzünde dolaşabilmeniz, orada yollar ve geniş geçitlerden geçebilmeniz için, onu size yayan O'dur"},{"number":21,"text":"Nuh: \"Rabbim! Doğrusu bunlar bana baş kaldırdılar ve malı, çocuğu kendisine sadece zarar getiren kimseye uydular; birbirinden büyük düzenler kurdular\" dedi"},{"number":22,"text":"Nuh: \"Rabbim! Doğrusu bunlar bana baş kaldırdılar ve malı, çocuğu kendisine sadece zarar getiren kimseye uydular; birbirinden büyük düzenler kurdular\" dedi"},{"number":23,"text":"İnsanlara: \"Sakın tanrılarınızı bırakmayın, Ved, Suva, Yağus, Yeuk ve Nesr putlarından asla vazgeçmeyin\" dediler"},{"number":24,"text":"Böylece birçoğunu saptırdılar; Rabbim! Sen bu zalimlerin sadece şaşkınlığını artır"},{"number":25,"text":"Onlar, günahları yüzünden suda boğuldular; ateşe sokuldular, kendilerine Allah'tan başka yardımcı bulamadılar"},{"number":26,"text":"Nuh dedi ki: \"Rabbim! Yeryüzünde hiçbir inkarcı bırakma"},{"number":27,"text":"Doğrusu Sen onları bırakırsan kullarını saptırırlar; sadece ahlaksız ve çok inkarcıdan başkasını doğurup yetiştirmezler"},{"number":28,"text":"Rabbim! Beni, anamı, babamı, evime inanmış olarak gireni, inanan erkek ve kadınları bağışla; zalimlerin de yalnız helakını artır"}]}