{"id":73,"ayahs":[{"number":1,"text":"And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (When the heaven is split asunder): '(When the heaven is split asunder) by the clouds because of the descent of the Lord-a descent without any modality-and the angels and whatever Allah wills of His command."},{"number":10,"text":"(But whoso is given his account) the account of his evil deeds (behind his back) in his left hand, referring here to al-Aswad Ibn 'Abd al-Asad, the brother of Abu Salamah,"},{"number":11,"text":"(He surely will invoke destruction"},{"number":12,"text":"And be thrown to scorching fire."},{"number":13,"text":"He verily lived joyous with his folk) he was happy with his folk,"},{"number":14,"text":"(He verily deemed that he would never return (unto Allah)) in the Hereafter."},{"number":15,"text":"(Nay, but lo! his Lord) when He created him (is ever looking on him!) knew that He will raise him again after death"},{"number":16,"text":"(Oh, I swear by the afterglow of sunset,"},{"number":17,"text":"And by the night and all that it enshroudeth) and I swear by the night and that which returns to its place when the night falls,"},{"number":18,"text":"(And by the moon when she is at the full) for three nights: the nights of the thirteenth, fourteenth and fifteenth of the lunar month"},{"number":19,"text":"(That ye shall journey) the whole creation shall be transformed (on from plane to plane) from one state to another; from the time He created them until the time they die, and from the time they die until they enter either Paradise or hell: in all these times Allah transforms them from one state to another; it is also said that this means: you shall journey, O Muhammad, from one heaven to another on the day of the ascent; and it is also said that this means: this denier will go from one state to another, from the time he dies until he enters the Fire."},{"number":2,"text":"(And attentive) and it obeys and listens (to her Lord in fear) and it befits her to do so,"},{"number":20,"text":"(What aileth them) the disbelievers of Mecca; and it is said this refers to the three sons of 'Abd Yalayl al-Thaqafi: Mas'ud, Habib and Rabi'ah, the last two had later on accepted Islam (then, that they believe not) in Muhammad (pbuh) and the Qur'an."},{"number":21,"text":"(And, when the Qur'an is recited unto them) and when Muhammad (pbuh) recites the Qur'an to them explaining the commands and prohibitions, (worship not (Allah)) do not submit to Allah by believing in Allah's divine Oneness?"},{"number":22,"text":"(Nay, but those who disbelieve) the disbelievers of Mecca and those among the sons of 'Abd Yalayl who did not believe (will deny) will disbelieve in Muhammad (pbuh) and the Qur'an;"},{"number":23,"text":"(And Allah knoweth best what they are hiding) and Allah knows best what they say and do; and it is also said this means: Allah knows best what they hear and hide in their hearts."},{"number":24,"text":"(So give them) so give, O Muhammad, to those who disbelieve in Allah (tidings of a painful doom) whose pain will extend to their hearts on the Day of Badr as well as in the Hereafter,"},{"number":25,"text":"Allah then exempted from these the believers, saying: (Save those who believe) in Muhammad (pbuh) and the Qur'an (and do good works) and do acts of obedience privately between themselves and their Lord, (for theirs is a reward) in Paradise (unfailing) undiminished and unblemished; it is also said this means: they will not be constantly reminded about the blessings bestowed upon them; and it is also said this means: their good deeds will not be decreased after they reach old age or after they die'."},{"number":3,"text":"(And when the earth is spread out) like the spreading out of a flat plain; and it is also said this means: when the earth is removed from its place and then flattened."},{"number":4,"text":"(And hath cast out all that was in her) of corpses and treasures, (and is empty) from all of that"},{"number":5,"text":"(And attentive) and obeys and listens (to her Lord in fear!) and it behoves her do so."},{"number":6,"text":"(Thou, verily, O man) O disbelieving man, in reference to Abu'l-Aswad Ibn Kildah Ibn Usayd Ibn Khalaf, (art working) He says: you are working something in your state of disbelief and shall return with it (towards thy Lord) in the Hereafter (a work which you will meet (in His presence)) whether your work is righteous or evil."},{"number":7,"text":"(Then whoso is given his account) the account of his good works (in his right hand) in reference here to Abu Salamah Ibn 'Abd al-Asad"},{"number":8,"text":"(He truly will receive an easy reckoning) this refers to his parade before Allah"},{"number":9,"text":"(And will return) in the Hereafter (unto his folk) whom Allah prepared for him in Paradise (in joy) with them."}]}