{"id":73,"ayahs":[{"number":1,"text":"And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (Hath there come unto you): '(Hath there come unto you) He says: it has not come unto you, O Muhammad, before but now it has; it is also said that this means: it has come unto you (tidings of the Overwhelming) the news of the coming of the Hour? It is also said the Overwhelming refers to the Fire overwhelming its dwellers."},{"number":10,"text":"(In a high Garden) in a high rank"},{"number":11,"text":"(Where) in Paradise (they hear no idle speech) any oath whether it is true or false,"},{"number":12,"text":"(Wherein) in Paradise (is a gushing spring) gushing with goodness, grace and mercy for them,"},{"number":13,"text":"(Wherein) in Paradise (are couches raised) in the air for as long as its owners are away; it is also said that they are raised for its people."},{"number":14,"text":"(And goblets) round goblets that do not have handles, ears or nooses (set at hand) in their dwellings."},{"number":15,"text":"(And cushions ranged) against each other."},{"number":16,"text":"(And silken carpets spread) for its owners."},{"number":17,"text":"When the Prophet (pbuh) informed them of this, the disbelievers of Mecca said: \" Bring us a sign to prove that Allah has sent you to us as a Messenger \". Therefore Allah said: (Will they not regard the camels, how they are created) with their strength and power, carrying burdens that no one else can carry?"},{"number":18,"text":"(And the heaven, how it is raised) how it is raised above creation, and no one can touch it?"},{"number":19,"text":"(And the hills, how they are set up) on earth, unmoved?"},{"number":2,"text":"(On that day) the Day of Judgement ((many) faces) the faces of the disbelievers and hypocrites (will be downcast) abased because of the chastisement,"},{"number":20,"text":"(And the earth, how it is spread) over water? All these are signs for them."},{"number":21,"text":"(Remind them) admonish them, (for thou art but a remembrancer) you are but a warner by means of the Qur'an; it is also said that this means: you are only an admonisher by the Qur'an and through Allah,"},{"number":22,"text":"(Thou art not) O Muhammad (at all a warder over them) you are not imposed on them such that you force them to accept faith."},{"number":23,"text":"Later on, Allah commanded him to fight them, saying: (But whoso is averse and disbelieveth) except he who turns away from faith and disbelieves in Allah,"},{"number":24,"text":"(Allah will punish him) in the Hereafter (with direst punishment) i.e. with the punishment of the Fire."},{"number":25,"text":"(Lo! unto Us is their return) in the Hereafter."},{"number":26,"text":"(And Ours their reckoning) their steadfastness in the life of the world and reward and punishment in the Hereafter'."},{"number":3,"text":"(Toiling) dragged in the Fire, (weary) in tiredness and strife; it is also said this means: toiling in the life of the world, weary in the Hereafter, this refers to the Christian monks and anchorites, and it is also said it refers to the Kharijites."},{"number":4,"text":"(Scorched by burning fire) they enter the Fire whose heat is extreme,"},{"number":5,"text":"(Drinking) in the Fire (from a boiling spring),"},{"number":6,"text":"(No food for them) in those abysmal pits (save bitter thorn fruit) the shabraq plant which grows in the roads of Mecca, which is eaten by camels when it is soft but when it is hard it becomes like the claws of cats."},{"number":7,"text":"(Which doth not nourish nor release from hunger) when one eats it."},{"number":8,"text":"(In that day other faces) the faces of true believers (will be calm) beautiful and radiant,"},{"number":9,"text":"(Glad for their effort past) He says: they are pleased with the reward of their works,"}]}