{"page":353,"ayahs":[{"surahNumber":24,"surahName":"سُورَةُ النُّورِ","surahEnglishName":"An-Noor","ayahNumber":28,"text":"فَاِنْ لَّمْ تَجِدُوْا فِیْهَاۤ اَحَدًا فَلَا تَدْخُلُوْهَا حَتّٰی یُؤْذَنَ لَكُمْ ۚ وَاِنْ قِیْلَ لَكُمُ ارْجِعُوْا فَارْجِعُوْا هُوَ اَزْكٰی لَكُمْ ؕ وَاللّٰهُ بِمَا تَعْمَلُوْنَ عَلِیْمٌ ۟","juz":18,"ruku":304,"hizbQuarter":141,"sajda":false,"isSurahStart":false},{"surahNumber":24,"surahName":"سُورَةُ النُّورِ","surahEnglishName":"An-Noor","ayahNumber":29,"text":"لَیْسَ عَلَیْكُمْ جُنَاحٌ اَنْ تَدْخُلُوْا بُیُوْتًا غَیْرَ مَسْكُوْنَةٍ فِیْهَا مَتَاعٌ لَّكُمْ ؕ وَاللّٰهُ یَعْلَمُ مَا تُبْدُوْنَ وَمَا تَكْتُمُوْنَ ۟","juz":18,"ruku":304,"hizbQuarter":141,"sajda":false,"isSurahStart":false},{"surahNumber":24,"surahName":"سُورَةُ النُّورِ","surahEnglishName":"An-Noor","ayahNumber":30,"text":"قُلْ لِّلْمُؤْمِنِیْنَ یَغُضُّوْا مِنْ اَبْصَارِهِمْ وَیَحْفَظُوْا فُرُوْجَهُمْ ؕ ذٰلِكَ اَزْكٰی لَهُمْ ؕ اِنَّ اللّٰهَ خَبِیْرٌ بِمَا یَصْنَعُوْنَ ۟","juz":18,"ruku":304,"hizbQuarter":141,"sajda":false,"isSurahStart":false},{"surahNumber":24,"surahName":"سُورَةُ النُّورِ","surahEnglishName":"An-Noor","ayahNumber":31,"text":"وَقُلْ لِّلْمُؤْمِنٰتِ یَغْضُضْنَ مِنْ اَبْصَارِهِنَّ وَیَحْفَظْنَ فُرُوْجَهُنَّ وَلَا یُبْدِیْنَ زِیْنَتَهُنَّ اِلَّا مَا ظَهَرَ مِنْهَا وَلْیَضْرِبْنَ بِخُمُرِهِنَّ عَلٰی جُیُوْبِهِنَّ ۪ وَلَا یُبْدِیْنَ زِیْنَتَهُنَّ اِلَّا لِبُعُوْلَتِهِنَّ اَوْ اٰبَآىِٕهِنَّ اَوْ اٰبَآءِ بُعُوْلَتِهِنَّ اَوْ اَبْنَآىِٕهِنَّ اَوْ اَبْنَآءِ بُعُوْلَتِهِنَّ اَوْ اِخْوَانِهِنَّ اَوْ بَنِیْۤ اِخْوَانِهِنَّ اَوْ بَنِیْۤ اَخَوٰتِهِنَّ اَوْ نِسَآىِٕهِنَّ اَوْ مَا مَلَكَتْ اَیْمَانُهُنَّ اَوِ التّٰبِعِیْنَ غَیْرِ اُولِی الْاِرْبَةِ مِنَ الرِّجَالِ اَوِ الطِّفْلِ الَّذِیْنَ لَمْ یَظْهَرُوْا عَلٰی عَوْرٰتِ النِّسَآءِ ۪ وَلَا یَضْرِبْنَ بِاَرْجُلِهِنَّ لِیُعْلَمَ مَا یُخْفِیْنَ مِنْ زِیْنَتِهِنَّ ؕ وَتُوْبُوْۤا اِلَی اللّٰهِ جَمِیْعًا اَیُّهَ الْمُؤْمِنُوْنَ لَعَلَّكُمْ تُفْلِحُوْنَ ۟","juz":18,"ruku":304,"hizbQuarter":141,"sajda":false,"isSurahStart":false}]}