{"number":29,"edition":"nl.keyzer","ayahs":[{"number":1,"text":"M"},{"number":2,"text":"Verbeelden zich de menschen, dat het toereikend voor hen is, te zeggen: Wij gelooven, zonder dat zij beproefd zijn"},{"number":3,"text":"Wij beproefden vroeger degenen, die hun voorafgingen; want God kent zekerlijk hen die oprecht zijn, en hij zal voorzeker de leugenaars kennen"},{"number":4,"text":"Denken zij, die kwaad bedrijven, dat zij ons zullen verhinderen, wraak op hen te nemen? Zij oordeelen slecht"},{"number":5,"text":"Voor hen, die hopen God te ontmoeten, zal Gods bepaalde tijd zekerlijk komen, en hij hoort en weet alles"},{"number":6,"text":"Wie er naar streeft, den waren godsdienst voort te planten, streeft naar het voordeel van zijne eigene ziel; want God heeft geen zijner schepselen noodig"},{"number":7,"text":"En wat degene betreft, die gelooven en rechtvaardig handelen, wij zullen hunne slechte daden uitwisschen, en wij zullen hun eene belooning geven, overeenkomstig de grootste verdiensten hunner daden"},{"number":8,"text":"Wij hebben den mensch bevolen, eerbiedig omtrent zijne ouders te zijn, maar indien zij trachten u over te halen, om datgene met mij te vereenigen, waarvan gij geene kennis hebt, gehoorzaam hen niet. Tot mij zult gij terugkeeren, en ik zal u verklaren wat gij gedaan hebt"},{"number":9,"text":"Hen, die gelooven en rechtvaardig handelen, zullen wij zekerlijk onder de godvruchtigen het paradijs binnenleiden"},{"number":10,"text":"Er zijn sommige menschen die zeggen: Wij gelooven in God; maar als zulk een voor Gods zaak wordt beproefd, schat hij de vervolging der menschen even smartelijk, als de straf van God. Als u God eenig voordeel schenkt, zeggen zij: Waarlijk wij zijn met u. Weet God dan niet wat in de borst zijner schepselen schuilt"},{"number":11,"text":"Waarlijk God kent de ware geloovigen wel en hij kent de huichelaars"},{"number":12,"text":"De ongeloovigen zeggen tot hen die gelooven: Volg onzen weg, en wij zullen uwe zonden dragen. Zij zullen echter geenerlei deel hunner zonden dragen; want zij zijn leugenaars"},{"number":13,"text":"Maar zij zullen zekerlijk hunne eigene lasten dragen, en andere lasten buiten hunne eigene; en zij zullen op den dag der opstanding nopens datgene onderzocht worden, wat zij valschelijk hebben uitgedacht"},{"number":14,"text":"Wij zonden vroeger Noach tot zijn volk, en hij bleef duizend jaren min vijftig jaren onder hen, en de zondvloed nam hen weg, omdat zij onrechtvaardig handelden"},{"number":15,"text":"Maar wij bevrijden hen en degenen, welke met hem in de ark waren, en wij maakten die tot een teeken voor alle schepselen"},{"number":16,"text":"Wij zonden ook Abraham. Hij zeide tot zijn volk: Dient God en vreest hem; dat zal beter voor u zijn, indien gij het begrijpt"},{"number":17,"text":"Gij aanbidt slechts afgoden naast God en denkt leugens uit. Waarlijk, zij welke gij naast God vereert, zijn niet in staat u het noodige te geven. Zoekt dus het noodige bij God, dient hem, en weest dankbaar; tot hem zult gij terugkeeren"},{"number":18,"text":"Indien gij mij van bedrog beschuldigt, waarlijk vele volkeren vóór u hebben hunne profeten eveneens van bedrog beschuldigd, maar alleen het openbaar prediken, is den gezant als plicht opgelegd"},{"number":19,"text":"Zien zij niet hoe God alle schepselen voortbrengt en die later doet herleven? Waarlijk dit is voor God gemakkelijk"},{"number":20,"text":"Zeg: Ga over de aarde en zie hoe hij oorspronkelijk schepselen voortbrengt, daarna zal God hen door een nieuwe schepping doen herleven; want God is almachtig"},{"number":21,"text":"Hij zal straffen naar zijn welbehagen, en hij zal genade hen voor dengeen die hem behaagt. Op den dag des oordeels zult gij voor hem worden gebracht"},{"number":22,"text":"En gij zult zijn bereik niet ontkomen: noch op aarde, noch in den hemel. Nimmer zult gij eenigen schuts of verdediger buiten God hebben"},{"number":23,"text":"Wat hen betreft, die niet in Gods teekenen gelooven, of daaraan, dat zij hem bij de opstanding zullen ontmoeten, deze zullen aan mijne genade wanhopen, en voor hen is eene pijnlijke straf gereed gemaakt"},{"number":24,"text":"En het antwoord van zijn volk was slechts dat zij zeiden: Doodt of verbrandt hem. Maar God redde hem van het vuur. Waarlijk, hierin waren teekenen voor hen die geloofden"},{"number":25,"text":"En Abraham zeide: Gij hebt afgoden naast God gekozen, uit gehechtheid aan dit leven, welke bij u bestaat: maar op den dag der opstanding zal de een uwer den ander verloochenen, en de een van u zal den ander vloeken; het hellevuur zal uw verblijf wezen, en er zal niemand zijn om u te bevrijden"},{"number":26,"text":"Lot geloofde in hem. En Abraham zeide: Waarlijk, ik vlucht van mijn volk naar de plaats welke mijn Heer mij heeft bevolen; want hij is de Machtige, de Wijze"},{"number":27,"text":"En wij gaven hem Izaäk en Jacob, en wij plaatsten onder zijne nakomelingen het geschenk der profetie en de schriften; wij gaven hem zijne belooning in deze wereld, en in de volgende zal hij een der rechtvaardigen wezen"},{"number":28,"text":"Wij zonden ook Lot, toen hij tot zijn volk zeide: Bedrijft gij eene zonde, welke nog geen volk voor u heeft bedreven"},{"number":29,"text":"Nadert gij vol lusten de mannen; valt gij hen op de groote wegen aan en begaat gij zonde in uwe vergaderingen? En het antwoord van zijn volk was geen ander, dan dat zij zeiden: Doe de wraak Gods op ons nederkomen, indien gij de waarheid spreekt"},{"number":30,"text":"Lot zeide: O Heer! verdedig mij tegen dit bedorven volk"},{"number":31,"text":"En toen onze gezanten met goede tijdingen tot Abraham kwamen, zeiden zij: Wij zullen zekerlijk de inwoners van deze stad verdelgen; want hare bewoners zijn zondaren"},{"number":32,"text":"Abraham antwoordde: Waarlijk, Lot woont daar. Zij hernamen: Wij weten wel wie daarin woont; wij zullen hem en zijn gezin zekerlijk bevrijden behalve zijne vrouw: zij zal eene van degenen zijn, die achterblijven"},{"number":33,"text":"En toen onze gezanten tot Lot kwamen, was hij bedroefd om hen, en zijn arm was onmachtig om hen te verdedigen. Maar zij zeiden: Vrees niet en wees niet treurig; want wij zullen u en uw gezin bevrijden, behalve uwe vrouw; want zij zal eene wezen van hen, die achterblijven"},{"number":34,"text":"Wij zullen zekerlijk de wraak des hemels over de bewoners dezer stad brengen, omdat zij zondaren waren"},{"number":35,"text":"En wij hebben daarvan een duidelijk teeken gelaten voor hen die begrijpen willen"},{"number":36,"text":"En tot de bewoners van Madian zonden wij hunnen broeder Shoaib, en hij zeide tot hen: O mijn volk? dient God, verwacht den laatsten dag en zondigt niet, door snood op aarde te handelen"},{"number":37,"text":"Maar zij beschuldigden hem van bedrog, waardoor een storm van den hemel hen overviel; en des ochtends werden zij in hunne woningen dood en voorover liggende gevonden"},{"number":38,"text":"En wij verdelgden ook de stammen van Ad en Thamoed; en gij weet wel wat er nog van hunne woningen is overgebleven. En Satan deed hen hunne werken goed vinden en wendde hen zijwaarts van den weg der waarheid, hoewel zij doorzicht hadden"},{"number":39,"text":"Ook verdelgden wij Karoen, en Pharao en Haman. Mozes kwam tot hem met duidelijke wonderen. Zij gedroegen zich echter onbeschaamd op de aarde; maar zij konden onze wraak niet ontkomen"},{"number":40,"text":"Hen allen verdelgden wij in hunne zonden. Tegen sommigen hunner zonden wij een hevigen wind, sommigen werden door een vreeselijken orkaan van den hemel verdelgd, sommigen deden wij door de aarde verzwelgen en sommigen van hen verdronken wij. Nimmer was God geneigd hen onrechtvaardig te behandelen, maar zij handelden onrechtvaardig met hunne eigene zielen"},{"number":41,"text":"Degenen, die andere beschermers naast God nemen, gelijken op de spinnekop, die zelve zich eene woning vervaardigt: maar het zwakste van alle huizen is zekerlijk dat van een spinnekop, indien zij dit wisten"},{"number":42,"text":"God kent echter de dingen, welke zij buiten hem aanroepen, en hij is de Machtige, de Wijze"},{"number":43,"text":"Deze vergelijking stellen wij den menschen voor; maar niemand verstaat die; behalve de denkende"},{"number":44,"text":"God heeft de hemelen en de aarde in waarheid geschapen; waarlijk, hierin is een teeken voor de ware geloovigen"},{"number":45,"text":"Herdenkt wat u van het boek des Korans werd geopenbaard, en weest standvastig in het gebed; want het gebed behoedt den mensch voor vele misdaden en voor hetgeen laakbaar is, en de herdenkingen van God is zeker een der belangrijkste plichten: God weet wat gij doet"},{"number":46,"text":"Twist niet met hen die de schriften hebben ontvangen dan op de zachtste wijze, behalve met diegene van hen, welke zich slecht tegenover u gedragen, en zeg: Wij gelooven in de openbaring, welke ons werd nedergezonden en ook in hetgeen u werd nedergezonden. Onze God en uw God is één, en hem zijn wij onderworpen"},{"number":47,"text":"Zoo hebben wij u het boek van den Koran nedergezonden, en zij aan wie wij de vroegere schriften hebben gegeven, gelooven daarin; en onder deze Arabieren zijn er ook die daarin gelooven, en niemand verwerpt onze teekenen, behalve de hardnekkige ongeloovigen"},{"number":48,"text":"Gij kondt geen (goddelijk) boek voor dit lezen, noch kondt gij het met uwe rechterhand schrijven. Toen zouden de tegensprekers terecht aan den goddelijken oorsprong daarvan hebben getwijfeld"},{"number":49,"text":"Maar het geeft duidelijke teekens in de borst dergenen die verstand hebben ontvangen; want niemand verwerpt onze teekenen; behalve de onrechtvaardigen"},{"number":50,"text":"Zij zeggen: Zoolang geen teeken van zijn Heer wordt nedergezonden, zullen wij niet gelooven. Antwoord: Teekenen zijn alleen in de macht van God, en ik ben slechts een openbaar prediker"},{"number":51,"text":"Is het niet toereikend voor hen, dat wij u het boek van den Koran hebben nedergezonden om hun voorgelezen te worden? Waarlijk, hierin is eene genade en eene vermaning voor hen die gelooven"},{"number":52,"text":"Zeg: God is een toereikende getuige tusschen mij en u. Hij kent alles wat in den hemel en op aarde is, en zij die in ijdele afgoden gelooven en God loochenen, zullen gestraft worden"},{"number":53,"text":"Zij zullen van u eischen, dat gij de straf verhaast, welke zij u tarten op hen te doen nederkomen. Indien er echter geen bepaalde tijd voor hun uitstel ware geweest, zou de straf reeds op hen zijn nedergekomen; maar zij zal hen zekerlijk plotseling overvallen, en zij zullen het niet voorzien"},{"number":54,"text":"Zij eischen van u, dat gij spoedig een wraak op hen zult doen nederkomen; maar de hel zal de ongeloovigen zekerlijk omringen"},{"number":55,"text":"Op een zekeren dag zal hunne straf hen plotseling overvallen; zoowel van boven hen als van onder hunne voeten zal God hun toeroepen: Proef de vergelding van hetgeen gij hebt bedreven"},{"number":56,"text":"O mijne dienaren, die geloofd hebt; waarlijk, mijne aarde is ruim; dient mij dus"},{"number":57,"text":"Iedere ziel zal den dood ondergaan; daarna zult gij tot ons terug keeren"},{"number":58,"text":"En wat hen betreft die geloofd en rechtvaardigheid uitgeoefend zullen hebben, wij zullen hen zekerlijk in de hoogere gedeelten van het paradijs huisvesten; rivieren zullen onder hen stroomen, en eeuwig zullen zij daar verblijven. Hoe heerlijk zal de belooning zijn van hen, die rechtvaardigheid hebben uitgeoefend"},{"number":59,"text":"Die met geduld volharden en hun vertrouwen in den Heer stellen"},{"number":60,"text":"Hoe vele dieren zijn er niet die voor hun voedsel niet zorgen? God is het die hen en u voorziet, en hij hoort en kent alles"},{"number":61,"text":"Waarlijk, indien gij de bewoners van Mekka vraagt: Wie heeft de hemelen en de aarde geschapen, en de zon en de maan gedwongen hunnen loop te volgen? zullen zij antwoorden: God. Waarom liegen zij dan in de erkenning van andere goden"},{"number":62,"text":"God voorziet diegenen zijner dienaren met overvloed welke hem behagen, en is karig omtrent hen indien het hem behaagt; want God is alwetend"},{"number":63,"text":"Waarlijk, indien gij hun vraagt: Wie zendt den regen van den hemel en verkwikt daardoor de aarde, nadat die reeds dood was? zullen zij antwoorden: God. Zeg: God zij geloofd! Maar het grootste deel hunner begrijpen niet"},{"number":64,"text":"Het tegenwoordige leven is slechts een tijdverdrijf en een spel; maar het toekomstige verblijf in het paradijs is het werkelijke leven. Indien zij dit wisten, zouden zij het eerste niet boven het laatste verkiezen"},{"number":65,"text":"Als zij in een schip zeilen, roepen zij God aan, en belijden hem oprechtelijk den waren godsdienst; maar als hij hen veilig aan land brengt, keeren zij tot hunnen afgodendienst terug"},{"number":66,"text":"Om zich ondankbaar te betoonen voor datgene wat wij hun hebben geschonken, en opdat zij de vermaken van dit leven zouden mogen genieten; maar hierna zullen zij de ontknooping kennen"},{"number":67,"text":"Zien zij niet dat wij het grondgebied van Mekka tot eene onschendbare en zekere wijkplaats hebben gemaakt, terwijl de menschen in den omtrek worden geplunderd? Gelooven zij daarom in datgene wat ijdel is, en erkennen niet Gods goedheid"},{"number":68,"text":"Maar wie is onrechtvaardiger dan hij die eene logen tegen God uitdenkt, of de waarheid loochent, nadat die tot hem is gekomen? Is de hel niet het verblijf voor de ongeloovigen"},{"number":69,"text":"Wie zijne uiterste pogingen aanwendt om onzen waren godsdienst voort te planten, dien zullen wij op onze wegen leiden; want God is met den rechtvaardige"}]}