{"number":68,"edition":"nl.keyzer","ayahs":[{"number":1,"text":"Noen. (Ik zweer) bij de pen en wat zij (de menschen) schrijven"},{"number":2,"text":"Gij, o Mahomet! zijt, door de genade van uwen Heer, geen bezetene"},{"number":3,"text":"Waarlijk, er is u eene eeuwige belooning gereed gemaakt"},{"number":4,"text":"Want gij hebt een verheven karakter"},{"number":5,"text":"Gij zult zien en de ongeloovigen zullen het zien"},{"number":6,"text":"Wie uwer van zijne zinnen is beroofd"},{"number":7,"text":"Waarlijk, uw Heer kent hen wel, die zijn pad verlaat, en hij kent hen wel, die op den rechten weg geleid worden"},{"number":8,"text":"Gehoorzaam hen dus niet, die u van bedrog beschuldigen"},{"number":9,"text":"Zij begeeren, dat gij hen met zachtheid zoudt behandelen, en dan zouden zij u ook met zachtheid behandelen"},{"number":10,"text":"Maar geloof niemand die ieder oogenblik zweert en een verachtelijke is"},{"number":11,"text":"Luister niet naar den lasteraar, die met leugens omgaat"},{"number":12,"text":"Die verbiedt wat goed is; die een overtreder, een snoodaard is"},{"number":13,"text":"De onmeêdoogende en buitendien van onreine geboorte"},{"number":14,"text":"Zelfs indien hij rijkdommen en vele kinderen heeft"},{"number":15,"text":"Als hem onze teekenen herinnerd worden, zegt hij: Dit zijn fabelen van de ouden"},{"number":16,"text":"Wij zullen een vurig kenteeken op zijn neus drukken"},{"number":17,"text":"Waarlijk, wij hebben de bewoners van Mekka beproefd, zooals wij vroeger de eigenaars van den tuin beproefden, toen zij zwoeren, dat zij de vruchten daarvan des ochtends zouden verzamelen"},{"number":18,"text":"En er de uitzondering niet bijvoegden: Indien het Gode behaagt"},{"number":19,"text":"En de tuin werd door eene verwoesting van uwen Heer overvallen, terwijl zij sliepen"},{"number":20,"text":"En des ochtends was die, als een tuin waarvan de vruchten reeds verzameld waren"},{"number":21,"text":"En zij riepen elkander, toen zij des morgens opstonden, zeggende"},{"number":22,"text":"Ga vroeg naar uwe beplanting, indien gij voornemens zijt de vruchten daarvan te verzamelen"},{"number":23,"text":"Daarop gingen zij, terwijl zij elkander toefluisterden"},{"number":24,"text":"Geen arme zal heden uwen tuin binnentreden"},{"number":25,"text":"En zij vertrokken vroeg, met het voorgestelde doel, niets te geven"},{"number":26,"text":"Toen zij zagen dat de tuin verzengd en verwoest was, zeiden zij: Wij hebben ons zeker in den weg vergist"},{"number":27,"text":"(Maar toen zij bevonden dat het hun eigen tuin was), riepen zij uit: Waarlijk, het is ons niet geoorloofd (de vruchten daarvan te plukken)"},{"number":28,"text":"De verstandigste van hen zeide: Heb ik u niet gezegd: Waarom gedenkt gij God niet"},{"number":29,"text":"Zij antwoordden: Geloofd zij onze Heer! Waarlijk, wij waren zondaren"},{"number":30,"text":"En zij begonnen elkander te laken"},{"number":31,"text":"En zij zeiden: Wee over ons! waarlijk, wij waren zondaren"},{"number":32,"text":"Misschien zal onze Heer ons een beteren tuin dan dezen in ruiling geven; en wij smeeken onzen Heer ernstig, ons vergiffenis te schenken"},{"number":33,"text":"Dit is de kastijding van dit leven; maar de kastijding van het volgende leven zal gestrenger zijn. Indien zij het geweten hadden, zouden zij zich in acht genomen hebben"},{"number":34,"text":"Waarlijk, voor de vromen zijn, door hunnen Heer, heerlijke tuinen gereed gemaakt"},{"number":35,"text":"Zouden wij met de Moslems, even als met de zondaren handelen"},{"number":36,"text":"Wat scheelt u, dat gij aldus oordeelt"},{"number":37,"text":"Hebt gij een boek (van den hemel) waarin gij leest"},{"number":38,"text":"Dat gij datgene zult verkrijgen, wat gij zult verkiezen"},{"number":39,"text":"Of hebt gij eeden ontvangen, die ons op den dag der opstanding zullen binden, dat gij zult genieten wat gij u verbeeldt"},{"number":40,"text":"Vraag hun wie van hen dit waarborgt"},{"number":41,"text":"Of hebben zij makkers, die borg voor hen blijven? Laat hen dan hunne makkers toonen, indien zij de waarheid spreken"},{"number":42,"text":"Op een zekeren dag zal het been ontbloot worden, en zij zullen opgeroepen worden om te aanbidden; maar zij zullen daartoe niet in staat zijn"},{"number":43,"text":"Hunne oogen zullen nedergeslagen zijn en zij zullen door de schande worden gevolgd, omdat zij tot de vereering van God werden uitgenoodigd, terwijl zij in zekerheid waren, maar niet wilden hooren"},{"number":44,"text":"Spreek dus niet ten gunste van hen, die deze openbaring van bedrog beschuldigen. Wij zullen hen allengs tot de vernietiging voeren, langs wegen die zij niet kennen"},{"number":45,"text":"Ik zal hun een ruimen tijd verleenen; want mijne krijgslist is onfeilbaar"},{"number":46,"text":"Vraagt gij hun eenige belooning voor uwe prediking? Maar zij zijn met schulden beladen"},{"number":47,"text":"Zijn de geheimen der toekomst met hen, en schrijven zij die van de tafel van Gods besluiten af"},{"number":48,"text":"Wacht dus geduldig het oordeel van uwen Heer af, en wees niet zoo als hij, die door den visch werd verzwolgen toen hij God aanriep, terwijl hij innerlijk toornig was"},{"number":49,"text":"Had de genade van zijn Heer hem niet bereikt, dan ware hij zeker, met schaamte bedekt, op de naaste kust geworpen geworden"},{"number":50,"text":"Maar zijn Heer koos hem, en maakte hem tot een der rechtvaardigen"},{"number":51,"text":"Er ontbreekt slechts weinig aan, of de ongeloovigen zouden u met hunne arglistige blikken nederwerpen, als zij de vermaning van den Koran hooren; en zij zeggen: Hij is zekerlijk bezeten"},{"number":52,"text":"Maar hij (de Koran) is slechts eene vermaning aan alle schepselen"}]}