[{"hadith-eng":"Exhort to recite\" There is no god but Allah\" to those of you who are dying.","reference":"Sahih Muslim 916a, Book 11, Hadith 1","question #":"question #1","question":"What is the significance of reciting 'There is no god but Allah' at the time of death?","id":"muslim-11-1"},{"hadith-eng":"This hadith has been narrated by Sulaiman b. Bilal with the same chain of transmitters.","reference":"Sahih Muslim 916b, Book 11, Hadith 2","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-11-2"},{"hadith-eng":"Exhort to recite\" There is no god but Allah\" to those of you who are dying.","reference":"Sahih Muslim 917, Book 11, Hadith 3","question #":"question #1","question":"What is the significance of reciting 'There is no god but Allah' at the time of death?","id":"muslim-11-3"},{"hadith-eng":"If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (ﷺ). I then said the words, and Allah gave me God's Messenger (ﷺ) in exchange. She said: The Messenger of Allah (ﷺ) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).","reference":"Sahih Muslim 918a, Book 11, Hadith 4","question #":"question #1","question":"What is the significance of reciting 'We belong to Allah and to Him shall we return' during times of calamity?","id":"muslim-11-4"},{"hadith-eng":"If any servant (of Allah) who suffers a calamity says:\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" ' Allah will give him reward for affliction, and would give him something better than it in exchange. She (Umm Salama) said: When Abu Salama died. I uttered (these very words) as I was commanded (to do) by the Messenger of Allah (ﷺ). So Allah gave me better in exchange than him. i. e. (I was taken as the wife of) the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 918b, Book 11, Hadith 5","question #":"question #1","question":"What is the significance of reciting 'We belong to Allah and to Him shall we return' during times of calamity?","id":"muslim-11-5"},{"hadith-eng":"\" When Abu Salama died I said: Who is better than Abu Salama, the Companion of the Messenger of Allah (ﷺ), and Allah decided for me and I said (these words contained in the supplication mentioned above) and I was married to the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 918c, Book 11, Hadith 6","question #":"question #1","question":"What is the significance of supplication in seeking Allah's decision during times of personal loss?","id":"muslim-11-6"},{"hadith-eng":"Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Messenger of Allah (ﷺ) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).","reference":"Sahih Muslim 919, Book 11, Hadith 7","question #":"question #1","question":"What is the significance of supplicating for good when visiting the sick or the deceased?","id":"muslim-11-7"},{"hadith-eng":"The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.","reference":"Sahih Muslim 920a, Book 11, Hadith 8","question #":"question #1","question":"What is the significance of praying for the deceased in Islam?","id":"muslim-11-8"},{"hadith-eng":"(O Allah! ) let Thee be the caretaker of what is left by him, and he said: Grant him expansion of the grave, but he did not say: Make his grave spacious. Khalid said: He supplicated for the seventh (thing too) which I have forgotten.","reference":"Sahih Muslim 920b, Book 11, Hadith 9","question #":"question #1","question":"What is the significance of supplicating for the deceased in Islamic tradition?","id":"muslim-11-9"},{"hadith-eng":"Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.","reference":"Sahih Muslim 921a, Book 11, Hadith 10","question #":"question #1","question":"What is the significance of the eyes remaining open at the time of death in Islamic teachings?","id":"muslim-11-10"},{"hadith-eng":"This hadith is narrated on the authority of 'Ala' with the same chain of transmitters.","reference":"Sahih Muslim 921b, Book 11, Hadith 11","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-11-11"},{"hadith-eng":"When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (ﷺ) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.","reference":"Sahih Muslim 922, Book 11, Hadith 12","question #":"question #1","question":"What is the Islamic perspective on mourning and expressing grief for the deceased?","id":"muslim-11-12"},{"hadith-eng":"While we were with the Messenger of Allah (ﷺ), one of his daughters sent to him (the Messenger) to call him and inform him that her child or her son was dying. The Messenger of Allah (ﷺ) told the messenger to go back and tell her that what Allah had taken belonged to Him, and to him belonged what He granted; and He has an appointed time for everything. So you (the messenger) order her to show endurance and seek reward from Allah. The messenger came back and said: She adjures him to come to her. He got up to go accompanied by Sa'd b. 'Ubada, Mu'adh b. Jabal, and I also went along with them. The child was lifted to him and his soul was feeling as restless as if it was in an old (waterskin). His (Prophet's) eyes welled up with tears. Sa'd said: What is this, Messenger of Allah? He replied: This is compassion which Allah has placed in the hearts of His servants, and God shows compassion only to those of His servants who are compassionate.","reference":"Sahih Muslim 923a, Book 11, Hadith 13","question #":"question #1","question":"How does Islam view the concept of ownership and the temporary nature of worldly possessions?","id":"muslim-11-13"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters on the authority of 'Asim al-Ahwal.","reference":"Sahih Muslim 923b, Book 11, Hadith 14","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-14"},{"hadith-eng":"Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (ﷺ) wept. When the people saw Allah's Messenger (ﷺ) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.","reference":"Sahih Muslim 924, Book 11, Hadith 15","question #":"question #1","question":"What is the Islamic perspective on expressing emotions such as crying and grief?","id":"muslim-11-15"},{"hadith-eng":"While we were sitting with the Messenger of Allah (ﷺ), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (ﷺ) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (ﷺ) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (ﷺ) and his Companions with him came near him (Sa'd b. 'Ubada).","reference":"Sahih Muslim 925, Book 11, Hadith 16","question #":"question #1","question":"What is the significance of visiting the sick in Islam as demonstrated by the actions of the Prophet and his companions?","id":"muslim-11-16"},{"hadith-eng":"Endurance is to be shown at the first blow.","reference":"Sahih Muslim 926a, Book 11, Hadith 17","question #":"question #1","question":"What is the significance of showing endurance during the initial impact of a calamity?","id":"muslim-11-17"},{"hadith-eng":"Fear Allah and show endurance. She (not recognising him) said: You have not been afflicted as I have been. When he (the Holy Prophet) had departed, it was said to her that he was the Messenger of Allah (ﷺ), she was mortally shocked. She came to his door and she did not find doorkeepers at his door. She said: Messenger of Allah. I did not recognise you. He said: Endurance is to be shown at first blow, or at the first blow.","reference":"Sahih Muslim 926b, Book 11, Hadith 18","question #":"question #1","question":"What is the significance of showing patience and endurance during times of grief and hardship?","id":"muslim-11-18"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) happened to pass by a woman (who was sitting) by the side of a grave.\"","reference":"Sahih Muslim 926c, Book 11, Hadith 19","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) passing by a woman at a grave?","id":"muslim-11-19"},{"hadith-eng":"Be quiet, my daughter. Don't you know that the Messenger of Allah (ﷺ) had said:\" The deceased is punished because of his family's weeping over the death\"?","reference":"Sahih Muslim 927a, Book 11, Hadith 20","question #":"question #1","question":"What is the Islamic perspective on mourning and weeping for the deceased?","id":"muslim-11-20"},{"hadith-eng":"The dead is punished in the grave because of wailing on it.","reference":"Sahih Muslim 927b, Book 11, Hadith 21","question #":"question #1","question":"What are the consequences of wailing over the deceased according to Islamic teachings?","id":"muslim-11-21"},{"hadith-eng":"The same hadith is narrated on the authority of 'Umar through another chain of transmitters.","reference":"Sahih Muslim 927c, Book 11, Hadith 22","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-22"},{"hadith-eng":"When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the weeping of the living\"?","reference":"Sahih Muslim 927d, Book 11, Hadith 23","question #":"question #1","question":"What is the Islamic perspective on mourning and lamentation over the deceased?","id":"muslim-11-23"},{"hadith-eng":"O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of the living\"?","reference":"Sahih Muslim 927e, Book 11, Hadith 24","question #":"question #1","question":"What is the Islamic perspective on lamentation for the deceased?","id":"muslim-11-24"},{"hadith-eng":"What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (ﷺ) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).","reference":"Sahih Muslim 927f, Book 11, Hadith 25","question #":"question #1","question":"What is the Islamic perspective on lamenting over the deceased and its consequences?","id":"muslim-11-25"},{"hadith-eng":"O Hafsa, did you not hear the Messenger of Allah (ﷺ) saying:\" One who is lamented would be punished\"? Suhaib also lamented over him. 'Umar told him also: O Suhaib, didn't you know that one who is lamented is punished?","reference":"Sahih Muslim 927g, Book 11, Hadith 26","question #":"question #1","question":"What is the Islamic perspective on lamenting over the deceased?","id":"muslim-11-26"},{"hadith-eng":"I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (ﷺ) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (ﷺ) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.","reference":"Sahih Muslim 928a, 927h, 929a, Book 11, Hadith 27","question #":"question #1","question":"What is the Islamic perspective on lamentation and wailing over the deceased?","id":"muslim-11-27"},{"hadith-eng":"The daughter of 'Uthman b. 'Affan died in Mecca. We came to attend her (funeral). Ibn 'Umar and Ibn 'Abbas were also present there, and I was sitting between them. He added: I (first sat) by the side of one of them, then the other one came and he sat by my side. 'Abdullah b. 'Umar said to 'Amr b. 'Uthman who was sitting opposite to him: Will you not prevent the people from lamenting, for the Messenger of Allah (ﷺ) had said:\" The dead is punished because of the lamenting of his family for him\"? Ibn 'Abbas then said that Umar used to say someting of that nature, and then narrated saying: I proceeded from Mecca along with 'Umar till we reached al-Baida' and there was a party of riders under the shade of a tree. He said (to me): Go and find out who this party is. I cast a glance and there was Suhaib (in that party). So I informed him ('Umar) about it. He said: Call him to me. So I went back to Suhaib and said: Go and meet the Commander of the believers. When 'Umar was wounded, Suhaib came walling: Alas, for the brother! alas for the companion! 'Umar said: O Suhaib, do you wail for me, whereas the Messenger of Allah (ﷺ) said:\" The dead would be punished on account of the lamentation of the (members of his family)\"? Ibn 'Abbas said: When 'Umar died I made a mention of it to 'A'isha. She said: May Allah have mercy upon 'Umar! I swear by Allah that Allah's Messenger (ﷺ) never said that Allah would punish the believer because of the weeping (of any one of the members of his family), but he said that Allah would increase the punishment of the unbeliever because of the weeping of his family over him. 'A'isha said: The Qur'an is enough for you (when it states):\" No bearer of burden will bear another's burden\" (vi. 164). Thereupon Ibn 'Abbas said: Allah is He Who has caused laughter and weeping. Ibn Abu Mulaika said: By Allah, Ibn 'Umar said nothing.","reference":"Sahih Muslim 928b, 927i, 929b, Book 11, Hadith 28","question #":"question #1","question":"What is the Islamic perspective on lamenting for the deceased according to the companions of the Prophet?","id":"muslim-11-28"},{"hadith-eng":"We were with the bier of Umm Aban, daughter of 'Uthman, and the rest of the hadith is the same, but he did not narrate it as a marfu' hadith on the authority of 'Umar from the Messenger of Allah (ﷺ) as it was narrated by Ayyub and Ibn Juraij, and the hadith narrated by them (Ayyub and Ibn Juraij) is more complete than that of 'Amr.","reference":"Sahih Muslim 929c, Book 11, Hadith 29","question #":"question #1","question":"What is the significance of ensuring the completeness and accuracy of a hadith narration?","id":"muslim-11-29"},{"hadith-eng":"The dead is punished because of the lamentation of the living.","reference":"Sahih Muslim 930, Book 11, Hadith 30","question #":"question #1","question":"What are the consequences for the deceased when the living lament excessively?","id":"muslim-11-30"},{"hadith-eng":"May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (ﷺ) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.","reference":"Sahih Muslim 931, Book 11, Hadith 31","question #":"question #1","question":"What is the Islamic perspective on the impact of family members' actions on the deceased?","id":"muslim-11-31"},{"hadith-eng":"He (Ibn 'Umar) missed (the point). The Messenger of Allah (ﷺ) had (in fact) said: He (the dead) is punished for his faults or for his sins, and the members of his family are wailing for him now. (This misunderstanding of Ibn 'Umar is similar to his saying: ) The Messenger of Allah (ﷺ) stood by the well in which were lying the dead bodies of those polytheists who had been killed on the Day of Badr, and he said to them what he had to say, i. e.: They hear what I say. But he (Ibn 'Umar) misunderstood. The Prophet (ﷺ) had only said: They (the dead) understand that what I used to say to them was truth. She then recited:\" Certainly, thou canst not make the dead hear the call\" (xxvii. 80), nor can you make those hear who are in the graves, nor can you inform them when they have taken their seats in Hell.","reference":"Sahih Muslim 932a, Book 11, Hadith 32","question #":"question #1","question":"What is the significance of accurately understanding and conveying the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-11-32"},{"hadith-eng":"This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters. The hadith narrated by Abu Usama is more complete.","reference":"Sahih Muslim 932b, Book 11, Hadith 33","question #":"question #1","question":"How does the completeness of a narration affect its understanding and interpretation?","id":"muslim-11-33"},{"hadith-eng":"The dead is punished because of the lamentation of the living. Upon this 'A'isha said: May Allah have mercy upon the father of 'Abd al-Rahman (Ibn 'Umar). He did not tell a lie, but he forgot or made a mistake. The Messenger of Allah (ﷺ) happened to pass by a (dead) Jewess who was being lamented. Upon this he said: They weep over her and she is being punished in the grave.","reference":"Sahih Muslim 932c, Book 11, Hadith 34","question #":"question #1","question":"What is the Islamic perspective on the impact of lamentation by the living on the deceased?","id":"muslim-11-34"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.","reference":"Sahih Muslim 933a, Book 11, Hadith 35","question #":"question #1","question":"What are the consequences of lamentation for the deceased according to Islamic teachings?","id":"muslim-11-35"},{"hadith-eng":"A hadith like this has been narrated by Mughira b. Shu'ba from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 933b, Book 11, Hadith 36","question #":"question #1","question":"Who was Mughira b. Shu'ba in the context of hadith narration?","id":"muslim-11-36"},{"hadith-eng":"This hadith has been narrated from the Messenger of Allah (ﷺ) through another chain of transmitters.","reference":"Sahih Muslim 933c, Book 11, Hadith 37","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-37"},{"hadith-eng":"Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.","reference":"Sahih Muslim 934, Book 11, Hadith 38","question #":"question #1","question":"What are some pre-Islamic practices that are discouraged in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-11-38"},{"hadith-eng":"I was looking (at him) through the crevice of the door. A man came to him and mentioned that Ja'far's women were lamenting. He (the Holy Prophet) commanded him to go and forbid them (to do so). So he went away but came back and told (him) that they did not obey (him). He commanded him a second time to go and forbid them (to do so). He again went but came back to him and said: I swear by God, Messenger of Allah, that they have overpowered us. She ('A'isha) said that she thought the Messenger of Allah (ﷺ) had told (her) to throw dust in their mouths. Thereupon 'A'isha said: May Allah humble you! You did not do what Allah's Messenger (ﷺ) ordered you, nor did you stop annoying Allah's Messenger (ﷺ).","reference":"Sahih Muslim 935a, Book 11, Hadith 39","question #":"question #1","question":"What is the Islamic perspective on expressing grief and lamentation for the deceased?","id":"muslim-11-39"},{"hadith-eng":"\" You did not spare the Messenger of Allah (ﷺ) the botheration.\"","reference":"Sahih Muslim 935b, Book 11, Hadith 40","question #":"question #1","question":"What is the significance of sparing the Prophet Muhammad (ﷺ) from unnecessary botheration?","id":"muslim-11-40"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.","reference":"Sahih Muslim 936a, Book 11, Hadith 41","question #":"question #1","question":"What is the significance of taking an oath of allegiance in Islam?","id":"muslim-11-41"},{"hadith-eng":"Umm 'Atiyya reported that the Messenger of Allah (ﷺ) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) was Umm Sulaim.","reference":"Sahih Muslim 936b, Book 11, Hadith 42","question #":"question #1","question":"What is the significance of making and fulfilling pledges in Islam?","id":"muslim-11-42"},{"hadith-eng":"When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (ﷺ) said: (Yes) but only in case of the members of such a tribe.","reference":"Sahih Muslim 937, Book 11, Hadith 43","question #":"question #1","question":"What were the conditions included in the pledge taken by believing women during the time of the Prophet Muhammad (ﷺ)?","id":"muslim-11-43"},{"hadith-eng":"We were forbidden to follow the bier, but it was not made absolute on us.","reference":"Sahih Muslim 938a, Book 11, Hadith 44","question #":"question #1","question":"What is the ruling on women following a funeral procession in Islam?","id":"muslim-11-44"},{"hadith-eng":"We were refrained from following the bier, but it was not made absolute on us.","reference":"Sahih Muslim 938b, Book 11, Hadith 45","question #":"question #1","question":"What is the stance on women following funeral processions in Islamic teachings?","id":"muslim-11-45"},{"hadith-eng":"The Apostle of Allah (ﷺ) came to us when we were bathing his daughter, and he told us: Wash her with water and (with the leaves of) the lote tree, three or five times, or more than that if you think fit, and put camphor or something like camphor in the last washing; then inform me when you have finished. So when we had finished, we informed him, and he gave to us his (own) under-garment saying:\" Put it next her body.\"","reference":"Sahih Muslim 939a, Book 11, Hadith 46","question #":"question #1","question":"What are the Islamic guidelines for washing a deceased body before burial?","id":"muslim-11-46"},{"hadith-eng":"We braided her hair in three plaits.","reference":"Sahih Muslim 939b, Book 11, Hadith 47","question #":"question #1","question":"What is the significance of braiding hair in Islamic funeral practices?","id":"muslim-11-47"},{"hadith-eng":"One of the daughters of the Messenger of Allah (ﷺ) died. And in the hadith transmitted by Ibn 'Ulayya (the words are): The Messenger of Allah (ﷺ) came to us and we were washing his daughter. And in the hadith transmitted by Malik (the words are): There came in (our apartment) the Messenger of Allah (way peace be upon him) when his daughter died. The rest of the hadith is the same as narrated by Yazid b. Zurai' from Ayyub from Muhammad from Umm 'Atiyya.","reference":"Sahih Muslim 939c, Book 11, Hadith 48","question #":"question #1","question":"What are the Islamic rituals and practices associated with washing the deceased?","id":"muslim-11-48"},{"hadith-eng":"\" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority of Umm 'Atiyya: We braided (the hair) of her head in three plaits.","reference":"Sahih Muslim 939d, Book 11, Hadith 49","question #":"question #1","question":"What are the recommended practices for washing a deceased person's body in Islamic tradition?","id":"muslim-11-49"},{"hadith-eng":"We washed her an odd number of times, i. e. three, five or seven times; and Umm 'Atiyya (further) said: We braided her hair in three plaits.","reference":"Sahih Muslim 939e, Book 11, Hadith 50","question #":"question #1","question":"What is the significance of washing the deceased an odd number of times in Islamic funeral rites?","id":"muslim-11-50"},{"hadith-eng":"When Zainab the daughter of the Messenger of Allah (ﷺ) died, he said to us: Wash her odd number of times, i. e. three or five times, and put camphor or something-like camphor at the fifth time, and after you have washed her inform me. So we informed him and he gave us his under-garment, saying:\" Put it next her body.\"","reference":"Sahih Muslim 939f, Book 11, Hadith 51","question #":"question #1","question":"What is the significance of washing the deceased an odd number of times in Islamic funeral rites?","id":"muslim-11-51"},{"hadith-eng":"There came to us the Messenger of Allah (ﷺ) as we were washing one of his daughters. So he said: Wash her (dead body) an odd number of times, five times or more than that, the rest of the hadith is the same. She (further) said: We braided her hair in three plaits: (two) on the sides of her head and one on her forehead.","reference":"Sahih Muslim 939g, Book 11, Hadith 52","question #":"question #1","question":"What is the significance of washing the deceased an odd number of times in Islamic funeral rites?","id":"muslim-11-52"},{"hadith-eng":"Umm 'Atiyya reported that when the Messenger of Allah (ﷺ) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.","reference":"Sahih Muslim 939h, Book 11, Hadith 53","question #":"question #1","question":"What is the significance of starting from the right side when performing a ritual washing in Islamic practices?","id":"muslim-11-53"},{"hadith-eng":"Umm 'Atiyya reported that the Messenger of Allah (ﷺ) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.","reference":"Sahih Muslim 939i, Book 11, Hadith 54","question #":"question #1","question":"What is the significance of starting from the right side in Islamic rituals?","id":"muslim-11-54"},{"hadith-eng":"We migrated with the Messenger of Allah (ﷺ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (ﷺ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.","reference":"Sahih Muslim 940a, Book 11, Hadith 55","question #":"question #1","question":"What does this narration teach about the sacrifices made by early Muslims for their faith?","id":"muslim-11-55"},{"hadith-eng":"A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.","reference":"Sahih Muslim 940b, Book 11, Hadith 56","question #":"question #1","question":"What is the significance of having a consistent chain of transmitters in the narration of hadiths?","id":"muslim-11-56"},{"hadith-eng":"I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.","reference":"Sahih Muslim 941a, Book 11, Hadith 57","question #":"question #1","question":"What is the significance of the type and color of garments used for shrouding in Islamic tradition?","id":"muslim-11-57"},{"hadith-eng":"I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (ﷺ) was not shrouded! So he gave it in charity.","reference":"Sahih Muslim 941b, Book 11, Hadith 58","question #":"question #1","question":"What is the significance of the type of shroud used for burial in Islamic tradition?","id":"muslim-11-58"},{"hadith-eng":"This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah b. Abu Bakr.","reference":"Sahih Muslim 941c, Book 11, Hadith 59","question #":"question #1","question":"What is the significance of the chain of transmitters in the authenticity of a hadith?","id":"muslim-11-59"},{"hadith-eng":"I asked 'A'isha with how many garments the Messenger of Allah (ﷺ) was shourded. She said: With three garments of Sahul.","reference":"Sahih Muslim 941d, Book 11, Hadith 60","question #":"question #1","question":"How many garments were used to shroud the Prophet Muhammad (ﷺ) according to the narration?","id":"muslim-11-60"},{"hadith-eng":"When the Messenger of Allah (may peace be upom him) died, he was covered with a Yamani wrapper.","reference":"Sahih Muslim 942a, Book 11, Hadith 61","question #":"question #1","question":"What type of garment was used to cover the Prophet Muhammad (peace be upon him) after his passing?","id":"muslim-11-61"},{"hadith-eng":"This hadith has been narrated by Zuhri with the same chain of transmitters.","reference":"Sahih Muslim 942b, Book 11, Hadith 62","question #":"question #1","question":"What is the significance of having a consistent chain of transmitters in the authentication of hadiths?","id":"muslim-11-62"},{"hadith-eng":"Allah's Messenger (ﷺ) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (ﷺ) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (ﷺ) also said: When any one of you shrouds his brother, he should shroud him well.","reference":"Sahih Muslim 943, Book 11, Hadith 63","question #":"question #1","question":"What are the guidelines for conducting a funeral prayer according to Islamic teachings?","id":"muslim-11-63"},{"hadith-eng":"Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.","reference":"Sahih Muslim 944a, Book 11, Hadith 64","question #":"question #1","question":"What is the significance of hastening a funeral procession in Islamic tradition?","id":"muslim-11-64"},{"hadith-eng":"\" I do not know whether the hadith is marfu'.\"","reference":"Sahih Muslim 944b, Book 11, Hadith 65","question #":"question #1","question":"What is the significance of verifying the authenticity of a hadith in Islamic scholarship?","id":"muslim-11-65"},{"hadith-eng":"Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.","reference":"Sahih Muslim 944c, Book 11, Hadith 66","question #":"question #1","question":"What is the significance of hastening a funeral procession in Islamic tradition?","id":"muslim-11-66"},{"hadith-eng":"He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira reached him, he said:\" We have lost many qirats.\"","reference":"Sahih Muslim 945a, Book 11, Hadith 67","question #":"question #1","question":"What is the significance of attending a funeral prayer and staying until the burial in Islam?","id":"muslim-11-67"},{"hadith-eng":"\" two great mountains.\" No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abd al- A'la (the words are):\" till (the burial) is complete.\" In the hadith transmitted by 'Abd ar-Razzaq (the words are):\" till he is placed in the grave.\"","reference":"Sahih Muslim 945b, Book 11, Hadith 68","question #":"question #1","question":"What is the significance of the phrase 'two great mountains' in Islamic teachings?","id":"muslim-11-68"},{"hadith-eng":"\" He who followed it (the bier) till he (the dead) is buried.\"","reference":"Sahih Muslim 945c, Book 11, Hadith 69","question #":"question #1","question":"What is the significance of following a funeral procession in Islamic tradition?","id":"muslim-11-69"},{"hadith-eng":"He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.","reference":"Sahih Muslim 945d, Book 11, Hadith 70","question #":"question #1","question":"What is the significance of offering prayer over the deceased in Islam?","id":"muslim-11-70"},{"hadith-eng":"He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.","reference":"Sahih Muslim 945f, Book 11, Hadith 71","question #":"question #1","question":"What is the significance of verifying the authenticity of a hadith through multiple sources?","id":"muslim-11-71"},{"hadith-eng":"He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) said: Abu Huraira, what is a qirat? He said: It is like the hill of Uhud.","reference":"Sahih Muslim 945e, Book 11, Hadith 72","question #":"question #1","question":"What is the significance of offering prayer for the deceased in Islam?","id":"muslim-11-72"},{"hadith-eng":"Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (ﷺ) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.","reference":"Sahih Muslim 945g, Book 11, Hadith 73","question #":"question #1","question":"What is the significance of participating in funeral prayers and following the bier in Islam?","id":"muslim-11-73"},{"hadith-eng":"He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.","reference":"Sahih Muslim 946a, Book 11, Hadith 74","question #":"question #1","question":"What is the significance of offering prayer for the deceased in Islam?","id":"muslim-11-74"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) was asked about qirat, and he said: It is equivalent to Uhud.\"","reference":"Sahih Muslim 946b, Book 11, Hadith 75","question #":"question #1","question":"What is the significance of the term 'qirat' in Islamic teachings?","id":"muslim-11-75"},{"hadith-eng":"If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.","reference":"Sahih Muslim 947, Book 11, Hadith 76","question #":"question #1","question":"What is the significance of collective prayer in Islam, especially in the context of interceding for a deceased person?","id":"muslim-11-76"},{"hadith-eng":"So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (ﷺ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.","reference":"Sahih Muslim 948, Book 11, Hadith 77","question #":"question #1","question":"What is the significance of having forty people who do not associate anything with Allah in a funeral prayer?","id":"muslim-11-77"},{"hadith-eng":"There passed a bier (being carried by people) and it was lauded in good terms. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. 'Umar said: May my father and mother be ransom for you! There passed a bier and it was praised in good terms, and you said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words, and you said: It has become certain, it has become certain, it has become certain. Upon this the Messenger of Allah (way peace be upon him) said: He whom you praised in good terms, Paradise has become certain for him, and he whom you condemned in bad words, Hell has become certain for him. You are Allah's witnesses in the earth, you are Allah's witnesses in the earth, you are Allah's witnesses in the earth.","reference":"Sahih Muslim 949a, Book 11, Hadith 78","question #":"question #1","question":"What is the significance of community testimony in determining a person's fate in the afterlife?","id":"muslim-11-78"},{"hadith-eng":"This hadith has been narrated through another chain of transmitters.","reference":"Sahih Muslim 949b, Book 11, Hadith 79","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-79"},{"hadith-eng":"Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.","reference":"Sahih Muslim 950a, Book 11, Hadith 80","question #":"question #1","question":"What is the significance of death for a believing servant in Islam?","id":"muslim-11-80"},{"hadith-eng":"(The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.","reference":"Sahih Muslim 950b, Book 11, Hadith 81","question #":"question #1","question":"What is the significance of finding relief from worldly troubles for a believer?","id":"muslim-11-81"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) gave the people news of the death of Negus on the day he died, and he took them out to the place of prayer and observed four takbirs.","reference":"Sahih Muslim 951a, Book 11, Hadith 82","question #":"question #1","question":"What is the significance of performing a prayer with four takbirs in Islamic tradition?","id":"muslim-11-82"},{"hadith-eng":"The Messenger of Allah (ﷺ) gave us the news of the death of Negus, the ruler of Abyssinia, on the day when he died, and he said (to us): Beg pardon for your brother. Ibn Shihab said that Sa'id b. Musayyib had told that Abu Huraira had narrated to him that the Messenger of Allah (ﷺ) drew them up in a row in a place of prayer, and offered prayer and recited four takbirs for him.","reference":"Sahih Muslim 951b, Book 11, Hadith 83","question #":"question #1","question":"What is the significance of offering a funeral prayer in absentia in Islam?","id":"muslim-11-83"},{"hadith-eng":"This hadith is narrated through another chain of transmitters.","reference":"Sahih Muslim 951c, Book 11, Hadith 84","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-84"},{"hadith-eng":"Jabir b. 'Abdullah reported that the Messenger of Allah (ﷺ) offered prayer for Ashama, the Negus, and recited four takbirs.","reference":"Sahih Muslim 952a, Book 11, Hadith 85","question #":"question #1","question":"What is the significance of offering prayer for someone who is not physically present?","id":"muslim-11-85"},{"hadith-eng":"There died today the pious servant of Allah, Ashama. So he stood up and led us in (funeral prayer) over him.","reference":"Sahih Muslim 952b, Book 11, Hadith 86","question #":"question #1","question":"What is the significance of performing a funeral prayer for a deceased person in Islam?","id":"muslim-11-86"},{"hadith-eng":"A brother of yours has died, so stand up and offer prayer over him. So we stood up and drew ourselves up into two rows.","reference":"Sahih Muslim 952c, Book 11, Hadith 87","question #":"question #1","question":"What is the significance of offering prayer for a deceased person in Islam?","id":"muslim-11-87"},{"hadith-eng":"A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"","reference":"Sahih Muslim 953, Book 11, Hadith 88","question #":"question #1","question":"What is the significance of offering prayer for a deceased person in Islam?","id":"muslim-11-88"},{"hadith-eng":"I said to Sha'bi: Who narrated it to you? He said: An authentic one, 'Abdullah b. 'Abbas. This is the word of a hasan hadith. In the narration of Ibn Numair (the words are): The Messenger of Allah (ﷺ) went to the grave which had been newly prepared and prayed over it, and they also prayed who were behind him and he recited four takbirs. I said to 'Amir: Who narrated it to you? He said: An authentic one who saw him, i e. Ibn 'Abbas.","reference":"Sahih Muslim 954a, Book 11, Hadith 89","question #":"question #1","question":"What is the significance of performing prayer over a grave in Islamic tradition?","id":"muslim-11-89"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) recited four takbirs.\"","reference":"Sahih Muslim 954b, Book 11, Hadith 90","question #":"question #1","question":"What is the significance of reciting takbirs during Islamic rituals or prayers?","id":"muslim-11-90"},{"hadith-eng":"The hadith as narrated by Shaibani has been narrated through another chain of transmitters.","reference":"Sahih Muslim 954c, Book 11, Hadith 91","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-91"},{"hadith-eng":"Anas reported that the Messenger of Allah (ﷺ) observed prayer on the grave.","reference":"Sahih Muslim 955, Book 11, Hadith 92","question #":"question #1","question":"What is the significance of praying at a grave in Islamic tradition?","id":"muslim-11-92"},{"hadith-eng":"Lead me to her (or his) grave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.","reference":"Sahih Muslim 956, Book 11, Hadith 93","question #":"question #1","question":"What does this narration teach about the Prophet's concern for individuals who might be overlooked by society?","id":"muslim-11-93"},{"hadith-eng":"The Messenger of Allah (ﷺ) recited thus.","reference":"Sahih Muslim 957, Book 11, Hadith 94","question #":"question #1","question":"What is the significance of reciting takbirs during funeral prayers in Islam?","id":"muslim-11-94"},{"hadith-eng":"Whenever you see a funeral procession, stand up for that until it moves away or is lowered on the ground.","reference":"Sahih Muslim 958a, Book 11, Hadith 95","question #":"question #1","question":"What is the significance of standing up when witnessing a funeral procession in Islamic tradition?","id":"muslim-11-95"},{"hadith-eng":"Should any one of you come across a funeral procession, and if he does not intend to accompany it, he must stand up until it passes by him or is placed upon the ground before it passes him.","reference":"Sahih Muslim 958b, Book 11, Hadith 96","question #":"question #1","question":"What is the appropriate behavior when encountering a funeral procession in Islam?","id":"muslim-11-96"},{"hadith-eng":"Should anyone amongst you see a bier he must stand up so long as it is within sight in case he does not intend to follow it.","reference":"Sahih Muslim 958c, Book 11, Hadith 97","question #":"question #1","question":"What is the significance of standing up upon seeing a funeral procession in Islamic tradition?","id":"muslim-11-97"},{"hadith-eng":"When you follow a bier, do not sit until it is placed on the (ground).","reference":"Sahih Muslim 959a, Book 11, Hadith 98","question #":"question #1","question":"What is the etiquette to be observed when following a funeral procession?","id":"muslim-11-98"},{"hadith-eng":"Whenever you come across a bier you should stand up, and he who follows it should not sit down till it is placed on the ground.","reference":"Sahih Muslim 959b, Book 11, Hadith 99","question #":"question #1","question":"What is the significance of standing up when encountering a funeral procession?","id":"muslim-11-99"},{"hadith-eng":"There passed a bier and the Prophet (ﷺ) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.","reference":"Sahih Muslim 960a, Book 11, Hadith 100","question #":"question #1","question":"What is the significance of standing up when a funeral procession passes by?","id":"muslim-11-100"},{"hadith-eng":"Ibn Juraij told me that Abu Zubair heard Jabir say that the Prophet (ﷺ) kept standing for a bier until it disappeared.","reference":"Sahih Muslim 960b, Book 11, Hadith 101","question #":"question #1","question":"What is the significance of standing for a bier in Islamic tradition?","id":"muslim-11-101"},{"hadith-eng":"Again Abu Zubair heard Jabir say that the Prophet (ﷺ) and his Companions kept standing for a bier of a Jew until it disappeared from sight.","reference":"Sahih Muslim 960c, Book 11, Hadith 102","question #":"question #1","question":"What is the significance of showing respect to the deceased, regardless of their faith, in Islamic teachings?","id":"muslim-11-102"},{"hadith-eng":"Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"","reference":"Sahih Muslim 961a, 961b, Book 11, Hadith 103","question #":"question #1","question":"What is the significance of standing up for a funeral procession in Islamic tradition?","id":"muslim-11-103"},{"hadith-eng":"Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Prophet (ﷺ) stood up first (for a bier) and then sat down.","reference":"Sahih Muslim 962a, Book 11, Hadith 104","question #":"question #1","question":"What are the different practices regarding standing and sitting for a bier in Islamic tradition?","id":"muslim-11-104"},{"hadith-eng":"Verily, the Prophet (ﷺ) used to stand first but later on kept sitting; but it is also narrated that Nafi' ibn Jubair saw Waqid b. 'Amr standing for a bier till it was placed down.","reference":"Sahih Muslim 962b, Book 11, Hadith 105","question #":"question #1","question":"What are the different practices regarding standing or sitting for a bier in Islamic tradition?","id":"muslim-11-105"},{"hadith-eng":"This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters.","reference":"Sahih Muslim 962c, Book 11, Hadith 106","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-11-106"},{"hadith-eng":"I heard from Mas'ud b. al-Hakam who narrated it on the authority of Hadrat 'Ali that he said: We saw the Prophet (ﷺ) stood up for a (bier) and we also stood up; he sat down and we too sat down.","reference":"Sahih Muslim 962d, Book 11, Hadith 107","question #":"question #1","question":"What actions did the companions take when they observed the Prophet's behavior during a funeral procession?","id":"muslim-11-107"},{"hadith-eng":"This hadith has been narrated by Shu'ba with the same chain of transmitters.","reference":"Sahih Muslim 962e, Book 11, Hadith 108","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-11-108"},{"hadith-eng":"I heard it from 'Auf b. Malik that the Prophet (ﷺ) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.","reference":"Sahih Muslim 963a, 963b, Book 11, Hadith 109","question #":"question #1","question":"What are the supplications made by the Prophet (ﷺ) for the deceased during the funeral prayer?","id":"muslim-11-109"},{"hadith-eng":"A hadith like this has been narrated through another chain of transmitters.","reference":"Sahih Muslim 963c, Book 11, Hadith 110","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-110"},{"hadith-eng":"I heard the Prophet (ﷺ) say (while offering prayer on a dead body): O Allah! forgive him, have mercy upon him. Give him peace and absolve him. Receive him with honour and make his grave spacious. Wash him with water, snow and hail, cleanse him from faults as is cleaned a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate, and save him from the trial of the grave and torment of Hell. 'Auf b. Malik said: I earnestly desired that I were the dead person to receive the prayer of the Messenger of Allah (ﷺ) as this dead body had (received).","reference":"Sahih Muslim 963d, Book 11, Hadith 111","question #":"question #1","question":"What are the supplications made for the deceased in Islamic funeral prayers?","id":"muslim-11-111"},{"hadith-eng":"I prayed behind the Messenger of Allah (ﷺ) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.","reference":"Sahih Muslim 964a, Book 11, Hadith 112","question #":"question #1","question":"What is the significance of the position where the Imam stands during the funeral prayer?","id":"muslim-11-112"},{"hadith-eng":"This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.","reference":"Sahih Muslim 964b, Book 11, Hadith 113","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-11-113"},{"hadith-eng":"I was a young boy during the time of the Prophet (ﷺ) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (ﷺ) over a woman who had died in the state of delivery, and the Messenger of Allah (ﷺ) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"","reference":"Sahih Muslim 964c, Book 11, Hadith 114","question #":"question #1","question":"What is the significance of standing in the middle part of the body during funeral prayers in Islamic tradition?","id":"muslim-11-114"},{"hadith-eng":"It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Prophet (ﷺ) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.","reference":"Sahih Muslim 965a, Book 11, Hadith 115","question #":"question #1","question":"What actions did the Prophet (ﷺ) take after offering a funeral prayer according to this narration?","id":"muslim-11-115"},{"hadith-eng":"then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Prophet (ﷺ) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?","reference":"Sahih Muslim 965b, Book 11, Hadith 116","question #":"question #1","question":"What significance does the Prophet's prayer on a deceased person hold in Islamic tradition?","id":"muslim-11-116"},{"hadith-eng":"\" Make a niche for me in the side of the grave and set up bricks over me as was done in case of Allah's Messenger (ﷺ).","reference":"Sahih Muslim 966, Book 11, Hadith 117","question #":"question #1","question":"What are the recommended practices for preparing a grave according to Islamic tradition?","id":"muslim-11-117"},{"hadith-eng":"Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (ﷺ).","reference":"Sahih Muslim 967, Book 11, Hadith 118","question #":"question #1","question":"What significance does the color red hold in Islamic burial practices?","id":"muslim-11-118"},{"hadith-eng":"When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (ﷺ) commanding (us) to level the grave.","reference":"Sahih Muslim 968, Book 11, Hadith 119","question #":"question #1","question":"What is the significance of leveling a grave in Islamic burial practices?","id":"muslim-11-119"},{"hadith-eng":"Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It. This hadith has been reported by Habib with the same chain of transmitters and he said: (Do not leave) a picture without obliterating it.","reference":"Sahih Muslim 969a, 969b, Book 11, Hadith 120","question #":"question #1","question":"What instructions did the Prophet Muhammad (ﷺ) give regarding images and graves?","id":"muslim-11-120"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.","reference":"Sahih Muslim 970a, Book 11, Hadith 121","question #":"question #1","question":"What are the Islamic guidelines regarding the treatment and maintenance of graves?","id":"muslim-11-121"},{"hadith-eng":"A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.","reference":"Sahih Muslim 970b, Book 11, Hadith 122","question #":"question #1","question":"Who is the narrator of this hadith and what is its significance in Islamic tradition?","id":"muslim-11-122"},{"hadith-eng":"Jabir said that he was forbidden to plaster graves.","reference":"Sahih Muslim 970c, Book 11, Hadith 123","question #":"question #1","question":"What is the Islamic ruling on plastering graves?","id":"muslim-11-123"},{"hadith-eng":"It is better that one of you should sit on live coals which would burn his clothing and come in contact with his skin than that he should sit on a grave.","reference":"Sahih Muslim 971a, Book 11, Hadith 124","question #":"question #1","question":"What is the significance of showing respect towards graves in Islamic teachings?","id":"muslim-11-124"},{"hadith-eng":"A hadith like this has been narrated by Suhail with the same chain of transmitters.","reference":"Sahih Muslim 971b, Book 11, Hadith 125","question #":"question #1","question":"What is the significance of having a consistent chain of transmitters in the narration of hadiths?","id":"muslim-11-125"},{"hadith-eng":"Do not sit on the graves and do not pray facing towards them.","reference":"Sahih Muslim 972a, Book 11, Hadith 126","question #":"question #1","question":"What is the Islamic ruling on sitting on graves?","id":"muslim-11-126"},{"hadith-eng":"Do not pray facing towards the graves, and do not sit on them.","reference":"Sahih Muslim 972b, Book 11, Hadith 127","question #":"question #1","question":"What is the Islamic ruling on praying in the direction of graves?","id":"muslim-11-127"},{"hadith-eng":"How soon the people have forgotten that the Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.","reference":"Sahih Muslim 973a, Book 11, Hadith 128","question #":"question #1","question":"What is the significance of performing funeral prayers in a mosque according to Islamic tradition?","id":"muslim-11-128"},{"hadith-eng":"How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.","reference":"Sahih Muslim 973b, Book 11, Hadith 129","question #":"question #1","question":"What is the significance of offering funeral prayers in a mosque according to Islamic tradition?","id":"muslim-11-129"},{"hadith-eng":"Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (ﷺ) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.","reference":"Sahih Muslim 973c, Book 11, Hadith 130","question #":"question #1","question":"What is the significance of offering funeral prayers in a mosque according to Islamic tradition?","id":"muslim-11-130"},{"hadith-eng":"Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".","reference":"Sahih Muslim 974a, Book 11, Hadith 131","question #":"question #1","question":"What is the significance of visiting graves and praying for the deceased in Islam?","id":"muslim-11-131"},{"hadith-eng":"Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah (ﷺ)? We said: Yes. She said: When it was my turn for Allah's Messenger (ﷺ) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.","reference":"Sahih Muslim 974b, Book 11, Hadith 132","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take when he received a message from Gabriel while with 'A'isha?","id":"muslim-11-132"},{"hadith-eng":"\" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"","reference":"Sahih Muslim 975, Book 11, Hadith 133","question #":"question #1","question":"What is the significance of greeting the inhabitants of the graveyard in Islam?","id":"muslim-11-133"},{"hadith-eng":"I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.","reference":"Sahih Muslim 976a, Book 11, Hadith 134","question #":"question #1","question":"What is the significance of seeking permission from Allah in matters of forgiveness and visiting graves?","id":"muslim-11-134"},{"hadith-eng":"The Apostle of Allah (ﷺ) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.","reference":"Sahih Muslim 976b, Book 11, Hadith 135","question #":"question #1","question":"What is the significance of visiting graves in Islam and how does it relate to mindfulness of death?","id":"muslim-11-135"},{"hadith-eng":"I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.","reference":"Sahih Muslim 977a, Book 11, Hadith 136","question #":"question #1","question":"What is the significance of visiting graves in Islam and how has the ruling on it changed?","id":"muslim-11-136"},{"hadith-eng":"This hadith has been narrated through another chain of transmitters.","reference":"Sahih Muslim 977b, Book 11, Hadith 137","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-11-137"},{"hadith-eng":"(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah (ﷺ), but he did not offer prayers for him.","reference":"Sahih Muslim 978, Book 11, Hadith 138","question #":"question #1","question":"What is the Islamic perspective on offering funeral prayers for someone who has committed suicide?","id":"muslim-11-138"},{"hadith-eng":"Exhort to recite\" There is no god but Allah\" to those of you who are dying.","reference":"Sahih Muslim 916a, Book 11, Hadith 1","question #":"question #2","question":"How can the declaration of faith impact a person's final moments?","id":"muslim-11-139"},{"hadith-eng":"This hadith has been narrated by Sulaiman b. Bilal with the same chain of transmitters.","reference":"Sahih Muslim 916b, Book 11, Hadith 2","question #":"question #2","question":"How does the consistency of narration impact the credibility of a hadith?","id":"muslim-11-140"},{"hadith-eng":"Exhort to recite\" There is no god but Allah\" to those of you who are dying.","reference":"Sahih Muslim 917, Book 11, Hadith 3","question #":"question #2","question":"How can the declaration of faith impact a person's final moments according to Islamic teachings?","id":"muslim-11-141"},{"hadith-eng":"If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (ﷺ). I then said the words, and Allah gave me God's Messenger (ﷺ) in exchange. She said: The Messenger of Allah (ﷺ) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).","reference":"Sahih Muslim 918a, Book 11, Hadith 4","question #":"question #2","question":"How does patience and supplication during affliction lead to receiving something better from Allah?","id":"muslim-11-142"},{"hadith-eng":"If any servant (of Allah) who suffers a calamity says:\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" ' Allah will give him reward for affliction, and would give him something better than it in exchange. She (Umm Salama) said: When Abu Salama died. I uttered (these very words) as I was commanded (to do) by the Messenger of Allah (ﷺ). So Allah gave me better in exchange than him. i. e. (I was taken as the wife of) the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 918b, Book 11, Hadith 5","question #":"question #2","question":"How does seeking reward from Allah during affliction impact a believer's experience of hardship?","id":"muslim-11-143"},{"hadith-eng":"\" When Abu Salama died I said: Who is better than Abu Salama, the Companion of the Messenger of Allah (ﷺ), and Allah decided for me and I said (these words contained in the supplication mentioned above) and I was married to the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 918c, Book 11, Hadith 6","question #":"question #2","question":"How can faith in Allah's decisions lead to unexpected blessings in one's life?","id":"muslim-11-144"},{"hadith-eng":"Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Messenger of Allah (ﷺ) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).","reference":"Sahih Muslim 919, Book 11, Hadith 7","question #":"question #2","question":"How do angels participate in the supplications made for the sick or deceased?","id":"muslim-11-145"},{"hadith-eng":"The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.","reference":"Sahih Muslim 920a, Book 11, Hadith 8","question #":"question #2","question":"How do angels respond to the supplications made by people according to Islamic teachings?","id":"muslim-11-146"},{"hadith-eng":"(O Allah! ) let Thee be the caretaker of what is left by him, and he said: Grant him expansion of the grave, but he did not say: Make his grave spacious. Khalid said: He supplicated for the seventh (thing too) which I have forgotten.","reference":"Sahih Muslim 920b, Book 11, Hadith 9","question #":"question #2","question":"How does the alteration in wording affect the understanding of a supplication for the deceased?","id":"muslim-11-147"},{"hadith-eng":"Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.","reference":"Sahih Muslim 921a, Book 11, Hadith 10","question #":"question #2","question":"How is the departure of the soul from the body described in Islamic tradition?","id":"muslim-11-148"},{"hadith-eng":"This hadith is narrated on the authority of 'Ala' with the same chain of transmitters.","reference":"Sahih Muslim 921b, Book 11, Hadith 11","question #":"question #2","question":"How does the consistency of narration impact the reliability of a hadith?","id":"muslim-11-149"},{"hadith-eng":"When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (ﷺ) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.","reference":"Sahih Muslim 922, Book 11, Hadith 12","question #":"question #2","question":"How does Islam view the influence of the devil in human emotions and actions during times of grief?","id":"muslim-11-150"},{"hadith-eng":"While we were with the Messenger of Allah (ﷺ), one of his daughters sent to him (the Messenger) to call him and inform him that her child or her son was dying. The Messenger of Allah (ﷺ) told the messenger to go back and tell her that what Allah had taken belonged to Him, and to him belonged what He granted; and He has an appointed time for everything. So you (the messenger) order her to show endurance and seek reward from Allah. The messenger came back and said: She adjures him to come to her. He got up to go accompanied by Sa'd b. 'Ubada, Mu'adh b. Jabal, and I also went along with them. The child was lifted to him and his soul was feeling as restless as if it was in an old (waterskin). His (Prophet's) eyes welled up with tears. Sa'd said: What is this, Messenger of Allah? He replied: This is compassion which Allah has placed in the hearts of His servants, and God shows compassion only to those of His servants who are compassionate.","reference":"Sahih Muslim 923a, Book 11, Hadith 13","question #":"question #2","question":"What is the significance of showing patience and seeking reward from Allah during times of loss?","id":"muslim-11-151"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters on the authority of 'Asim al-Ahwal.","reference":"Sahih Muslim 923b, Book 11, Hadith 14","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-11-152"},{"hadith-eng":"Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (ﷺ) wept. When the people saw Allah's Messenger (ﷺ) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.","reference":"Sahih Muslim 924, Book 11, Hadith 15","question #":"question #2","question":"How does Islam view the consequences of speech compared to emotions like sadness and tears?","id":"muslim-11-153"},{"hadith-eng":"While we were sitting with the Messenger of Allah (ﷺ), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (ﷺ) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (ﷺ) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (ﷺ) and his Companions with him came near him (Sa'd b. 'Ubada).","reference":"Sahih Muslim 925, Book 11, Hadith 16","question #":"question #2","question":"How did the companions of the Prophet show their respect and humility during their visit to Sa'd b. 'Ubada?","id":"muslim-11-154"},{"hadith-eng":"Endurance is to be shown at the first blow.","reference":"Sahih Muslim 926a, Book 11, Hadith 17","question #":"question #2","question":"How does patience at the onset of a difficulty reflect one's faith and character?","id":"muslim-11-155"},{"hadith-eng":"Fear Allah and show endurance. She (not recognising him) said: You have not been afflicted as I have been. When he (the Holy Prophet) had departed, it was said to her that he was the Messenger of Allah (ﷺ), she was mortally shocked. She came to his door and she did not find doorkeepers at his door. She said: Messenger of Allah. I did not recognise you. He said: Endurance is to be shown at first blow, or at the first blow.","reference":"Sahih Muslim 926b, Book 11, Hadith 18","question #":"question #2","question":"How does the initial reaction to a calamity reflect one's level of patience and faith?","id":"muslim-11-156"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) happened to pass by a woman (who was sitting) by the side of a grave.\"","reference":"Sahih Muslim 926c, Book 11, Hadith 19","question #":"question #2","question":"How do interactions at gravesites reflect Islamic teachings on mourning and remembrance?","id":"muslim-11-157"},{"hadith-eng":"Be quiet, my daughter. Don't you know that the Messenger of Allah (ﷺ) had said:\" The deceased is punished because of his family's weeping over the death\"?","reference":"Sahih Muslim 927a, Book 11, Hadith 20","question #":"question #2","question":"How does family behavior impact the deceased according to Islamic teachings?","id":"muslim-11-158"},{"hadith-eng":"The dead is punished in the grave because of wailing on it.","reference":"Sahih Muslim 927b, Book 11, Hadith 21","question #":"question #2","question":"How does the behavior of the living affect the deceased in their grave?","id":"muslim-11-159"},{"hadith-eng":"The same hadith is narrated on the authority of 'Umar through another chain of transmitters.","reference":"Sahih Muslim 927c, Book 11, Hadith 22","question #":"question #2","question":"How does the repetition of a hadith through different narrators affect its credibility?","id":"muslim-11-160"},{"hadith-eng":"When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the weeping of the living\"?","reference":"Sahih Muslim 927d, Book 11, Hadith 23","question #":"question #2","question":"How does the behavior of the living affect the deceased according to Islamic teachings?","id":"muslim-11-161"},{"hadith-eng":"O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of the living\"?","reference":"Sahih Muslim 927e, Book 11, Hadith 24","question #":"question #2","question":"How does the behavior of the living affect the deceased according to Islamic teachings?","id":"muslim-11-162"},{"hadith-eng":"What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (ﷺ) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).","reference":"Sahih Muslim 927f, Book 11, Hadith 25","question #":"question #2","question":"How did 'Umar respond to Suhaib's lamentation and what does it signify about his understanding of Islamic teachings?","id":"muslim-11-163"},{"hadith-eng":"O Hafsa, did you not hear the Messenger of Allah (ﷺ) saying:\" One who is lamented would be punished\"? Suhaib also lamented over him. 'Umar told him also: O Suhaib, didn't you know that one who is lamented is punished?","reference":"Sahih Muslim 927g, Book 11, Hadith 26","question #":"question #2","question":"How does lamenting affect the deceased according to Islamic teachings?","id":"muslim-11-164"},{"hadith-eng":"I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (ﷺ) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (ﷺ) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.","reference":"Sahih Muslim 928a, 927h, 929a, Book 11, Hadith 27","question #":"question #2","question":"How does the concept of individual responsibility relate to the actions of family members in Islam?","id":"muslim-11-165"},{"hadith-eng":"The daughter of 'Uthman b. 'Affan died in Mecca. We came to attend her (funeral). Ibn 'Umar and Ibn 'Abbas were also present there, and I was sitting between them. He added: I (first sat) by the side of one of them, then the other one came and he sat by my side. 'Abdullah b. 'Umar said to 'Amr b. 'Uthman who was sitting opposite to him: Will you not prevent the people from lamenting, for the Messenger of Allah (ﷺ) had said:\" The dead is punished because of the lamenting of his family for him\"? Ibn 'Abbas then said that Umar used to say someting of that nature, and then narrated saying: I proceeded from Mecca along with 'Umar till we reached al-Baida' and there was a party of riders under the shade of a tree. He said (to me): Go and find out who this party is. I cast a glance and there was Suhaib (in that party). So I informed him ('Umar) about it. He said: Call him to me. So I went back to Suhaib and said: Go and meet the Commander of the believers. When 'Umar was wounded, Suhaib came walling: Alas, for the brother! alas for the companion! 'Umar said: O Suhaib, do you wail for me, whereas the Messenger of Allah (ﷺ) said:\" The dead would be punished on account of the lamentation of the (members of his family)\"? Ibn 'Abbas said: When 'Umar died I made a mention of it to 'A'isha. She said: May Allah have mercy upon 'Umar! I swear by Allah that Allah's Messenger (ﷺ) never said that Allah would punish the believer because of the weeping (of any one of the members of his family), but he said that Allah would increase the punishment of the unbeliever because of the weeping of his family over him. 'A'isha said: The Qur'an is enough for you (when it states):\" No bearer of burden will bear another's burden\" (vi. 164). Thereupon Ibn 'Abbas said: Allah is He Who has caused laughter and weeping. Ibn Abu Mulaika said: By Allah, Ibn 'Umar said nothing.","reference":"Sahih Muslim 928b, 927i, 929b, Book 11, Hadith 28","question #":"question #2","question":"How did 'Umar and 'A'isha interpret the Prophet's teachings on the consequences of family lamentation for the deceased?","id":"muslim-11-166"},{"hadith-eng":"We were with the bier of Umm Aban, daughter of 'Uthman, and the rest of the hadith is the same, but he did not narrate it as a marfu' hadith on the authority of 'Umar from the Messenger of Allah (ﷺ) as it was narrated by Ayyub and Ibn Juraij, and the hadith narrated by them (Ayyub and Ibn Juraij) is more complete than that of 'Amr.","reference":"Sahih Muslim 929c, Book 11, Hadith 29","question #":"question #2","question":"How do different narrators contribute to the understanding and transmission of a hadith?","id":"muslim-11-167"},{"hadith-eng":"The dead is punished because of the lamentation of the living.","reference":"Sahih Muslim 930, Book 11, Hadith 30","question #":"question #2","question":"How does the behavior of the living affect the state of the deceased in the afterlife?","id":"muslim-11-168"},{"hadith-eng":"May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (ﷺ) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.","reference":"Sahih Muslim 931, Book 11, Hadith 31","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address the issue of lamentation over the dead in this context?","id":"muslim-11-169"},{"hadith-eng":"He (Ibn 'Umar) missed (the point). The Messenger of Allah (ﷺ) had (in fact) said: He (the dead) is punished for his faults or for his sins, and the members of his family are wailing for him now. (This misunderstanding of Ibn 'Umar is similar to his saying: ) The Messenger of Allah (ﷺ) stood by the well in which were lying the dead bodies of those polytheists who had been killed on the Day of Badr, and he said to them what he had to say, i. e.: They hear what I say. But he (Ibn 'Umar) misunderstood. The Prophet (ﷺ) had only said: They (the dead) understand that what I used to say to them was truth. She then recited:\" Certainly, thou canst not make the dead hear the call\" (xxvii. 80), nor can you make those hear who are in the graves, nor can you inform them when they have taken their seats in Hell.","reference":"Sahih Muslim 932a, Book 11, Hadith 32","question #":"question #2","question":"How can misunderstandings arise in the transmission of hadiths, and what impact might they have?","id":"muslim-11-170"},{"hadith-eng":"This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters. The hadith narrated by Abu Usama is more complete.","reference":"Sahih Muslim 932b, Book 11, Hadith 33","question #":"question #2","question":"What is the significance of having multiple chains of transmitters for a single hadith?","id":"muslim-11-171"},{"hadith-eng":"The dead is punished because of the lamentation of the living. Upon this 'A'isha said: May Allah have mercy upon the father of 'Abd al-Rahman (Ibn 'Umar). He did not tell a lie, but he forgot or made a mistake. The Messenger of Allah (ﷺ) happened to pass by a (dead) Jewess who was being lamented. Upon this he said: They weep over her and she is being punished in the grave.","reference":"Sahih Muslim 932c, Book 11, Hadith 34","question #":"question #2","question":"How does the hadith address the issue of potential errors in narrating the sayings of the Prophet (ﷺ)?","id":"muslim-11-172"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.","reference":"Sahih Muslim 933a, Book 11, Hadith 35","question #":"question #2","question":"How does lamentation affect the deceased on the Day of Judgment?","id":"muslim-11-173"},{"hadith-eng":"A hadith like this has been narrated by Mughira b. Shu'ba from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 933b, Book 11, Hadith 36","question #":"question #2","question":"What is the significance of Sahih Muslim in the collection of hadith literature?","id":"muslim-11-174"},{"hadith-eng":"This hadith has been narrated from the Messenger of Allah (ﷺ) through another chain of transmitters.","reference":"Sahih Muslim 933c, Book 11, Hadith 37","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-11-175"},{"hadith-eng":"Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.","reference":"Sahih Muslim 934, Book 11, Hadith 38","question #":"question #2","question":"What are the consequences mentioned for a wailing woman who does not repent before her death?","id":"muslim-11-176"},{"hadith-eng":"I was looking (at him) through the crevice of the door. A man came to him and mentioned that Ja'far's women were lamenting. He (the Holy Prophet) commanded him to go and forbid them (to do so). So he went away but came back and told (him) that they did not obey (him). He commanded him a second time to go and forbid them (to do so). He again went but came back to him and said: I swear by God, Messenger of Allah, that they have overpowered us. She ('A'isha) said that she thought the Messenger of Allah (ﷺ) had told (her) to throw dust in their mouths. Thereupon 'A'isha said: May Allah humble you! You did not do what Allah's Messenger (ﷺ) ordered you, nor did you stop annoying Allah's Messenger (ﷺ).","reference":"Sahih Muslim 935a, Book 11, Hadith 39","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the news of the death of his companions?","id":"muslim-11-177"},{"hadith-eng":"\" You did not spare the Messenger of Allah (ﷺ) the botheration.\"","reference":"Sahih Muslim 935b, Book 11, Hadith 40","question #":"question #2","question":"How should one approach the Prophet Muhammad (ﷺ) with questions or requests?","id":"muslim-11-178"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.","reference":"Sahih Muslim 936a, Book 11, Hadith 41","question #":"question #2","question":"Why is it important to fulfill promises made in the context of religious commitments?","id":"muslim-11-179"},{"hadith-eng":"Umm 'Atiyya reported that the Messenger of Allah (ﷺ) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) was Umm Sulaim.","reference":"Sahih Muslim 936b, Book 11, Hadith 42","question #":"question #2","question":"How does Islam view the act of lamenting, especially in the context of this narration?","id":"muslim-11-180"},{"hadith-eng":"When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (ﷺ) said: (Yes) but only in case of the members of such a tribe.","reference":"Sahih Muslim 937, Book 11, Hadith 43","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address cultural practices that conflicted with Islamic teachings?","id":"muslim-11-181"},{"hadith-eng":"We were forbidden to follow the bier, but it was not made absolute on us.","reference":"Sahih Muslim 938a, Book 11, Hadith 44","question #":"question #2","question":"How does Islamic jurisprudence address prohibitions that are not absolute?","id":"muslim-11-182"},{"hadith-eng":"We were refrained from following the bier, but it was not made absolute on us.","reference":"Sahih Muslim 938b, Book 11, Hadith 45","question #":"question #2","question":"Are there any exceptions or conditions regarding women attending funerals in Islam?","id":"muslim-11-183"},{"hadith-eng":"The Apostle of Allah (ﷺ) came to us when we were bathing his daughter, and he told us: Wash her with water and (with the leaves of) the lote tree, three or five times, or more than that if you think fit, and put camphor or something like camphor in the last washing; then inform me when you have finished. So when we had finished, we informed him, and he gave to us his (own) under-garment saying:\" Put it next her body.\"","reference":"Sahih Muslim 939a, Book 11, Hadith 46","question #":"question #2","question":"What is the significance of using camphor or similar substances in the final washing of a deceased person?","id":"muslim-11-184"},{"hadith-eng":"We braided her hair in three plaits.","reference":"Sahih Muslim 939b, Book 11, Hadith 47","question #":"question #2","question":"How does Islamic tradition address the preparation of a deceased person's body?","id":"muslim-11-185"},{"hadith-eng":"One of the daughters of the Messenger of Allah (ﷺ) died. And in the hadith transmitted by Ibn 'Ulayya (the words are): The Messenger of Allah (ﷺ) came to us and we were washing his daughter. And in the hadith transmitted by Malik (the words are): There came in (our apartment) the Messenger of Allah (way peace be upon him) when his daughter died. The rest of the hadith is the same as narrated by Yazid b. Zurai' from Ayyub from Muhammad from Umm 'Atiyya.","reference":"Sahih Muslim 939c, Book 11, Hadith 48","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) participate in the funeral preparations of his family members?","id":"muslim-11-186"},{"hadith-eng":"\" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority of Umm 'Atiyya: We braided (the hair) of her head in three plaits.","reference":"Sahih Muslim 939d, Book 11, Hadith 49","question #":"question #2","question":"How many times should the body of a deceased person be washed according to Islamic teachings?","id":"muslim-11-187"},{"hadith-eng":"We washed her an odd number of times, i. e. three, five or seven times; and Umm 'Atiyya (further) said: We braided her hair in three plaits.","reference":"Sahih Muslim 939e, Book 11, Hadith 50","question #":"question #2","question":"How is the hair of a deceased person treated during the Islamic washing ritual?","id":"muslim-11-188"},{"hadith-eng":"When Zainab the daughter of the Messenger of Allah (ﷺ) died, he said to us: Wash her odd number of times, i. e. three or five times, and put camphor or something-like camphor at the fifth time, and after you have washed her inform me. So we informed him and he gave us his under-garment, saying:\" Put it next her body.\"","reference":"Sahih Muslim 939f, Book 11, Hadith 51","question #":"question #2","question":"What is the purpose of using camphor during the washing of a deceased body in Islamic tradition?","id":"muslim-11-189"},{"hadith-eng":"There came to us the Messenger of Allah (ﷺ) as we were washing one of his daughters. So he said: Wash her (dead body) an odd number of times, five times or more than that, the rest of the hadith is the same. She (further) said: We braided her hair in three plaits: (two) on the sides of her head and one on her forehead.","reference":"Sahih Muslim 939g, Book 11, Hadith 52","question #":"question #2","question":"How should the hair of a deceased female be arranged according to Islamic tradition?","id":"muslim-11-190"},{"hadith-eng":"Umm 'Atiyya reported that when the Messenger of Allah (ﷺ) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.","reference":"Sahih Muslim 939h, Book 11, Hadith 53","question #":"question #2","question":"Which parts of the body are emphasized for washing in Islamic funeral rites?","id":"muslim-11-191"},{"hadith-eng":"Umm 'Atiyya reported that the Messenger of Allah (ﷺ) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.","reference":"Sahih Muslim 939i, Book 11, Hadith 54","question #":"question #2","question":"How does the practice of washing specific body parts relate to the concept of purification in Islam?","id":"muslim-11-192"},{"hadith-eng":"We migrated with the Messenger of Allah (ﷺ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (ﷺ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.","reference":"Sahih Muslim 940a, Book 11, Hadith 55","question #":"question #2","question":"How does the story of Mus'ab b. 'Umair illustrate the concept of martyrdom and its rewards in Islam?","id":"muslim-11-193"},{"hadith-eng":"A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.","reference":"Sahih Muslim 940b, Book 11, Hadith 56","question #":"question #2","question":"How does the consistency of a hadith's chain of transmitters affect its authenticity?","id":"muslim-11-194"},{"hadith-eng":"I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.","reference":"Sahih Muslim 941a, Book 11, Hadith 57","question #":"question #2","question":"How does the decision to sell a garment intended for shrouding and give its price in charity reflect Islamic values?","id":"muslim-11-195"},{"hadith-eng":"I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (ﷺ) was not shrouded! So he gave it in charity.","reference":"Sahih Muslim 941b, Book 11, Hadith 58","question #":"question #2","question":"How does the act of giving in charity relate to the actions of the companions of the Prophet (ﷺ)?","id":"muslim-11-196"},{"hadith-eng":"This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah b. Abu Bakr.","reference":"Sahih Muslim 941c, Book 11, Hadith 59","question #":"question #2","question":"How does the omission of certain details affect the understanding of a hadith?","id":"muslim-11-197"},{"hadith-eng":"I asked 'A'isha with how many garments the Messenger of Allah (ﷺ) was shourded. She said: With three garments of Sahul.","reference":"Sahih Muslim 941d, Book 11, Hadith 60","question #":"question #2","question":"What type of garments were used for the shrouding of the Prophet Muhammad (ﷺ)?","id":"muslim-11-198"},{"hadith-eng":"When the Messenger of Allah (may peace be upom him) died, he was covered with a Yamani wrapper.","reference":"Sahih Muslim 942a, Book 11, Hadith 61","question #":"question #2","question":"What cultural or regional significance might a Yamani wrapper have had during the time of the Prophet Muhammad (peace be upon him)?","id":"muslim-11-199"},{"hadith-eng":"This hadith has been narrated by Zuhri with the same chain of transmitters.","reference":"Sahih Muslim 942b, Book 11, Hadith 62","question #":"question #2","question":"How does the repetition of a hadith by different narrators affect its credibility?","id":"muslim-11-200"},{"hadith-eng":"Allah's Messenger (ﷺ) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (ﷺ) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (ﷺ) also said: When any one of you shrouds his brother, he should shroud him well.","reference":"Sahih Muslim 943, Book 11, Hadith 63","question #":"question #2","question":"Why is it important to shroud the deceased properly in Islamic tradition?","id":"muslim-11-201"},{"hadith-eng":"Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.","reference":"Sahih Muslim 944a, Book 11, Hadith 64","question #":"question #2","question":"How does the character of the deceased influence the perception of their funeral in Islam?","id":"muslim-11-202"},{"hadith-eng":"\" I do not know whether the hadith is marfu'.\"","reference":"Sahih Muslim 944b, Book 11, Hadith 65","question #":"question #2","question":"How do scholars determine whether a hadith is marfu' or not?","id":"muslim-11-203"},{"hadith-eng":"Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.","reference":"Sahih Muslim 944c, Book 11, Hadith 66","question #":"question #2","question":"How does the concept of good and evil relate to the treatment of the deceased in Islam?","id":"muslim-11-204"},{"hadith-eng":"He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira reached him, he said:\" We have lost many qirats.\"","reference":"Sahih Muslim 945a, Book 11, Hadith 67","question #":"question #2","question":"How are the rewards for attending a funeral prayer and burial quantified in Islamic teachings?","id":"muslim-11-205"},{"hadith-eng":"\" two great mountains.\" No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abd al- A'la (the words are):\" till (the burial) is complete.\" In the hadith transmitted by 'Abd ar-Razzaq (the words are):\" till he is placed in the grave.\"","reference":"Sahih Muslim 945b, Book 11, Hadith 68","question #":"question #2","question":"How do different narrations of a hadith contribute to understanding its context and meaning?","id":"muslim-11-206"},{"hadith-eng":"\" He who followed it (the bier) till he (the dead) is buried.\"","reference":"Sahih Muslim 945c, Book 11, Hadith 69","question #":"question #2","question":"What actions are recommended for a Muslim to perform when someone passes away?","id":"muslim-11-207"},{"hadith-eng":"He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.","reference":"Sahih Muslim 945d, Book 11, Hadith 70","question #":"question #2","question":"How does following the funeral procession impact the reward received by a Muslim?","id":"muslim-11-208"},{"hadith-eng":"He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.","reference":"Sahih Muslim 945f, Book 11, Hadith 71","question #":"question #2","question":"How does attending a funeral procession relate to earning spiritual rewards in Islam?","id":"muslim-11-209"},{"hadith-eng":"He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) said: Abu Huraira, what is a qirat? He said: It is like the hill of Uhud.","reference":"Sahih Muslim 945e, Book 11, Hadith 72","question #":"question #2","question":"What rewards are associated with following a funeral procession to the grave?","id":"muslim-11-210"},{"hadith-eng":"Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (ﷺ) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.","reference":"Sahih Muslim 945g, Book 11, Hadith 73","question #":"question #2","question":"How does the reward for attending a funeral and following it to the burial compare to other acts of worship?","id":"muslim-11-211"},{"hadith-eng":"He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.","reference":"Sahih Muslim 946a, Book 11, Hadith 74","question #":"question #2","question":"How is the reward for attending a burial described in Islamic teachings?","id":"muslim-11-212"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) was asked about qirat, and he said: It is equivalent to Uhud.\"","reference":"Sahih Muslim 946b, Book 11, Hadith 75","question #":"question #2","question":"How is the concept of 'qirat' related to the mountain of Uhud?","id":"muslim-11-213"},{"hadith-eng":"If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.","reference":"Sahih Muslim 947, Book 11, Hadith 76","question #":"question #2","question":"How does the number of people participating in a prayer affect its acceptance in Islamic teachings?","id":"muslim-11-214"},{"hadith-eng":"So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (ﷺ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.","reference":"Sahih Muslim 948, Book 11, Hadith 77","question #":"question #2","question":"How does the presence of certain individuals at a funeral prayer influence intercession for the deceased?","id":"muslim-11-215"},{"hadith-eng":"There passed a bier (being carried by people) and it was lauded in good terms. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. 'Umar said: May my father and mother be ransom for you! There passed a bier and it was praised in good terms, and you said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words, and you said: It has become certain, it has become certain, it has become certain. Upon this the Messenger of Allah (way peace be upon him) said: He whom you praised in good terms, Paradise has become certain for him, and he whom you condemned in bad words, Hell has become certain for him. You are Allah's witnesses in the earth, you are Allah's witnesses in the earth, you are Allah's witnesses in the earth.","reference":"Sahih Muslim 949a, Book 11, Hadith 78","question #":"question #2","question":"How does the opinion of people about a deceased individual influence their standing in the hereafter?","id":"muslim-11-216"},{"hadith-eng":"This hadith has been narrated through another chain of transmitters.","reference":"Sahih Muslim 949b, Book 11, Hadith 79","question #":"question #2","question":"How does the presence of different narrators affect the understanding of a hadith?","id":"muslim-11-217"},{"hadith-eng":"Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.","reference":"Sahih Muslim 950a, Book 11, Hadith 80","question #":"question #2","question":"How does the death of a wicked person impact the world and its inhabitants according to Islamic teachings?","id":"muslim-11-218"},{"hadith-eng":"(The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.","reference":"Sahih Muslim 950b, Book 11, Hadith 81","question #":"question #2","question":"How does entering the Mercy of Allah benefit a believer facing hardships?","id":"muslim-11-219"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) gave the people news of the death of Negus on the day he died, and he took them out to the place of prayer and observed four takbirs.","reference":"Sahih Muslim 951a, Book 11, Hadith 82","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) inform his companions about the death of Negus?","id":"muslim-11-220"},{"hadith-eng":"The Messenger of Allah (ﷺ) gave us the news of the death of Negus, the ruler of Abyssinia, on the day when he died, and he said (to us): Beg pardon for your brother. Ibn Shihab said that Sa'id b. Musayyib had told that Abu Huraira had narrated to him that the Messenger of Allah (ﷺ) drew them up in a row in a place of prayer, and offered prayer and recited four takbirs for him.","reference":"Sahih Muslim 951b, Book 11, Hadith 83","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the importance of seeking forgiveness for fellow Muslims?","id":"muslim-11-221"},{"hadith-eng":"This hadith is narrated through another chain of transmitters.","reference":"Sahih Muslim 951c, Book 11, Hadith 84","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-11-222"},{"hadith-eng":"Jabir b. 'Abdullah reported that the Messenger of Allah (ﷺ) offered prayer for Ashama, the Negus, and recited four takbirs.","reference":"Sahih Muslim 952a, Book 11, Hadith 85","question #":"question #2","question":"How many takbirs are recited during the funeral prayer according to this practice?","id":"muslim-11-223"},{"hadith-eng":"There died today the pious servant of Allah, Ashama. So he stood up and led us in (funeral prayer) over him.","reference":"Sahih Muslim 952b, Book 11, Hadith 86","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate respect and honor for a pious individual who has passed away?","id":"muslim-11-224"},{"hadith-eng":"A brother of yours has died, so stand up and offer prayer over him. So we stood up and drew ourselves up into two rows.","reference":"Sahih Muslim 952c, Book 11, Hadith 87","question #":"question #2","question":"How is the funeral prayer performed in terms of rows and congregation?","id":"muslim-11-225"},{"hadith-eng":"A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"","reference":"Sahih Muslim 953, Book 11, Hadith 88","question #":"question #2","question":"How does the concept of brotherhood manifest in Islamic funeral practices?","id":"muslim-11-226"},{"hadith-eng":"I said to Sha'bi: Who narrated it to you? He said: An authentic one, 'Abdullah b. 'Abbas. This is the word of a hasan hadith. In the narration of Ibn Numair (the words are): The Messenger of Allah (ﷺ) went to the grave which had been newly prepared and prayed over it, and they also prayed who were behind him and he recited four takbirs. I said to 'Amir: Who narrated it to you? He said: An authentic one who saw him, i e. Ibn 'Abbas.","reference":"Sahih Muslim 954a, Book 11, Hadith 89","question #":"question #2","question":"How many takbirs are recited during the funeral prayer according to this narration?","id":"muslim-11-227"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) recited four takbirs.\"","reference":"Sahih Muslim 954b, Book 11, Hadith 90","question #":"question #2","question":"How many takbirs are recited by the Prophet (ﷺ) in certain Islamic practices?","id":"muslim-11-228"},{"hadith-eng":"The hadith as narrated by Shaibani has been narrated through another chain of transmitters.","reference":"Sahih Muslim 954c, Book 11, Hadith 91","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-11-229"},{"hadith-eng":"Anas reported that the Messenger of Allah (ﷺ) observed prayer on the grave.","reference":"Sahih Muslim 955, Book 11, Hadith 92","question #":"question #2","question":"How does the practice of praying at a grave relate to the remembrance of the deceased in Islam?","id":"muslim-11-230"},{"hadith-eng":"Lead me to her (or his) grave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.","reference":"Sahih Muslim 956, Book 11, Hadith 93","question #":"question #2","question":"How does the Prophet's action demonstrate the significance of praying for the deceased?","id":"muslim-11-231"},{"hadith-eng":"The Messenger of Allah (ﷺ) recited thus.","reference":"Sahih Muslim 957, Book 11, Hadith 94","question #":"question #2","question":"Why might there be variations in the number of takbirs recited during funeral prayers?","id":"muslim-11-232"},{"hadith-eng":"Whenever you see a funeral procession, stand up for that until it moves away or is lowered on the ground.","reference":"Sahih Muslim 958a, Book 11, Hadith 95","question #":"question #2","question":"How should one behave when encountering a funeral procession according to Islamic teachings?","id":"muslim-11-233"},{"hadith-eng":"Should any one of you come across a funeral procession, and if he does not intend to accompany it, he must stand up until it passes by him or is placed upon the ground before it passes him.","reference":"Sahih Muslim 958b, Book 11, Hadith 96","question #":"question #2","question":"Why is it important to show respect to a funeral procession even if one does not intend to accompany it?","id":"muslim-11-234"},{"hadith-eng":"Should anyone amongst you see a bier he must stand up so long as it is within sight in case he does not intend to follow it.","reference":"Sahih Muslim 958c, Book 11, Hadith 97","question #":"question #2","question":"How should one behave when a funeral bier is within sight according to Islamic teachings?","id":"muslim-11-235"},{"hadith-eng":"When you follow a bier, do not sit until it is placed on the (ground).","reference":"Sahih Muslim 959a, Book 11, Hadith 98","question #":"question #2","question":"Why is it important to remain standing until a bier is placed on the ground during a funeral?","id":"muslim-11-236"},{"hadith-eng":"Whenever you come across a bier you should stand up, and he who follows it should not sit down till it is placed on the ground.","reference":"Sahih Muslim 959b, Book 11, Hadith 99","question #":"question #2","question":"What etiquette should be observed by those following a funeral procession?","id":"muslim-11-237"},{"hadith-eng":"There passed a bier and the Prophet (ﷺ) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.","reference":"Sahih Muslim 960a, Book 11, Hadith 100","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate respect for the deceased, regardless of their faith?","id":"muslim-11-238"},{"hadith-eng":"Ibn Juraij told me that Abu Zubair heard Jabir say that the Prophet (ﷺ) kept standing for a bier until it disappeared.","reference":"Sahih Muslim 960b, Book 11, Hadith 101","question #":"question #2","question":"How does the Prophet's action of standing for a bier reflect respect for the deceased?","id":"muslim-11-239"},{"hadith-eng":"Again Abu Zubair heard Jabir say that the Prophet (ﷺ) and his Companions kept standing for a bier of a Jew until it disappeared from sight.","reference":"Sahih Muslim 960c, Book 11, Hadith 102","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate respect and compassion towards people of other faiths?","id":"muslim-11-240"},{"hadith-eng":"Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"","reference":"Sahih Muslim 961a, 961b, Book 11, Hadith 103","question #":"question #2","question":"How does Islam view the respect and dignity of non-Muslims after death?","id":"muslim-11-241"},{"hadith-eng":"Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Prophet (ﷺ) stood up first (for a bier) and then sat down.","reference":"Sahih Muslim 962a, Book 11, Hadith 104","question #":"question #2","question":"How do different companions of the Prophet (ﷺ) interpret his actions during funeral processions?","id":"muslim-11-242"},{"hadith-eng":"Verily, the Prophet (ﷺ) used to stand first but later on kept sitting; but it is also narrated that Nafi' ibn Jubair saw Waqid b. 'Amr standing for a bier till it was placed down.","reference":"Sahih Muslim 962b, Book 11, Hadith 105","question #":"question #2","question":"How did the Prophet Muhammad's (ﷺ) practice regarding standing for a bier change over time?","id":"muslim-11-243"},{"hadith-eng":"This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters.","reference":"Sahih Muslim 962c, Book 11, Hadith 106","question #":"question #2","question":"How does the consistency of a hadith's narration affect its credibility?","id":"muslim-11-244"},{"hadith-eng":"I heard from Mas'ud b. al-Hakam who narrated it on the authority of Hadrat 'Ali that he said: We saw the Prophet (ﷺ) stood up for a (bier) and we also stood up; he sat down and we too sat down.","reference":"Sahih Muslim 962d, Book 11, Hadith 107","question #":"question #2","question":"How did the companions demonstrate their respect and adherence to the Prophet's actions?","id":"muslim-11-245"},{"hadith-eng":"This hadith has been narrated by Shu'ba with the same chain of transmitters.","reference":"Sahih Muslim 962e, Book 11, Hadith 108","question #":"question #2","question":"How does the consistency of narration impact the reliability of a hadith?","id":"muslim-11-246"},{"hadith-eng":"I heard it from 'Auf b. Malik that the Prophet (ﷺ) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.","reference":"Sahih Muslim 963a, 963b, Book 11, Hadith 109","question #":"question #2","question":"How does the Prophet (ﷺ) ask Allah to cleanse the deceased from faults?","id":"muslim-11-247"},{"hadith-eng":"A hadith like this has been narrated through another chain of transmitters.","reference":"Sahih Muslim 963c, Book 11, Hadith 110","question #":"question #2","question":"How does the presence of different narrators affect the reliability of a hadith?","id":"muslim-11-248"},{"hadith-eng":"I heard the Prophet (ﷺ) say (while offering prayer on a dead body): O Allah! forgive him, have mercy upon him. Give him peace and absolve him. Receive him with honour and make his grave spacious. Wash him with water, snow and hail, cleanse him from faults as is cleaned a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate, and save him from the trial of the grave and torment of Hell. 'Auf b. Malik said: I earnestly desired that I were the dead person to receive the prayer of the Messenger of Allah (ﷺ) as this dead body had (received).","reference":"Sahih Muslim 963d, Book 11, Hadith 111","question #":"question #2","question":"How does the prayer for the deceased reflect the Islamic beliefs about the afterlife and purification?","id":"muslim-11-249"},{"hadith-eng":"I prayed behind the Messenger of Allah (ﷺ) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.","reference":"Sahih Muslim 964a, Book 11, Hadith 112","question #":"question #2","question":"How does Islamic tradition address the funeral rites for a woman who dies during childbirth?","id":"muslim-11-250"},{"hadith-eng":"This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.","reference":"Sahih Muslim 964b, Book 11, Hadith 113","question #":"question #2","question":"How does the omission of a narrator affect the understanding of a hadith?","id":"muslim-11-251"},{"hadith-eng":"I was a young boy during the time of the Prophet (ﷺ) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (ﷺ) over a woman who had died in the state of delivery, and the Messenger of Allah (ﷺ) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"","reference":"Sahih Muslim 964c, Book 11, Hadith 114","question #":"question #2","question":"How does age and experience influence the sharing of knowledge in Islamic gatherings?","id":"muslim-11-252"},{"hadith-eng":"It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Prophet (ﷺ) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.","reference":"Sahih Muslim 965a, Book 11, Hadith 115","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) accompany him during his activities as described in this account?","id":"muslim-11-253"},{"hadith-eng":"then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Prophet (ﷺ) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?","reference":"Sahih Muslim 965b, Book 11, Hadith 116","question #":"question #2","question":"What can be inferred about the rewards in Paradise for those who are righteous according to Islamic teachings?","id":"muslim-11-254"},{"hadith-eng":"\" Make a niche for me in the side of the grave and set up bricks over me as was done in case of Allah's Messenger (ﷺ).","reference":"Sahih Muslim 966, Book 11, Hadith 117","question #":"question #2","question":"How did the companions of the Prophet Muhammad (ﷺ) ensure their burial practices aligned with his?","id":"muslim-11-255"},{"hadith-eng":"Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (ﷺ).","reference":"Sahih Muslim 967, Book 11, Hadith 118","question #":"question #2","question":"What are the traditional practices observed during the burial of a Muslim?","id":"muslim-11-256"},{"hadith-eng":"When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (ﷺ) commanding (us) to level the grave.","reference":"Sahih Muslim 968, Book 11, Hadith 119","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) implement his teachings regarding burial rituals?","id":"muslim-11-257"},{"hadith-eng":"Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It. This hadith has been reported by Habib with the same chain of transmitters and he said: (Do not leave) a picture without obliterating it.","reference":"Sahih Muslim 969a, 969b, Book 11, Hadith 120","question #":"question #2","question":"What actions are recommended concerning images and elevated graves in Islamic teachings?","id":"muslim-11-258"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.","reference":"Sahih Muslim 970a, Book 11, Hadith 121","question #":"question #2","question":"Why is it discouraged to use graves as sitting places in Islam?","id":"muslim-11-259"},{"hadith-eng":"A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.","reference":"Sahih Muslim 970b, Book 11, Hadith 122","question #":"question #2","question":"What is the importance of verifying the authenticity of a hadith through its chain of narrators?","id":"muslim-11-260"},{"hadith-eng":"Jabir said that he was forbidden to plaster graves.","reference":"Sahih Muslim 970c, Book 11, Hadith 123","question #":"question #2","question":"Why might certain practices related to graves be prohibited in Islam?","id":"muslim-11-261"},{"hadith-eng":"It is better that one of you should sit on live coals which would burn his clothing and come in contact with his skin than that he should sit on a grave.","reference":"Sahih Muslim 971a, Book 11, Hadith 124","question #":"question #2","question":"What actions are considered disrespectful when visiting a graveyard according to Islamic principles?","id":"muslim-11-262"},{"hadith-eng":"A hadith like this has been narrated by Suhail with the same chain of transmitters.","reference":"Sahih Muslim 971b, Book 11, Hadith 125","question #":"question #2","question":"How does the repetition of a hadith by different narrators affect its authenticity?","id":"muslim-11-263"},{"hadith-eng":"Do not sit on the graves and do not pray facing towards them.","reference":"Sahih Muslim 972a, Book 11, Hadith 126","question #":"question #2","question":"Why is it discouraged to pray facing towards graves in Islam?","id":"muslim-11-264"},{"hadith-eng":"Do not pray facing towards the graves, and do not sit on them.","reference":"Sahih Muslim 972b, Book 11, Hadith 127","question #":"question #2","question":"Why is it discouraged to sit on graves in Islam?","id":"muslim-11-265"},{"hadith-eng":"How soon the people have forgotten that the Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.","reference":"Sahih Muslim 973a, Book 11, Hadith 128","question #":"question #2","question":"How did A'isha respond to the disapproval of people regarding her decision to bring the bier into the mosque?","id":"muslim-11-266"},{"hadith-eng":"How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.","reference":"Sahih Muslim 973b, Book 11, Hadith 129","question #":"question #2","question":"How did A'isha respond to the criticism regarding the funeral prayer being held in the mosque?","id":"muslim-11-267"},{"hadith-eng":"Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (ﷺ) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.","reference":"Sahih Muslim 973c, Book 11, Hadith 130","question #":"question #2","question":"How did Aisha justify her decision to offer funeral prayers in the mosque for Sa'd b. Abu Waqqas?","id":"muslim-11-268"},{"hadith-eng":"Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".","reference":"Sahih Muslim 974a, Book 11, Hadith 131","question #":"question #2","question":"How does the Prophet Muhammad (peace be upon him) demonstrate his connection with the deceased believers?","id":"muslim-11-269"},{"hadith-eng":"Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah (ﷺ)? We said: Yes. She said: When it was my turn for Allah's Messenger (ﷺ) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.","reference":"Sahih Muslim 974b, Book 11, Hadith 132","question #":"question #2","question":"How did 'A'isha react when she noticed the Prophet Muhammad (ﷺ) leaving at night, and what did she do?","id":"muslim-11-270"},{"hadith-eng":"\" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"","reference":"Sahih Muslim 975, Book 11, Hadith 133","question #":"question #2","question":"How does visiting a graveyard serve as a reminder of mortality and the afterlife in Islamic teachings?","id":"muslim-11-271"},{"hadith-eng":"I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.","reference":"Sahih Muslim 976a, Book 11, Hadith 134","question #":"question #2","question":"How does the Prophet's interaction with Allah regarding his mother illustrate the concept of divine permission?","id":"muslim-11-272"},{"hadith-eng":"The Apostle of Allah (ﷺ) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.","reference":"Sahih Muslim 976b, Book 11, Hadith 135","question #":"question #2","question":"Why was the Prophet Muhammad (ﷺ) not granted permission to seek forgiveness for his mother?","id":"muslim-11-273"},{"hadith-eng":"I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.","reference":"Sahih Muslim 977a, Book 11, Hadith 136","question #":"question #2","question":"What are the guidelines regarding the consumption and preservation of sacrificial meat in Islam?","id":"muslim-11-274"},{"hadith-eng":"This hadith has been narrated through another chain of transmitters.","reference":"Sahih Muslim 977b, Book 11, Hadith 137","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-11-275"},{"hadith-eng":"(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah (ﷺ), but he did not offer prayers for him.","reference":"Sahih Muslim 978, Book 11, Hadith 138","question #":"question #2","question":"How does the treatment of a person who has taken their own life differ in Islamic funeral practices?","id":"muslim-11-276"},{"hadith-eng":"Exhort to recite\" There is no god but Allah\" to those of you who are dying.","reference":"Sahih Muslim 916a, Book 11, Hadith 1","question #":"question #3","question":"What guidance is provided for those attending to a dying person in Islam?","id":"muslim-11-277"},{"hadith-eng":"This hadith has been narrated by Sulaiman b. Bilal with the same chain of transmitters.","reference":"Sahih Muslim 916b, Book 11, Hadith 2","question #":"question #3","question":"Why is it important to have multiple narrators for the same hadith?","id":"muslim-11-278"},{"hadith-eng":"Exhort to recite\" There is no god but Allah\" to those of you who are dying.","reference":"Sahih Muslim 917, Book 11, Hadith 3","question #":"question #3","question":"What guidance is provided for those attending to a dying person in Islam?","id":"muslim-11-279"},{"hadith-eng":"If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (ﷺ). I then said the words, and Allah gave me God's Messenger (ﷺ) in exchange. She said: The Messenger of Allah (ﷺ) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).","reference":"Sahih Muslim 918a, Book 11, Hadith 4","question #":"question #3","question":"What lessons can be learned from Umm Salama's experience regarding dealing with loss and receiving unexpected blessings?","id":"muslim-11-280"},{"hadith-eng":"If any servant (of Allah) who suffers a calamity says:\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" ' Allah will give him reward for affliction, and would give him something better than it in exchange. She (Umm Salama) said: When Abu Salama died. I uttered (these very words) as I was commanded (to do) by the Messenger of Allah (ﷺ). So Allah gave me better in exchange than him. i. e. (I was taken as the wife of) the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 918b, Book 11, Hadith 5","question #":"question #3","question":"What can be learned from Umm Salama's experience about the rewards of patience and supplication in Islam?","id":"muslim-11-281"},{"hadith-eng":"\" When Abu Salama died I said: Who is better than Abu Salama, the Companion of the Messenger of Allah (ﷺ), and Allah decided for me and I said (these words contained in the supplication mentioned above) and I was married to the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 918c, Book 11, Hadith 6","question #":"question #3","question":"What role does patience and trust in Allah play when facing the death of a loved one?","id":"muslim-11-282"},{"hadith-eng":"Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Messenger of Allah (ﷺ) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).","reference":"Sahih Muslim 919, Book 11, Hadith 7","question #":"question #3","question":"What is the recommended supplication for someone who has lost a loved one, according to the Prophet Muhammad (ﷺ)?","id":"muslim-11-283"},{"hadith-eng":"The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.","reference":"Sahih Muslim 920a, Book 11, Hadith 8","question #":"question #3","question":"What are the recommended supplications for someone who has passed away in Islam?","id":"muslim-11-284"},{"hadith-eng":"(O Allah! ) let Thee be the caretaker of what is left by him, and he said: Grant him expansion of the grave, but he did not say: Make his grave spacious. Khalid said: He supplicated for the seventh (thing too) which I have forgotten.","reference":"Sahih Muslim 920b, Book 11, Hadith 9","question #":"question #3","question":"What are the common elements included in prayers for the deceased in Islam?","id":"muslim-11-285"},{"hadith-eng":"Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.","reference":"Sahih Muslim 921a, Book 11, Hadith 10","question #":"question #3","question":"What does Islamic belief say about the connection between the soul and the body at the moment of death?","id":"muslim-11-286"},{"hadith-eng":"This hadith is narrated on the authority of 'Ala' with the same chain of transmitters.","reference":"Sahih Muslim 921b, Book 11, Hadith 11","question #":"question #3","question":"Why is it important to mention the authority or source when narrating a hadith?","id":"muslim-11-287"},{"hadith-eng":"When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (ﷺ) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.","reference":"Sahih Muslim 922, Book 11, Hadith 12","question #":"question #3","question":"What guidance does Islam provide to those who are in a foreign land and experiencing loss?","id":"muslim-11-288"},{"hadith-eng":"While we were with the Messenger of Allah (ﷺ), one of his daughters sent to him (the Messenger) to call him and inform him that her child or her son was dying. The Messenger of Allah (ﷺ) told the messenger to go back and tell her that what Allah had taken belonged to Him, and to him belonged what He granted; and He has an appointed time for everything. So you (the messenger) order her to show endurance and seek reward from Allah. The messenger came back and said: She adjures him to come to her. He got up to go accompanied by Sa'd b. 'Ubada, Mu'adh b. Jabal, and I also went along with them. The child was lifted to him and his soul was feeling as restless as if it was in an old (waterskin). His (Prophet's) eyes welled up with tears. Sa'd said: What is this, Messenger of Allah? He replied: This is compassion which Allah has placed in the hearts of His servants, and God shows compassion only to those of His servants who are compassionate.","reference":"Sahih Muslim 923a, Book 11, Hadith 13","question #":"question #3","question":"How is compassion viewed in Islam, and what role does it play in the lives of believers?","id":"muslim-11-289"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters on the authority of 'Asim al-Ahwal.","reference":"Sahih Muslim 923b, Book 11, Hadith 14","question #":"question #3","question":"What role do authoritative sources like Sahih Muslim play in the preservation of hadiths?","id":"muslim-11-290"},{"hadith-eng":"Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (ﷺ) wept. When the people saw Allah's Messenger (ﷺ) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.","reference":"Sahih Muslim 924, Book 11, Hadith 15","question #":"question #3","question":"What does this hadith teach about the reasons for divine punishment or mercy in Islam?","id":"muslim-11-291"},{"hadith-eng":"While we were sitting with the Messenger of Allah (ﷺ), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (ﷺ) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (ﷺ) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (ﷺ) and his Companions with him came near him (Sa'd b. 'Ubada).","reference":"Sahih Muslim 925, Book 11, Hadith 16","question #":"question #3","question":"What can be learned about the simplicity and humility of the Prophet and his companions from their journey to visit Sa'd b. 'Ubada?","id":"muslim-11-292"},{"hadith-eng":"Endurance is to be shown at the first blow.","reference":"Sahih Muslim 926a, Book 11, Hadith 17","question #":"question #3","question":"Why is the initial reaction to a hardship important in Islamic teachings?","id":"muslim-11-293"},{"hadith-eng":"Fear Allah and show endurance. She (not recognising him) said: You have not been afflicted as I have been. When he (the Holy Prophet) had departed, it was said to her that he was the Messenger of Allah (ﷺ), she was mortally shocked. She came to his door and she did not find doorkeepers at his door. She said: Messenger of Allah. I did not recognise you. He said: Endurance is to be shown at first blow, or at the first blow.","reference":"Sahih Muslim 926b, Book 11, Hadith 18","question #":"question #3","question":"What can be learned about the Prophet's approach to comforting those in distress from this incident?","id":"muslim-11-294"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) happened to pass by a woman (who was sitting) by the side of a grave.\"","reference":"Sahih Muslim 926c, Book 11, Hadith 19","question #":"question #3","question":"What lessons can be derived from the Prophet's encounters with individuals at graves?","id":"muslim-11-295"},{"hadith-eng":"Be quiet, my daughter. Don't you know that the Messenger of Allah (ﷺ) had said:\" The deceased is punished because of his family's weeping over the death\"?","reference":"Sahih Muslim 927a, Book 11, Hadith 20","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding expressions of grief for the deceased?","id":"muslim-11-296"},{"hadith-eng":"The dead is punished in the grave because of wailing on it.","reference":"Sahih Muslim 927b, Book 11, Hadith 21","question #":"question #3","question":"What actions should be avoided to prevent punishment of the deceased in the grave?","id":"muslim-11-297"},{"hadith-eng":"The same hadith is narrated on the authority of 'Umar through another chain of transmitters.","reference":"Sahih Muslim 927c, Book 11, Hadith 22","question #":"question #3","question":"What role does 'Umar play in the transmission of hadiths in Islamic tradition?","id":"muslim-11-298"},{"hadith-eng":"When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the weeping of the living\"?","reference":"Sahih Muslim 927d, Book 11, Hadith 23","question #":"question #3","question":"What are the consequences of excessive weeping for the dead in Islam?","id":"muslim-11-299"},{"hadith-eng":"O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of the living\"?","reference":"Sahih Muslim 927e, Book 11, Hadith 24","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding mourning practices?","id":"muslim-11-300"},{"hadith-eng":"What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (ﷺ) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).","reference":"Sahih Muslim 927f, Book 11, Hadith 25","question #":"question #3","question":"What was 'A'isha's clarification regarding the punishment for being lamented upon, and how does it relate to different communities?","id":"muslim-11-301"},{"hadith-eng":"O Hafsa, did you not hear the Messenger of Allah (ﷺ) saying:\" One who is lamented would be punished\"? Suhaib also lamented over him. 'Umar told him also: O Suhaib, didn't you know that one who is lamented is punished?","reference":"Sahih Muslim 927g, Book 11, Hadith 26","question #":"question #3","question":"What advice did Umar give regarding lamentation based on the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-11-302"},{"hadith-eng":"I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (ﷺ) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (ﷺ) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.","reference":"Sahih Muslim 928a, 927h, 929a, Book 11, Hadith 27","question #":"question #3","question":"What are the differing views on the punishment of the deceased due to family lamentation according to Islamic teachings?","id":"muslim-11-303"},{"hadith-eng":"The daughter of 'Uthman b. 'Affan died in Mecca. We came to attend her (funeral). Ibn 'Umar and Ibn 'Abbas were also present there, and I was sitting between them. He added: I (first sat) by the side of one of them, then the other one came and he sat by my side. 'Abdullah b. 'Umar said to 'Amr b. 'Uthman who was sitting opposite to him: Will you not prevent the people from lamenting, for the Messenger of Allah (ﷺ) had said:\" The dead is punished because of the lamenting of his family for him\"? Ibn 'Abbas then said that Umar used to say someting of that nature, and then narrated saying: I proceeded from Mecca along with 'Umar till we reached al-Baida' and there was a party of riders under the shade of a tree. He said (to me): Go and find out who this party is. I cast a glance and there was Suhaib (in that party). So I informed him ('Umar) about it. He said: Call him to me. So I went back to Suhaib and said: Go and meet the Commander of the believers. When 'Umar was wounded, Suhaib came walling: Alas, for the brother! alas for the companion! 'Umar said: O Suhaib, do you wail for me, whereas the Messenger of Allah (ﷺ) said:\" The dead would be punished on account of the lamentation of the (members of his family)\"? Ibn 'Abbas said: When 'Umar died I made a mention of it to 'A'isha. She said: May Allah have mercy upon 'Umar! I swear by Allah that Allah's Messenger (ﷺ) never said that Allah would punish the believer because of the weeping (of any one of the members of his family), but he said that Allah would increase the punishment of the unbeliever because of the weeping of his family over him. 'A'isha said: The Qur'an is enough for you (when it states):\" No bearer of burden will bear another's burden\" (vi. 164). Thereupon Ibn 'Abbas said: Allah is He Who has caused laughter and weeping. Ibn Abu Mulaika said: By Allah, Ibn 'Umar said nothing.","reference":"Sahih Muslim 928b, 927i, 929b, Book 11, Hadith 28","question #":"question #3","question":"What does the Qur'an say about bearing the burdens of others, and how does it relate to the discussion on lamentation for the dead?","id":"muslim-11-304"},{"hadith-eng":"We were with the bier of Umm Aban, daughter of 'Uthman, and the rest of the hadith is the same, but he did not narrate it as a marfu' hadith on the authority of 'Umar from the Messenger of Allah (ﷺ) as it was narrated by Ayyub and Ibn Juraij, and the hadith narrated by them (Ayyub and Ibn Juraij) is more complete than that of 'Amr.","reference":"Sahih Muslim 929c, Book 11, Hadith 29","question #":"question #3","question":"What is the role of a narrator's authority in the classification of a hadith as marfu'?","id":"muslim-11-305"},{"hadith-eng":"The dead is punished because of the lamentation of the living.","reference":"Sahih Muslim 930, Book 11, Hadith 30","question #":"question #3","question":"What is the Islamic perspective on mourning and lamentation for the deceased?","id":"muslim-11-306"},{"hadith-eng":"May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (ﷺ) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.","reference":"Sahih Muslim 931, Book 11, Hadith 31","question #":"question #3","question":"What can be inferred about the importance of accurate transmission of hadiths from the interaction between A'isha and Ibn 'Umar?","id":"muslim-11-307"},{"hadith-eng":"He (Ibn 'Umar) missed (the point). The Messenger of Allah (ﷺ) had (in fact) said: He (the dead) is punished for his faults or for his sins, and the members of his family are wailing for him now. (This misunderstanding of Ibn 'Umar is similar to his saying: ) The Messenger of Allah (ﷺ) stood by the well in which were lying the dead bodies of those polytheists who had been killed on the Day of Badr, and he said to them what he had to say, i. e.: They hear what I say. But he (Ibn 'Umar) misunderstood. The Prophet (ﷺ) had only said: They (the dead) understand that what I used to say to them was truth. She then recited:\" Certainly, thou canst not make the dead hear the call\" (xxvii. 80), nor can you make those hear who are in the graves, nor can you inform them when they have taken their seats in Hell.","reference":"Sahih Muslim 932a, Book 11, Hadith 32","question #":"question #3","question":"What does Islamic teaching say about the ability of the dead to hear or understand after death?","id":"muslim-11-308"},{"hadith-eng":"This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters. The hadith narrated by Abu Usama is more complete.","reference":"Sahih Muslim 932b, Book 11, Hadith 33","question #":"question #3","question":"Why might different narrators provide varying levels of detail in their accounts of the same event?","id":"muslim-11-309"},{"hadith-eng":"The dead is punished because of the lamentation of the living. Upon this 'A'isha said: May Allah have mercy upon the father of 'Abd al-Rahman (Ibn 'Umar). He did not tell a lie, but he forgot or made a mistake. The Messenger of Allah (ﷺ) happened to pass by a (dead) Jewess who was being lamented. Upon this he said: They weep over her and she is being punished in the grave.","reference":"Sahih Muslim 932c, Book 11, Hadith 34","question #":"question #3","question":"What does the hadith imply about the consequences faced by the deceased in the grave?","id":"muslim-11-310"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.","reference":"Sahih Muslim 933a, Book 11, Hadith 35","question #":"question #3","question":"What is the Islamic perspective on expressing grief and mourning for the deceased?","id":"muslim-11-311"},{"hadith-eng":"A hadith like this has been narrated by Mughira b. Shu'ba from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 933b, Book 11, Hadith 36","question #":"question #3","question":"How are hadiths authenticated and referenced in Islamic tradition?","id":"muslim-11-312"},{"hadith-eng":"This hadith has been narrated from the Messenger of Allah (ﷺ) through another chain of transmitters.","reference":"Sahih Muslim 933c, Book 11, Hadith 37","question #":"question #3","question":"What role do different chains of transmitters play in the preservation of Islamic teachings?","id":"muslim-11-313"},{"hadith-eng":"Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.","reference":"Sahih Muslim 934, Book 11, Hadith 38","question #":"question #3","question":"How does Islam view the practice of seeking rain by stars and what is its significance in Islamic teachings?","id":"muslim-11-314"},{"hadith-eng":"I was looking (at him) through the crevice of the door. A man came to him and mentioned that Ja'far's women were lamenting. He (the Holy Prophet) commanded him to go and forbid them (to do so). So he went away but came back and told (him) that they did not obey (him). He commanded him a second time to go and forbid them (to do so). He again went but came back to him and said: I swear by God, Messenger of Allah, that they have overpowered us. She ('A'isha) said that she thought the Messenger of Allah (ﷺ) had told (her) to throw dust in their mouths. Thereupon 'A'isha said: May Allah humble you! You did not do what Allah's Messenger (ﷺ) ordered you, nor did you stop annoying Allah's Messenger (ﷺ).","reference":"Sahih Muslim 935a, Book 11, Hadith 39","question #":"question #3","question":"What actions are discouraged in Islam when mourning the loss of a loved one?","id":"muslim-11-315"},{"hadith-eng":"\" You did not spare the Messenger of Allah (ﷺ) the botheration.\"","reference":"Sahih Muslim 935b, Book 11, Hadith 40","question #":"question #3","question":"What can be learned about the etiquette of interacting with religious leaders from this narration?","id":"muslim-11-316"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.","reference":"Sahih Muslim 936a, Book 11, Hadith 41","question #":"question #3","question":"What are the consequences of lamenting according to Islamic teachings?","id":"muslim-11-317"},{"hadith-eng":"Umm 'Atiyya reported that the Messenger of Allah (ﷺ) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) was Umm Sulaim.","reference":"Sahih Muslim 936b, Book 11, Hadith 42","question #":"question #3","question":"What can be learned from the example of those who fulfilled their promises in Islamic teachings?","id":"muslim-11-318"},{"hadith-eng":"When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (ﷺ) said: (Yes) but only in case of the members of such a tribe.","reference":"Sahih Muslim 937, Book 11, Hadith 43","question #":"question #3","question":"What is the significance of wailing in the context of pre-Islamic and Islamic practices?","id":"muslim-11-319"},{"hadith-eng":"We were forbidden to follow the bier, but it was not made absolute on us.","reference":"Sahih Muslim 938a, Book 11, Hadith 44","question #":"question #3","question":"What are the implications of a non-absolute prohibition in Islamic teachings?","id":"muslim-11-320"},{"hadith-eng":"We were refrained from following the bier, but it was not made absolute on us.","reference":"Sahih Muslim 938b, Book 11, Hadith 45","question #":"question #3","question":"How does Islamic tradition address the participation of women in funeral rites?","id":"muslim-11-321"},{"hadith-eng":"The Apostle of Allah (ﷺ) came to us when we were bathing his daughter, and he told us: Wash her with water and (with the leaves of) the lote tree, three or five times, or more than that if you think fit, and put camphor or something like camphor in the last washing; then inform me when you have finished. So when we had finished, we informed him, and he gave to us his (own) under-garment saying:\" Put it next her body.\"","reference":"Sahih Muslim 939a, Book 11, Hadith 46","question #":"question #3","question":"How does the Prophet Muhammad's personal involvement in funeral rites reflect his care and concern for his family?","id":"muslim-11-322"},{"hadith-eng":"We braided her hair in three plaits.","reference":"Sahih Muslim 939b, Book 11, Hadith 47","question #":"question #3","question":"What role do women play in the preparation of a body for burial in Islamic customs?","id":"muslim-11-323"},{"hadith-eng":"One of the daughters of the Messenger of Allah (ﷺ) died. And in the hadith transmitted by Ibn 'Ulayya (the words are): The Messenger of Allah (ﷺ) came to us and we were washing his daughter. And in the hadith transmitted by Malik (the words are): There came in (our apartment) the Messenger of Allah (way peace be upon him) when his daughter died. The rest of the hadith is the same as narrated by Yazid b. Zurai' from Ayyub from Muhammad from Umm 'Atiyya.","reference":"Sahih Muslim 939c, Book 11, Hadith 48","question #":"question #3","question":"What is the significance of the Prophet's presence during the washing of his daughter's body in Islamic tradition?","id":"muslim-11-324"},{"hadith-eng":"\" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority of Umm 'Atiyya: We braided (the hair) of her head in three plaits.","reference":"Sahih Muslim 939d, Book 11, Hadith 49","question #":"question #3","question":"What is the significance of braiding the hair of a deceased person in Islamic funeral rites?","id":"muslim-11-325"},{"hadith-eng":"We washed her an odd number of times, i. e. three, five or seven times; and Umm 'Atiyya (further) said: We braided her hair in three plaits.","reference":"Sahih Muslim 939e, Book 11, Hadith 50","question #":"question #3","question":"What are the steps involved in preparing a body for burial according to Islamic tradition?","id":"muslim-11-326"},{"hadith-eng":"When Zainab the daughter of the Messenger of Allah (ﷺ) died, he said to us: Wash her odd number of times, i. e. three or five times, and put camphor or something-like camphor at the fifth time, and after you have washed her inform me. So we informed him and he gave us his under-garment, saying:\" Put it next her body.\"","reference":"Sahih Muslim 939f, Book 11, Hadith 51","question #":"question #3","question":"Why might the Prophet Muhammad (ﷺ) have instructed the use of his under-garment for Zainab's burial preparation?","id":"muslim-11-327"},{"hadith-eng":"There came to us the Messenger of Allah (ﷺ) as we were washing one of his daughters. So he said: Wash her (dead body) an odd number of times, five times or more than that, the rest of the hadith is the same. She (further) said: We braided her hair in three plaits: (two) on the sides of her head and one on her forehead.","reference":"Sahih Muslim 939g, Book 11, Hadith 52","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the preparation of a deceased body for burial?","id":"muslim-11-328"},{"hadith-eng":"Umm 'Atiyya reported that when the Messenger of Allah (ﷺ) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.","reference":"Sahih Muslim 939h, Book 11, Hadith 53","question #":"question #3","question":"How does the practice of wudu' relate to the preparation of a body for burial in Islam?","id":"muslim-11-329"},{"hadith-eng":"Umm 'Atiyya reported that the Messenger of Allah (ﷺ) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.","reference":"Sahih Muslim 939i, Book 11, Hadith 54","question #":"question #3","question":"What guidance is provided for women in performing the washing rituals in Islamic tradition?","id":"muslim-11-330"},{"hadith-eng":"We migrated with the Messenger of Allah (ﷺ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (ﷺ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.","reference":"Sahih Muslim 940a, Book 11, Hadith 55","question #":"question #3","question":"What lesson can be learned from the Prophet's (ﷺ) instructions on how to shroud Mus'ab b. 'Umair after his martyrdom?","id":"muslim-11-331"},{"hadith-eng":"A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.","reference":"Sahih Muslim 940b, Book 11, Hadith 56","question #":"question #3","question":"Why is it important to have multiple narrations of the same hadith from different transmitters?","id":"muslim-11-332"},{"hadith-eng":"I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.","reference":"Sahih Muslim 941a, Book 11, Hadith 57","question #":"question #3","question":"What considerations are taken into account when choosing burial garments in Islam?","id":"muslim-11-333"},{"hadith-eng":"I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (ﷺ) was not shrouded! So he gave it in charity.","reference":"Sahih Muslim 941b, Book 11, Hadith 58","question #":"question #3","question":"What considerations are made when choosing burial garments in Islam?","id":"muslim-11-334"},{"hadith-eng":"This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah b. Abu Bakr.","reference":"Sahih Muslim 941c, Book 11, Hadith 59","question #":"question #3","question":"Why is it important to compare different narrations of the same hadith?","id":"muslim-11-335"},{"hadith-eng":"I asked 'A'isha with how many garments the Messenger of Allah (ﷺ) was shourded. She said: With three garments of Sahul.","reference":"Sahih Muslim 941d, Book 11, Hadith 60","question #":"question #3","question":"Who provided the information about the shrouding of the Prophet Muhammad (ﷺ) in this narration?","id":"muslim-11-336"},{"hadith-eng":"When the Messenger of Allah (may peace be upom him) died, he was covered with a Yamani wrapper.","reference":"Sahih Muslim 942a, Book 11, Hadith 61","question #":"question #3","question":"How was the practice of covering the deceased observed in the time of the Prophet Muhammad (peace be upon him)?","id":"muslim-11-337"},{"hadith-eng":"This hadith has been narrated by Zuhri with the same chain of transmitters.","reference":"Sahih Muslim 942b, Book 11, Hadith 62","question #":"question #3","question":"Why is it important to document the sources and chains of narration in Islamic tradition?","id":"muslim-11-338"},{"hadith-eng":"Allah's Messenger (ﷺ) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (ﷺ) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (ﷺ) also said: When any one of you shrouds his brother, he should shroud him well.","reference":"Sahih Muslim 943, Book 11, Hadith 63","question #":"question #3","question":"Under what circumstances is it permissible to bury someone at night in Islam?","id":"muslim-11-339"},{"hadith-eng":"Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.","reference":"Sahih Muslim 944a, Book 11, Hadith 64","question #":"question #3","question":"What are the implications of a person's character on the community during a funeral according to Islamic teachings?","id":"muslim-11-340"},{"hadith-eng":"\" I do not know whether the hadith is marfu'.\"","reference":"Sahih Muslim 944b, Book 11, Hadith 65","question #":"question #3","question":"What are the implications of a hadith being marfu' in Islamic jurisprudence?","id":"muslim-11-341"},{"hadith-eng":"Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.","reference":"Sahih Muslim 944c, Book 11, Hadith 66","question #":"question #3","question":"What are the benefits of promptly conducting a funeral for both the deceased and the community?","id":"muslim-11-342"},{"hadith-eng":"He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira reached him, he said:\" We have lost many qirats.\"","reference":"Sahih Muslim 945a, Book 11, Hadith 67","question #":"question #3","question":"What impact did the hadith about funeral attendance have on the practices of the companions of the Prophet (ﷺ)?","id":"muslim-11-343"},{"hadith-eng":"\" two great mountains.\" No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abd al- A'la (the words are):\" till (the burial) is complete.\" In the hadith transmitted by 'Abd ar-Razzaq (the words are):\" till he is placed in the grave.\"","reference":"Sahih Muslim 945b, Book 11, Hadith 68","question #":"question #3","question":"What is the importance of the burial process in Islamic tradition?","id":"muslim-11-344"},{"hadith-eng":"\" He who followed it (the bier) till he (the dead) is buried.\"","reference":"Sahih Muslim 945c, Book 11, Hadith 69","question #":"question #3","question":"How does participating in the burial process reflect on one's faith and community responsibilities?","id":"muslim-11-345"},{"hadith-eng":"He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.","reference":"Sahih Muslim 945d, Book 11, Hadith 70","question #":"question #3","question":"What is the meaning of 'qirat' in the context of rewards for funeral rites?","id":"muslim-11-346"},{"hadith-eng":"He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.","reference":"Sahih Muslim 945f, Book 11, Hadith 71","question #":"question #3","question":"What can be learned from the practice of seeking confirmation from knowledgeable individuals in religious matters?","id":"muslim-11-347"},{"hadith-eng":"He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) said: Abu Huraira, what is a qirat? He said: It is like the hill of Uhud.","reference":"Sahih Muslim 945e, Book 11, Hadith 72","question #":"question #3","question":"How is the concept of qirat explained in the context of funeral rites?","id":"muslim-11-348"},{"hadith-eng":"Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (ﷺ) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.","reference":"Sahih Muslim 945g, Book 11, Hadith 73","question #":"question #3","question":"What role does verifying the authenticity of a hadith play in Islamic practice and belief?","id":"muslim-11-349"},{"hadith-eng":"He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.","reference":"Sahih Muslim 946a, Book 11, Hadith 74","question #":"question #3","question":"What does the term 'qirat' represent in the context of rewards for funeral rites?","id":"muslim-11-350"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) was asked about qirat, and he said: It is equivalent to Uhud.\"","reference":"Sahih Muslim 946b, Book 11, Hadith 75","question #":"question #3","question":"What did the Prophet Muhammad (ﷺ) convey about the value of 'qirat' when asked by his companions?","id":"muslim-11-351"},{"hadith-eng":"If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.","reference":"Sahih Muslim 947, Book 11, Hadith 76","question #":"question #3","question":"What role does intercession play in Islamic funeral rites and prayers for the deceased?","id":"muslim-11-352"},{"hadith-eng":"So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (ﷺ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.","reference":"Sahih Muslim 948, Book 11, Hadith 77","question #":"question #3","question":"What role does the concept of intercession play in Islamic funeral practices?","id":"muslim-11-353"},{"hadith-eng":"There passed a bier (being carried by people) and it was lauded in good terms. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. 'Umar said: May my father and mother be ransom for you! There passed a bier and it was praised in good terms, and you said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words, and you said: It has become certain, it has become certain, it has become certain. Upon this the Messenger of Allah (way peace be upon him) said: He whom you praised in good terms, Paradise has become certain for him, and he whom you condemned in bad words, Hell has become certain for him. You are Allah's witnesses in the earth, you are Allah's witnesses in the earth, you are Allah's witnesses in the earth.","reference":"Sahih Muslim 949a, Book 11, Hadith 78","question #":"question #3","question":"What role do humans play as witnesses of Allah on earth according to Islamic teachings?","id":"muslim-11-354"},{"hadith-eng":"This hadith has been narrated through another chain of transmitters.","reference":"Sahih Muslim 949b, Book 11, Hadith 79","question #":"question #3","question":"Why is it important to consider various sources when studying Islamic teachings?","id":"muslim-11-355"},{"hadith-eng":"Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.","reference":"Sahih Muslim 950a, Book 11, Hadith 80","question #":"question #3","question":"What are the different types of relief mentioned in relation to death in Islamic tradition?","id":"muslim-11-356"},{"hadith-eng":"(The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.","reference":"Sahih Muslim 950b, Book 11, Hadith 81","question #":"question #3","question":"What are the implications of a believer's transition from worldly hardships to divine mercy?","id":"muslim-11-357"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) gave the people news of the death of Negus on the day he died, and he took them out to the place of prayer and observed four takbirs.","reference":"Sahih Muslim 951a, Book 11, Hadith 82","question #":"question #3","question":"What is the importance of communal prayer in Islam when a significant event occurs?","id":"muslim-11-358"},{"hadith-eng":"The Messenger of Allah (ﷺ) gave us the news of the death of Negus, the ruler of Abyssinia, on the day when he died, and he said (to us): Beg pardon for your brother. Ibn Shihab said that Sa'id b. Musayyib had told that Abu Huraira had narrated to him that the Messenger of Allah (ﷺ) drew them up in a row in a place of prayer, and offered prayer and recited four takbirs for him.","reference":"Sahih Muslim 951b, Book 11, Hadith 83","question #":"question #3","question":"What is the role of takbirs in the funeral prayer according to Islamic tradition?","id":"muslim-11-359"},{"hadith-eng":"This hadith is narrated through another chain of transmitters.","reference":"Sahih Muslim 951c, Book 11, Hadith 84","question #":"question #3","question":"What role do different chains of transmitters play in the preservation of Islamic teachings?","id":"muslim-11-360"},{"hadith-eng":"Jabir b. 'Abdullah reported that the Messenger of Allah (ﷺ) offered prayer for Ashama, the Negus, and recited four takbirs.","reference":"Sahih Muslim 952a, Book 11, Hadith 85","question #":"question #3","question":"Who was Ashama, the Negus, and what was his relationship with the Prophet Muhammad (ﷺ)?","id":"muslim-11-361"},{"hadith-eng":"There died today the pious servant of Allah, Ashama. So he stood up and led us in (funeral prayer) over him.","reference":"Sahih Muslim 952b, Book 11, Hadith 86","question #":"question #3","question":"What actions are recommended for Muslims when they hear about the death of a righteous person?","id":"muslim-11-362"},{"hadith-eng":"A brother of yours has died, so stand up and offer prayer over him. So we stood up and drew ourselves up into two rows.","reference":"Sahih Muslim 952c, Book 11, Hadith 87","question #":"question #3","question":"What actions are recommended for Muslims when a fellow believer passes away?","id":"muslim-11-363"},{"hadith-eng":"A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"","reference":"Sahih Muslim 953, Book 11, Hadith 88","question #":"question #3","question":"What is the importance of communal prayer for the deceased in Islamic tradition?","id":"muslim-11-364"},{"hadith-eng":"I said to Sha'bi: Who narrated it to you? He said: An authentic one, 'Abdullah b. 'Abbas. This is the word of a hasan hadith. In the narration of Ibn Numair (the words are): The Messenger of Allah (ﷺ) went to the grave which had been newly prepared and prayed over it, and they also prayed who were behind him and he recited four takbirs. I said to 'Amir: Who narrated it to you? He said: An authentic one who saw him, i e. Ibn 'Abbas.","reference":"Sahih Muslim 954a, Book 11, Hadith 89","question #":"question #3","question":"Who is considered a reliable source for narrating hadiths in this context?","id":"muslim-11-365"},{"hadith-eng":"\" The Apostle of Allah (ﷺ) recited four takbirs.\"","reference":"Sahih Muslim 954b, Book 11, Hadith 90","question #":"question #3","question":"What are the variations in the number of takbirs recited in different narrations of hadith?","id":"muslim-11-366"},{"hadith-eng":"The hadith as narrated by Shaibani has been narrated through another chain of transmitters.","reference":"Sahih Muslim 954c, Book 11, Hadith 91","question #":"question #3","question":"What role do different chains of transmitters play in the study of hadith literature?","id":"muslim-11-367"},{"hadith-eng":"Anas reported that the Messenger of Allah (ﷺ) observed prayer on the grave.","reference":"Sahih Muslim 955, Book 11, Hadith 92","question #":"question #3","question":"What are the implications of the Prophet's actions regarding prayer at graves for Islamic burial practices?","id":"muslim-11-368"},{"hadith-eng":"Lead me to her (or his) grave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.","reference":"Sahih Muslim 956, Book 11, Hadith 93","question #":"question #3","question":"What is the impact of the Prophet's prayer on the graves of the deceased according to this narration?","id":"muslim-11-369"},{"hadith-eng":"The Messenger of Allah (ﷺ) recited thus.","reference":"Sahih Muslim 957, Book 11, Hadith 94","question #":"question #3","question":"How does the practice of reciting takbirs at funerals relate to the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-11-370"},{"hadith-eng":"Whenever you see a funeral procession, stand up for that until it moves away or is lowered on the ground.","reference":"Sahih Muslim 958a, Book 11, Hadith 95","question #":"question #3","question":"What actions are recommended when a funeral procession passes by in Islam?","id":"muslim-11-371"},{"hadith-eng":"Should any one of you come across a funeral procession, and if he does not intend to accompany it, he must stand up until it passes by him or is placed upon the ground before it passes him.","reference":"Sahih Muslim 958b, Book 11, Hadith 96","question #":"question #3","question":"What actions should be taken when a funeral procession passes by according to Islamic teachings?","id":"muslim-11-372"},{"hadith-eng":"Should anyone amongst you see a bier he must stand up so long as it is within sight in case he does not intend to follow it.","reference":"Sahih Muslim 958c, Book 11, Hadith 97","question #":"question #3","question":"What actions are recommended if one does not intend to follow a funeral procession?","id":"muslim-11-373"},{"hadith-eng":"When you follow a bier, do not sit until it is placed on the (ground).","reference":"Sahih Muslim 959a, Book 11, Hadith 98","question #":"question #3","question":"How does Islamic tradition guide the behavior of individuals during a funeral procession?","id":"muslim-11-374"},{"hadith-eng":"Whenever you come across a bier you should stand up, and he who follows it should not sit down till it is placed on the ground.","reference":"Sahih Muslim 959b, Book 11, Hadith 99","question #":"question #3","question":"When is it appropriate to sit down after following a bier in a funeral procession?","id":"muslim-11-375"},{"hadith-eng":"There passed a bier and the Prophet (ﷺ) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.","reference":"Sahih Muslim 960a, Book 11, Hadith 100","question #":"question #3","question":"What does this narration teach about the universal nature of death and its impact on people?","id":"muslim-11-376"},{"hadith-eng":"Ibn Juraij told me that Abu Zubair heard Jabir say that the Prophet (ﷺ) kept standing for a bier until it disappeared.","reference":"Sahih Muslim 960b, Book 11, Hadith 101","question #":"question #3","question":"What can be learned from the Prophet's behavior regarding funeral processions?","id":"muslim-11-377"},{"hadith-eng":"Again Abu Zubair heard Jabir say that the Prophet (ﷺ) and his Companions kept standing for a bier of a Jew until it disappeared from sight.","reference":"Sahih Muslim 960c, Book 11, Hadith 102","question #":"question #3","question":"What lessons can be learned about interfaith relations from the actions of the Prophet (ﷺ) and his Companions in this context?","id":"muslim-11-378"},{"hadith-eng":"Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"","reference":"Sahih Muslim 961a, 961b, Book 11, Hadith 103","question #":"question #3","question":"What does this narration teach about the universal value of human life and soul in Islam?","id":"muslim-11-379"},{"hadith-eng":"Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Prophet (ﷺ) stood up first (for a bier) and then sat down.","reference":"Sahih Muslim 962a, Book 11, Hadith 104","question #":"question #3","question":"What is the significance of following the actions of the Prophet (ﷺ) in funeral rites?","id":"muslim-11-380"},{"hadith-eng":"Verily, the Prophet (ﷺ) used to stand first but later on kept sitting; but it is also narrated that Nafi' ibn Jubair saw Waqid b. 'Amr standing for a bier till it was placed down.","reference":"Sahih Muslim 962b, Book 11, Hadith 105","question #":"question #3","question":"What can be inferred about the flexibility of practices related to funeral rites in Islam from this narration?","id":"muslim-11-381"},{"hadith-eng":"This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters.","reference":"Sahih Muslim 962c, Book 11, Hadith 106","question #":"question #3","question":"Why is it important to have multiple narrations of the same hadith?","id":"muslim-11-382"},{"hadith-eng":"I heard from Mas'ud b. al-Hakam who narrated it on the authority of Hadrat 'Ali that he said: We saw the Prophet (ﷺ) stood up for a (bier) and we also stood up; he sat down and we too sat down.","reference":"Sahih Muslim 962d, Book 11, Hadith 107","question #":"question #3","question":"What can be learned about the etiquette of following the Prophet's example in communal settings?","id":"muslim-11-383"},{"hadith-eng":"This hadith has been narrated by Shu'ba with the same chain of transmitters.","reference":"Sahih Muslim 962e, Book 11, Hadith 108","question #":"question #3","question":"Why is it important to have multiple narrations of the same hadith?","id":"muslim-11-384"},{"hadith-eng":"I heard it from 'Auf b. Malik that the Prophet (ﷺ) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.","reference":"Sahih Muslim 963a, 963b, Book 11, Hadith 109","question #":"question #3","question":"What are the benefits and rewards mentioned for the deceased in the Prophet's (ﷺ) prayer?","id":"muslim-11-385"},{"hadith-eng":"A hadith like this has been narrated through another chain of transmitters.","reference":"Sahih Muslim 963c, Book 11, Hadith 110","question #":"question #3","question":"Why is it important to compare various chains of transmitters in hadith studies?","id":"muslim-11-386"},{"hadith-eng":"I heard the Prophet (ﷺ) say (while offering prayer on a dead body): O Allah! forgive him, have mercy upon him. Give him peace and absolve him. Receive him with honour and make his grave spacious. Wash him with water, snow and hail, cleanse him from faults as is cleaned a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate, and save him from the trial of the grave and torment of Hell. 'Auf b. Malik said: I earnestly desired that I were the dead person to receive the prayer of the Messenger of Allah (ﷺ) as this dead body had (received).","reference":"Sahih Muslim 963d, Book 11, Hadith 111","question #":"question #3","question":"What is the significance of asking for forgiveness and mercy for the deceased in Islam?","id":"muslim-11-387"},{"hadith-eng":"I prayed behind the Messenger of Allah (ﷺ) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.","reference":"Sahih Muslim 964a, Book 11, Hadith 112","question #":"question #3","question":"What are the specific practices followed in the funeral prayer according to the Prophet's example?","id":"muslim-11-388"},{"hadith-eng":"This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.","reference":"Sahih Muslim 964b, Book 11, Hadith 113","question #":"question #3","question":"Why is it important to verify the presence of all narrators in a hadith chain?","id":"muslim-11-389"},{"hadith-eng":"I was a young boy during the time of the Prophet (ﷺ) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (ﷺ) over a woman who had died in the state of delivery, and the Messenger of Allah (ﷺ) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"","reference":"Sahih Muslim 964c, Book 11, Hadith 114","question #":"question #3","question":"What considerations are made in Islamic funeral prayers for a woman who dies during childbirth?","id":"muslim-11-390"},{"hadith-eng":"It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Prophet (ﷺ) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.","reference":"Sahih Muslim 965a, Book 11, Hadith 115","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) use of transportation from this event?","id":"muslim-11-391"},{"hadith-eng":"then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Prophet (ﷺ) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?","reference":"Sahih Muslim 965b, Book 11, Hadith 116","question #":"question #3","question":"How is the concept of Paradise depicted in terms of rewards for believers in Islam?","id":"muslim-11-392"},{"hadith-eng":"\" Make a niche for me in the side of the grave and set up bricks over me as was done in case of Allah's Messenger (ﷺ).","reference":"Sahih Muslim 966, Book 11, Hadith 117","question #":"question #3","question":"What significance does the method of setting up bricks in a grave hold in Islamic burial customs?","id":"muslim-11-393"},{"hadith-eng":"Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (ﷺ).","reference":"Sahih Muslim 967, Book 11, Hadith 118","question #":"question #3","question":"How was the burial of the Prophet Muhammad (ﷺ) conducted according to Islamic traditions?","id":"muslim-11-394"},{"hadith-eng":"When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (ﷺ) commanding (us) to level the grave.","reference":"Sahih Muslim 968, Book 11, Hadith 119","question #":"question #3","question":"What are the instructions given by the Prophet (ﷺ) concerning the preparation of graves?","id":"muslim-11-395"},{"hadith-eng":"Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It. This hadith has been reported by Habib with the same chain of transmitters and he said: (Do not leave) a picture without obliterating it.","reference":"Sahih Muslim 969a, 969b, Book 11, Hadith 120","question #":"question #3","question":"How did 'Ali (b. Abu Talib) convey the mission given to him by the Prophet Muhammad (ﷺ)?","id":"muslim-11-396"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.","reference":"Sahih Muslim 970a, Book 11, Hadith 121","question #":"question #3","question":"What is the significance of prohibiting the construction of buildings over graves in Islamic teachings?","id":"muslim-11-397"},{"hadith-eng":"A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.","reference":"Sahih Muslim 970b, Book 11, Hadith 122","question #":"question #3","question":"How does the transmission of hadiths contribute to the preservation of Islamic teachings?","id":"muslim-11-398"},{"hadith-eng":"Jabir said that he was forbidden to plaster graves.","reference":"Sahih Muslim 970c, Book 11, Hadith 123","question #":"question #3","question":"How does Islamic tradition guide the treatment and maintenance of graves?","id":"muslim-11-399"},{"hadith-eng":"It is better that one of you should sit on live coals which would burn his clothing and come in contact with his skin than that he should sit on a grave.","reference":"Sahih Muslim 971a, Book 11, Hadith 124","question #":"question #3","question":"How does Islam emphasize the importance of maintaining decorum in sacred places such as graveyards?","id":"muslim-11-400"},{"hadith-eng":"A hadith like this has been narrated by Suhail with the same chain of transmitters.","reference":"Sahih Muslim 971b, Book 11, Hadith 125","question #":"question #3","question":"Why is it important to verify the chain of transmitters in Islamic teachings?","id":"muslim-11-401"},{"hadith-eng":"Do not sit on the graves and do not pray facing towards them.","reference":"Sahih Muslim 972a, Book 11, Hadith 126","question #":"question #3","question":"What are the etiquettes to be observed when visiting a graveyard according to Islamic teachings?","id":"muslim-11-402"},{"hadith-eng":"Do not pray facing towards the graves, and do not sit on them.","reference":"Sahih Muslim 972b, Book 11, Hadith 127","question #":"question #3","question":"How does the positioning of graves influence the conduct of prayer in Islam?","id":"muslim-11-403"},{"hadith-eng":"How soon the people have forgotten that the Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.","reference":"Sahih Muslim 973a, Book 11, Hadith 128","question #":"question #3","question":"What historical precedent did A'isha cite to justify her actions regarding the funeral prayer?","id":"muslim-11-404"},{"hadith-eng":"How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.","reference":"Sahih Muslim 973b, Book 11, Hadith 129","question #":"question #3","question":"What can be learned about the practices of the Prophet Muhammad (ﷺ) regarding funeral prayers from this narration?","id":"muslim-11-405"},{"hadith-eng":"Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (ﷺ) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.","reference":"Sahih Muslim 973c, Book 11, Hadith 130","question #":"question #3","question":"What historical precedent did Aisha cite to support her action of offering funeral prayers in the mosque?","id":"muslim-11-406"},{"hadith-eng":"Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".","reference":"Sahih Muslim 974a, Book 11, Hadith 131","question #":"question #3","question":"What are the supplications made by the Prophet Muhammad (peace be upon him) for the inhabitants of the graveyard?","id":"muslim-11-407"},{"hadith-eng":"Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah (ﷺ)? We said: Yes. She said: When it was my turn for Allah's Messenger (ﷺ) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.","reference":"Sahih Muslim 974b, Book 11, Hadith 132","question #":"question #3","question":"What is the significance of visiting the graveyard and praying for the deceased according to the Prophet Muhammad (ﷺ)?","id":"muslim-11-408"},{"hadith-eng":"\" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"","reference":"Sahih Muslim 975, Book 11, Hadith 133","question #":"question #3","question":"What is the importance of seeking peace for both the living and the deceased in Islamic tradition?","id":"muslim-11-409"},{"hadith-eng":"I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.","reference":"Sahih Muslim 976a, Book 11, Hadith 134","question #":"question #3","question":"What can be learned about the limitations of seeking forgiveness for others from this narration?","id":"muslim-11-410"},{"hadith-eng":"The Apostle of Allah (ﷺ) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.","reference":"Sahih Muslim 976b, Book 11, Hadith 135","question #":"question #3","question":"How does the act of visiting graves influence one's emotional and spiritual state?","id":"muslim-11-411"},{"hadith-eng":"I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.","reference":"Sahih Muslim 977a, Book 11, Hadith 136","question #":"question #3","question":"What are the Islamic rulings on the consumption of nabidh and intoxicating substances?","id":"muslim-11-412"},{"hadith-eng":"This hadith has been narrated through another chain of transmitters.","reference":"Sahih Muslim 977b, Book 11, Hadith 137","question #":"question #3","question":"Why is it important to consider various sources when studying hadith literature?","id":"muslim-11-413"},{"hadith-eng":"(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah (ﷺ), but he did not offer prayers for him.","reference":"Sahih Muslim 978, Book 11, Hadith 138","question #":"question #3","question":"What actions did the Prophet Muhammad (ﷺ) take when presented with the body of someone who committed suicide?","id":"muslim-11-414"}]