[{"hadith-eng":"The Messenger of Allah (ﷺ) said: Cleanliness is half of faith and al-Hamdu Lillah (all praise and gratitude is for Allah alone) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Lillah fill up what is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.","reference":"Sahih Muslim 223, Book 2, Hadith 1","question #":"question #1","question":"How is cleanliness related to faith in Islam?","id":"muslim-2-1"},{"hadith-eng":"'\" 'Abdullah bin 'Umar came to visit Ibn 'Amir when he was sick and he said: 'Won't you supplicate to Allah for me, O Ibn 'Umar ?' He said: 'I heard the Messenger of Allah (ﷺ) say: \"No Salat is accepted without Wudu' (purification), and no charity (is accepted) that comes from Ghulul [1] \" and you were the governor of Al-Basrah.' \"\r\n\r\n[1] Goods pilfered from the spoils of war prior to their authorized distribution.","reference":"Sahih Muslim 224a, Book 2, Hadith 2","question #":"question #1","question":"What is the significance of performing Wudu' before Salat in Islam?","id":"muslim-2-2"},{"hadith-eng":"A hadith like this is narrated from the Apostle (ﷺ) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.","reference":"Sahih Muslim 224b, Book 2, Hadith 3","question #":"question #1","question":"What is the significance of having a consistent chain of transmitters in the authentication of hadiths?","id":"muslim-2-3"},{"hadith-eng":"This is what has been transmitted to us by Abu Huraira from Muhammad, the Messenger of Allah (ﷺ) and then narrated a hadith out of them and observed that the Messenger of Allah (ﷺ) said: The prayer of none amongst you would be accepted in a state of impurity until he performs ablution.","reference":"Sahih Muslim 225, Book 2, Hadith 4","question #":"question #1","question":"Why is ablution necessary before performing prayers in Islam?","id":"muslim-2-4"},{"hadith-eng":"Uthman b. 'Affan called for ablution water and this is how he performed the ablution. He washed his hands thrice. He then rinsed his mouth and cleaned his nose with water (three times). He then washed his face three times, then washed his right arm up to the elbow three times, then washed his left arm like that, then wiped his head; then washed his right foot up to the ankle three times, then washed his left foot like that, and then said: I saw the Messenger of Allah (ﷺ) perform ablution like this ablution of mine. Then the Messenger of Allah (ﷺ) said: He who performs ablution like this ablution of mine and then stood up (for prayer) and offered two rak'ahs of prayer without allowing his thoughts to be distracted, all his previous sins are expiated. Ibn Shihab said: Our scholars remarked: This is the most complete of the ablutions performed for prayer.","reference":"Sahih Muslim 226a, Book 2, Hadith 5","question #":"question #1","question":"What are the steps involved in performing ablution according to the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-5"},{"hadith-eng":"I saw Uthman call for a vessel (of water) and poured water over his hands three times and then washed them. Then he put his right hand in the vessel and rinsed his mouth and cleaned his nose. Then he washed his face three times and his hands up to the elbow three times; then wiped his head, then washed his feet three times. Then he said that the Messenger of Allah (ﷺ) had said: He who performed ablution like this ablution of mine and offered two raka`ahs of prayer without allowing his thoughts to be distracted, all his previous sins would be expiated.","reference":"Sahih Muslim 226b, Book 2, Hadith 6","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by Uthman?","id":"muslim-2-6"},{"hadith-eng":"I heard from 'Uthman b. 'Affan and he was in the courtyard of the mosque, when the Mu'adhdhin (announcer of the prayer) came to him at the time of afternoon prayer. So the ('Uthman) called for the ablution water and performed ablution and then said: By Allah, I am narrating to you a hadith. If there were not a verse in the Book of Allah, I would have never narrated it to you. I heard Allah's Messenger (ﷺ) say: If a Muslim performs ablution and does it well and offers prayer, all his (sins) daring the period from one prayer to another would be pardoned by Allah.","reference":"Sahih Muslim 227a, Book 2, Hadith 7","question #":"question #1","question":"What is the significance of performing ablution well before prayer in Islam?","id":"muslim-2-7"},{"hadith-eng":"\" He who performed the ablution well and then offered the obligatory prayer.\"","reference":"Sahih Muslim 227b, Book 2, Hadith 8","question #":"question #1","question":"What is the significance of performing ablution well before offering prayers?","id":"muslim-2-8"},{"hadith-eng":"By Allah, I am narrating to you a hadith had there not been this verse in the Book of Allah. I would not have narrated it to you. Verily I heard the Messenger of Allah (ﷺ) say: Not a person is there who performed ablution, and did it well, then offered prayer, but his sins (which he committed) were not pardoned between the prayer that he offered and the next one. 'Urwa said: The verse is this:\" Those who suppress the clear proofs and the guidance which We have sent down\"... to His words:\" the Cursers\" (ii. 15).","reference":"Sahih Muslim 227c, Book 2, Hadith 9","question #":"question #1","question":"What is the significance of performing ablution well before offering prayer in Islam?","id":"muslim-2-9"},{"hadith-eng":"I was with Uthman, and he called for ablution water and said: I heard Allah's Messenger (ﷺ) say: When the time for a prescribed prayer comes, if any Muslim performs ablution well and offers his prayer with humility and bowing, it will be an expiation for his past sins, so long as he has not committed a major sin; and this applies for all times.","reference":"Sahih Muslim 228, Book 2, Hadith 10","question #":"question #1","question":"What is the significance of performing ablution well before prayer in Islam?","id":"muslim-2-10"},{"hadith-eng":"I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (ﷺ) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (ﷺ) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"","reference":"Sahih Muslim 229, Book 2, Hadith 11","question #":"question #1","question":"What is the significance of performing ablution in the manner demonstrated by the Prophet Muhammad (ﷺ)?","id":"muslim-2-11"},{"hadith-eng":"Should I not show you the ablution performed by Allah's Messenger (ﷺ)? And he then washed (the different parts of the body) three times. 4\" Qutaiba has added in his narration the words:\" There were with him (with Uthman) Companions of Allah's Messenger (ﷺ).\"","reference":"Sahih Muslim 230, Book 2, Hadith 12","question #":"question #1","question":"How did Uthman demonstrate the method of ablution as performed by the Prophet Muhammad (ﷺ)?","id":"muslim-2-12"},{"hadith-eng":"I used to fetch water for 'Uthman for his purification. Never was there a day that he did not take a bath with a small quantity of water. And Uthman said: The Messenger of Allah (ﷺ) at the time of our returning from our prayer told us (certain things pertaining to purification). Mis'ar said: I find that it was afternoon prayer. He said: I do not know whether I should tell you a thing or keep quiet. We said: Messenger of Allah, tell us if it is good and if it is otherwise, Allah and His Apostle know better. Upon this he said: A Muslim who purifies (himself) and completes purification as enjoined upon him by Allah and then offers the prayers, that will be expiation (of his sins he committed) between these (prayers).","reference":"Sahih Muslim 231a, Book 2, Hadith 13","question #":"question #1","question":"What is the significance of completing purification in Islam before performing prayers?","id":"muslim-2-13"},{"hadith-eng":"I heard Humran b. Aban narrate to Abu Burda in this very mosque during the governorship of Bishr that 'Uthman b. Alfan said: The Messenger of Allah (ﷺ) observed: He who completed ablution as Allah, the Exalted, enjoined upon him, his obligatory prayers would be explatious (for his minor sins that he would commit) during (the interval) between them. This hadith is transmitted by Ibn Mu'adh, and in the hadith narrated by Ghundar, the words\" during the governorship of Bishr\" are omitted and there is no mention of the obligatory prayers.","reference":"Sahih Muslim 231b, Book 2, Hadith 14","question #":"question #1","question":"What is the significance of completing ablution as prescribed by Allah in relation to the forgiveness of minor sins?","id":"muslim-2-14"},{"hadith-eng":"One day Uthman b. Affan performed the ablution well, and then said: I saw Allah's Messenger (ﷺ) perform ablution, the best ablution, and then observed: He who performed ablution like this and then went towards the mosque and nothing (but the love of) prayer urged him (to do so), all his previous (minor) sins would be expiated.","reference":"Sahih Muslim 232a, Book 2, Hadith 15","question #":"question #1","question":"What is the significance of performing ablution with excellence in Islam?","id":"muslim-2-15"},{"hadith-eng":"He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.","reference":"Sahih Muslim 232b, Book 2, Hadith 16","question #":"question #1","question":"What is the significance of performing ablution properly before prayer in Islam?","id":"muslim-2-16"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Five prayers and from one Friday prayer to (the next) Friday prayer is an expiation (of the sins committed in between their intervals) if major sins are not committed.","reference":"Sahih Muslim 233a, Book 2, Hadith 17","question #":"question #1","question":"What is the significance of the five daily prayers in the expiation of sins?","id":"muslim-2-17"},{"hadith-eng":"The five (daily) prayers and one Friday prayer to (the next) Friday prayer are expiations (for the sins committed in the intervals) between them.","reference":"Sahih Muslim 233b, Book 2, Hadith 18","question #":"question #1","question":"What is the significance of daily prayers in seeking forgiveness for sins in Islam?","id":"muslim-2-18"},{"hadith-eng":"Verily the Messenger of Allah (ﷺ) said: The five (daily) prayers and from one Friday prayer to the (next) Friday prayer, and from Ramadhan to Ramadhan are expiations for the (sins) committed in between (their intervals) provided one shuns the major sins.","reference":"Sahih Muslim 233c, Book 2, Hadith 19","question #":"question #1","question":"How do the daily prayers contribute to the expiation of sins in Islam?","id":"muslim-2-19"},{"hadith-eng":"We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (ﷺ) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umar who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.","reference":"Sahih Muslim 234a, Book 2, Hadith 20","question #":"question #1","question":"What are the spiritual benefits of performing ablution and praying with sincerity in Islam?","id":"muslim-2-20"},{"hadith-eng":"Verily the Messenger of Allah (ﷺ) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.","reference":"Sahih Muslim 234b, Book 2, Hadith 21","question #":"question #1","question":"What is the significance of the testimony of faith in Islam after performing ablution?","id":"muslim-2-21"},{"hadith-eng":"It was said to him (by people): Perform for us the ablution (as it was performed) by the Messenger of Allah (way peace be upon him). He ('Abdullah b. Zaid) called for a vessel (of water), and poured water from it on his hands and washed them three times. Then he inserted his hand (in the vessel) and brought it (water) out, rinsed his mouth and snuffed up water from the palm of one hand doing that three times, He again inserted his hand and brought it out and washed his face three times, then inserted his hand and brought it out and washed each arm up to the elbow twice, then inserted his hand and brought it out and wiped his head both front and back with his hands. He then washed his feet up to the ankles, and then said: This is how God's Messenger (peace be upon him) performed ablution.","reference":"Sahih Muslim 235a, Book 2, Hadith 22","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet Muhammad (peace be upon him)?","id":"muslim-2-22"},{"hadith-eng":"This hadith is narrated by Amr b. Yahya with the same chain of transmitters, but there is no mention of ankles.","reference":"Sahih Muslim 235b, Book 2, Hadith 23","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-2-23"},{"hadith-eng":"He moved them (his hands) for wiping to the front of his head and then the nape of his neck, then bringing them back till he reached the place from which he had begun, after which he washed his feet.","reference":"Sahih Muslim 235c, Book 2, Hadith 24","question #":"question #1","question":"What is the significance of rinsing the mouth and snuffing water into the nostrils during ablution?","id":"muslim-2-24"},{"hadith-eng":"This hadith has been narrated by Wuwb on the authority of 'Amr b. Yahyi with the same chain of transmitters and it has been mentioned therein: He rinsed his mouth. snuffed up water in nostrils and cleaned the nose with three handfuls and wiped his head moving (his hand) in front and then back once. Bahz said: Wuhaib narrated this hadith to me and Wuhaib said: Amr b. Yahya narrated to me this hadith twice.","reference":"Sahih Muslim 235d, Book 2, Hadith 25","question #":"question #1","question":"What are the steps involved in performing ablution as described in this narration?","id":"muslim-2-25"},{"hadith-eng":"He saw Allah's Messenger (ﷺ) perform the ablution. He rinsed his mouth then cleaned his nose, then washed his face three times, then washed his right hand thrice and then the other one, thrice. He then took fresh water and wiped his head and then washed his feet till he cleaned them.","reference":"Sahih Muslim 236, Book 2, Hadith 26","question #":"question #1","question":"What are the steps involved in performing ablution according to the Sunnah?","id":"muslim-2-26"},{"hadith-eng":"When anyone wipes himself with pebbles (after answering the call of nature) he must make use of an odd number and when any one of you performs ablution he must snuff in his nose water and then clean it.","reference":"Sahih Muslim 237a, Book 2, Hadith 27","question #":"question #1","question":"What is the significance of using an odd number of pebbles for cleaning after answering the call of nature?","id":"muslim-2-27"},{"hadith-eng":"This is what Abu Huraira transmitted to us from Muhammad, the Messenger of Allah (ﷺ), and he mentioned a number of a hadith, of which this is one: that the Messenger of Allah (ﷺ) said: When anyone amongst you (performs ablution) he must snuff his nostrils with water and then clean them.","reference":"Sahih Muslim 237b, Book 2, Hadith 28","question #":"question #1","question":"What is the significance of cleaning the nostrils during ablution in Islamic practice?","id":"muslim-2-28"},{"hadith-eng":"The Messenger of Allah (way peace he upon him) said: When anyone performs ablution he must clean his nose and when anyone wipes himself with pebbles (after answering the call of nature) he must do that odd number of times.","reference":"Sahih Muslim 237c, Book 2, Hadith 29","question #":"question #1","question":"What is the significance of cleaning the nose during ablution in Islamic practice?","id":"muslim-2-29"},{"hadith-eng":"It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (ﷺ) said like that.","reference":"Sahih Muslim 237d, Book 2, Hadith 30","question #":"question #1","question":"Who were the companions known for transmitting the sayings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-30"},{"hadith-eng":"The Apostle of Allah (ﷺ) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.","reference":"Sahih Muslim 238, Book 2, Hadith 31","question #":"question #1","question":"What is the significance of cleaning the nose during ablution upon waking from sleep?","id":"muslim-2-31"},{"hadith-eng":"When anyone wipes himself with pebbles (after answering the call of nature) he should do this odd number of times.","reference":"Sahih Muslim 239, Book 2, Hadith 32","question #":"question #1","question":"What is the significance of using an odd number of times when performing certain acts in Islamic rituals?","id":"muslim-2-32"},{"hadith-eng":"I came to 'A'isha, the wife of the Prophet (ﷺ), on the day when Sa'db. Abi Waqqas died. 'Abd al-Rahman b. Abu Bakr also came there and he performed ablution in her presence. She (Hadrat 'A'isha) said: Abd al-Rahman, complete the ablution as I heard the Allah's Messenger (ﷺ) say: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 240a, Book 2, Hadith 33","question #":"question #1","question":"What is the significance of completing ablution properly in Islam?","id":"muslim-2-33"},{"hadith-eng":"Abdullah, the freed slave of Shahddad, came to 'A'isha and transmitted from her a hadith like this (which she narrated) from the Prophet (ﷺ).","reference":"Sahih Muslim 240b, Book 2, Hadith 34","question #":"question #1","question":"Who was Abdullah in relation to Shahddad and what role did he play in the transmission of hadith?","id":"muslim-2-34"},{"hadith-eng":"I and 'Abd al-Rahman b. Abu Bakr went out (in order to join) the funeral procession of Sa'd b. Abi Waqqas and passed by the door of the residence of 'A'isha, and then he transmitted a hadith like this from her who (narrated it) from the Prophet (ﷺ).","reference":"Sahih Muslim 240c, Book 2, Hadith 35","question #":"question #1","question":"What is the significance of attending funeral processions in Islam?","id":"muslim-2-35"},{"hadith-eng":"I was in the presence of 'A'isha, and then narrated on her authority a hadith like this from the Prophet (way peace be upon him).","reference":"Sahih Muslim 240d, Book 2, Hadith 36","question #":"question #1","question":"What is the significance of narrating hadiths accurately and with proper authority?","id":"muslim-2-36"},{"hadith-eng":"We returned from Mecca to Medina with the Messenger of Allah (ﷺ), and when we came to some water on the way, some of the people were in a hurry at the time of the afternoon prayer and performed ablution hurriedly; and when we reached them, their heels were dry, no water had touched them. The Prophet (ﷺ) said: Woe to (dry) heels, because of Hell-fire. Make your ablution thorough.","reference":"Sahih Muslim 241a, Book 2, Hadith 37","question #":"question #1","question":"What is the significance of performing ablution thoroughly in Islam?","id":"muslim-2-37"},{"hadith-eng":"\" Complete the Wudu,\" and there is the name of Abu Yahya al-A'raj (a narrator).","reference":"Sahih Muslim 241b, Book 2, Hadith 38","question #":"question #1","question":"What is the significance of completing Wudu in Islamic practice?","id":"muslim-2-38"},{"hadith-eng":"The Messenger of Allah (ﷺ) lagged behind us on a journey. We travelled (back) and be took him; and then came the time of the afternoon prayer, and as we were going to wipe our feet he (the Holy Prophet) called out: Woe to the heels because of Hell-fire.","reference":"Sahih Muslim 241c, Book 2, Hadith 39","question #":"question #1","question":"What is the significance of properly washing the feet during ablution in Islam?","id":"muslim-2-39"},{"hadith-eng":"Allah's Apostle (ﷺ) saw a man who did not wash his heel and he remarked: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 242a, Book 2, Hadith 40","question #":"question #1","question":"What is the significance of washing the heels during ablution in Islam?","id":"muslim-2-40"},{"hadith-eng":"He saw people perform ablution with the help of a water jar and he said: Complete the Wudu for i heard Abu al-Qasim (ﷺ) say: Woe to the hamstrings because of hell-fire.","reference":"Sahih Muslim 242b, Book 2, Hadith 41","question #":"question #1","question":"What is the significance of completing ablution properly in Islamic practice?","id":"muslim-2-41"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 242c, Book 2, Hadith 42","question #":"question #1","question":"What is the significance of ensuring thoroughness in performing ablution in Islam?","id":"muslim-2-42"},{"hadith-eng":"'Umar b. Khattab said that a person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah (ﷺ) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.","reference":"Sahih Muslim 243, Book 2, Hadith 43","question #":"question #1","question":"What is the significance of performing ablution thoroughly in Islamic practice?","id":"muslim-2-43"},{"hadith-eng":"Allah's Messenger (ﷺ) said: When a bondsman-a Muslim or a believer-washes his face (in course of ablution), every sin he contemplated with his eyes, will be washed away from his face along with water, or with the last drop of water; when he washes his hands, every sin they wrought will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin towards which his feet have walked will be washed away with the water or with the last drop of water with the result that he comes out pure from all sins.","reference":"Sahih Muslim 244, Book 2, Hadith 44","question #":"question #1","question":"What is the spiritual significance of ablution in Islam?","id":"muslim-2-44"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) said: He who performed ablution well, his sins would come out from his body, even coming out from under his nails.","reference":"Sahih Muslim 245, Book 2, Hadith 45","question #":"question #1","question":"What is the significance of performing ablution well in the context of purification from sins?","id":"muslim-2-45"},{"hadith-eng":"I saw Abu Huraira perform ablution. He washed his face and washed it well. He then washed his right hand including a portion of his arm. He then washed his left hand including a portion of his arm. He then wiped his head. He then washed his right foot including his shank, and then washed his left foot including shank, and then said: This is how I saw Allah's Messenger (ﷺ) perform his ablution. And (Abu Huraira) added that the Messenger of Allah (ﷺ) had observed: You shall have your faces hands and feet bright on the Day of Resurrection because of your perfect ablution. He who can afford among you, let him increase the brightness of his forehead and that of hands and legs.","reference":"Sahih Muslim 246a, Book 2, Hadith 46","question #":"question #1","question":"What are the steps involved in performing ablution as demonstrated by the Prophet Muhammad (ﷺ)?","id":"muslim-2-46"},{"hadith-eng":"He saw Abu Huraira perform ablution. He washed his face and washed his hands up to the arms. He then washed his feet and reached up to the shanks and then said: I heard Allah's Messenger (ﷺ) say: My people would come with bright faces and bright hands and feet on account of the marks of ablution, so he who can increase the lustre of his forehead (and that of his hands and legs) should do so.","reference":"Sahih Muslim 246b, Book 2, Hadith 47","question #":"question #1","question":"What are the physical and spiritual benefits of performing ablution in Islam?","id":"muslim-2-47"},{"hadith-eng":"Verily Allah's Messenger (ﷺ) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.","reference":"Sahih Muslim 247a, Book 2, Hadith 48","question #":"question #1","question":"What are the characteristics of the Cistern of the Prophet Muhammad (ﷺ) as described in Islamic teachings?","id":"muslim-2-48"},{"hadith-eng":"My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.","reference":"Sahih Muslim 247b, Book 2, Hadith 49","question #":"question #1","question":"How are the believers recognized on the Day of Judgment according to Islamic teachings?","id":"muslim-2-49"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allah, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).","reference":"Sahih Muslim 248, Book 2, Hadith 50","question #":"question #1","question":"What is the significance of the Cistern of the Prophet Muhammad (ﷺ) as described in Islamic teachings?","id":"muslim-2-50"},{"hadith-eng":"The Messenger of Allah (ﷺ) came to the graveyard and said: \"Peace be upon you! The abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers.\" They (the hearers) said: Aren't we your brothers, O Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of Allah, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on foreheads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly, O Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out: Come, come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off.","reference":"Sahih Muslim 249a, Book 2, Hadith 51","question #":"question #1","question":"How does the Prophet Muhammad (ﷺ) describe his relationship with his companions and future followers?","id":"muslim-2-51"},{"hadith-eng":"The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.","reference":"Sahih Muslim 249b, Book 2, Hadith 52","question #":"question #1","question":"What is the significance of greeting the deceased in Islam?","id":"muslim-2-52"},{"hadith-eng":"I was (standing) behind Abu Huraira and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend (ﷺ) say. In a believer adornment would reach the places where ablution reaches.","reference":"Sahih Muslim 250, Book 2, Hadith 53","question #":"question #1","question":"What is the significance of performing ablution thoroughly in Islam?","id":"muslim-2-53"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.","reference":"Sahih Muslim 251a, Book 2, Hadith 54","question #":"question #1","question":"What actions can lead to the obliteration of sins and elevation of ranks in Islam?","id":"muslim-2-54"},{"hadith-eng":"This hadith has been narrated on the authority of `Ali b. `Abd al-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu`ba and in the hadith narrated by Malik \"Ribat\" has been mentioned twice. This is the \"Ribat\" for you, this is the \"Ribat\" for you.","reference":"Sahih Muslim 251b, Book 2, Hadith 55","question #":"question #1","question":"What is the significance of the term 'Ribat' in Islamic teachings?","id":"muslim-2-55"},{"hadith-eng":"The Apostle (ﷺ) said: Were it not that I might over-burden the believers-and in the hadith transmitted by Zuhair\" people\" -I would have ordered them to use toothstick at every time of prayer.","reference":"Sahih Muslim 252, Book 2, Hadith 56","question #":"question #1","question":"What is the significance of using a toothstick in Islamic practice?","id":"muslim-2-56"},{"hadith-eng":"I asked A'isha what Allah's Apostle (ﷺ) did first when he entered his house, and she replied: He used tooth-stick (first of all).","reference":"Sahih Muslim 253a, Book 2, Hadith 57","question #":"question #1","question":"What was the first action of the Prophet Muhammad (ﷺ) upon entering his house?","id":"muslim-2-57"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) entered his house, he used tooth-stick first of all.","reference":"Sahih Muslim 253b, Book 2, Hadith 58","question #":"question #1","question":"What is the significance of using a tooth-stick upon entering one's home in Islamic tradition?","id":"muslim-2-58"},{"hadith-eng":"I went to the Apostle (ﷺ) and found one end of the tooth-stick upon his tongue (i. e. he was rinsing his mouth).","reference":"Sahih Muslim 254, Book 2, Hadith 59","question #":"question #1","question":"What is the significance of using a tooth-stick in Islamic practice?","id":"muslim-2-59"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) got up for Tahajjud prayer, he cleansed his mouth with the tooth-stick.","reference":"Sahih Muslim 255a, Book 2, Hadith 60","question #":"question #1","question":"What is the significance of using a tooth-stick before performing the Tahajjud prayer?","id":"muslim-2-60"},{"hadith-eng":"for offering Tahajjud prayer.","reference":"Sahih Muslim 255b, Book 2, Hadith 61","question #":"question #1","question":"What is the significance of the Tahajjud prayer in Islamic practice?","id":"muslim-2-61"},{"hadith-eng":"Whenever he (the Holy Prophet) got up for prayer during the night, he cleansed his mouth with the tooth-stick.","reference":"Sahih Muslim 255c, Book 2, Hadith 62","question #":"question #1","question":"What is the significance of using a tooth-stick before performing prayers at night?","id":"muslim-2-62"},{"hadith-eng":"\" Verily in the creation of the heavens and the earth and the alternation of night and day.\" up to the (words)\" save us from the torment of Hell.\" He then returned to his house, used the tooth-stick, performed the ablution, and then got up and offered the prayer. He than lay down on the bed. and again got up and went out and looked towards the sky and recited this verse (mentioned above), then returned, used the tooth-stick, performed ablution and again offered the prayer.","reference":"Sahih Muslim 256, Book 2, Hadith 63","question #":"question #1","question":"What is the significance of observing the night sky in relation to worship and reflection in Islam?","id":"muslim-2-63"},{"hadith-eng":"Five are the acts quite akin to the Fitra, or five are the acts of Fitra: circumcision, shaving the pubes, cutting the nails, plucking the hair under the armpits and clipping the moustache.","reference":"Sahih Muslim 257a, Book 2, Hadith 64","question #":"question #1","question":"What are the acts considered part of the natural disposition (Fitra) in Islam?","id":"muslim-2-64"},{"hadith-eng":"Five are the acts of fitra: circumcision, removing the pubes, clipping the moustache, cutting the nails, plucking the hair under the armpits.","reference":"Sahih Muslim 257b, Book 2, Hadith 65","question #":"question #1","question":"What are the acts considered as part of the natural disposition (fitra) in Islam?","id":"muslim-2-65"},{"hadith-eng":"A time limit has been prescribed for us for clipping the moustache, cutting the nails, plucking hair under the armpits, shaving the pubes, that it should not be neglected far more than forty nights.","reference":"Sahih Muslim 258, Book 2, Hadith 66","question #":"question #1","question":"What are the recommended grooming practices in Islam regarding personal hygiene?","id":"muslim-2-66"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: Trim closely the moustache, and let the beard grow.","reference":"Sahih Muslim 259a, Book 2, Hadith 67","question #":"question #1","question":"What are the grooming practices recommended for Muslim men regarding facial hair?","id":"muslim-2-67"},{"hadith-eng":"The Apostle of Allah (ﷺ) ordered us to trim the moustache closely and spare the beard.","reference":"Sahih Muslim 259b, Book 2, Hadith 68","question #":"question #1","question":"What are the grooming practices recommended for Muslim men regarding facial hair?","id":"muslim-2-68"},{"hadith-eng":"The Messenger of Allah (may peace be opon him) said: Act against the polytheists, trim closely the moustache and grow beard.","reference":"Sahih Muslim 259c, Book 2, Hadith 69","question #":"question #1","question":"What are the grooming practices recommended for Muslims in relation to facial hair?","id":"muslim-2-69"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Trim closely the moustache, and grow beard, and thus act against the fire-worshippers.","reference":"Sahih Muslim 260, Book 2, Hadith 70","question #":"question #1","question":"What is the significance of maintaining distinct physical appearances in Islam compared to other religious groups?","id":"muslim-2-70"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Ten are the acts according to fitra: clipping the moustache, letting the beard grow, using the tooth-stick, snuffing water in the nose, cutting the nails, washing the finger joints, plucking the hair under the armpits, shaving the pubes and cleaning one's private parts with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.","reference":"Sahih Muslim 261a, Book 2, Hadith 71","question #":"question #1","question":"What are the natural acts of cleanliness and hygiene emphasized in Islamic teachings?","id":"muslim-2-71"},{"hadith-eng":"\" His father said: I forgot the tenth one.\"","reference":"Sahih Muslim 261b, Book 2, Hadith 72","question #":"question #1","question":"What is the significance of accurately remembering and transmitting the words of a hadith?","id":"muslim-2-72"},{"hadith-eng":"Your Apostle (ﷺ) teaches you about everything, even about excrement. He replied: Yes, he has forbidden us to face the Qibla at the time of excretion or urination, or cleansing with right hand or with less than three pebbles, or with dung or bone.","reference":"Sahih Muslim 262a, Book 2, Hadith 73","question #":"question #1","question":"What are the etiquettes and prohibitions related to relieving oneself in Islam?","id":"muslim-2-73"},{"hadith-eng":"I see that your friend even teaches you about the excrement. He replied; Yes, he has in fact forbidden us that anyone amongst us should cleanse himself with his right hand, or face the Qibla. He has forbidden the use of dung or bone for it, and he has also instructed us not to use less than three pebbles (for this purpose).","reference":"Sahih Muslim 262b, Book 2, Hadith 74","question #":"question #1","question":"What are the etiquettes of personal hygiene as taught in Islam?","id":"muslim-2-74"},{"hadith-eng":"The Messenger of Allah (ﷺ) forbade the use of bone or the droppings of camels for wiping (after excretion).","reference":"Sahih Muslim 263, Book 2, Hadith 75","question #":"question #1","question":"What materials are prohibited for use in cleaning oneself after excretion in Islamic teachings?","id":"muslim-2-75"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: Whenever you go to the desert, neither turn your face nor turn your back towards the Qibla while answering the call of nature, but face towards the east or the west. Abu Ayyub said: When we came to Syria we found that the latrines already built there were facing towards the Qibla. We turned our faces away from them and begged forgiveness of the Lord. He said: Yes.","reference":"Sahih Muslim 264, Book 2, Hadith 76","question #":"question #1","question":"What is the significance of facing away from the Qibla while answering the call of nature in Islam?","id":"muslim-2-76"},{"hadith-eng":"When any one amongst you squats for answering the call of nature, he should neither turn his face towards the Qibla nor turn his back towards it.","reference":"Sahih Muslim 265, Book 2, Hadith 77","question #":"question #1","question":"What are the guidelines for maintaining respect towards the Qibla during the act of relieving oneself?","id":"muslim-2-77"},{"hadith-eng":"I was offering my prayer in the mosque and Abdullah b. Umar was sitting there reclining with his back towards the Qibla. After completing my prayer. I went to him from one side. Abdullah said: People say when you go to the latrine, you should neither turn your face towards the Qibla nor towards Bait-ul-Maqdis. 'Abdullah said (farther): I went up to the roof of the house and saw the Messenger of Allah (ﷺ) squatting on two bricks for relieving himself with his face towards Bait-al-Maqdis.","reference":"Sahih Muslim 266a, Book 2, Hadith 78","question #":"question #1","question":"What is the significance of the direction one faces when relieving oneself in Islamic teachings?","id":"muslim-2-78"},{"hadith-eng":"I went up to the roof of the house of my sister Hafsa and saw the Messenger of Allah (ﷺ) relieving himself facing Syria. with his back to the Qibla.","reference":"Sahih Muslim 266b, Book 2, Hadith 79","question #":"question #1","question":"What is the significance of the direction one faces while relieving oneself in Islam?","id":"muslim-2-79"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: None of you should hold penis with his right hand while urinating, or wipe himself with his right hand in privy and should not breathe into the vessel (from which he drinks).","reference":"Sahih Muslim 267a, Book 2, Hadith 80","question #":"question #1","question":"What are the etiquettes prescribed for personal hygiene in Islam?","id":"muslim-2-80"},{"hadith-eng":"When anyone amongst you enters the privy he should not touch his penis with his right hand.","reference":"Sahih Muslim 267b, Book 2, Hadith 81","question #":"question #1","question":"What is the etiquette for using the bathroom in Islam regarding the use of hands?","id":"muslim-2-81"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) forbade (us) to breathe into the venel, to touch the penis with the right hand and to wipe after relieving with right hand.","reference":"Sahih Muslim 267c, Book 2, Hadith 82","question #":"question #1","question":"What are the etiquettes related to personal hygiene as taught by the Prophet Muhammad (peace be upon him)?","id":"muslim-2-82"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.","reference":"Sahih Muslim 268a, Book 2, Hadith 83","question #":"question #1","question":"What is the significance of starting actions from the right-hand side in Islamic practices?","id":"muslim-2-83"},{"hadith-eng":"The Messenger of Allah (ﷺ) loved to start from the right-hand side in his every act i. e. in wearing shoes, in combing (his hair) and in performing ablution.","reference":"Sahih Muslim 268b, Book 2, Hadith 84","question #":"question #1","question":"What is the significance of starting actions from the right side in Islamic practices?","id":"muslim-2-84"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Be on your guard against two things which provoke cursing. They (the companions present there) said: Messenger of Allah, what are those things which provoke cursing? He said: Easing on the thoroughfares or under the shades (where they take shelter and rest).","reference":"Sahih Muslim 269, Book 2, Hadith 85","question #":"question #1","question":"What actions are considered disrespectful and provoke cursing in public spaces?","id":"muslim-2-85"},{"hadith-eng":"The Messenger of Allah (ﷺ) entered an enclosure while a servant was following him with a jar of water and he was the youngest amongst us and he placed it by the side of a lote-tree. When the Messenger of Allah, (ﷺ) relieved himself, he came out and had cleansed himself with water.","reference":"Sahih Muslim 270, Book 2, Hadith 86","question #":"question #1","question":"What is the significance of using water for cleansing after relieving oneself in Islamic practice?","id":"muslim-2-86"},{"hadith-eng":"When the Messenger of Allah (ﷺ) entered the privy, a servant and I used to carry a skin of water, and a pointed staff, and he would cleanse himself with water.","reference":"Sahih Muslim 271a, Book 2, Hadith 87","question #":"question #1","question":"What practices did the Prophet (ﷺ) follow for personal hygiene after using the privy?","id":"muslim-2-87"},{"hadith-eng":"The Messenger of Allah (ﷺ) went to a far-off place in the desert (hidden from the sight of human beings) for relieving himself. Then I brought water for him and he cleansed himself.","reference":"Sahih Muslim 271b, Book 2, Hadith 88","question #":"question #1","question":"What practices did the Prophet Muhammad (ﷺ) follow for personal hygiene and cleanliness?","id":"muslim-2-88"},{"hadith-eng":"Jarir urinated, then performed ablution and wiped over the socks. It was said to him: Do you do like this? He said: Yes, I saw that the Messenger of Allah (ﷺ) urinated, then performed ablution and then wiped over his shoes. A'mash said: Ibrahim had observed that this hadith was a surprise for them (the people) because Jarir had embraced Islam after the revelation of Surat al-Ma'ida.","reference":"Sahih Muslim 272a, Book 2, Hadith 89","question #":"question #1","question":"What is the significance of wiping over socks in Islamic ablution practices?","id":"muslim-2-89"},{"hadith-eng":"\" This hadith surprised the friends of Abdullab'\" for Jarir had embraced Islam after the revelation of al-Ma'ida.","reference":"Sahih Muslim 272b, Book 2, Hadith 90","question #":"question #1","question":"What is the significance of the timing of Jarir's conversion to Islam in relation to the revelation of al-Ma'ida?","id":"muslim-2-90"},{"hadith-eng":"I was with the Messenger of Allah (ﷺ) when he came to the dumping ground of filth belonging to a particular tribe. He urinated while standing, and I went aside. He (the Holy Prophet) asked me to come near him and I went so near to him that I stood behind his heels. He then performed ablution and wiped over his socks.","reference":"Sahih Muslim 273a, Book 2, Hadith 91","question #":"question #1","question":"What is the significance of the Prophet's practice of urinating while standing in certain situations?","id":"muslim-2-91"},{"hadith-eng":"Abu Musa inflicted extreme rigour upon himself in the matter of urination and urinated in a bottle and said: When the skin of anyone amongst the people of Israel was besmeared with urine, he cut that portion with a cutter. Hudhaifa said: I wish that'your friend should not inflict such an extreme rigour. I and the Messenger of Allah (ﷺ) were going together till we reached the dumping ground of filth behind an enclosure. He stood up as one among you would stand up. and he urinated, I tried to turn away from him, but he beckoned to me, so I went to him and I stood behind him, till he had relieved himself.","reference":"Sahih Muslim 273b, Book 2, Hadith 92","question #":"question #1","question":"What does Islamic teaching say about the approach to cleanliness and hygiene in daily life?","id":"muslim-2-92"},{"hadith-eng":"The Messenger of Allah (ﷺ) went out for relieving himself. Mughira went with him carrying a jug full of water. When he (the Holy Prophet) came back after relieving himself, he poured water over him and he performed ablution and wiped over his socks; and in the narration of Ibn Rumh there is\" till\" instead of\" when\".","reference":"Sahih Muslim 274a, Book 2, Hadith 93","question #":"question #1","question":"What is the significance of performing ablution after relieving oneself in Islam?","id":"muslim-2-93"},{"hadith-eng":"\" He washed his face and hands, and wiped his head and then wiped his socks.\"","reference":"Sahih Muslim 274b, Book 2, Hadith 94","question #":"question #1","question":"What are the steps involved in performing wudoo' as described in this narration?","id":"muslim-2-94"},{"hadith-eng":"I was with the Messenger of Allah (ﷺ) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.","reference":"Sahih Muslim 274c, Book 2, Hadith 95","question #":"question #1","question":"What is the significance of wiping over socks during ablution in Islamic practice?","id":"muslim-2-95"},{"hadith-eng":"I was in the company of the Messenger of Allah (ﷺ) on a journey when he said: Mughira take hold of this jar (of water). I took hold of it and I went out with him. (I stopped but) the Messenger of Allah (ﷺ) proceeded on till he was out of my sight. He relieved himself and then came back and he was wearing a tight-sleeved Syrian gown. He tried to get his forearms out. but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I poured water over (his hands) and he performed ablution for prayer, then wiped over his socks and prayed.","reference":"Sahih Muslim 274d, Book 2, Hadith 96","question #":"question #1","question":"What is the significance of performing ablution before prayer in Islam?","id":"muslim-2-96"},{"hadith-eng":"The Messenger of Allah (ﷺ) went out for relieving himself. When he came back I brought for him a jar (of water) and poured water upon his hands and He washed his face. He tried to wash his forearms, but as the (sleeves of the) gown were tight. He, therefore, brought them out from under the gown. He then washed them, wiped his head, and wiped his socks and then prayed.","reference":"Sahih Muslim 274e, Book 2, Hadith 97","question #":"question #1","question":"What actions did the Prophet (ﷺ) perform as part of his ablution process before prayer?","id":"muslim-2-97"},{"hadith-eng":"I was one night with the Messenger of Allah (ﷺ) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.","reference":"Sahih Muslim 274f, Book 2, Hadith 98","question #":"question #1","question":"What is the significance of performing ablution while traveling according to Islamic teachings?","id":"muslim-2-98"},{"hadith-eng":"He (Mughira) helped the Apostle (ﷺ) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.","reference":"Sahih Muslim 274g, Book 2, Hadith 99","question #":"question #1","question":"What is the significance of wiping over shoes during ablution in Islamic practice?","id":"muslim-2-99"},{"hadith-eng":"The Messenger of Allah (ﷺ) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin b. 'Anf leading them and had completed a rak'a. When he perceived the presence of the Messenger of Allah (ﷺ) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle (ﷺ) got up and I also got up with him, and we offered the rak'a which had been finished before we came.","reference":"Sahih Muslim 274h, Book 2, Hadith 100","question #":"question #1","question":"What actions should be taken if one joins a congregational prayer after it has already started?","id":"muslim-2-100"},{"hadith-eng":"The Apostle of Allah (ﷺ) wiped over his socks and over his forehead and over his turban.","reference":"Sahih Muslim 274i, Book 2, Hadith 101","question #":"question #1","question":"What are the permissible areas to wipe over during ablution according to Islamic teachings?","id":"muslim-2-101"},{"hadith-eng":"This hadith has been transmitted by Ibn Mughira on the authority of his father by another chain of transmitters.","reference":"Sahih Muslim 274j, Book 2, Hadith 102","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-2-102"},{"hadith-eng":"Bakr reported that he had heard from the son of Mughira that verily the Messenger of Allah (ﷺ) performed ablution and wiped over his forehead and wiped over his turban and over his socks.","reference":"Sahih Muslim 274k, Book 2, Hadith 103","question #":"question #1","question":"What are the permissible areas to wipe over during ablution according to Islamic teachings?","id":"muslim-2-103"},{"hadith-eng":"\" Bilal narrated it to me.\"This tradition is transmitted by A'mash with this addition;, I saw the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 275, Book 2, Hadith 104","question #":"question #1","question":"What is the significance of wiping over socks and turbans in Islamic practice?","id":"muslim-2-104"},{"hadith-eng":"I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger (ﷺ). We asked him and he said: The Messenger of Allah (ﷺ) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.","reference":"Sahih Muslim 276a, Book 2, Hadith 105","question #":"question #1","question":"What is the prescribed duration for wiping over socks for travelers and residents in Islamic practice?","id":"muslim-2-105"},{"hadith-eng":"This hadith is narrated by Ubaidullah b. 'Amr and Zaid b. Abu Unaisa with the same chain of transmitters.","reference":"Sahih Muslim 276b, Book 2, Hadith 106","question #":"question #1","question":"What is the significance of having a reliable chain of transmitters in the authentication of hadiths?","id":"muslim-2-106"},{"hadith-eng":"I asked 'A'isha about wiping over the shoes. She said: You better go to 'Ali, for he knows more about this than I. I, therefore, came to 'Ali and he narrated from the Apostle (ﷺ) like this.","reference":"Sahih Muslim 276c, Book 2, Hadith 107","question #":"question #1","question":"Who is considered knowledgeable about the practice of wiping over shoes in Islamic tradition?","id":"muslim-2-107"},{"hadith-eng":"You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.","reference":"Sahih Muslim 277, Book 2, Hadith 108","question #":"question #1","question":"What is the significance of performing prayers with a single ablution in Islamic practice?","id":"muslim-2-108"},{"hadith-eng":"When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.","reference":"Sahih Muslim 278a, Book 2, Hadith 109","question #":"question #1","question":"What is the significance of washing one's hands upon waking up in Islamic teachings?","id":"muslim-2-109"},{"hadith-eng":"This hadith is transmitted from Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 278b, Book 2, Hadith 110","question #":"question #1","question":"What is the significance of Abu Huraira in the transmission of hadiths?","id":"muslim-2-110"},{"hadith-eng":"Zahri and Ibn Musayyab have both transmitted a hadith like this from Abu Huraira who narrated it from the Apostle (ﷺ).","reference":"Sahih Muslim 278c, Book 2, Hadith 111","question #":"question #1","question":"Who were the narrators involved in transmitting this hadith?","id":"muslim-2-111"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.","reference":"Sahih Muslim 278d, Book 2, Hadith 112","question #":"question #1","question":"Why is it recommended to wash hands three times upon waking up from sleep?","id":"muslim-2-112"},{"hadith-eng":"This hadith has been transmitted through other chains of transmitters on the authority of Abu Huraira in which it is reported that the Messenger of Allah (ﷺ) made a mention of washing the hand, and did not instruct to wash it three times. But the hadith narrated from Jabir and Ibn Musayyab. Abu Salama, and Abdullah b. Shaqiq, Abu Salih, Abla Razin, there is a mention of\" three times\".","reference":"Sahih Muslim 278e, Book 2, Hadith 113","question #":"question #1","question":"What is the significance of washing the hands in Islamic ritual purification?","id":"muslim-2-113"},{"hadith-eng":"When a dog licks a utensil belonging to any one of you, (the thing contained in it) should be thrown away and then (the utensil) should be washed seven times.","reference":"Sahih Muslim 279a, Book 2, Hadith 114","question #":"question #1","question":"What is the prescribed method for cleaning a utensil that has been licked by a dog?","id":"muslim-2-114"},{"hadith-eng":"This hadith has been transmitted by another chain of transmitters in which there is no mention of\" throwing away\".","reference":"Sahih Muslim 279b, Book 2, Hadith 115","question #":"question #1","question":"How can variations in the transmission of hadiths affect their interpretation?","id":"muslim-2-115"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: When a dog drinks out of a vessel belonging to any one of you, he must wash it seven times.","reference":"Sahih Muslim 279c, Book 2, Hadith 116","question #":"question #1","question":"What is the prescribed method for cleaning a vessel that a dog has drunk from?","id":"muslim-2-116"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: The purification of the utensil belonging to any one of you, after it is licked by a dog, lies in washing it seven times, using sand for the first time.","reference":"Sahih Muslim 279d, Book 2, Hadith 117","question #":"question #1","question":"What is the prescribed method for purifying a utensil that has been licked by a dog in Islamic teachings?","id":"muslim-2-117"},{"hadith-eng":"Of the a hadith narrated by Abu Huraira from Muhammad, the Messenger of Allah (ﷺ), one is this: The Messenger of Allah (ﷺ) said: The purification of the utensil belonging to one amongst you, after it is licked by a dog, lies in washing it seven times.","reference":"Sahih Muslim 279e, Book 2, Hadith 118","question #":"question #1","question":"What is the prescribed method for purifying a utensil that has been licked by a dog?","id":"muslim-2-118"},{"hadith-eng":"The Messenger of Allah (ﷺ) ordered killing of the dogs, and then said: What about them, i. e. about other dogs? and then granted concession (to keep) the dog for hunting and the dog for (the security) of the herd, and said: When the dog licks the utensil, wash it seven times, and rub it with earth the eighth time.","reference":"Sahih Muslim 280a, Book 2, Hadith 119","question #":"question #1","question":"What are the guidelines for keeping dogs in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-119"},{"hadith-eng":"\" He (the Holy Prophet) gave concession in the case of the dog for looking after the herd, for hunting and for watching the cultivated land,\" and there is no mention of this addition (i. e. concession in case of watching the cultivated lands) except in the hadith transmitted by Yahya.","reference":"Sahih Muslim 280b, Book 2, Hadith 120","question #":"question #1","question":"What are the permissible reasons for keeping a dog according to Islamic teachings?","id":"muslim-2-120"},{"hadith-eng":"The Messenger of Allah (ﷺ) forbade to urinate in stagnant water.","reference":"Sahih Muslim 281, Book 2, Hadith 121","question #":"question #1","question":"What are the environmental implications of urinating in stagnant water?","id":"muslim-2-121"},{"hadith-eng":"the Messenger of Allah (ﷺ) said: None amongst you should urinate in standing water, and then wash in it.","reference":"Sahih Muslim 282a, Book 2, Hadith 122","question #":"question #1","question":"What are the Islamic guidelines regarding cleanliness and hygiene in relation to water sources?","id":"muslim-2-122"},{"hadith-eng":"Of the ahadith narrated to us by Abfi Huraira from Muhammad the Messenger of Allah (ﷺ) one is this: The Messenger or Allah (ﷺ) said: You should not urinate in standing water, that is not flowing, then wash in it.","reference":"Sahih Muslim 282b, Book 2, Hadith 123","question #":"question #1","question":"What are the guidelines for maintaining cleanliness in water sources according to Islamic teachings?","id":"muslim-2-123"},{"hadith-eng":"None of you must wash in standing water when he is in a state of Junub. And Abu Huraira was asked how it was to be done; he said: It was to be taken out in handfuls.","reference":"Sahih Muslim 283, Book 2, Hadith 124","question #":"question #1","question":"What is the significance of avoiding washing in standing water while in a state of Junub?","id":"muslim-2-124"},{"hadith-eng":"A Bedouin urinated in the mosque. Some of the persons stood up (to reprimand him or to check him from doing so), but the Messenger of Allah (ﷺ) said: Leave him alone; don't interrupt him. He (the narrator) said: And when he had finished, he called for a bucket of water and poured it over.","reference":"Sahih Muslim 284a, Book 2, Hadith 125","question #":"question #1","question":"How should one handle situations where someone unknowingly disrespects a sacred place?","id":"muslim-2-125"},{"hadith-eng":"Leave him alone. When he had finished, the Messenger of Allah (ﷺ) ordered that a bucket (of water) should be brought and poured over it.","reference":"Sahih Muslim 284b, Book 2, Hadith 126","question #":"question #1","question":"How should one handle situations where someone unknowingly disrespects a sacred place?","id":"muslim-2-126"},{"hadith-eng":"While we were in the mosque with Allah's Messenger (ﷺ), a desert Arab came and stood up and began to urinate in the mosque. The Companions of Allah's Messenger (ﷺ) said: Stop, stop, but the Messenger of Allah (ﷺ) said: Don't interrupt him; leave him alone. They left him alone, and when he finished urinating, Allah's Messenger (ﷺ) called him and said to him: These mosques are not the places meant for urine and filth, but are only for the remembrance of Allah, prayer and the recitation of the Qur'an, or Allah's Messenger said something like that. He (the narrator) said that he (the Holy Prophet) then gave orders to one of the people who brought a bucket of water and poured It over.","reference":"Sahih Muslim 285, Book 2, Hadith 127","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) demonstrate patience and wisdom in handling unexpected situations in the mosque?","id":"muslim-2-127"},{"hadith-eng":"Babies were brought to the Messenger of Allah (ﷺ) and he blessed them, and after having chewed (something, e. g. dates or any other sweet thing) he rubbed there with their soft palates. A baby was brought to him and he passed water over him (over his garment), so he asked water to be brought and sprinkled it, but he did not wash it.","reference":"Sahih Muslim 286a, Book 2, Hadith 128","question #":"question #1","question":"What is the significance of the Prophet's practice of blessing babies and rubbing something sweet on their palates?","id":"muslim-2-128"},{"hadith-eng":"A suckling babe was brought to the Messenger of Allah (way peace be upon him) and he urinated in his tap. He (the Holy Prophet) sent for water and poured it over.","reference":"Sahih Muslim 286b, Book 2, Hadith 129","question #":"question #1","question":"What is the appropriate way to clean impurities caused by a child's urine in Islamic teachings?","id":"muslim-2-129"},{"hadith-eng":"Hisham narrated the hadith like one transmitted by Ibn Numair (the above mentioned one) with the same chain of transmitters.","reference":"Sahih Muslim 286c, Book 2, Hadith 130","question #":"question #1","question":"How does the consistency of a chain of transmitters affect the authenticity of a hadith?","id":"muslim-2-130"},{"hadith-eng":"Umm Qais daughter of Mihsan reported that she came to the Messenger of Allah (ﷺ) with her child. who was not yet weaned, and she placed him in his lap; and he urinated in his (Holy Prophet's) lap. He (the Holy Prophet) did nothing more than spraying water over it.","reference":"Sahih Muslim 287a, Book 2, Hadith 131","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle situations involving children's natural actions, such as urination?","id":"muslim-2-131"},{"hadith-eng":"\" He (the Holy Prophet) sent for water and sprinkled it over.\"","reference":"Sahih Muslim 287b, Book 2, Hadith 132","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take when dealing with impurities?","id":"muslim-2-132"},{"hadith-eng":"Umm Qais, daughter of Mihsan, was among the earliest female emigrants who took the oath of allegiance to the Messenger of Allah (ﷺ), and she was the sister of 'Ukkasha b. Mihsan, one amongst the sons of Asad b. Khuzaima. He (the narrator) said: She (Umm Qais) told me that she came to the Messenger of Allah (may peace he upon him) with her son and he had not attained the age of eating food. He (the narrator, 'Ubaidullah), said: She told me that her son passed urine in the lap of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) sent for water and sprayed it over his garment (over that part which was contaminated with the urine of the child) and he did not wash it thoroughly.","reference":"Sahih Muslim 287c, Book 2, Hadith 133","question #":"question #1","question":"What is the significance of the actions of the Prophet Muhammad (ﷺ) when dealing with impurities caused by infants?","id":"muslim-2-133"},{"hadith-eng":"A person stayed in the house of A'isha and in the morning began to wash his garment. A'isha said: In case you saw it (i. e. drop of semen), it would have served the purpose (of purifying the garment) if you had simply washed that spot; and in case you did not see it, it would have been enough to sprinkle water around it, for when I saw that on the garment of the Messenger of Allah (ﷺ). I simply scraped it off and he offered prayer, while putting that on.","reference":"Sahih Muslim 288a, Book 2, Hadith 134","question #":"question #1","question":"What is the procedure for purifying a garment that has been soiled with impurities according to Islamic teachings?","id":"muslim-2-134"},{"hadith-eng":"I used to scrape off the (drop of) semen from the garment of the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 288b, Book 2, Hadith 135","question #":"question #1","question":"What does Islamic jurisprudence say about the cleanliness of garments in relation to bodily fluids?","id":"muslim-2-135"},{"hadith-eng":"Qutaiba b. Sa'id, Ishaq b. Ibrahim, Ibn Abi 'Aruba, Abu Ma'shar, Abu Bakr b. Abu Shaiba, Mansur and Mughira have all transmitted from Ibrahim, who transmitted it on the authority of A'isha's narration pertaining to the scraping off of the (drop) of semen from the garment of the Messenger of Allah (ﷺ) like the hadith of Khalid on the authority of Abu Ma'shar.","reference":"Sahih Muslim 288c, Book 2, Hadith 136","question #":"question #1","question":"What is the significance of cleanliness in Islam as demonstrated by the actions of the Prophet Muhammad (ﷺ)?","id":"muslim-2-136"},{"hadith-eng":"Hammam narrated the hadith from A'isha like the (above-mentioned) traditions.","reference":"Sahih Muslim 288d, Book 2, Hadith 137","question #":"question #1","question":"What is the significance of A'isha's narrations in Islamic tradition?","id":"muslim-2-137"},{"hadith-eng":"I asked Sulaiman b. Yasar whether the semen that gets on to the garment of a person should be washed or not. He replied: A'isha told me: The Messenger of Allah (ﷺ) washed the semen, and then went out for prayer in that very garment and I saw the mark of washing on it.","reference":"Sahih Muslim 289a, Book 2, Hadith 138","question #":"question #1","question":"What is the significance of cleanliness in Islam, especially concerning garments used for prayer?","id":"muslim-2-138"},{"hadith-eng":"\" She (A'isha) reported: I used to wash it from the garment of the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 289b, Book 2, Hadith 139","question #":"question #1","question":"What is the significance of cleanliness in Islam, particularly concerning garments?","id":"muslim-2-139"},{"hadith-eng":"I stayed in the house of 'A'isha and had a wet dream (and perceived its effect on my garment), so (in the morning) I dipped both (the clothes) in water. This (act of mine) was watched by a maid-servant of A'isha and she informed her. She (Hadrat A'isha) sent me a message: Whatprompted you to act like this with your clothes? He (the narrator) said: I told that I saw in a dream what a sleeper sees. She said: Did you find (any mark of the fluid) on your clothes? I said: No. She said: Had you found anything you should have washed it. Incase I found that (semen) on the garment of the Messenger of Allah (ﷺ) dried up, I scraped it off with my nails.","reference":"Sahih Muslim 290, Book 2, Hadith 140","question #":"question #1","question":"What is the appropriate way to clean garments that have been soiled by a wet dream according to Islamic teachings?","id":"muslim-2-140"},{"hadith-eng":"A woman came to the Messenger of Allah (ﷺ) and said: What should one do if the blood of menses smears the garment of one amongst us? He (the Holy Prophet) replied: She should scrape it, then rub it with water, then pour water over it and then offer prayer in it.","reference":"Sahih Muslim 291a, Book 2, Hadith 141","question #":"question #1","question":"What steps should be taken to clean a garment that has been stained with menstrual blood before performing prayer?","id":"muslim-2-141"},{"hadith-eng":"This tradition is narrated by Abu Kuraib, Ibn Numair, Abu Tahir, Ibn Wahb, Yahya b. 'Abdullah b. Salim, Malik b. Anas, 'Amr b. Harith on the authority of Hisham b. 'Urwa, with the same chain of transmitters like one transmitted by Yahya b. Sa'id like the above-mentioned.","reference":"Sahih Muslim 291b, Book 2, Hadith 142","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-2-142"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by two graves and said: They (their occupants) are being tormented, but they are not tormented for a grievous sin. One of them carried tales and the other did not keep himself safe from being defiled by urine. He then called for a fresh twig and split it into two parts, and planted them on each grave and then said: Perhaps, their punishment way be mitigated as long as these twigs remain fresh.","reference":"Sahih Muslim 292a, Book 2, Hadith 143","question #":"question #1","question":"What are the consequences of carrying tales and not maintaining cleanliness in Islam?","id":"muslim-2-143"},{"hadith-eng":"\" The other did not keep himself safe from being defiled by urine.\"","reference":"Sahih Muslim 292b, Book 2, Hadith 144","question #":"question #1","question":"What are the consequences of not keeping oneself clean from impurities in Islam?","id":"muslim-2-144"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Cleanliness is half of faith and al-Hamdu Lillah (all praise and gratitude is for Allah alone) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Lillah fill up what is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.","reference":"Sahih Muslim 223, Book 2, Hadith 1","question #":"question #2","question":"What is the significance of prayer and charity in demonstrating one's faith?","id":"muslim-2-145"},{"hadith-eng":"'\" 'Abdullah bin 'Umar came to visit Ibn 'Amir when he was sick and he said: 'Won't you supplicate to Allah for me, O Ibn 'Umar ?' He said: 'I heard the Messenger of Allah (ﷺ) say: \"No Salat is accepted without Wudu' (purification), and no charity (is accepted) that comes from Ghulul [1] \" and you were the governor of Al-Basrah.' \"\r\n\r\n[1] Goods pilfered from the spoils of war prior to their authorized distribution.","reference":"Sahih Muslim 224a, Book 2, Hadith 2","question #":"question #2","question":"Why is charity not accepted if it comes from Ghulul?","id":"muslim-2-146"},{"hadith-eng":"A hadith like this is narrated from the Apostle (ﷺ) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.","reference":"Sahih Muslim 224b, Book 2, Hadith 3","question #":"question #2","question":"How does the reliability of narrators affect the credibility of a hadith?","id":"muslim-2-147"},{"hadith-eng":"This is what has been transmitted to us by Abu Huraira from Muhammad, the Messenger of Allah (ﷺ) and then narrated a hadith out of them and observed that the Messenger of Allah (ﷺ) said: The prayer of none amongst you would be accepted in a state of impurity until he performs ablution.","reference":"Sahih Muslim 225, Book 2, Hadith 4","question #":"question #2","question":"What is the significance of maintaining purity in Islamic worship practices?","id":"muslim-2-148"},{"hadith-eng":"Uthman b. 'Affan called for ablution water and this is how he performed the ablution. He washed his hands thrice. He then rinsed his mouth and cleaned his nose with water (three times). He then washed his face three times, then washed his right arm up to the elbow three times, then washed his left arm like that, then wiped his head; then washed his right foot up to the ankle three times, then washed his left foot like that, and then said: I saw the Messenger of Allah (ﷺ) perform ablution like this ablution of mine. Then the Messenger of Allah (ﷺ) said: He who performs ablution like this ablution of mine and then stood up (for prayer) and offered two rak'ahs of prayer without allowing his thoughts to be distracted, all his previous sins are expiated. Ibn Shihab said: Our scholars remarked: This is the most complete of the ablutions performed for prayer.","reference":"Sahih Muslim 226a, Book 2, Hadith 5","question #":"question #2","question":"How does performing ablution and praying with focus contribute to the expiation of sins?","id":"muslim-2-149"},{"hadith-eng":"I saw Uthman call for a vessel (of water) and poured water over his hands three times and then washed them. Then he put his right hand in the vessel and rinsed his mouth and cleaned his nose. Then he washed his face three times and his hands up to the elbow three times; then wiped his head, then washed his feet three times. Then he said that the Messenger of Allah (ﷺ) had said: He who performed ablution like this ablution of mine and offered two raka`ahs of prayer without allowing his thoughts to be distracted, all his previous sins would be expiated.","reference":"Sahih Muslim 226b, Book 2, Hadith 6","question #":"question #2","question":"How does performing ablution and prayer with concentration affect one's past sins?","id":"muslim-2-150"},{"hadith-eng":"I heard from 'Uthman b. 'Affan and he was in the courtyard of the mosque, when the Mu'adhdhin (announcer of the prayer) came to him at the time of afternoon prayer. So the ('Uthman) called for the ablution water and performed ablution and then said: By Allah, I am narrating to you a hadith. If there were not a verse in the Book of Allah, I would have never narrated it to you. I heard Allah's Messenger (ﷺ) say: If a Muslim performs ablution and does it well and offers prayer, all his (sins) daring the period from one prayer to another would be pardoned by Allah.","reference":"Sahih Muslim 227a, Book 2, Hadith 7","question #":"question #2","question":"How does regular prayer contribute to the forgiveness of sins in Islamic teachings?","id":"muslim-2-151"},{"hadith-eng":"\" He who performed the ablution well and then offered the obligatory prayer.\"","reference":"Sahih Muslim 227b, Book 2, Hadith 8","question #":"question #2","question":"How does performing obligatory prayers relate to the concept of purification in Islam?","id":"muslim-2-152"},{"hadith-eng":"By Allah, I am narrating to you a hadith had there not been this verse in the Book of Allah. I would not have narrated it to you. Verily I heard the Messenger of Allah (ﷺ) say: Not a person is there who performed ablution, and did it well, then offered prayer, but his sins (which he committed) were not pardoned between the prayer that he offered and the next one. 'Urwa said: The verse is this:\" Those who suppress the clear proofs and the guidance which We have sent down\"... to His words:\" the Cursers\" (ii. 15).","reference":"Sahih Muslim 227c, Book 2, Hadith 9","question #":"question #2","question":"How does the act of prayer contribute to the forgiveness of sins according to Islamic teachings?","id":"muslim-2-153"},{"hadith-eng":"I was with Uthman, and he called for ablution water and said: I heard Allah's Messenger (ﷺ) say: When the time for a prescribed prayer comes, if any Muslim performs ablution well and offers his prayer with humility and bowing, it will be an expiation for his past sins, so long as he has not committed a major sin; and this applies for all times.","reference":"Sahih Muslim 228, Book 2, Hadith 10","question #":"question #2","question":"How does offering prayer with humility and bowing contribute to the expiation of sins?","id":"muslim-2-154"},{"hadith-eng":"I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (ﷺ) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (ﷺ) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"","reference":"Sahih Muslim 229, Book 2, Hadith 11","question #":"question #2","question":"How does performing ablution affect the expiation of sins according to Islamic teachings?","id":"muslim-2-155"},{"hadith-eng":"Should I not show you the ablution performed by Allah's Messenger (ﷺ)? And he then washed (the different parts of the body) three times. 4\" Qutaiba has added in his narration the words:\" There were with him (with Uthman) Companions of Allah's Messenger (ﷺ).\"","reference":"Sahih Muslim 230, Book 2, Hadith 12","question #":"question #2","question":"What is the significance of washing the different parts of the body three times during ablution?","id":"muslim-2-156"},{"hadith-eng":"I used to fetch water for 'Uthman for his purification. Never was there a day that he did not take a bath with a small quantity of water. And Uthman said: The Messenger of Allah (ﷺ) at the time of our returning from our prayer told us (certain things pertaining to purification). Mis'ar said: I find that it was afternoon prayer. He said: I do not know whether I should tell you a thing or keep quiet. We said: Messenger of Allah, tell us if it is good and if it is otherwise, Allah and His Apostle know better. Upon this he said: A Muslim who purifies (himself) and completes purification as enjoined upon him by Allah and then offers the prayers, that will be expiation (of his sins he committed) between these (prayers).","reference":"Sahih Muslim 231a, Book 2, Hadith 13","question #":"question #2","question":"How does regular purification and prayer serve as expiation for sins in Islamic teachings?","id":"muslim-2-157"},{"hadith-eng":"I heard Humran b. Aban narrate to Abu Burda in this very mosque during the governorship of Bishr that 'Uthman b. Alfan said: The Messenger of Allah (ﷺ) observed: He who completed ablution as Allah, the Exalted, enjoined upon him, his obligatory prayers would be explatious (for his minor sins that he would commit) during (the interval) between them. This hadith is transmitted by Ibn Mu'adh, and in the hadith narrated by Ghundar, the words\" during the governorship of Bishr\" are omitted and there is no mention of the obligatory prayers.","reference":"Sahih Muslim 231b, Book 2, Hadith 14","question #":"question #2","question":"How do obligatory prayers serve as expiation for minor sins according to Islamic teachings?","id":"muslim-2-158"},{"hadith-eng":"One day Uthman b. Affan performed the ablution well, and then said: I saw Allah's Messenger (ﷺ) perform ablution, the best ablution, and then observed: He who performed ablution like this and then went towards the mosque and nothing (but the love of) prayer urged him (to do so), all his previous (minor) sins would be expiated.","reference":"Sahih Muslim 232a, Book 2, Hadith 15","question #":"question #2","question":"How does the intention behind going to the mosque affect the expiation of sins?","id":"muslim-2-159"},{"hadith-eng":"He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.","reference":"Sahih Muslim 232b, Book 2, Hadith 16","question #":"question #2","question":"How does participating in congregational prayer contribute to the forgiveness of sins?","id":"muslim-2-160"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Five prayers and from one Friday prayer to (the next) Friday prayer is an expiation (of the sins committed in between their intervals) if major sins are not committed.","reference":"Sahih Muslim 233a, Book 2, Hadith 17","question #":"question #2","question":"How does attending Friday prayers contribute to the forgiveness of sins?","id":"muslim-2-161"},{"hadith-eng":"The five (daily) prayers and one Friday prayer to (the next) Friday prayer are expiations (for the sins committed in the intervals) between them.","reference":"Sahih Muslim 233b, Book 2, Hadith 18","question #":"question #2","question":"How do Friday prayers contribute to the expiation of sins according to Islamic teachings?","id":"muslim-2-162"},{"hadith-eng":"Verily the Messenger of Allah (ﷺ) said: The five (daily) prayers and from one Friday prayer to the (next) Friday prayer, and from Ramadhan to Ramadhan are expiations for the (sins) committed in between (their intervals) provided one shuns the major sins.","reference":"Sahih Muslim 233c, Book 2, Hadith 19","question #":"question #2","question":"What is the significance of observing Friday prayers in relation to sin expiation?","id":"muslim-2-163"},{"hadith-eng":"We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (ﷺ) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umar who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.","reference":"Sahih Muslim 234a, Book 2, Hadith 20","question #":"question #2","question":"How does the testimony of faith relate to the opening of the gates of Paradise in Islamic teachings?","id":"muslim-2-164"},{"hadith-eng":"Verily the Messenger of Allah (ﷺ) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.","reference":"Sahih Muslim 234b, Book 2, Hadith 21","question #":"question #2","question":"How does the declaration of faith relate to the practice of ablution in Islamic teachings?","id":"muslim-2-165"},{"hadith-eng":"It was said to him (by people): Perform for us the ablution (as it was performed) by the Messenger of Allah (way peace be upon him). He ('Abdullah b. Zaid) called for a vessel (of water), and poured water from it on his hands and washed them three times. Then he inserted his hand (in the vessel) and brought it (water) out, rinsed his mouth and snuffed up water from the palm of one hand doing that three times, He again inserted his hand and brought it out and washed his face three times, then inserted his hand and brought it out and washed each arm up to the elbow twice, then inserted his hand and brought it out and wiped his head both front and back with his hands. He then washed his feet up to the ankles, and then said: This is how God's Messenger (peace be upon him) performed ablution.","reference":"Sahih Muslim 235a, Book 2, Hadith 22","question #":"question #2","question":"How many times should each part of the body be washed during ablution according to the Sunnah?","id":"muslim-2-166"},{"hadith-eng":"This hadith is narrated by Amr b. Yahya with the same chain of transmitters, but there is no mention of ankles.","reference":"Sahih Muslim 235b, Book 2, Hadith 23","question #":"question #2","question":"How does the omission of certain details affect the understanding of a hadith?","id":"muslim-2-167"},{"hadith-eng":"He moved them (his hands) for wiping to the front of his head and then the nape of his neck, then bringing them back till he reached the place from which he had begun, after which he washed his feet.","reference":"Sahih Muslim 235c, Book 2, Hadith 24","question #":"question #2","question":"How is the process of wiping the head and neck described in the practice of ablution?","id":"muslim-2-168"},{"hadith-eng":"This hadith has been narrated by Wuwb on the authority of 'Amr b. Yahyi with the same chain of transmitters and it has been mentioned therein: He rinsed his mouth. snuffed up water in nostrils and cleaned the nose with three handfuls and wiped his head moving (his hand) in front and then back once. Bahz said: Wuhaib narrated this hadith to me and Wuhaib said: Amr b. Yahya narrated to me this hadith twice.","reference":"Sahih Muslim 235d, Book 2, Hadith 25","question #":"question #2","question":"How is the act of rinsing the mouth and cleaning the nose emphasized in the process of ablution?","id":"muslim-2-169"},{"hadith-eng":"He saw Allah's Messenger (ﷺ) perform the ablution. He rinsed his mouth then cleaned his nose, then washed his face three times, then washed his right hand thrice and then the other one, thrice. He then took fresh water and wiped his head and then washed his feet till he cleaned them.","reference":"Sahih Muslim 236, Book 2, Hadith 26","question #":"question #2","question":"How many times should each part of the body be washed during ablution?","id":"muslim-2-170"},{"hadith-eng":"When anyone wipes himself with pebbles (after answering the call of nature) he must make use of an odd number and when any one of you performs ablution he must snuff in his nose water and then clean it.","reference":"Sahih Muslim 237a, Book 2, Hadith 27","question #":"question #2","question":"What is the recommended practice for cleaning the nose during ablution?","id":"muslim-2-171"},{"hadith-eng":"This is what Abu Huraira transmitted to us from Muhammad, the Messenger of Allah (ﷺ), and he mentioned a number of a hadith, of which this is one: that the Messenger of Allah (ﷺ) said: When anyone amongst you (performs ablution) he must snuff his nostrils with water and then clean them.","reference":"Sahih Muslim 237b, Book 2, Hadith 28","question #":"question #2","question":"How does the process of ablution contribute to personal hygiene and spiritual purity in Islam?","id":"muslim-2-172"},{"hadith-eng":"The Messenger of Allah (way peace he upon him) said: When anyone performs ablution he must clean his nose and when anyone wipes himself with pebbles (after answering the call of nature) he must do that odd number of times.","reference":"Sahih Muslim 237c, Book 2, Hadith 29","question #":"question #2","question":"Why is it recommended to use an odd number of pebbles for cleaning after answering the call of nature?","id":"muslim-2-173"},{"hadith-eng":"It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (ﷺ) said like that.","reference":"Sahih Muslim 237d, Book 2, Hadith 30","question #":"question #2","question":"What is the significance of the companions in preserving the teachings of Islam?","id":"muslim-2-174"},{"hadith-eng":"The Apostle of Allah (ﷺ) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.","reference":"Sahih Muslim 238, Book 2, Hadith 31","question #":"question #2","question":"How does the presence of the devil relate to personal hygiene practices in Islam?","id":"muslim-2-175"},{"hadith-eng":"When anyone wipes himself with pebbles (after answering the call of nature) he should do this odd number of times.","reference":"Sahih Muslim 239, Book 2, Hadith 32","question #":"question #2","question":"How does Islamic teaching guide the practice of personal hygiene after answering the call of nature?","id":"muslim-2-176"},{"hadith-eng":"I came to 'A'isha, the wife of the Prophet (ﷺ), on the day when Sa'db. Abi Waqqas died. 'Abd al-Rahman b. Abu Bakr also came there and he performed ablution in her presence. She (Hadrat 'A'isha) said: Abd al-Rahman, complete the ablution as I heard the Allah's Messenger (ﷺ) say: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 240a, Book 2, Hadith 33","question #":"question #2","question":"Why is it important to ensure that the heels are washed during ablution?","id":"muslim-2-177"},{"hadith-eng":"Abdullah, the freed slave of Shahddad, came to 'A'isha and transmitted from her a hadith like this (which she narrated) from the Prophet (ﷺ).","reference":"Sahih Muslim 240b, Book 2, Hadith 34","question #":"question #2","question":"What is the significance of A'isha in the context of hadith narration?","id":"muslim-2-178"},{"hadith-eng":"I and 'Abd al-Rahman b. Abu Bakr went out (in order to join) the funeral procession of Sa'd b. Abi Waqqas and passed by the door of the residence of 'A'isha, and then he transmitted a hadith like this from her who (narrated it) from the Prophet (ﷺ).","reference":"Sahih Muslim 240c, Book 2, Hadith 35","question #":"question #2","question":"How are hadiths transmitted through different narrators in Islamic tradition?","id":"muslim-2-179"},{"hadith-eng":"I was in the presence of 'A'isha, and then narrated on her authority a hadith like this from the Prophet (way peace be upon him).","reference":"Sahih Muslim 240d, Book 2, Hadith 36","question #":"question #2","question":"How does the presence of a reliable narrator impact the authenticity of a hadith?","id":"muslim-2-180"},{"hadith-eng":"We returned from Mecca to Medina with the Messenger of Allah (ﷺ), and when we came to some water on the way, some of the people were in a hurry at the time of the afternoon prayer and performed ablution hurriedly; and when we reached them, their heels were dry, no water had touched them. The Prophet (ﷺ) said: Woe to (dry) heels, because of Hell-fire. Make your ablution thorough.","reference":"Sahih Muslim 241a, Book 2, Hadith 37","question #":"question #2","question":"What are the consequences of neglecting proper ablution according to Islamic teachings?","id":"muslim-2-181"},{"hadith-eng":"\" Complete the Wudu,\" and there is the name of Abu Yahya al-A'raj (a narrator).","reference":"Sahih Muslim 241b, Book 2, Hadith 38","question #":"question #2","question":"Who is Abu Yahya al-A'raj in the context of hadith narration?","id":"muslim-2-182"},{"hadith-eng":"The Messenger of Allah (ﷺ) lagged behind us on a journey. We travelled (back) and be took him; and then came the time of the afternoon prayer, and as we were going to wipe our feet he (the Holy Prophet) called out: Woe to the heels because of Hell-fire.","reference":"Sahih Muslim 241c, Book 2, Hadith 39","question #":"question #2","question":"What are the consequences of neglecting proper ablution according to Islamic teachings?","id":"muslim-2-183"},{"hadith-eng":"Allah's Apostle (ﷺ) saw a man who did not wash his heel and he remarked: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 242a, Book 2, Hadith 40","question #":"question #2","question":"What are the consequences of neglecting proper ablution according to Islamic teachings?","id":"muslim-2-184"},{"hadith-eng":"He saw people perform ablution with the help of a water jar and he said: Complete the Wudu for i heard Abu al-Qasim (ﷺ) say: Woe to the hamstrings because of hell-fire.","reference":"Sahih Muslim 242b, Book 2, Hadith 41","question #":"question #2","question":"What are the consequences mentioned for neglecting proper ablution?","id":"muslim-2-185"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 242c, Book 2, Hadith 42","question #":"question #2","question":"What are the consequences of neglecting proper ablution according to Islamic teachings?","id":"muslim-2-186"},{"hadith-eng":"'Umar b. Khattab said that a person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah (ﷺ) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.","reference":"Sahih Muslim 243, Book 2, Hadith 43","question #":"question #2","question":"How does incomplete ablution affect the validity of prayer in Islam?","id":"muslim-2-187"},{"hadith-eng":"Allah's Messenger (ﷺ) said: When a bondsman-a Muslim or a believer-washes his face (in course of ablution), every sin he contemplated with his eyes, will be washed away from his face along with water, or with the last drop of water; when he washes his hands, every sin they wrought will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin towards which his feet have walked will be washed away with the water or with the last drop of water with the result that he comes out pure from all sins.","reference":"Sahih Muslim 244, Book 2, Hadith 44","question #":"question #2","question":"How does ablution contribute to the purification of a believer from sins?","id":"muslim-2-188"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) said: He who performed ablution well, his sins would come out from his body, even coming out from under his nails.","reference":"Sahih Muslim 245, Book 2, Hadith 45","question #":"question #2","question":"How does ablution contribute to the removal of sins according to Islamic teachings?","id":"muslim-2-189"},{"hadith-eng":"I saw Abu Huraira perform ablution. He washed his face and washed it well. He then washed his right hand including a portion of his arm. He then washed his left hand including a portion of his arm. He then wiped his head. He then washed his right foot including his shank, and then washed his left foot including shank, and then said: This is how I saw Allah's Messenger (ﷺ) perform his ablution. And (Abu Huraira) added that the Messenger of Allah (ﷺ) had observed: You shall have your faces hands and feet bright on the Day of Resurrection because of your perfect ablution. He who can afford among you, let him increase the brightness of his forehead and that of hands and legs.","reference":"Sahih Muslim 246a, Book 2, Hadith 46","question #":"question #2","question":"What is the significance of having bright faces, hands, and feet on the Day of Resurrection according to Islamic teachings?","id":"muslim-2-190"},{"hadith-eng":"He saw Abu Huraira perform ablution. He washed his face and washed his hands up to the arms. He then washed his feet and reached up to the shanks and then said: I heard Allah's Messenger (ﷺ) say: My people would come with bright faces and bright hands and feet on account of the marks of ablution, so he who can increase the lustre of his forehead (and that of his hands and legs) should do so.","reference":"Sahih Muslim 246b, Book 2, Hadith 47","question #":"question #2","question":"How does ablution contribute to the distinct appearance of believers on the Day of Judgment?","id":"muslim-2-191"},{"hadith-eng":"Verily Allah's Messenger (ﷺ) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.","reference":"Sahih Muslim 247a, Book 2, Hadith 48","question #":"question #2","question":"How will the Prophet Muhammad (ﷺ) recognize his followers on the Day of Judgment?","id":"muslim-2-192"},{"hadith-eng":"My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.","reference":"Sahih Muslim 247b, Book 2, Hadith 49","question #":"question #2","question":"What significance does ablution have in distinguishing the followers of the Prophet Muhammad (ﷺ)?","id":"muslim-2-193"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allah, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).","reference":"Sahih Muslim 248, Book 2, Hadith 50","question #":"question #2","question":"How will the Prophet Muhammad (ﷺ) recognize his followers on the Day of Judgment according to Islamic belief?","id":"muslim-2-194"},{"hadith-eng":"The Messenger of Allah (ﷺ) came to the graveyard and said: \"Peace be upon you! The abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers.\" They (the hearers) said: Aren't we your brothers, O Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of Allah, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on foreheads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly, O Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out: Come, come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off.","reference":"Sahih Muslim 249a, Book 2, Hadith 51","question #":"question #2","question":"What is the significance of ablution in distinguishing the followers of the Prophet Muhammad (ﷺ) on the Day of Judgment?","id":"muslim-2-195"},{"hadith-eng":"The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.","reference":"Sahih Muslim 249b, Book 2, Hadith 52","question #":"question #2","question":"What does the concept of joining the deceased imply in Islamic teachings?","id":"muslim-2-196"},{"hadith-eng":"I was (standing) behind Abu Huraira and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend (ﷺ) say. In a believer adornment would reach the places where ablution reaches.","reference":"Sahih Muslim 250, Book 2, Hadith 53","question #":"question #2","question":"How does the extent of ablution affect a believer's adornment in the hereafter?","id":"muslim-2-197"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.","reference":"Sahih Muslim 251a, Book 2, Hadith 54","question #":"question #2","question":"How does performing ablution thoroughly contribute to spiritual mindfulness?","id":"muslim-2-198"},{"hadith-eng":"This hadith has been narrated on the authority of `Ali b. `Abd al-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu`ba and in the hadith narrated by Malik \"Ribat\" has been mentioned twice. This is the \"Ribat\" for you, this is the \"Ribat\" for you.","reference":"Sahih Muslim 251b, Book 2, Hadith 55","question #":"question #2","question":"How does the repetition of certain terms in hadiths emphasize their importance?","id":"muslim-2-199"},{"hadith-eng":"The Apostle (ﷺ) said: Were it not that I might over-burden the believers-and in the hadith transmitted by Zuhair\" people\" -I would have ordered them to use toothstick at every time of prayer.","reference":"Sahih Muslim 252, Book 2, Hadith 56","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) refrain from making the use of a toothstick obligatory for every prayer?","id":"muslim-2-200"},{"hadith-eng":"I asked A'isha what Allah's Apostle (ﷺ) did first when he entered his house, and she replied: He used tooth-stick (first of all).","reference":"Sahih Muslim 253a, Book 2, Hadith 57","question #":"question #2","question":"What significance does the use of a tooth-stick hold in the daily routine of the Prophet Muhammad (ﷺ)?","id":"muslim-2-201"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) entered his house, he used tooth-stick first of all.","reference":"Sahih Muslim 253b, Book 2, Hadith 58","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prioritize oral hygiene in his daily routine?","id":"muslim-2-202"},{"hadith-eng":"I went to the Apostle (ﷺ) and found one end of the tooth-stick upon his tongue (i. e. he was rinsing his mouth).","reference":"Sahih Muslim 254, Book 2, Hadith 59","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain oral hygiene?","id":"muslim-2-203"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) got up for Tahajjud prayer, he cleansed his mouth with the tooth-stick.","reference":"Sahih Muslim 255a, Book 2, Hadith 60","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prepare for the Tahajjud prayer?","id":"muslim-2-204"},{"hadith-eng":"for offering Tahajjud prayer.","reference":"Sahih Muslim 255b, Book 2, Hadith 61","question #":"question #2","question":"How is the practice of night prayer viewed in the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-205"},{"hadith-eng":"Whenever he (the Holy Prophet) got up for prayer during the night, he cleansed his mouth with the tooth-stick.","reference":"Sahih Muslim 255c, Book 2, Hadith 62","question #":"question #2","question":"How does oral hygiene relate to the practice of prayer in Islam?","id":"muslim-2-206"},{"hadith-eng":"\" Verily in the creation of the heavens and the earth and the alternation of night and day.\" up to the (words)\" save us from the torment of Hell.\" He then returned to his house, used the tooth-stick, performed the ablution, and then got up and offered the prayer. He than lay down on the bed. and again got up and went out and looked towards the sky and recited this verse (mentioned above), then returned, used the tooth-stick, performed ablution and again offered the prayer.","reference":"Sahih Muslim 256, Book 2, Hadith 63","question #":"question #2","question":"How does the use of a tooth-stick relate to the practices of cleanliness and preparation for prayer?","id":"muslim-2-207"},{"hadith-eng":"Five are the acts quite akin to the Fitra, or five are the acts of Fitra: circumcision, shaving the pubes, cutting the nails, plucking the hair under the armpits and clipping the moustache.","reference":"Sahih Muslim 257a, Book 2, Hadith 64","question #":"question #2","question":"Why is personal hygiene emphasized in Islamic teachings?","id":"muslim-2-208"},{"hadith-eng":"Five are the acts of fitra: circumcision, removing the pubes, clipping the moustache, cutting the nails, plucking the hair under the armpits.","reference":"Sahih Muslim 257b, Book 2, Hadith 65","question #":"question #2","question":"Why is personal hygiene emphasized in Islamic teachings?","id":"muslim-2-209"},{"hadith-eng":"A time limit has been prescribed for us for clipping the moustache, cutting the nails, plucking hair under the armpits, shaving the pubes, that it should not be neglected far more than forty nights.","reference":"Sahih Muslim 258, Book 2, Hadith 66","question #":"question #2","question":"Why is it important to maintain regular grooming habits such as clipping the moustache and cutting the nails?","id":"muslim-2-210"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: Trim closely the moustache, and let the beard grow.","reference":"Sahih Muslim 259a, Book 2, Hadith 67","question #":"question #2","question":"Why is it important to maintain the moustache and beard in Islam?","id":"muslim-2-211"},{"hadith-eng":"The Apostle of Allah (ﷺ) ordered us to trim the moustache closely and spare the beard.","reference":"Sahih Muslim 259b, Book 2, Hadith 68","question #":"question #2","question":"Why is it important to follow the Prophet's guidance on personal grooming?","id":"muslim-2-212"},{"hadith-eng":"The Messenger of Allah (may peace be opon him) said: Act against the polytheists, trim closely the moustache and grow beard.","reference":"Sahih Muslim 259c, Book 2, Hadith 69","question #":"question #2","question":"How does the instruction to trim the moustache and grow the beard relate to distinguishing Muslims from polytheists?","id":"muslim-2-213"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Trim closely the moustache, and grow beard, and thus act against the fire-worshippers.","reference":"Sahih Muslim 260, Book 2, Hadith 70","question #":"question #2","question":"How does the practice of grooming, such as trimming the moustache and growing the beard, relate to Islamic identity?","id":"muslim-2-214"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Ten are the acts according to fitra: clipping the moustache, letting the beard grow, using the tooth-stick, snuffing water in the nose, cutting the nails, washing the finger joints, plucking the hair under the armpits, shaving the pubes and cleaning one's private parts with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.","reference":"Sahih Muslim 261a, Book 2, Hadith 71","question #":"question #2","question":"How does personal grooming relate to the concept of fitra in Islam?","id":"muslim-2-215"},{"hadith-eng":"\" His father said: I forgot the tenth one.\"","reference":"Sahih Muslim 261b, Book 2, Hadith 72","question #":"question #2","question":"How does the reliability of a narrator affect the authenticity of a hadith?","id":"muslim-2-216"},{"hadith-eng":"Your Apostle (ﷺ) teaches you about everything, even about excrement. He replied: Yes, he has forbidden us to face the Qibla at the time of excretion or urination, or cleansing with right hand or with less than three pebbles, or with dung or bone.","reference":"Sahih Muslim 262a, Book 2, Hadith 73","question #":"question #2","question":"Why is it important to avoid facing the Qibla during excretion or urination?","id":"muslim-2-217"},{"hadith-eng":"I see that your friend even teaches you about the excrement. He replied; Yes, he has in fact forbidden us that anyone amongst us should cleanse himself with his right hand, or face the Qibla. He has forbidden the use of dung or bone for it, and he has also instructed us not to use less than three pebbles (for this purpose).","reference":"Sahih Muslim 262b, Book 2, Hadith 74","question #":"question #2","question":"Why is it important to avoid using the right hand for cleansing oneself in Islamic teachings?","id":"muslim-2-218"},{"hadith-eng":"The Messenger of Allah (ﷺ) forbade the use of bone or the droppings of camels for wiping (after excretion).","reference":"Sahih Muslim 263, Book 2, Hadith 75","question #":"question #2","question":"Why might certain materials be forbidden for personal hygiene in Islam?","id":"muslim-2-219"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: Whenever you go to the desert, neither turn your face nor turn your back towards the Qibla while answering the call of nature, but face towards the east or the west. Abu Ayyub said: When we came to Syria we found that the latrines already built there were facing towards the Qibla. We turned our faces away from them and begged forgiveness of the Lord. He said: Yes.","reference":"Sahih Muslim 264, Book 2, Hadith 76","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) adapt to pre-existing structures that conflicted with Islamic teachings?","id":"muslim-2-220"},{"hadith-eng":"When any one amongst you squats for answering the call of nature, he should neither turn his face towards the Qibla nor turn his back towards it.","reference":"Sahih Muslim 265, Book 2, Hadith 77","question #":"question #2","question":"Why is it important to observe specific directions when answering the call of nature in Islam?","id":"muslim-2-221"},{"hadith-eng":"I was offering my prayer in the mosque and Abdullah b. Umar was sitting there reclining with his back towards the Qibla. After completing my prayer. I went to him from one side. Abdullah said: People say when you go to the latrine, you should neither turn your face towards the Qibla nor towards Bait-ul-Maqdis. 'Abdullah said (farther): I went up to the roof of the house and saw the Messenger of Allah (ﷺ) squatting on two bricks for relieving himself with his face towards Bait-al-Maqdis.","reference":"Sahih Muslim 266a, Book 2, Hadith 78","question #":"question #2","question":"How did Abdullah ibn Umar describe the actions of the Prophet Muhammad (ﷺ) regarding facing Bait-al-Maqdis?","id":"muslim-2-222"},{"hadith-eng":"I went up to the roof of the house of my sister Hafsa and saw the Messenger of Allah (ﷺ) relieving himself facing Syria. with his back to the Qibla.","reference":"Sahih Muslim 266b, Book 2, Hadith 79","question #":"question #2","question":"How does the orientation towards the Qibla affect daily activities in Islamic practice?","id":"muslim-2-223"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: None of you should hold penis with his right hand while urinating, or wipe himself with his right hand in privy and should not breathe into the vessel (from which he drinks).","reference":"Sahih Muslim 267a, Book 2, Hadith 80","question #":"question #2","question":"Why is it advised to avoid using the right hand for certain actions in Islamic teachings?","id":"muslim-2-224"},{"hadith-eng":"When anyone amongst you enters the privy he should not touch his penis with his right hand.","reference":"Sahih Muslim 267b, Book 2, Hadith 81","question #":"question #2","question":"Why is it recommended to avoid using the right hand for certain actions in Islamic teachings?","id":"muslim-2-225"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) forbade (us) to breathe into the venel, to touch the penis with the right hand and to wipe after relieving with right hand.","reference":"Sahih Muslim 267c, Book 2, Hadith 82","question #":"question #2","question":"Why is it important to avoid using the right hand for certain actions according to Islamic teachings?","id":"muslim-2-226"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.","reference":"Sahih Muslim 268a, Book 2, Hadith 83","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) demonstrate his preference for using the right side in daily activities?","id":"muslim-2-227"},{"hadith-eng":"The Messenger of Allah (ﷺ) loved to start from the right-hand side in his every act i. e. in wearing shoes, in combing (his hair) and in performing ablution.","reference":"Sahih Muslim 268b, Book 2, Hadith 84","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his preference for using the right side in daily activities?","id":"muslim-2-228"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Be on your guard against two things which provoke cursing. They (the companions present there) said: Messenger of Allah, what are those things which provoke cursing? He said: Easing on the thoroughfares or under the shades (where they take shelter and rest).","reference":"Sahih Muslim 269, Book 2, Hadith 85","question #":"question #2","question":"Why is it important to maintain cleanliness and respect in shared environments according to Islamic teachings?","id":"muslim-2-229"},{"hadith-eng":"The Messenger of Allah (ﷺ) entered an enclosure while a servant was following him with a jar of water and he was the youngest amongst us and he placed it by the side of a lote-tree. When the Messenger of Allah, (ﷺ) relieved himself, he came out and had cleansed himself with water.","reference":"Sahih Muslim 270, Book 2, Hadith 86","question #":"question #2","question":"How does the behavior of the Prophet Muhammad (ﷺ) demonstrate the importance of cleanliness in Islam?","id":"muslim-2-230"},{"hadith-eng":"When the Messenger of Allah (ﷺ) entered the privy, a servant and I used to carry a skin of water, and a pointed staff, and he would cleanse himself with water.","reference":"Sahih Muslim 271a, Book 2, Hadith 87","question #":"question #2","question":"What items were used by the Prophet (ﷺ) for cleansing after relieving himself?","id":"muslim-2-231"},{"hadith-eng":"The Messenger of Allah (ﷺ) went to a far-off place in the desert (hidden from the sight of human beings) for relieving himself. Then I brought water for him and he cleansed himself.","reference":"Sahih Muslim 271b, Book 2, Hadith 88","question #":"question #2","question":"How did the companions assist the Prophet (ﷺ) in his daily activities?","id":"muslim-2-232"},{"hadith-eng":"Jarir urinated, then performed ablution and wiped over the socks. It was said to him: Do you do like this? He said: Yes, I saw that the Messenger of Allah (ﷺ) urinated, then performed ablution and then wiped over his shoes. A'mash said: Ibrahim had observed that this hadith was a surprise for them (the people) because Jarir had embraced Islam after the revelation of Surat al-Ma'ida.","reference":"Sahih Muslim 272a, Book 2, Hadith 89","question #":"question #2","question":"How does the timing of Jarir's conversion to Islam relate to the practice of wiping over socks?","id":"muslim-2-233"},{"hadith-eng":"\" This hadith surprised the friends of Abdullab'\" for Jarir had embraced Islam after the revelation of al-Ma'ida.","reference":"Sahih Muslim 272b, Book 2, Hadith 90","question #":"question #2","question":"How did the companions of Abdullah react to the hadith narrated by Jarir?","id":"muslim-2-234"},{"hadith-eng":"I was with the Messenger of Allah (ﷺ) when he came to the dumping ground of filth belonging to a particular tribe. He urinated while standing, and I went aside. He (the Holy Prophet) asked me to come near him and I went so near to him that I stood behind his heels. He then performed ablution and wiped over his socks.","reference":"Sahih Muslim 273a, Book 2, Hadith 91","question #":"question #2","question":"How does the act of wiping over socks relate to the rules of ablution in Islam?","id":"muslim-2-235"},{"hadith-eng":"Abu Musa inflicted extreme rigour upon himself in the matter of urination and urinated in a bottle and said: When the skin of anyone amongst the people of Israel was besmeared with urine, he cut that portion with a cutter. Hudhaifa said: I wish that'your friend should not inflict such an extreme rigour. I and the Messenger of Allah (ﷺ) were going together till we reached the dumping ground of filth behind an enclosure. He stood up as one among you would stand up. and he urinated, I tried to turn away from him, but he beckoned to me, so I went to him and I stood behind him, till he had relieved himself.","reference":"Sahih Muslim 273b, Book 2, Hadith 92","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate practical aspects of personal hygiene?","id":"muslim-2-236"},{"hadith-eng":"The Messenger of Allah (ﷺ) went out for relieving himself. Mughira went with him carrying a jug full of water. When he (the Holy Prophet) came back after relieving himself, he poured water over him and he performed ablution and wiped over his socks; and in the narration of Ibn Rumh there is\" till\" instead of\" when\".","reference":"Sahih Muslim 274a, Book 2, Hadith 93","question #":"question #2","question":"How does the practice of wiping over socks fit into the Islamic ritual of ablution?","id":"muslim-2-237"},{"hadith-eng":"\" He washed his face and hands, and wiped his head and then wiped his socks.\"","reference":"Sahih Muslim 274b, Book 2, Hadith 94","question #":"question #2","question":"What is the significance of wiping over socks during wudoo'?","id":"muslim-2-238"},{"hadith-eng":"I was with the Messenger of Allah (ﷺ) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.","reference":"Sahih Muslim 274c, Book 2, Hadith 95","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform ablution while traveling?","id":"muslim-2-239"},{"hadith-eng":"I was in the company of the Messenger of Allah (ﷺ) on a journey when he said: Mughira take hold of this jar (of water). I took hold of it and I went out with him. (I stopped but) the Messenger of Allah (ﷺ) proceeded on till he was out of my sight. He relieved himself and then came back and he was wearing a tight-sleeved Syrian gown. He tried to get his forearms out. but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I poured water over (his hands) and he performed ablution for prayer, then wiped over his socks and prayed.","reference":"Sahih Muslim 274d, Book 2, Hadith 96","question #":"question #2","question":"How does the practice of wiping over socks fit into the rules of ablution?","id":"muslim-2-240"},{"hadith-eng":"The Messenger of Allah (ﷺ) went out for relieving himself. When he came back I brought for him a jar (of water) and poured water upon his hands and He washed his face. He tried to wash his forearms, but as the (sleeves of the) gown were tight. He, therefore, brought them out from under the gown. He then washed them, wiped his head, and wiped his socks and then prayed.","reference":"Sahih Muslim 274e, Book 2, Hadith 97","question #":"question #2","question":"How did the Prophet (ﷺ) handle the situation when his sleeves were tight during ablution?","id":"muslim-2-241"},{"hadith-eng":"I was one night with the Messenger of Allah (ﷺ) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.","reference":"Sahih Muslim 274f, Book 2, Hadith 98","question #":"question #2","question":"How does Islamic practice address the issue of wiping over socks during ablution?","id":"muslim-2-242"},{"hadith-eng":"He (Mughira) helped the Apostle (ﷺ) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.","reference":"Sahih Muslim 274g, Book 2, Hadith 99","question #":"question #2","question":"Under what conditions is it permissible to wipe over shoes instead of washing feet during ablution?","id":"muslim-2-243"},{"hadith-eng":"The Messenger of Allah (ﷺ) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin b. 'Anf leading them and had completed a rak'a. When he perceived the presence of the Messenger of Allah (ﷺ) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle (ﷺ) got up and I also got up with him, and we offered the rak'a which had been finished before we came.","reference":"Sahih Muslim 274h, Book 2, Hadith 100","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform ablution when faced with a tight sleeve?","id":"muslim-2-244"},{"hadith-eng":"The Apostle of Allah (ﷺ) wiped over his socks and over his forehead and over his turban.","reference":"Sahih Muslim 274i, Book 2, Hadith 101","question #":"question #2","question":"How does the practice of wiping over socks and turbans relate to the rules of ablution in Islam?","id":"muslim-2-245"},{"hadith-eng":"This hadith has been transmitted by Ibn Mughira on the authority of his father by another chain of transmitters.","reference":"Sahih Muslim 274j, Book 2, Hadith 102","question #":"question #2","question":"How does the transmission of hadiths through different narrators affect their reliability?","id":"muslim-2-246"},{"hadith-eng":"Bakr reported that he had heard from the son of Mughira that verily the Messenger of Allah (ﷺ) performed ablution and wiped over his forehead and wiped over his turban and over his socks.","reference":"Sahih Muslim 274k, Book 2, Hadith 103","question #":"question #2","question":"How does the practice of wiping over socks during ablution reflect the flexibility in Islamic rituals?","id":"muslim-2-247"},{"hadith-eng":"\" Bilal narrated it to me.\"This tradition is transmitted by A'mash with this addition;, I saw the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 275, Book 2, Hadith 104","question #":"question #2","question":"How does the testimony of companions contribute to the understanding of Islamic rituals?","id":"muslim-2-248"},{"hadith-eng":"I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger (ﷺ). We asked him and he said: The Messenger of Allah (ﷺ) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.","reference":"Sahih Muslim 276a, Book 2, Hadith 105","question #":"question #2","question":"Who did 'A'isha suggest to consult regarding the practice of wiping over socks?","id":"muslim-2-249"},{"hadith-eng":"This hadith is narrated by Ubaidullah b. 'Amr and Zaid b. Abu Unaisa with the same chain of transmitters.","reference":"Sahih Muslim 276b, Book 2, Hadith 106","question #":"question #2","question":"How do different narrators contribute to the preservation and transmission of hadiths?","id":"muslim-2-250"},{"hadith-eng":"I asked 'A'isha about wiping over the shoes. She said: You better go to 'Ali, for he knows more about this than I. I, therefore, came to 'Ali and he narrated from the Apostle (ﷺ) like this.","reference":"Sahih Muslim 276c, Book 2, Hadith 107","question #":"question #2","question":"What is the significance of consulting knowledgeable individuals in religious matters?","id":"muslim-2-251"},{"hadith-eng":"You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.","reference":"Sahih Muslim 277, Book 2, Hadith 108","question #":"question #2","question":"How does the practice of wiping over socks relate to the rules of ablution in Islam?","id":"muslim-2-252"},{"hadith-eng":"When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.","reference":"Sahih Muslim 278a, Book 2, Hadith 109","question #":"question #2","question":"Why is it important to be cautious about cleanliness after waking from sleep?","id":"muslim-2-253"},{"hadith-eng":"This hadith is transmitted from Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 278b, Book 2, Hadith 110","question #":"question #2","question":"How do different chains of transmitters affect the authenticity of a hadith?","id":"muslim-2-254"},{"hadith-eng":"Zahri and Ibn Musayyab have both transmitted a hadith like this from Abu Huraira who narrated it from the Apostle (ﷺ).","reference":"Sahih Muslim 278c, Book 2, Hadith 111","question #":"question #2","question":"What is the significance of the chain of narration in the authenticity of hadiths?","id":"muslim-2-255"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.","reference":"Sahih Muslim 278d, Book 2, Hadith 112","question #":"question #2","question":"What is the significance of cleanliness in Islamic practices, especially after waking up?","id":"muslim-2-256"},{"hadith-eng":"This hadith has been transmitted through other chains of transmitters on the authority of Abu Huraira in which it is reported that the Messenger of Allah (ﷺ) made a mention of washing the hand, and did not instruct to wash it three times. But the hadith narrated from Jabir and Ibn Musayyab. Abu Salama, and Abdullah b. Shaqiq, Abu Salih, Abla Razin, there is a mention of\" three times\".","reference":"Sahih Muslim 278e, Book 2, Hadith 113","question #":"question #2","question":"How do different narrations of a hadith affect the understanding of Islamic practices?","id":"muslim-2-257"},{"hadith-eng":"When a dog licks a utensil belonging to any one of you, (the thing contained in it) should be thrown away and then (the utensil) should be washed seven times.","reference":"Sahih Muslim 279a, Book 2, Hadith 114","question #":"question #2","question":"How many times should a utensil be washed if a dog licks it, according to Islamic teachings?","id":"muslim-2-258"},{"hadith-eng":"This hadith has been transmitted by another chain of transmitters in which there is no mention of\" throwing away\".","reference":"Sahih Muslim 279b, Book 2, Hadith 115","question #":"question #2","question":"What is the significance of different chains of narrators in the authenticity of hadiths?","id":"muslim-2-259"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: When a dog drinks out of a vessel belonging to any one of you, he must wash it seven times.","reference":"Sahih Muslim 279c, Book 2, Hadith 116","question #":"question #2","question":"How many times should a vessel be washed if a dog drinks from it according to Islamic teachings?","id":"muslim-2-260"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: The purification of the utensil belonging to any one of you, after it is licked by a dog, lies in washing it seven times, using sand for the first time.","reference":"Sahih Muslim 279d, Book 2, Hadith 117","question #":"question #2","question":"How many times should a utensil be washed if it has been contaminated by a dog, according to Islamic guidelines?","id":"muslim-2-261"},{"hadith-eng":"Of the a hadith narrated by Abu Huraira from Muhammad, the Messenger of Allah (ﷺ), one is this: The Messenger of Allah (ﷺ) said: The purification of the utensil belonging to one amongst you, after it is licked by a dog, lies in washing it seven times.","reference":"Sahih Muslim 279e, Book 2, Hadith 118","question #":"question #2","question":"How many times should a utensil be washed to achieve purification after being licked by a dog?","id":"muslim-2-262"},{"hadith-eng":"The Messenger of Allah (ﷺ) ordered killing of the dogs, and then said: What about them, i. e. about other dogs? and then granted concession (to keep) the dog for hunting and the dog for (the security) of the herd, and said: When the dog licks the utensil, wash it seven times, and rub it with earth the eighth time.","reference":"Sahih Muslim 280a, Book 2, Hadith 119","question #":"question #2","question":"What is the prescribed method for cleaning utensils that have been licked by a dog?","id":"muslim-2-263"},{"hadith-eng":"\" He (the Holy Prophet) gave concession in the case of the dog for looking after the herd, for hunting and for watching the cultivated land,\" and there is no mention of this addition (i. e. concession in case of watching the cultivated lands) except in the hadith transmitted by Yahya.","reference":"Sahih Muslim 280b, Book 2, Hadith 120","question #":"question #2","question":"How does the role of a dog differ in various activities such as herding, hunting, and guarding crops?","id":"muslim-2-264"},{"hadith-eng":"The Messenger of Allah (ﷺ) forbade to urinate in stagnant water.","reference":"Sahih Muslim 281, Book 2, Hadith 121","question #":"question #2","question":"How does Islamic teaching address the issue of cleanliness in relation to water sources?","id":"muslim-2-265"},{"hadith-eng":"the Messenger of Allah (ﷺ) said: None amongst you should urinate in standing water, and then wash in it.","reference":"Sahih Muslim 282a, Book 2, Hadith 122","question #":"question #2","question":"Why is it important to avoid contaminating water sources in Islam?","id":"muslim-2-266"},{"hadith-eng":"Of the ahadith narrated to us by Abfi Huraira from Muhammad the Messenger of Allah (ﷺ) one is this: The Messenger or Allah (ﷺ) said: You should not urinate in standing water, that is not flowing, then wash in it.","reference":"Sahih Muslim 282b, Book 2, Hadith 123","question #":"question #2","question":"Why is it important to avoid urinating in stagnant water from an Islamic perspective?","id":"muslim-2-267"},{"hadith-eng":"None of you must wash in standing water when he is in a state of Junub. And Abu Huraira was asked how it was to be done; he said: It was to be taken out in handfuls.","reference":"Sahih Muslim 283, Book 2, Hadith 124","question #":"question #2","question":"How should one cleanse themselves if they are in a state of Junub and only have access to standing water?","id":"muslim-2-268"},{"hadith-eng":"A Bedouin urinated in the mosque. Some of the persons stood up (to reprimand him or to check him from doing so), but the Messenger of Allah (ﷺ) said: Leave him alone; don't interrupt him. He (the narrator) said: And when he had finished, he called for a bucket of water and poured it over.","reference":"Sahih Muslim 284a, Book 2, Hadith 125","question #":"question #2","question":"What is the significance of patience and understanding in dealing with mistakes made by others?","id":"muslim-2-269"},{"hadith-eng":"Leave him alone. When he had finished, the Messenger of Allah (ﷺ) ordered that a bucket (of water) should be brought and poured over it.","reference":"Sahih Muslim 284b, Book 2, Hadith 126","question #":"question #2","question":"What is the appropriate way to correct someone's mistake in a religious setting according to Islamic teachings?","id":"muslim-2-270"},{"hadith-eng":"While we were in the mosque with Allah's Messenger (ﷺ), a desert Arab came and stood up and began to urinate in the mosque. The Companions of Allah's Messenger (ﷺ) said: Stop, stop, but the Messenger of Allah (ﷺ) said: Don't interrupt him; leave him alone. They left him alone, and when he finished urinating, Allah's Messenger (ﷺ) called him and said to him: These mosques are not the places meant for urine and filth, but are only for the remembrance of Allah, prayer and the recitation of the Qur'an, or Allah's Messenger said something like that. He (the narrator) said that he (the Holy Prophet) then gave orders to one of the people who brought a bucket of water and poured It over.","reference":"Sahih Muslim 285, Book 2, Hadith 127","question #":"question #2","question":"What is the significance of maintaining cleanliness and purity in places of worship in Islam?","id":"muslim-2-271"},{"hadith-eng":"Babies were brought to the Messenger of Allah (ﷺ) and he blessed them, and after having chewed (something, e. g. dates or any other sweet thing) he rubbed there with their soft palates. A baby was brought to him and he passed water over him (over his garment), so he asked water to be brought and sprinkled it, but he did not wash it.","reference":"Sahih Muslim 286a, Book 2, Hadith 128","question #":"question #2","question":"How did the Prophet handle situations when a baby urinated on his garment?","id":"muslim-2-272"},{"hadith-eng":"A suckling babe was brought to the Messenger of Allah (way peace be upon him) and he urinated in his tap. He (the Holy Prophet) sent for water and poured it over.","reference":"Sahih Muslim 286b, Book 2, Hadith 129","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) demonstrate handling impurities in daily life?","id":"muslim-2-273"},{"hadith-eng":"Hisham narrated the hadith like one transmitted by Ibn Numair (the above mentioned one) with the same chain of transmitters.","reference":"Sahih Muslim 286c, Book 2, Hadith 130","question #":"question #2","question":"What is the significance of having multiple narrators for the same hadith?","id":"muslim-2-274"},{"hadith-eng":"Umm Qais daughter of Mihsan reported that she came to the Messenger of Allah (ﷺ) with her child. who was not yet weaned, and she placed him in his lap; and he urinated in his (Holy Prophet's) lap. He (the Holy Prophet) did nothing more than spraying water over it.","reference":"Sahih Muslim 287a, Book 2, Hadith 131","question #":"question #2","question":"What is the appropriate way to clean impurities caused by a child's urine according to Islamic teachings?","id":"muslim-2-275"},{"hadith-eng":"\" He (the Holy Prophet) sent for water and sprinkled it over.\"","reference":"Sahih Muslim 287b, Book 2, Hadith 132","question #":"question #2","question":"How is water used in the process of purification in Islamic teachings?","id":"muslim-2-276"},{"hadith-eng":"Umm Qais, daughter of Mihsan, was among the earliest female emigrants who took the oath of allegiance to the Messenger of Allah (ﷺ), and she was the sister of 'Ukkasha b. Mihsan, one amongst the sons of Asad b. Khuzaima. He (the narrator) said: She (Umm Qais) told me that she came to the Messenger of Allah (may peace he upon him) with her son and he had not attained the age of eating food. He (the narrator, 'Ubaidullah), said: She told me that her son passed urine in the lap of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) sent for water and sprayed it over his garment (over that part which was contaminated with the urine of the child) and he did not wash it thoroughly.","reference":"Sahih Muslim 287c, Book 2, Hadith 133","question #":"question #2","question":"How did the early female emigrants contribute to the spread of Islam and their interactions with the Prophet Muhammad (ﷺ)?","id":"muslim-2-277"},{"hadith-eng":"A person stayed in the house of A'isha and in the morning began to wash his garment. A'isha said: In case you saw it (i. e. drop of semen), it would have served the purpose (of purifying the garment) if you had simply washed that spot; and in case you did not see it, it would have been enough to sprinkle water around it, for when I saw that on the garment of the Messenger of Allah (ﷺ). I simply scraped it off and he offered prayer, while putting that on.","reference":"Sahih Muslim 288a, Book 2, Hadith 134","question #":"question #2","question":"How did A'isha describe the method of cleaning a garment that has traces of impurity?","id":"muslim-2-278"},{"hadith-eng":"I used to scrape off the (drop of) semen from the garment of the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 288b, Book 2, Hadith 135","question #":"question #2","question":"How did A'isha contribute to the understanding of the Prophet's personal life and practices?","id":"muslim-2-279"},{"hadith-eng":"Qutaiba b. Sa'id, Ishaq b. Ibrahim, Ibn Abi 'Aruba, Abu Ma'shar, Abu Bakr b. Abu Shaiba, Mansur and Mughira have all transmitted from Ibrahim, who transmitted it on the authority of A'isha's narration pertaining to the scraping off of the (drop) of semen from the garment of the Messenger of Allah (ﷺ) like the hadith of Khalid on the authority of Abu Ma'shar.","reference":"Sahih Muslim 288c, Book 2, Hadith 136","question #":"question #2","question":"How does the practice of maintaining purity relate to the daily life of a Muslim?","id":"muslim-2-280"},{"hadith-eng":"Hammam narrated the hadith from A'isha like the (above-mentioned) traditions.","reference":"Sahih Muslim 288d, Book 2, Hadith 137","question #":"question #2","question":"How does the consistency of hadiths across different narrators affect their authenticity?","id":"muslim-2-281"},{"hadith-eng":"I asked Sulaiman b. Yasar whether the semen that gets on to the garment of a person should be washed or not. He replied: A'isha told me: The Messenger of Allah (ﷺ) washed the semen, and then went out for prayer in that very garment and I saw the mark of washing on it.","reference":"Sahih Muslim 289a, Book 2, Hadith 138","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle impurities on clothing before performing prayers?","id":"muslim-2-282"},{"hadith-eng":"\" She (A'isha) reported: I used to wash it from the garment of the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 289b, Book 2, Hadith 139","question #":"question #2","question":"How did A'isha contribute to the understanding of the Prophet's practices regarding cleanliness?","id":"muslim-2-283"},{"hadith-eng":"I stayed in the house of 'A'isha and had a wet dream (and perceived its effect on my garment), so (in the morning) I dipped both (the clothes) in water. This (act of mine) was watched by a maid-servant of A'isha and she informed her. She (Hadrat A'isha) sent me a message: Whatprompted you to act like this with your clothes? He (the narrator) said: I told that I saw in a dream what a sleeper sees. She said: Did you find (any mark of the fluid) on your clothes? I said: No. She said: Had you found anything you should have washed it. Incase I found that (semen) on the garment of the Messenger of Allah (ﷺ) dried up, I scraped it off with my nails.","reference":"Sahih Muslim 290, Book 2, Hadith 140","question #":"question #2","question":"How did A'isha (may Allah be pleased with her) handle the situation when she found dried semen on the Prophet's garment?","id":"muslim-2-284"},{"hadith-eng":"A woman came to the Messenger of Allah (ﷺ) and said: What should one do if the blood of menses smears the garment of one amongst us? He (the Holy Prophet) replied: She should scrape it, then rub it with water, then pour water over it and then offer prayer in it.","reference":"Sahih Muslim 291a, Book 2, Hadith 141","question #":"question #2","question":"How does Islamic teaching address the purification of clothing affected by menstrual blood?","id":"muslim-2-285"},{"hadith-eng":"This tradition is narrated by Abu Kuraib, Ibn Numair, Abu Tahir, Ibn Wahb, Yahya b. 'Abdullah b. Salim, Malik b. Anas, 'Amr b. Harith on the authority of Hisham b. 'Urwa, with the same chain of transmitters like one transmitted by Yahya b. Sa'id like the above-mentioned.","reference":"Sahih Muslim 291b, Book 2, Hadith 142","question #":"question #2","question":"How does the consistency of narrations affect the credibility of a hadith?","id":"muslim-2-286"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by two graves and said: They (their occupants) are being tormented, but they are not tormented for a grievous sin. One of them carried tales and the other did not keep himself safe from being defiled by urine. He then called for a fresh twig and split it into two parts, and planted them on each grave and then said: Perhaps, their punishment way be mitigated as long as these twigs remain fresh.","reference":"Sahih Muslim 292a, Book 2, Hadith 143","question #":"question #2","question":"How can actions taken by the living affect the state of the deceased according to Islamic teachings?","id":"muslim-2-287"},{"hadith-eng":"\" The other did not keep himself safe from being defiled by urine.\"","reference":"Sahih Muslim 292b, Book 2, Hadith 144","question #":"question #2","question":"How does personal hygiene relate to spiritual purity in Islamic teachings?","id":"muslim-2-288"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Cleanliness is half of faith and al-Hamdu Lillah (all praise and gratitude is for Allah alone) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Lillah fill up what is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.","reference":"Sahih Muslim 223, Book 2, Hadith 1","question #":"question #3","question":"How does the Qur'an serve as a proof for or against a person according to Islamic teachings?","id":"muslim-2-289"},{"hadith-eng":"'\" 'Abdullah bin 'Umar came to visit Ibn 'Amir when he was sick and he said: 'Won't you supplicate to Allah for me, O Ibn 'Umar ?' He said: 'I heard the Messenger of Allah (ﷺ) say: \"No Salat is accepted without Wudu' (purification), and no charity (is accepted) that comes from Ghulul [1] \" and you were the governor of Al-Basrah.' \"\r\n\r\n[1] Goods pilfered from the spoils of war prior to their authorized distribution.","reference":"Sahih Muslim 224a, Book 2, Hadith 2","question #":"question #3","question":"How does the role of a governor relate to the acceptance of charity in Islam?","id":"muslim-2-290"},{"hadith-eng":"A hadith like this is narrated from the Apostle (ﷺ) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.","reference":"Sahih Muslim 224b, Book 2, Hadith 3","question #":"question #3","question":"Why is it important to have multiple narrators for the same hadith in Islamic tradition?","id":"muslim-2-291"},{"hadith-eng":"This is what has been transmitted to us by Abu Huraira from Muhammad, the Messenger of Allah (ﷺ) and then narrated a hadith out of them and observed that the Messenger of Allah (ﷺ) said: The prayer of none amongst you would be accepted in a state of impurity until he performs ablution.","reference":"Sahih Muslim 225, Book 2, Hadith 4","question #":"question #3","question":"How does the state of impurity affect the acceptance of prayers in Islamic teachings?","id":"muslim-2-292"},{"hadith-eng":"Uthman b. 'Affan called for ablution water and this is how he performed the ablution. He washed his hands thrice. He then rinsed his mouth and cleaned his nose with water (three times). He then washed his face three times, then washed his right arm up to the elbow three times, then washed his left arm like that, then wiped his head; then washed his right foot up to the ankle three times, then washed his left foot like that, and then said: I saw the Messenger of Allah (ﷺ) perform ablution like this ablution of mine. Then the Messenger of Allah (ﷺ) said: He who performs ablution like this ablution of mine and then stood up (for prayer) and offered two rak'ahs of prayer without allowing his thoughts to be distracted, all his previous sins are expiated. Ibn Shihab said: Our scholars remarked: This is the most complete of the ablutions performed for prayer.","reference":"Sahih Muslim 226a, Book 2, Hadith 5","question #":"question #3","question":"Why is it important to perform ablution with attention to detail before prayer?","id":"muslim-2-293"},{"hadith-eng":"I saw Uthman call for a vessel (of water) and poured water over his hands three times and then washed them. Then he put his right hand in the vessel and rinsed his mouth and cleaned his nose. Then he washed his face three times and his hands up to the elbow three times; then wiped his head, then washed his feet three times. Then he said that the Messenger of Allah (ﷺ) had said: He who performed ablution like this ablution of mine and offered two raka`ahs of prayer without allowing his thoughts to be distracted, all his previous sins would be expiated.","reference":"Sahih Muslim 226b, Book 2, Hadith 6","question #":"question #3","question":"What is the significance of maintaining focus during prayer in the context of forgiveness?","id":"muslim-2-294"},{"hadith-eng":"I heard from 'Uthman b. 'Affan and he was in the courtyard of the mosque, when the Mu'adhdhin (announcer of the prayer) came to him at the time of afternoon prayer. So the ('Uthman) called for the ablution water and performed ablution and then said: By Allah, I am narrating to you a hadith. If there were not a verse in the Book of Allah, I would have never narrated it to you. I heard Allah's Messenger (ﷺ) say: If a Muslim performs ablution and does it well and offers prayer, all his (sins) daring the period from one prayer to another would be pardoned by Allah.","reference":"Sahih Muslim 227a, Book 2, Hadith 7","question #":"question #3","question":"What role does the Quran play in encouraging the narration of hadiths?","id":"muslim-2-295"},{"hadith-eng":"\" He who performed the ablution well and then offered the obligatory prayer.\"","reference":"Sahih Muslim 227b, Book 2, Hadith 8","question #":"question #3","question":"What are the spiritual benefits of performing ablution with care and attention?","id":"muslim-2-296"},{"hadith-eng":"By Allah, I am narrating to you a hadith had there not been this verse in the Book of Allah. I would not have narrated it to you. Verily I heard the Messenger of Allah (ﷺ) say: Not a person is there who performed ablution, and did it well, then offered prayer, but his sins (which he committed) were not pardoned between the prayer that he offered and the next one. 'Urwa said: The verse is this:\" Those who suppress the clear proofs and the guidance which We have sent down\"... to His words:\" the Cursers\" (ii. 15).","reference":"Sahih Muslim 227c, Book 2, Hadith 9","question #":"question #3","question":"What is the impact of suppressing clear proofs and guidance in the context of Islamic scripture?","id":"muslim-2-297"},{"hadith-eng":"I was with Uthman, and he called for ablution water and said: I heard Allah's Messenger (ﷺ) say: When the time for a prescribed prayer comes, if any Muslim performs ablution well and offers his prayer with humility and bowing, it will be an expiation for his past sins, so long as he has not committed a major sin; and this applies for all times.","reference":"Sahih Muslim 228, Book 2, Hadith 10","question #":"question #3","question":"What conditions must be met for prayers to serve as expiation for past sins?","id":"muslim-2-298"},{"hadith-eng":"I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (ﷺ) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (ﷺ) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"","reference":"Sahih Muslim 229, Book 2, Hadith 11","question #":"question #3","question":"What additional rewards are associated with performing ablution and attending the mosque for prayer?","id":"muslim-2-299"},{"hadith-eng":"Should I not show you the ablution performed by Allah's Messenger (ﷺ)? And he then washed (the different parts of the body) three times. 4\" Qutaiba has added in his narration the words:\" There were with him (with Uthman) Companions of Allah's Messenger (ﷺ).\"","reference":"Sahih Muslim 230, Book 2, Hadith 12","question #":"question #3","question":"Why is it important to learn the practices of the Prophet (ﷺ) from his companions?","id":"muslim-2-300"},{"hadith-eng":"I used to fetch water for 'Uthman for his purification. Never was there a day that he did not take a bath with a small quantity of water. And Uthman said: The Messenger of Allah (ﷺ) at the time of our returning from our prayer told us (certain things pertaining to purification). Mis'ar said: I find that it was afternoon prayer. He said: I do not know whether I should tell you a thing or keep quiet. We said: Messenger of Allah, tell us if it is good and if it is otherwise, Allah and His Apostle know better. Upon this he said: A Muslim who purifies (himself) and completes purification as enjoined upon him by Allah and then offers the prayers, that will be expiation (of his sins he committed) between these (prayers).","reference":"Sahih Muslim 231a, Book 2, Hadith 13","question #":"question #3","question":"What role does the quantity of water play in the purification process according to Islamic practices?","id":"muslim-2-301"},{"hadith-eng":"I heard Humran b. Aban narrate to Abu Burda in this very mosque during the governorship of Bishr that 'Uthman b. Alfan said: The Messenger of Allah (ﷺ) observed: He who completed ablution as Allah, the Exalted, enjoined upon him, his obligatory prayers would be explatious (for his minor sins that he would commit) during (the interval) between them. This hadith is transmitted by Ibn Mu'adh, and in the hadith narrated by Ghundar, the words\" during the governorship of Bishr\" are omitted and there is no mention of the obligatory prayers.","reference":"Sahih Muslim 231b, Book 2, Hadith 14","question #":"question #3","question":"What is the role of ablution in the spiritual purification process in Islam?","id":"muslim-2-302"},{"hadith-eng":"One day Uthman b. Affan performed the ablution well, and then said: I saw Allah's Messenger (ﷺ) perform ablution, the best ablution, and then observed: He who performed ablution like this and then went towards the mosque and nothing (but the love of) prayer urged him (to do so), all his previous (minor) sins would be expiated.","reference":"Sahih Muslim 232a, Book 2, Hadith 15","question #":"question #3","question":"What are the spiritual benefits of performing ablution and attending prayer in the mosque?","id":"muslim-2-303"},{"hadith-eng":"He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.","reference":"Sahih Muslim 232b, Book 2, Hadith 16","question #":"question #3","question":"What are the benefits of offering obligatory prayers in a mosque according to Islamic teachings?","id":"muslim-2-304"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Five prayers and from one Friday prayer to (the next) Friday prayer is an expiation (of the sins committed in between their intervals) if major sins are not committed.","reference":"Sahih Muslim 233a, Book 2, Hadith 17","question #":"question #3","question":"What is the condition for prayers to serve as expiation for sins?","id":"muslim-2-305"},{"hadith-eng":"The five (daily) prayers and one Friday prayer to (the next) Friday prayer are expiations (for the sins committed in the intervals) between them.","reference":"Sahih Muslim 233b, Book 2, Hadith 18","question #":"question #3","question":"What is the role of regular prayer in maintaining spiritual purity and forgiveness in Islam?","id":"muslim-2-306"},{"hadith-eng":"Verily the Messenger of Allah (ﷺ) said: The five (daily) prayers and from one Friday prayer to the (next) Friday prayer, and from Ramadhan to Ramadhan are expiations for the (sins) committed in between (their intervals) provided one shuns the major sins.","reference":"Sahih Muslim 233c, Book 2, Hadith 19","question #":"question #3","question":"How does the observance of Ramadan serve as a means for expiating sins?","id":"muslim-2-307"},{"hadith-eng":"We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (ﷺ) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umar who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.","reference":"Sahih Muslim 234a, Book 2, Hadith 20","question #":"question #3","question":"What is the significance of performing ablution well in relation to entering Paradise according to Islamic beliefs?","id":"muslim-2-308"},{"hadith-eng":"Verily the Messenger of Allah (ﷺ) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.","reference":"Sahih Muslim 234b, Book 2, Hadith 21","question #":"question #3","question":"What are the spiritual benefits of affirming the oneness of Allah and the prophethood of Muhammad after ablution?","id":"muslim-2-309"},{"hadith-eng":"It was said to him (by people): Perform for us the ablution (as it was performed) by the Messenger of Allah (way peace be upon him). He ('Abdullah b. Zaid) called for a vessel (of water), and poured water from it on his hands and washed them three times. Then he inserted his hand (in the vessel) and brought it (water) out, rinsed his mouth and snuffed up water from the palm of one hand doing that three times, He again inserted his hand and brought it out and washed his face three times, then inserted his hand and brought it out and washed each arm up to the elbow twice, then inserted his hand and brought it out and wiped his head both front and back with his hands. He then washed his feet up to the ankles, and then said: This is how God's Messenger (peace be upon him) performed ablution.","reference":"Sahih Muslim 235a, Book 2, Hadith 22","question #":"question #3","question":"What is the significance of following the Prophet's method of ablution in Islamic practice?","id":"muslim-2-310"},{"hadith-eng":"This hadith is narrated by Amr b. Yahya with the same chain of transmitters, but there is no mention of ankles.","reference":"Sahih Muslim 235b, Book 2, Hadith 23","question #":"question #3","question":"Why is it important to compare different narrations of the same hadith?","id":"muslim-2-311"},{"hadith-eng":"He moved them (his hands) for wiping to the front of his head and then the nape of his neck, then bringing them back till he reached the place from which he had begun, after which he washed his feet.","reference":"Sahih Muslim 235c, Book 2, Hadith 24","question #":"question #3","question":"What are the steps involved in washing the feet during ablution according to Islamic teachings?","id":"muslim-2-312"},{"hadith-eng":"This hadith has been narrated by Wuwb on the authority of 'Amr b. Yahyi with the same chain of transmitters and it has been mentioned therein: He rinsed his mouth. snuffed up water in nostrils and cleaned the nose with three handfuls and wiped his head moving (his hand) in front and then back once. Bahz said: Wuhaib narrated this hadith to me and Wuhaib said: Amr b. Yahya narrated to me this hadith twice.","reference":"Sahih Muslim 235d, Book 2, Hadith 25","question #":"question #3","question":"What is the significance of wiping the head during ablution according to this narration?","id":"muslim-2-313"},{"hadith-eng":"He saw Allah's Messenger (ﷺ) perform the ablution. He rinsed his mouth then cleaned his nose, then washed his face three times, then washed his right hand thrice and then the other one, thrice. He then took fresh water and wiped his head and then washed his feet till he cleaned them.","reference":"Sahih Muslim 236, Book 2, Hadith 26","question #":"question #3","question":"What is the significance of following the Prophet's method in performing ablution?","id":"muslim-2-314"},{"hadith-eng":"When anyone wipes himself with pebbles (after answering the call of nature) he must make use of an odd number and when any one of you performs ablution he must snuff in his nose water and then clean it.","reference":"Sahih Muslim 237a, Book 2, Hadith 27","question #":"question #3","question":"How does the practice of using an odd number relate to Islamic rituals and cleanliness?","id":"muslim-2-315"},{"hadith-eng":"This is what Abu Huraira transmitted to us from Muhammad, the Messenger of Allah (ﷺ), and he mentioned a number of a hadith, of which this is one: that the Messenger of Allah (ﷺ) said: When anyone amongst you (performs ablution) he must snuff his nostrils with water and then clean them.","reference":"Sahih Muslim 237b, Book 2, Hadith 28","question #":"question #3","question":"What are the steps involved in performing ablution according to Islamic teachings?","id":"muslim-2-316"},{"hadith-eng":"The Messenger of Allah (way peace he upon him) said: When anyone performs ablution he must clean his nose and when anyone wipes himself with pebbles (after answering the call of nature) he must do that odd number of times.","reference":"Sahih Muslim 237c, Book 2, Hadith 29","question #":"question #3","question":"How does performing ablution relate to cleanliness and hygiene in Islam?","id":"muslim-2-317"},{"hadith-eng":"It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (ﷺ) said like that.","reference":"Sahih Muslim 237d, Book 2, Hadith 30","question #":"question #3","question":"How are the sayings of the Prophet Muhammad (ﷺ) authenticated in Islamic tradition?","id":"muslim-2-318"},{"hadith-eng":"The Apostle of Allah (ﷺ) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.","reference":"Sahih Muslim 238, Book 2, Hadith 31","question #":"question #3","question":"What are the recommended practices upon waking up from sleep according to Islamic teachings?","id":"muslim-2-319"},{"hadith-eng":"When anyone wipes himself with pebbles (after answering the call of nature) he should do this odd number of times.","reference":"Sahih Muslim 239, Book 2, Hadith 32","question #":"question #3","question":"What are the recommended practices for cleanliness in Islam after using the restroom?","id":"muslim-2-320"},{"hadith-eng":"I came to 'A'isha, the wife of the Prophet (ﷺ), on the day when Sa'db. Abi Waqqas died. 'Abd al-Rahman b. Abu Bakr also came there and he performed ablution in her presence. She (Hadrat 'A'isha) said: Abd al-Rahman, complete the ablution as I heard the Allah's Messenger (ﷺ) say: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 240a, Book 2, Hadith 33","question #":"question #3","question":"What are the consequences mentioned for neglecting proper ablution?","id":"muslim-2-321"},{"hadith-eng":"Abdullah, the freed slave of Shahddad, came to 'A'isha and transmitted from her a hadith like this (which she narrated) from the Prophet (ﷺ).","reference":"Sahih Muslim 240b, Book 2, Hadith 34","question #":"question #3","question":"How does the chain of narration impact the authenticity of a hadith?","id":"muslim-2-322"},{"hadith-eng":"I and 'Abd al-Rahman b. Abu Bakr went out (in order to join) the funeral procession of Sa'd b. Abi Waqqas and passed by the door of the residence of 'A'isha, and then he transmitted a hadith like this from her who (narrated it) from the Prophet (ﷺ).","reference":"Sahih Muslim 240c, Book 2, Hadith 35","question #":"question #3","question":"What role did 'A'isha play in the transmission of hadiths from the Prophet (ﷺ)?","id":"muslim-2-323"},{"hadith-eng":"I was in the presence of 'A'isha, and then narrated on her authority a hadith like this from the Prophet (way peace be upon him).","reference":"Sahih Muslim 240d, Book 2, Hadith 36","question #":"question #3","question":"What role does 'A'isha play in the transmission of hadiths in Islamic tradition?","id":"muslim-2-324"},{"hadith-eng":"We returned from Mecca to Medina with the Messenger of Allah (ﷺ), and when we came to some water on the way, some of the people were in a hurry at the time of the afternoon prayer and performed ablution hurriedly; and when we reached them, their heels were dry, no water had touched them. The Prophet (ﷺ) said: Woe to (dry) heels, because of Hell-fire. Make your ablution thorough.","reference":"Sahih Muslim 241a, Book 2, Hadith 37","question #":"question #3","question":"How does the thoroughness of ablution relate to the concept of purification in Islam?","id":"muslim-2-325"},{"hadith-eng":"\" Complete the Wudu,\" and there is the name of Abu Yahya al-A'raj (a narrator).","reference":"Sahih Muslim 241b, Book 2, Hadith 38","question #":"question #3","question":"How does the transmission of hadiths vary among different narrators?","id":"muslim-2-326"},{"hadith-eng":"The Messenger of Allah (ﷺ) lagged behind us on a journey. We travelled (back) and be took him; and then came the time of the afternoon prayer, and as we were going to wipe our feet he (the Holy Prophet) called out: Woe to the heels because of Hell-fire.","reference":"Sahih Muslim 241c, Book 2, Hadith 39","question #":"question #3","question":"How does the concept of Hell-fire relate to the performance of religious duties in Islam?","id":"muslim-2-327"},{"hadith-eng":"Allah's Apostle (ﷺ) saw a man who did not wash his heel and he remarked: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 242a, Book 2, Hadith 40","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) emphasize the importance of thoroughness in ablution?","id":"muslim-2-328"},{"hadith-eng":"He saw people perform ablution with the help of a water jar and he said: Complete the Wudu for i heard Abu al-Qasim (ﷺ) say: Woe to the hamstrings because of hell-fire.","reference":"Sahih Muslim 242b, Book 2, Hadith 41","question #":"question #3","question":"How does the concept of thoroughness in ablution relate to spiritual cleanliness?","id":"muslim-2-329"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Woe to the heels because of hell-fire.","reference":"Sahih Muslim 242c, Book 2, Hadith 42","question #":"question #3","question":"How does the concept of accountability in religious practices manifest in Islamic teachings?","id":"muslim-2-330"},{"hadith-eng":"'Umar b. Khattab said that a person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah (ﷺ) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.","reference":"Sahih Muslim 243, Book 2, Hadith 43","question #":"question #3","question":"What actions should be taken if one realizes they have not performed ablution properly before prayer?","id":"muslim-2-331"},{"hadith-eng":"Allah's Messenger (ﷺ) said: When a bondsman-a Muslim or a believer-washes his face (in course of ablution), every sin he contemplated with his eyes, will be washed away from his face along with water, or with the last drop of water; when he washes his hands, every sin they wrought will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin towards which his feet have walked will be washed away with the water or with the last drop of water with the result that he comes out pure from all sins.","reference":"Sahih Muslim 244, Book 2, Hadith 44","question #":"question #3","question":"What are the benefits of performing ablution with sincerity and mindfulness?","id":"muslim-2-332"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) said: He who performed ablution well, his sins would come out from his body, even coming out from under his nails.","reference":"Sahih Muslim 245, Book 2, Hadith 45","question #":"question #3","question":"What is the symbolic meaning of sins coming out from under one's nails during ablution?","id":"muslim-2-333"},{"hadith-eng":"I saw Abu Huraira perform ablution. He washed his face and washed it well. He then washed his right hand including a portion of his arm. He then washed his left hand including a portion of his arm. He then wiped his head. He then washed his right foot including his shank, and then washed his left foot including shank, and then said: This is how I saw Allah's Messenger (ﷺ) perform his ablution. And (Abu Huraira) added that the Messenger of Allah (ﷺ) had observed: You shall have your faces hands and feet bright on the Day of Resurrection because of your perfect ablution. He who can afford among you, let him increase the brightness of his forehead and that of hands and legs.","reference":"Sahih Muslim 246a, Book 2, Hadith 46","question #":"question #3","question":"How can one increase the brightness of their forehead, hands, and legs as mentioned in the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-334"},{"hadith-eng":"He saw Abu Huraira perform ablution. He washed his face and washed his hands up to the arms. He then washed his feet and reached up to the shanks and then said: I heard Allah's Messenger (ﷺ) say: My people would come with bright faces and bright hands and feet on account of the marks of ablution, so he who can increase the lustre of his forehead (and that of his hands and legs) should do so.","reference":"Sahih Muslim 246b, Book 2, Hadith 47","question #":"question #3","question":"What is the significance of increasing the brightness of one's forehead, hands, and legs through ablution?","id":"muslim-2-335"},{"hadith-eng":"Verily Allah's Messenger (ﷺ) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.","reference":"Sahih Muslim 247a, Book 2, Hadith 48","question #":"question #3","question":"What significance does ablution have in distinguishing believers on the Day of Judgment?","id":"muslim-2-336"},{"hadith-eng":"My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.","reference":"Sahih Muslim 247b, Book 2, Hadith 49","question #":"question #3","question":"What might cause some individuals to be prevented from meeting the Prophet Muhammad (ﷺ) at the Cistern?","id":"muslim-2-337"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allah, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).","reference":"Sahih Muslim 248, Book 2, Hadith 50","question #":"question #3","question":"What is the importance of ablution in distinguishing the followers of the Prophet Muhammad (ﷺ) in the afterlife?","id":"muslim-2-338"},{"hadith-eng":"The Messenger of Allah (ﷺ) came to the graveyard and said: \"Peace be upon you! The abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers.\" They (the hearers) said: Aren't we your brothers, O Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of Allah, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on foreheads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly, O Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out: Come, come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off.","reference":"Sahih Muslim 249a, Book 2, Hadith 51","question #":"question #3","question":"What warning does the Prophet Muhammad (ﷺ) give about those who change themselves after his time?","id":"muslim-2-339"},{"hadith-eng":"The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.","reference":"Sahih Muslim 249b, Book 2, Hadith 52","question #":"question #3","question":"What is the Cistern mentioned in Islamic eschatology and who will be driven away from it?","id":"muslim-2-340"},{"hadith-eng":"I was (standing) behind Abu Huraira and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend (ﷺ) say. In a believer adornment would reach the places where ablution reaches.","reference":"Sahih Muslim 250, Book 2, Hadith 53","question #":"question #3","question":"What did Abu Huraira demonstrate about the practice of ablution and its spiritual benefits?","id":"muslim-2-341"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.","reference":"Sahih Muslim 251a, Book 2, Hadith 54","question #":"question #3","question":"What is the significance of waiting for the next prayer after completing one in Islamic practice?","id":"muslim-2-342"},{"hadith-eng":"This hadith has been narrated on the authority of `Ali b. `Abd al-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu`ba and in the hadith narrated by Malik \"Ribat\" has been mentioned twice. This is the \"Ribat\" for you, this is the \"Ribat\" for you.","reference":"Sahih Muslim 251b, Book 2, Hadith 55","question #":"question #3","question":"What role do different chains of transmitters play in the variations of hadith narrations?","id":"muslim-2-343"},{"hadith-eng":"The Apostle (ﷺ) said: Were it not that I might over-burden the believers-and in the hadith transmitted by Zuhair\" people\" -I would have ordered them to use toothstick at every time of prayer.","reference":"Sahih Muslim 252, Book 2, Hadith 56","question #":"question #3","question":"How does the use of a toothstick relate to the concept of cleanliness in Islam?","id":"muslim-2-344"},{"hadith-eng":"I asked A'isha what Allah's Apostle (ﷺ) did first when he entered his house, and she replied: He used tooth-stick (first of all).","reference":"Sahih Muslim 253a, Book 2, Hadith 57","question #":"question #3","question":"How did A'isha describe the personal hygiene practices of the Prophet Muhammad (ﷺ) at home?","id":"muslim-2-345"},{"hadith-eng":"Whenever Allah's Messenger (ﷺ) entered his house, he used tooth-stick first of all.","reference":"Sahih Muslim 253b, Book 2, Hadith 58","question #":"question #3","question":"What practices are recommended for maintaining cleanliness in Islam based on the actions of the Prophet (ﷺ)?","id":"muslim-2-346"},{"hadith-eng":"I went to the Apostle (ﷺ) and found one end of the tooth-stick upon his tongue (i. e. he was rinsing his mouth).","reference":"Sahih Muslim 254, Book 2, Hadith 59","question #":"question #3","question":"What can be learned about the daily habits of the Prophet (ﷺ) from his use of a tooth-stick?","id":"muslim-2-347"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) got up for Tahajjud prayer, he cleansed his mouth with the tooth-stick.","reference":"Sahih Muslim 255a, Book 2, Hadith 60","question #":"question #3","question":"What practices are recommended for oral hygiene in Islam before engaging in prayer?","id":"muslim-2-348"},{"hadith-eng":"for offering Tahajjud prayer.","reference":"Sahih Muslim 255b, Book 2, Hadith 61","question #":"question #3","question":"What are the benefits of waking up at night for prayer according to Islamic tradition?","id":"muslim-2-349"},{"hadith-eng":"Whenever he (the Holy Prophet) got up for prayer during the night, he cleansed his mouth with the tooth-stick.","reference":"Sahih Muslim 255c, Book 2, Hadith 62","question #":"question #3","question":"What are the recommended practices for preparing oneself for night prayers in Islam?","id":"muslim-2-350"},{"hadith-eng":"\" Verily in the creation of the heavens and the earth and the alternation of night and day.\" up to the (words)\" save us from the torment of Hell.\" He then returned to his house, used the tooth-stick, performed the ablution, and then got up and offered the prayer. He than lay down on the bed. and again got up and went out and looked towards the sky and recited this verse (mentioned above), then returned, used the tooth-stick, performed ablution and again offered the prayer.","reference":"Sahih Muslim 256, Book 2, Hadith 63","question #":"question #3","question":"What is the importance of reciting specific Quranic verses during night prayers?","id":"muslim-2-351"},{"hadith-eng":"Five are the acts quite akin to the Fitra, or five are the acts of Fitra: circumcision, shaving the pubes, cutting the nails, plucking the hair under the armpits and clipping the moustache.","reference":"Sahih Muslim 257a, Book 2, Hadith 64","question #":"question #3","question":"How do the practices related to Fitra contribute to a Muslim's daily life?","id":"muslim-2-352"},{"hadith-eng":"Five are the acts of fitra: circumcision, removing the pubes, clipping the moustache, cutting the nails, plucking the hair under the armpits.","reference":"Sahih Muslim 257b, Book 2, Hadith 65","question #":"question #3","question":"How do the practices of fitra contribute to a Muslim's daily life?","id":"muslim-2-353"},{"hadith-eng":"A time limit has been prescribed for us for clipping the moustache, cutting the nails, plucking hair under the armpits, shaving the pubes, that it should not be neglected far more than forty nights.","reference":"Sahih Muslim 258, Book 2, Hadith 66","question #":"question #3","question":"What is the maximum time limit prescribed for neglecting personal grooming practices like plucking hair under the armpits and shaving the pubes?","id":"muslim-2-354"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: Trim closely the moustache, and let the beard grow.","reference":"Sahih Muslim 259a, Book 2, Hadith 67","question #":"question #3","question":"How does personal grooming relate to Islamic teachings on cleanliness and appearance?","id":"muslim-2-355"},{"hadith-eng":"The Apostle of Allah (ﷺ) ordered us to trim the moustache closely and spare the beard.","reference":"Sahih Muslim 259b, Book 2, Hadith 68","question #":"question #3","question":"How does maintaining a beard relate to Islamic teachings on personal appearance?","id":"muslim-2-356"},{"hadith-eng":"The Messenger of Allah (may peace be opon him) said: Act against the polytheists, trim closely the moustache and grow beard.","reference":"Sahih Muslim 259c, Book 2, Hadith 69","question #":"question #3","question":"What is the significance of following the Prophet's guidance on personal appearance in Islam?","id":"muslim-2-357"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Trim closely the moustache, and grow beard, and thus act against the fire-worshippers.","reference":"Sahih Muslim 260, Book 2, Hadith 70","question #":"question #3","question":"What are the reasons behind the Islamic guidance on facial hair for men?","id":"muslim-2-358"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Ten are the acts according to fitra: clipping the moustache, letting the beard grow, using the tooth-stick, snuffing water in the nose, cutting the nails, washing the finger joints, plucking the hair under the armpits, shaving the pubes and cleaning one's private parts with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.","reference":"Sahih Muslim 261a, Book 2, Hadith 71","question #":"question #3","question":"What are the recommended practices for maintaining personal hygiene in Islam?","id":"muslim-2-359"},{"hadith-eng":"\" His father said: I forgot the tenth one.\"","reference":"Sahih Muslim 261b, Book 2, Hadith 72","question #":"question #3","question":"What challenges might arise in preserving the exact wording of a hadith over time?","id":"muslim-2-360"},{"hadith-eng":"Your Apostle (ﷺ) teaches you about everything, even about excrement. He replied: Yes, he has forbidden us to face the Qibla at the time of excretion or urination, or cleansing with right hand or with less than three pebbles, or with dung or bone.","reference":"Sahih Muslim 262a, Book 2, Hadith 73","question #":"question #3","question":"What materials are considered inappropriate for cleansing after relieving oneself according to Islamic teachings?","id":"muslim-2-361"},{"hadith-eng":"I see that your friend even teaches you about the excrement. He replied; Yes, he has in fact forbidden us that anyone amongst us should cleanse himself with his right hand, or face the Qibla. He has forbidden the use of dung or bone for it, and he has also instructed us not to use less than three pebbles (for this purpose).","reference":"Sahih Muslim 262b, Book 2, Hadith 74","question #":"question #3","question":"What materials are prohibited for use in cleansing oneself according to Islamic guidance?","id":"muslim-2-362"},{"hadith-eng":"The Messenger of Allah (ﷺ) forbade the use of bone or the droppings of camels for wiping (after excretion).","reference":"Sahih Muslim 263, Book 2, Hadith 75","question #":"question #3","question":"What are the implications of using prohibited items for purification in Islamic practice?","id":"muslim-2-363"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: Whenever you go to the desert, neither turn your face nor turn your back towards the Qibla while answering the call of nature, but face towards the east or the west. Abu Ayyub said: When we came to Syria we found that the latrines already built there were facing towards the Qibla. We turned our faces away from them and begged forgiveness of the Lord. He said: Yes.","reference":"Sahih Muslim 264, Book 2, Hadith 76","question #":"question #3","question":"What actions did the companions take when they found themselves in situations that contradicted Islamic guidelines?","id":"muslim-2-364"},{"hadith-eng":"When any one amongst you squats for answering the call of nature, he should neither turn his face towards the Qibla nor turn his back towards it.","reference":"Sahih Muslim 265, Book 2, Hadith 77","question #":"question #3","question":"How does Islamic etiquette address the orientation of a person during personal hygiene activities?","id":"muslim-2-365"},{"hadith-eng":"I was offering my prayer in the mosque and Abdullah b. Umar was sitting there reclining with his back towards the Qibla. After completing my prayer. I went to him from one side. Abdullah said: People say when you go to the latrine, you should neither turn your face towards the Qibla nor towards Bait-ul-Maqdis. 'Abdullah said (farther): I went up to the roof of the house and saw the Messenger of Allah (ﷺ) squatting on two bricks for relieving himself with his face towards Bait-al-Maqdis.","reference":"Sahih Muslim 266a, Book 2, Hadith 78","question #":"question #3","question":"What can be inferred about the practices of the Prophet Muhammad (ﷺ) from Abdullah ibn Umar's observation?","id":"muslim-2-366"},{"hadith-eng":"I went up to the roof of the house of my sister Hafsa and saw the Messenger of Allah (ﷺ) relieving himself facing Syria. with his back to the Qibla.","reference":"Sahih Muslim 266b, Book 2, Hadith 79","question #":"question #3","question":"What are the considerations for privacy and modesty in Islamic teachings when using the restroom?","id":"muslim-2-367"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: None of you should hold penis with his right hand while urinating, or wipe himself with his right hand in privy and should not breathe into the vessel (from which he drinks).","reference":"Sahih Muslim 267a, Book 2, Hadith 80","question #":"question #3","question":"What are the recommended practices regarding drinking from a vessel in Islamic tradition?","id":"muslim-2-368"},{"hadith-eng":"When anyone amongst you enters the privy he should not touch his penis with his right hand.","reference":"Sahih Muslim 267b, Book 2, Hadith 81","question #":"question #3","question":"How does Islamic guidance address personal hygiene and cleanliness in daily activities?","id":"muslim-2-369"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) forbade (us) to breathe into the venel, to touch the penis with the right hand and to wipe after relieving with right hand.","reference":"Sahih Muslim 267c, Book 2, Hadith 82","question #":"question #3","question":"What are the specific actions that are discouraged during eating and personal hygiene practices in Islam?","id":"muslim-2-370"},{"hadith-eng":"The Messenger of Allah (way peace be upon him) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.","reference":"Sahih Muslim 268a, Book 2, Hadith 83","question #":"question #3","question":"In what ways can the practice of starting from the right-hand side be incorporated into daily routines such as ablution and dressing?","id":"muslim-2-371"},{"hadith-eng":"The Messenger of Allah (ﷺ) loved to start from the right-hand side in his every act i. e. in wearing shoes, in combing (his hair) and in performing ablution.","reference":"Sahih Muslim 268b, Book 2, Hadith 84","question #":"question #3","question":"In what ways can Muslims incorporate the practice of starting from the right side in their daily routines?","id":"muslim-2-372"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: Be on your guard against two things which provoke cursing. They (the companions present there) said: Messenger of Allah, what are those things which provoke cursing? He said: Easing on the thoroughfares or under the shades (where they take shelter and rest).","reference":"Sahih Muslim 269, Book 2, Hadith 85","question #":"question #3","question":"How can individuals contribute to a respectful and clean community in light of Islamic guidance?","id":"muslim-2-373"},{"hadith-eng":"The Messenger of Allah (ﷺ) entered an enclosure while a servant was following him with a jar of water and he was the youngest amongst us and he placed it by the side of a lote-tree. When the Messenger of Allah, (ﷺ) relieved himself, he came out and had cleansed himself with water.","reference":"Sahih Muslim 270, Book 2, Hadith 86","question #":"question #3","question":"What can be learned about the role of young companions in serving and assisting the Prophet (ﷺ)?","id":"muslim-2-374"},{"hadith-eng":"When the Messenger of Allah (ﷺ) entered the privy, a servant and I used to carry a skin of water, and a pointed staff, and he would cleanse himself with water.","reference":"Sahih Muslim 271a, Book 2, Hadith 87","question #":"question #3","question":"How did the companions assist the Prophet (ﷺ) in maintaining cleanliness?","id":"muslim-2-375"},{"hadith-eng":"The Messenger of Allah (ﷺ) went to a far-off place in the desert (hidden from the sight of human beings) for relieving himself. Then I brought water for him and he cleansed himself.","reference":"Sahih Muslim 271b, Book 2, Hadith 88","question #":"question #3","question":"What can be learned about the importance of privacy in personal matters from the actions of the Prophet (ﷺ)?","id":"muslim-2-376"},{"hadith-eng":"Jarir urinated, then performed ablution and wiped over the socks. It was said to him: Do you do like this? He said: Yes, I saw that the Messenger of Allah (ﷺ) urinated, then performed ablution and then wiped over his shoes. A'mash said: Ibrahim had observed that this hadith was a surprise for them (the people) because Jarir had embraced Islam after the revelation of Surat al-Ma'ida.","reference":"Sahih Muslim 272a, Book 2, Hadith 89","question #":"question #3","question":"What can be inferred about the acceptance of certain practices in Islam based on the reactions of the people to Jarir's actions?","id":"muslim-2-377"},{"hadith-eng":"\" This hadith surprised the friends of Abdullab'\" for Jarir had embraced Islam after the revelation of al-Ma'ida.","reference":"Sahih Muslim 272b, Book 2, Hadith 90","question #":"question #3","question":"What can be inferred about the transmission of hadiths from the mention of different chains of transmitters?","id":"muslim-2-378"},{"hadith-eng":"I was with the Messenger of Allah (ﷺ) when he came to the dumping ground of filth belonging to a particular tribe. He urinated while standing, and I went aside. He (the Holy Prophet) asked me to come near him and I went so near to him that I stood behind his heels. He then performed ablution and wiped over his socks.","reference":"Sahih Muslim 273a, Book 2, Hadith 91","question #":"question #3","question":"What can be learned from the Prophet's interaction with his companions during personal and private moments?","id":"muslim-2-379"},{"hadith-eng":"Abu Musa inflicted extreme rigour upon himself in the matter of urination and urinated in a bottle and said: When the skin of anyone amongst the people of Israel was besmeared with urine, he cut that portion with a cutter. Hudhaifa said: I wish that'your friend should not inflict such an extreme rigour. I and the Messenger of Allah (ﷺ) were going together till we reached the dumping ground of filth behind an enclosure. He stood up as one among you would stand up. and he urinated, I tried to turn away from him, but he beckoned to me, so I went to him and I stood behind him, till he had relieved himself.","reference":"Sahih Muslim 273b, Book 2, Hadith 92","question #":"question #3","question":"What can be learned from the companions' observations of the Prophet's (ﷺ) actions regarding cleanliness?","id":"muslim-2-380"},{"hadith-eng":"The Messenger of Allah (ﷺ) went out for relieving himself. Mughira went with him carrying a jug full of water. When he (the Holy Prophet) came back after relieving himself, he poured water over him and he performed ablution and wiped over his socks; and in the narration of Ibn Rumh there is\" till\" instead of\" when\".","reference":"Sahih Muslim 274a, Book 2, Hadith 93","question #":"question #3","question":"What role does carrying water play in the process of performing ablution according to Islamic teachings?","id":"muslim-2-381"},{"hadith-eng":"\" He washed his face and hands, and wiped his head and then wiped his socks.\"","reference":"Sahih Muslim 274b, Book 2, Hadith 94","question #":"question #3","question":"How does this narration contribute to the understanding of the practice of wudoo' in Islam?","id":"muslim-2-382"},{"hadith-eng":"I was with the Messenger of Allah (ﷺ) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.","reference":"Sahih Muslim 274c, Book 2, Hadith 95","question #":"question #3","question":"What are the conditions under which wiping over socks is permissible in Islam?","id":"muslim-2-383"},{"hadith-eng":"I was in the company of the Messenger of Allah (ﷺ) on a journey when he said: Mughira take hold of this jar (of water). I took hold of it and I went out with him. (I stopped but) the Messenger of Allah (ﷺ) proceeded on till he was out of my sight. He relieved himself and then came back and he was wearing a tight-sleeved Syrian gown. He tried to get his forearms out. but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I poured water over (his hands) and he performed ablution for prayer, then wiped over his socks and prayed.","reference":"Sahih Muslim 274d, Book 2, Hadith 96","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to practical challenges during travel from this incident?","id":"muslim-2-384"},{"hadith-eng":"The Messenger of Allah (ﷺ) went out for relieving himself. When he came back I brought for him a jar (of water) and poured water upon his hands and He washed his face. He tried to wash his forearms, but as the (sleeves of the) gown were tight. He, therefore, brought them out from under the gown. He then washed them, wiped his head, and wiped his socks and then prayed.","reference":"Sahih Muslim 274e, Book 2, Hadith 97","question #":"question #3","question":"What is the significance of wiping over socks in the context of ablution?","id":"muslim-2-385"},{"hadith-eng":"I was one night with the Messenger of Allah (ﷺ) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.","reference":"Sahih Muslim 274f, Book 2, Hadith 98","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) approach to practical challenges in religious observance from this incident?","id":"muslim-2-386"},{"hadith-eng":"He (Mughira) helped the Apostle (ﷺ) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.","reference":"Sahih Muslim 274g, Book 2, Hadith 99","question #":"question #3","question":"How does the cleanliness of feet affect the validity of wiping over shoes in ablution?","id":"muslim-2-387"},{"hadith-eng":"The Messenger of Allah (ﷺ) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin b. 'Anf leading them and had completed a rak'a. When he perceived the presence of the Messenger of Allah (ﷺ) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle (ﷺ) got up and I also got up with him, and we offered the rak'a which had been finished before we came.","reference":"Sahih Muslim 274h, Book 2, Hadith 100","question #":"question #3","question":"What is the significance of the Prophet Muhammad (ﷺ) allowing someone else to continue leading the prayer upon his arrival?","id":"muslim-2-388"},{"hadith-eng":"The Apostle of Allah (ﷺ) wiped over his socks and over his forehead and over his turban.","reference":"Sahih Muslim 274i, Book 2, Hadith 101","question #":"question #3","question":"What is the significance of wiping over the forehead in the context of Islamic ablution practices?","id":"muslim-2-389"},{"hadith-eng":"This hadith has been transmitted by Ibn Mughira on the authority of his father by another chain of transmitters.","reference":"Sahih Muslim 274j, Book 2, Hadith 102","question #":"question #3","question":"What role do narrators play in preserving the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-390"},{"hadith-eng":"Bakr reported that he had heard from the son of Mughira that verily the Messenger of Allah (ﷺ) performed ablution and wiped over his forehead and wiped over his turban and over his socks.","reference":"Sahih Muslim 274k, Book 2, Hadith 103","question #":"question #3","question":"What is the significance of wiping over the turban in the context of ablution?","id":"muslim-2-391"},{"hadith-eng":"\" Bilal narrated it to me.\"This tradition is transmitted by A'mash with this addition;, I saw the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 275, Book 2, Hadith 104","question #":"question #3","question":"What are the conditions under which wiping over socks is permissible in Islam?","id":"muslim-2-392"},{"hadith-eng":"I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger (ﷺ). We asked him and he said: The Messenger of Allah (ﷺ) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.","reference":"Sahih Muslim 276a, Book 2, Hadith 105","question #":"question #3","question":"How does the practice of wiping over socks differ for travelers compared to residents?","id":"muslim-2-393"},{"hadith-eng":"This hadith is narrated by Ubaidullah b. 'Amr and Zaid b. Abu Unaisa with the same chain of transmitters.","reference":"Sahih Muslim 276b, Book 2, Hadith 106","question #":"question #3","question":"Why is it important to have multiple narrators for the same hadith in Islamic tradition?","id":"muslim-2-394"},{"hadith-eng":"I asked 'A'isha about wiping over the shoes. She said: You better go to 'Ali, for he knows more about this than I. I, therefore, came to 'Ali and he narrated from the Apostle (ﷺ) like this.","reference":"Sahih Muslim 276c, Book 2, Hadith 107","question #":"question #3","question":"How does the practice of wiping over shoes relate to Islamic teachings on cleanliness and prayer?","id":"muslim-2-395"},{"hadith-eng":"You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.","reference":"Sahih Muslim 277, Book 2, Hadith 108","question #":"question #3","question":"What can be learned from the Prophet's intentional actions during the Conquest of Mecca regarding religious practices?","id":"muslim-2-396"},{"hadith-eng":"When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.","reference":"Sahih Muslim 278a, Book 2, Hadith 109","question #":"question #3","question":"How does Islamic practice address the uncertainty of cleanliness during sleep?","id":"muslim-2-397"},{"hadith-eng":"This hadith is transmitted from Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 278b, Book 2, Hadith 110","question #":"question #3","question":"What role does Sahih Muslim play in the collection and classification of hadiths?","id":"muslim-2-398"},{"hadith-eng":"Zahri and Ibn Musayyab have both transmitted a hadith like this from Abu Huraira who narrated it from the Apostle (ﷺ).","reference":"Sahih Muslim 278c, Book 2, Hadith 111","question #":"question #3","question":"How does the transmission of hadiths from multiple narrators affect their reliability?","id":"muslim-2-399"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.","reference":"Sahih Muslim 278d, Book 2, Hadith 112","question #":"question #3","question":"How does the practice of washing hands relate to the concept of hygiene in Islam?","id":"muslim-2-400"},{"hadith-eng":"This hadith has been transmitted through other chains of transmitters on the authority of Abu Huraira in which it is reported that the Messenger of Allah (ﷺ) made a mention of washing the hand, and did not instruct to wash it three times. But the hadith narrated from Jabir and Ibn Musayyab. Abu Salama, and Abdullah b. Shaqiq, Abu Salih, Abla Razin, there is a mention of\" three times\".","reference":"Sahih Muslim 278e, Book 2, Hadith 113","question #":"question #3","question":"What is the role of repetition in the acts of purification in Islam?","id":"muslim-2-401"},{"hadith-eng":"When a dog licks a utensil belonging to any one of you, (the thing contained in it) should be thrown away and then (the utensil) should be washed seven times.","reference":"Sahih Muslim 279a, Book 2, Hadith 114","question #":"question #3","question":"What should be done with the contents of a utensil if a dog licks it?","id":"muslim-2-402"},{"hadith-eng":"This hadith has been transmitted by another chain of transmitters in which there is no mention of\" throwing away\".","reference":"Sahih Muslim 279b, Book 2, Hadith 115","question #":"question #3","question":"Why might certain details be omitted in different narrations of the same hadith?","id":"muslim-2-403"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: When a dog drinks out of a vessel belonging to any one of you, he must wash it seven times.","reference":"Sahih Muslim 279c, Book 2, Hadith 116","question #":"question #3","question":"What are the implications of cleanliness and purity in Islamic practices when dealing with animals?","id":"muslim-2-404"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: The purification of the utensil belonging to any one of you, after it is licked by a dog, lies in washing it seven times, using sand for the first time.","reference":"Sahih Muslim 279d, Book 2, Hadith 117","question #":"question #3","question":"What is the significance of using sand in the purification process of utensils licked by a dog?","id":"muslim-2-405"},{"hadith-eng":"Of the a hadith narrated by Abu Huraira from Muhammad, the Messenger of Allah (ﷺ), one is this: The Messenger of Allah (ﷺ) said: The purification of the utensil belonging to one amongst you, after it is licked by a dog, lies in washing it seven times.","reference":"Sahih Muslim 279e, Book 2, Hadith 118","question #":"question #3","question":"What is the significance of washing a utensil seven times in Islamic purification practices?","id":"muslim-2-406"},{"hadith-eng":"The Messenger of Allah (ﷺ) ordered killing of the dogs, and then said: What about them, i. e. about other dogs? and then granted concession (to keep) the dog for hunting and the dog for (the security) of the herd, and said: When the dog licks the utensil, wash it seven times, and rub it with earth the eighth time.","reference":"Sahih Muslim 280a, Book 2, Hadith 119","question #":"question #3","question":"What exceptions are made for keeping dogs in Islamic teachings?","id":"muslim-2-407"},{"hadith-eng":"\" He (the Holy Prophet) gave concession in the case of the dog for looking after the herd, for hunting and for watching the cultivated land,\" and there is no mention of this addition (i. e. concession in case of watching the cultivated lands) except in the hadith transmitted by Yahya.","reference":"Sahih Muslim 280b, Book 2, Hadith 120","question #":"question #3","question":"What are the conditions under which concessions are made for keeping dogs in Islam?","id":"muslim-2-408"},{"hadith-eng":"The Messenger of Allah (ﷺ) forbade to urinate in stagnant water.","reference":"Sahih Muslim 281, Book 2, Hadith 121","question #":"question #3","question":"What are the potential health risks associated with contaminating stagnant water?","id":"muslim-2-409"},{"hadith-eng":"the Messenger of Allah (ﷺ) said: None amongst you should urinate in standing water, and then wash in it.","reference":"Sahih Muslim 282a, Book 2, Hadith 122","question #":"question #3","question":"How does Islamic teaching address the use of shared natural resources like water?","id":"muslim-2-410"},{"hadith-eng":"Of the ahadith narrated to us by Abfi Huraira from Muhammad the Messenger of Allah (ﷺ) one is this: The Messenger or Allah (ﷺ) said: You should not urinate in standing water, that is not flowing, then wash in it.","reference":"Sahih Muslim 282b, Book 2, Hadith 123","question #":"question #3","question":"How does Islamic law address the use of water for purification purposes?","id":"muslim-2-411"},{"hadith-eng":"None of you must wash in standing water when he is in a state of Junub. And Abu Huraira was asked how it was to be done; he said: It was to be taken out in handfuls.","reference":"Sahih Muslim 283, Book 2, Hadith 124","question #":"question #3","question":"What are the recommended practices for maintaining cleanliness and purity in Islam during a state of Junub?","id":"muslim-2-412"},{"hadith-eng":"A Bedouin urinated in the mosque. Some of the persons stood up (to reprimand him or to check him from doing so), but the Messenger of Allah (ﷺ) said: Leave him alone; don't interrupt him. He (the narrator) said: And when he had finished, he called for a bucket of water and poured it over.","reference":"Sahih Muslim 284a, Book 2, Hadith 125","question #":"question #3","question":"What actions should be taken to purify a place after it has been defiled?","id":"muslim-2-413"},{"hadith-eng":"Leave him alone. When he had finished, the Messenger of Allah (ﷺ) ordered that a bucket (of water) should be brought and poured over it.","reference":"Sahih Muslim 284b, Book 2, Hadith 126","question #":"question #3","question":"What actions should be taken to purify a mosque after it has been defiled?","id":"muslim-2-414"},{"hadith-eng":"While we were in the mosque with Allah's Messenger (ﷺ), a desert Arab came and stood up and began to urinate in the mosque. The Companions of Allah's Messenger (ﷺ) said: Stop, stop, but the Messenger of Allah (ﷺ) said: Don't interrupt him; leave him alone. They left him alone, and when he finished urinating, Allah's Messenger (ﷺ) called him and said to him: These mosques are not the places meant for urine and filth, but are only for the remembrance of Allah, prayer and the recitation of the Qur'an, or Allah's Messenger said something like that. He (the narrator) said that he (the Holy Prophet) then gave orders to one of the people who brought a bucket of water and poured It over.","reference":"Sahih Muslim 285, Book 2, Hadith 127","question #":"question #3","question":"How should one address inappropriate behavior in a respectful and educational manner according to Islamic teachings?","id":"muslim-2-415"},{"hadith-eng":"Babies were brought to the Messenger of Allah (ﷺ) and he blessed them, and after having chewed (something, e. g. dates or any other sweet thing) he rubbed there with their soft palates. A baby was brought to him and he passed water over him (over his garment), so he asked water to be brought and sprinkled it, but he did not wash it.","reference":"Sahih Muslim 286a, Book 2, Hadith 128","question #":"question #3","question":"What does the Prophet's reaction to a baby's urine indicate about cleanliness and purification in Islam?","id":"muslim-2-416"},{"hadith-eng":"A suckling babe was brought to the Messenger of Allah (way peace be upon him) and he urinated in his tap. He (the Holy Prophet) sent for water and poured it over.","reference":"Sahih Muslim 286b, Book 2, Hadith 129","question #":"question #3","question":"What does this incident teach about the treatment of minor impurities in Islam?","id":"muslim-2-417"},{"hadith-eng":"Hisham narrated the hadith like one transmitted by Ibn Numair (the above mentioned one) with the same chain of transmitters.","reference":"Sahih Muslim 286c, Book 2, Hadith 130","question #":"question #3","question":"Why is it important to compare different narrations of the same hadith?","id":"muslim-2-418"},{"hadith-eng":"Umm Qais daughter of Mihsan reported that she came to the Messenger of Allah (ﷺ) with her child. who was not yet weaned, and she placed him in his lap; and he urinated in his (Holy Prophet's) lap. He (the Holy Prophet) did nothing more than spraying water over it.","reference":"Sahih Muslim 287a, Book 2, Hadith 131","question #":"question #3","question":"What does this incident teach about the Prophet's (ﷺ) approach to cleanliness and ease in daily life?","id":"muslim-2-419"},{"hadith-eng":"\" He (the Holy Prophet) sent for water and sprinkled it over.\"","reference":"Sahih Muslim 287b, Book 2, Hadith 132","question #":"question #3","question":"What is the significance of using water for purification in Islam?","id":"muslim-2-420"},{"hadith-eng":"Umm Qais, daughter of Mihsan, was among the earliest female emigrants who took the oath of allegiance to the Messenger of Allah (ﷺ), and she was the sister of 'Ukkasha b. Mihsan, one amongst the sons of Asad b. Khuzaima. He (the narrator) said: She (Umm Qais) told me that she came to the Messenger of Allah (may peace he upon him) with her son and he had not attained the age of eating food. He (the narrator, 'Ubaidullah), said: She told me that her son passed urine in the lap of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) sent for water and sprayed it over his garment (over that part which was contaminated with the urine of the child) and he did not wash it thoroughly.","reference":"Sahih Muslim 287c, Book 2, Hadith 133","question #":"question #3","question":"What does the hadith imply about the treatment of minor impurities in Islamic jurisprudence?","id":"muslim-2-421"},{"hadith-eng":"A person stayed in the house of A'isha and in the morning began to wash his garment. A'isha said: In case you saw it (i. e. drop of semen), it would have served the purpose (of purifying the garment) if you had simply washed that spot; and in case you did not see it, it would have been enough to sprinkle water around it, for when I saw that on the garment of the Messenger of Allah (ﷺ). I simply scraped it off and he offered prayer, while putting that on.","reference":"Sahih Muslim 288a, Book 2, Hadith 134","question #":"question #3","question":"What actions did the Prophet Muhammad (ﷺ) take regarding impurities on his garment before prayer?","id":"muslim-2-422"},{"hadith-eng":"I used to scrape off the (drop of) semen from the garment of the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 288b, Book 2, Hadith 135","question #":"question #3","question":"What are the implications of this narration on the concept of purity in Islam?","id":"muslim-2-423"},{"hadith-eng":"Qutaiba b. Sa'id, Ishaq b. Ibrahim, Ibn Abi 'Aruba, Abu Ma'shar, Abu Bakr b. Abu Shaiba, Mansur and Mughira have all transmitted from Ibrahim, who transmitted it on the authority of A'isha's narration pertaining to the scraping off of the (drop) of semen from the garment of the Messenger of Allah (ﷺ) like the hadith of Khalid on the authority of Abu Ma'shar.","reference":"Sahih Muslim 288c, Book 2, Hadith 136","question #":"question #3","question":"What are the teachings of Islam regarding the handling of impurities on clothing?","id":"muslim-2-424"},{"hadith-eng":"Hammam narrated the hadith from A'isha like the (above-mentioned) traditions.","reference":"Sahih Muslim 288d, Book 2, Hadith 137","question #":"question #3","question":"What role does Sahih Muslim play in the collection and preservation of hadiths?","id":"muslim-2-425"},{"hadith-eng":"I asked Sulaiman b. Yasar whether the semen that gets on to the garment of a person should be washed or not. He replied: A'isha told me: The Messenger of Allah (ﷺ) washed the semen, and then went out for prayer in that very garment and I saw the mark of washing on it.","reference":"Sahih Muslim 289a, Book 2, Hadith 138","question #":"question #3","question":"What can be inferred about the importance of visible cleanliness from the actions of the Prophet (ﷺ)?","id":"muslim-2-426"},{"hadith-eng":"\" She (A'isha) reported: I used to wash it from the garment of the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 289b, Book 2, Hadith 139","question #":"question #3","question":"What are the Islamic guidelines for maintaining purity in clothing?","id":"muslim-2-427"},{"hadith-eng":"I stayed in the house of 'A'isha and had a wet dream (and perceived its effect on my garment), so (in the morning) I dipped both (the clothes) in water. This (act of mine) was watched by a maid-servant of A'isha and she informed her. She (Hadrat A'isha) sent me a message: Whatprompted you to act like this with your clothes? He (the narrator) said: I told that I saw in a dream what a sleeper sees. She said: Did you find (any mark of the fluid) on your clothes? I said: No. She said: Had you found anything you should have washed it. Incase I found that (semen) on the garment of the Messenger of Allah (ﷺ) dried up, I scraped it off with my nails.","reference":"Sahih Muslim 290, Book 2, Hadith 140","question #":"question #3","question":"What guidance does this narration provide regarding the purification of clothes in Islam?","id":"muslim-2-428"},{"hadith-eng":"A woman came to the Messenger of Allah (ﷺ) and said: What should one do if the blood of menses smears the garment of one amongst us? He (the Holy Prophet) replied: She should scrape it, then rub it with water, then pour water over it and then offer prayer in it.","reference":"Sahih Muslim 291a, Book 2, Hadith 141","question #":"question #3","question":"What is the significance of cleanliness and purification in preparation for prayer in Islam?","id":"muslim-2-429"},{"hadith-eng":"This tradition is narrated by Abu Kuraib, Ibn Numair, Abu Tahir, Ibn Wahb, Yahya b. 'Abdullah b. Salim, Malik b. Anas, 'Amr b. Harith on the authority of Hisham b. 'Urwa, with the same chain of transmitters like one transmitted by Yahya b. Sa'id like the above-mentioned.","reference":"Sahih Muslim 291b, Book 2, Hadith 142","question #":"question #3","question":"What role do narrators play in preserving the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-2-430"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by two graves and said: They (their occupants) are being tormented, but they are not tormented for a grievous sin. One of them carried tales and the other did not keep himself safe from being defiled by urine. He then called for a fresh twig and split it into two parts, and planted them on each grave and then said: Perhaps, their punishment way be mitigated as long as these twigs remain fresh.","reference":"Sahih Muslim 292a, Book 2, Hadith 143","question #":"question #3","question":"What significance do fresh twigs have in relation to the mitigation of punishment in the grave?","id":"muslim-2-431"},{"hadith-eng":"\" The other did not keep himself safe from being defiled by urine.\"","reference":"Sahih Muslim 292b, Book 2, Hadith 144","question #":"question #3","question":"What is the significance of cleanliness in Islamic rituals and daily life?","id":"muslim-2-432"}]