[{"hadith-eng":"When anyone amongst us (amongst the wives of the Holy Prophet) menstruated, the Messenger of Allah (ﷺ) asked her to tie a waist-wrapper over her (body) and then embraced her.","reference":"Sahih Muslim 293a, Book 3, Hadith 1","question #":"question #1","question":"What guidance does Islam provide regarding physical intimacy during menstruation?","id":"muslim-3-1"},{"hadith-eng":"When anyone amongst us was menstruating the Messenger of Allah (ﷺ) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah (ﷺ) had over his desires.","reference":"Sahih Muslim 293b, Book 3, Hadith 2","question #":"question #1","question":"What guidance does Islam provide regarding physical intimacy during menstruation?","id":"muslim-3-2"},{"hadith-eng":"The Messenger of Allah (ﷺ) contacted and embraced his wives over the waist-wrapper when they were menstruating.","reference":"Sahih Muslim 294, Book 3, Hadith 3","question #":"question #1","question":"What does this narration indicate about the permissibility of physical affection between spouses during menstruation?","id":"muslim-3-3"},{"hadith-eng":"I heard it from Maimuna, the wife of the Messenger of Allah (way peace be upon him): The Messenger of Allah (ﷺ) used to lie with me when I menstruated, and there was a cloth between me and him.","reference":"Sahih Muslim 295, Book 3, Hadith 4","question #":"question #1","question":"What does Islamic teaching say about the interaction between spouses during menstruation?","id":"muslim-3-4"},{"hadith-eng":"While I was lying with the Messenger of Allah (ﷺ) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (ﷺ) said: Have you menstruated? I said: Yes. He called me and I lay down","reference":"Sahih Muslim 296, Book 3, Hadith 5","question #":"question #1","question":"What is the significance of maintaining physical closeness between spouses during menstruation in Islam?","id":"muslim-3-5"},{"hadith-eng":"When the Messenger of Allah (ﷺ) was in I'tikaf, he inclined his head towards me and I combedhis hair, and he did not enter the house but for the natural calls (for relieving himself).","reference":"Sahih Muslim 297a, Book 3, Hadith 6","question #":"question #1","question":"What activities are permissible for a person observing I'tikaf in the mosque?","id":"muslim-3-6"},{"hadith-eng":"'A'isha, wife of the Messenger of Allah (ﷺ) observed: When I was (in I'tikaf), I entered the house for the call of nature, and while passing I inquired after the health of the sick (in the. family), and when the Messenger of Allah (ﷺ) was (in I'tikaf), he put out his head towards me, while he himself was in the mosque, and I combed his hair; and he did not enter the house except for the call of nature so long as he was In I'tikaf; and Ibn Rumh stated: As long as they (the Prophet and his wives) were among the observers of I'tikaf.","reference":"Sahih Muslim 297b, Book 3, Hadith 7","question #":"question #1","question":"What activities are permissible for someone observing I'tikaf according to the practices of the Prophet Muhammad (ﷺ)?","id":"muslim-3-7"},{"hadith-eng":"The Messenger of Allah (ﷺ) put out from the mosque his head for me as he was in I'tikaf, and I washed it in the state that I was menstruating.","reference":"Sahih Muslim 297c, Book 3, Hadith 8","question #":"question #1","question":"What is the significance of maintaining personal hygiene during I'tikaf?","id":"muslim-3-8"},{"hadith-eng":"The Messenger of Allah (ﷺ) inclined his head towards me (from the mosque) while I was in my apartment and I combed it in a state of menstruation.","reference":"Sahih Muslim 297d, Book 3, Hadith 9","question #":"question #1","question":"What does this narration indicate about the permissibility of certain interactions during menstruation?","id":"muslim-3-9"},{"hadith-eng":"I used to wash the head of the Messenger of Allah (ﷺ), while I was in a state of menstruation.","reference":"Sahih Muslim 297e, Book 3, Hadith 10","question #":"question #1","question":"What activities are permissible for a woman during her menstruation according to Islamic teachings?","id":"muslim-3-10"},{"hadith-eng":"The Messenger of Allah (ﷺ) said to me: Get me the mat from the mosque. I said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand.","reference":"Sahih Muslim 298a, Book 3, Hadith 11","question #":"question #1","question":"What does this narration imply about the physical state of menstruation in relation to handling objects?","id":"muslim-3-11"},{"hadith-eng":"The Messenger of Allah (ﷺ) ordered me that I should get him the mat from the mosque. I said: I am menstruating. He (the Holy Prophet) said: Do get me that, for menstruation is not in your hand.","reference":"Sahih Muslim 298b, Book 3, Hadith 12","question #":"question #1","question":"What is the Islamic perspective on menstruating women handling objects in a mosque?","id":"muslim-3-12"},{"hadith-eng":"While the Messenger of Allah (ﷺ) was in the mosque, he said: O 'A'isha, get me that garment. She said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand, and she, therefore, got him that.","reference":"Sahih Muslim 299, Book 3, Hadith 13","question #":"question #1","question":"What does this narration teach about the permissibility of handling objects during menstruation?","id":"muslim-3-13"},{"hadith-eng":"I would drink when I was menstruating, then I would hand it (the vessel) to the Apostle (ﷺ) and he would put his mouth where mine had been, and drink, and I would eat flesh from a bone when I was menstruating, then hand it over to the Apostle (ﷺ) and he would put his mouth where mine had been. Zuhair made no mention of (the Holy Prophet's) drinking.","reference":"Sahih Muslim 300, Book 3, Hadith 14","question #":"question #1","question":"What does this narration indicate about the Prophet's attitude towards cultural or social taboos related to menstruation?","id":"muslim-3-14"},{"hadith-eng":"The Messenger of Allah (ﷺ) would recline in my lap when I was menstruating, and recite the Qur'an.","reference":"Sahih Muslim 301, Book 3, Hadith 15","question #":"question #1","question":"What does this narration indicate about the permissibility of reciting the Qur'an in the presence of a menstruating woman?","id":"muslim-3-15"},{"hadith-eng":"Among the Jews, when a woman menstruated, they did not dine with her, nor did they live with them in their houses; so the Companions of the Apostle (ﷺ) asked The Apostle (ﷺ), and Allah, the Exalted revealed:\" And they ask you about menstruation; say it is a pollution, so keep away from woman during menstruation\" to the end (Qur'an, ii. 222). The Messenger of Allah (ﷺ) said: Do everything except intercourse. The Jews heard of that and said: This man does not want to leave anything we do without opposing us in it. Usaid b. Hudair and Abbad b. Bishr came and said: Messenger of Allah, the Jews say such and such thing. We should not have, therefore, any contactwith them (as the Jews do). The face of the Messenger of Allah (way peace be upon him) underwent such a change that we thought he was angry with them, but when they went out, they happened to receive a gift of milk which was sent to the Messenger of Allah (ﷺ). He (the Holy Prophet) called for them and gave them drink, whereby they knew that he was not angry with them.","reference":"Sahih Muslim 302, Book 3, Hadith 16","question #":"question #1","question":"What guidance does Islam provide regarding interactions with menstruating women?","id":"muslim-3-16"},{"hadith-eng":"I was one whose prostatic fluid flowed readily and I was ashamed to ask the Apostle (ﷺ) about it, because of the position of his daughter. I, therefore, asked Miqdad. b. al-Asad and he inquired of him (the Holy Prophet). He (the Holy Prophet) said: He should wash his male organ and perform ablution.","reference":"Sahih Muslim 303a, Book 3, Hadith 17","question #":"question #1","question":"What is the recommended action for someone experiencing prostatic fluid according to Islamic teachings?","id":"muslim-3-17"},{"hadith-eng":"I felt shy of asking about prostatic fluid from the Apostle (ﷺ) because of Fatimah. I, therefore, asked al-Miqdad (to ask on my behalf) and he asked. He (the Holy Prophet) said: Ablution is obligatory in such a case.","reference":"Sahih Muslim 303b, Book 3, Hadith 18","question #":"question #1","question":"What is the ruling on ablution in the case of prostatic fluid according to Islamic teachings?","id":"muslim-3-18"},{"hadith-eng":"We sent al-Miqdad b. al-Aswad to the Messenger of Allah (ﷺ) to ask him what must be done about prostatic fluid which flows from (the private part of) a person. The Messenger of Allah (ﷺ) said: Perform ablution and wash your sexual organ.","reference":"Sahih Muslim 303c, Book 3, Hadith 19","question #":"question #1","question":"What is the prescribed action in Islam for dealing with prostatic fluid?","id":"muslim-3-19"},{"hadith-eng":"The Apostle (ﷺ) woke up at night; relieved himself, and then washed his face and hands and then again slept.","reference":"Sahih Muslim 304, Book 3, Hadith 20","question #":"question #1","question":"What actions did the Prophet (ﷺ) perform upon waking up at night?","id":"muslim-3-20"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) intended to sleep after having sexual intercourse, he performed ablution as for the prayer before going to sleep.","reference":"Sahih Muslim 305a, Book 3, Hadith 21","question #":"question #1","question":"What is the significance of performing ablution before sleeping in Islamic teachings?","id":"muslim-3-21"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) had sexual intercourse and intended to eat or sleep, he performed the ablution of prayer.","reference":"Sahih Muslim 305b, Book 3, Hadith 22","question #":"question #1","question":"What is the significance of performing ablution after engaging in intimate relations before eating or sleeping?","id":"muslim-3-22"},{"hadith-eng":"AI-Hakam narrated to us who heard from Ibrahim narrating that.","reference":"Sahih Muslim 305c, Book 3, Hadith 23","question #":"question #1","question":"Who are the key figures involved in the transmission of this hadith?","id":"muslim-3-23"},{"hadith-eng":"Umar said: Is one amongst us permitted to sleep in a state of impurity (i. e. after having sexual intercourse)? He (the Holy Prophet) said: Yes, after performing ablution.","reference":"Sahih Muslim 306a, Book 3, Hadith 24","question #":"question #1","question":"Is it permissible to sleep in a state of impurity after having sexual intercourse?","id":"muslim-3-24"},{"hadith-eng":"'Umar asked the verdict of the Shari'ah from the Apostle (ﷺ) thus: Is it permissible for any one of us to sleep in a state of impurity? He (the Prophet said: Yes, he must perform ablution and then sleep and take a bath when he desires.","reference":"Sahih Muslim 306b, Book 3, Hadith 25","question #":"question #1","question":"What is the ruling on sleeping in a state of impurity in Islam?","id":"muslim-3-25"},{"hadith-eng":"Umar b. al-Khattab said to the Messenger of Allah (ﷺ), that he became Junbi during the night. The Messenger of Allah (ﷺ) said to him: Perform ablution, wash your sexual organ and then go to sleep.","reference":"Sahih Muslim 306c, Book 3, Hadith 26","question #":"question #1","question":"What steps should be taken if one becomes in a state of major ritual impurity during the night?","id":"muslim-3-26"},{"hadith-eng":"I asked 'A'isha about the Witr (prayer) of the Messenger of Allah (ﷺ) and made mention of a hadith, then I said: What did he do after having sexual intercourse? Did he take a bath before going to sleep or did he sleep before taking a bath? She said: He did all these. Some- times he took a bath and then slept, and sometimes he performed ablution only and went to sleep. I (the narrator) said: Praise be to Allah Who has made things easy (for human beings).","reference":"Sahih Muslim 307a, Book 3, Hadith 27","question #":"question #1","question":"What are the different practices of the Prophet Muhammad (ﷺ) regarding purification after marital relations before sleeping?","id":"muslim-3-27"},{"hadith-eng":"This hadith has been transmitted with the same chain of transmitters from Mu'awyia b. Salih by Zuhair b. Harb, 'Abd al-Rahman b. Mahdi, Harun b. Sa'id al-'Aili and Ibn Wahb.","reference":"Sahih Muslim 307b, Book 3, Hadith 28","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-3-28"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: When anyone amongst you has sexual intercourse with his wife and then he intends to repeat it, he should perform ablution. In the hadith transmitted by Abu Bakr. (the words are):\" Between the two (acts) there should be an ablution,\" or he (the narrator) said:\" Then he intended that it should be repeated.\"","reference":"Sahih Muslim 308, Book 3, Hadith 29","question #":"question #1","question":"What is the significance of performing ablution between repeated acts of intimacy in Islam?","id":"muslim-3-29"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to have sexual intercourse with his wives with a single bath.","reference":"Sahih Muslim 309, Book 3, Hadith 30","question #":"question #1","question":"What is the ruling on performing a single bath after having intercourse with multiple spouses?","id":"muslim-3-30"},{"hadith-eng":"Umm Sulaim who was the grandmother of Ishaq came to the Messenger of Allah (ﷺ) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: O Umm Sulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressing Umm Sulaim) said: Well, O Umm Sulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream).","reference":"Sahih Muslim 310, Book 3, Hadith 31","question #":"question #1","question":"What is the ruling for a woman who experiences a nocturnal emission in her dream?","id":"muslim-3-31"},{"hadith-eng":"In case a woman sees that, she must take a bath. Umm Sulaim said: I was bashful on account of that and said: Does it happen? Upon this the Messenger of Allah (ﷺ) said: Yes (it does happen), otherwise how can (a child) resemble her? Man's discharge (i. e. sperm) is thick and white and the discharge of woman is thin and yellow; so the resemblance comes from the one whose genes prevail or dominate.","reference":"Sahih Muslim 311, Book 3, Hadith 32","question #":"question #1","question":"What is the ruling for a woman who experiences a sexual dream in terms of ritual purification?","id":"muslim-3-32"},{"hadith-eng":"A woman asked the Messenger of Allah (way peace be upon him) about a woman who sees in her dream what a man sees in his dream (sexual dream). He (the Holy Prophet) said: If she experiences what a man experiences, she should take a bath.","reference":"Sahih Muslim 312, Book 3, Hadith 33","question #":"question #1","question":"What is the ruling for a woman who experiences a sexual dream in terms of ritual purity?","id":"muslim-3-33"},{"hadith-eng":"Umm Sulaim went to the Messenger of Allah (ﷺ) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (ﷺ) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?","reference":"Sahih Muslim 313a, Book 3, Hadith 34","question #":"question #1","question":"What is the ruling on a woman needing to perform ghusl after experiencing a sexual dream?","id":"muslim-3-34"},{"hadith-eng":"\" You humiliated the women.","reference":"Sahih Muslim 313b, Book 3, Hadith 35","question #":"question #1","question":"What is the significance of women's roles and perspectives in Islamic narrations?","id":"muslim-3-35"},{"hadith-eng":"Umm Sulaim, the mother of Bani Abu Talha, came to the Messenger of Allah (ﷺ), and a hadith (like that) narrated by Hisham was narrated but for these words. A'isha said: I expressed disapproval to her, saying: Does a woman see a sexual dream?","reference":"Sahih Muslim 314a, Book 3, Hadith 36","question #":"question #1","question":"What is the Islamic perspective on women experiencing sexual dreams?","id":"muslim-3-36"},{"hadith-eng":"Should a woman wash herself when she sees a sexual dream and sees (the marks) of liquid? He (the Holy Prophet) said: Yes. 'A'isha said to her: May your hand be covered with dust and injured. She narrated: The Messenger of Allah (ﷺ) said: Leave her alone. In what way does the child resemble her but for the fact that when the genes contributed by woman prevail upon those of man, the child resembles the maternal family, and when the genes of man prevail upon those of woman the child resembles the paternal family.","reference":"Sahih Muslim 314b, Book 3, Hadith 37","question #":"question #1","question":"What is the ruling on a woman performing ghusl after experiencing a sexual dream?","id":"muslim-3-37"},{"hadith-eng":"While I was standing beside the Messenger of Allah (ﷺ) one of the rabbis of the Jews came and said: Peace be upon you, O Muhammad. I pushed him backwith a push that he was going to fall. Upon this he said: Why do you push me? I said: Why don't you say: O Messenger of Allah? The Jew said: We call him by the name by which he was named by his family. The Messenger of Allah (ﷺ) said: My name is Muhammad with which I was named by my family. The Jew said: I have come to ask you (something). The Messenger of Allah (ﷺ) said: Should that thing be of any benefit to you, if I tell you that? He (the Jew) said: I will lend my ears to it. The Messenger of Allah (ﷺ) drew a line with the help of the stick that he had with him and then said: Ask (whatever you like). Thereupon the Jew said: Where would the human beings be on the Daywhen the earth would change into another earth and the heavens too (would change into other heavens)? The Messenger of Allah (ﷺ) said: They would be in darkness beside the Bridge. He (the Jew) again said: Who amongst people would be the first to cross (this bridge).? He said: They would be the poor amongst the refugees. The Jew said: What would constitute their breakfast when they would enter Paradise? He (the Holy Prophet) replied: A caul of the fish-liver. He (the Jew) said. What would be their food alter this? He (the Holy Prophet) said: A bullockwhich was fed in the different quarters of Paradise would be slaughtered for them. He (the Jew) said: What would be their drink? He (the Holy Prophet) said: They would be given drink from the fountain which is named\" Salsabil\". He (the Jew) said: I have come to ask you about a thing which no one amongst the people on the earth knows except an apostle or one or two men besides him. He (the Holy Prophet) said: Would it benefit you if I tell you that? He (the Jew) said: I would lend ears to that. He then said: I have come to ask you about the child. He (the Holy Prophet) said: The reproductive substance of man is white and that of woman (i. e. ovum central portion) yellow, and when they have sexual intercourse and the male's substance (chromosomes and genes) prevails upon the female's substance (chromosomes and genes), it is the male child that is created by Allah's Decree, and when the substance of the female prevails upon the substance contributed by the male, a female child is formed by the Decree of Allah. The Jew said: What you have said is true; verily you are an Apostle. He then returned and went away. The Messenger of Allah (ﷺ) said: He asked me about such and such things of which I have had no knowledge till Allah gave me that.","reference":"Sahih Muslim 315a, Book 3, Hadith 38","question #":"question #1","question":"What is the significance of addressing the Prophet Muhammad (ﷺ) with respect and the title 'Messenger of Allah'?","id":"muslim-3-38"},{"hadith-eng":"I was sitting beside the Messenger of Allah\" and some other minor alterations.","reference":"Sahih Muslim 315b, Book 3, Hadith 39","question #":"question #1","question":"What are the implications of minor alterations in the transmission of hadiths?","id":"muslim-3-39"},{"hadith-eng":"When Allah's Messenger (ﷺ) bathed because of sexual intercourse, he first washed his hands: he then poured water with his right hand on his left hand and washed his private parts. He then performed ablution as is done for prayer'. He then took some water and put his fingers and moved them through the roots of his hair. And when he found that these had been properly mois- tened, then poured three handfuls on his head and then poured water over his body and subsequently washed his feet.","reference":"Sahih Muslim 316a, Book 3, Hadith 40","question #":"question #1","question":"What are the steps involved in performing ghusl after sexual intercourse according to Islamic teachings?","id":"muslim-3-40"},{"hadith-eng":"\" washed his feet.\"","reference":"Sahih Muslim 316b, Book 3, Hadith 41","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-3-41"},{"hadith-eng":"Hisham narrated it from his father, who narrated it on the authority of 'A'isha that when the Apostle (ﷺ) took a bath because of sexual inter-course, he first washed the palms of his hands three times, and then the whole hadith was transmitted like that based on the authority of Abu Mu'awyia, but no mention is made of the washing of feet.","reference":"Sahih Muslim 316c, Book 3, Hadith 42","question #":"question #1","question":"What is the significance of washing the hands three times before performing a full ritual bath in Islam?","id":"muslim-3-42"},{"hadith-eng":"'Urwa has narrated it on the authority of 'A'isha that when Allah's Messenger (ﷺ) took a bath because of sexual intercourse, he first washed his hands before dipping one of them into the basin, and then performed ablu- tion as is done for prayer.","reference":"Sahih Muslim 316d, Book 3, Hadith 43","question #":"question #1","question":"What is the proper sequence of actions when performing ghusl after sexual intercourse?","id":"muslim-3-43"},{"hadith-eng":"I placed water near the Messenger of Allah (ﷺ) to take a bath because of sexual intercourse. He washed the palms of his bands twice or thrice and then put his hand In the basin and poured water over his private parts and washed them with his left hand. He then struck his hand against the earth and rubbed it with force and then performed ablution for the prayer and then poured three handfuls of water on his head and then washed his whole body after which he moved aside from that place and washed his feet, and then I brought a towel (so that he may wipe his body). but he returned it.","reference":"Sahih Muslim 317a, Book 3, Hadith 44","question #":"question #1","question":"What are the steps involved in performing ghusl after sexual intercourse according to Islamic teachings?","id":"muslim-3-44"},{"hadith-eng":"\" Pouring of three handfuls of water on the head.\" and in the hadith narrated by Waki' all the features of ablution have been recorded: rinsing (of mouth), snuffing of water (in the nostrils) ; and in the hadith transmitted by Abu Mu'awyia, there is no mention of a towel.","reference":"Sahih Muslim 317b, Book 3, Hadith 45","question #":"question #1","question":"What are the different practices mentioned in the hadith regarding the performance of ablution?","id":"muslim-3-45"},{"hadith-eng":"Ibn Abbas narrated It on the authority of Maimuna that the Messenger of Allah (ﷺ) was given a towel, but he did not rub (his body) with it, but he did like this with water, i. e. he shook it off.","reference":"Sahih Muslim 317c, Book 3, Hadith 46","question #":"question #1","question":"What is the significance of not using a towel after performing ablution or washing in Islamic practice?","id":"muslim-3-46"},{"hadith-eng":"When the Messenger of Allah (ﷺ) took a bath because of sexual intercourse, he called for a vessel and took a handful of water from it and first (washed) the right side of his head, then left, and then took a handful (of water) and poured it on his head.","reference":"Sahih Muslim 318, Book 3, Hadith 47","question #":"question #1","question":"What is the proper method of performing ghusl after sexual intercourse according to Islamic teachings?","id":"muslim-3-47"},{"hadith-eng":"The Messenger of Allah (ﷺ) washed himself with water from a vessel (measuring seven to eight seers) because of sexual intercourse.","reference":"Sahih Muslim 319a, Book 3, Hadith 48","question #":"question #1","question":"What is the significance of using a specific amount of water for purification after sexual intercourse in Islam?","id":"muslim-3-48"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath from the vessel (which contained seven to eight seers, i. e. fifteen to sixteen pounds) of water And I and he (the Holy Prophet) took a bath from the same vessel. And in the hadith narrated by Sufyan the words are:\" from one vessel\". Qutaiba said: Al-Faraq is three Sa' (a cubic measuring of varying magnitude).","reference":"Sahih Muslim 319b, Book 3, Hadith 49","question #":"question #1","question":"What does this narration indicate about the Prophet's practice of using water efficiently during bathing?","id":"muslim-3-49"},{"hadith-eng":"I along with the foster brother of 'A'isha went to her and he asked about the bath of the Apostle (ﷺ) because of sexual intercourse. She called for a vessel equal to a Sa' and she took a bath. and there was a curtain between us and her. She poured water on her head thrice and he (Abu Salama) said: The wives of the Apostle (ﷺ) collectedhair on their heads and these lopped up to ears (and did rot go beyond that).","reference":"Sahih Muslim 320, Book 3, Hadith 50","question #":"question #1","question":"What is the significance of modesty and privacy in the context of personal hygiene in Islam?","id":"muslim-3-50"},{"hadith-eng":"I and the Messenger of Allah (ﷺ) took a bath from the same vessel, after sexual intercourse.","reference":"Sahih Muslim 321a, Book 3, Hadith 51","question #":"question #1","question":"What is the significance of starting with the right hand when performing ablution or taking a bath in Islamic practice?","id":"muslim-3-51"},{"hadith-eng":"Hafsa, daughter of 'Abd al-Rahman b. Abu Bakr, reported that 'A'isha narrated to her that she and the Messenger of Allah (ﷺ) took a bath from the same vessel which contained water equal to three Mudds or thereabout.","reference":"Sahih Muslim 321b, Book 3, Hadith 52","question #":"question #1","question":"What does this narration teach about the permissibility of sharing water for bathing between spouses in Islam?","id":"muslim-3-52"},{"hadith-eng":"I and the Messenger (ﷺ) took a bath from the same vessel and our hands alternated into it in the state that we had had sexual intercourse.","reference":"Sahih Muslim 321c, Book 3, Hadith 53","question #":"question #1","question":"What does this narration teach about the permissibility of sharing water for purification between spouses?","id":"muslim-3-53"},{"hadith-eng":"I and the Messenger of Allah (ﷺ) took a bath from one vessel which was placed between me and him and he would get ahead of me, so that I would say: Spare (some water for) me, spare (some water for) me; and she said that they had had sexual intercourse.","reference":"Sahih Muslim 321d, Book 3, Hadith 54","question #":"question #1","question":"What does this narration teach about the permissibility of sharing water for bathing between spouses?","id":"muslim-3-54"},{"hadith-eng":"Maimuna (the wife of the Holy Prophet) reported to me that she and the Messenger of Allah (ﷺ) took a bath from one vessel.","reference":"Sahih Muslim 322, Book 3, Hadith 55","question #":"question #1","question":"What does the shared act of bathing between spouses signify in terms of marital intimacy and companionship in Islam?","id":"muslim-3-55"},{"hadith-eng":"Ibn Abbas reported that the Messenger of Allah (ﷺ) took a bath with the water left over by Maimuna.","reference":"Sahih Muslim 323, Book 3, Hadith 56","question #":"question #1","question":"What is the significance of using leftover water for bathing in Islamic tradition?","id":"muslim-3-56"},{"hadith-eng":"Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (ﷺ) took a bath from the same vessel.","reference":"Sahih Muslim 324, Book 3, Hadith 57","question #":"question #1","question":"What does this narration indicate about the permissibility of spouses sharing resources in Islam?","id":"muslim-3-57"},{"hadith-eng":"Anas reported that the Messenger of Allah (may peace he upon him) took a bath with five Makkuks of water and performed ablution with one Makkuk. Ibn Muthanna has used the words five Makakiyya, and Ibn Mu'adh narrated it from 'Abdullah b. 'Abdullah and he made no mention of Ibn Jabr.","reference":"Sahih Muslim 325a, Book 3, Hadith 58","question #":"question #1","question":"How much water did the Prophet Muhammad (peace be upon him) use for bathing and ablution?","id":"muslim-3-58"},{"hadith-eng":"The Apostle of Allah (ﷺ) performed ablution with one Mudd and took bath with a Sa' up to five Mudds.","reference":"Sahih Muslim 325b, Book 3, Hadith 59","question #":"question #1","question":"What is the significance of using a specific amount of water for ablution and bathing in Islamic practice?","id":"muslim-3-59"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath with one Sa` of water because of sexual intercourse and performed ablution with one Mudd.","reference":"Sahih Muslim 326a, Book 3, Hadith 60","question #":"question #1","question":"What is the significance of using a specific amount of water for bathing and ablution in Islamic practice?","id":"muslim-3-60"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath with one Sa' of water and performed ablution with one Mudd (of water) ; and in the hadith narrated by Ibn Hujr the words are: One Mudd sufficed for his (Holy Prophet's) ablution. And Ibn Hujr said that (his Shaikh) Isma'il was much advanced in age, and it was because of this that he could not fully rely on him for this tradition.","reference":"Sahih Muslim 326b, Book 3, Hadith 61","question #":"question #1","question":"What does this narration suggest about the Prophet's use of water for bathing and ablution?","id":"muslim-3-61"},{"hadith-eng":"The people contended amongst themselves in the presence of the Messenger of Allah (ﷺ) with regard to bathing. Some of them said: We wash our heads like this and this. Upon this the Messenger (ﷺ) said: As for me I pour three handfuls of water upon my head.","reference":"Sahih Muslim 327a, Book 3, Hadith 62","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) demonstrate the method of washing the head during bathing?","id":"muslim-3-62"},{"hadith-eng":"I pour water over my head thrice.","reference":"Sahih Muslim 327b, Book 3, Hadith 63","question #":"question #1","question":"What is the recommended method for performing ghusl after sexual intercourse in Islam?","id":"muslim-3-63"},{"hadith-eng":"A delegation of the Thaqif said to the Messenger of Allah (ﷺ): Our land is cold; what about our bathing then? He (the Holy Prophet) said: I pour water thrice over my head.Ibn Salim in his narration reported:\" The delegation of the Thaqif said: Messenger of Allah.\"","reference":"Sahih Muslim 328, Book 3, Hadith 64","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) respond to concerns about bathing in cold climates?","id":"muslim-3-64"},{"hadith-eng":"When the Messenger of Allah (ﷺ) took a bath because of sexual intercourse, he poured three handfuls of water upon his head. Hasan b. Muhammad said to him (the narrator): My hair is thick. Upon this Jabir observed. I said to him: O son of my brother, the hair of the Messenger of Allah (ﷺ) was thicker than your hair and these were more fine (than yours).","reference":"Sahih Muslim 329, Book 3, Hadith 65","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) perform ghusl after sexual intercourse?","id":"muslim-3-65"},{"hadith-eng":"I said: Messenger of Allah, I am a woman who has closely plaited hair on my head; should I undo it for taking a bath, because of sexual intercourse? He (the Holy Prophet) said: No, it is enough for you to throw three handfuls of water on your head and then pour water over yourself, and you shall be purified.","reference":"Sahih Muslim 330a, Book 3, Hadith 66","question #":"question #1","question":"What is the guidance for women with plaited hair regarding the ritual bath after sexual intercourse?","id":"muslim-3-66"},{"hadith-eng":"This hadith has been narrated by Amr al-Naqid, Yazid b. Harun, 'Abd b. Humaid, Abd al-Razzaq, Thauri, Ayyub b. Musa, with the same chain of transmitters. In hadith narrated by Abd al-Razzaq there is a mention of the menstruation and of the sexual intercourse. The rest of the hadith has been transmitted like that of Ibn 'Uyaina.","reference":"Sahih Muslim 330b, Book 3, Hadith 67","question #":"question #1","question":"What is the significance of having multiple chains of transmitters in the authentication of hadiths?","id":"muslim-3-67"},{"hadith-eng":"\" Should I undo the plait and wash it, because of sexual intercourse?\" and there is no mention of menstruation.","reference":"Sahih Muslim 330c, Book 3, Hadith 68","question #":"question #1","question":"What considerations should be taken into account regarding personal hygiene after sexual intercourse in Islamic teachings?","id":"muslim-3-68"},{"hadith-eng":"It was conveyed to 'A'isha that 'Abdullah b. 'Amr ordered the women to undo the (plaits) of hair on their heads. She said: How strange it is for Ibn 'Amr that he orders the women to undo the plaits of their head while taking a bath; why does he not order them to shave their beads? I and the Messenger of Allah (ﷺ) took bath from one vessel. I did no more than this that I poured three handfuls of water over my head.","reference":"Sahih Muslim 331, Book 3, Hadith 69","question #":"question #1","question":"What is the significance of simplicity in the ritual of bathing in Islam?","id":"muslim-3-69"},{"hadith-eng":"A woman asked the Messenger of Allah (ﷺ) how to wash herself after menstruation. She mentioned that he taught her how to take bath and then told her to take a piece of cotton with musk and purify herself. She said: How should I purify myself with that? He (the Holy Prophet) said: Praise be to Allah, purify yourself with it, and covered his face, Sufyan b. 'Uyaina gave a demonstration by covering his face (as the Prophet had done). 'A'isha reported: I dragged her to my side for I had understood what the Messenger of Allah (ﷺ) intended and, therefore, said: Apply this cotton with musk to the trace of blood. Ibn 'Umar in his hadith (has mentioned the words of 'A'isha thus): Apply it to the marks of blood.","reference":"Sahih Muslim 332a, Book 3, Hadith 70","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding purification after menstruation?","id":"muslim-3-70"},{"hadith-eng":"A woman asked the Messenger of Allah (ﷺ) how he should wash herself after the menstrual period. He (the Holy Prophet) said: Take a cotton with musk and purity yourself, and the rest of the hadith was narrated like that of Sufyan.","reference":"Sahih Muslim 332b, Book 3, Hadith 71","question #":"question #1","question":"What guidance is provided for women regarding purification after menstruation?","id":"muslim-3-71"},{"hadith-eng":"Asma (daughter of Shakal) asked the Messenger of Allah (ﷺ) about washing after menstruation. He said: Everyone amongst you should use water (mixed with the leaves of) the lote-tree and cleanse herself well, and then pour water on her head and rub it vigorously till it reaches the roots of the hair. Then she should pour water on it. Afterwards she should take a piece of cotton smeared with musk and cleanse herself with it. Asma' said: How should she cleanse herself with the help of that? Upon this he (the Messenger of Allah) observed: Praise be to Allah, she should cleanse herself. 'A'isha said in a subdued tone that she should apply it to the trace of blood. She (Asma) then further asked about bathing after sexual intercourse. He (the Holy Prophet) said: She should take water and cleanse herself well or complete the ablution and then (pour water) on her head and rub it till it reaches the roots of the hair (of her) head and then pour water on her. 'A'isha said: How good are the women of Ansar (helpers) that their shyness does not prevent them from learning religion.","reference":"Sahih Muslim 332c, Book 3, Hadith 72","question #":"question #1","question":"What are the steps involved in the purification process after menstruation according to Islamic teachings?","id":"muslim-3-72"},{"hadith-eng":"Cleanse yourself with it, and he covered (his face on account of shyness).","reference":"Sahih Muslim 332d, Book 3, Hadith 73","question #":"question #1","question":"What is the significance of modesty and shyness in Islamic teachings?","id":"muslim-3-73"},{"hadith-eng":"Asma' b. Shakal came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, how one amongst us should take a bath after the menstruation, and the rest of the hadith is the same and there is no mention of bathing because of sexual intercourse.","reference":"Sahih Muslim 332e, Book 3, Hadith 74","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the ritual bath after menstruation?","id":"muslim-3-74"},{"hadith-eng":"Fatimah b. Abu Hubaish came to the Apostle (ﷺ) and said: I am a woman whose blood keeps flowing (even after the menstruation period). I am never purified; should I, therefore, abandon prayer? He (the Holy Prophet) said: Not at all, for that is only a vein, and is not a menstruation, so when menstruation comes, abandon prayer, and when it ends wash the blood from yourself and then pray.","reference":"Sahih Muslim 333a, Book 3, Hadith 75","question #":"question #1","question":"What guidance is provided for women experiencing non-menstrual bleeding regarding their prayer obligations?","id":"muslim-3-75"},{"hadith-eng":"\" There came Fatimah b. Abu Hubaish, b. 'Abd al-Muttalib b. Asad, and she was a woman amongst us,\" and in the hadith of Hammid b. Zaid there is an addition of these words:\" We abandoned mentioning him.\"","reference":"Sahih Muslim 333b, Book 3, Hadith 76","question #":"question #1","question":"Who was Fatimah b. Abu Hubaish and what is her significance in Islamic history?","id":"muslim-3-76"},{"hadith-eng":"Umm Habiba b. Jahsh thus asked for a verdict from the Messenger of Allah (ﷺ): I am a woman whose blood keeps flowing (after the menstrual period). He (the Holy Prophet) said: That is only a vein, so take a bath and offer prayer; and she took a bath at the time of every prayer. Laith b. Sa'd said: Ibn Shihab made no mention that the Messenger of Allah (ﷺ) had ordered her to take a bath at the time of every prayer, but she did it of her own accord. And in the tradition transmitted by Ibn Rumh there is no mention of Umm Habiba (and there is mention of the daughter of Jahsh only.)","reference":"Sahih Muslim 334a, Book 3, Hadith 77","question #":"question #1","question":"What guidance does Islam provide for women experiencing prolonged bleeding outside of their menstrual period?","id":"muslim-3-77"},{"hadith-eng":"Umm Habiba b. Jahsh who was the sister-in-law of the Messenger of Allah (ﷺ) and the wife of 'Abd al-Rahman b. Auf, remained mustahada for seven years, and she, therefore, asked for the verdict of Shari'ah from the Messenger of Allah (ﷺ) about it The Messenger of Allah (ﷺ) said: This is not menstruation, but (blood from) a vein: so bathe yourself and offer prayer. 'A'isha said: She took a bath in the wash-tub placed in the apartment of her sister Zainab b. Jahsh, till the redness of the blood came over the water. Ibn Shihab said: I narrated it to Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham about it who observed: May Allah have mercy on Hinda! would that she listened to this verdict. By Lord, she wept for not offering prayer.","reference":"Sahih Muslim 334b, Book 3, Hadith 78","question #":"question #1","question":"What is the significance of distinguishing between menstruation and other types of bleeding in Islamic jurisprudence?","id":"muslim-3-78"},{"hadith-eng":"Umm Habiba b. Jahsh came to the Messenger of Allah (ﷺ) and she had been a mustahada for seven years, and the rest of the hadith was narrated like that of 'Amr b. al-Harith up to the words:\" There came the redness of the blood over water.\" and nothing was narrated beyond it.","reference":"Sahih Muslim 334c, Book 3, Hadith 79","question #":"question #1","question":"What is the significance of distinguishing between different types of bleeding for women in Islamic jurisprudence?","id":"muslim-3-79"},{"hadith-eng":"I The daughter of jahsh had been mustabida for seven years,\" and the rest of the hadith is the same (as mentioned above).","reference":"Sahih Muslim 334d, Book 3, Hadith 80","question #":"question #1","question":"What is the significance of the duration mentioned in the context of the daughter's condition?","id":"muslim-3-80"},{"hadith-eng":"Umm Habiba asked the Messenger of Allah (ﷺ) about the blood (which flows beyond the period of menstruation). 'A'isha said: I saw her wash-tub full of blood. The Messenger of Allah (ﷺ) said: Remain away (from prayer) equal (to the length of time) that your menses prevented you. After this (after the period of usual courses) bathe yourself and offer prayer.","reference":"Sahih Muslim 334e, Book 3, Hadith 81","question #":"question #1","question":"What guidance is provided for women regarding prayer during and after menstruation?","id":"muslim-3-81"},{"hadith-eng":"Umm Habiba b. Jahsh who was the spouse of Abd al- Rahman b. Auf made a complaint to the Messenger of Allah (ﷺ) about blood (which flows beyond the menstrual period). He said to her: Remain away (from prayer) equal (to the length of time) that your menstruation holds you back. After this, bathe yourself. And she washed herself before every prayer.","reference":"Sahih Muslim 334f, Book 3, Hadith 82","question #":"question #1","question":"What guidance is provided for women experiencing bleeding beyond their menstrual period regarding prayer?","id":"muslim-3-82"},{"hadith-eng":"A woman asked 'A'isha: Should one amongst us complete prayers abandoned during the period of menses? 'A'isha said: Are you a Haruriya? When any one of us during the time of the Messenger of Allah (ﷺ) was in her menses (and abandoned prayer) she was not required to complete them.","reference":"Sahih Muslim 335a, Book 3, Hadith 83","question #":"question #1","question":"What is the ruling on making up missed prayers due to menstruation in Islam?","id":"muslim-3-83"},{"hadith-eng":"Should a menstruating woman complete the prayer (abandoned during the menstrual period)? 'A'isha said: Are you a Hurariya? The wives of the Messenger of Allah (ﷺ) have had their monthly courses, (but) did he order them to make compensation (for the abandoned prayers)? Muhammad b. Ja'far said: (Compensation) denotes their completion.","reference":"Sahih Muslim 335b, Book 3, Hadith 84","question #":"question #1","question":"What is the ruling on making up missed prayers for menstruating women in Islam?","id":"muslim-3-84"},{"hadith-eng":"I asked 'A'isha: What is the reason that a menstruating woman completes the fasts (that she abandons during her monthly course). but she does not complete the prayers? She (Hadrat 'A'isha) said: Are you a Haruriya? I said: I am not a Haruriya, but I simply want to inquire. She said: We passed through this (period of menstruation), and we were ordered to complete the fasts, but were not ordered to complete the prayers.","reference":"Sahih Muslim 335c, Book 3, Hadith 85","question #":"question #1","question":"Why are menstruating women required to make up missed fasts but not missed prayers?","id":"muslim-3-85"},{"hadith-eng":"I went to the Messenger of Allah (ﷺ) on the day of the conquest (of Mecca) and found him take a bath. while his daughter Fatimah was holding a curtain around him.","reference":"Sahih Muslim 336a, Book 3, Hadith 86","question #":"question #1","question":"What can be inferred about the privacy and modesty practices of the Prophet Muhammad (ﷺ) during personal activities?","id":"muslim-3-86"},{"hadith-eng":"It was the day of the conquest (of Mecca) that she went to the Messenger of Allah (ﷺ) and he was staying at a higher part (of that city). The Messenger of Allah (ﷺ) got up for his bath. Fatimah held a curtain around him (in order to provide him privacy). He then put on his garments and wrapped himself with that and then offered eight rak'ahs of the forenoon prayer.","reference":"Sahih Muslim 336b, Book 3, Hadith 87","question #":"question #1","question":"What significance does the forenoon prayer hold in Islamic tradition?","id":"muslim-3-87"},{"hadith-eng":"His (the Holy Prophet's) daughter Fatimah provided him privacy with the help of his cloth, and when he had taken a bath he took it up and wrapped it around him and then stood and offered eight rak'ahs of the forenoon prayer.","reference":"Sahih Muslim 336c, Book 3, Hadith 88","question #":"question #1","question":"What is the significance of privacy and modesty in Islamic practices as demonstrated by the Prophet's actions?","id":"muslim-3-88"},{"hadith-eng":"I placed water for the Apostle (ﷺ) and provided privacy for him, and he took a bath.","reference":"Sahih Muslim 337, Book 3, Hadith 89","question #":"question #1","question":"What is the significance of providing privacy during personal acts in Islam?","id":"muslim-3-89"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: A man should not see the private parts of another man, and a woman should not see the private parts of another woman, and a man should not lie with another man under one covering, and a woman should not lie with another woman under one covering.","reference":"Sahih Muslim 338a, Book 3, Hadith 90","question #":"question #1","question":"What are the guidelines in Islam regarding modesty and privacy between individuals of the same gender?","id":"muslim-3-90"},{"hadith-eng":"Private parts of man are the nakedness (which is concealed).","reference":"Sahih Muslim 338b, Book 3, Hadith 91","question #":"question #1","question":"What is considered as 'nakedness' for a man in Islamic teachings?","id":"muslim-3-91"},{"hadith-eng":"By Allah, nothing prohibits Moses to take a bath along with us, but sacrotal hernia. He (Moses) once went for a bath and placed his clothes on a stone and the stone moved on with his clothes. Moses ran after it saying: 0 stone, my clothes,0 stone, my clothes, and Banu Isra'il had the chance to see the private parts of Moses, and said: By Allah, Moses does not suffer from any ailment. The stone then stopped, till Moses had been seen by them, and he then took hold of his clothes and struck the stone. Abu Huraira said: By Allah, there are the marks of six or seven strokes made by Moses on the stone.","reference":"Sahih Muslim 339, Book 3, Hadith 92","question #":"question #1","question":"What does this narration teach about the importance of privacy and modesty in Islamic tradition?","id":"muslim-3-92"},{"hadith-eng":"When the Ka'ba was constructed the Messenger of Allah (ﷺ) and Abbas went and lifted stones. Abbas said to the Messenger of Allah (ﷺ): Place your lower garment on your shoulder (so that you may protect yourself from the roughness and hardness of stones). He (the Holy Prophet) did this, but fell down upon the ground in a state of unconciousness and his eyes were turned towards the sky. He then stood up and said: My lower garment, my lower garment; and this wrapper was tied around him. In the hadith transmitted by Ibn Rafi', there is the word:\" On his neck\" and he did not say:\" Upon his shoulder.\"","reference":"Sahih Muslim 340a, Book 3, Hadith 93","question #":"question #1","question":"What does this incident reveal about the Prophet Muhammad's (ﷺ) reaction to discomfort or potential harm?","id":"muslim-3-93"},{"hadith-eng":"The Messenger of Allah (ﷺ) was carrying along with them (his people) stones for the Ka'ba and there was a waist wrapper around him. His uncle,\" Abbas, said to him: 0 son of my brother! if you take off the lower garment and place it on the shoulders underneath the stones, it would be better. He (the Holy Prophet) took it off and placed it on his shoulder and fell down unconscious. He (the narrator) said: Never was he seen naked after that day.","reference":"Sahih Muslim 340b, Book 3, Hadith 94","question #":"question #1","question":"What does this incident teach about the modesty of the Prophet Muhammad (ﷺ)?","id":"muslim-3-94"},{"hadith-eng":"I was carrying a heavy stone and my lower garment was loose, and it, therefore, slipped off (so soon) that I could not place the stone (on the ground) and carry to its proper place. Upon this the Messenger of Allah (ﷺ) said: Return to your cloth (lower garment), take it (and tie it around your waist) and do not walk naked.","reference":"Sahih Muslim 341, Book 3, Hadith 95","question #":"question #1","question":"What guidance does Islam provide regarding modesty and clothing in public?","id":"muslim-3-95"},{"hadith-eng":"The Messenger of Allah (ﷺ) one day made me mount behind him and he confided to me something secret which I would not disclose to anybody; and the Messenger of Allah (ﷺ) liked the concealment provided by a lofty place or cluster of dates (while answering the call of nature), Ibn Asma' said in his narration: It implied an enclosure of the date-trees.","reference":"Sahih Muslim 342, Book 3, Hadith 96","question #":"question #1","question":"What is the significance of maintaining confidentiality when someone shares a secret with you?","id":"muslim-3-96"},{"hadith-eng":"I went to Quba' with the Messenger of Allah (ﷺ) on Monday till we reached (the habitation) of Banu Salim. The Messenger of Allah (ﷺ) stood at the door of 'Itban and called him loudly. So he came out dragging his lower garnment. Upon this the Messenger of Allah (ﷺ) said: We have made this man to make haste 'Itban said: Messenger of Allah, if a man parts with his wife suddenly without seminal emission, what is he required to do (with regard to bath)? The Messenger of Allah (ﷺ) said: It is with the seminal emission that bath becomes obligatory.","reference":"Sahih Muslim 343a, Book 3, Hadith 97","question #":"question #1","question":"What is the ruling on performing a bath in the absence of seminal emission after marital relations?","id":"muslim-3-97"},{"hadith-eng":"The Apostle of Allah (ﷺ) observed: Bathing is obligatory in case of seminal emission.","reference":"Sahih Muslim 343b, Book 3, Hadith 98","question #":"question #1","question":"When is bathing considered obligatory in Islamic teachings?","id":"muslim-3-98"},{"hadith-eng":"The Messenger of Allah (ﷺ) abrogated some of his commands by others, just as the Qur'an abrogates some part with the other.","reference":"Sahih Muslim 344, Book 3, Hadith 99","question #":"question #1","question":"How does the concept of abrogation apply to the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-3-99"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by (the house) of a man amongst the Ansar, and he sent for him. He came out and water was trickling down from his head. Upon this he (the Holy Prophet) said: Perhaps we put you to haste. He said: Yes. Messenger of Allah. He (the Holy Prophet) said: When you made haste or semen is not emitted, bathing is not obligatory for you, but ablution is binding. Ibn Bashshir has narrated it with a minor alteration.","reference":"Sahih Muslim 345, Book 3, Hadith 100","question #":"question #1","question":"What is the ruling on bathing and ablution when one is in haste or when semen is not emitted?","id":"muslim-3-100"},{"hadith-eng":"I arked the Messenger of Allah (ﷺ) about a man who has sexual intercourse with his wife, but leaves her before orgasm. Upon this he (the Holy Prophet) said: He should wash the secretion of his wife, and then perform ablution and ofier prayer.","reference":"Sahih Muslim 346a, Book 3, Hadith 101","question #":"question #1","question":"What should a man do if he has sexual intercourse with his wife but does not reach orgasm?","id":"muslim-3-101"},{"hadith-eng":"If a person has sexual intercourse with his wife, but does not experience orgasm, he should wash his organ and perform an ablution.","reference":"Sahih Muslim 346b, Book 3, Hadith 102","question #":"question #1","question":"What are the guidelines for purification after engaging in sexual intercourse without orgasm?","id":"muslim-3-102"},{"hadith-eng":"What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 347a, Book 3, Hadith 103","question #":"question #1","question":"What is the ruling on performing ablution after having sexual intercourse without experiencing orgasm?","id":"muslim-3-103"},{"hadith-eng":"Abu Ayyub reported that he had heard like this from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 347b, Book 3, Hadith 104","question #":"question #1","question":"What is the significance of hearing directly from the Prophet (ﷺ) in Islamic tradition?","id":"muslim-3-104"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: When a man has sexual intercourse, bathing becomes obligatory (both for the male and the female). In the hadith of Matar the words are: Even if there is no orgasm. Zuhair has narrated it with a minor alteration of words.","reference":"Sahih Muslim 348a, Book 3, Hadith 105","question #":"question #1","question":"What are the conditions that make bathing obligatory after sexual intercourse in Islam?","id":"muslim-3-105"},{"hadith-eng":"This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words;\" Even if there is no orgasm\" have been omitted.","reference":"Sahih Muslim 348b, Book 3, Hadith 106","question #":"question #1","question":"What are the implications of minor alterations in the transmission of hadiths?","id":"muslim-3-106"},{"hadith-eng":"There cropped up a difference of opinion between a group of Muhajirs (Emigrants and a group of Ansar (Helpers) (and the point of dispute was) that the Ansar said: The bath (because of sexual intercourse) becomes obligatory only-when the semen spurts out or ejaculates. But the Muhajirs said: When a man has sexual intercourse (with the woman), a bath becomes obligatory (no matter whether or not there is seminal emission or ejaculation). Abu Musa said: Well, I satisfy you on this (issue). He (Abu Musa, the narrator) said: I got up (and went) to 'A'isha and sought her permission and it was granted, and I said to her: 0 Mother, or Mother of the Faithful, I want to ask you about a matter on which I feel shy. She said: Don't feel shy of asking me about a thing which you can ask your mother, who gave you birth, for I am too your mother. Upon this I said: What makes a bath obligatory for a person? She replied: You have come across one well informed! The Messenger of Allah (ﷺ) said: When anyone sits amidst four parts (of the woman) and the circumcised parts touch each other a bath becomes obligatory.","reference":"Sahih Muslim 349, Book 3, Hadith 107","question #":"question #1","question":"What are the differing opinions among the Muhajirs and Ansar regarding the obligation of a bath after sexual intercourse?","id":"muslim-3-107"},{"hadith-eng":"I and she (the Mother of the Faithful) do it and then take a bath.","reference":"Sahih Muslim 350, Book 3, Hadith 108","question #":"question #1","question":"What is the ruling on bathing after sexual intercourse according to Islamic teachings?","id":"muslim-3-108"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say this: Ablution is obligatory (for one who takes anything) touched by fire.","reference":"Sahih Muslim 351, Book 3, Hadith 109","question #":"question #1","question":"What is the significance of performing ablution after consuming food touched by fire?","id":"muslim-3-109"},{"hadith-eng":"I am performing ablution because of having eaten pieces of cheese, for I heard the Messenger of Allah (ﷺ) say: Perform ablution (after eating anything) touched by fire.","reference":"Sahih Muslim 352, Book 3, Hadith 110","question #":"question #1","question":"What is the significance of performing ablution after consuming food that has been touched by fire?","id":"muslim-3-110"},{"hadith-eng":"The Messenger of Allah (ﷺ) said. Perform ablution (after eating) anything touched by fire.","reference":"Sahih Muslim 353, Book 3, Hadith 111","question #":"question #1","question":"What is the significance of performing ablution after consuming food that has been touched by fire?","id":"muslim-3-111"},{"hadith-eng":"The Messenger of Allah (ﷺ) took (meat of) goat's shoulder and offered prayer and did not perform ablution.","reference":"Sahih Muslim 354a, Book 3, Hadith 112","question #":"question #1","question":"What is the ruling on performing ablution after eating cooked meat according to Islamic teachings?","id":"muslim-3-112"},{"hadith-eng":"The Messenger of Allah (ﷺ) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.","reference":"Sahih Muslim 354b, Book 3, Hadith 113","question #":"question #1","question":"What is the ruling on performing ablution after eating meat according to Islamic teachings?","id":"muslim-3-113"},{"hadith-eng":"I saw the Messenger of Allah (ﷺ) take slices from goat's shoulder, and then eat them, and then offer prayer without having performed ablution.","reference":"Sahih Muslim 355a, Book 3, Hadith 114","question #":"question #1","question":"What is the significance of performing ablution before prayer in Islam?","id":"muslim-3-114"},{"hadith-eng":"I saw the Messenger of Allah (ﷺ) take slices from goat's shoulder and then eat them. He was called for prayer and he got'up, leaving aside the knife, and offered prayer but did not perform ablution.","reference":"Sahih Muslim 355b, Book 3, Hadith 115","question #":"question #1","question":"What actions did the Prophet (ﷺ) take when he was called for prayer while eating?","id":"muslim-3-115"},{"hadith-eng":"Ibn 'Abbas reported it on the authority of Maimuana, the wife of the Messenger of Allah (ﷺ), that the Messenger of Allah (ﷺ) took (a piece of goat's) shoulder at her place, and then offered prayer but did not perform ablution.","reference":"Sahih Muslim 356a, Book 3, Hadith 116","question #":"question #1","question":"Is it necessary to perform ablution after eating before offering prayer?","id":"muslim-3-116"},{"hadith-eng":"This hadith has been narrated by Ibn 'Abbas on the authority of Maimuna. the wife of the Apostle (ﷺ), by another chain of transmitters.","reference":"Sahih Muslim 356b, Book 3, Hadith 117","question #":"question #1","question":"Who was Maimuna in relation to the Prophet Muhammad (ﷺ)?","id":"muslim-3-117"},{"hadith-eng":"I testify that I used to roast the liver of the goat for the Messenger of Allah (may peace be tipcn him) and then he offered praver but did not perform ablution.","reference":"Sahih Muslim 357, Book 3, Hadith 118","question #":"question #1","question":"What is the ruling on performing ablution after eating cooked food according to Islamic teachings?","id":"muslim-3-118"},{"hadith-eng":"The Apostle (ﷺ) took milk and then called for water and rinsed (his mouth) and said: It contains greasiness.","reference":"Sahih Muslim 358a, Book 3, Hadith 119","question #":"question #1","question":"What is the significance of rinsing the mouth after consuming milk in Islamic practice?","id":"muslim-3-119"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters.","reference":"Sahih Muslim 358b, Book 3, Hadith 120","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-3-120"},{"hadith-eng":"The Messenger of Allah (ﷺ) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.","reference":"Sahih Muslim 359a, Book 3, Hadith 121","question #":"question #1","question":"What is the significance of eating before prayer in Islamic tradition?","id":"muslim-3-121"},{"hadith-eng":"I was with Ibn 'Abbas, and Ibn 'Abbas saw the Messenger of Allah (ﷺ) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word\" people\" is not mentioned.","reference":"Sahih Muslim 359b, Book 3, Hadith 122","question #":"question #1","question":"What actions did Ibn 'Abbas observe the Prophet Muhammad (ﷺ) performing during prayer?","id":"muslim-3-122"},{"hadith-eng":"A man asked the Messenger of Allah (may peace he upon him) whether he should perform ablution after (eating) mutton. He (the Messenger of Allah) said: Perform ablution it you so desire, and if you do not wish, do not perform it. He (again) asked: Should I perform ablution (after eating) camel's flesh? He said: Yes, perform ablution (after eating) camel's flesh. He (again) said: May I say prayer in the sheepfolds? He (the Messenger of Allah) said: Yes. He (the narrator) again said: May I say prayer where camels lie down? He (the Holy Prophet) said: No.","reference":"Sahih Muslim 360a, Book 3, Hadith 123","question #":"question #1","question":"What are the guidelines for performing ablution after consuming different types of meat?","id":"muslim-3-123"},{"hadith-eng":"This hadith is also narrated by another chain of transmitters.","reference":"Sahih Muslim 360b, Book 3, Hadith 124","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-3-124"},{"hadith-eng":"He should not return (from prayer) unless he hears a sound or perceives a smell (of passing wind). Abu Bakr and Zuhair b. Harb have pointed out in their narrations that it was 'Abdullah b. Zaid.","reference":"Sahih Muslim 361, Book 3, Hadith 125","question #":"question #1","question":"What guidance is provided for someone who doubts whether their ablution has been broken during prayer?","id":"muslim-3-125"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: If any one of you has pain in his abdomen, but is doubtful whether or not anything has issued from him, be should not leave the mosque unless he hears a sound or perceives a smell.","reference":"Sahih Muslim 362, Book 3, Hadith 126","question #":"question #1","question":"What should a person do if they are uncertain about breaking their wudu during prayer?","id":"muslim-3-126"},{"hadith-eng":"Why did you not take off its skin? You could put it to use, after tanning it. They (the Companions) said: It was dead. Upon, this he (the Messenger of Allah) said: Only its eating is prohibited. Abu bakr and Ibn Umar in their narrations said: It is narrated from Maimuna (may Allah be pleased with her).","reference":"Sahih Muslim 363a, Book 3, Hadith 127","question #":"question #1","question":"What is the Islamic ruling on utilizing the skin of a dead animal?","id":"muslim-3-127"},{"hadith-eng":"The Messenger of Allah (ﷺ) saw a dead goat, which had been given in charity to the freed slave-girl of Maimuna. The Messenger of Allah (ﷺ) said: Why don't you make use of its skin? They (the Companions around the Holy Prophet) said: It is dead. Upon this he said: It is the eating (of the dead animal) which is prohibited.","reference":"Sahih Muslim 363b, Book 3, Hadith 128","question #":"question #1","question":"What is the Islamic ruling on utilizing the skin of a dead animal?","id":"muslim-3-128"},{"hadith-eng":"This hadith is narrated by Ibn Shihab with the same chain of transmitters as transmitted by Yunus.","reference":"Sahih Muslim 363c, Book 3, Hadith 129","question #":"question #1","question":"Who is Ibn Shihab and what is his significance in the chain of hadith transmitters?","id":"muslim-3-129"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by a goat thrown (away) which had been in fact given to the freed slave-girl of Maimuna as charity. Upon this the Messenger of Allah (way peace he upon him) said: Why did they not get its skin? They had better tan it and make use of it.","reference":"Sahih Muslim 363d, Book 3, Hadith 130","question #":"question #1","question":"What is the significance of utilizing resources that are otherwise discarded in Islam?","id":"muslim-3-130"},{"hadith-eng":"Why did you not take off its skin and make use of that?","reference":"Sahih Muslim 364, Book 3, Hadith 131","question #":"question #1","question":"What guidance does Islam provide regarding the utilization of animal resources after their death?","id":"muslim-3-131"},{"hadith-eng":"The Apostle of Allah (ﷺ) happened to pass by (the dead body) of the goat which belonged to the freed slave-girl of Maimuna and said: Why did you not make use of its skin?","reference":"Sahih Muslim 365, Book 3, Hadith 132","question #":"question #1","question":"What can be learned about the utilization of animal resources from the Prophet's guidance?","id":"muslim-3-132"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: When the skin is tanned it becomes purified.","reference":"Sahih Muslim 366a, Book 3, Hadith 133","question #":"question #1","question":"What is the significance of tanning in the purification process of animal skins in Islamic teachings?","id":"muslim-3-133"},{"hadith-eng":"This hadith has been transmitted on the authority of Ibn 'Abbas by another chain of transmitters.","reference":"Sahih Muslim 366b, Book 3, Hadith 134","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-3-134"},{"hadith-eng":"I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah (ﷺ) about this and he said: Its tanning makes it pure.","reference":"Sahih Muslim 366c, Book 3, Hadith 135","question #":"question #1","question":"What is the ruling on using the skins of animals slaughtered by non-Muslims according to Islamic teachings?","id":"muslim-3-135"},{"hadith-eng":"I asked 'Abdullah b. 'Abbas saying: We are the inhabitants of the western regions. The Magians come to us with skins full of water and fat. He said: Drink. I said to him: Is it your own opinion? Ibn Abbas said: I heard the Messenger of Allah (ﷺ) say: Tanning purifies it (the skin).","reference":"Sahih Muslim 366d, Book 3, Hadith 136","question #":"question #1","question":"What is the significance of tanning in purifying animal skins in Islamic teachings?","id":"muslim-3-136"},{"hadith-eng":"We went with the Messenger of Allah (ﷺ) on one of his journeys and when we reached the place Baida' or Dhat al-jaish, my necklace was broken (and fell somewhere). The Messenger of Allah (way peace be upon him) along with other people stayed there for searching it. There was neither any water at that place nor was there any water with them (the Companions of the Holy Prophet). Some persons came to my father Abu Bakr and said: Do you see what 'A'isha has done? She has detained the Messenger of Allah (ﷺ) and persons accompanying him, and there is neither any water here or with them. So Abu Bakr came there and the Messenger of Allah (ﷺ) was sleeping with his head on my thigh. He (Abu Bakr) said: You have detained the Messenger of Allah (ﷺ) and other persons and there is neither water here nor with them. She ('A'isha) said: Abu Bakr scolded me and uttered what Allah wanted him to utter and nudged my hips with his hand. And there was nothing to prevent me from stirring but for the fact that the messenger of Allah (ﷺ) was lying upon my thigh. The Messenger of Allah (ﷺ) slept till it was dawn at a waterless place. So Allah revealed the verses pertaining to tayammum and they (the Prophet and his Companions) performed tayammum. Usaid b. al-Hudair who was one of the leaders said: This is not the first of your blessings,0 Family to Abu Bakr. 'A'isha said: We made the came) stand which was my mount and found the necklace under it.","reference":"Sahih Muslim 367a, Book 3, Hadith 137","question #":"question #1","question":"What is the significance of the revelation of the verses pertaining to tayammum in Islam?","id":"muslim-3-137"},{"hadith-eng":"May Allah grant you a good reward! Never has been there an occasion when you were beset with difficulty and Allah did not make you come out of that and made it an occasion of blessing for the Muslims.","reference":"Sahih Muslim 367b, Book 3, Hadith 138","question #":"question #1","question":"What is the significance of tayammum in Islamic practice and when is it applicable?","id":"muslim-3-138"},{"hadith-eng":"I was sitting in the company of Abdullah and Abu Musa when Abu Musa said: 0 'Abd al-Rahman (kunya of 'Abdullah b. Mas'ud), what would you like a man to do about the prayer if he experiences a seminal emission or has sexual intercourse but does not find water for a month? 'Abdullah said: He should not perform tayammum even if he does not find water for a month. 'Abdullah said: Then what about the verse in Sura Ma'ida:\" If you do not find water, betake yourself to clean dust\"? 'Abdullah said: If they were granted concession on the basis of this verse, there is a possibility that they would perform tayammum with dust on finding water very cold for themselves. Abu Musa said to Abdullah: You have not heard the words of 'Ammar: The Messenger of Allah (ﷺ) sent me on an errand and I had a seminal emission, but could find no water, and rolled myself in dust just as a beast rolls itself. I came to the Messenger of Allah (ﷺ) then and made a mention of that to him and he (the Holy Prophet) said: It would have been enough for you to do thus. Then he struck the ground with his hands once and wiped his right hand with the help of his left hand and the exterior of his palms and his face. 'Abdullah said: Didn't you see that Umar was not fully satisfied with the words of 'Ammar only?","reference":"Sahih Muslim 368a, Book 3, Hadith 139","question #":"question #1","question":"What should a person do if they experience a seminal emission or have sexual intercourse but cannot find water for purification?","id":"muslim-3-139"},{"hadith-eng":"He (the Holy Prophet) struck hands upon the earth, and then shook them and then wiped his face and palm.","reference":"Sahih Muslim 368b, Book 3, Hadith 140","question #":"question #1","question":"What is the significance of the Prophet's actions in performing tayammum?","id":"muslim-3-140"},{"hadith-eng":"I am (at times) affected by seminal emission but find no water. He ('Umar) told him not to say prayer. 'Ammar then said. Do you remember,0 Commander of the Faithful, when I and you were in a military detachment and we had had a seminal emission and did not find water (for taking bath) and you did not say prayer, but as for myself I rolled in dust and said prayer, and (when it was mentioned before) the Apostle (ﷺ) said: It was enough for you to strike the ground with your hands and then blow (the dust) and then wipe your face and palms. Umar said: 'Ammar, fear Allah. He said: If you so like, I would not narrate it. \nA hadith like this has been transmitted with the same chain of transmitters but for the words: 'Umar said: We hold you responsible for what you claim.\"","reference":"Sahih Muslim 368c, Book 3, Hadith 141","question #":"question #1","question":"What is the significance of tayammum in Islamic jurisprudence when water is unavailable for purification?","id":"muslim-3-141"},{"hadith-eng":"I have had a seminal emission but I found no water, and the rest of the hadith is the same but with this addition: 'Amr said: 0 Commander of the Faithful, because of the right given to you by Allah over me, if you desire, I would not narrate this hadith to anyone.","reference":"Sahih Muslim 368d, Book 3, Hadith 142","question #":"question #1","question":"What should a person do if they experience a seminal emission but cannot find water for purification?","id":"muslim-3-142"},{"hadith-eng":"I and 'Abd al-Rahmin b. Yasir, the freed slave of Maimuna, the wife of the Apostle (way peace be upon him). came to the house of Abu'l-Jahm b. al-Harith al-Simma Ansari and he said: The Messenger of Allah (ﷺ) came from the direction of Bi'r Jamal and a man met him; he saluted him but the Messenger of Allah (ﷺ) made no response, till he (the Holy Prophet) came to the wall, wiped his face and hands and then returned his salutations.","reference":"Sahih Muslim 369, Book 3, Hadith 143","question #":"question #1","question":"What is the significance of performing tayammum before responding to a greeting in Islam?","id":"muslim-3-143"},{"hadith-eng":"A person happened to pass by the Messenger of Allah (ﷺ) when he was making water and saluted him, but he did not respond to his salutation.","reference":"Sahih Muslim 370, Book 3, Hadith 144","question #":"question #1","question":"What is the appropriate etiquette when greeting someone who is engaged in relieving themselves?","id":"muslim-3-144"},{"hadith-eng":"0 Abu Huraira, where were you? He said: Messenger of Allah, you met when I was (sexually) defiled and I did not like to sit in your company before taking a bath. Upon this the Messenger of Allah (ﷺ) said: Hallowed be Allah, verily a believer is never defiled.","reference":"Sahih Muslim 371, Book 3, Hadith 145","question #":"question #1","question":"What is the significance of maintaining physical purity in Islam, especially after certain acts?","id":"muslim-3-145"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.","reference":"Sahih Muslim 372, Book 3, Hadith 146","question #":"question #1","question":"What is the significance of physical cleanliness in Islam, especially after certain activities?","id":"muslim-3-146"},{"hadith-eng":"The Apostle of Allah (ﷺ) used to remember Allah at all moments.","reference":"Sahih Muslim 373, Book 3, Hadith 147","question #":"question #1","question":"How can one incorporate the remembrance of Allah into daily life?","id":"muslim-3-147"},{"hadith-eng":"The Apostle of Allah (ﷺ) came out of the privy, and he was presented with some food, and the people reminded him about ablution, but he said: Am I to say prayer that I should perform ablution?","reference":"Sahih Muslim 374a, Book 3, Hadith 148","question #":"question #1","question":"What is the significance of performing ablution before eating in Islamic practice?","id":"muslim-3-148"},{"hadith-eng":"We were with the Messenger of Allah (ﷺ) and he had come out of the privy. Food was presented to him. It was said to him (by the Companions around him): Wouldn't you perform ablution? Upon this he said: Why, am I to say prayer that I should perform ablution?","reference":"Sahih Muslim 374b, Book 3, Hadith 149","question #":"question #1","question":"What is the significance of performing ablution before eating in Islamic tradition?","id":"muslim-3-149"},{"hadith-eng":"The Messenger of Allah (ﷺ) went to the privy and when he came back, he was presented with food. It was said to him; Messenger of Allah, wouldn't you perform ablution. He said: Why, am I to say prayer?","reference":"Sahih Muslim 374c, Book 3, Hadith 150","question #":"question #1","question":"What is the significance of performing ablution before eating in Islamic practice?","id":"muslim-3-150"},{"hadith-eng":"The Apostle of Allah (ﷺ) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Messenger of Allah (ﷺ) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.","reference":"Sahih Muslim 374d, Book 3, Hadith 151","question #":"question #1","question":"What is the significance of performing ablution before eating in Islamic practice?","id":"muslim-3-151"},{"hadith-eng":"When the Messenger of Allah (ﷺ) entered the privy, and in the hadith transmitted by Hushaim (the words are): When the Messenger of Allah (ﷺ) entered the lavatory, be used to say: O Allah, I seek refuge in Thee from wicked and noxious things.","reference":"Sahih Muslim 375a, Book 3, Hadith 152","question #":"question #1","question":"What supplication did the Prophet Muhammad (ﷺ) make before entering the lavatory?","id":"muslim-3-152"},{"hadith-eng":"I seek refuge with Allah from the wicked and noxious things.","reference":"Sahih Muslim 375b, Book 3, Hadith 153","question #":"question #1","question":"What is the significance of seeking refuge with Allah in Islamic teachings?","id":"muslim-3-153"},{"hadith-eng":"(The people) stood up for prayer and the Messenger of Allah (ﷺ) was whispering to a man, and in the narration of 'Abd al-Warith (the words are): The Apostle of Allah (ﷺ) was having a private conversation with a man, and did not start the prayer till the people dozed off.","reference":"Sahih Muslim 376a, Book 3, Hadith 154","question #":"question #1","question":"What can be inferred about the Prophet's priorities when it comes to addressing individual concerns versus communal obligations?","id":"muslim-3-154"},{"hadith-eng":"(The people) stood up for prayer and the Messenger of Allah (ﷺ) was talking in whispers with a man, and he did not discontinue the conversation till his Companions dozed off; he then came and led the prayer.","reference":"Sahih Muslim 376b, Book 3, Hadith 155","question #":"question #1","question":"What can be inferred about the Prophet's priorities when it comes to engaging in conversation before prayer?","id":"muslim-3-155"},{"hadith-eng":"I heard Anas as saying that the Companion of the Messenger of Allah (ﷺ) dozed off and then offered prayer and did not perform ablution. He (the narrator) said: I asked him if he had actually heard it from Anas. He said: By Allah. yes.","reference":"Sahih Muslim 376c, Book 3, Hadith 156","question #":"question #1","question":"What is the significance of maintaining ablution before prayer in Islamic practice?","id":"muslim-3-156"},{"hadith-eng":"(The people) stood up for the night prayer when a man spoke forth: I need to say something. The Apostle of Allah (ﷺ) entered into secret conversation with him, till the people dozed off or some of the people (dozed off), and then they said the prayer.","reference":"Sahih Muslim 376d, Book 3, Hadith 157","question #":"question #1","question":"What is the significance of maintaining focus and patience during the night prayer?","id":"muslim-3-157"},{"hadith-eng":"When anyone amongst us (amongst the wives of the Holy Prophet) menstruated, the Messenger of Allah (ﷺ) asked her to tie a waist-wrapper over her (body) and then embraced her.","reference":"Sahih Muslim 293a, Book 3, Hadith 1","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate respect and care for his wives during their menstrual periods?","id":"muslim-3-158"},{"hadith-eng":"When anyone amongst us was menstruating the Messenger of Allah (ﷺ) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah (ﷺ) had over his desires.","reference":"Sahih Muslim 293b, Book 3, Hadith 2","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate self-control and respect towards his wives during their menstrual periods?","id":"muslim-3-159"},{"hadith-eng":"The Messenger of Allah (ﷺ) contacted and embraced his wives over the waist-wrapper when they were menstruating.","reference":"Sahih Muslim 294, Book 3, Hadith 3","question #":"question #2","question":"How does this narration reflect the Prophet's approach to marital relations and intimacy?","id":"muslim-3-160"},{"hadith-eng":"I heard it from Maimuna, the wife of the Messenger of Allah (way peace be upon him): The Messenger of Allah (ﷺ) used to lie with me when I menstruated, and there was a cloth between me and him.","reference":"Sahih Muslim 295, Book 3, Hadith 4","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate respect and consideration for his wife during her menstrual period?","id":"muslim-3-161"},{"hadith-eng":"While I was lying with the Messenger of Allah (ﷺ) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (ﷺ) said: Have you menstruated? I said: Yes. He called me and I lay down","reference":"Sahih Muslim 296, Book 3, Hadith 5","question #":"question #2","question":"How does Islam address the natural occurrence of menstruation in the context of marital relationships?","id":"muslim-3-162"},{"hadith-eng":"When the Messenger of Allah (ﷺ) was in I'tikaf, he inclined his head towards me and I combedhis hair, and he did not enter the house but for the natural calls (for relieving himself).","reference":"Sahih Muslim 297a, Book 3, Hadith 6","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain personal hygiene during I'tikaf?","id":"muslim-3-163"},{"hadith-eng":"'A'isha, wife of the Messenger of Allah (ﷺ) observed: When I was (in I'tikaf), I entered the house for the call of nature, and while passing I inquired after the health of the sick (in the. family), and when the Messenger of Allah (ﷺ) was (in I'tikaf), he put out his head towards me, while he himself was in the mosque, and I combed his hair; and he did not enter the house except for the call of nature so long as he was In I'tikaf; and Ibn Rumh stated: As long as they (the Prophet and his wives) were among the observers of I'tikaf.","reference":"Sahih Muslim 297b, Book 3, Hadith 7","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain personal hygiene and social interactions during I'tikaf?","id":"muslim-3-164"},{"hadith-eng":"The Messenger of Allah (ﷺ) put out from the mosque his head for me as he was in I'tikaf, and I washed it in the state that I was menstruating.","reference":"Sahih Muslim 297c, Book 3, Hadith 8","question #":"question #2","question":"How does Islamic teaching address interactions between spouses during menstruation?","id":"muslim-3-165"},{"hadith-eng":"The Messenger of Allah (ﷺ) inclined his head towards me (from the mosque) while I was in my apartment and I combed it in a state of menstruation.","reference":"Sahih Muslim 297d, Book 3, Hadith 9","question #":"question #2","question":"How does this narration reflect the relationship between the Prophet Muhammad (ﷺ) and his family members?","id":"muslim-3-166"},{"hadith-eng":"I used to wash the head of the Messenger of Allah (ﷺ), while I was in a state of menstruation.","reference":"Sahih Muslim 297e, Book 3, Hadith 10","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) interact with his wives during their menstrual periods?","id":"muslim-3-167"},{"hadith-eng":"The Messenger of Allah (ﷺ) said to me: Get me the mat from the mosque. I said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand.","reference":"Sahih Muslim 298a, Book 3, Hadith 11","question #":"question #2","question":"How does this narration address the issue of ritual purity and physical tasks during menstruation?","id":"muslim-3-168"},{"hadith-eng":"The Messenger of Allah (ﷺ) ordered me that I should get him the mat from the mosque. I said: I am menstruating. He (the Holy Prophet) said: Do get me that, for menstruation is not in your hand.","reference":"Sahih Muslim 298b, Book 3, Hadith 12","question #":"question #2","question":"How does Islam address the issue of ritual purity in relation to menstruation?","id":"muslim-3-169"},{"hadith-eng":"While the Messenger of Allah (ﷺ) was in the mosque, he said: O 'A'isha, get me that garment. She said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand, and she, therefore, got him that.","reference":"Sahih Muslim 299, Book 3, Hadith 13","question #":"question #2","question":"How does this narration address the misconceptions about menstruation in relation to religious duties?","id":"muslim-3-170"},{"hadith-eng":"I would drink when I was menstruating, then I would hand it (the vessel) to the Apostle (ﷺ) and he would put his mouth where mine had been, and drink, and I would eat flesh from a bone when I was menstruating, then hand it over to the Apostle (ﷺ) and he would put his mouth where mine had been. Zuhair made no mention of (the Holy Prophet's) drinking.","reference":"Sahih Muslim 300, Book 3, Hadith 14","question #":"question #2","question":"How does this narration reflect the level of intimacy and affection between the Prophet and his family members?","id":"muslim-3-171"},{"hadith-eng":"The Messenger of Allah (ﷺ) would recline in my lap when I was menstruating, and recite the Qur'an.","reference":"Sahih Muslim 301, Book 3, Hadith 15","question #":"question #2","question":"How does this narration reflect the relationship between the Prophet Muhammad (ﷺ) and his wives during menstruation?","id":"muslim-3-172"},{"hadith-eng":"Among the Jews, when a woman menstruated, they did not dine with her, nor did they live with them in their houses; so the Companions of the Apostle (ﷺ) asked The Apostle (ﷺ), and Allah, the Exalted revealed:\" And they ask you about menstruation; say it is a pollution, so keep away from woman during menstruation\" to the end (Qur'an, ii. 222). The Messenger of Allah (ﷺ) said: Do everything except intercourse. The Jews heard of that and said: This man does not want to leave anything we do without opposing us in it. Usaid b. Hudair and Abbad b. Bishr came and said: Messenger of Allah, the Jews say such and such thing. We should not have, therefore, any contactwith them (as the Jews do). The face of the Messenger of Allah (way peace be upon him) underwent such a change that we thought he was angry with them, but when they went out, they happened to receive a gift of milk which was sent to the Messenger of Allah (ﷺ). He (the Holy Prophet) called for them and gave them drink, whereby they knew that he was not angry with them.","reference":"Sahih Muslim 302, Book 3, Hadith 16","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to cultural practices that differed from Islamic teachings?","id":"muslim-3-173"},{"hadith-eng":"I was one whose prostatic fluid flowed readily and I was ashamed to ask the Apostle (ﷺ) about it, because of the position of his daughter. I, therefore, asked Miqdad. b. al-Asad and he inquired of him (the Holy Prophet). He (the Holy Prophet) said: He should wash his male organ and perform ablution.","reference":"Sahih Muslim 303a, Book 3, Hadith 17","question #":"question #2","question":"How should one approach sensitive religious questions when feeling embarrassed to ask directly?","id":"muslim-3-174"},{"hadith-eng":"I felt shy of asking about prostatic fluid from the Apostle (ﷺ) because of Fatimah. I, therefore, asked al-Miqdad (to ask on my behalf) and he asked. He (the Holy Prophet) said: Ablution is obligatory in such a case.","reference":"Sahih Muslim 303b, Book 3, Hadith 18","question #":"question #2","question":"How can one seek guidance on sensitive personal matters in Islam?","id":"muslim-3-175"},{"hadith-eng":"We sent al-Miqdad b. al-Aswad to the Messenger of Allah (ﷺ) to ask him what must be done about prostatic fluid which flows from (the private part of) a person. The Messenger of Allah (ﷺ) said: Perform ablution and wash your sexual organ.","reference":"Sahih Muslim 303c, Book 3, Hadith 19","question #":"question #2","question":"How should one maintain cleanliness and purity in the presence of bodily fluids according to Islamic teachings?","id":"muslim-3-176"},{"hadith-eng":"The Apostle (ﷺ) woke up at night; relieved himself, and then washed his face and hands and then again slept.","reference":"Sahih Muslim 304, Book 3, Hadith 20","question #":"question #2","question":"What is the significance of personal hygiene in Islam as demonstrated by the Prophet's (ﷺ) actions?","id":"muslim-3-177"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) intended to sleep after having sexual intercourse, he performed ablution as for the prayer before going to sleep.","reference":"Sahih Muslim 305a, Book 3, Hadith 21","question #":"question #2","question":"How does ablution relate to cleanliness and purity in Islam?","id":"muslim-3-178"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) had sexual intercourse and intended to eat or sleep, he performed the ablution of prayer.","reference":"Sahih Muslim 305b, Book 3, Hadith 22","question #":"question #2","question":"How does ablution relate to maintaining cleanliness and purity in daily life activities?","id":"muslim-3-179"},{"hadith-eng":"AI-Hakam narrated to us who heard from Ibrahim narrating that.","reference":"Sahih Muslim 305c, Book 3, Hadith 23","question #":"question #2","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-3-180"},{"hadith-eng":"Umar said: Is one amongst us permitted to sleep in a state of impurity (i. e. after having sexual intercourse)? He (the Holy Prophet) said: Yes, after performing ablution.","reference":"Sahih Muslim 306a, Book 3, Hadith 24","question #":"question #2","question":"What is the significance of performing ablution before sleeping in a state of impurity?","id":"muslim-3-181"},{"hadith-eng":"'Umar asked the verdict of the Shari'ah from the Apostle (ﷺ) thus: Is it permissible for any one of us to sleep in a state of impurity? He (the Prophet said: Yes, he must perform ablution and then sleep and take a bath when he desires.","reference":"Sahih Muslim 306b, Book 3, Hadith 25","question #":"question #2","question":"What steps should be taken if one wishes to sleep while in a state of impurity?","id":"muslim-3-182"},{"hadith-eng":"Umar b. al-Khattab said to the Messenger of Allah (ﷺ), that he became Junbi during the night. The Messenger of Allah (ﷺ) said to him: Perform ablution, wash your sexual organ and then go to sleep.","reference":"Sahih Muslim 306c, Book 3, Hadith 26","question #":"question #2","question":"How does Islam guide individuals to maintain cleanliness and purity before sleeping?","id":"muslim-3-183"},{"hadith-eng":"I asked 'A'isha about the Witr (prayer) of the Messenger of Allah (ﷺ) and made mention of a hadith, then I said: What did he do after having sexual intercourse? Did he take a bath before going to sleep or did he sleep before taking a bath? She said: He did all these. Some- times he took a bath and then slept, and sometimes he performed ablution only and went to sleep. I (the narrator) said: Praise be to Allah Who has made things easy (for human beings).","reference":"Sahih Muslim 307a, Book 3, Hadith 27","question #":"question #2","question":"How does Islamic teaching provide flexibility in personal hygiene practices after marital relations?","id":"muslim-3-184"},{"hadith-eng":"This hadith has been transmitted with the same chain of transmitters from Mu'awyia b. Salih by Zuhair b. Harb, 'Abd al-Rahman b. Mahdi, Harun b. Sa'id al-'Aili and Ibn Wahb.","reference":"Sahih Muslim 307b, Book 3, Hadith 28","question #":"question #2","question":"How do different narrators contribute to the preservation and transmission of hadiths?","id":"muslim-3-185"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: When anyone amongst you has sexual intercourse with his wife and then he intends to repeat it, he should perform ablution. In the hadith transmitted by Abu Bakr. (the words are):\" Between the two (acts) there should be an ablution,\" or he (the narrator) said:\" Then he intended that it should be repeated.\"","reference":"Sahih Muslim 308, Book 3, Hadith 29","question #":"question #2","question":"How does ablution play a role in preparing oneself for repeated intimate relations according to Islamic teachings?","id":"muslim-3-186"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to have sexual intercourse with his wives with a single bath.","reference":"Sahih Muslim 309, Book 3, Hadith 30","question #":"question #2","question":"How does Islamic jurisprudence address the issue of purification after marital relations?","id":"muslim-3-187"},{"hadith-eng":"Umm Sulaim who was the grandmother of Ishaq came to the Messenger of Allah (ﷺ) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: O Umm Sulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressing Umm Sulaim) said: Well, O Umm Sulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream).","reference":"Sahih Muslim 310, Book 3, Hadith 31","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address questions related to women's issues in the presence of others?","id":"muslim-3-188"},{"hadith-eng":"In case a woman sees that, she must take a bath. Umm Sulaim said: I was bashful on account of that and said: Does it happen? Upon this the Messenger of Allah (ﷺ) said: Yes (it does happen), otherwise how can (a child) resemble her? Man's discharge (i. e. sperm) is thick and white and the discharge of woman is thin and yellow; so the resemblance comes from the one whose genes prevail or dominate.","reference":"Sahih Muslim 311, Book 3, Hadith 32","question #":"question #2","question":"How does the hadith explain the resemblance of a child to its parents?","id":"muslim-3-189"},{"hadith-eng":"A woman asked the Messenger of Allah (way peace be upon him) about a woman who sees in her dream what a man sees in his dream (sexual dream). He (the Holy Prophet) said: If she experiences what a man experiences, she should take a bath.","reference":"Sahih Muslim 312, Book 3, Hadith 33","question #":"question #2","question":"How does Islamic jurisprudence address the issue of dreams that lead to ritual impurity for both men and women?","id":"muslim-3-190"},{"hadith-eng":"Umm Sulaim went to the Messenger of Allah (ﷺ) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (ﷺ) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?","reference":"Sahih Muslim 313a, Book 3, Hadith 34","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address the topic of women's sexual dreams and their implications?","id":"muslim-3-191"},{"hadith-eng":"\" You humiliated the women.","reference":"Sahih Muslim 313b, Book 3, Hadith 35","question #":"question #2","question":"How does the inclusion of women's voices impact the understanding of Islamic teachings?","id":"muslim-3-192"},{"hadith-eng":"Umm Sulaim, the mother of Bani Abu Talha, came to the Messenger of Allah (ﷺ), and a hadith (like that) narrated by Hisham was narrated but for these words. A'isha said: I expressed disapproval to her, saying: Does a woman see a sexual dream?","reference":"Sahih Muslim 314a, Book 3, Hadith 36","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react to discussions about intimate matters?","id":"muslim-3-193"},{"hadith-eng":"Should a woman wash herself when she sees a sexual dream and sees (the marks) of liquid? He (the Holy Prophet) said: Yes. 'A'isha said to her: May your hand be covered with dust and injured. She narrated: The Messenger of Allah (ﷺ) said: Leave her alone. In what way does the child resemble her but for the fact that when the genes contributed by woman prevail upon those of man, the child resembles the maternal family, and when the genes of man prevail upon those of woman the child resembles the paternal family.","reference":"Sahih Muslim 314b, Book 3, Hadith 37","question #":"question #2","question":"How does the genetic contribution of parents affect the resemblance of a child to either the maternal or paternal family?","id":"muslim-3-194"},{"hadith-eng":"While I was standing beside the Messenger of Allah (ﷺ) one of the rabbis of the Jews came and said: Peace be upon you, O Muhammad. I pushed him backwith a push that he was going to fall. Upon this he said: Why do you push me? I said: Why don't you say: O Messenger of Allah? The Jew said: We call him by the name by which he was named by his family. The Messenger of Allah (ﷺ) said: My name is Muhammad with which I was named by my family. The Jew said: I have come to ask you (something). The Messenger of Allah (ﷺ) said: Should that thing be of any benefit to you, if I tell you that? He (the Jew) said: I will lend my ears to it. The Messenger of Allah (ﷺ) drew a line with the help of the stick that he had with him and then said: Ask (whatever you like). Thereupon the Jew said: Where would the human beings be on the Daywhen the earth would change into another earth and the heavens too (would change into other heavens)? The Messenger of Allah (ﷺ) said: They would be in darkness beside the Bridge. He (the Jew) again said: Who amongst people would be the first to cross (this bridge).? He said: They would be the poor amongst the refugees. The Jew said: What would constitute their breakfast when they would enter Paradise? He (the Holy Prophet) replied: A caul of the fish-liver. He (the Jew) said. What would be their food alter this? He (the Holy Prophet) said: A bullockwhich was fed in the different quarters of Paradise would be slaughtered for them. He (the Jew) said: What would be their drink? He (the Holy Prophet) said: They would be given drink from the fountain which is named\" Salsabil\". He (the Jew) said: I have come to ask you about a thing which no one amongst the people on the earth knows except an apostle or one or two men besides him. He (the Holy Prophet) said: Would it benefit you if I tell you that? He (the Jew) said: I would lend ears to that. He then said: I have come to ask you about the child. He (the Holy Prophet) said: The reproductive substance of man is white and that of woman (i. e. ovum central portion) yellow, and when they have sexual intercourse and the male's substance (chromosomes and genes) prevails upon the female's substance (chromosomes and genes), it is the male child that is created by Allah's Decree, and when the substance of the female prevails upon the substance contributed by the male, a female child is formed by the Decree of Allah. The Jew said: What you have said is true; verily you are an Apostle. He then returned and went away. The Messenger of Allah (ﷺ) said: He asked me about such and such things of which I have had no knowledge till Allah gave me that.","reference":"Sahih Muslim 315a, Book 3, Hadith 38","question #":"question #2","question":"What are the conditions of the Day of Judgment as described in this narration?","id":"muslim-3-195"},{"hadith-eng":"I was sitting beside the Messenger of Allah\" and some other minor alterations.","reference":"Sahih Muslim 315b, Book 3, Hadith 39","question #":"question #2","question":"How does the presence of a reliable chain of transmitters affect the authenticity of a hadith?","id":"muslim-3-196"},{"hadith-eng":"When Allah's Messenger (ﷺ) bathed because of sexual intercourse, he first washed his hands: he then poured water with his right hand on his left hand and washed his private parts. He then performed ablution as is done for prayer'. He then took some water and put his fingers and moved them through the roots of his hair. And when he found that these had been properly mois- tened, then poured three handfuls on his head and then poured water over his body and subsequently washed his feet.","reference":"Sahih Muslim 316a, Book 3, Hadith 40","question #":"question #2","question":"How is the process of ablution integrated into the practice of ghusl?","id":"muslim-3-197"},{"hadith-eng":"\" washed his feet.\"","reference":"Sahih Muslim 316b, Book 3, Hadith 41","question #":"question #2","question":"How do variations in wording affect the understanding of a hadith?","id":"muslim-3-198"},{"hadith-eng":"Hisham narrated it from his father, who narrated it on the authority of 'A'isha that when the Apostle (ﷺ) took a bath because of sexual inter-course, he first washed the palms of his hands three times, and then the whole hadith was transmitted like that based on the authority of Abu Mu'awyia, but no mention is made of the washing of feet.","reference":"Sahih Muslim 316c, Book 3, Hadith 42","question #":"question #2","question":"How is the ritual bath (ghusl) performed after sexual intercourse according to Islamic teachings?","id":"muslim-3-199"},{"hadith-eng":"'Urwa has narrated it on the authority of 'A'isha that when Allah's Messenger (ﷺ) took a bath because of sexual intercourse, he first washed his hands before dipping one of them into the basin, and then performed ablu- tion as is done for prayer.","reference":"Sahih Muslim 316d, Book 3, Hadith 43","question #":"question #2","question":"How does the practice of washing hands before ablution reflect on personal hygiene in Islamic teachings?","id":"muslim-3-200"},{"hadith-eng":"I placed water near the Messenger of Allah (ﷺ) to take a bath because of sexual intercourse. He washed the palms of his bands twice or thrice and then put his hand In the basin and poured water over his private parts and washed them with his left hand. He then struck his hand against the earth and rubbed it with force and then performed ablution for the prayer and then poured three handfuls of water on his head and then washed his whole body after which he moved aside from that place and washed his feet, and then I brought a towel (so that he may wipe his body). but he returned it.","reference":"Sahih Muslim 317a, Book 3, Hadith 44","question #":"question #2","question":"Why is it significant to wash the hands before performing ablution in the context of purification?","id":"muslim-3-201"},{"hadith-eng":"\" Pouring of three handfuls of water on the head.\" and in the hadith narrated by Waki' all the features of ablution have been recorded: rinsing (of mouth), snuffing of water (in the nostrils) ; and in the hadith transmitted by Abu Mu'awyia, there is no mention of a towel.","reference":"Sahih Muslim 317b, Book 3, Hadith 45","question #":"question #2","question":"How does the omission of certain details in different narrations affect the understanding of ablution?","id":"muslim-3-202"},{"hadith-eng":"Ibn Abbas narrated It on the authority of Maimuna that the Messenger of Allah (ﷺ) was given a towel, but he did not rub (his body) with it, but he did like this with water, i. e. he shook it off.","reference":"Sahih Muslim 317c, Book 3, Hadith 46","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle excess water after washing?","id":"muslim-3-203"},{"hadith-eng":"When the Messenger of Allah (ﷺ) took a bath because of sexual intercourse, he called for a vessel and took a handful of water from it and first (washed) the right side of his head, then left, and then took a handful (of water) and poured it on his head.","reference":"Sahih Muslim 318, Book 3, Hadith 47","question #":"question #2","question":"How does the sequence of washing different parts of the body play a role in the ritual of ghusl?","id":"muslim-3-204"},{"hadith-eng":"The Messenger of Allah (ﷺ) washed himself with water from a vessel (measuring seven to eight seers) because of sexual intercourse.","reference":"Sahih Muslim 319a, Book 3, Hadith 48","question #":"question #2","question":"How does the practice of ghusl relate to cleanliness and ritual purity in Islamic teachings?","id":"muslim-3-205"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath from the vessel (which contained seven to eight seers, i. e. fifteen to sixteen pounds) of water And I and he (the Holy Prophet) took a bath from the same vessel. And in the hadith narrated by Sufyan the words are:\" from one vessel\". Qutaiba said: Al-Faraq is three Sa' (a cubic measuring of varying magnitude).","reference":"Sahih Muslim 319b, Book 3, Hadith 49","question #":"question #2","question":"How does this narration reflect the simplicity and modesty in the lifestyle of the Prophet?","id":"muslim-3-206"},{"hadith-eng":"I along with the foster brother of 'A'isha went to her and he asked about the bath of the Apostle (ﷺ) because of sexual intercourse. She called for a vessel equal to a Sa' and she took a bath. and there was a curtain between us and her. She poured water on her head thrice and he (Abu Salama) said: The wives of the Apostle (ﷺ) collectedhair on their heads and these lopped up to ears (and did rot go beyond that).","reference":"Sahih Muslim 320, Book 3, Hadith 50","question #":"question #2","question":"How did the wives of the Prophet (ﷺ) manage their hair during the ritual bath?","id":"muslim-3-207"},{"hadith-eng":"I and the Messenger of Allah (ﷺ) took a bath from the same vessel, after sexual intercourse.","reference":"Sahih Muslim 321a, Book 3, Hadith 51","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) and A'isha manage their bathing routine after marital relations?","id":"muslim-3-208"},{"hadith-eng":"Hafsa, daughter of 'Abd al-Rahman b. Abu Bakr, reported that 'A'isha narrated to her that she and the Messenger of Allah (ﷺ) took a bath from the same vessel which contained water equal to three Mudds or thereabout.","reference":"Sahih Muslim 321b, Book 3, Hadith 52","question #":"question #2","question":"How does this narration illustrate the simplicity and practicality in the personal life of the Prophet Muhammad (ﷺ)?","id":"muslim-3-209"},{"hadith-eng":"I and the Messenger (ﷺ) took a bath from the same vessel and our hands alternated into it in the state that we had had sexual intercourse.","reference":"Sahih Muslim 321c, Book 3, Hadith 53","question #":"question #2","question":"How does this narration illustrate the intimate relationship between the Prophet (ﷺ) and his wife?","id":"muslim-3-210"},{"hadith-eng":"I and the Messenger of Allah (ﷺ) took a bath from one vessel which was placed between me and him and he would get ahead of me, so that I would say: Spare (some water for) me, spare (some water for) me; and she said that they had had sexual intercourse.","reference":"Sahih Muslim 321d, Book 3, Hadith 54","question #":"question #2","question":"How does this narration illustrate the intimate relationship between the Prophet Muhammad (ﷺ) and his wife?","id":"muslim-3-211"},{"hadith-eng":"Maimuna (the wife of the Holy Prophet) reported to me that she and the Messenger of Allah (ﷺ) took a bath from one vessel.","reference":"Sahih Muslim 322, Book 3, Hadith 55","question #":"question #2","question":"How does the practice of sharing resources, such as water for bathing, reflect on the relationship between the Prophet Muhammad (ﷺ) and his wives?","id":"muslim-3-212"},{"hadith-eng":"Ibn Abbas reported that the Messenger of Allah (ﷺ) took a bath with the water left over by Maimuna.","reference":"Sahih Muslim 323, Book 3, Hadith 56","question #":"question #2","question":"How does the practice of sharing water for purification reflect on the communal aspects of Islamic teachings?","id":"muslim-3-213"},{"hadith-eng":"Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (ﷺ) took a bath from the same vessel.","reference":"Sahih Muslim 324, Book 3, Hadith 57","question #":"question #2","question":"How does this narration reflect the personal and domestic life of the Prophet Muhammad (ﷺ)?","id":"muslim-3-214"},{"hadith-eng":"Anas reported that the Messenger of Allah (may peace he upon him) took a bath with five Makkuks of water and performed ablution with one Makkuk. Ibn Muthanna has used the words five Makakiyya, and Ibn Mu'adh narrated it from 'Abdullah b. 'Abdullah and he made no mention of Ibn Jabr.","reference":"Sahih Muslim 325a, Book 3, Hadith 58","question #":"question #2","question":"What can be learned about the Prophet's practice of water conservation during ablution and bathing?","id":"muslim-3-215"},{"hadith-eng":"The Apostle of Allah (ﷺ) performed ablution with one Mudd and took bath with a Sa' up to five Mudds.","reference":"Sahih Muslim 325b, Book 3, Hadith 59","question #":"question #2","question":"How does the Prophet Muhammad's practice of using limited water for ablution and bathing reflect on environmental consciousness in Islam?","id":"muslim-3-216"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath with one Sa` of water because of sexual intercourse and performed ablution with one Mudd.","reference":"Sahih Muslim 326a, Book 3, Hadith 60","question #":"question #2","question":"How does the Prophet Muhammad's (ﷺ) practice of using limited water for purification reflect on environmental consciousness in Islam?","id":"muslim-3-217"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath with one Sa' of water and performed ablution with one Mudd (of water) ; and in the hadith narrated by Ibn Hujr the words are: One Mudd sufficed for his (Holy Prophet's) ablution. And Ibn Hujr said that (his Shaikh) Isma'il was much advanced in age, and it was because of this that he could not fully rely on him for this tradition.","reference":"Sahih Muslim 326b, Book 3, Hadith 61","question #":"question #2","question":"How does the concept of sufficiency in using water for ablution reflect on Islamic teachings about resource conservation?","id":"muslim-3-218"},{"hadith-eng":"The people contended amongst themselves in the presence of the Messenger of Allah (ﷺ) with regard to bathing. Some of them said: We wash our heads like this and this. Upon this the Messenger (ﷺ) said: As for me I pour three handfuls of water upon my head.","reference":"Sahih Muslim 327a, Book 3, Hadith 62","question #":"question #2","question":"What was the context in which people discussed the method of bathing in the presence of the Prophet Muhammad (ﷺ)?","id":"muslim-3-219"},{"hadith-eng":"I pour water over my head thrice.","reference":"Sahih Muslim 327b, Book 3, Hadith 63","question #":"question #2","question":"How many times should water be poured over the head during ghusl according to Islamic teachings?","id":"muslim-3-220"},{"hadith-eng":"A delegation of the Thaqif said to the Messenger of Allah (ﷺ): Our land is cold; what about our bathing then? He (the Holy Prophet) said: I pour water thrice over my head.Ibn Salim in his narration reported:\" The delegation of the Thaqif said: Messenger of Allah.\"","reference":"Sahih Muslim 328, Book 3, Hadith 64","question #":"question #2","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding personal hygiene in challenging weather conditions?","id":"muslim-3-221"},{"hadith-eng":"When the Messenger of Allah (ﷺ) took a bath because of sexual intercourse, he poured three handfuls of water upon his head. Hasan b. Muhammad said to him (the narrator): My hair is thick. Upon this Jabir observed. I said to him: O son of my brother, the hair of the Messenger of Allah (ﷺ) was thicker than your hair and these were more fine (than yours).","reference":"Sahih Muslim 329, Book 3, Hadith 65","question #":"question #2","question":"What can be inferred about the Prophet's (ﷺ) hair from this narration?","id":"muslim-3-222"},{"hadith-eng":"I said: Messenger of Allah, I am a woman who has closely plaited hair on my head; should I undo it for taking a bath, because of sexual intercourse? He (the Holy Prophet) said: No, it is enough for you to throw three handfuls of water on your head and then pour water over yourself, and you shall be purified.","reference":"Sahih Muslim 330a, Book 3, Hadith 66","question #":"question #2","question":"How can one achieve purification without undoing tightly plaited hair?","id":"muslim-3-223"},{"hadith-eng":"This hadith has been narrated by Amr al-Naqid, Yazid b. Harun, 'Abd b. Humaid, Abd al-Razzaq, Thauri, Ayyub b. Musa, with the same chain of transmitters. In hadith narrated by Abd al-Razzaq there is a mention of the menstruation and of the sexual intercourse. The rest of the hadith has been transmitted like that of Ibn 'Uyaina.","reference":"Sahih Muslim 330b, Book 3, Hadith 67","question #":"question #2","question":"How do variations in hadith narrations affect the understanding of specific topics like menstruation and sexual intercourse?","id":"muslim-3-224"},{"hadith-eng":"\" Should I undo the plait and wash it, because of sexual intercourse?\" and there is no mention of menstruation.","reference":"Sahih Muslim 330c, Book 3, Hadith 68","question #":"question #2","question":"How does Islamic jurisprudence address the issue of washing hair for women after sexual relations?","id":"muslim-3-225"},{"hadith-eng":"It was conveyed to 'A'isha that 'Abdullah b. 'Amr ordered the women to undo the (plaits) of hair on their heads. She said: How strange it is for Ibn 'Amr that he orders the women to undo the plaits of their head while taking a bath; why does he not order them to shave their beads? I and the Messenger of Allah (ﷺ) took bath from one vessel. I did no more than this that I poured three handfuls of water over my head.","reference":"Sahih Muslim 331, Book 3, Hadith 69","question #":"question #2","question":"How did A'isha respond to the instructions given by 'Abdullah b. 'Amr regarding women's hair during bathing?","id":"muslim-3-226"},{"hadith-eng":"A woman asked the Messenger of Allah (ﷺ) how to wash herself after menstruation. She mentioned that he taught her how to take bath and then told her to take a piece of cotton with musk and purify herself. She said: How should I purify myself with that? He (the Holy Prophet) said: Praise be to Allah, purify yourself with it, and covered his face, Sufyan b. 'Uyaina gave a demonstration by covering his face (as the Prophet had done). 'A'isha reported: I dragged her to my side for I had understood what the Messenger of Allah (ﷺ) intended and, therefore, said: Apply this cotton with musk to the trace of blood. Ibn 'Umar in his hadith (has mentioned the words of 'A'isha thus): Apply it to the marks of blood.","reference":"Sahih Muslim 332a, Book 3, Hadith 70","question #":"question #2","question":"How did 'A'isha assist in clarifying the Prophet's instructions on purification?","id":"muslim-3-227"},{"hadith-eng":"A woman asked the Messenger of Allah (ﷺ) how he should wash herself after the menstrual period. He (the Holy Prophet) said: Take a cotton with musk and purity yourself, and the rest of the hadith was narrated like that of Sufyan.","reference":"Sahih Muslim 332b, Book 3, Hadith 71","question #":"question #2","question":"How is the use of musk recommended in the process of purification?","id":"muslim-3-228"},{"hadith-eng":"Asma (daughter of Shakal) asked the Messenger of Allah (ﷺ) about washing after menstruation. He said: Everyone amongst you should use water (mixed with the leaves of) the lote-tree and cleanse herself well, and then pour water on her head and rub it vigorously till it reaches the roots of the hair. Then she should pour water on it. Afterwards she should take a piece of cotton smeared with musk and cleanse herself with it. Asma' said: How should she cleanse herself with the help of that? Upon this he (the Messenger of Allah) observed: Praise be to Allah, she should cleanse herself. 'A'isha said in a subdued tone that she should apply it to the trace of blood. She (Asma) then further asked about bathing after sexual intercourse. He (the Holy Prophet) said: She should take water and cleanse herself well or complete the ablution and then (pour water) on her head and rub it till it reaches the roots of the hair (of her) head and then pour water on her. 'A'isha said: How good are the women of Ansar (helpers) that their shyness does not prevent them from learning religion.","reference":"Sahih Muslim 332c, Book 3, Hadith 72","question #":"question #2","question":"How does Islam encourage women to seek knowledge about religious practices despite feelings of shyness?","id":"muslim-3-229"},{"hadith-eng":"Cleanse yourself with it, and he covered (his face on account of shyness).","reference":"Sahih Muslim 332d, Book 3, Hadith 73","question #":"question #2","question":"How does Islam emphasize personal cleanliness and hygiene?","id":"muslim-3-230"},{"hadith-eng":"Asma' b. Shakal came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, how one amongst us should take a bath after the menstruation, and the rest of the hadith is the same and there is no mention of bathing because of sexual intercourse.","reference":"Sahih Muslim 332e, Book 3, Hadith 74","question #":"question #2","question":"How does Islamic teaching address the purification process for women after their menstrual cycle?","id":"muslim-3-231"},{"hadith-eng":"Fatimah b. Abu Hubaish came to the Apostle (ﷺ) and said: I am a woman whose blood keeps flowing (even after the menstruation period). I am never purified; should I, therefore, abandon prayer? He (the Holy Prophet) said: Not at all, for that is only a vein, and is not a menstruation, so when menstruation comes, abandon prayer, and when it ends wash the blood from yourself and then pray.","reference":"Sahih Muslim 333a, Book 3, Hadith 75","question #":"question #2","question":"How does the hadith differentiate between menstrual and non-menstrual bleeding in terms of religious duties?","id":"muslim-3-232"},{"hadith-eng":"\" There came Fatimah b. Abu Hubaish, b. 'Abd al-Muttalib b. Asad, and she was a woman amongst us,\" and in the hadith of Hammid b. Zaid there is an addition of these words:\" We abandoned mentioning him.\"","reference":"Sahih Muslim 333b, Book 3, Hadith 76","question #":"question #2","question":"What can be inferred about the role of women in early Islamic society from this narration?","id":"muslim-3-233"},{"hadith-eng":"Umm Habiba b. Jahsh thus asked for a verdict from the Messenger of Allah (ﷺ): I am a woman whose blood keeps flowing (after the menstrual period). He (the Holy Prophet) said: That is only a vein, so take a bath and offer prayer; and she took a bath at the time of every prayer. Laith b. Sa'd said: Ibn Shihab made no mention that the Messenger of Allah (ﷺ) had ordered her to take a bath at the time of every prayer, but she did it of her own accord. And in the tradition transmitted by Ibn Rumh there is no mention of Umm Habiba (and there is mention of the daughter of Jahsh only.)","reference":"Sahih Muslim 334a, Book 3, Hadith 77","question #":"question #2","question":"How does the practice of taking a bath relate to the performance of prayers in cases of irregular bleeding?","id":"muslim-3-234"},{"hadith-eng":"Umm Habiba b. Jahsh who was the sister-in-law of the Messenger of Allah (ﷺ) and the wife of 'Abd al-Rahman b. Auf, remained mustahada for seven years, and she, therefore, asked for the verdict of Shari'ah from the Messenger of Allah (ﷺ) about it The Messenger of Allah (ﷺ) said: This is not menstruation, but (blood from) a vein: so bathe yourself and offer prayer. 'A'isha said: She took a bath in the wash-tub placed in the apartment of her sister Zainab b. Jahsh, till the redness of the blood came over the water. Ibn Shihab said: I narrated it to Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham about it who observed: May Allah have mercy on Hinda! would that she listened to this verdict. By Lord, she wept for not offering prayer.","reference":"Sahih Muslim 334b, Book 3, Hadith 78","question #":"question #2","question":"How does the ruling on mustahada affect a woman's prayer obligations in Islam?","id":"muslim-3-235"},{"hadith-eng":"Umm Habiba b. Jahsh came to the Messenger of Allah (ﷺ) and she had been a mustahada for seven years, and the rest of the hadith was narrated like that of 'Amr b. al-Harith up to the words:\" There came the redness of the blood over water.\" and nothing was narrated beyond it.","reference":"Sahih Muslim 334c, Book 3, Hadith 79","question #":"question #2","question":"How does the concept of mustahada affect a woman's prayer and fasting obligations?","id":"muslim-3-236"},{"hadith-eng":"I The daughter of jahsh had been mustabida for seven years,\" and the rest of the hadith is the same (as mentioned above).","reference":"Sahih Muslim 334d, Book 3, Hadith 80","question #":"question #2","question":"How does the narration describe the condition of the daughter of Jahsh?","id":"muslim-3-237"},{"hadith-eng":"Umm Habiba asked the Messenger of Allah (ﷺ) about the blood (which flows beyond the period of menstruation). 'A'isha said: I saw her wash-tub full of blood. The Messenger of Allah (ﷺ) said: Remain away (from prayer) equal (to the length of time) that your menses prevented you. After this (after the period of usual courses) bathe yourself and offer prayer.","reference":"Sahih Muslim 334e, Book 3, Hadith 81","question #":"question #2","question":"How should a woman determine the appropriate time to resume prayer after her menstrual cycle?","id":"muslim-3-238"},{"hadith-eng":"Umm Habiba b. Jahsh who was the spouse of Abd al- Rahman b. Auf made a complaint to the Messenger of Allah (ﷺ) about blood (which flows beyond the menstrual period). He said to her: Remain away (from prayer) equal (to the length of time) that your menstruation holds you back. After this, bathe yourself. And she washed herself before every prayer.","reference":"Sahih Muslim 334f, Book 3, Hadith 82","question #":"question #2","question":"How should a woman purify herself after experiencing bleeding beyond the menstrual period before performing prayers?","id":"muslim-3-239"},{"hadith-eng":"A woman asked 'A'isha: Should one amongst us complete prayers abandoned during the period of menses? 'A'isha said: Are you a Haruriya? When any one of us during the time of the Messenger of Allah (ﷺ) was in her menses (and abandoned prayer) she was not required to complete them.","reference":"Sahih Muslim 335a, Book 3, Hadith 83","question #":"question #2","question":"How did 'A'isha respond to the question about completing prayers missed during menstruation?","id":"muslim-3-240"},{"hadith-eng":"Should a menstruating woman complete the prayer (abandoned during the menstrual period)? 'A'isha said: Are you a Hurariya? The wives of the Messenger of Allah (ﷺ) have had their monthly courses, (but) did he order them to make compensation (for the abandoned prayers)? Muhammad b. Ja'far said: (Compensation) denotes their completion.","reference":"Sahih Muslim 335b, Book 3, Hadith 84","question #":"question #2","question":"How did the wives of the Prophet Muhammad (ﷺ) handle their prayers during menstruation?","id":"muslim-3-241"},{"hadith-eng":"I asked 'A'isha: What is the reason that a menstruating woman completes the fasts (that she abandons during her monthly course). but she does not complete the prayers? She (Hadrat 'A'isha) said: Are you a Haruriya? I said: I am not a Haruriya, but I simply want to inquire. She said: We passed through this (period of menstruation), and we were ordered to complete the fasts, but were not ordered to complete the prayers.","reference":"Sahih Muslim 335c, Book 3, Hadith 85","question #":"question #2","question":"What is the significance of the distinction between fasting and prayer obligations for menstruating women in Islamic jurisprudence?","id":"muslim-3-242"},{"hadith-eng":"I went to the Messenger of Allah (ﷺ) on the day of the conquest (of Mecca) and found him take a bath. while his daughter Fatimah was holding a curtain around him.","reference":"Sahih Muslim 336a, Book 3, Hadith 86","question #":"question #2","question":"How did the family members of the Prophet Muhammad (ﷺ) assist him in maintaining modesty?","id":"muslim-3-243"},{"hadith-eng":"It was the day of the conquest (of Mecca) that she went to the Messenger of Allah (ﷺ) and he was staying at a higher part (of that city). The Messenger of Allah (ﷺ) got up for his bath. Fatimah held a curtain around him (in order to provide him privacy). He then put on his garments and wrapped himself with that and then offered eight rak'ahs of the forenoon prayer.","reference":"Sahih Muslim 336b, Book 3, Hadith 87","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain privacy during his bath according to Islamic teachings?","id":"muslim-3-244"},{"hadith-eng":"His (the Holy Prophet's) daughter Fatimah provided him privacy with the help of his cloth, and when he had taken a bath he took it up and wrapped it around him and then stood and offered eight rak'ahs of the forenoon prayer.","reference":"Sahih Muslim 336c, Book 3, Hadith 88","question #":"question #2","question":"How many rak'ahs are performed in the forenoon prayer according to this narration?","id":"muslim-3-245"},{"hadith-eng":"I placed water for the Apostle (ﷺ) and provided privacy for him, and he took a bath.","reference":"Sahih Muslim 337, Book 3, Hadith 89","question #":"question #2","question":"How is the act of preparing water for someone viewed in Islamic teachings?","id":"muslim-3-246"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: A man should not see the private parts of another man, and a woman should not see the private parts of another woman, and a man should not lie with another man under one covering, and a woman should not lie with another woman under one covering.","reference":"Sahih Muslim 338a, Book 3, Hadith 90","question #":"question #2","question":"How does Islamic teaching address the issue of sharing a bed or covering with someone of the same gender?","id":"muslim-3-247"},{"hadith-eng":"Private parts of man are the nakedness (which is concealed).","reference":"Sahih Muslim 338b, Book 3, Hadith 91","question #":"question #2","question":"How does Islamic jurisprudence define the concept of 'awrah' for men?","id":"muslim-3-248"},{"hadith-eng":"By Allah, nothing prohibits Moses to take a bath along with us, but sacrotal hernia. He (Moses) once went for a bath and placed his clothes on a stone and the stone moved on with his clothes. Moses ran after it saying: 0 stone, my clothes,0 stone, my clothes, and Banu Isra'il had the chance to see the private parts of Moses, and said: By Allah, Moses does not suffer from any ailment. The stone then stopped, till Moses had been seen by them, and he then took hold of his clothes and struck the stone. Abu Huraira said: By Allah, there are the marks of six or seven strokes made by Moses on the stone.","reference":"Sahih Muslim 339, Book 3, Hadith 92","question #":"question #2","question":"How does this story illustrate the concept of divine intervention in the lives of prophets?","id":"muslim-3-249"},{"hadith-eng":"When the Ka'ba was constructed the Messenger of Allah (ﷺ) and Abbas went and lifted stones. Abbas said to the Messenger of Allah (ﷺ): Place your lower garment on your shoulder (so that you may protect yourself from the roughness and hardness of stones). He (the Holy Prophet) did this, but fell down upon the ground in a state of unconciousness and his eyes were turned towards the sky. He then stood up and said: My lower garment, my lower garment; and this wrapper was tied around him. In the hadith transmitted by Ibn Rafi', there is the word:\" On his neck\" and he did not say:\" Upon his shoulder.\"","reference":"Sahih Muslim 340a, Book 3, Hadith 93","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the suggestion of using his garment for protection while carrying stones?","id":"muslim-3-250"},{"hadith-eng":"The Messenger of Allah (ﷺ) was carrying along with them (his people) stones for the Ka'ba and there was a waist wrapper around him. His uncle,\" Abbas, said to him: 0 son of my brother! if you take off the lower garment and place it on the shoulders underneath the stones, it would be better. He (the Holy Prophet) took it off and placed it on his shoulder and fell down unconscious. He (the narrator) said: Never was he seen naked after that day.","reference":"Sahih Muslim 340b, Book 3, Hadith 94","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to his uncle's suggestion during the construction of the Ka'ba?","id":"muslim-3-251"},{"hadith-eng":"I was carrying a heavy stone and my lower garment was loose, and it, therefore, slipped off (so soon) that I could not place the stone (on the ground) and carry to its proper place. Upon this the Messenger of Allah (ﷺ) said: Return to your cloth (lower garment), take it (and tie it around your waist) and do not walk naked.","reference":"Sahih Muslim 341, Book 3, Hadith 95","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address the issue of maintaining dignity while performing tasks?","id":"muslim-3-252"},{"hadith-eng":"The Messenger of Allah (ﷺ) one day made me mount behind him and he confided to me something secret which I would not disclose to anybody; and the Messenger of Allah (ﷺ) liked the concealment provided by a lofty place or cluster of dates (while answering the call of nature), Ibn Asma' said in his narration: It implied an enclosure of the date-trees.","reference":"Sahih Muslim 342, Book 3, Hadith 96","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the importance of privacy in personal matters?","id":"muslim-3-253"},{"hadith-eng":"I went to Quba' with the Messenger of Allah (ﷺ) on Monday till we reached (the habitation) of Banu Salim. The Messenger of Allah (ﷺ) stood at the door of 'Itban and called him loudly. So he came out dragging his lower garnment. Upon this the Messenger of Allah (ﷺ) said: We have made this man to make haste 'Itban said: Messenger of Allah, if a man parts with his wife suddenly without seminal emission, what is he required to do (with regard to bath)? The Messenger of Allah (ﷺ) said: It is with the seminal emission that bath becomes obligatory.","reference":"Sahih Muslim 343a, Book 3, Hadith 97","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) interact with his companions during visits to their homes?","id":"muslim-3-254"},{"hadith-eng":"The Apostle of Allah (ﷺ) observed: Bathing is obligatory in case of seminal emission.","reference":"Sahih Muslim 343b, Book 3, Hadith 98","question #":"question #2","question":"What are the circumstances that necessitate a ritual bath in Islam?","id":"muslim-3-255"},{"hadith-eng":"The Messenger of Allah (ﷺ) abrogated some of his commands by others, just as the Qur'an abrogates some part with the other.","reference":"Sahih Muslim 344, Book 3, Hadith 99","question #":"question #2","question":"In what ways can the Qur'an abrogate its own verses?","id":"muslim-3-256"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by (the house) of a man amongst the Ansar, and he sent for him. He came out and water was trickling down from his head. Upon this he (the Holy Prophet) said: Perhaps we put you to haste. He said: Yes. Messenger of Allah. He (the Holy Prophet) said: When you made haste or semen is not emitted, bathing is not obligatory for you, but ablution is binding. Ibn Bashshir has narrated it with a minor alteration.","reference":"Sahih Muslim 345, Book 3, Hadith 100","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) address situations where someone might be inconvenienced or in haste?","id":"muslim-3-257"},{"hadith-eng":"I arked the Messenger of Allah (ﷺ) about a man who has sexual intercourse with his wife, but leaves her before orgasm. Upon this he (the Holy Prophet) said: He should wash the secretion of his wife, and then perform ablution and ofier prayer.","reference":"Sahih Muslim 346a, Book 3, Hadith 101","question #":"question #2","question":"What is the significance of washing and performing ablution after marital relations?","id":"muslim-3-258"},{"hadith-eng":"If a person has sexual intercourse with his wife, but does not experience orgasm, he should wash his organ and perform an ablution.","reference":"Sahih Muslim 346b, Book 3, Hadith 102","question #":"question #2","question":"How does ablution play a role in maintaining cleanliness in Islam?","id":"muslim-3-259"},{"hadith-eng":"What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 347a, Book 3, Hadith 103","question #":"question #2","question":"How should one cleanse themselves after engaging in intimate relations according to Islamic teachings?","id":"muslim-3-260"},{"hadith-eng":"Abu Ayyub reported that he had heard like this from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 347b, Book 3, Hadith 104","question #":"question #2","question":"How does the authenticity of a hadith impact its acceptance in Islamic teachings?","id":"muslim-3-261"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: When a man has sexual intercourse, bathing becomes obligatory (both for the male and the female). In the hadith of Matar the words are: Even if there is no orgasm. Zuhair has narrated it with a minor alteration of words.","reference":"Sahih Muslim 348a, Book 3, Hadith 105","question #":"question #2","question":"Does the occurrence of orgasm affect the obligation of bathing after sexual intercourse?","id":"muslim-3-262"},{"hadith-eng":"This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words;\" Even if there is no orgasm\" have been omitted.","reference":"Sahih Muslim 348b, Book 3, Hadith 106","question #":"question #2","question":"How does the omission of certain phrases affect the understanding of a hadith?","id":"muslim-3-263"},{"hadith-eng":"There cropped up a difference of opinion between a group of Muhajirs (Emigrants and a group of Ansar (Helpers) (and the point of dispute was) that the Ansar said: The bath (because of sexual intercourse) becomes obligatory only-when the semen spurts out or ejaculates. But the Muhajirs said: When a man has sexual intercourse (with the woman), a bath becomes obligatory (no matter whether or not there is seminal emission or ejaculation). Abu Musa said: Well, I satisfy you on this (issue). He (Abu Musa, the narrator) said: I got up (and went) to 'A'isha and sought her permission and it was granted, and I said to her: 0 Mother, or Mother of the Faithful, I want to ask you about a matter on which I feel shy. She said: Don't feel shy of asking me about a thing which you can ask your mother, who gave you birth, for I am too your mother. Upon this I said: What makes a bath obligatory for a person? She replied: You have come across one well informed! The Messenger of Allah (ﷺ) said: When anyone sits amidst four parts (of the woman) and the circumcised parts touch each other a bath becomes obligatory.","reference":"Sahih Muslim 349, Book 3, Hadith 107","question #":"question #2","question":"How did Aisha, the Mother of the Faithful, respond to questions about the conditions that make a bath obligatory?","id":"muslim-3-264"},{"hadith-eng":"I and she (the Mother of the Faithful) do it and then take a bath.","reference":"Sahih Muslim 350, Book 3, Hadith 108","question #":"question #2","question":"How does the practice of the Prophet Muhammad (ﷺ) and his wife 'A'isha inform the understanding of purification rituals?","id":"muslim-3-265"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say this: Ablution is obligatory (for one who takes anything) touched by fire.","reference":"Sahih Muslim 351, Book 3, Hadith 109","question #":"question #2","question":"How does the consumption of food affect the state of ritual purity in Islam?","id":"muslim-3-266"},{"hadith-eng":"I am performing ablution because of having eaten pieces of cheese, for I heard the Messenger of Allah (ﷺ) say: Perform ablution (after eating anything) touched by fire.","reference":"Sahih Muslim 352, Book 3, Hadith 110","question #":"question #2","question":"How does the practice of ablution relate to dietary habits in Islamic teachings?","id":"muslim-3-267"},{"hadith-eng":"The Messenger of Allah (ﷺ) said. Perform ablution (after eating) anything touched by fire.","reference":"Sahih Muslim 353, Book 3, Hadith 111","question #":"question #2","question":"How does the consumption of food cooked with fire relate to the practice of ablution in Islamic teachings?","id":"muslim-3-268"},{"hadith-eng":"The Messenger of Allah (ﷺ) took (meat of) goat's shoulder and offered prayer and did not perform ablution.","reference":"Sahih Muslim 354a, Book 3, Hadith 112","question #":"question #2","question":"How does the consumption of certain foods affect the validity of one's prayer in Islam?","id":"muslim-3-269"},{"hadith-eng":"The Messenger of Allah (ﷺ) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.","reference":"Sahih Muslim 354b, Book 3, Hadith 113","question #":"question #2","question":"How does the practice of the Prophet (ﷺ) influence the understanding of ablution requirements?","id":"muslim-3-270"},{"hadith-eng":"I saw the Messenger of Allah (ﷺ) take slices from goat's shoulder, and then eat them, and then offer prayer without having performed ablution.","reference":"Sahih Muslim 355a, Book 3, Hadith 114","question #":"question #2","question":"How does the consumption of food affect the requirement for ablution before prayer?","id":"muslim-3-271"},{"hadith-eng":"I saw the Messenger of Allah (ﷺ) take slices from goat's shoulder and then eat them. He was called for prayer and he got'up, leaving aside the knife, and offered prayer but did not perform ablution.","reference":"Sahih Muslim 355b, Book 3, Hadith 115","question #":"question #2","question":"Is it necessary to perform ablution after eating before offering prayer?","id":"muslim-3-272"},{"hadith-eng":"Ibn 'Abbas reported it on the authority of Maimuana, the wife of the Messenger of Allah (ﷺ), that the Messenger of Allah (ﷺ) took (a piece of goat's) shoulder at her place, and then offered prayer but did not perform ablution.","reference":"Sahih Muslim 356a, Book 3, Hadith 116","question #":"question #2","question":"What are the circumstances under which ablution is not required before prayer?","id":"muslim-3-273"},{"hadith-eng":"This hadith has been narrated by Ibn 'Abbas on the authority of Maimuna. the wife of the Apostle (ﷺ), by another chain of transmitters.","reference":"Sahih Muslim 356b, Book 3, Hadith 117","question #":"question #2","question":"What is the significance of Ibn 'Abbas in the context of hadith narration?","id":"muslim-3-274"},{"hadith-eng":"I testify that I used to roast the liver of the goat for the Messenger of Allah (may peace be tipcn him) and then he offered praver but did not perform ablution.","reference":"Sahih Muslim 357, Book 3, Hadith 118","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) handle the situation of eating and then praying?","id":"muslim-3-275"},{"hadith-eng":"The Apostle (ﷺ) took milk and then called for water and rinsed (his mouth) and said: It contains greasiness.","reference":"Sahih Muslim 358a, Book 3, Hadith 119","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate cleanliness after eating or drinking?","id":"muslim-3-276"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters.","reference":"Sahih Muslim 358b, Book 3, Hadith 120","question #":"question #2","question":"How does the presence of different narrators affect the reliability of a hadith?","id":"muslim-3-277"},{"hadith-eng":"The Messenger of Allah (ﷺ) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.","reference":"Sahih Muslim 359a, Book 3, Hadith 121","question #":"question #2","question":"Is it necessary to perform ablution after eating before offering prayer?","id":"muslim-3-278"},{"hadith-eng":"I was with Ibn 'Abbas, and Ibn 'Abbas saw the Messenger of Allah (ﷺ) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word\" people\" is not mentioned.","reference":"Sahih Muslim 359b, Book 3, Hadith 122","question #":"question #2","question":"How does the observation of the Prophet's actions influence the understanding of prayer practices?","id":"muslim-3-279"},{"hadith-eng":"A man asked the Messenger of Allah (may peace he upon him) whether he should perform ablution after (eating) mutton. He (the Messenger of Allah) said: Perform ablution it you so desire, and if you do not wish, do not perform it. He (again) asked: Should I perform ablution (after eating) camel's flesh? He said: Yes, perform ablution (after eating) camel's flesh. He (again) said: May I say prayer in the sheepfolds? He (the Messenger of Allah) said: Yes. He (the narrator) again said: May I say prayer where camels lie down? He (the Holy Prophet) said: No.","reference":"Sahih Muslim 360a, Book 3, Hadith 123","question #":"question #2","question":"What are the considerations for choosing a place to perform prayer according to Islamic teachings?","id":"muslim-3-280"},{"hadith-eng":"This hadith is also narrated by another chain of transmitters.","reference":"Sahih Muslim 360b, Book 3, Hadith 124","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-3-281"},{"hadith-eng":"He should not return (from prayer) unless he hears a sound or perceives a smell (of passing wind). Abu Bakr and Zuhair b. Harb have pointed out in their narrations that it was 'Abdullah b. Zaid.","reference":"Sahih Muslim 361, Book 3, Hadith 125","question #":"question #2","question":"What are the conditions mentioned for a person to leave their prayer due to doubts about ablution?","id":"muslim-3-282"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: If any one of you has pain in his abdomen, but is doubtful whether or not anything has issued from him, be should not leave the mosque unless he hears a sound or perceives a smell.","reference":"Sahih Muslim 362, Book 3, Hadith 126","question #":"question #2","question":"How does one determine whether their wudu is still valid in the absence of clear evidence?","id":"muslim-3-283"},{"hadith-eng":"Why did you not take off its skin? You could put it to use, after tanning it. They (the Companions) said: It was dead. Upon, this he (the Messenger of Allah) said: Only its eating is prohibited. Abu bakr and Ibn Umar in their narrations said: It is narrated from Maimuna (may Allah be pleased with her).","reference":"Sahih Muslim 363a, Book 3, Hadith 127","question #":"question #2","question":"How can the skin of a dead animal be made permissible for use in Islam?","id":"muslim-3-284"},{"hadith-eng":"The Messenger of Allah (ﷺ) saw a dead goat, which had been given in charity to the freed slave-girl of Maimuna. The Messenger of Allah (ﷺ) said: Why don't you make use of its skin? They (the Companions around the Holy Prophet) said: It is dead. Upon this he said: It is the eating (of the dead animal) which is prohibited.","reference":"Sahih Muslim 363b, Book 3, Hadith 128","question #":"question #2","question":"How does Islam differentiate between the consumption and other uses of a dead animal?","id":"muslim-3-285"},{"hadith-eng":"This hadith is narrated by Ibn Shihab with the same chain of transmitters as transmitted by Yunus.","reference":"Sahih Muslim 363c, Book 3, Hadith 129","question #":"question #2","question":"What is the importance of the chain of transmitters in the authentication of hadiths?","id":"muslim-3-286"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by a goat thrown (away) which had been in fact given to the freed slave-girl of Maimuna as charity. Upon this the Messenger of Allah (way peace he upon him) said: Why did they not get its skin? They had better tan it and make use of it.","reference":"Sahih Muslim 363d, Book 3, Hadith 130","question #":"question #2","question":"How can the process of tanning be beneficial in making use of animal skins?","id":"muslim-3-287"},{"hadith-eng":"Why did you not take off its skin and make use of that?","reference":"Sahih Muslim 364, Book 3, Hadith 131","question #":"question #2","question":"How can the skin of a dead animal be used according to Islamic teachings?","id":"muslim-3-288"},{"hadith-eng":"The Apostle of Allah (ﷺ) happened to pass by (the dead body) of the goat which belonged to the freed slave-girl of Maimuna and said: Why did you not make use of its skin?","reference":"Sahih Muslim 365, Book 3, Hadith 132","question #":"question #2","question":"How does Islamic teaching address the use of animal by-products?","id":"muslim-3-289"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: When the skin is tanned it becomes purified.","reference":"Sahih Muslim 366a, Book 3, Hadith 133","question #":"question #2","question":"How does the process of tanning affect the ritual purity of animal hides?","id":"muslim-3-290"},{"hadith-eng":"This hadith has been transmitted on the authority of Ibn 'Abbas by another chain of transmitters.","reference":"Sahih Muslim 366b, Book 3, Hadith 134","question #":"question #2","question":"How does the role of different narrators affect the credibility of a hadith?","id":"muslim-3-291"},{"hadith-eng":"I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah (ﷺ) about this and he said: Its tanning makes it pure.","reference":"Sahih Muslim 366c, Book 3, Hadith 135","question #":"question #2","question":"How does the process of tanning affect the purity of animal skins in Islamic law?","id":"muslim-3-292"},{"hadith-eng":"I asked 'Abdullah b. 'Abbas saying: We are the inhabitants of the western regions. The Magians come to us with skins full of water and fat. He said: Drink. I said to him: Is it your own opinion? Ibn Abbas said: I heard the Messenger of Allah (ﷺ) say: Tanning purifies it (the skin).","reference":"Sahih Muslim 366d, Book 3, Hadith 136","question #":"question #2","question":"How does the process of tanning affect the permissibility of using animal skins in Islam?","id":"muslim-3-293"},{"hadith-eng":"We went with the Messenger of Allah (ﷺ) on one of his journeys and when we reached the place Baida' or Dhat al-jaish, my necklace was broken (and fell somewhere). The Messenger of Allah (way peace be upon him) along with other people stayed there for searching it. There was neither any water at that place nor was there any water with them (the Companions of the Holy Prophet). Some persons came to my father Abu Bakr and said: Do you see what 'A'isha has done? She has detained the Messenger of Allah (ﷺ) and persons accompanying him, and there is neither any water here or with them. So Abu Bakr came there and the Messenger of Allah (ﷺ) was sleeping with his head on my thigh. He (Abu Bakr) said: You have detained the Messenger of Allah (ﷺ) and other persons and there is neither water here nor with them. She ('A'isha) said: Abu Bakr scolded me and uttered what Allah wanted him to utter and nudged my hips with his hand. And there was nothing to prevent me from stirring but for the fact that the messenger of Allah (ﷺ) was lying upon my thigh. The Messenger of Allah (ﷺ) slept till it was dawn at a waterless place. So Allah revealed the verses pertaining to tayammum and they (the Prophet and his Companions) performed tayammum. Usaid b. al-Hudair who was one of the leaders said: This is not the first of your blessings,0 Family to Abu Bakr. 'A'isha said: We made the came) stand which was my mount and found the necklace under it.","reference":"Sahih Muslim 367a, Book 3, Hadith 137","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) respond to situations where water was unavailable for ablution?","id":"muslim-3-294"},{"hadith-eng":"May Allah grant you a good reward! Never has been there an occasion when you were beset with difficulty and Allah did not make you come out of that and made it an occasion of blessing for the Muslims.","reference":"Sahih Muslim 367b, Book 3, Hadith 138","question #":"question #2","question":"How can personal challenges lead to blessings for the wider Muslim community?","id":"muslim-3-295"},{"hadith-eng":"I was sitting in the company of Abdullah and Abu Musa when Abu Musa said: 0 'Abd al-Rahman (kunya of 'Abdullah b. Mas'ud), what would you like a man to do about the prayer if he experiences a seminal emission or has sexual intercourse but does not find water for a month? 'Abdullah said: He should not perform tayammum even if he does not find water for a month. 'Abdullah said: Then what about the verse in Sura Ma'ida:\" If you do not find water, betake yourself to clean dust\"? 'Abdullah said: If they were granted concession on the basis of this verse, there is a possibility that they would perform tayammum with dust on finding water very cold for themselves. Abu Musa said to Abdullah: You have not heard the words of 'Ammar: The Messenger of Allah (ﷺ) sent me on an errand and I had a seminal emission, but could find no water, and rolled myself in dust just as a beast rolls itself. I came to the Messenger of Allah (ﷺ) then and made a mention of that to him and he (the Holy Prophet) said: It would have been enough for you to do thus. Then he struck the ground with his hands once and wiped his right hand with the help of his left hand and the exterior of his palms and his face. 'Abdullah said: Didn't you see that Umar was not fully satisfied with the words of 'Ammar only?","reference":"Sahih Muslim 368a, Book 3, Hadith 139","question #":"question #2","question":"What is the significance of the verse in Surah Ma'ida regarding the use of clean dust for purification?","id":"muslim-3-296"},{"hadith-eng":"He (the Holy Prophet) struck hands upon the earth, and then shook them and then wiped his face and palm.","reference":"Sahih Muslim 368b, Book 3, Hadith 140","question #":"question #2","question":"How is tayammum performed according to the teachings of the Prophet?","id":"muslim-3-297"},{"hadith-eng":"I am (at times) affected by seminal emission but find no water. He ('Umar) told him not to say prayer. 'Ammar then said. Do you remember,0 Commander of the Faithful, when I and you were in a military detachment and we had had a seminal emission and did not find water (for taking bath) and you did not say prayer, but as for myself I rolled in dust and said prayer, and (when it was mentioned before) the Apostle (ﷺ) said: It was enough for you to strike the ground with your hands and then blow (the dust) and then wipe your face and palms. Umar said: 'Ammar, fear Allah. He said: If you so like, I would not narrate it. \nA hadith like this has been transmitted with the same chain of transmitters but for the words: 'Umar said: We hold you responsible for what you claim.\"","reference":"Sahih Muslim 368c, Book 3, Hadith 141","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) handle situations where they lacked water for ritual purification?","id":"muslim-3-298"},{"hadith-eng":"I have had a seminal emission but I found no water, and the rest of the hadith is the same but with this addition: 'Amr said: 0 Commander of the Faithful, because of the right given to you by Allah over me, if you desire, I would not narrate this hadith to anyone.","reference":"Sahih Muslim 368d, Book 3, Hadith 142","question #":"question #2","question":"How does the concept of authority and responsibility manifest in the interactions between individuals and leaders in Islamic teachings?","id":"muslim-3-299"},{"hadith-eng":"I and 'Abd al-Rahmin b. Yasir, the freed slave of Maimuna, the wife of the Apostle (way peace be upon him). came to the house of Abu'l-Jahm b. al-Harith al-Simma Ansari and he said: The Messenger of Allah (ﷺ) came from the direction of Bi'r Jamal and a man met him; he saluted him but the Messenger of Allah (ﷺ) made no response, till he (the Holy Prophet) came to the wall, wiped his face and hands and then returned his salutations.","reference":"Sahih Muslim 369, Book 3, Hadith 143","question #":"question #2","question":"How does the Prophet Muhammad's (ﷺ) action demonstrate the importance of cleanliness before engaging in social interactions?","id":"muslim-3-300"},{"hadith-eng":"A person happened to pass by the Messenger of Allah (ﷺ) when he was making water and saluted him, but he did not respond to his salutation.","reference":"Sahih Muslim 370, Book 3, Hadith 144","question #":"question #2","question":"How should one respond to a greeting if they are unable to reply immediately due to certain circumstances?","id":"muslim-3-301"},{"hadith-eng":"0 Abu Huraira, where were you? He said: Messenger of Allah, you met when I was (sexually) defiled and I did not like to sit in your company before taking a bath. Upon this the Messenger of Allah (ﷺ) said: Hallowed be Allah, verily a believer is never defiled.","reference":"Sahih Muslim 371, Book 3, Hadith 145","question #":"question #2","question":"How does Islam view the state of a believer in terms of spiritual purity?","id":"muslim-3-302"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.","reference":"Sahih Muslim 372, Book 3, Hadith 146","question #":"question #2","question":"How does Islam view the state of a Muslim in terms of spiritual purity?","id":"muslim-3-303"},{"hadith-eng":"The Apostle of Allah (ﷺ) used to remember Allah at all moments.","reference":"Sahih Muslim 373, Book 3, Hadith 147","question #":"question #2","question":"What is the significance of constant remembrance of Allah in Islam?","id":"muslim-3-304"},{"hadith-eng":"The Apostle of Allah (ﷺ) came out of the privy, and he was presented with some food, and the people reminded him about ablution, but he said: Am I to say prayer that I should perform ablution?","reference":"Sahih Muslim 374a, Book 3, Hadith 148","question #":"question #2","question":"In what situations is ablution considered necessary according to Islamic teachings?","id":"muslim-3-305"},{"hadith-eng":"We were with the Messenger of Allah (ﷺ) and he had come out of the privy. Food was presented to him. It was said to him (by the Companions around him): Wouldn't you perform ablution? Upon this he said: Why, am I to say prayer that I should perform ablution?","reference":"Sahih Muslim 374b, Book 3, Hadith 149","question #":"question #2","question":"Under what circumstances is ablution considered necessary according to Islamic teachings?","id":"muslim-3-306"},{"hadith-eng":"The Messenger of Allah (ﷺ) went to the privy and when he came back, he was presented with food. It was said to him; Messenger of Allah, wouldn't you perform ablution. He said: Why, am I to say prayer?","reference":"Sahih Muslim 374c, Book 3, Hadith 150","question #":"question #2","question":"Under what circumstances is ablution considered necessary according to Islamic teachings?","id":"muslim-3-307"},{"hadith-eng":"The Apostle of Allah (ﷺ) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Messenger of Allah (ﷺ) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.","reference":"Sahih Muslim 374d, Book 3, Hadith 151","question #":"question #2","question":"Under what circumstances is ablution considered necessary according to Islamic teachings?","id":"muslim-3-308"},{"hadith-eng":"When the Messenger of Allah (ﷺ) entered the privy, and in the hadith transmitted by Hushaim (the words are): When the Messenger of Allah (ﷺ) entered the lavatory, be used to say: O Allah, I seek refuge in Thee from wicked and noxious things.","reference":"Sahih Muslim 375a, Book 3, Hadith 152","question #":"question #2","question":"Why is it important to seek refuge in Allah from wicked and noxious things?","id":"muslim-3-309"},{"hadith-eng":"I seek refuge with Allah from the wicked and noxious things.","reference":"Sahih Muslim 375b, Book 3, Hadith 153","question #":"question #2","question":"How can one protect themselves from harmful and evil influences according to Islamic practices?","id":"muslim-3-310"},{"hadith-eng":"(The people) stood up for prayer and the Messenger of Allah (ﷺ) was whispering to a man, and in the narration of 'Abd al-Warith (the words are): The Apostle of Allah (ﷺ) was having a private conversation with a man, and did not start the prayer till the people dozed off.","reference":"Sahih Muslim 376a, Book 3, Hadith 154","question #":"question #2","question":"How does the behavior of the Prophet during prayer time reflect his approach to leadership and communication?","id":"muslim-3-311"},{"hadith-eng":"(The people) stood up for prayer and the Messenger of Allah (ﷺ) was talking in whispers with a man, and he did not discontinue the conversation till his Companions dozed off; he then came and led the prayer.","reference":"Sahih Muslim 376b, Book 3, Hadith 155","question #":"question #2","question":"How did the companions of the Prophet react when he was delayed in leading the prayer?","id":"muslim-3-312"},{"hadith-eng":"I heard Anas as saying that the Companion of the Messenger of Allah (ﷺ) dozed off and then offered prayer and did not perform ablution. He (the narrator) said: I asked him if he had actually heard it from Anas. He said: By Allah. yes.","reference":"Sahih Muslim 376c, Book 3, Hadith 156","question #":"question #2","question":"How does the state of dozing off affect the validity of ablution in Islamic jurisprudence?","id":"muslim-3-313"},{"hadith-eng":"(The people) stood up for the night prayer when a man spoke forth: I need to say something. The Apostle of Allah (ﷺ) entered into secret conversation with him, till the people dozed off or some of the people (dozed off), and then they said the prayer.","reference":"Sahih Muslim 376d, Book 3, Hadith 157","question #":"question #2","question":"How should one handle interruptions or distractions during prayer?","id":"muslim-3-314"},{"hadith-eng":"When anyone amongst us (amongst the wives of the Holy Prophet) menstruated, the Messenger of Allah (ﷺ) asked her to tie a waist-wrapper over her (body) and then embraced her.","reference":"Sahih Muslim 293a, Book 3, Hadith 1","question #":"question #3","question":"What is the significance of using a waist-wrapper in the context of this hadith?","id":"muslim-3-315"},{"hadith-eng":"When anyone amongst us was menstruating the Messenger of Allah (ﷺ) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah (ﷺ) had over his desires.","reference":"Sahih Muslim 293b, Book 3, Hadith 2","question #":"question #3","question":"What practices are recommended for maintaining marital affection and closeness during menstruation according to Islamic teachings?","id":"muslim-3-316"},{"hadith-eng":"The Messenger of Allah (ﷺ) contacted and embraced his wives over the waist-wrapper when they were menstruating.","reference":"Sahih Muslim 294, Book 3, Hadith 3","question #":"question #3","question":"What can be understood about the boundaries of physical contact during a wife's menstrual period from this narration?","id":"muslim-3-317"},{"hadith-eng":"I heard it from Maimuna, the wife of the Messenger of Allah (way peace be upon him): The Messenger of Allah (ﷺ) used to lie with me when I menstruated, and there was a cloth between me and him.","reference":"Sahih Muslim 295, Book 3, Hadith 4","question #":"question #3","question":"What are the guidelines for physical closeness between spouses in Islam during menstruation?","id":"muslim-3-318"},{"hadith-eng":"While I was lying with the Messenger of Allah (ﷺ) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (ﷺ) said: Have you menstruated? I said: Yes. He called me and I lay down","reference":"Sahih Muslim 296, Book 3, Hadith 5","question #":"question #3","question":"What are the etiquettes and considerations for a husband and wife during the wife's menstrual period according to Islamic teachings?","id":"muslim-3-319"},{"hadith-eng":"When the Messenger of Allah (ﷺ) was in I'tikaf, he inclined his head towards me and I combedhis hair, and he did not enter the house but for the natural calls (for relieving himself).","reference":"Sahih Muslim 297a, Book 3, Hadith 6","question #":"question #3","question":"What exceptions are there for leaving the mosque during I'tikaf?","id":"muslim-3-320"},{"hadith-eng":"'A'isha, wife of the Messenger of Allah (ﷺ) observed: When I was (in I'tikaf), I entered the house for the call of nature, and while passing I inquired after the health of the sick (in the. family), and when the Messenger of Allah (ﷺ) was (in I'tikaf), he put out his head towards me, while he himself was in the mosque, and I combed his hair; and he did not enter the house except for the call of nature so long as he was In I'tikaf; and Ibn Rumh stated: As long as they (the Prophet and his wives) were among the observers of I'tikaf.","reference":"Sahih Muslim 297b, Book 3, Hadith 7","question #":"question #3","question":"What are the guidelines for leaving the mosque during I'tikaf based on the actions of the Prophet Muhammad (ﷺ)?","id":"muslim-3-321"},{"hadith-eng":"The Messenger of Allah (ﷺ) put out from the mosque his head for me as he was in I'tikaf, and I washed it in the state that I was menstruating.","reference":"Sahih Muslim 297c, Book 3, Hadith 8","question #":"question #3","question":"What are the permissible activities for a person in I'tikaf within the mosque?","id":"muslim-3-322"},{"hadith-eng":"The Messenger of Allah (ﷺ) inclined his head towards me (from the mosque) while I was in my apartment and I combed it in a state of menstruation.","reference":"Sahih Muslim 297d, Book 3, Hadith 9","question #":"question #3","question":"What can be inferred about the daily life and personal care practices of the Prophet Muhammad (ﷺ) from this narration?","id":"muslim-3-323"},{"hadith-eng":"I used to wash the head of the Messenger of Allah (ﷺ), while I was in a state of menstruation.","reference":"Sahih Muslim 297e, Book 3, Hadith 10","question #":"question #3","question":"What does this narration indicate about the cleanliness and hygiene practices in Islam?","id":"muslim-3-324"},{"hadith-eng":"The Messenger of Allah (ﷺ) said to me: Get me the mat from the mosque. I said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand.","reference":"Sahih Muslim 298a, Book 3, Hadith 11","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) view on menstruation and its impact on daily activities?","id":"muslim-3-325"},{"hadith-eng":"The Messenger of Allah (ﷺ) ordered me that I should get him the mat from the mosque. I said: I am menstruating. He (the Holy Prophet) said: Do get me that, for menstruation is not in your hand.","reference":"Sahih Muslim 298b, Book 3, Hadith 12","question #":"question #3","question":"What does this narration imply about the role of women in religious practices during menstruation?","id":"muslim-3-326"},{"hadith-eng":"While the Messenger of Allah (ﷺ) was in the mosque, he said: O 'A'isha, get me that garment. She said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand, and she, therefore, got him that.","reference":"Sahih Muslim 299, Book 3, Hadith 13","question #":"question #3","question":"What can be learned from this narration about the interaction between the Prophet Muhammad (ﷺ) and his family members?","id":"muslim-3-327"},{"hadith-eng":"I would drink when I was menstruating, then I would hand it (the vessel) to the Apostle (ﷺ) and he would put his mouth where mine had been, and drink, and I would eat flesh from a bone when I was menstruating, then hand it over to the Apostle (ﷺ) and he would put his mouth where mine had been. Zuhair made no mention of (the Holy Prophet's) drinking.","reference":"Sahih Muslim 300, Book 3, Hadith 14","question #":"question #3","question":"What can be inferred about the permissibility of sharing food and drink with others during menstruation from this narration?","id":"muslim-3-328"},{"hadith-eng":"The Messenger of Allah (ﷺ) would recline in my lap when I was menstruating, and recite the Qur'an.","reference":"Sahih Muslim 301, Book 3, Hadith 15","question #":"question #3","question":"What can be inferred about the physical closeness and affection in marital relationships from this narration?","id":"muslim-3-329"},{"hadith-eng":"Among the Jews, when a woman menstruated, they did not dine with her, nor did they live with them in their houses; so the Companions of the Apostle (ﷺ) asked The Apostle (ﷺ), and Allah, the Exalted revealed:\" And they ask you about menstruation; say it is a pollution, so keep away from woman during menstruation\" to the end (Qur'an, ii. 222). The Messenger of Allah (ﷺ) said: Do everything except intercourse. The Jews heard of that and said: This man does not want to leave anything we do without opposing us in it. Usaid b. Hudair and Abbad b. Bishr came and said: Messenger of Allah, the Jews say such and such thing. We should not have, therefore, any contactwith them (as the Jews do). The face of the Messenger of Allah (way peace be upon him) underwent such a change that we thought he was angry with them, but when they went out, they happened to receive a gift of milk which was sent to the Messenger of Allah (ﷺ). He (the Holy Prophet) called for them and gave them drink, whereby they knew that he was not angry with them.","reference":"Sahih Muslim 302, Book 3, Hadith 16","question #":"question #3","question":"What was the reaction of the Prophet Muhammad (ﷺ) when informed about the Jewish customs related to menstruation?","id":"muslim-3-330"},{"hadith-eng":"I was one whose prostatic fluid flowed readily and I was ashamed to ask the Apostle (ﷺ) about it, because of the position of his daughter. I, therefore, asked Miqdad. b. al-Asad and he inquired of him (the Holy Prophet). He (the Holy Prophet) said: He should wash his male organ and perform ablution.","reference":"Sahih Muslim 303a, Book 3, Hadith 17","question #":"question #3","question":"What is the significance of consulting knowledgeable individuals in religious matters?","id":"muslim-3-331"},{"hadith-eng":"I felt shy of asking about prostatic fluid from the Apostle (ﷺ) because of Fatimah. I, therefore, asked al-Miqdad (to ask on my behalf) and he asked. He (the Holy Prophet) said: Ablution is obligatory in such a case.","reference":"Sahih Muslim 303b, Book 3, Hadith 18","question #":"question #3","question":"What role does modesty play in seeking knowledge about personal issues in Islam?","id":"muslim-3-332"},{"hadith-eng":"We sent al-Miqdad b. al-Aswad to the Messenger of Allah (ﷺ) to ask him what must be done about prostatic fluid which flows from (the private part of) a person. The Messenger of Allah (ﷺ) said: Perform ablution and wash your sexual organ.","reference":"Sahih Muslim 303c, Book 3, Hadith 19","question #":"question #3","question":"What is the significance of ablution in maintaining ritual purity in Islam?","id":"muslim-3-333"},{"hadith-eng":"The Apostle (ﷺ) woke up at night; relieved himself, and then washed his face and hands and then again slept.","reference":"Sahih Muslim 304, Book 3, Hadith 20","question #":"question #3","question":"How does the practice of cleanliness relate to the daily routine of a Muslim?","id":"muslim-3-334"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) intended to sleep after having sexual intercourse, he performed ablution as for the prayer before going to sleep.","reference":"Sahih Muslim 305a, Book 3, Hadith 21","question #":"question #3","question":"What practices are recommended for a Muslim before going to sleep according to Islamic tradition?","id":"muslim-3-335"},{"hadith-eng":"Whenever the Messenger of Allah (ﷺ) had sexual intercourse and intended to eat or sleep, he performed the ablution of prayer.","reference":"Sahih Muslim 305b, Book 3, Hadith 22","question #":"question #3","question":"What practices did the Prophet Muhammad (ﷺ) follow to maintain spiritual and physical cleanliness?","id":"muslim-3-336"},{"hadith-eng":"AI-Hakam narrated to us who heard from Ibrahim narrating that.","reference":"Sahih Muslim 305c, Book 3, Hadith 23","question #":"question #3","question":"How does the narration process contribute to the preservation of Islamic teachings?","id":"muslim-3-337"},{"hadith-eng":"Umar said: Is one amongst us permitted to sleep in a state of impurity (i. e. after having sexual intercourse)? He (the Holy Prophet) said: Yes, after performing ablution.","reference":"Sahih Muslim 306a, Book 3, Hadith 24","question #":"question #3","question":"How does ablution affect the state of ritual purity before sleep?","id":"muslim-3-338"},{"hadith-eng":"'Umar asked the verdict of the Shari'ah from the Apostle (ﷺ) thus: Is it permissible for any one of us to sleep in a state of impurity? He (the Prophet said: Yes, he must perform ablution and then sleep and take a bath when he desires.","reference":"Sahih Muslim 306b, Book 3, Hadith 25","question #":"question #3","question":"What is the significance of performing ablution before sleeping in a state of impurity?","id":"muslim-3-339"},{"hadith-eng":"Umar b. al-Khattab said to the Messenger of Allah (ﷺ), that he became Junbi during the night. The Messenger of Allah (ﷺ) said to him: Perform ablution, wash your sexual organ and then go to sleep.","reference":"Sahih Muslim 306c, Book 3, Hadith 26","question #":"question #3","question":"What is the significance of washing specific parts of the body in Islamic purification rituals?","id":"muslim-3-340"},{"hadith-eng":"I asked 'A'isha about the Witr (prayer) of the Messenger of Allah (ﷺ) and made mention of a hadith, then I said: What did he do after having sexual intercourse? Did he take a bath before going to sleep or did he sleep before taking a bath? She said: He did all these. Some- times he took a bath and then slept, and sometimes he performed ablution only and went to sleep. I (the narrator) said: Praise be to Allah Who has made things easy (for human beings).","reference":"Sahih Muslim 307a, Book 3, Hadith 27","question #":"question #3","question":"What is the significance of performing ablution before sleeping in Islamic tradition?","id":"muslim-3-341"},{"hadith-eng":"This hadith has been transmitted with the same chain of transmitters from Mu'awyia b. Salih by Zuhair b. Harb, 'Abd al-Rahman b. Mahdi, Harun b. Sa'id al-'Aili and Ibn Wahb.","reference":"Sahih Muslim 307b, Book 3, Hadith 28","question #":"question #3","question":"What role do prominent scholars play in the collection and verification of hadiths?","id":"muslim-3-342"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: When anyone amongst you has sexual intercourse with his wife and then he intends to repeat it, he should perform ablution. In the hadith transmitted by Abu Bakr. (the words are):\" Between the two (acts) there should be an ablution,\" or he (the narrator) said:\" Then he intended that it should be repeated.\"","reference":"Sahih Muslim 308, Book 3, Hadith 29","question #":"question #3","question":"What are the recommended practices in Islam for someone who intends to engage in repeated intimate acts with their spouse?","id":"muslim-3-343"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to have sexual intercourse with his wives with a single bath.","reference":"Sahih Muslim 309, Book 3, Hadith 30","question #":"question #3","question":"What are the guidelines for maintaining cleanliness and purity in marital life according to Islamic teachings?","id":"muslim-3-344"},{"hadith-eng":"Umm Sulaim who was the grandmother of Ishaq came to the Messenger of Allah (ﷺ) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: O Umm Sulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressing Umm Sulaim) said: Well, O Umm Sulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream).","reference":"Sahih Muslim 310, Book 3, Hadith 31","question #":"question #3","question":"What is the significance of taking a bath in Islamic jurisprudence after experiencing a nocturnal emission?","id":"muslim-3-345"},{"hadith-eng":"In case a woman sees that, she must take a bath. Umm Sulaim said: I was bashful on account of that and said: Does it happen? Upon this the Messenger of Allah (ﷺ) said: Yes (it does happen), otherwise how can (a child) resemble her? Man's discharge (i. e. sperm) is thick and white and the discharge of woman is thin and yellow; so the resemblance comes from the one whose genes prevail or dominate.","reference":"Sahih Muslim 311, Book 3, Hadith 32","question #":"question #3","question":"What are the differences between the discharges of a man and a woman as described in the hadith?","id":"muslim-3-346"},{"hadith-eng":"A woman asked the Messenger of Allah (way peace be upon him) about a woman who sees in her dream what a man sees in his dream (sexual dream). He (the Holy Prophet) said: If she experiences what a man experiences, she should take a bath.","reference":"Sahih Muslim 312, Book 3, Hadith 33","question #":"question #3","question":"What are the conditions that necessitate a ritual bath in Islam for women?","id":"muslim-3-347"},{"hadith-eng":"Umm Sulaim went to the Messenger of Allah (ﷺ) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (ﷺ) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?","reference":"Sahih Muslim 313a, Book 3, Hadith 34","question #":"question #3","question":"What is the significance of the resemblance between a child and their mother according to Islamic teachings?","id":"muslim-3-348"},{"hadith-eng":"\" You humiliated the women.","reference":"Sahih Muslim 313b, Book 3, Hadith 35","question #":"question #3","question":"What are the implications of addressing gender dynamics in religious discussions?","id":"muslim-3-349"},{"hadith-eng":"Umm Sulaim, the mother of Bani Abu Talha, came to the Messenger of Allah (ﷺ), and a hadith (like that) narrated by Hisham was narrated but for these words. A'isha said: I expressed disapproval to her, saying: Does a woman see a sexual dream?","reference":"Sahih Muslim 314a, Book 3, Hadith 36","question #":"question #3","question":"What role does cultural perception play in understanding and discussing personal experiences in Islam?","id":"muslim-3-350"},{"hadith-eng":"Should a woman wash herself when she sees a sexual dream and sees (the marks) of liquid? He (the Holy Prophet) said: Yes. 'A'isha said to her: May your hand be covered with dust and injured. She narrated: The Messenger of Allah (ﷺ) said: Leave her alone. In what way does the child resemble her but for the fact that when the genes contributed by woman prevail upon those of man, the child resembles the maternal family, and when the genes of man prevail upon those of woman the child resembles the paternal family.","reference":"Sahih Muslim 314b, Book 3, Hadith 37","question #":"question #3","question":"What was the Prophet Muhammad's (ﷺ) response to A'isha's reaction towards the woman's question about sexual dreams?","id":"muslim-3-351"},{"hadith-eng":"While I was standing beside the Messenger of Allah (ﷺ) one of the rabbis of the Jews came and said: Peace be upon you, O Muhammad. I pushed him backwith a push that he was going to fall. Upon this he said: Why do you push me? I said: Why don't you say: O Messenger of Allah? The Jew said: We call him by the name by which he was named by his family. The Messenger of Allah (ﷺ) said: My name is Muhammad with which I was named by my family. The Jew said: I have come to ask you (something). The Messenger of Allah (ﷺ) said: Should that thing be of any benefit to you, if I tell you that? He (the Jew) said: I will lend my ears to it. The Messenger of Allah (ﷺ) drew a line with the help of the stick that he had with him and then said: Ask (whatever you like). Thereupon the Jew said: Where would the human beings be on the Daywhen the earth would change into another earth and the heavens too (would change into other heavens)? The Messenger of Allah (ﷺ) said: They would be in darkness beside the Bridge. He (the Jew) again said: Who amongst people would be the first to cross (this bridge).? He said: They would be the poor amongst the refugees. The Jew said: What would constitute their breakfast when they would enter Paradise? He (the Holy Prophet) replied: A caul of the fish-liver. He (the Jew) said. What would be their food alter this? He (the Holy Prophet) said: A bullockwhich was fed in the different quarters of Paradise would be slaughtered for them. He (the Jew) said: What would be their drink? He (the Holy Prophet) said: They would be given drink from the fountain which is named\" Salsabil\". He (the Jew) said: I have come to ask you about a thing which no one amongst the people on the earth knows except an apostle or one or two men besides him. He (the Holy Prophet) said: Would it benefit you if I tell you that? He (the Jew) said: I would lend ears to that. He then said: I have come to ask you about the child. He (the Holy Prophet) said: The reproductive substance of man is white and that of woman (i. e. ovum central portion) yellow, and when they have sexual intercourse and the male's substance (chromosomes and genes) prevails upon the female's substance (chromosomes and genes), it is the male child that is created by Allah's Decree, and when the substance of the female prevails upon the substance contributed by the male, a female child is formed by the Decree of Allah. The Jew said: What you have said is true; verily you are an Apostle. He then returned and went away. The Messenger of Allah (ﷺ) said: He asked me about such and such things of which I have had no knowledge till Allah gave me that.","reference":"Sahih Muslim 315a, Book 3, Hadith 38","question #":"question #3","question":"How does the hadith describe the process of determining the gender of a child according to Islamic teachings?","id":"muslim-3-352"},{"hadith-eng":"I was sitting beside the Messenger of Allah\" and some other minor alterations.","reference":"Sahih Muslim 315b, Book 3, Hadith 39","question #":"question #3","question":"What is the significance of being in the presence of the Prophet in the context of hadith narration?","id":"muslim-3-353"},{"hadith-eng":"When Allah's Messenger (ﷺ) bathed because of sexual intercourse, he first washed his hands: he then poured water with his right hand on his left hand and washed his private parts. He then performed ablution as is done for prayer'. He then took some water and put his fingers and moved them through the roots of his hair. And when he found that these had been properly mois- tened, then poured three handfuls on his head and then poured water over his body and subsequently washed his feet.","reference":"Sahih Muslim 316a, Book 3, Hadith 40","question #":"question #3","question":"What is the significance of washing the hands and feet during the ghusl process?","id":"muslim-3-354"},{"hadith-eng":"\" washed his feet.\"","reference":"Sahih Muslim 316b, Book 3, Hadith 41","question #":"question #3","question":"Why is it important to note differences in narrations when studying hadiths?","id":"muslim-3-355"},{"hadith-eng":"Hisham narrated it from his father, who narrated it on the authority of 'A'isha that when the Apostle (ﷺ) took a bath because of sexual inter-course, he first washed the palms of his hands three times, and then the whole hadith was transmitted like that based on the authority of Abu Mu'awyia, but no mention is made of the washing of feet.","reference":"Sahih Muslim 316c, Book 3, Hadith 42","question #":"question #3","question":"What are the essential steps involved in performing ghusl as per Islamic tradition?","id":"muslim-3-356"},{"hadith-eng":"'Urwa has narrated it on the authority of 'A'isha that when Allah's Messenger (ﷺ) took a bath because of sexual intercourse, he first washed his hands before dipping one of them into the basin, and then performed ablu- tion as is done for prayer.","reference":"Sahih Muslim 316d, Book 3, Hadith 43","question #":"question #3","question":"What are the similarities and differences between ablution for prayer and ablution during ghusl?","id":"muslim-3-357"},{"hadith-eng":"I placed water near the Messenger of Allah (ﷺ) to take a bath because of sexual intercourse. He washed the palms of his bands twice or thrice and then put his hand In the basin and poured water over his private parts and washed them with his left hand. He then struck his hand against the earth and rubbed it with force and then performed ablution for the prayer and then poured three handfuls of water on his head and then washed his whole body after which he moved aside from that place and washed his feet, and then I brought a towel (so that he may wipe his body). but he returned it.","reference":"Sahih Muslim 317a, Book 3, Hadith 44","question #":"question #3","question":"What is the significance of not using a towel after performing ghusl in Islamic practice?","id":"muslim-3-358"},{"hadith-eng":"\" Pouring of three handfuls of water on the head.\" and in the hadith narrated by Waki' all the features of ablution have been recorded: rinsing (of mouth), snuffing of water (in the nostrils) ; and in the hadith transmitted by Abu Mu'awyia, there is no mention of a towel.","reference":"Sahih Muslim 317b, Book 3, Hadith 45","question #":"question #3","question":"What is the significance of including or excluding the use of a towel in the practice of ablution?","id":"muslim-3-359"},{"hadith-eng":"Ibn Abbas narrated It on the authority of Maimuna that the Messenger of Allah (ﷺ) was given a towel, but he did not rub (his body) with it, but he did like this with water, i. e. he shook it off.","reference":"Sahih Muslim 317c, Book 3, Hadith 46","question #":"question #3","question":"What can be learned from the Prophet's actions regarding simplicity and minimalism in daily practices?","id":"muslim-3-360"},{"hadith-eng":"When the Messenger of Allah (ﷺ) took a bath because of sexual intercourse, he called for a vessel and took a handful of water from it and first (washed) the right side of his head, then left, and then took a handful (of water) and poured it on his head.","reference":"Sahih Muslim 318, Book 3, Hadith 47","question #":"question #3","question":"What significance does the order of washing the right and left sides of the head hold in Islamic purification rituals?","id":"muslim-3-361"},{"hadith-eng":"The Messenger of Allah (ﷺ) washed himself with water from a vessel (measuring seven to eight seers) because of sexual intercourse.","reference":"Sahih Muslim 319a, Book 3, Hadith 48","question #":"question #3","question":"What are the guidelines for performing ghusl according to Islamic tradition?","id":"muslim-3-362"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath from the vessel (which contained seven to eight seers, i. e. fifteen to sixteen pounds) of water And I and he (the Holy Prophet) took a bath from the same vessel. And in the hadith narrated by Sufyan the words are:\" from one vessel\". Qutaiba said: Al-Faraq is three Sa' (a cubic measuring of varying magnitude).","reference":"Sahih Muslim 319b, Book 3, Hadith 49","question #":"question #3","question":"What can be inferred about the communal aspects of bathing in the time of the Prophet from this narration?","id":"muslim-3-363"},{"hadith-eng":"I along with the foster brother of 'A'isha went to her and he asked about the bath of the Apostle (ﷺ) because of sexual intercourse. She called for a vessel equal to a Sa' and she took a bath. and there was a curtain between us and her. She poured water on her head thrice and he (Abu Salama) said: The wives of the Apostle (ﷺ) collectedhair on their heads and these lopped up to ears (and did rot go beyond that).","reference":"Sahih Muslim 320, Book 3, Hadith 50","question #":"question #3","question":"What is the prescribed method of performing a ritual bath after sexual intercourse in Islam?","id":"muslim-3-364"},{"hadith-eng":"I and the Messenger of Allah (ﷺ) took a bath from the same vessel, after sexual intercourse.","reference":"Sahih Muslim 321a, Book 3, Hadith 51","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) personal hygiene practices from this narration?","id":"muslim-3-365"},{"hadith-eng":"Hafsa, daughter of 'Abd al-Rahman b. Abu Bakr, reported that 'A'isha narrated to her that she and the Messenger of Allah (ﷺ) took a bath from the same vessel which contained water equal to three Mudds or thereabout.","reference":"Sahih Muslim 321b, Book 3, Hadith 52","question #":"question #3","question":"What can be inferred about the amount of water used for bathing in the time of the Prophet Muhammad (ﷺ) from this narration?","id":"muslim-3-366"},{"hadith-eng":"I and the Messenger (ﷺ) took a bath from the same vessel and our hands alternated into it in the state that we had had sexual intercourse.","reference":"Sahih Muslim 321c, Book 3, Hadith 53","question #":"question #3","question":"What can be learned about the practices of cleanliness and purification in Islam from this narration?","id":"muslim-3-367"},{"hadith-eng":"I and the Messenger of Allah (ﷺ) took a bath from one vessel which was placed between me and him and he would get ahead of me, so that I would say: Spare (some water for) me, spare (some water for) me; and she said that they had had sexual intercourse.","reference":"Sahih Muslim 321d, Book 3, Hadith 54","question #":"question #3","question":"What can be inferred about the practices of cleanliness and modesty in the context of marital relations from this narration?","id":"muslim-3-368"},{"hadith-eng":"Maimuna (the wife of the Holy Prophet) reported to me that she and the Messenger of Allah (ﷺ) took a bath from one vessel.","reference":"Sahih Muslim 322, Book 3, Hadith 55","question #":"question #3","question":"What can be learned about the Prophet Muhammad's (ﷺ) personal life and interactions with his family from this narration?","id":"muslim-3-369"},{"hadith-eng":"Ibn Abbas reported that the Messenger of Allah (ﷺ) took a bath with the water left over by Maimuna.","reference":"Sahih Muslim 323, Book 3, Hadith 56","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) actions regarding resourcefulness and conservation from this narration?","id":"muslim-3-370"},{"hadith-eng":"Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (ﷺ) took a bath from the same vessel.","reference":"Sahih Muslim 324, Book 3, Hadith 57","question #":"question #3","question":"What can be inferred about the relationship between the Prophet Muhammad (ﷺ) and his wives from this narration?","id":"muslim-3-371"},{"hadith-eng":"Anas reported that the Messenger of Allah (may peace he upon him) took a bath with five Makkuks of water and performed ablution with one Makkuk. Ibn Muthanna has used the words five Makakiyya, and Ibn Mu'adh narrated it from 'Abdullah b. 'Abdullah and he made no mention of Ibn Jabr.","reference":"Sahih Muslim 325a, Book 3, Hadith 58","question #":"question #3","question":"What is the significance of the specific measurements of water used by the Prophet for purification rituals?","id":"muslim-3-372"},{"hadith-eng":"The Apostle of Allah (ﷺ) performed ablution with one Mudd and took bath with a Sa' up to five Mudds.","reference":"Sahih Muslim 325b, Book 3, Hadith 59","question #":"question #3","question":"What are the measurements of a Mudd and a Sa' in Islamic tradition, and how are they used in daily rituals?","id":"muslim-3-373"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath with one Sa` of water because of sexual intercourse and performed ablution with one Mudd.","reference":"Sahih Muslim 326a, Book 3, Hadith 60","question #":"question #3","question":"What are the implications of the Prophet's (ﷺ) actions on the understanding of cleanliness and ritual purity in Islam?","id":"muslim-3-374"},{"hadith-eng":"The Messenger of Allah (ﷺ) took a bath with one Sa' of water and performed ablution with one Mudd (of water) ; and in the hadith narrated by Ibn Hujr the words are: One Mudd sufficed for his (Holy Prophet's) ablution. And Ibn Hujr said that (his Shaikh) Isma'il was much advanced in age, and it was because of this that he could not fully rely on him for this tradition.","reference":"Sahih Muslim 326b, Book 3, Hadith 61","question #":"question #3","question":"What can be inferred about the reliability of narrators in the transmission of hadiths from this account?","id":"muslim-3-375"},{"hadith-eng":"The people contended amongst themselves in the presence of the Messenger of Allah (ﷺ) with regard to bathing. Some of them said: We wash our heads like this and this. Upon this the Messenger (ﷺ) said: As for me I pour three handfuls of water upon my head.","reference":"Sahih Muslim 327a, Book 3, Hadith 62","question #":"question #3","question":"What is the significance of the Prophet Muhammad (ﷺ) specifying the use of three handfuls of water for washing the head?","id":"muslim-3-376"},{"hadith-eng":"I pour water over my head thrice.","reference":"Sahih Muslim 327b, Book 3, Hadith 63","question #":"question #3","question":"What are the key steps involved in the ritual purification process after sexual impurity?","id":"muslim-3-377"},{"hadith-eng":"A delegation of the Thaqif said to the Messenger of Allah (ﷺ): Our land is cold; what about our bathing then? He (the Holy Prophet) said: I pour water thrice over my head.Ibn Salim in his narration reported:\" The delegation of the Thaqif said: Messenger of Allah.\"","reference":"Sahih Muslim 328, Book 3, Hadith 64","question #":"question #3","question":"How many times did the Prophet Muhammad (ﷺ) pour water over his head during bathing?","id":"muslim-3-378"},{"hadith-eng":"When the Messenger of Allah (ﷺ) took a bath because of sexual intercourse, he poured three handfuls of water upon his head. Hasan b. Muhammad said to him (the narrator): My hair is thick. Upon this Jabir observed. I said to him: O son of my brother, the hair of the Messenger of Allah (ﷺ) was thicker than your hair and these were more fine (than yours).","reference":"Sahih Muslim 329, Book 3, Hadith 65","question #":"question #3","question":"How does this narration address concerns about thick hair during ghusl?","id":"muslim-3-379"},{"hadith-eng":"I said: Messenger of Allah, I am a woman who has closely plaited hair on my head; should I undo it for taking a bath, because of sexual intercourse? He (the Holy Prophet) said: No, it is enough for you to throw three handfuls of water on your head and then pour water over yourself, and you shall be purified.","reference":"Sahih Muslim 330a, Book 3, Hadith 66","question #":"question #3","question":"What is the significance of using three handfuls of water in the purification process?","id":"muslim-3-380"},{"hadith-eng":"This hadith has been narrated by Amr al-Naqid, Yazid b. Harun, 'Abd b. Humaid, Abd al-Razzaq, Thauri, Ayyub b. Musa, with the same chain of transmitters. In hadith narrated by Abd al-Razzaq there is a mention of the menstruation and of the sexual intercourse. The rest of the hadith has been transmitted like that of Ibn 'Uyaina.","reference":"Sahih Muslim 330b, Book 3, Hadith 67","question #":"question #3","question":"Why is it important to compare different narrations of the same hadith for a comprehensive understanding?","id":"muslim-3-381"},{"hadith-eng":"\" Should I undo the plait and wash it, because of sexual intercourse?\" and there is no mention of menstruation.","reference":"Sahih Muslim 330c, Book 3, Hadith 68","question #":"question #3","question":"What are the guidelines for maintaining cleanliness and purity in Islam after intimate relations?","id":"muslim-3-382"},{"hadith-eng":"It was conveyed to 'A'isha that 'Abdullah b. 'Amr ordered the women to undo the (plaits) of hair on their heads. She said: How strange it is for Ibn 'Amr that he orders the women to undo the plaits of their head while taking a bath; why does he not order them to shave their beads? I and the Messenger of Allah (ﷺ) took bath from one vessel. I did no more than this that I poured three handfuls of water over my head.","reference":"Sahih Muslim 331, Book 3, Hadith 69","question #":"question #3","question":"What can be inferred about the Prophet Muhammad's (ﷺ) practice of bathing from this narration?","id":"muslim-3-383"},{"hadith-eng":"A woman asked the Messenger of Allah (ﷺ) how to wash herself after menstruation. She mentioned that he taught her how to take bath and then told her to take a piece of cotton with musk and purify herself. She said: How should I purify myself with that? He (the Holy Prophet) said: Praise be to Allah, purify yourself with it, and covered his face, Sufyan b. 'Uyaina gave a demonstration by covering his face (as the Prophet had done). 'A'isha reported: I dragged her to my side for I had understood what the Messenger of Allah (ﷺ) intended and, therefore, said: Apply this cotton with musk to the trace of blood. Ibn 'Umar in his hadith (has mentioned the words of 'A'isha thus): Apply it to the marks of blood.","reference":"Sahih Muslim 332a, Book 3, Hadith 70","question #":"question #3","question":"What is the significance of using musk in the purification process after menstruation?","id":"muslim-3-384"},{"hadith-eng":"A woman asked the Messenger of Allah (ﷺ) how he should wash herself after the menstrual period. He (the Holy Prophet) said: Take a cotton with musk and purity yourself, and the rest of the hadith was narrated like that of Sufyan.","reference":"Sahih Muslim 332b, Book 3, Hadith 71","question #":"question #3","question":"What is the significance of cleanliness and purification in Islamic teachings?","id":"muslim-3-385"},{"hadith-eng":"Asma (daughter of Shakal) asked the Messenger of Allah (ﷺ) about washing after menstruation. He said: Everyone amongst you should use water (mixed with the leaves of) the lote-tree and cleanse herself well, and then pour water on her head and rub it vigorously till it reaches the roots of the hair. Then she should pour water on it. Afterwards she should take a piece of cotton smeared with musk and cleanse herself with it. Asma' said: How should she cleanse herself with the help of that? Upon this he (the Messenger of Allah) observed: Praise be to Allah, she should cleanse herself. 'A'isha said in a subdued tone that she should apply it to the trace of blood. She (Asma) then further asked about bathing after sexual intercourse. He (the Holy Prophet) said: She should take water and cleanse herself well or complete the ablution and then (pour water) on her head and rub it till it reaches the roots of the hair (of her) head and then pour water on her. 'A'isha said: How good are the women of Ansar (helpers) that their shyness does not prevent them from learning religion.","reference":"Sahih Muslim 332c, Book 3, Hadith 72","question #":"question #3","question":"What is the significance of using musk in the purification process after menstruation?","id":"muslim-3-386"},{"hadith-eng":"Cleanse yourself with it, and he covered (his face on account of shyness).","reference":"Sahih Muslim 332d, Book 3, Hadith 73","question #":"question #3","question":"What are the etiquettes of discussing sensitive topics in Islam?","id":"muslim-3-387"},{"hadith-eng":"Asma' b. Shakal came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, how one amongst us should take a bath after the menstruation, and the rest of the hadith is the same and there is no mention of bathing because of sexual intercourse.","reference":"Sahih Muslim 332e, Book 3, Hadith 74","question #":"question #3","question":"What are the differences in the purification rituals for menstruation and other causes in Islamic practice?","id":"muslim-3-388"},{"hadith-eng":"Fatimah b. Abu Hubaish came to the Apostle (ﷺ) and said: I am a woman whose blood keeps flowing (even after the menstruation period). I am never purified; should I, therefore, abandon prayer? He (the Holy Prophet) said: Not at all, for that is only a vein, and is not a menstruation, so when menstruation comes, abandon prayer, and when it ends wash the blood from yourself and then pray.","reference":"Sahih Muslim 333a, Book 3, Hadith 75","question #":"question #3","question":"What steps should a woman take after her menstruation ends to resume her prayers according to Islamic teachings?","id":"muslim-3-389"},{"hadith-eng":"\" There came Fatimah b. Abu Hubaish, b. 'Abd al-Muttalib b. Asad, and she was a woman amongst us,\" and in the hadith of Hammid b. Zaid there is an addition of these words:\" We abandoned mentioning him.\"","reference":"Sahih Muslim 333b, Book 3, Hadith 76","question #":"question #3","question":"How do variations in hadith narrations affect the understanding of Islamic teachings?","id":"muslim-3-390"},{"hadith-eng":"Umm Habiba b. Jahsh thus asked for a verdict from the Messenger of Allah (ﷺ): I am a woman whose blood keeps flowing (after the menstrual period). He (the Holy Prophet) said: That is only a vein, so take a bath and offer prayer; and she took a bath at the time of every prayer. Laith b. Sa'd said: Ibn Shihab made no mention that the Messenger of Allah (ﷺ) had ordered her to take a bath at the time of every prayer, but she did it of her own accord. And in the tradition transmitted by Ibn Rumh there is no mention of Umm Habiba (and there is mention of the daughter of Jahsh only.)","reference":"Sahih Muslim 334a, Book 3, Hadith 77","question #":"question #3","question":"What can be inferred about personal initiative in religious practices from the actions of Umm Habiba b. Jahsh?","id":"muslim-3-391"},{"hadith-eng":"Umm Habiba b. Jahsh who was the sister-in-law of the Messenger of Allah (ﷺ) and the wife of 'Abd al-Rahman b. Auf, remained mustahada for seven years, and she, therefore, asked for the verdict of Shari'ah from the Messenger of Allah (ﷺ) about it The Messenger of Allah (ﷺ) said: This is not menstruation, but (blood from) a vein: so bathe yourself and offer prayer. 'A'isha said: She took a bath in the wash-tub placed in the apartment of her sister Zainab b. Jahsh, till the redness of the blood came over the water. Ibn Shihab said: I narrated it to Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham about it who observed: May Allah have mercy on Hinda! would that she listened to this verdict. By Lord, she wept for not offering prayer.","reference":"Sahih Muslim 334b, Book 3, Hadith 78","question #":"question #3","question":"What can be learned from the emotional response of individuals who miss prayers due to misunderstanding religious rulings?","id":"muslim-3-392"},{"hadith-eng":"Umm Habiba b. Jahsh came to the Messenger of Allah (ﷺ) and she had been a mustahada for seven years, and the rest of the hadith was narrated like that of 'Amr b. al-Harith up to the words:\" There came the redness of the blood over water.\" and nothing was narrated beyond it.","reference":"Sahih Muslim 334c, Book 3, Hadith 79","question #":"question #3","question":"What guidance does Islam provide for women experiencing prolonged non-menstrual bleeding?","id":"muslim-3-393"},{"hadith-eng":"I The daughter of jahsh had been mustabida for seven years,\" and the rest of the hadith is the same (as mentioned above).","reference":"Sahih Muslim 334d, Book 3, Hadith 80","question #":"question #3","question":"What can be inferred about the challenges faced by the daughter of Jahsh from the narration?","id":"muslim-3-394"},{"hadith-eng":"Umm Habiba asked the Messenger of Allah (ﷺ) about the blood (which flows beyond the period of menstruation). 'A'isha said: I saw her wash-tub full of blood. The Messenger of Allah (ﷺ) said: Remain away (from prayer) equal (to the length of time) that your menses prevented you. After this (after the period of usual courses) bathe yourself and offer prayer.","reference":"Sahih Muslim 334e, Book 3, Hadith 81","question #":"question #3","question":"What is the significance of bathing after menstruation in Islamic practice?","id":"muslim-3-395"},{"hadith-eng":"Umm Habiba b. Jahsh who was the spouse of Abd al- Rahman b. Auf made a complaint to the Messenger of Allah (ﷺ) about blood (which flows beyond the menstrual period). He said to her: Remain away (from prayer) equal (to the length of time) that your menstruation holds you back. After this, bathe yourself. And she washed herself before every prayer.","reference":"Sahih Muslim 334f, Book 3, Hadith 82","question #":"question #3","question":"What is the significance of bathing before each prayer for women with non-menstrual bleeding?","id":"muslim-3-396"},{"hadith-eng":"A woman asked 'A'isha: Should one amongst us complete prayers abandoned during the period of menses? 'A'isha said: Are you a Haruriya? When any one of us during the time of the Messenger of Allah (ﷺ) was in her menses (and abandoned prayer) she was not required to complete them.","reference":"Sahih Muslim 335a, Book 3, Hadith 83","question #":"question #3","question":"What is the significance of the term 'Haruriya' in the context of Islamic jurisprudence?","id":"muslim-3-397"},{"hadith-eng":"Should a menstruating woman complete the prayer (abandoned during the menstrual period)? 'A'isha said: Are you a Hurariya? The wives of the Messenger of Allah (ﷺ) have had their monthly courses, (but) did he order them to make compensation (for the abandoned prayers)? Muhammad b. Ja'far said: (Compensation) denotes their completion.","reference":"Sahih Muslim 335b, Book 3, Hadith 84","question #":"question #3","question":"What is the significance of the term 'Hurariya' in the context of Islamic jurisprudence?","id":"muslim-3-398"},{"hadith-eng":"I asked 'A'isha: What is the reason that a menstruating woman completes the fasts (that she abandons during her monthly course). but she does not complete the prayers? She (Hadrat 'A'isha) said: Are you a Haruriya? I said: I am not a Haruriya, but I simply want to inquire. She said: We passed through this (period of menstruation), and we were ordered to complete the fasts, but were not ordered to complete the prayers.","reference":"Sahih Muslim 335c, Book 3, Hadith 85","question #":"question #3","question":"How did Aisha respond to inquiries about religious practices during menstruation?","id":"muslim-3-399"},{"hadith-eng":"I went to the Messenger of Allah (ﷺ) on the day of the conquest (of Mecca) and found him take a bath. while his daughter Fatimah was holding a curtain around him.","reference":"Sahih Muslim 336a, Book 3, Hadith 86","question #":"question #3","question":"What significance does the event of the conquest of Mecca hold in Islamic history?","id":"muslim-3-400"},{"hadith-eng":"It was the day of the conquest (of Mecca) that she went to the Messenger of Allah (ﷺ) and he was staying at a higher part (of that city). The Messenger of Allah (ﷺ) got up for his bath. Fatimah held a curtain around him (in order to provide him privacy). He then put on his garments and wrapped himself with that and then offered eight rak'ahs of the forenoon prayer.","reference":"Sahih Muslim 336b, Book 3, Hadith 87","question #":"question #3","question":"What role did Fatimah play during the Prophet's (ﷺ) bath on the day of the conquest of Mecca?","id":"muslim-3-401"},{"hadith-eng":"His (the Holy Prophet's) daughter Fatimah provided him privacy with the help of his cloth, and when he had taken a bath he took it up and wrapped it around him and then stood and offered eight rak'ahs of the forenoon prayer.","reference":"Sahih Muslim 336c, Book 3, Hadith 88","question #":"question #3","question":"What can be learned about the Prophet's routine and dedication to prayer from this account?","id":"muslim-3-402"},{"hadith-eng":"I placed water for the Apostle (ﷺ) and provided privacy for him, and he took a bath.","reference":"Sahih Muslim 337, Book 3, Hadith 89","question #":"question #3","question":"What are the etiquettes of performing a bath in Islam as demonstrated by the Prophet (ﷺ)?","id":"muslim-3-403"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: A man should not see the private parts of another man, and a woman should not see the private parts of another woman, and a man should not lie with another man under one covering, and a woman should not lie with another woman under one covering.","reference":"Sahih Muslim 338a, Book 3, Hadith 90","question #":"question #3","question":"What are the Islamic principles concerning the exposure of private parts among individuals of the same gender?","id":"muslim-3-404"},{"hadith-eng":"Private parts of man are the nakedness (which is concealed).","reference":"Sahih Muslim 338b, Book 3, Hadith 91","question #":"question #3","question":"What are the implications of concealing one's 'awrah' in Islam?","id":"muslim-3-405"},{"hadith-eng":"By Allah, nothing prohibits Moses to take a bath along with us, but sacrotal hernia. He (Moses) once went for a bath and placed his clothes on a stone and the stone moved on with his clothes. Moses ran after it saying: 0 stone, my clothes,0 stone, my clothes, and Banu Isra'il had the chance to see the private parts of Moses, and said: By Allah, Moses does not suffer from any ailment. The stone then stopped, till Moses had been seen by them, and he then took hold of his clothes and struck the stone. Abu Huraira said: By Allah, there are the marks of six or seven strokes made by Moses on the stone.","reference":"Sahih Muslim 339, Book 3, Hadith 92","question #":"question #3","question":"What lessons can be learned from the reaction of Banu Isra'il towards Prophet Moses in this account?","id":"muslim-3-406"},{"hadith-eng":"When the Ka'ba was constructed the Messenger of Allah (ﷺ) and Abbas went and lifted stones. Abbas said to the Messenger of Allah (ﷺ): Place your lower garment on your shoulder (so that you may protect yourself from the roughness and hardness of stones). He (the Holy Prophet) did this, but fell down upon the ground in a state of unconciousness and his eyes were turned towards the sky. He then stood up and said: My lower garment, my lower garment; and this wrapper was tied around him. In the hadith transmitted by Ibn Rafi', there is the word:\" On his neck\" and he did not say:\" Upon his shoulder.\"","reference":"Sahih Muslim 340a, Book 3, Hadith 93","question #":"question #3","question":"What can be inferred about the Prophet Muhammad's (ﷺ) consciousness and awareness during the construction of the Ka'ba?","id":"muslim-3-407"},{"hadith-eng":"The Messenger of Allah (ﷺ) was carrying along with them (his people) stones for the Ka'ba and there was a waist wrapper around him. His uncle,\" Abbas, said to him: 0 son of my brother! if you take off the lower garment and place it on the shoulders underneath the stones, it would be better. He (the Holy Prophet) took it off and placed it on his shoulder and fell down unconscious. He (the narrator) said: Never was he seen naked after that day.","reference":"Sahih Muslim 340b, Book 3, Hadith 94","question #":"question #3","question":"What significance does this event hold in understanding the Prophet's (ﷺ) character and behavior?","id":"muslim-3-408"},{"hadith-eng":"I was carrying a heavy stone and my lower garment was loose, and it, therefore, slipped off (so soon) that I could not place the stone (on the ground) and carry to its proper place. Upon this the Messenger of Allah (ﷺ) said: Return to your cloth (lower garment), take it (and tie it around your waist) and do not walk naked.","reference":"Sahih Muslim 341, Book 3, Hadith 95","question #":"question #3","question":"What actions should be taken if one's clothing becomes loose or inappropriate in a public setting according to Islamic teachings?","id":"muslim-3-409"},{"hadith-eng":"The Messenger of Allah (ﷺ) one day made me mount behind him and he confided to me something secret which I would not disclose to anybody; and the Messenger of Allah (ﷺ) liked the concealment provided by a lofty place or cluster of dates (while answering the call of nature), Ibn Asma' said in his narration: It implied an enclosure of the date-trees.","reference":"Sahih Muslim 342, Book 3, Hadith 96","question #":"question #3","question":"What practices did the Prophet Muhammad (ﷺ) prefer for maintaining modesty and privacy during natural needs?","id":"muslim-3-410"},{"hadith-eng":"I went to Quba' with the Messenger of Allah (ﷺ) on Monday till we reached (the habitation) of Banu Salim. The Messenger of Allah (ﷺ) stood at the door of 'Itban and called him loudly. So he came out dragging his lower garnment. Upon this the Messenger of Allah (ﷺ) said: We have made this man to make haste 'Itban said: Messenger of Allah, if a man parts with his wife suddenly without seminal emission, what is he required to do (with regard to bath)? The Messenger of Allah (ﷺ) said: It is with the seminal emission that bath becomes obligatory.","reference":"Sahih Muslim 343a, Book 3, Hadith 97","question #":"question #3","question":"What is the significance of seminal emission in determining the obligation of a ritual bath in Islam?","id":"muslim-3-411"},{"hadith-eng":"The Apostle of Allah (ﷺ) observed: Bathing is obligatory in case of seminal emission.","reference":"Sahih Muslim 343b, Book 3, Hadith 98","question #":"question #3","question":"How does seminal emission affect the state of ritual purity in Islam?","id":"muslim-3-412"},{"hadith-eng":"The Messenger of Allah (ﷺ) abrogated some of his commands by others, just as the Qur'an abrogates some part with the other.","reference":"Sahih Muslim 344, Book 3, Hadith 99","question #":"question #3","question":"What is the significance of abrogation in understanding Islamic jurisprudence?","id":"muslim-3-413"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by (the house) of a man amongst the Ansar, and he sent for him. He came out and water was trickling down from his head. Upon this he (the Holy Prophet) said: Perhaps we put you to haste. He said: Yes. Messenger of Allah. He (the Holy Prophet) said: When you made haste or semen is not emitted, bathing is not obligatory for you, but ablution is binding. Ibn Bashshir has narrated it with a minor alteration.","reference":"Sahih Muslim 345, Book 3, Hadith 100","question #":"question #3","question":"What are the conditions under which bathing becomes obligatory in Islamic jurisprudence?","id":"muslim-3-414"},{"hadith-eng":"I arked the Messenger of Allah (ﷺ) about a man who has sexual intercourse with his wife, but leaves her before orgasm. Upon this he (the Holy Prophet) said: He should wash the secretion of his wife, and then perform ablution and ofier prayer.","reference":"Sahih Muslim 346a, Book 3, Hadith 101","question #":"question #3","question":"How does prayer play a role in the purification process after intimate relations?","id":"muslim-3-415"},{"hadith-eng":"If a person has sexual intercourse with his wife, but does not experience orgasm, he should wash his organ and perform an ablution.","reference":"Sahih Muslim 346b, Book 3, Hadith 102","question #":"question #3","question":"What are the steps a person should take to purify themselves after intimate relations according to Islamic teachings?","id":"muslim-3-416"},{"hadith-eng":"What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 347a, Book 3, Hadith 103","question #":"question #3","question":"What did Uthman b. 'Affan report hearing from the Prophet Muhammad (ﷺ) regarding purification after sexual activity?","id":"muslim-3-417"},{"hadith-eng":"Abu Ayyub reported that he had heard like this from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 347b, Book 3, Hadith 104","question #":"question #3","question":"What is the role of a narrator in the transmission of hadiths?","id":"muslim-3-418"},{"hadith-eng":"The Apostle of Allah (ﷺ) said: When a man has sexual intercourse, bathing becomes obligatory (both for the male and the female). In the hadith of Matar the words are: Even if there is no orgasm. Zuhair has narrated it with a minor alteration of words.","reference":"Sahih Muslim 348a, Book 3, Hadith 105","question #":"question #3","question":"How do different narrations of a hadith affect its understanding and application?","id":"muslim-3-419"},{"hadith-eng":"This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words;\" Even if there is no orgasm\" have been omitted.","reference":"Sahih Muslim 348b, Book 3, Hadith 106","question #":"question #3","question":"What is the significance of the chain of transmitters in the authenticity of a hadith?","id":"muslim-3-420"},{"hadith-eng":"There cropped up a difference of opinion between a group of Muhajirs (Emigrants and a group of Ansar (Helpers) (and the point of dispute was) that the Ansar said: The bath (because of sexual intercourse) becomes obligatory only-when the semen spurts out or ejaculates. But the Muhajirs said: When a man has sexual intercourse (with the woman), a bath becomes obligatory (no matter whether or not there is seminal emission or ejaculation). Abu Musa said: Well, I satisfy you on this (issue). He (Abu Musa, the narrator) said: I got up (and went) to 'A'isha and sought her permission and it was granted, and I said to her: 0 Mother, or Mother of the Faithful, I want to ask you about a matter on which I feel shy. She said: Don't feel shy of asking me about a thing which you can ask your mother, who gave you birth, for I am too your mother. Upon this I said: What makes a bath obligatory for a person? She replied: You have come across one well informed! The Messenger of Allah (ﷺ) said: When anyone sits amidst four parts (of the woman) and the circumcised parts touch each other a bath becomes obligatory.","reference":"Sahih Muslim 349, Book 3, Hadith 107","question #":"question #3","question":"What did the Prophet Muhammad (ﷺ) say about the circumstances under which a bath becomes obligatory after sexual relations?","id":"muslim-3-421"},{"hadith-eng":"I and she (the Mother of the Faithful) do it and then take a bath.","reference":"Sahih Muslim 350, Book 3, Hadith 108","question #":"question #3","question":"What are the conditions that necessitate a ritual bath in Islam?","id":"muslim-3-422"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say this: Ablution is obligatory (for one who takes anything) touched by fire.","reference":"Sahih Muslim 351, Book 3, Hadith 109","question #":"question #3","question":"What are the conditions that necessitate ablution according to Islamic teachings?","id":"muslim-3-423"},{"hadith-eng":"I am performing ablution because of having eaten pieces of cheese, for I heard the Messenger of Allah (ﷺ) say: Perform ablution (after eating anything) touched by fire.","reference":"Sahih Muslim 352, Book 3, Hadith 110","question #":"question #3","question":"What are the implications of the Prophet's guidance on ablution for daily life activities?","id":"muslim-3-424"},{"hadith-eng":"The Messenger of Allah (ﷺ) said. Perform ablution (after eating) anything touched by fire.","reference":"Sahih Muslim 353, Book 3, Hadith 111","question #":"question #3","question":"What are the circumstances under which ablution is required according to Islamic tradition?","id":"muslim-3-425"},{"hadith-eng":"The Messenger of Allah (ﷺ) took (meat of) goat's shoulder and offered prayer and did not perform ablution.","reference":"Sahih Muslim 354a, Book 3, Hadith 112","question #":"question #3","question":"What are the conditions under which ablution is required before prayer in Islamic practice?","id":"muslim-3-426"},{"hadith-eng":"The Messenger of Allah (ﷺ) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.","reference":"Sahih Muslim 354b, Book 3, Hadith 113","question #":"question #3","question":"What are the implications of not performing ablution after consuming food in Islamic jurisprudence?","id":"muslim-3-427"},{"hadith-eng":"I saw the Messenger of Allah (ﷺ) take slices from goat's shoulder, and then eat them, and then offer prayer without having performed ablution.","reference":"Sahih Muslim 355a, Book 3, Hadith 114","question #":"question #3","question":"What are the exceptions to performing ablution before prayer according to Islamic teachings?","id":"muslim-3-428"},{"hadith-eng":"I saw the Messenger of Allah (ﷺ) take slices from goat's shoulder and then eat them. He was called for prayer and he got'up, leaving aside the knife, and offered prayer but did not perform ablution.","reference":"Sahih Muslim 355b, Book 3, Hadith 115","question #":"question #3","question":"What does this incident indicate about the Prophet's (ﷺ) practices related to prayer and cleanliness?","id":"muslim-3-429"},{"hadith-eng":"Ibn 'Abbas reported it on the authority of Maimuana, the wife of the Messenger of Allah (ﷺ), that the Messenger of Allah (ﷺ) took (a piece of goat's) shoulder at her place, and then offered prayer but did not perform ablution.","reference":"Sahih Muslim 356a, Book 3, Hadith 116","question #":"question #3","question":"How does the consumption of food affect the validity of one's ablution?","id":"muslim-3-430"},{"hadith-eng":"This hadith has been narrated by Ibn 'Abbas on the authority of Maimuna. the wife of the Apostle (ﷺ), by another chain of transmitters.","reference":"Sahih Muslim 356b, Book 3, Hadith 117","question #":"question #3","question":"How do different chains of transmitters affect the understanding of a hadith?","id":"muslim-3-431"},{"hadith-eng":"I testify that I used to roast the liver of the goat for the Messenger of Allah (may peace be tipcn him) and then he offered praver but did not perform ablution.","reference":"Sahih Muslim 357, Book 3, Hadith 118","question #":"question #3","question":"What can be inferred about the necessity of ablution before prayer from the actions of the Prophet Muhammad (peace be upon him)?","id":"muslim-3-432"},{"hadith-eng":"The Apostle (ﷺ) took milk and then called for water and rinsed (his mouth) and said: It contains greasiness.","reference":"Sahih Muslim 358a, Book 3, Hadith 119","question #":"question #3","question":"What can be learned about the dietary habits of the Prophet Muhammad (ﷺ) from his actions after drinking milk?","id":"muslim-3-433"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters.","reference":"Sahih Muslim 358b, Book 3, Hadith 120","question #":"question #3","question":"What role do different chains of transmitters play in the study of hadith literature?","id":"muslim-3-434"},{"hadith-eng":"The Messenger of Allah (ﷺ) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.","reference":"Sahih Muslim 359a, Book 3, Hadith 121","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) balance daily activities with prayer obligations?","id":"muslim-3-435"},{"hadith-eng":"I was with Ibn 'Abbas, and Ibn 'Abbas saw the Messenger of Allah (ﷺ) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word\" people\" is not mentioned.","reference":"Sahih Muslim 359b, Book 3, Hadith 122","question #":"question #3","question":"What is the significance of eyewitness accounts in the transmission of hadiths?","id":"muslim-3-436"},{"hadith-eng":"A man asked the Messenger of Allah (may peace he upon him) whether he should perform ablution after (eating) mutton. He (the Messenger of Allah) said: Perform ablution it you so desire, and if you do not wish, do not perform it. He (again) asked: Should I perform ablution (after eating) camel's flesh? He said: Yes, perform ablution (after eating) camel's flesh. He (again) said: May I say prayer in the sheepfolds? He (the Messenger of Allah) said: Yes. He (the narrator) again said: May I say prayer where camels lie down? He (the Holy Prophet) said: No.","reference":"Sahih Muslim 360a, Book 3, Hadith 123","question #":"question #3","question":"How does the consumption of camel's flesh affect the requirement for ablution in Islamic practice?","id":"muslim-3-437"},{"hadith-eng":"This hadith is also narrated by another chain of transmitters.","reference":"Sahih Muslim 360b, Book 3, Hadith 124","question #":"question #3","question":"Why is it important to have various sources for a single hadith in Islamic tradition?","id":"muslim-3-438"},{"hadith-eng":"He should not return (from prayer) unless he hears a sound or perceives a smell (of passing wind). Abu Bakr and Zuhair b. Harb have pointed out in their narrations that it was 'Abdullah b. Zaid.","reference":"Sahih Muslim 361, Book 3, Hadith 125","question #":"question #3","question":"How does one determine the validity of their ablution if they suspect it might have been invalidated?","id":"muslim-3-439"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: If any one of you has pain in his abdomen, but is doubtful whether or not anything has issued from him, be should not leave the mosque unless he hears a sound or perceives a smell.","reference":"Sahih Muslim 362, Book 3, Hadith 126","question #":"question #3","question":"What guidance is provided for someone experiencing abdominal discomfort during prayer?","id":"muslim-3-440"},{"hadith-eng":"Why did you not take off its skin? You could put it to use, after tanning it. They (the Companions) said: It was dead. Upon, this he (the Messenger of Allah) said: Only its eating is prohibited. Abu bakr and Ibn Umar in their narrations said: It is narrated from Maimuna (may Allah be pleased with her).","reference":"Sahih Muslim 363a, Book 3, Hadith 127","question #":"question #3","question":"What are the restrictions on consuming the meat of a dead animal in Islam?","id":"muslim-3-441"},{"hadith-eng":"The Messenger of Allah (ﷺ) saw a dead goat, which had been given in charity to the freed slave-girl of Maimuna. The Messenger of Allah (ﷺ) said: Why don't you make use of its skin? They (the Companions around the Holy Prophet) said: It is dead. Upon this he said: It is the eating (of the dead animal) which is prohibited.","reference":"Sahih Muslim 363b, Book 3, Hadith 128","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the use of items from animals that have died naturally?","id":"muslim-3-442"},{"hadith-eng":"This hadith is narrated by Ibn Shihab with the same chain of transmitters as transmitted by Yunus.","reference":"Sahih Muslim 363c, Book 3, Hadith 129","question #":"question #3","question":"How does the consistency of narration by different transmitters affect the reliability of a hadith?","id":"muslim-3-443"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to pass by a goat thrown (away) which had been in fact given to the freed slave-girl of Maimuna as charity. Upon this the Messenger of Allah (way peace he upon him) said: Why did they not get its skin? They had better tan it and make use of it.","reference":"Sahih Muslim 363d, Book 3, Hadith 130","question #":"question #3","question":"What does this narration teach about the importance of resourcefulness and avoiding wastefulness?","id":"muslim-3-444"},{"hadith-eng":"Why did you not take off its skin and make use of that?","reference":"Sahih Muslim 364, Book 3, Hadith 131","question #":"question #3","question":"What does this narration suggest about the permissibility of using parts of a dead animal in Islam?","id":"muslim-3-445"},{"hadith-eng":"The Apostle of Allah (ﷺ) happened to pass by (the dead body) of the goat which belonged to the freed slave-girl of Maimuna and said: Why did you not make use of its skin?","reference":"Sahih Muslim 365, Book 3, Hadith 132","question #":"question #3","question":"What is the significance of making use of available resources in Islamic tradition?","id":"muslim-3-446"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: When the skin is tanned it becomes purified.","reference":"Sahih Muslim 366a, Book 3, Hadith 133","question #":"question #3","question":"What are the implications of using tanned skins in religious practices according to Islamic jurisprudence?","id":"muslim-3-447"},{"hadith-eng":"This hadith has been transmitted on the authority of Ibn 'Abbas by another chain of transmitters.","reference":"Sahih Muslim 366b, Book 3, Hadith 134","question #":"question #3","question":"Why is it important to reference the source and chain of transmitters in hadith literature?","id":"muslim-3-448"},{"hadith-eng":"I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah (ﷺ) about this and he said: Its tanning makes it pure.","reference":"Sahih Muslim 366c, Book 3, Hadith 135","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the use of animal skins from non-Muslim sources?","id":"muslim-3-449"},{"hadith-eng":"I asked 'Abdullah b. 'Abbas saying: We are the inhabitants of the western regions. The Magians come to us with skins full of water and fat. He said: Drink. I said to him: Is it your own opinion? Ibn Abbas said: I heard the Messenger of Allah (ﷺ) say: Tanning purifies it (the skin).","reference":"Sahih Muslim 366d, Book 3, Hadith 136","question #":"question #3","question":"What guidance does Islam provide regarding the use of products from non-Muslim regions?","id":"muslim-3-450"},{"hadith-eng":"We went with the Messenger of Allah (ﷺ) on one of his journeys and when we reached the place Baida' or Dhat al-jaish, my necklace was broken (and fell somewhere). The Messenger of Allah (way peace be upon him) along with other people stayed there for searching it. There was neither any water at that place nor was there any water with them (the Companions of the Holy Prophet). Some persons came to my father Abu Bakr and said: Do you see what 'A'isha has done? She has detained the Messenger of Allah (ﷺ) and persons accompanying him, and there is neither any water here or with them. So Abu Bakr came there and the Messenger of Allah (ﷺ) was sleeping with his head on my thigh. He (Abu Bakr) said: You have detained the Messenger of Allah (ﷺ) and other persons and there is neither water here nor with them. She ('A'isha) said: Abu Bakr scolded me and uttered what Allah wanted him to utter and nudged my hips with his hand. And there was nothing to prevent me from stirring but for the fact that the messenger of Allah (ﷺ) was lying upon my thigh. The Messenger of Allah (ﷺ) slept till it was dawn at a waterless place. So Allah revealed the verses pertaining to tayammum and they (the Prophet and his Companions) performed tayammum. Usaid b. al-Hudair who was one of the leaders said: This is not the first of your blessings,0 Family to Abu Bakr. 'A'isha said: We made the came) stand which was my mount and found the necklace under it.","reference":"Sahih Muslim 367a, Book 3, Hadith 137","question #":"question #3","question":"What role did 'A'isha play in the incident that led to the revelation of the tayammum verses?","id":"muslim-3-451"},{"hadith-eng":"May Allah grant you a good reward! Never has been there an occasion when you were beset with difficulty and Allah did not make you come out of that and made it an occasion of blessing for the Muslims.","reference":"Sahih Muslim 367b, Book 3, Hadith 138","question #":"question #3","question":"What role did 'A'isha play in the revelation of the verses pertaining to tayammum?","id":"muslim-3-452"},{"hadith-eng":"I was sitting in the company of Abdullah and Abu Musa when Abu Musa said: 0 'Abd al-Rahman (kunya of 'Abdullah b. Mas'ud), what would you like a man to do about the prayer if he experiences a seminal emission or has sexual intercourse but does not find water for a month? 'Abdullah said: He should not perform tayammum even if he does not find water for a month. 'Abdullah said: Then what about the verse in Sura Ma'ida:\" If you do not find water, betake yourself to clean dust\"? 'Abdullah said: If they were granted concession on the basis of this verse, there is a possibility that they would perform tayammum with dust on finding water very cold for themselves. Abu Musa said to Abdullah: You have not heard the words of 'Ammar: The Messenger of Allah (ﷺ) sent me on an errand and I had a seminal emission, but could find no water, and rolled myself in dust just as a beast rolls itself. I came to the Messenger of Allah (ﷺ) then and made a mention of that to him and he (the Holy Prophet) said: It would have been enough for you to do thus. Then he struck the ground with his hands once and wiped his right hand with the help of his left hand and the exterior of his palms and his face. 'Abdullah said: Didn't you see that Umar was not fully satisfied with the words of 'Ammar only?","reference":"Sahih Muslim 368a, Book 3, Hadith 139","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) demonstrate the method of performing tayammum?","id":"muslim-3-453"},{"hadith-eng":"He (the Holy Prophet) struck hands upon the earth, and then shook them and then wiped his face and palm.","reference":"Sahih Muslim 368b, Book 3, Hadith 140","question #":"question #3","question":"What are the steps involved in performing tayammum as demonstrated by the Prophet?","id":"muslim-3-454"},{"hadith-eng":"I am (at times) affected by seminal emission but find no water. He ('Umar) told him not to say prayer. 'Ammar then said. Do you remember,0 Commander of the Faithful, when I and you were in a military detachment and we had had a seminal emission and did not find water (for taking bath) and you did not say prayer, but as for myself I rolled in dust and said prayer, and (when it was mentioned before) the Apostle (ﷺ) said: It was enough for you to strike the ground with your hands and then blow (the dust) and then wipe your face and palms. Umar said: 'Ammar, fear Allah. He said: If you so like, I would not narrate it. \nA hadith like this has been transmitted with the same chain of transmitters but for the words: 'Umar said: We hold you responsible for what you claim.\"","reference":"Sahih Muslim 368c, Book 3, Hadith 141","question #":"question #3","question":"What does this narration teach about the flexibility and adaptability of Islamic rituals in different circumstances?","id":"muslim-3-455"},{"hadith-eng":"I have had a seminal emission but I found no water, and the rest of the hadith is the same but with this addition: 'Amr said: 0 Commander of the Faithful, because of the right given to you by Allah over me, if you desire, I would not narrate this hadith to anyone.","reference":"Sahih Muslim 368d, Book 3, Hadith 142","question #":"question #3","question":"What is the significance of narrating hadiths accurately and the conditions under which one might choose not to share them?","id":"muslim-3-456"},{"hadith-eng":"I and 'Abd al-Rahmin b. Yasir, the freed slave of Maimuna, the wife of the Apostle (way peace be upon him). came to the house of Abu'l-Jahm b. al-Harith al-Simma Ansari and he said: The Messenger of Allah (ﷺ) came from the direction of Bi'r Jamal and a man met him; he saluted him but the Messenger of Allah (ﷺ) made no response, till he (the Holy Prophet) came to the wall, wiped his face and hands and then returned his salutations.","reference":"Sahih Muslim 369, Book 3, Hadith 143","question #":"question #3","question":"What can be learned about the etiquette of returning greetings from the actions of the Prophet Muhammad (ﷺ)?","id":"muslim-3-457"},{"hadith-eng":"A person happened to pass by the Messenger of Allah (ﷺ) when he was making water and saluted him, but he did not respond to his salutation.","reference":"Sahih Muslim 370, Book 3, Hadith 144","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) behavior in situations where responding to a greeting is not possible?","id":"muslim-3-458"},{"hadith-eng":"0 Abu Huraira, where were you? He said: Messenger of Allah, you met when I was (sexually) defiled and I did not like to sit in your company before taking a bath. Upon this the Messenger of Allah (ﷺ) said: Hallowed be Allah, verily a believer is never defiled.","reference":"Sahih Muslim 371, Book 3, Hadith 145","question #":"question #3","question":"What actions did Abu Huraira take upon encountering the Prophet while in a state of impurity, and what was the Prophet's response?","id":"muslim-3-459"},{"hadith-eng":"The Messenger of Allah (ﷺ) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.","reference":"Sahih Muslim 372, Book 3, Hadith 146","question #":"question #3","question":"What actions are recommended for a Muslim to maintain cleanliness and purity?","id":"muslim-3-460"},{"hadith-eng":"The Apostle of Allah (ﷺ) used to remember Allah at all moments.","reference":"Sahih Muslim 373, Book 3, Hadith 147","question #":"question #3","question":"How does continuous remembrance of Allah impact a believer's spiritual state?","id":"muslim-3-461"},{"hadith-eng":"The Apostle of Allah (ﷺ) came out of the privy, and he was presented with some food, and the people reminded him about ablution, but he said: Am I to say prayer that I should perform ablution?","reference":"Sahih Muslim 374a, Book 3, Hadith 148","question #":"question #3","question":"How does the practice of ablution relate to the act of prayer in Islam?","id":"muslim-3-462"},{"hadith-eng":"We were with the Messenger of Allah (ﷺ) and he had come out of the privy. Food was presented to him. It was said to him (by the Companions around him): Wouldn't you perform ablution? Upon this he said: Why, am I to say prayer that I should perform ablution?","reference":"Sahih Muslim 374b, Book 3, Hadith 149","question #":"question #3","question":"How does the practice of ablution relate to the act of prayer in Islam?","id":"muslim-3-463"},{"hadith-eng":"The Messenger of Allah (ﷺ) went to the privy and when he came back, he was presented with food. It was said to him; Messenger of Allah, wouldn't you perform ablution. He said: Why, am I to say prayer?","reference":"Sahih Muslim 374c, Book 3, Hadith 150","question #":"question #3","question":"How does the practice of ablution relate to the act of prayer in Islam?","id":"muslim-3-464"},{"hadith-eng":"The Apostle of Allah (ﷺ) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Messenger of Allah (ﷺ) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.","reference":"Sahih Muslim 374d, Book 3, Hadith 151","question #":"question #3","question":"How does the intention to pray influence the requirement of ablution in Islam?","id":"muslim-3-465"},{"hadith-eng":"When the Messenger of Allah (ﷺ) entered the privy, and in the hadith transmitted by Hushaim (the words are): When the Messenger of Allah (ﷺ) entered the lavatory, be used to say: O Allah, I seek refuge in Thee from wicked and noxious things.","reference":"Sahih Muslim 375a, Book 3, Hadith 152","question #":"question #3","question":"What practices did the Prophet Muhammad (ﷺ) follow when entering the privy?","id":"muslim-3-466"},{"hadith-eng":"I seek refuge with Allah from the wicked and noxious things.","reference":"Sahih Muslim 375b, Book 3, Hadith 153","question #":"question #3","question":"What are the benefits of reciting specific supplications for protection in Islam?","id":"muslim-3-467"},{"hadith-eng":"(The people) stood up for prayer and the Messenger of Allah (ﷺ) was whispering to a man, and in the narration of 'Abd al-Warith (the words are): The Apostle of Allah (ﷺ) was having a private conversation with a man, and did not start the prayer till the people dozed off.","reference":"Sahih Muslim 376a, Book 3, Hadith 154","question #":"question #3","question":"What does this incident suggest about the importance of patience and understanding in communal religious practices?","id":"muslim-3-468"},{"hadith-eng":"(The people) stood up for prayer and the Messenger of Allah (ﷺ) was talking in whispers with a man, and he did not discontinue the conversation till his Companions dozed off; he then came and led the prayer.","reference":"Sahih Muslim 376b, Book 3, Hadith 155","question #":"question #3","question":"What does this incident suggest about the flexibility of prayer times in certain situations?","id":"muslim-3-469"},{"hadith-eng":"I heard Anas as saying that the Companion of the Messenger of Allah (ﷺ) dozed off and then offered prayer and did not perform ablution. He (the narrator) said: I asked him if he had actually heard it from Anas. He said: By Allah. yes.","reference":"Sahih Muslim 376c, Book 3, Hadith 156","question #":"question #3","question":"What is the role of eyewitness testimony in confirming religious practices among the companions of the Prophet (ﷺ)?","id":"muslim-3-470"},{"hadith-eng":"(The people) stood up for the night prayer when a man spoke forth: I need to say something. The Apostle of Allah (ﷺ) entered into secret conversation with him, till the people dozed off or some of the people (dozed off), and then they said the prayer.","reference":"Sahih Muslim 376d, Book 3, Hadith 157","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to addressing individual needs during communal worship?","id":"muslim-3-471"}]