[{"hadith-eng":"When any one of you intends to come for Jumu'a prayer, he should take a bath.","reference":"Sahih Muslim 844a, Book 7, Hadith 1","question #":"question #1","question":"What is the significance of taking a bath before attending the Jumu'a prayer?","id":"muslim-7-1"},{"hadith-eng":"He who comes for Jumu'a he should take a bath.","reference":"Sahih Muslim 844b, Book 7, Hadith 2","question #":"question #1","question":"What is the significance of taking a bath before attending the Jumu'a prayer?","id":"muslim-7-2"},{"hadith-eng":"This hadith has been narrated by Ibn Umar by another chain of transmitters.","reference":"Sahih Muslim 844c, Book 7, Hadith 3","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-7-3"},{"hadith-eng":"'Abdullah (b. Umar) reported on the authority of his father that he heard like this from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 844d, Book 7, Hadith 4","question #":"question #1","question":"What is the significance of hearing and transmitting the words of the Prophet (ﷺ) accurately?","id":"muslim-7-4"},{"hadith-eng":"What is this hour (for attending the prayer)? He said: I was busy today and I did not return to my house when I heard the call (to Friday prayer), and I did no more but performed ablution only. Upon this Umar said: just ablution! You know that the Messenger of Allah (ﷺ) commanded (us) to take a bath (on Friday).","reference":"Sahih Muslim 845a, Book 7, Hadith 5","question #":"question #1","question":"What is the significance of attending Friday prayers on time in Islam?","id":"muslim-7-5"},{"hadith-eng":"Umar b. Khattab was delivering a sermon to the people on Friday when 'Uthman b. 'Affan came there. 'Umar hinting to him said: What would become of those persons who come after the call to prayer? Upon this 'Uthman said: Commander of the faithful, I did no more than this that after listening to the call, I performed ablution and came (to the mosque). 'Umar said: Just ablution! Did you not hear the Messenger of Allah (my peace be upon him) say this: When any one of you comes for Jumu'a, he should take a bath.","reference":"Sahih Muslim 845b, Book 7, Hadith 6","question #":"question #1","question":"What is the significance of taking a bath before attending the Jumu'a prayer?","id":"muslim-7-6"},{"hadith-eng":"Taking a bath on Friday is essential for every adult person.","reference":"Sahih Muslim 846a, Book 7, Hadith 7","question #":"question #1","question":"What is the significance of taking a bath on Friday in Islam?","id":"muslim-7-7"},{"hadith-eng":"The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foul smell. A person among them (those who were dressed so) came to the Messenger of Allah (ﷺ) while he was in my house. The Messenger of Allah (may peace he upon him) said to him: Were you to cleanse yourselves on this day.","reference":"Sahih Muslim 847a, Book 7, Hadith 8","question #":"question #1","question":"What is the significance of cleanliness and personal hygiene in preparation for Jumu'a prayer?","id":"muslim-7-8"},{"hadith-eng":"The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday.","reference":"Sahih Muslim 847b, Book 7, Hadith 9","question #":"question #1","question":"What is the significance of taking a bath on Friday in Islam?","id":"muslim-7-9"},{"hadith-eng":"Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady.","reference":"Sahih Muslim 846b, Book 7, Hadith 10","question #":"question #1","question":"What are the recommended practices for personal hygiene on Fridays for Muslims?","id":"muslim-7-10"},{"hadith-eng":"I asked Ibn Abbas it one should apply to oneself perfume or oil which is available with his wife. He (Ibn Abbas) said: I do not know of it.","reference":"Sahih Muslim 848a, Book 7, Hadith 11","question #":"question #1","question":"What is the significance of taking a bath on Friday in Islam?","id":"muslim-7-11"},{"hadith-eng":"This hadith has been narrated by Ibn Juraij with the came chain of transmitters.","reference":"Sahih Muslim 848b, Book 7, Hadith 12","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-7-12"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.","reference":"Sahih Muslim 849, Book 7, Hadith 13","question #":"question #1","question":"What is the significance of taking a bath on Friday in Islam?","id":"muslim-7-13"},{"hadith-eng":"Abu Huraira reported that the Messenger of, Allah (ﷺ) said. He who takes a bath on Friday, the bath which is obligatory after the sexual discharge and then goes (to the mosque), he is like one who offers a she-camel as a sacrifice, and he who comes at the second hour would be like one who offers a cow, and he who comes at the third hour is live one who offers a ram with horns, and he who comes at the fourth hour is like one who offers a hen, and he who comes at the fifth hour is like one who offers an egg. And when the Imam comes out, the angels are also present and listen to the mention of God (the sermon).","reference":"Sahih Muslim 850a, Book 7, Hadith 14","question #":"question #1","question":"What is the significance of taking a bath on Friday before attending the mosque?","id":"muslim-7-14"},{"hadith-eng":"If you (even) ask your companion to be quiet on Friday while the Imam is delivering the sermon, you have in fact talked irrelevance.","reference":"Sahih Muslim 851a, Book 7, Hadith 15","question #":"question #1","question":"What is the significance of maintaining silence during the Friday sermon?","id":"muslim-7-15"},{"hadith-eng":"A hadith like this has been narrated by Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 851b, Book 7, Hadith 16","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-7-16"},{"hadith-eng":"\"Ibrahim bin 'Abdullah bin Qariz.\"","reference":"Sahih Muslim 851c, Book 7, Hadith 17","question #":"question #1","question":"Who is the narrator mentioned in the hadith and what is his significance?","id":"muslim-7-17"},{"hadith-eng":"The same hadith has been narrated by Abu Huraira, but instead of the word laghauta the word laghita has been used. Abu Zinad (one of the narrators) says that laghita is the dialect of Abu Huraira, whereas it is laghauta.","reference":"Sahih Muslim 851d, Book 7, Hadith 18","question #":"question #1","question":"How do dialectical differences among narrators affect the transmission of hadiths?","id":"muslim-7-18"},{"hadith-eng":"There is a time on Friday at which no Muslim servant would pray and would ask Allah for a thing (that is good) but He would give it to him. Qutaiba pointed with the help of his hand that it (the time) is short.","reference":"Sahih Muslim 852a, Book 7, Hadith 19","question #":"question #1","question":"What is the significance of a specific time on Friday for Muslims in terms of prayer and supplication?","id":"muslim-7-19"},{"hadith-eng":"There is a time on Friday at which no Muslim would stand and pray and beg Allah for what Is good but He would give it to him; and he pointed with his hand that (this time) is short and narrow.","reference":"Sahih Muslim 852b, Book 7, Hadith 20","question #":"question #1","question":"What is the significance of a specific time on Friday for Muslims in terms of prayer and supplication?","id":"muslim-7-20"},{"hadith-eng":"A hadith like this has been narrated by Abu Huraira.","reference":"Sahih Muslim 852c, Book 7, Hadith 21","question #":"question #1","question":"Who is the narrator of this hadith?","id":"muslim-7-21"},{"hadith-eng":"This hadith has been narrated by Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 852d, Book 7, Hadith 22","question #":"question #1","question":"Who is the narrator of this hadith and what is the significance of the chain of transmitters in Islamic tradition?","id":"muslim-7-22"},{"hadith-eng":"\"There is a time on Friday at which no Muslim would ask Allah for what is good but He would give it to him.\" And further said: \"This is a very short time.\"","reference":"Sahih Muslim 852e, Book 7, Hadith 23","question #":"question #1","question":"What is the significance of a specific time on Friday for Muslims in terms of supplication?","id":"muslim-7-23"},{"hadith-eng":"\" That time is short.\"","reference":"Sahih Muslim 852f, Book 7, Hadith 24","question #":"question #1","question":"What is the significance of time in the context of Islamic teachings?","id":"muslim-7-24"},{"hadith-eng":"'Abdullah b. Umar said to me: Did you hear anything from your father narrating something from the messenger of Allah (ﷺ) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah (ﷺ) (these words):\" It is between the time when the Imam sits down and the end of the prayer.\"","reference":"Sahih Muslim 853, Book 7, Hadith 25","question #":"question #1","question":"What is the significance of the specific time on Friday mentioned in the narration for making supplications?","id":"muslim-7-25"},{"hadith-eng":"The best day on which the sun has risen is Friday; on it Adam was created, on it he was made to enter Paradise, on it he. was expelled from it.","reference":"Sahih Muslim 854a, Book 7, Hadith 26","question #":"question #1","question":"What significance does Friday hold in Islamic tradition according to the teachings of the Prophet Muhammad (ﷺ)?","id":"muslim-7-26"},{"hadith-eng":"The best day on which the sun has risen is Friday; on it Adam was created. on it he was made to enter Paradise, on it he was expelled from it. And the last hour will take place on no day other than Friday.","reference":"Sahih Muslim 854b, Book 7, Hadith 27","question #":"question #1","question":"What significance does Friday hold in Islamic tradition and history?","id":"muslim-7-27"},{"hadith-eng":"We who are the last shall be the first on the Day of Resurrection, except that every Ummah was given the Book before us and we were given it after them. It was this day which Allah prescribed for us and guided us to it and the people came after us with regard to it, the Jews observing the next day and the Christians the day following that.","reference":"Sahih Muslim 855a, Book 7, Hadith 28","question #":"question #1","question":"What significance does the Day of Resurrection hold for the Muslim Ummah in comparison to other communities?","id":"muslim-7-28"},{"hadith-eng":"We are the last and would be the first on the Day of Resurrection.","reference":"Sahih Muslim 855b, Book 7, Hadith 29","question #":"question #1","question":"What is the significance of the Muslim community being described as the last yet the first on the Day of Resurrection?","id":"muslim-7-29"},{"hadith-eng":"We are the last (but) we would be the first on the Day of Resurrection, and we would be the first to enter Paradise, but that they were given the Book before us and we were given after them. They disagreed and Allah guided us aright on whatever they disagreed regarding the truth. And it was this day of theirs about which they disagreed, but Allah guided us to it, and that is Friday for us; the next day is for the Jews and the day following for the Christians.","reference":"Sahih Muslim 855c, Book 7, Hadith 30","question #":"question #1","question":"What significance does Friday hold in Islam compared to the holy days of other religions?","id":"muslim-7-30"},{"hadith-eng":"We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that.","reference":"Sahih Muslim 855d, Book 7, Hadith 31","question #":"question #1","question":"How does the concept of being the last yet the first on the Day of Resurrection relate to the Muslim Ummah?","id":"muslim-7-31"},{"hadith-eng":"It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".","reference":"Sahih Muslim 856a, Book 7, Hadith 32","question #":"question #1","question":"What significance does Friday hold in Islam compared to other religions' days of worship?","id":"muslim-7-32"},{"hadith-eng":"We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.","reference":"Sahih Muslim 856b, Book 7, Hadith 33","question #":"question #1","question":"What significance does Friday hold in Islamic tradition as a day of prayer and meditation?","id":"muslim-7-33"},{"hadith-eng":"When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.","reference":"Sahih Muslim 850b, Book 7, Hadith 34","question #":"question #1","question":"What is the significance of arriving early for Friday prayers in Islam?","id":"muslim-7-34"},{"hadith-eng":"This hadith has been narrated by Abu Huraira through another chain of transmitters.","reference":"Sahih Muslim 850c, Book 7, Hadith 35","question #":"question #1","question":"Who is the narrator of this hadith and what is the significance of the chain of transmitters in hadith literature?","id":"muslim-7-35"},{"hadith-eng":"There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah.","reference":"Sahih Muslim 850d, Book 7, Hadith 36","question #":"question #1","question":"What is the significance of arriving early for Friday prayer in Islam?","id":"muslim-7-36"},{"hadith-eng":"He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.","reference":"Sahih Muslim 857a, Book 7, Hadith 37","question #":"question #1","question":"What are the benefits of attending the Jumu'a prayer and listening to the sermon attentively?","id":"muslim-7-37"},{"hadith-eng":"He who performed ablution well, then came to Friday prayer, listened (to the sermon), kept silence all (his sins) between that time and the next Friday would be forgiven with three days extra, and he who touched pebbles caused an interruption.","reference":"Sahih Muslim 857b, Book 7, Hadith 38","question #":"question #1","question":"What are the benefits of performing ablution well before attending Friday prayer?","id":"muslim-7-38"},{"hadith-eng":"We used to observe (Jumu'a) prayer with the Messenger of Allah (ﷺ) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian.","reference":"Sahih Muslim 858a, Book 7, Hadith 39","question #":"question #1","question":"What is the significance of the timing of the Jumu'a prayer in Islam?","id":"muslim-7-39"},{"hadith-eng":"that he asked Jabir b. 'Abdullah when the Messenger of Allah (ﷺ) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: \"Till the sun passed the meridian. and the camels used for carrying water (took rest).\"","reference":"Sahih Muslim 858b, Book 7, Hadith 40","question #":"question #1","question":"When did the Prophet Muhammad (ﷺ) typically perform the Jumu'a prayer?","id":"muslim-7-40"},{"hadith-eng":"We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) \"During the lifetime of the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 859, Book 7, Hadith 41","question #":"question #1","question":"What was the routine of the companions of the Prophet (ﷺ) regarding siesta and lunch on Fridays?","id":"muslim-7-41"},{"hadith-eng":"We used to observe the Friday prayer with the Messenger of Allah (ﷺ) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).","reference":"Sahih Muslim 860a, Book 7, Hadith 42","question #":"question #1","question":"What is the significance of the timing of the Friday prayer in Islam?","id":"muslim-7-42"},{"hadith-eng":"We used to observe the Friday prayer with the Messenger of Allah (ﷺ), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).","reference":"Sahih Muslim 860b, Book 7, Hadith 43","question #":"question #1","question":"What does this narration indicate about the timing of the Friday prayer during the Prophet's time?","id":"muslim-7-43"},{"hadith-eng":"Ibn 'Umar said that the Messenger of Allah (ﷺ) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.","reference":"Sahih Muslim 861, Book 7, Hadith 44","question #":"question #1","question":"What is the traditional method of delivering a Friday sermon in Islam?","id":"muslim-7-44"},{"hadith-eng":"The Apostle of Allah (ﷺ) gave two sermons between which he sat, recited the Qur'an and exhorted the people.","reference":"Sahih Muslim 862a, Book 7, Hadith 45","question #":"question #1","question":"What is the significance of delivering sermons in Islam?","id":"muslim-7-45"},{"hadith-eng":"Jabir b. Samura said that the Messenger of Allah (ﷺ) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times.","reference":"Sahih Muslim 862b, Book 7, Hadith 46","question #":"question #1","question":"What is the significance of delivering a sermon while standing in Islamic tradition?","id":"muslim-7-46"},{"hadith-eng":"Jabir b. Abdullah reported that the Apostle (ﷺ) was delivering the sermon on Friday in a standing posture when a caravan from Syria arrived. The people flocked towards it till no one was left (with the Holy Prophet) but twelve persons, and it was on this occasion that this verse in regard to Jumu'a was revealed.\" And when they see merchandise or sport. they break away to it and leave thee standing.\"","reference":"Sahih Muslim 863a, Book 7, Hadith 47","question #":"question #1","question":"What lesson can be learned about prioritizing religious obligations over worldly distractions?","id":"muslim-7-47"},{"hadith-eng":"This hadith has been narrated by Husain with the same chain of transmitters but with this alteration that he did not make mention of the standing position.","reference":"Sahih Muslim 863b, Book 7, Hadith 48","question #":"question #1","question":"How do variations in the narration of hadiths affect their understanding and interpretation?","id":"muslim-7-48"},{"hadith-eng":"I was along with the Messenger of Allah (ﷺ) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed:\" And when they see merchandise or sport away to it, and leave thee standing\" (lxii. 1 1). they break","reference":"Sahih Muslim 863c, Book 7, Hadith 49","question #":"question #1","question":"What lesson can be learned about prioritizing religious obligations over worldly distractions?","id":"muslim-7-49"},{"hadith-eng":"While the Messenger of Allah (ﷺ) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah (ﷺ) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed.\" And when they see merchandise or sport, they break away to it.\"","reference":"Sahih Muslim 863d, Book 7, Hadith 50","question #":"question #1","question":"What lesson can be learned about the priorities of attending the Friday sermon versus engaging in trade or entertainment?","id":"muslim-7-50"},{"hadith-eng":"Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing.\"","reference":"Sahih Muslim 864, Book 7, Hadith 51","question #":"question #1","question":"What is the significance of delivering a sermon while standing in Islamic tradition?","id":"muslim-7-51"},{"hadith-eng":"People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.","reference":"Sahih Muslim 865, Book 7, Hadith 52","question #":"question #1","question":"What are the consequences of neglecting the Friday prayer in Islam?","id":"muslim-7-52"},{"hadith-eng":"I used to pray with the Messenger of Allah (ﷺ) and both his prayer and sermon were of moderate length.","reference":"Sahih Muslim 866a, Book 7, Hadith 53","question #":"question #1","question":"What is the significance of maintaining a moderate length in prayer and sermon in Islam?","id":"muslim-7-53"},{"hadith-eng":"I used to observe prayer with the Messenger of Allah (ﷺ) and his prayer was of moderate length and his sermon too was of moderate length.","reference":"Sahih Muslim 866b, Book 7, Hadith 54","question #":"question #1","question":"What is the significance of maintaining moderation in the length of prayers and sermons in Islam?","id":"muslim-7-54"},{"hadith-eng":"When Allah's Messenger (may peace he upon him) delivered the sermon, his eyes became red, his voice rose, and his anger increased so that he was like one giving a warning against the enemy and saying: \"The enemy has made a morning attack on you and in the evening too.\" He would also say: \"The Last Hour and I have been sent like these two.\" And he would join his forefinger and middle finger; and would further say: \"The best of the speech is embodied in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations; and every innovation is error.\" He would further say:, I am more dear to a Muslim even than his self; and he who left behind property that is for his family; and he who dies under debt or leaves children (in helplessness), the responsibility (of paying his debt and bringing up his children) lies on me.\"","reference":"Sahih Muslim 867a, Book 7, Hadith 55","question #":"question #1","question":"What is the significance of the Prophet's comparison between the Last Hour and his mission?","id":"muslim-7-55"},{"hadith-eng":"I heard Jabir b. 'Abdullah saying that in the sermon of the Messenger of Allah (ﷺ) he praised Allah, lauded Him (and subsequently said [other words] and raised his voice, and the rest of the hadith is the same).","reference":"Sahih Muslim 867b, Book 7, Hadith 56","question #":"question #1","question":"What is the significance of praising and lauding Allah in Islamic sermons?","id":"muslim-7-56"},{"hadith-eng":"He whom Allah guides aright, there is none to mislead him, and he who is led astray, there is none to guide him (aright), and the best of the talk is embodied in the Book of Allah. And the rest of the hadith is the same.","reference":"Sahih Muslim 867c, Book 7, Hadith 57","question #":"question #1","question":"What is the significance of praising and lauding Allah in Islamic sermons?","id":"muslim-7-57"},{"hadith-eng":"Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad (ﷺ) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah (ﷺ) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah (ﷺ) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah (ﷺ) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah (ﷺ) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad.","reference":"Sahih Muslim 868, Book 7, Hadith 58","question #":"question #1","question":"How did the eloquence of the Prophet Muhammad's words impact those who heard them?","id":"muslim-7-58"},{"hadith-eng":"'Ammar delivered to us the sermon. It was short and eloquent. When he (, Ammir) descended (from the pulpit) we said to him: 0 Abd al-Yaqzn, you have delivered a short and eloquent sermon. Would that you had lengthened (the sermon). He said: I have heard the Messenger of Allah (ﷺ) as saying: The lengthening of prayer by a man and the shortness of the sermon is the sign of his understanding (of faith). So lengthen the prayer and shorten the sermon, for there is charm (in precise) expression.","reference":"Sahih Muslim 869, Book 7, Hadith 59","question #":"question #1","question":"What is the significance of delivering a short and eloquent sermon in Islam?","id":"muslim-7-59"},{"hadith-eng":"that a person recited a sermon before the Messenger of Allah (ﷺ) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah (ﷺ) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.","reference":"Sahih Muslim 870, Book 7, Hadith 60","question #":"question #1","question":"What is the significance of accurately conveying the message of obedience to Allah and His Messenger in Islamic teachings?","id":"muslim-7-60"},{"hadith-eng":"0 Malik.\"","reference":"Sahih Muslim 871, Book 7, Hadith 61","question #":"question #1","question":"What is the significance of reciting Qur'anic verses during a sermon or speech in Islam?","id":"muslim-7-61"},{"hadith-eng":"I memorised (surah) \"Qaf, by the glorious Qur'an\" from the mouth of the Messenger of Allah (ﷺ) on Friday for he recited it on the pulpit on every Friday.","reference":"Sahih Muslim 872a, Book 7, Hadith 62","question #":"question #1","question":"What significance does the recitation of Surah Qaf hold in Friday sermons?","id":"muslim-7-62"},{"hadith-eng":"I did not memorise (Surah) Qaf but from the mouth of the Messenger of Allah (ﷺ) as he used to deliver the. sermon along with it on every Friday. She also added: Our oven and that of the Messenger of Allah (ﷺ) was one.","reference":"Sahih Muslim 872b, Book 7, Hadith 63","question #":"question #1","question":"How did the practice of delivering sermons with specific Surahs influence the memorization of the Quran among early Muslims?","id":"muslim-7-63"},{"hadith-eng":"Our oven and that of the Messenger of Allah (ﷺ) was one for two years, or for one year or for a part of a year; and I learnt\" Qaf. By the Glorious Qur'an\" from no other source than the tongue of Allah's Messenger (ﷺ) who used to recite it every Friday on the pulpit when he delivered the sermon to the people.","reference":"Sahih Muslim 873a, Book 7, Hadith 64","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) reciting Surah Qaf during Friday sermons?","id":"muslim-7-64"},{"hadith-eng":"\"Our oven and the oven of the Messenger of Allah (ﷺ) were the same for two years, or for one year and part of a year. And I only learned \"Surah Qaf. By the Glorious Quran\" from the tongue of the Messenger of Allah (ﷺ), who used to recited it every Friday from the Minbar, when he addresses the people.\"","reference":"Sahih Muslim 873b, Book 7, Hadith 65","question #":"question #1","question":"What significance does the recitation of Surah Qaf hold in the Friday sermon?","id":"muslim-7-65"},{"hadith-eng":"Allah, disfigure these hands! I have seen Allah's Messenger (ﷺ) gesture no more than this with his hands, and he pointed with his forefinger.","reference":"Sahih Muslim 873c, Book 7, Hadith 66","question #":"question #1","question":"What is the significance of the Prophet's (ﷺ) gesture with his hands during sermons or prayers?","id":"muslim-7-66"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters on the authority of Husain b. Abd al-Rahman.","reference":"Sahih Muslim 874, Book 7, Hadith 67","question #":"question #1","question":"What is the significance of multiple chains of transmission in the authentication of hadiths?","id":"muslim-7-67"},{"hadith-eng":"So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray.","reference":"Sahih Muslim 875a, Book 7, Hadith 68","question #":"question #1","question":"What is the significance of performing two rak'ahs upon entering the mosque during a sermon?","id":"muslim-7-68"},{"hadith-eng":"This hadith is narrated by Jabir through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs.","reference":"Sahih Muslim 875b, Book 7, Hadith 69","question #":"question #1","question":"What is the significance of performing two rak'ahs in the context of seeking forgiveness?","id":"muslim-7-69"},{"hadith-eng":"Have you observed prayer? He said: No. He (the Holy Prophet) said: Stand and offer the two rak'ahs. According to Qutaiba, the words are:\" He said: Offer two rak'ahs.\"","reference":"Sahih Muslim 875c, Book 7, Hadith 70","question #":"question #1","question":"What is the significance of performing two rak'ahs upon entering the mosque during a sermon?","id":"muslim-7-70"},{"hadith-eng":"Have you offered two rak'ahs? He said: No. Upon this he said: Then observe (them).","reference":"Sahih Muslim 875d, Book 7, Hadith 71","question #":"question #1","question":"What should one do if they enter the mosque while the Friday sermon is being delivered?","id":"muslim-7-71"},{"hadith-eng":"When any one of you comes for the Friday (prayer) and the Imam comes out (from his apartment), (even then) should observe two rak'ahs (of prayer).","reference":"Sahih Muslim 875e, Book 7, Hadith 72","question #":"question #1","question":"What is the significance of performing two rak'ahs of prayer when attending the Friday prayer?","id":"muslim-7-72"},{"hadith-eng":"Have you observed two rak'ahs? He said: No. He (the Holy Prophet) said: Stand and observe them","reference":"Sahih Muslim 875f, Book 7, Hadith 73","question #":"question #1","question":"What is the significance of performing two rak'ahs upon entering the mosque during the Friday sermon?","id":"muslim-7-73"},{"hadith-eng":"Sulaik Ghatafani came on Friday when the Messenger of Allah (ﷺ) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short.","reference":"Sahih Muslim 875g, Book 7, Hadith 74","question #":"question #1","question":"What should a person do upon arriving late to the Friday sermon while the Imam is delivering it?","id":"muslim-7-74"},{"hadith-eng":"I came to the Prophet (ﷺ) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah (ﷺ) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah (ﷺ) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.","reference":"Sahih Muslim 876, Book 7, Hadith 75","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) prioritize teaching and guiding individuals in need of understanding Islam?","id":"muslim-7-75"},{"hadith-eng":"Marwan appointed Abu Huraira as his deputy in Medina and he himself left for Mecca. Abu Huraira led us in the Jumu'a prayer and recited after Surah Jumu'a in the second rak'ah:\" When the hypocrites came to thee\" (Surah 63). I then met Abu Huraira as he came back and said to him: You have recited two surahs which 'Ali b. Abu Talib used to recite in Kufah. Upon this Abu Huraira said: I heard the Messenger of Allah (ﷺ) reciting these two in the Friday (prayer).","reference":"Sahih Muslim 877a, Book 7, Hadith 76","question #":"question #1","question":"What is the significance of reciting specific Surahs during the Jumu'a prayer?","id":"muslim-7-76"},{"hadith-eng":"\" That he recited Surah Jumu'a (lxii.) in the first rak'ah and\" The hypocrites came\" in the second rak'ah.","reference":"Sahih Muslim 877b, Book 7, Hadith 77","question #":"question #1","question":"Which Surahs are recommended to be recited in the Friday prayer according to this narration?","id":"muslim-7-77"},{"hadith-eng":"\" Glorify The name of Thy Lord, the Most High\" (Surah lxxxvii.), and:\" Has there come to thee the news of the overwhelming event\" (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.","reference":"Sahih Muslim 878a, Book 7, Hadith 78","question #":"question #1","question":"What Surahs did the Prophet Muhammad (ﷺ) recite during the 'Id and Friday prayers?","id":"muslim-7-78"},{"hadith-eng":"This hadith has been narrated by Ibrahim b Muhammad b. al-Muntashir with the same chain of transmitters.","reference":"Sahih Muslim 878b, Book 7, Hadith 79","question #":"question #1","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-7-79"},{"hadith-eng":"\" Has there reached...\" (Surah lxxxviii, ).","reference":"Sahih Muslim 878c, Book 7, Hadith 80","question #":"question #1","question":"What Surahs are recommended to be recited during the Friday prayer?","id":"muslim-7-80"},{"hadith-eng":"The Apostle of Allah (ﷺ) used to recite in the morning prayer on Friday Surah\" Alif-Lam-Mim, Tanz'il ul-Sajda\" (Surah xxxii.): Surely there came over the man a time\" (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin.","reference":"Sahih Muslim 879a, Book 7, Hadith 81","question #":"question #1","question":"Which Surahs did the Prophet Muhammad (ﷺ) recite during the Friday morning prayer?","id":"muslim-7-81"},{"hadith-eng":"A hadith like this has been narrated by Sufyan with the same chain of transmitters.","reference":"Sahih Muslim 879b, Book 7, Hadith 82","question #":"question #1","question":"What is the significance of having a consistent chain of transmitters in the narration of hadiths?","id":"muslim-7-82"},{"hadith-eng":"Mukhawwil has narrated this hadith on the authority of Sufyan.","reference":"Sahih Muslim 879c, Book 7, Hadith 83","question #":"question #1","question":"Who is the narrator of this hadith and what is its reference in Sahih Muslim?","id":"muslim-7-83"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) used to recite in the dawn prayer on Friday\" Alif-Lam-Mim, Tanzil\" and\" Surely there came.\"","reference":"Sahih Muslim 880a, Book 7, Hadith 84","question #":"question #1","question":"What specific chapters of the Quran did the Prophet Muhammad (ﷺ) recite during the dawn prayer on Fridays?","id":"muslim-7-84"},{"hadith-eng":"\" Alif-Lam-Mim, Tanzil\" in the first rak'ah, and in the second one:\" Surely there came over the man a time when he was nothing that could be mentioned.\"","reference":"Sahih Muslim 880b, Book 7, Hadith 85","question #":"question #1","question":"What significance do specific Surahs hold when recited during the dawn prayer on Fridays?","id":"muslim-7-85"},{"hadith-eng":"When any one of you observes the Jumu'a prayer (two obligatory rak'ahs in congregation), he should observe four (rak'ahs) afterwards.","reference":"Sahih Muslim 881a, Book 7, Hadith 86","question #":"question #1","question":"What is the significance of performing additional rak'ahs after the Jumu'a prayer?","id":"muslim-7-86"},{"hadith-eng":"When you observe prayer after (the two obligatory rak'ahs) of Jumu'ah, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house).","reference":"Sahih Muslim 881b, Book 7, Hadith 87","question #":"question #1","question":"What is the recommended number of rak'ahs to perform after the Jumu'ah prayer?","id":"muslim-7-87"},{"hadith-eng":"When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded.)","reference":"Sahih Muslim 881c, Book 7, Hadith 88","question #":"question #1","question":"What is the recommended number of rak'ahs to perform after the Jumu'a prayer?","id":"muslim-7-88"},{"hadith-eng":"The Messenger of Allah (may peace be updn him) used to do this.","reference":"Sahih Muslim 882a, Book 7, Hadith 89","question #":"question #1","question":"What is the significance of performing additional prayers at home after the Friday prayer?","id":"muslim-7-89"},{"hadith-eng":"He did not observe (Nafl) prayer after Jumu'a till he went back and observed two rak'ahs in his house. Yahya said: I guess that I uttered these words (before Imam Malik) that he of course observed (them).","reference":"Sahih Muslim 882b, Book 7, Hadith 90","question #":"question #1","question":"What is the significance of performing Nafl prayers at home after Jumu'a prayer?","id":"muslim-7-90"},{"hadith-eng":"Salim narrated on the authority of his father that the Messenger of Allah (ﷺ) used to observe two rak'ahs after Jumu'a.","reference":"Sahih Muslim 882c, Book 7, Hadith 91","question #":"question #1","question":"What is the significance of performing additional prayers after the Jumu'a prayer?","id":"muslim-7-91"},{"hadith-eng":"Yes, I observed the Jumu`a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak`ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu`a prayer, do not observe (Sunan prayer) till you, have talked or gone out, for the Messenger of Allah (ﷺ) had ordered us to do this and not to combine two (types of) prayers without talking or going out.","reference":"Sahih Muslim 883a, Book 7, Hadith 92","question #":"question #1","question":"What is the significance of not combining two types of prayers without talking or going out after Jumu'a prayer?","id":"muslim-7-92"},{"hadith-eng":"When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it.","reference":"Sahih Muslim 883b, Book 7, Hadith 93","question #":"question #1","question":"What actions should be taken by a person after the Imam pronounces the salutation in prayer?","id":"muslim-7-93"},{"hadith-eng":"When any one of you intends to come for Jumu'a prayer, he should take a bath.","reference":"Sahih Muslim 844a, Book 7, Hadith 1","question #":"question #2","question":"How does personal hygiene relate to the preparation for Jumu'a prayer in Islam?","id":"muslim-7-94"},{"hadith-eng":"He who comes for Jumu'a he should take a bath.","reference":"Sahih Muslim 844b, Book 7, Hadith 2","question #":"question #2","question":"How does cleanliness relate to the observance of Jumu'a in Islam?","id":"muslim-7-95"},{"hadith-eng":"This hadith has been narrated by Ibn Umar by another chain of transmitters.","reference":"Sahih Muslim 844c, Book 7, Hadith 3","question #":"question #2","question":"How does the narration by different companions affect the understanding of a hadith?","id":"muslim-7-96"},{"hadith-eng":"'Abdullah (b. Umar) reported on the authority of his father that he heard like this from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 844d, Book 7, Hadith 4","question #":"question #2","question":"How does the chain of narration impact the authenticity of a hadith?","id":"muslim-7-97"},{"hadith-eng":"What is this hour (for attending the prayer)? He said: I was busy today and I did not return to my house when I heard the call (to Friday prayer), and I did no more but performed ablution only. Upon this Umar said: just ablution! You know that the Messenger of Allah (ﷺ) commanded (us) to take a bath (on Friday).","reference":"Sahih Muslim 845a, Book 7, Hadith 5","question #":"question #2","question":"Why is taking a bath on Friday emphasized in Islamic teachings?","id":"muslim-7-98"},{"hadith-eng":"Umar b. Khattab was delivering a sermon to the people on Friday when 'Uthman b. 'Affan came there. 'Umar hinting to him said: What would become of those persons who come after the call to prayer? Upon this 'Uthman said: Commander of the faithful, I did no more than this that after listening to the call, I performed ablution and came (to the mosque). 'Umar said: Just ablution! Did you not hear the Messenger of Allah (my peace be upon him) say this: When any one of you comes for Jumu'a, he should take a bath.","reference":"Sahih Muslim 845b, Book 7, Hadith 6","question #":"question #2","question":"How did Umar ibn Khattab emphasize the importance of punctuality for Jumu'a prayer?","id":"muslim-7-99"},{"hadith-eng":"Taking a bath on Friday is essential for every adult person.","reference":"Sahih Muslim 846a, Book 7, Hadith 7","question #":"question #2","question":"Why is personal hygiene emphasized for adults on Fridays?","id":"muslim-7-100"},{"hadith-eng":"The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foul smell. A person among them (those who were dressed so) came to the Messenger of Allah (ﷺ) while he was in my house. The Messenger of Allah (may peace he upon him) said to him: Were you to cleanse yourselves on this day.","reference":"Sahih Muslim 847a, Book 7, Hadith 8","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) emphasize the importance of presenting oneself well for communal prayers?","id":"muslim-7-101"},{"hadith-eng":"The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday.","reference":"Sahih Muslim 847b, Book 7, Hadith 9","question #":"question #2","question":"How did the lifestyle of early Muslims influence their personal hygiene practices?","id":"muslim-7-102"},{"hadith-eng":"Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady.","reference":"Sahih Muslim 846b, Book 7, Hadith 10","question #":"question #2","question":"How does the use of Miswak relate to the Sunnah of the Prophet Muhammad (ﷺ)?","id":"muslim-7-103"},{"hadith-eng":"I asked Ibn Abbas it one should apply to oneself perfume or oil which is available with his wife. He (Ibn Abbas) said: I do not know of it.","reference":"Sahih Muslim 848a, Book 7, Hadith 11","question #":"question #2","question":"Is it permissible to use perfume or oil belonging to one's spouse for personal grooming?","id":"muslim-7-104"},{"hadith-eng":"This hadith has been narrated by Ibn Juraij with the came chain of transmitters.","reference":"Sahih Muslim 848b, Book 7, Hadith 12","question #":"question #2","question":"How does the reliability of narrators affect the credibility of a hadith?","id":"muslim-7-105"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.","reference":"Sahih Muslim 849, Book 7, Hadith 13","question #":"question #2","question":"How often is a Muslim encouraged to wash their head and body according to Islamic teachings?","id":"muslim-7-106"},{"hadith-eng":"Abu Huraira reported that the Messenger of, Allah (ﷺ) said. He who takes a bath on Friday, the bath which is obligatory after the sexual discharge and then goes (to the mosque), he is like one who offers a she-camel as a sacrifice, and he who comes at the second hour would be like one who offers a cow, and he who comes at the third hour is live one who offers a ram with horns, and he who comes at the fourth hour is like one who offers a hen, and he who comes at the fifth hour is like one who offers an egg. And when the Imam comes out, the angels are also present and listen to the mention of God (the sermon).","reference":"Sahih Muslim 850a, Book 7, Hadith 14","question #":"question #2","question":"How does the timing of arrival at the mosque on Friday affect the reward one receives?","id":"muslim-7-107"},{"hadith-eng":"If you (even) ask your companion to be quiet on Friday while the Imam is delivering the sermon, you have in fact talked irrelevance.","reference":"Sahih Muslim 851a, Book 7, Hadith 15","question #":"question #2","question":"Why is speaking during the Friday sermon considered inappropriate?","id":"muslim-7-108"},{"hadith-eng":"A hadith like this has been narrated by Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 851b, Book 7, Hadith 16","question #":"question #2","question":"How does the consistency of a hadith across different narrators affect its reliability?","id":"muslim-7-109"},{"hadith-eng":"\"Ibrahim bin 'Abdullah bin Qariz.\"","reference":"Sahih Muslim 851c, Book 7, Hadith 17","question #":"question #2","question":"What is the importance of accurate chain of narration in hadith transmission?","id":"muslim-7-110"},{"hadith-eng":"The same hadith has been narrated by Abu Huraira, but instead of the word laghauta the word laghita has been used. Abu Zinad (one of the narrators) says that laghita is the dialect of Abu Huraira, whereas it is laghauta.","reference":"Sahih Muslim 851d, Book 7, Hadith 18","question #":"question #2","question":"What is the significance of understanding different dialects in the context of hadith narration?","id":"muslim-7-111"},{"hadith-eng":"There is a time on Friday at which no Muslim servant would pray and would ask Allah for a thing (that is good) but He would give it to him. Qutaiba pointed with the help of his hand that it (the time) is short.","reference":"Sahih Muslim 852a, Book 7, Hadith 19","question #":"question #2","question":"How does the concept of a short, special time on Friday influence a Muslim's approach to making dua?","id":"muslim-7-112"},{"hadith-eng":"There is a time on Friday at which no Muslim would stand and pray and beg Allah for what Is good but He would give it to him; and he pointed with his hand that (this time) is short and narrow.","reference":"Sahih Muslim 852b, Book 7, Hadith 20","question #":"question #2","question":"How does the concept of a short and narrow time period relate to the acceptance of prayers on Friday?","id":"muslim-7-113"},{"hadith-eng":"A hadith like this has been narrated by Abu Huraira.","reference":"Sahih Muslim 852c, Book 7, Hadith 21","question #":"question #2","question":"What is the significance of Abu Huraira in the collection of hadiths?","id":"muslim-7-114"},{"hadith-eng":"This hadith has been narrated by Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 852d, Book 7, Hadith 22","question #":"question #2","question":"What is the role of Abu Huraira in the transmission of hadiths?","id":"muslim-7-115"},{"hadith-eng":"\"There is a time on Friday at which no Muslim would ask Allah for what is good but He would give it to him.\" And further said: \"This is a very short time.\"","reference":"Sahih Muslim 852e, Book 7, Hadith 23","question #":"question #2","question":"How does the concept of a special time on Friday reflect the mercy and generosity of Allah?","id":"muslim-7-116"},{"hadith-eng":"\" That time is short.\"","reference":"Sahih Muslim 852f, Book 7, Hadith 24","question #":"question #2","question":"How does the brevity of time influence a Muslim's daily practices and priorities?","id":"muslim-7-117"},{"hadith-eng":"'Abdullah b. Umar said to me: Did you hear anything from your father narrating something from the messenger of Allah (ﷺ) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah (ﷺ) (these words):\" It is between the time when the Imam sits down and the end of the prayer.\"","reference":"Sahih Muslim 853, Book 7, Hadith 25","question #":"question #2","question":"How does the timing of the Imam's actions during Friday prayers relate to the acceptance of prayers?","id":"muslim-7-118"},{"hadith-eng":"The best day on which the sun has risen is Friday; on it Adam was created, on it he was made to enter Paradise, on it he. was expelled from it.","reference":"Sahih Muslim 854a, Book 7, Hadith 26","question #":"question #2","question":"What are the key events associated with the creation and life of Adam in Islamic belief?","id":"muslim-7-119"},{"hadith-eng":"The best day on which the sun has risen is Friday; on it Adam was created. on it he was made to enter Paradise, on it he was expelled from it. And the last hour will take place on no day other than Friday.","reference":"Sahih Muslim 854b, Book 7, Hadith 27","question #":"question #2","question":"What events related to Adam are associated with Friday according to Islamic teachings?","id":"muslim-7-120"},{"hadith-eng":"We who are the last shall be the first on the Day of Resurrection, except that every Ummah was given the Book before us and we were given it after them. It was this day which Allah prescribed for us and guided us to it and the people came after us with regard to it, the Jews observing the next day and the Christians the day following that.","reference":"Sahih Muslim 855a, Book 7, Hadith 28","question #":"question #2","question":"How does the sequence of receiving divine scriptures differ among Muslims, Jews, and Christians?","id":"muslim-7-121"},{"hadith-eng":"We are the last and would be the first on the Day of Resurrection.","reference":"Sahih Muslim 855b, Book 7, Hadith 29","question #":"question #2","question":"How does the concept of being the last and the first relate to the status of the Muslim Ummah in Islamic eschatology?","id":"muslim-7-122"},{"hadith-eng":"We are the last (but) we would be the first on the Day of Resurrection, and we would be the first to enter Paradise, but that they were given the Book before us and we were given after them. They disagreed and Allah guided us aright on whatever they disagreed regarding the truth. And it was this day of theirs about which they disagreed, but Allah guided us to it, and that is Friday for us; the next day is for the Jews and the day following for the Christians.","reference":"Sahih Muslim 855c, Book 7, Hadith 30","question #":"question #2","question":"How does Islam view the guidance provided by Allah in matters of religious disagreement?","id":"muslim-7-123"},{"hadith-eng":"We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that.","reference":"Sahih Muslim 855d, Book 7, Hadith 31","question #":"question #2","question":"What significance does the disagreement among previous religious communities have in the context of the prescribed day of worship?","id":"muslim-7-124"},{"hadith-eng":"It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".","reference":"Sahih Muslim 856a, Book 7, Hadith 32","question #":"question #2","question":"How does the concept of being the last Ummah in this world but the first to be judged on the Day of Resurrection reflect on the Muslim community?","id":"muslim-7-125"},{"hadith-eng":"We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.","reference":"Sahih Muslim 856b, Book 7, Hadith 33","question #":"question #2","question":"How does the guidance to Friday as a day of worship differentiate Muslims from previous communities?","id":"muslim-7-126"},{"hadith-eng":"When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.","reference":"Sahih Muslim 850b, Book 7, Hadith 34","question #":"question #2","question":"How do angels participate in the Friday prayer according to Islamic teachings?","id":"muslim-7-127"},{"hadith-eng":"This hadith has been narrated by Abu Huraira through another chain of transmitters.","reference":"Sahih Muslim 850c, Book 7, Hadith 35","question #":"question #2","question":"What is the importance of verifying the authenticity of a hadith through multiple chains of transmission?","id":"muslim-7-128"},{"hadith-eng":"There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah.","reference":"Sahih Muslim 850d, Book 7, Hadith 36","question #":"question #2","question":"How are the rewards for attending Friday prayer described in terms of sacrificial offerings?","id":"muslim-7-129"},{"hadith-eng":"He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.","reference":"Sahih Muslim 857a, Book 7, Hadith 37","question #":"question #2","question":"How does performing specific acts before and during Jumu'a prayer contribute to the forgiveness of sins?","id":"muslim-7-130"},{"hadith-eng":"He who performed ablution well, then came to Friday prayer, listened (to the sermon), kept silence all (his sins) between that time and the next Friday would be forgiven with three days extra, and he who touched pebbles caused an interruption.","reference":"Sahih Muslim 857b, Book 7, Hadith 38","question #":"question #2","question":"How does listening to the Friday sermon and maintaining silence impact the forgiveness of sins?","id":"muslim-7-131"},{"hadith-eng":"We used to observe (Jumu'a) prayer with the Messenger of Allah (ﷺ) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian.","reference":"Sahih Muslim 858a, Book 7, Hadith 39","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) manage their daily activities around the Jumu'a prayer?","id":"muslim-7-132"},{"hadith-eng":"that he asked Jabir b. 'Abdullah when the Messenger of Allah (ﷺ) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: \"Till the sun passed the meridian. and the camels used for carrying water (took rest).\"","reference":"Sahih Muslim 858b, Book 7, Hadith 40","question #":"question #2","question":"What activities did the companions engage in after the Jumu'a prayer?","id":"muslim-7-133"},{"hadith-eng":"We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) \"During the lifetime of the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 859, Book 7, Hadith 41","question #":"question #2","question":"How did the timing of Friday prayers affect daily activities during the Prophet's (ﷺ) time?","id":"muslim-7-134"},{"hadith-eng":"We used to observe the Friday prayer with the Messenger of Allah (ﷺ) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).","reference":"Sahih Muslim 860a, Book 7, Hadith 42","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) manage the heat after attending the Friday prayer?","id":"muslim-7-135"},{"hadith-eng":"We used to observe the Friday prayer with the Messenger of Allah (ﷺ), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).","reference":"Sahih Muslim 860b, Book 7, Hadith 43","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) manage the heat after attending the Friday prayer?","id":"muslim-7-136"},{"hadith-eng":"Ibn 'Umar said that the Messenger of Allah (ﷺ) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.","reference":"Sahih Muslim 861, Book 7, Hadith 44","question #":"question #2","question":"How is the structure of the Friday sermon described in Islamic tradition?","id":"muslim-7-137"},{"hadith-eng":"The Apostle of Allah (ﷺ) gave two sermons between which he sat, recited the Qur'an and exhorted the people.","reference":"Sahih Muslim 862a, Book 7, Hadith 45","question #":"question #2","question":"How does the practice of sitting between two sermons reflect on the method of delivering religious teachings?","id":"muslim-7-138"},{"hadith-eng":"Jabir b. Samura said that the Messenger of Allah (ﷺ) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times.","reference":"Sahih Muslim 862b, Book 7, Hadith 46","question #":"question #2","question":"How does the practice of delivering sermons reflect the Prophet's (ﷺ) approach to teaching and communication?","id":"muslim-7-139"},{"hadith-eng":"Jabir b. Abdullah reported that the Apostle (ﷺ) was delivering the sermon on Friday in a standing posture when a caravan from Syria arrived. The people flocked towards it till no one was left (with the Holy Prophet) but twelve persons, and it was on this occasion that this verse in regard to Jumu'a was revealed.\" And when they see merchandise or sport. they break away to it and leave thee standing.\"","reference":"Sahih Muslim 863a, Book 7, Hadith 47","question #":"question #2","question":"How did the arrival of a caravan during the Prophet's sermon impact the congregation's behavior?","id":"muslim-7-140"},{"hadith-eng":"This hadith has been narrated by Husain with the same chain of transmitters but with this alteration that he did not make mention of the standing position.","reference":"Sahih Muslim 863b, Book 7, Hadith 48","question #":"question #2","question":"What is the significance of the chain of transmitters in the authentication of hadiths?","id":"muslim-7-141"},{"hadith-eng":"I was along with the Messenger of Allah (ﷺ) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed:\" And when they see merchandise or sport away to it, and leave thee standing\" (lxii. 1 1). they break","reference":"Sahih Muslim 863c, Book 7, Hadith 49","question #":"question #2","question":"How did the arrival of a caravan during a Friday gathering impact the companions of the Prophet (ﷺ)?","id":"muslim-7-142"},{"hadith-eng":"While the Messenger of Allah (ﷺ) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah (ﷺ) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed.\" And when they see merchandise or sport, they break away to it.\"","reference":"Sahih Muslim 863d, Book 7, Hadith 50","question #":"question #2","question":"How did the actions of the Companions during the Friday sermon lead to the revelation of a specific verse in the Quran?","id":"muslim-7-143"},{"hadith-eng":"Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing.\"","reference":"Sahih Muslim 864, Book 7, Hadith 51","question #":"question #2","question":"How does the behavior of leaving a sermon for worldly distractions reflect on one's priorities in Islam?","id":"muslim-7-144"},{"hadith-eng":"People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.","reference":"Sahih Muslim 865, Book 7, Hadith 52","question #":"question #2","question":"How does neglecting religious duties affect a person's spiritual state according to Islamic teachings?","id":"muslim-7-145"},{"hadith-eng":"I used to pray with the Messenger of Allah (ﷺ) and both his prayer and sermon were of moderate length.","reference":"Sahih Muslim 866a, Book 7, Hadith 53","question #":"question #2","question":"How does the practice of moderation in religious rituals impact the congregation?","id":"muslim-7-146"},{"hadith-eng":"I used to observe prayer with the Messenger of Allah (ﷺ) and his prayer was of moderate length and his sermon too was of moderate length.","reference":"Sahih Muslim 866b, Book 7, Hadith 54","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) exemplify balance in religious practices such as prayer and sermon delivery?","id":"muslim-7-147"},{"hadith-eng":"When Allah's Messenger (may peace he upon him) delivered the sermon, his eyes became red, his voice rose, and his anger increased so that he was like one giving a warning against the enemy and saying: \"The enemy has made a morning attack on you and in the evening too.\" He would also say: \"The Last Hour and I have been sent like these two.\" And he would join his forefinger and middle finger; and would further say: \"The best of the speech is embodied in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations; and every innovation is error.\" He would further say:, I am more dear to a Muslim even than his self; and he who left behind property that is for his family; and he who dies under debt or leaves children (in helplessness), the responsibility (of paying his debt and bringing up his children) lies on me.\"","reference":"Sahih Muslim 867a, Book 7, Hadith 55","question #":"question #2","question":"Why is the Book of Allah considered the best speech and the guidance of Muhammad the best guidance?","id":"muslim-7-148"},{"hadith-eng":"I heard Jabir b. 'Abdullah saying that in the sermon of the Messenger of Allah (ﷺ) he praised Allah, lauded Him (and subsequently said [other words] and raised his voice, and the rest of the hadith is the same).","reference":"Sahih Muslim 867b, Book 7, Hadith 56","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) deliver his sermons to effectively convey his message?","id":"muslim-7-149"},{"hadith-eng":"He whom Allah guides aright, there is none to mislead him, and he who is led astray, there is none to guide him (aright), and the best of the talk is embodied in the Book of Allah. And the rest of the hadith is the same.","reference":"Sahih Muslim 867c, Book 7, Hadith 57","question #":"question #2","question":"How does divine guidance and misguidance relate to human free will in Islamic teachings?","id":"muslim-7-150"},{"hadith-eng":"Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad (ﷺ) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah (ﷺ) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah (ﷺ) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah (ﷺ) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah (ﷺ) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad.","reference":"Sahih Muslim 868, Book 7, Hadith 58","question #":"question #2","question":"What role does allegiance play in the acceptance of Islam according to the interactions between the Prophet and others?","id":"muslim-7-151"},{"hadith-eng":"'Ammar delivered to us the sermon. It was short and eloquent. When he (, Ammir) descended (from the pulpit) we said to him: 0 Abd al-Yaqzn, you have delivered a short and eloquent sermon. Would that you had lengthened (the sermon). He said: I have heard the Messenger of Allah (ﷺ) as saying: The lengthening of prayer by a man and the shortness of the sermon is the sign of his understanding (of faith). So lengthen the prayer and shorten the sermon, for there is charm (in precise) expression.","reference":"Sahih Muslim 869, Book 7, Hadith 59","question #":"question #2","question":"How does the length of a prayer and sermon reflect a person's understanding of faith?","id":"muslim-7-152"},{"hadith-eng":"that a person recited a sermon before the Messenger of Allah (ﷺ) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah (ﷺ) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.","reference":"Sahih Muslim 870, Book 7, Hadith 60","question #":"question #2","question":"How does the choice of words impact the effectiveness of delivering a sermon in Islam?","id":"muslim-7-153"},{"hadith-eng":"0 Malik.\"","reference":"Sahih Muslim 871, Book 7, Hadith 61","question #":"question #2","question":"How does the practice of reciting Qur'anic verses in public gatherings impact the listeners?","id":"muslim-7-154"},{"hadith-eng":"I memorised (surah) \"Qaf, by the glorious Qur'an\" from the mouth of the Messenger of Allah (ﷺ) on Friday for he recited it on the pulpit on every Friday.","reference":"Sahih Muslim 872a, Book 7, Hadith 62","question #":"question #2","question":"How can regular recitation of specific Quranic chapters impact memorization and understanding?","id":"muslim-7-155"},{"hadith-eng":"I did not memorise (Surah) Qaf but from the mouth of the Messenger of Allah (ﷺ) as he used to deliver the. sermon along with it on every Friday. She also added: Our oven and that of the Messenger of Allah (ﷺ) was one.","reference":"Sahih Muslim 872b, Book 7, Hadith 63","question #":"question #2","question":"What significance does the shared living arrangement between the Prophet Muhammad (ﷺ) and his companions have in understanding their daily lives?","id":"muslim-7-156"},{"hadith-eng":"Our oven and that of the Messenger of Allah (ﷺ) was one for two years, or for one year or for a part of a year; and I learnt\" Qaf. By the Glorious Qur'an\" from no other source than the tongue of Allah's Messenger (ﷺ) who used to recite it every Friday on the pulpit when he delivered the sermon to the people.","reference":"Sahih Muslim 873a, Book 7, Hadith 64","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) learn the Quran from him?","id":"muslim-7-157"},{"hadith-eng":"\"Our oven and the oven of the Messenger of Allah (ﷺ) were the same for two years, or for one year and part of a year. And I only learned \"Surah Qaf. By the Glorious Quran\" from the tongue of the Messenger of Allah (ﷺ), who used to recited it every Friday from the Minbar, when he addresses the people.\"","reference":"Sahih Muslim 873b, Book 7, Hadith 65","question #":"question #2","question":"How did the proximity to the Prophet's household influence the learning of the Quran?","id":"muslim-7-158"},{"hadith-eng":"Allah, disfigure these hands! I have seen Allah's Messenger (ﷺ) gesture no more than this with his hands, and he pointed with his forefinger.","reference":"Sahih Muslim 873c, Book 7, Hadith 66","question #":"question #2","question":"How should one properly raise their hands during supplication or religious speeches according to Islamic teachings?","id":"muslim-7-159"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters on the authority of Husain b. Abd al-Rahman.","reference":"Sahih Muslim 874, Book 7, Hadith 67","question #":"question #2","question":"How does the presence of different narrators affect the credibility of a hadith?","id":"muslim-7-160"},{"hadith-eng":"So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray.","reference":"Sahih Muslim 875a, Book 7, Hadith 68","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) emphasize the importance of prayer even during a sermon?","id":"muslim-7-161"},{"hadith-eng":"This hadith is narrated by Jabir through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs.","reference":"Sahih Muslim 875b, Book 7, Hadith 69","question #":"question #2","question":"How do variations in hadith transmission affect the understanding of religious practices?","id":"muslim-7-162"},{"hadith-eng":"Have you observed prayer? He said: No. He (the Holy Prophet) said: Stand and offer the two rak'ahs. According to Qutaiba, the words are:\" He said: Offer two rak'ahs.\"","reference":"Sahih Muslim 875c, Book 7, Hadith 70","question #":"question #2","question":"How should one respond if they have not prayed upon entering the mosque while a sermon is being delivered?","id":"muslim-7-163"},{"hadith-eng":"Have you offered two rak'ahs? He said: No. Upon this he said: Then observe (them).","reference":"Sahih Muslim 875d, Book 7, Hadith 71","question #":"question #2","question":"What is the significance of performing two rak'ahs upon entering the mosque during the Friday sermon?","id":"muslim-7-164"},{"hadith-eng":"When any one of you comes for the Friday (prayer) and the Imam comes out (from his apartment), (even then) should observe two rak'ahs (of prayer).","reference":"Sahih Muslim 875e, Book 7, Hadith 72","question #":"question #2","question":"What should a person do if they arrive for the Friday prayer and the Imam has already come out?","id":"muslim-7-165"},{"hadith-eng":"Have you observed two rak'ahs? He said: No. He (the Holy Prophet) said: Stand and observe them","reference":"Sahih Muslim 875f, Book 7, Hadith 73","question #":"question #2","question":"How should one behave upon entering the mosque if the Friday sermon has already started?","id":"muslim-7-166"},{"hadith-eng":"Sulaik Ghatafani came on Friday when the Messenger of Allah (ﷺ) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short.","reference":"Sahih Muslim 875g, Book 7, Hadith 74","question #":"question #2","question":"What is the significance of performing two rak'ahs when arriving at the mosque during the Friday sermon?","id":"muslim-7-167"},{"hadith-eng":"I came to the Prophet (ﷺ) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah (ﷺ) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah (ﷺ) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.","reference":"Sahih Muslim 876, Book 7, Hadith 75","question #":"question #2","question":"What does this incident reveal about the Prophet's (ﷺ) approach to delivering sermons and addressing individual concerns?","id":"muslim-7-168"},{"hadith-eng":"Marwan appointed Abu Huraira as his deputy in Medina and he himself left for Mecca. Abu Huraira led us in the Jumu'a prayer and recited after Surah Jumu'a in the second rak'ah:\" When the hypocrites came to thee\" (Surah 63). I then met Abu Huraira as he came back and said to him: You have recited two surahs which 'Ali b. Abu Talib used to recite in Kufah. Upon this Abu Huraira said: I heard the Messenger of Allah (ﷺ) reciting these two in the Friday (prayer).","reference":"Sahih Muslim 877a, Book 7, Hadith 76","question #":"question #2","question":"How did Abu Huraira justify his choice of Surahs during the Friday prayer?","id":"muslim-7-169"},{"hadith-eng":"\" That he recited Surah Jumu'a (lxii.) in the first rak'ah and\" The hypocrites came\" in the second rak'ah.","reference":"Sahih Muslim 877b, Book 7, Hadith 77","question #":"question #2","question":"What is the significance of reciting Surah Jumu'a during the Friday prayer?","id":"muslim-7-170"},{"hadith-eng":"\" Glorify The name of Thy Lord, the Most High\" (Surah lxxxvii.), and:\" Has there come to thee the news of the overwhelming event\" (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.","reference":"Sahih Muslim 878a, Book 7, Hadith 78","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle the situation when 'Id and Jumu'a prayers coincided on the same day?","id":"muslim-7-171"},{"hadith-eng":"This hadith has been narrated by Ibrahim b Muhammad b. al-Muntashir with the same chain of transmitters.","reference":"Sahih Muslim 878b, Book 7, Hadith 79","question #":"question #2","question":"How does the consistency of narration impact the reliability of a hadith?","id":"muslim-7-172"},{"hadith-eng":"\" Has there reached...\" (Surah lxxxviii, ).","reference":"Sahih Muslim 878c, Book 7, Hadith 80","question #":"question #2","question":"What is the significance of reciting specific Surahs during the Friday prayer?","id":"muslim-7-173"},{"hadith-eng":"The Apostle of Allah (ﷺ) used to recite in the morning prayer on Friday Surah\" Alif-Lam-Mim, Tanz'il ul-Sajda\" (Surah xxxii.): Surely there came over the man a time\" (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin.","reference":"Sahih Muslim 879a, Book 7, Hadith 81","question #":"question #2","question":"What Surahs are recommended to be recited during the Jumu'a prayer?","id":"muslim-7-174"},{"hadith-eng":"A hadith like this has been narrated by Sufyan with the same chain of transmitters.","reference":"Sahih Muslim 879b, Book 7, Hadith 82","question #":"question #2","question":"How does the consistency in the chain of transmitters affect the authenticity of a hadith?","id":"muslim-7-175"},{"hadith-eng":"Mukhawwil has narrated this hadith on the authority of Sufyan.","reference":"Sahih Muslim 879c, Book 7, Hadith 83","question #":"question #2","question":"What is the significance of knowing the chain of narrators in hadith literature?","id":"muslim-7-176"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) used to recite in the dawn prayer on Friday\" Alif-Lam-Mim, Tanzil\" and\" Surely there came.\"","reference":"Sahih Muslim 880a, Book 7, Hadith 84","question #":"question #2","question":"What is the significance of reciting certain Quranic chapters during the Friday dawn prayer?","id":"muslim-7-177"},{"hadith-eng":"\" Alif-Lam-Mim, Tanzil\" in the first rak'ah, and in the second one:\" Surely there came over the man a time when he was nothing that could be mentioned.\"","reference":"Sahih Muslim 880b, Book 7, Hadith 85","question #":"question #2","question":"Why might the Prophet Muhammad (ﷺ) have chosen particular verses for the Friday dawn prayer?","id":"muslim-7-178"},{"hadith-eng":"When any one of you observes the Jumu'a prayer (two obligatory rak'ahs in congregation), he should observe four (rak'ahs) afterwards.","reference":"Sahih Muslim 881a, Book 7, Hadith 86","question #":"question #2","question":"How many rak'ahs should be performed after the obligatory Jumu'a prayer in congregation?","id":"muslim-7-179"},{"hadith-eng":"When you observe prayer after (the two obligatory rak'ahs) of Jumu'ah, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house).","reference":"Sahih Muslim 881b, Book 7, Hadith 87","question #":"question #2","question":"What should one do if they are in a hurry after the Jumu'ah prayer?","id":"muslim-7-180"},{"hadith-eng":"When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded.)","reference":"Sahih Muslim 881c, Book 7, Hadith 88","question #":"question #2","question":"How does the practice of additional rak'ahs after Jumu'a prayer contribute to a Muslim's spiritual routine?","id":"muslim-7-181"},{"hadith-eng":"The Messenger of Allah (may peace be updn him) used to do this.","reference":"Sahih Muslim 882a, Book 7, Hadith 89","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) practice his prayers after attending the Friday prayer?","id":"muslim-7-182"},{"hadith-eng":"He did not observe (Nafl) prayer after Jumu'a till he went back and observed two rak'ahs in his house. Yahya said: I guess that I uttered these words (before Imam Malik) that he of course observed (them).","reference":"Sahih Muslim 882b, Book 7, Hadith 90","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) practice Nafl prayers in relation to Jumu'a?","id":"muslim-7-183"},{"hadith-eng":"Salim narrated on the authority of his father that the Messenger of Allah (ﷺ) used to observe two rak'ahs after Jumu'a.","reference":"Sahih Muslim 882c, Book 7, Hadith 91","question #":"question #2","question":"How many rak'ahs did the Prophet Muhammad (ﷺ) perform after the Jumu'a prayer?","id":"muslim-7-184"},{"hadith-eng":"Yes, I observed the Jumu`a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak`ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu`a prayer, do not observe (Sunan prayer) till you, have talked or gone out, for the Messenger of Allah (ﷺ) had ordered us to do this and not to combine two (types of) prayers without talking or going out.","reference":"Sahih Muslim 883a, Book 7, Hadith 92","question #":"question #2","question":"What instructions did the Prophet Muhammad (ﷺ) give regarding the performance of Sunan prayers after Jumu'a prayer?","id":"muslim-7-185"},{"hadith-eng":"When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it.","reference":"Sahih Muslim 883b, Book 7, Hadith 93","question #":"question #2","question":"How does the role of the Imam influence the actions of the congregation during prayer?","id":"muslim-7-186"},{"hadith-eng":"When any one of you intends to come for Jumu'a prayer, he should take a bath.","reference":"Sahih Muslim 844a, Book 7, Hadith 1","question #":"question #3","question":"What are the recommended practices for Muslims before attending the Friday prayer?","id":"muslim-7-187"},{"hadith-eng":"He who comes for Jumu'a he should take a bath.","reference":"Sahih Muslim 844b, Book 7, Hadith 2","question #":"question #3","question":"What are the recommended practices for Muslims to prepare for the Friday prayer?","id":"muslim-7-188"},{"hadith-eng":"This hadith has been narrated by Ibn Umar by another chain of transmitters.","reference":"Sahih Muslim 844c, Book 7, Hadith 3","question #":"question #3","question":"What role do different transmitters play in the preservation of hadith literature?","id":"muslim-7-189"},{"hadith-eng":"'Abdullah (b. Umar) reported on the authority of his father that he heard like this from the Messenger of Allah (ﷺ).","reference":"Sahih Muslim 844d, Book 7, Hadith 4","question #":"question #3","question":"What role does the narrator play in preserving the teachings of the Prophet (ﷺ)?","id":"muslim-7-190"},{"hadith-eng":"What is this hour (for attending the prayer)? He said: I was busy today and I did not return to my house when I heard the call (to Friday prayer), and I did no more but performed ablution only. Upon this Umar said: just ablution! You know that the Messenger of Allah (ﷺ) commanded (us) to take a bath (on Friday).","reference":"Sahih Muslim 845a, Book 7, Hadith 5","question #":"question #3","question":"How does the practice of ablution relate to the preparation for Friday prayers?","id":"muslim-7-191"},{"hadith-eng":"Umar b. Khattab was delivering a sermon to the people on Friday when 'Uthman b. 'Affan came there. 'Umar hinting to him said: What would become of those persons who come after the call to prayer? Upon this 'Uthman said: Commander of the faithful, I did no more than this that after listening to the call, I performed ablution and came (to the mosque). 'Umar said: Just ablution! Did you not hear the Messenger of Allah (my peace be upon him) say this: When any one of you comes for Jumu'a, he should take a bath.","reference":"Sahih Muslim 845b, Book 7, Hadith 6","question #":"question #3","question":"What can be inferred about the practices of ablution and bathing in preparation for Friday prayers?","id":"muslim-7-192"},{"hadith-eng":"Taking a bath on Friday is essential for every adult person.","reference":"Sahih Muslim 846a, Book 7, Hadith 7","question #":"question #3","question":"How does the practice of bathing on Friday relate to Islamic teachings on cleanliness?","id":"muslim-7-193"},{"hadith-eng":"The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foul smell. A person among them (those who were dressed so) came to the Messenger of Allah (ﷺ) while he was in my house. The Messenger of Allah (may peace he upon him) said to him: Were you to cleanse yourselves on this day.","reference":"Sahih Muslim 847a, Book 7, Hadith 8","question #":"question #3","question":"What can be inferred about the social and religious expectations for attending Jumu'a prayer from this narration?","id":"muslim-7-194"},{"hadith-eng":"The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday.","reference":"Sahih Muslim 847b, Book 7, Hadith 9","question #":"question #3","question":"What are the recommended practices for maintaining cleanliness before attending Friday prayers?","id":"muslim-7-195"},{"hadith-eng":"Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady.","reference":"Sahih Muslim 846b, Book 7, Hadith 10","question #":"question #3","question":"What is the significance of applying perfume on Fridays in Islam?","id":"muslim-7-196"},{"hadith-eng":"I asked Ibn Abbas it one should apply to oneself perfume or oil which is available with his wife. He (Ibn Abbas) said: I do not know of it.","reference":"Sahih Muslim 848a, Book 7, Hadith 11","question #":"question #3","question":"How does the practice of grooming relate to the observance of Friday prayers?","id":"muslim-7-197"},{"hadith-eng":"This hadith has been narrated by Ibn Juraij with the came chain of transmitters.","reference":"Sahih Muslim 848b, Book 7, Hadith 12","question #":"question #3","question":"Why is it important to mention the chain of transmitters when discussing a hadith?","id":"muslim-7-198"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.","reference":"Sahih Muslim 849, Book 7, Hadith 13","question #":"question #3","question":"What are the religious obligations related to personal hygiene for Muslims during the week?","id":"muslim-7-199"},{"hadith-eng":"Abu Huraira reported that the Messenger of, Allah (ﷺ) said. He who takes a bath on Friday, the bath which is obligatory after the sexual discharge and then goes (to the mosque), he is like one who offers a she-camel as a sacrifice, and he who comes at the second hour would be like one who offers a cow, and he who comes at the third hour is live one who offers a ram with horns, and he who comes at the fourth hour is like one who offers a hen, and he who comes at the fifth hour is like one who offers an egg. And when the Imam comes out, the angels are also present and listen to the mention of God (the sermon).","reference":"Sahih Muslim 850a, Book 7, Hadith 14","question #":"question #3","question":"What role do angels play during the Friday sermon according to Islamic teachings?","id":"muslim-7-200"},{"hadith-eng":"If you (even) ask your companion to be quiet on Friday while the Imam is delivering the sermon, you have in fact talked irrelevance.","reference":"Sahih Muslim 851a, Book 7, Hadith 15","question #":"question #3","question":"How does one ensure proper etiquette during the Friday prayer sermon?","id":"muslim-7-201"},{"hadith-eng":"A hadith like this has been narrated by Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 851b, Book 7, Hadith 16","question #":"question #3","question":"What role do narrators play in the preservation and transmission of hadiths?","id":"muslim-7-202"},{"hadith-eng":"\"Ibrahim bin 'Abdullah bin Qariz.\"","reference":"Sahih Muslim 851c, Book 7, Hadith 17","question #":"question #3","question":"How does the variation in narrators affect the understanding of a hadith?","id":"muslim-7-203"},{"hadith-eng":"The same hadith has been narrated by Abu Huraira, but instead of the word laghauta the word laghita has been used. Abu Zinad (one of the narrators) says that laghita is the dialect of Abu Huraira, whereas it is laghauta.","reference":"Sahih Muslim 851d, Book 7, Hadith 18","question #":"question #3","question":"How does the variation in wording impact the interpretation of a hadith?","id":"muslim-7-204"},{"hadith-eng":"There is a time on Friday at which no Muslim servant would pray and would ask Allah for a thing (that is good) but He would give it to him. Qutaiba pointed with the help of his hand that it (the time) is short.","reference":"Sahih Muslim 852a, Book 7, Hadith 19","question #":"question #3","question":"What are the benefits of praying and asking Allah for good things during a particular time on Friday?","id":"muslim-7-205"},{"hadith-eng":"There is a time on Friday at which no Muslim would stand and pray and beg Allah for what Is good but He would give it to him; and he pointed with his hand that (this time) is short and narrow.","reference":"Sahih Muslim 852b, Book 7, Hadith 20","question #":"question #3","question":"What actions are recommended for Muslims to perform during the special time on Friday to receive Allah's blessings?","id":"muslim-7-206"},{"hadith-eng":"A hadith like this has been narrated by Abu Huraira.","reference":"Sahih Muslim 852c, Book 7, Hadith 21","question #":"question #3","question":"How are hadiths referenced in Islamic literature?","id":"muslim-7-207"},{"hadith-eng":"This hadith has been narrated by Abu Huraira by another chain of transmitters.","reference":"Sahih Muslim 852d, Book 7, Hadith 22","question #":"question #3","question":"How does the chain of transmitters affect the authenticity of a hadith?","id":"muslim-7-208"},{"hadith-eng":"\"There is a time on Friday at which no Muslim would ask Allah for what is good but He would give it to him.\" And further said: \"This is a very short time.\"","reference":"Sahih Muslim 852e, Book 7, Hadith 23","question #":"question #3","question":"Why is it important for Muslims to be aware of the short time on Friday when prayers are accepted?","id":"muslim-7-209"},{"hadith-eng":"\" That time is short.\"","reference":"Sahih Muslim 852f, Book 7, Hadith 24","question #":"question #3","question":"What are the implications of understanding the shortness of time in one's spiritual life?","id":"muslim-7-210"},{"hadith-eng":"'Abdullah b. Umar said to me: Did you hear anything from your father narrating something from the messenger of Allah (ﷺ) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah (ﷺ) (these words):\" It is between the time when the Imam sits down and the end of the prayer.\"","reference":"Sahih Muslim 853, Book 7, Hadith 25","question #":"question #3","question":"What is the importance of Friday in Islam, particularly in relation to prayer and supplication?","id":"muslim-7-211"},{"hadith-eng":"The best day on which the sun has risen is Friday; on it Adam was created, on it he was made to enter Paradise, on it he. was expelled from it.","reference":"Sahih Muslim 854a, Book 7, Hadith 26","question #":"question #3","question":"How does the day of Friday relate to the story of Adam's creation and his experiences in Paradise?","id":"muslim-7-212"},{"hadith-eng":"The best day on which the sun has risen is Friday; on it Adam was created. on it he was made to enter Paradise, on it he was expelled from it. And the last hour will take place on no day other than Friday.","reference":"Sahih Muslim 854b, Book 7, Hadith 27","question #":"question #3","question":"On which day is the Last Hour expected to occur according to Islamic belief?","id":"muslim-7-213"},{"hadith-eng":"We who are the last shall be the first on the Day of Resurrection, except that every Ummah was given the Book before us and we were given it after them. It was this day which Allah prescribed for us and guided us to it and the people came after us with regard to it, the Jews observing the next day and the Christians the day following that.","reference":"Sahih Muslim 855a, Book 7, Hadith 28","question #":"question #3","question":"What guidance did Allah provide to the Muslim Ummah regarding the observance of a specific day?","id":"muslim-7-214"},{"hadith-eng":"We are the last and would be the first on the Day of Resurrection.","reference":"Sahih Muslim 855b, Book 7, Hadith 29","question #":"question #3","question":"What implications does the statement about being the last and the first have for the understanding of Islamic teachings on the Day of Judgment?","id":"muslim-7-215"},{"hadith-eng":"We are the last (but) we would be the first on the Day of Resurrection, and we would be the first to enter Paradise, but that they were given the Book before us and we were given after them. They disagreed and Allah guided us aright on whatever they disagreed regarding the truth. And it was this day of theirs about which they disagreed, but Allah guided us to it, and that is Friday for us; the next day is for the Jews and the day following for the Christians.","reference":"Sahih Muslim 855c, Book 7, Hadith 30","question #":"question #3","question":"In what way does the concept of being 'the last but the first' manifest in Islamic eschatology?","id":"muslim-7-216"},{"hadith-eng":"We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that.","reference":"Sahih Muslim 855d, Book 7, Hadith 31","question #":"question #3","question":"How did Allah guide the Muslim Ummah in relation to the day of worship compared to other religious communities?","id":"muslim-7-217"},{"hadith-eng":"It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".","reference":"Sahih Muslim 856a, Book 7, Hadith 32","question #":"question #3","question":"What is the historical context behind the selection of Friday as the day of prayer for Muslims?","id":"muslim-7-218"},{"hadith-eng":"We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.","reference":"Sahih Muslim 856b, Book 7, Hadith 33","question #":"question #3","question":"What might be the reasons for previous communities being diverted from Friday as a day of worship?","id":"muslim-7-219"},{"hadith-eng":"When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.","reference":"Sahih Muslim 850b, Book 7, Hadith 34","question #":"question #3","question":"What are the rewards associated with arriving early for the Friday sermon?","id":"muslim-7-220"},{"hadith-eng":"This hadith has been narrated by Abu Huraira through another chain of transmitters.","reference":"Sahih Muslim 850c, Book 7, Hadith 35","question #":"question #3","question":"How does the repetition of a hadith through different chains affect its credibility and acceptance in Islamic teachings?","id":"muslim-7-221"},{"hadith-eng":"There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah.","reference":"Sahih Muslim 850d, Book 7, Hadith 36","question #":"question #3","question":"What happens when the Imam sits on the pulpit during the Friday prayer according to Islamic teachings?","id":"muslim-7-222"},{"hadith-eng":"He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.","reference":"Sahih Muslim 857a, Book 7, Hadith 37","question #":"question #3","question":"What is the significance of maintaining silence during the Imam's sermon in the context of Jumu'a prayer?","id":"muslim-7-223"},{"hadith-eng":"He who performed ablution well, then came to Friday prayer, listened (to the sermon), kept silence all (his sins) between that time and the next Friday would be forgiven with three days extra, and he who touched pebbles caused an interruption.","reference":"Sahih Muslim 857b, Book 7, Hadith 38","question #":"question #3","question":"What actions during the Friday prayer can cause an interruption in its spiritual benefits?","id":"muslim-7-224"},{"hadith-eng":"We used to observe (Jumu'a) prayer with the Messenger of Allah (ﷺ) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian.","reference":"Sahih Muslim 858a, Book 7, Hadith 39","question #":"question #3","question":"What does the practice of resting camels after Jumu'a prayer indicate about the lifestyle of early Muslims?","id":"muslim-7-225"},{"hadith-eng":"that he asked Jabir b. 'Abdullah when the Messenger of Allah (ﷺ) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: \"Till the sun passed the meridian. and the camels used for carrying water (took rest).\"","reference":"Sahih Muslim 858b, Book 7, Hadith 40","question #":"question #3","question":"What significance does the timing of the sun passing the meridian have in relation to Jumu'a prayer?","id":"muslim-7-226"},{"hadith-eng":"We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) \"During the lifetime of the Messenger of Allah (ﷺ).\"","reference":"Sahih Muslim 859, Book 7, Hadith 41","question #":"question #3","question":"What can be inferred about the significance of Friday prayers from the companions' practices?","id":"muslim-7-227"},{"hadith-eng":"We used to observe the Friday prayer with the Messenger of Allah (ﷺ) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).","reference":"Sahih Muslim 860a, Book 7, Hadith 42","question #":"question #3","question":"What practices were observed by the companions of the Prophet (ﷺ) during the Friday prayer?","id":"muslim-7-228"},{"hadith-eng":"We used to observe the Friday prayer with the Messenger of Allah (ﷺ), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).","reference":"Sahih Muslim 860b, Book 7, Hadith 43","question #":"question #3","question":"What can be inferred about the climate and environment during the time of the Prophet (ﷺ) from this narration?","id":"muslim-7-229"},{"hadith-eng":"Ibn 'Umar said that the Messenger of Allah (ﷺ) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.","reference":"Sahih Muslim 861, Book 7, Hadith 44","question #":"question #3","question":"What are the key components of the Friday sermon as practiced by the Prophet Muhammad (ﷺ)?","id":"muslim-7-230"},{"hadith-eng":"The Apostle of Allah (ﷺ) gave two sermons between which he sat, recited the Qur'an and exhorted the people.","reference":"Sahih Muslim 862a, Book 7, Hadith 45","question #":"question #3","question":"What role does recitation of the Qur'an play in Islamic sermons and exhortations?","id":"muslim-7-231"},{"hadith-eng":"Jabir b. Samura said that the Messenger of Allah (ﷺ) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times.","reference":"Sahih Muslim 862b, Book 7, Hadith 46","question #":"question #3","question":"What can be inferred about the authenticity of practices based on the testimony of companions who observed the Prophet (ﷺ) directly?","id":"muslim-7-232"},{"hadith-eng":"Jabir b. Abdullah reported that the Apostle (ﷺ) was delivering the sermon on Friday in a standing posture when a caravan from Syria arrived. The people flocked towards it till no one was left (with the Holy Prophet) but twelve persons, and it was on this occasion that this verse in regard to Jumu'a was revealed.\" And when they see merchandise or sport. they break away to it and leave thee standing.\"","reference":"Sahih Muslim 863a, Book 7, Hadith 47","question #":"question #3","question":"What significance does the revelation of a verse during a specific event hold in understanding Islamic teachings?","id":"muslim-7-233"},{"hadith-eng":"This hadith has been narrated by Husain with the same chain of transmitters but with this alteration that he did not make mention of the standing position.","reference":"Sahih Muslim 863b, Book 7, Hadith 48","question #":"question #3","question":"How does the omission of certain details in a hadith narration impact its practice?","id":"muslim-7-234"},{"hadith-eng":"I was along with the Messenger of Allah (ﷺ) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed:\" And when they see merchandise or sport away to it, and leave thee standing\" (lxii. 1 1). they break","reference":"Sahih Muslim 863c, Book 7, Hadith 49","question #":"question #3","question":"What was the significance of the revelation of the verse related to people leaving the Prophet (ﷺ) for merchandise or sport?","id":"muslim-7-235"},{"hadith-eng":"While the Messenger of Allah (ﷺ) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah (ﷺ) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed.\" And when they see merchandise or sport, they break away to it.\"","reference":"Sahih Muslim 863d, Book 7, Hadith 50","question #":"question #3","question":"What significance do Abu Bakr and 'Umar hold in the context of this event during the Friday sermon?","id":"muslim-7-236"},{"hadith-eng":"Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing.\"","reference":"Sahih Muslim 864, Book 7, Hadith 51","question #":"question #3","question":"What can be inferred about the expectations of a preacher's conduct during a sermon from this narration?","id":"muslim-7-237"},{"hadith-eng":"People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.","reference":"Sahih Muslim 865, Book 7, Hadith 52","question #":"question #3","question":"What is the significance of the Friday prayer in maintaining one's faith and connection with Allah?","id":"muslim-7-238"},{"hadith-eng":"I used to pray with the Messenger of Allah (ﷺ) and both his prayer and sermon were of moderate length.","reference":"Sahih Muslim 866a, Book 7, Hadith 53","question #":"question #3","question":"What can be learned from the Prophet's approach to balancing prayer and sermon duration?","id":"muslim-7-239"},{"hadith-eng":"I used to observe prayer with the Messenger of Allah (ﷺ) and his prayer was of moderate length and his sermon too was of moderate length.","reference":"Sahih Muslim 866b, Book 7, Hadith 54","question #":"question #3","question":"Why might moderation in religious observances be important for a congregation?","id":"muslim-7-240"},{"hadith-eng":"When Allah's Messenger (may peace he upon him) delivered the sermon, his eyes became red, his voice rose, and his anger increased so that he was like one giving a warning against the enemy and saying: \"The enemy has made a morning attack on you and in the evening too.\" He would also say: \"The Last Hour and I have been sent like these two.\" And he would join his forefinger and middle finger; and would further say: \"The best of the speech is embodied in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations; and every innovation is error.\" He would further say:, I am more dear to a Muslim even than his self; and he who left behind property that is for his family; and he who dies under debt or leaves children (in helplessness), the responsibility (of paying his debt and bringing up his children) lies on me.\"","reference":"Sahih Muslim 867a, Book 7, Hadith 55","question #":"question #3","question":"What is the Islamic perspective on innovations in religious practices?","id":"muslim-7-241"},{"hadith-eng":"I heard Jabir b. 'Abdullah saying that in the sermon of the Messenger of Allah (ﷺ) he praised Allah, lauded Him (and subsequently said [other words] and raised his voice, and the rest of the hadith is the same).","reference":"Sahih Muslim 867b, Book 7, Hadith 56","question #":"question #3","question":"What can be learned from the way the Prophet Muhammad (ﷺ) raised his voice during sermons?","id":"muslim-7-242"},{"hadith-eng":"He whom Allah guides aright, there is none to mislead him, and he who is led astray, there is none to guide him (aright), and the best of the talk is embodied in the Book of Allah. And the rest of the hadith is the same.","reference":"Sahih Muslim 867c, Book 7, Hadith 57","question #":"question #3","question":"Why is the Book of Allah considered the best form of speech in Islam?","id":"muslim-7-243"},{"hadith-eng":"Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad (ﷺ) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah (ﷺ) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah (ﷺ) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah (ﷺ) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah (ﷺ) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad.","reference":"Sahih Muslim 868, Book 7, Hadith 58","question #":"question #3","question":"How does the story of Dimad illustrate the influence of the Prophet's message on people from different tribes?","id":"muslim-7-244"},{"hadith-eng":"'Ammar delivered to us the sermon. It was short and eloquent. When he (, Ammir) descended (from the pulpit) we said to him: 0 Abd al-Yaqzn, you have delivered a short and eloquent sermon. Would that you had lengthened (the sermon). He said: I have heard the Messenger of Allah (ﷺ) as saying: The lengthening of prayer by a man and the shortness of the sermon is the sign of his understanding (of faith). So lengthen the prayer and shorten the sermon, for there is charm (in precise) expression.","reference":"Sahih Muslim 869, Book 7, Hadith 59","question #":"question #3","question":"Why is precise expression considered charming in the context of delivering sermons?","id":"muslim-7-245"},{"hadith-eng":"that a person recited a sermon before the Messenger of Allah (ﷺ) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah (ﷺ) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.","reference":"Sahih Muslim 870, Book 7, Hadith 60","question #":"question #3","question":"What are the consequences of disobeying Allah and His Messenger according to Islamic belief?","id":"muslim-7-246"},{"hadith-eng":"0 Malik.\"","reference":"Sahih Muslim 871, Book 7, Hadith 61","question #":"question #3","question":"What can be learned from the Prophet's practice of reciting Qur'anic verses on the pulpit?","id":"muslim-7-247"},{"hadith-eng":"I memorised (surah) \"Qaf, by the glorious Qur'an\" from the mouth of the Messenger of Allah (ﷺ) on Friday for he recited it on the pulpit on every Friday.","reference":"Sahih Muslim 872a, Book 7, Hadith 62","question #":"question #3","question":"What is the importance of delivering sermons from the pulpit in Islamic tradition?","id":"muslim-7-248"},{"hadith-eng":"I did not memorise (Surah) Qaf but from the mouth of the Messenger of Allah (ﷺ) as he used to deliver the. sermon along with it on every Friday. She also added: Our oven and that of the Messenger of Allah (ﷺ) was one.","reference":"Sahih Muslim 872b, Book 7, Hadith 63","question #":"question #3","question":"How did the repetition of certain Surahs during sermons impact the community's connection to the Quran?","id":"muslim-7-249"},{"hadith-eng":"Our oven and that of the Messenger of Allah (ﷺ) was one for two years, or for one year or for a part of a year; and I learnt\" Qaf. By the Glorious Qur'an\" from no other source than the tongue of Allah's Messenger (ﷺ) who used to recite it every Friday on the pulpit when he delivered the sermon to the people.","reference":"Sahih Muslim 873a, Book 7, Hadith 64","question #":"question #3","question":"What role did the mosque play in the daily lives of the Prophet (ﷺ) and his companions?","id":"muslim-7-250"},{"hadith-eng":"\"Our oven and the oven of the Messenger of Allah (ﷺ) were the same for two years, or for one year and part of a year. And I only learned \"Surah Qaf. By the Glorious Quran\" from the tongue of the Messenger of Allah (ﷺ), who used to recited it every Friday from the Minbar, when he addresses the people.\"","reference":"Sahih Muslim 873b, Book 7, Hadith 65","question #":"question #3","question":"What can be inferred about the Prophet's practice of reciting specific Surahs during sermons?","id":"muslim-7-251"},{"hadith-eng":"Allah, disfigure these hands! I have seen Allah's Messenger (ﷺ) gesture no more than this with his hands, and he pointed with his forefinger.","reference":"Sahih Muslim 873c, Book 7, Hadith 66","question #":"question #3","question":"What can be inferred about the importance of following the Prophet's (ﷺ) example in physical gestures during religious practices?","id":"muslim-7-252"},{"hadith-eng":"This hadith has been narrated by another chain of transmitters on the authority of Husain b. Abd al-Rahman.","reference":"Sahih Muslim 874, Book 7, Hadith 67","question #":"question #3","question":"What role do authoritative sources like Sahih Muslim play in the preservation of hadith literature?","id":"muslim-7-253"},{"hadith-eng":"So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray.","reference":"Sahih Muslim 875a, Book 7, Hadith 68","question #":"question #3","question":"What should one do if they enter a mosque while a sermon is being delivered and have not yet prayed?","id":"muslim-7-254"},{"hadith-eng":"This hadith is narrated by Jabir through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs.","reference":"Sahih Muslim 875b, Book 7, Hadith 69","question #":"question #3","question":"What is the role of different narrators in preserving the teachings of Islam?","id":"muslim-7-255"},{"hadith-eng":"Have you observed prayer? He said: No. He (the Holy Prophet) said: Stand and offer the two rak'ahs. According to Qutaiba, the words are:\" He said: Offer two rak'ahs.\"","reference":"Sahih Muslim 875c, Book 7, Hadith 70","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding prayer during a Friday sermon?","id":"muslim-7-256"},{"hadith-eng":"Have you offered two rak'ahs? He said: No. Upon this he said: Then observe (them).","reference":"Sahih Muslim 875d, Book 7, Hadith 71","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) guide someone who has not prayed upon entering the mosque during the sermon?","id":"muslim-7-257"},{"hadith-eng":"When any one of you comes for the Friday (prayer) and the Imam comes out (from his apartment), (even then) should observe two rak'ahs (of prayer).","reference":"Sahih Muslim 875e, Book 7, Hadith 72","question #":"question #3","question":"How does the practice of performing additional rak'ahs relate to the Friday prayer in Islam?","id":"muslim-7-258"},{"hadith-eng":"Have you observed two rak'ahs? He said: No. He (the Holy Prophet) said: Stand and observe them","reference":"Sahih Muslim 875f, Book 7, Hadith 73","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding prayer upon entering the mosque?","id":"muslim-7-259"},{"hadith-eng":"Sulaik Ghatafani came on Friday when the Messenger of Allah (ﷺ) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short.","reference":"Sahih Muslim 875g, Book 7, Hadith 74","question #":"question #3","question":"How should the two rak'ahs be performed if one arrives during the Friday sermon?","id":"muslim-7-260"},{"hadith-eng":"I came to the Prophet (ﷺ) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah (ﷺ) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah (ﷺ) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.","reference":"Sahih Muslim 876, Book 7, Hadith 75","question #":"question #3","question":"How does the Prophet's (ﷺ) interaction with a stranger illustrate the importance of accessibility and personal attention in Islamic teachings?","id":"muslim-7-261"},{"hadith-eng":"Marwan appointed Abu Huraira as his deputy in Medina and he himself left for Mecca. Abu Huraira led us in the Jumu'a prayer and recited after Surah Jumu'a in the second rak'ah:\" When the hypocrites came to thee\" (Surah 63). I then met Abu Huraira as he came back and said to him: You have recited two surahs which 'Ali b. Abu Talib used to recite in Kufah. Upon this Abu Huraira said: I heard the Messenger of Allah (ﷺ) reciting these two in the Friday (prayer).","reference":"Sahih Muslim 877a, Book 7, Hadith 76","question #":"question #3","question":"What role did Abu Huraira play in leading the Jumu'a prayer in Medina?","id":"muslim-7-262"},{"hadith-eng":"\" That he recited Surah Jumu'a (lxii.) in the first rak'ah and\" The hypocrites came\" in the second rak'ah.","reference":"Sahih Muslim 877b, Book 7, Hadith 77","question #":"question #3","question":"How does the choice of Surahs in prayer reflect on the themes of the Friday sermon?","id":"muslim-7-263"},{"hadith-eng":"\" Glorify The name of Thy Lord, the Most High\" (Surah lxxxvii.), and:\" Has there come to thee the news of the overwhelming event\" (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.","reference":"Sahih Muslim 878a, Book 7, Hadith 78","question #":"question #3","question":"What is the significance of reciting specific Surahs during 'Id and Friday prayers in Islam?","id":"muslim-7-264"},{"hadith-eng":"This hadith has been narrated by Ibrahim b Muhammad b. al-Muntashir with the same chain of transmitters.","reference":"Sahih Muslim 878b, Book 7, Hadith 79","question #":"question #3","question":"Why is it important to have multiple narrations of the same hadith?","id":"muslim-7-265"},{"hadith-eng":"\" Has there reached...\" (Surah lxxxviii, ).","reference":"Sahih Muslim 878c, Book 7, Hadith 80","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) ensure the accurate transmission of his practices and teachings?","id":"muslim-7-266"},{"hadith-eng":"The Apostle of Allah (ﷺ) used to recite in the morning prayer on Friday Surah\" Alif-Lam-Mim, Tanz'il ul-Sajda\" (Surah xxxii.): Surely there came over the man a time\" (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin.","reference":"Sahih Muslim 879a, Book 7, Hadith 81","question #":"question #3","question":"What is the significance of reciting specific Surahs during Friday prayers in Islam?","id":"muslim-7-267"},{"hadith-eng":"A hadith like this has been narrated by Sufyan with the same chain of transmitters.","reference":"Sahih Muslim 879b, Book 7, Hadith 82","question #":"question #3","question":"Why is it important to have multiple narrations of the same hadith from different transmitters?","id":"muslim-7-268"},{"hadith-eng":"Mukhawwil has narrated this hadith on the authority of Sufyan.","reference":"Sahih Muslim 879c, Book 7, Hadith 83","question #":"question #3","question":"How does the authentication of a hadith impact its acceptance in Islamic teachings?","id":"muslim-7-269"},{"hadith-eng":"Abu Huraira reported that the Messenger of Allah (ﷺ) used to recite in the dawn prayer on Friday\" Alif-Lam-Mim, Tanzil\" and\" Surely there came.\"","reference":"Sahih Muslim 880a, Book 7, Hadith 84","question #":"question #3","question":"How does the practice of reciting specific Quranic chapters in prayer reflect the traditions of the Prophet Muhammad (ﷺ)?","id":"muslim-7-270"},{"hadith-eng":"\" Alif-Lam-Mim, Tanzil\" in the first rak'ah, and in the second one:\" Surely there came over the man a time when he was nothing that could be mentioned.\"","reference":"Sahih Muslim 880b, Book 7, Hadith 85","question #":"question #3","question":"How does the recitation of certain Surahs in prayer reflect on the themes of human existence and creation?","id":"muslim-7-271"},{"hadith-eng":"When any one of you observes the Jumu'a prayer (two obligatory rak'ahs in congregation), he should observe four (rak'ahs) afterwards.","reference":"Sahih Muslim 881a, Book 7, Hadith 86","question #":"question #3","question":"What are the recommended practices following the Jumu'a prayer according to Islamic teachings?","id":"muslim-7-272"},{"hadith-eng":"When you observe prayer after (the two obligatory rak'ahs) of Jumu'ah, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house).","reference":"Sahih Muslim 881b, Book 7, Hadith 87","question #":"question #3","question":"How does the hadith address the situation of performing additional prayers at home after Jumu'ah?","id":"muslim-7-273"},{"hadith-eng":"When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded.)","reference":"Sahih Muslim 881c, Book 7, Hadith 88","question #":"question #3","question":"What variations exist in the narration of the hadith regarding the prayer after Jumu'a?","id":"muslim-7-274"},{"hadith-eng":"The Messenger of Allah (may peace be updn him) used to do this.","reference":"Sahih Muslim 882a, Book 7, Hadith 89","question #":"question #3","question":"What can be learned from Abdullah ibn Umar's actions regarding post-Friday prayer rituals?","id":"muslim-7-275"},{"hadith-eng":"He did not observe (Nafl) prayer after Jumu'a till he went back and observed two rak'ahs in his house. Yahya said: I guess that I uttered these words (before Imam Malik) that he of course observed (them).","reference":"Sahih Muslim 882b, Book 7, Hadith 90","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) routine after Jumu'a prayer from this narration?","id":"muslim-7-276"},{"hadith-eng":"Salim narrated on the authority of his father that the Messenger of Allah (ﷺ) used to observe two rak'ahs after Jumu'a.","reference":"Sahih Muslim 882c, Book 7, Hadith 91","question #":"question #3","question":"What practices did the Prophet Muhammad (ﷺ) follow after the Friday prayer?","id":"muslim-7-277"},{"hadith-eng":"Yes, I observed the Jumu`a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak`ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu`a prayer, do not observe (Sunan prayer) till you, have talked or gone out, for the Messenger of Allah (ﷺ) had ordered us to do this and not to combine two (types of) prayers without talking or going out.","reference":"Sahih Muslim 883a, Book 7, Hadith 92","question #":"question #3","question":"Why is it important to follow the guidance of the Prophet Muhammad (ﷺ) in the sequence of performing prayers?","id":"muslim-7-278"},{"hadith-eng":"When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it.","reference":"Sahih Muslim 883b, Book 7, Hadith 93","question #":"question #3","question":"What is the significance of standing up at one's place after the prayer is concluded?","id":"muslim-7-279"}]