[{"hadith-eng":"I participated in the Fitr prayer with the Messenger of Allah (ﷺ) and Abu Bakr, 'Umar and 'Uthman, and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah (ﷺ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah\" (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal.","reference":"Sahih Muslim 884a, Book 8, Hadith 1","question #":"question #1","question":"What is the significance of delivering a sermon after the Eid prayer in Islamic tradition?","id":"muslim-8-1"},{"hadith-eng":"I bear testimony to the Messenger of Allah (ﷺ) offering prayer before Kbutba. He (after saying prayer) delivered the Kutba, and he found that the women could not hear it, so he came to them and exhorted them and preached them and commanded them to give alms, and Bilal had stretched his cloth and the women were throwing rings, earrings and other things. This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.","reference":"Sahih Muslim 884b, c, Book 8, Hadith 2","question #":"question #1","question":"What actions did the Prophet (ﷺ) take to ensure that all attendees, including women, could hear his message during the sermon?","id":"muslim-8-2"},{"hadith-eng":"The Apostle of Allah (ﷺ) stood up on the day of 'Id al-Fitr and observed prayer. And he commenced the prayer before the sermon. He then delivered the sermon. When the Messenger of Allah (ﷺ) had finished (the sermon) he came down from (the pulpit), and made his way to the women and exhorted them (to do good acts), and he was leaning on the hand of Bilal. Bilal had stretched his cloth in which women were throwing alms. I (one of the narrators) said to 'Ata' (the other narrator): It must be Zakat on the day of Fitr. He ('Ata') said: No. It was alms (which) they were giving on that occasion, and a woman gave her ring, and then others gave, and then others gave. I said to 'Ata': Is It right now for the Imam to come to the women when he has finished (his address to the men) that he should exhort them (to good deeds)? He said: (Why not) by my life, it is right for them (to do so). What is the matter with them that they do not do it now?","reference":"Sahih Muslim 885a, Book 8, Hadith 3","question #":"question #1","question":"What is the significance of delivering a sermon after the 'Id prayer?","id":"muslim-8-3"},{"hadith-eng":"I observed prayer with the Messenger of Allah (ﷺ) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal, and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal.","reference":"Sahih Muslim 885b, Book 8, Hadith 4","question #":"question #1","question":"What is the significance of delivering a sermon after the 'Id prayer without Adhan and Iqama?","id":"muslim-8-4"},{"hadith-eng":"There was no Adhan on the (occasion) of Id-ul-Fitr and Id-ul-Adha. I (Ibn Juraij) said: I asked him after some time about it. He ('Ata', one of the narrators) said: Jabir b. 'Abdullah al-Ansari told me: There is neither any Adhan on Id-ul-Fitr when the Imam comes out, nor even after his coming out; their is neither lqama nor call nor anything of the sort of calling on that day and nor Iqama.","reference":"Sahih Muslim 886a, Book 8, Hadith 5","question #":"question #1","question":"What is the practice regarding the Adhan and Iqama during the Eid prayers?","id":"muslim-8-5"},{"hadith-eng":"As there is no Adhan on 'Id-ul-Fitr, so you should not pronounce it. Ibn Zubair did not pronounce Adhan on that day. He (Ibn 'Abbas) also sent him (with this message) that sermon (is to be delivered) after the prayer, and thus it was done. So lbn Zubair observed prayer before Khutba.","reference":"Sahih Muslim 886b, Book 8, Hadith 6","question #":"question #1","question":"What is the significance of not pronouncing the Adhan on 'Id-ul-Fitr according to Islamic tradition?","id":"muslim-8-6"},{"hadith-eng":"I prayed with the Messenger of Allah (ﷺ) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.","reference":"Sahih Muslim 887, Book 8, Hadith 7","question #":"question #1","question":"What is the significance of not having Adhan and Iqama for Eid prayers in Islamic tradition?","id":"muslim-8-7"},{"hadith-eng":"Ibn 'Umar reported that the Messenger of Allah (ﷺ), Abu Bakr and 'Umar used to observe the two 'Id prayers before the sermon.","reference":"Sahih Muslim 888, Book 8, Hadith 8","question #":"question #1","question":"What is the sequence of events during the 'Id prayers as practiced by the Prophet Muhammad (ﷺ) and his companions?","id":"muslim-8-8"},{"hadith-eng":"Give alms, give alms, give alms, and the majority that gave alms was of women. He then returned and this (practice) remained (in vogue) till Marwan b. al- Hakam (came into power). I went out hand in hand with Marwan till we came to the place of worship and there Kathir b. Salt had built a pulpit of clay and brick. Marwan began to tug me with his hand as though he were pulling me towards the pulpit, while I was pulling him towards the prayer. When I saw him doing that I said: What has happened to the practice of beginning with prayer? He said: No, Abu Sa'id, what you are familiar with has been abandoned. I thereupon said (three times and went back): By no means, by Him in Whose hand my life is, you are not doing anything better than what I am familiar with.","reference":"Sahih Muslim 889, Book 8, Hadith 9","question #":"question #1","question":"What was the practice of the Prophet (ﷺ) regarding the sequence of prayer and announcements on the days of Eid?","id":"muslim-8-9"},{"hadith-eng":"He (the Messenger of Allah) commanded us that we should take out unmarried women and the screened away ladies for 'Id prayers, and he commanded the menstruating women to remain away from the place of worship of the Muslims.","reference":"Sahih Muslim 890a, Book 8, Hadith 10","question #":"question #1","question":"What instructions did the Prophet give regarding the participation of women in 'Id prayers?","id":"muslim-8-10"},{"hadith-eng":"We were commanded to go out as well as the hidden away ladies and those unmarried. She said menstruating women were to come out amongst you, but remain behind people and pronounce takbir (Allah-o-Akbar) along with them.","reference":"Sahih Muslim 890b, Book 8, Hadith 11","question #":"question #1","question":"What is the significance of including all women, including those who are menstruating, in communal religious gatherings?","id":"muslim-8-11"},{"hadith-eng":"The Messenger of Allah (ﷺ) commanded us to bring out on'Id-ul-Fitr and 'Id-ul-Adha young women, menstruating women and screened away ladies, menstruating women kept back from prayer, but participated in goodness and supplication of the Muslims. I said: Messenger of Allah, one of us does not have an outer garment (to cover her face and body). He said: Let her sister cover her with her outer garment.","reference":"Sahih Muslim 890c, Book 8, Hadith 12","question #":"question #1","question":"What is the significance of including all women, including menstruating women, in the 'Id celebrations?","id":"muslim-8-12"},{"hadith-eng":"Ibn 'Abbas reported that the Messenger of Allah (ﷺ) went out on the day of Adha or Fitr and observed two rak'ahs, and did not observe prayer (at that place) before and after that. He then came to the women along with Bilal and commanded them to give alms and the women began to give their rings and necklaces. \nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.","reference":"Sahih Muslim 884d, e, Book 8, Hadith 13","question #":"question #1","question":"What is the significance of performing two rak'ahs on the day of Eid according to Islamic tradition?","id":"muslim-8-13"},{"hadith-eng":"He used to recite in them:\" Qaf. By the Glorious Qur'an\" (Surah 1),\" The Hour drew near, and the moon was rent asunder\" (Surah liv.).","reference":"Sahih Muslim 891a, Book 8, Hadith 14","question #":"question #1","question":"Which Surahs did the Prophet Muhammad (ﷺ) recite during the 'Id-ul-Adha and 'Id-ul-Fitr prayers?","id":"muslim-8-14"},{"hadith-eng":"'Umar b. Khattab asked me what the Messenger of Allah (ﷺ) recited on 'Id day. I said:\" The Hour drew near\" and Qaf. By the Glorious Qur'an\".","reference":"Sahih Muslim 891b, Book 8, Hadith 15","question #":"question #1","question":"What surahs did the Prophet Muhammad (ﷺ) recite during the 'Id prayer according to this narration?","id":"muslim-8-15"},{"hadith-eng":"Abu Bakr came to see me and I had two girls with me from among the girls of the Ansar and they were singing what the Ansar recited to one another at the Battle of Bu'ath. They were not, however, singing girls. Upon this Abu Bakr said: What I (the playing of) this wind instrument of Satan in the house of the Messenger of Allah (ﷺ) and this too on 'Id day? Upon this the Messenger of Allah (ﷺ) said: Abu Bakr, every people have a festival and it is our festival (so let them play on).","reference":"Sahih Muslim 892a, Book 8, Hadith 16","question #":"question #1","question":"What is the significance of allowing cultural expressions during Islamic festivals?","id":"muslim-8-16"},{"hadith-eng":"\" Two girls were playing upon a tambourine.\"","reference":"Sahih Muslim 892b, Book 8, Hadith 17","question #":"question #1","question":"What is the significance of musical instruments in Islamic traditions?","id":"muslim-8-17"},{"hadith-eng":"Abu Bakr, leave them alone for these are the days of 'Id. And 'A'isha said: I recapitulate to my mind the fact that once the Messenger of Allah (ﷺ) screened me with his mantle and I saw the sports of the Abyssinians, and I was only a girl, and so you can well imagine how a girl of tender age is fond of watching the sport.","reference":"Sahih Muslim 892c, Book 8, Hadith 18","question #":"question #1","question":"What is the significance of allowing joyful activities during the days of 'Id in Islam?","id":"muslim-8-18"},{"hadith-eng":"BY Allah, I remember the Messenger of Allah (ﷺ) standing on the door of my apartment screening me with his mantle enabling me to see the sport of the Abyssinians as they played with their daggers in the mosque of the Messenger of Allah (may peace be upom him). He (the Holy Prophet) kept standing for my sake till I was satiated and then I went back; and thus you can well imagine how long a girl tender of age who is fond of sports (could have watched it).","reference":"Sahih Muslim 892d, Book 8, Hadith 19","question #":"question #1","question":"How does the Prophet Muhammad (ﷺ) demonstrate consideration and patience towards his family members?","id":"muslim-8-19"},{"hadith-eng":"The Messenger of Allah (ﷺ) came (to my apartment) while there were two girls with me singing the song of the Battle of Bu`ath. He lay down on the bed and turned away his face. Then came Abu Bakr and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah (ﷺ)! The Messenger of Allah (ﷺ) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of `Id and the black men were playing with shields and spears. (I do not remember) whether I asked the Messenger of Allah (ﷺ) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go.","reference":"Sahih Muslim 892e, Book 8, Hadith 20","question #":"question #1","question":"What is the significance of allowing cultural expressions and celebrations in Islam, as demonstrated in this event?","id":"muslim-8-20"},{"hadith-eng":"'A'isha reported that some Abyssinians came and gave a demonstration of armed fight on the 'Id day in the mosque. The Apostle of Allah (ﷺ) invited me (to see that fight). I placed my head on his shoulder and began to see their sport till it was I who turned away from watching them.","reference":"Sahih Muslim 892f, Book 8, Hadith 21","question #":"question #1","question":"What is the significance of cultural events and demonstrations in Islamic gatherings?","id":"muslim-8-21"},{"hadith-eng":"This hadith has been narrated by Hisham with the same chain of transmitters but (the narrators) did not make mention of the mosque.","reference":"Sahih Muslim 892g, Book 8, Hadith 22","question #":"question #1","question":"What is the significance of the chain of transmitters in the authenticity of a hadith?","id":"muslim-8-22"},{"hadith-eng":"I like to see them (fighting). She further said: The Messenger of Allah (ﷺ) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians.","reference":"Sahih Muslim 892h, Book 8, Hadith 23","question #":"question #1","question":"What does this narration indicate about the cultural activities allowed in the mosque during the time of the Prophet Muhammad (ﷺ)?","id":"muslim-8-23"},{"hadith-eng":"While the Abyssinians were busy playing with their arms in the presence of the Messenger of Allah (ﷺ) 'Umar b. Khattab came there. He bent down to take up pebbles to throw at them (in order to make them go off). The Messenger of Allah (ﷺ) said to him: 'Umar, leave them alone.","reference":"Sahih Muslim 893, Book 8, Hadith 24","question #":"question #1","question":"What is the significance of allowing cultural expressions and activities in the presence of the Prophet Muhammad (ﷺ)?","id":"muslim-8-24"},{"hadith-eng":"I participated in the Fitr prayer with the Messenger of Allah (ﷺ) and Abu Bakr, 'Umar and 'Uthman, and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah (ﷺ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah\" (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal.","reference":"Sahih Muslim 884a, Book 8, Hadith 1","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) engage with women during his sermons and what was their response?","id":"muslim-8-25"},{"hadith-eng":"I bear testimony to the Messenger of Allah (ﷺ) offering prayer before Kbutba. He (after saying prayer) delivered the Kutba, and he found that the women could not hear it, so he came to them and exhorted them and preached them and commanded them to give alms, and Bilal had stretched his cloth and the women were throwing rings, earrings and other things. This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.","reference":"Sahih Muslim 884b, c, Book 8, Hadith 2","question #":"question #2","question":"How did the women respond to the Prophet's (ﷺ) exhortation to give alms during the sermon?","id":"muslim-8-26"},{"hadith-eng":"The Apostle of Allah (ﷺ) stood up on the day of 'Id al-Fitr and observed prayer. And he commenced the prayer before the sermon. He then delivered the sermon. When the Messenger of Allah (ﷺ) had finished (the sermon) he came down from (the pulpit), and made his way to the women and exhorted them (to do good acts), and he was leaning on the hand of Bilal. Bilal had stretched his cloth in which women were throwing alms. I (one of the narrators) said to 'Ata' (the other narrator): It must be Zakat on the day of Fitr. He ('Ata') said: No. It was alms (which) they were giving on that occasion, and a woman gave her ring, and then others gave, and then others gave. I said to 'Ata': Is It right now for the Imam to come to the women when he has finished (his address to the men) that he should exhort them (to good deeds)? He said: (Why not) by my life, it is right for them (to do so). What is the matter with them that they do not do it now?","reference":"Sahih Muslim 885a, Book 8, Hadith 3","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) encourage women to participate in charitable acts during 'Id al-Fitr?","id":"muslim-8-27"},{"hadith-eng":"I observed prayer with the Messenger of Allah (ﷺ) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal, and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal.","reference":"Sahih Muslim 885b, Book 8, Hadith 4","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the women after the 'Id prayer, and what was his message to them?","id":"muslim-8-28"},{"hadith-eng":"There was no Adhan on the (occasion) of Id-ul-Fitr and Id-ul-Adha. I (Ibn Juraij) said: I asked him after some time about it. He ('Ata', one of the narrators) said: Jabir b. 'Abdullah al-Ansari told me: There is neither any Adhan on Id-ul-Fitr when the Imam comes out, nor even after his coming out; their is neither lqama nor call nor anything of the sort of calling on that day and nor Iqama.","reference":"Sahih Muslim 886a, Book 8, Hadith 5","question #":"question #2","question":"How does the absence of Adhan and Iqama on Eid days differ from regular prayer practices?","id":"muslim-8-29"},{"hadith-eng":"As there is no Adhan on 'Id-ul-Fitr, so you should not pronounce it. Ibn Zubair did not pronounce Adhan on that day. He (Ibn 'Abbas) also sent him (with this message) that sermon (is to be delivered) after the prayer, and thus it was done. So lbn Zubair observed prayer before Khutba.","reference":"Sahih Muslim 886b, Book 8, Hadith 6","question #":"question #2","question":"What is the prescribed order of prayer and sermon on 'Id-ul-Fitr?","id":"muslim-8-30"},{"hadith-eng":"I prayed with the Messenger of Allah (ﷺ) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.","reference":"Sahih Muslim 887, Book 8, Hadith 7","question #":"question #2","question":"How frequently did the Prophet Muhammad (ﷺ) lead Eid prayers without Adhan and Iqama according to this narration?","id":"muslim-8-31"},{"hadith-eng":"Ibn 'Umar reported that the Messenger of Allah (ﷺ), Abu Bakr and 'Umar used to observe the two 'Id prayers before the sermon.","reference":"Sahih Muslim 888, Book 8, Hadith 8","question #":"question #2","question":"How did the practice of 'Id prayers differ from regular prayers in terms of timing and structure?","id":"muslim-8-32"},{"hadith-eng":"Give alms, give alms, give alms, and the majority that gave alms was of women. He then returned and this (practice) remained (in vogue) till Marwan b. al- Hakam (came into power). I went out hand in hand with Marwan till we came to the place of worship and there Kathir b. Salt had built a pulpit of clay and brick. Marwan began to tug me with his hand as though he were pulling me towards the pulpit, while I was pulling him towards the prayer. When I saw him doing that I said: What has happened to the practice of beginning with prayer? He said: No, Abu Sa'id, what you are familiar with has been abandoned. I thereupon said (three times and went back): By no means, by Him in Whose hand my life is, you are not doing anything better than what I am familiar with.","reference":"Sahih Muslim 889, Book 8, Hadith 9","question #":"question #2","question":"How did the Prophet (ﷺ) encourage the giving of alms, and who were the primary contributors?","id":"muslim-8-33"},{"hadith-eng":"He (the Messenger of Allah) commanded us that we should take out unmarried women and the screened away ladies for 'Id prayers, and he commanded the menstruating women to remain away from the place of worship of the Muslims.","reference":"Sahih Muslim 890a, Book 8, Hadith 10","question #":"question #2","question":"How are menstruating women advised to conduct themselves during 'Id prayers?","id":"muslim-8-34"},{"hadith-eng":"We were commanded to go out as well as the hidden away ladies and those unmarried. She said menstruating women were to come out amongst you, but remain behind people and pronounce takbir (Allah-o-Akbar) along with them.","reference":"Sahih Muslim 890b, Book 8, Hadith 11","question #":"question #2","question":"How does the participation of women in religious events reflect on their role in the community?","id":"muslim-8-35"},{"hadith-eng":"The Messenger of Allah (ﷺ) commanded us to bring out on'Id-ul-Fitr and 'Id-ul-Adha young women, menstruating women and screened away ladies, menstruating women kept back from prayer, but participated in goodness and supplication of the Muslims. I said: Messenger of Allah, one of us does not have an outer garment (to cover her face and body). He said: Let her sister cover her with her outer garment.","reference":"Sahih Muslim 890c, Book 8, Hadith 12","question #":"question #2","question":"How can women who do not have appropriate clothing participate in 'Id prayers and gatherings?","id":"muslim-8-36"},{"hadith-eng":"Ibn 'Abbas reported that the Messenger of Allah (ﷺ) went out on the day of Adha or Fitr and observed two rak'ahs, and did not observe prayer (at that place) before and after that. He then came to the women along with Bilal and commanded them to give alms and the women began to give their rings and necklaces. \nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.","reference":"Sahih Muslim 884d, e, Book 8, Hadith 13","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) encourage women to participate in charitable acts during Eid?","id":"muslim-8-37"},{"hadith-eng":"He used to recite in them:\" Qaf. By the Glorious Qur'an\" (Surah 1),\" The Hour drew near, and the moon was rent asunder\" (Surah liv.).","reference":"Sahih Muslim 891a, Book 8, Hadith 14","question #":"question #2","question":"What is the significance of reciting specific Surahs during the 'Id prayers in Islam?","id":"muslim-8-38"},{"hadith-eng":"'Umar b. Khattab asked me what the Messenger of Allah (ﷺ) recited on 'Id day. I said:\" The Hour drew near\" and Qaf. By the Glorious Qur'an\".","reference":"Sahih Muslim 891b, Book 8, Hadith 15","question #":"question #2","question":"How did 'Umar b. Khattab verify the recitation of the Prophet (ﷺ) during the 'Id prayer?","id":"muslim-8-39"},{"hadith-eng":"Abu Bakr came to see me and I had two girls with me from among the girls of the Ansar and they were singing what the Ansar recited to one another at the Battle of Bu'ath. They were not, however, singing girls. Upon this Abu Bakr said: What I (the playing of) this wind instrument of Satan in the house of the Messenger of Allah (ﷺ) and this too on 'Id day? Upon this the Messenger of Allah (ﷺ) said: Abu Bakr, every people have a festival and it is our festival (so let them play on).","reference":"Sahih Muslim 892a, Book 8, Hadith 16","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to Abu Bakr's concern about music during Eid?","id":"muslim-8-40"},{"hadith-eng":"\" Two girls were playing upon a tambourine.\"","reference":"Sahih Muslim 892b, Book 8, Hadith 17","question #":"question #2","question":"How are cultural practices like playing tambourines viewed in Islamic teachings?","id":"muslim-8-41"},{"hadith-eng":"Abu Bakr, leave them alone for these are the days of 'Id. And 'A'isha said: I recapitulate to my mind the fact that once the Messenger of Allah (ﷺ) screened me with his mantle and I saw the sports of the Abyssinians, and I was only a girl, and so you can well imagine how a girl of tender age is fond of watching the sport.","reference":"Sahih Muslim 892c, Book 8, Hadith 18","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate understanding and compassion towards cultural expressions and celebrations?","id":"muslim-8-42"},{"hadith-eng":"BY Allah, I remember the Messenger of Allah (ﷺ) standing on the door of my apartment screening me with his mantle enabling me to see the sport of the Abyssinians as they played with their daggers in the mosque of the Messenger of Allah (may peace be upom him). He (the Holy Prophet) kept standing for my sake till I was satiated and then I went back; and thus you can well imagine how long a girl tender of age who is fond of sports (could have watched it).","reference":"Sahih Muslim 892d, Book 8, Hadith 19","question #":"question #2","question":"What can be inferred about the cultural practices and entertainment during the time of the Prophet Muhammad (ﷺ)?","id":"muslim-8-43"},{"hadith-eng":"The Messenger of Allah (ﷺ) came (to my apartment) while there were two girls with me singing the song of the Battle of Bu`ath. He lay down on the bed and turned away his face. Then came Abu Bakr and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah (ﷺ)! The Messenger of Allah (ﷺ) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of `Id and the black men were playing with shields and spears. (I do not remember) whether I asked the Messenger of Allah (ﷺ) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go.","reference":"Sahih Muslim 892e, Book 8, Hadith 20","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate tolerance and understanding towards different forms of entertainment?","id":"muslim-8-44"},{"hadith-eng":"'A'isha reported that some Abyssinians came and gave a demonstration of armed fight on the 'Id day in the mosque. The Apostle of Allah (ﷺ) invited me (to see that fight). I placed my head on his shoulder and began to see their sport till it was I who turned away from watching them.","reference":"Sahih Muslim 892f, Book 8, Hadith 21","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) engage with his family during public events?","id":"muslim-8-45"},{"hadith-eng":"This hadith has been narrated by Hisham with the same chain of transmitters but (the narrators) did not make mention of the mosque.","reference":"Sahih Muslim 892g, Book 8, Hadith 22","question #":"question #2","question":"How can variations in narrations affect the understanding of a hadith?","id":"muslim-8-46"},{"hadith-eng":"I like to see them (fighting). She further said: The Messenger of Allah (ﷺ) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians.","reference":"Sahih Muslim 892h, Book 8, Hadith 23","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) facilitate the participation of women in observing cultural events?","id":"muslim-8-47"},{"hadith-eng":"While the Abyssinians were busy playing with their arms in the presence of the Messenger of Allah (ﷺ) 'Umar b. Khattab came there. He bent down to take up pebbles to throw at them (in order to make them go off). The Messenger of Allah (ﷺ) said to him: 'Umar, leave them alone.","reference":"Sahih Muslim 893, Book 8, Hadith 24","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to Umar's intention to stop the Abyssinians from playing?","id":"muslim-8-48"},{"hadith-eng":"I participated in the Fitr prayer with the Messenger of Allah (ﷺ) and Abu Bakr, 'Umar and 'Uthman, and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah (ﷺ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah\" (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal.","reference":"Sahih Muslim 884a, Book 8, Hadith 1","question #":"question #3","question":"What role did Bilal play in encouraging the giving of alms during the Prophet's time?","id":"muslim-8-49"},{"hadith-eng":"I bear testimony to the Messenger of Allah (ﷺ) offering prayer before Kbutba. He (after saying prayer) delivered the Kutba, and he found that the women could not hear it, so he came to them and exhorted them and preached them and commanded them to give alms, and Bilal had stretched his cloth and the women were throwing rings, earrings and other things. This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.","reference":"Sahih Muslim 884b, c, Book 8, Hadith 2","question #":"question #3","question":"What is the significance of giving alms in the context of the Prophet's (ﷺ) sermon and its impact on the community?","id":"muslim-8-50"},{"hadith-eng":"The Apostle of Allah (ﷺ) stood up on the day of 'Id al-Fitr and observed prayer. And he commenced the prayer before the sermon. He then delivered the sermon. When the Messenger of Allah (ﷺ) had finished (the sermon) he came down from (the pulpit), and made his way to the women and exhorted them (to do good acts), and he was leaning on the hand of Bilal. Bilal had stretched his cloth in which women were throwing alms. I (one of the narrators) said to 'Ata' (the other narrator): It must be Zakat on the day of Fitr. He ('Ata') said: No. It was alms (which) they were giving on that occasion, and a woman gave her ring, and then others gave, and then others gave. I said to 'Ata': Is It right now for the Imam to come to the women when he has finished (his address to the men) that he should exhort them (to good deeds)? He said: (Why not) by my life, it is right for them (to do so). What is the matter with them that they do not do it now?","reference":"Sahih Muslim 885a, Book 8, Hadith 3","question #":"question #3","question":"What role did Bilal play during the Prophet's exhortation to the women after the 'Id prayer?","id":"muslim-8-51"},{"hadith-eng":"I observed prayer with the Messenger of Allah (ﷺ) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal, and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal.","reference":"Sahih Muslim 885b, Book 8, Hadith 4","question #":"question #3","question":"What reasons did the Prophet Muhammad (ﷺ) give for women being the majority of the fuel for Hell, and how did they respond?","id":"muslim-8-52"},{"hadith-eng":"There was no Adhan on the (occasion) of Id-ul-Fitr and Id-ul-Adha. I (Ibn Juraij) said: I asked him after some time about it. He ('Ata', one of the narrators) said: Jabir b. 'Abdullah al-Ansari told me: There is neither any Adhan on Id-ul-Fitr when the Imam comes out, nor even after his coming out; their is neither lqama nor call nor anything of the sort of calling on that day and nor Iqama.","reference":"Sahih Muslim 886a, Book 8, Hadith 5","question #":"question #3","question":"What did Jabir b. 'Abdullah al-Ansari convey about the call to prayer on Eid days?","id":"muslim-8-53"},{"hadith-eng":"As there is no Adhan on 'Id-ul-Fitr, so you should not pronounce it. Ibn Zubair did not pronounce Adhan on that day. He (Ibn 'Abbas) also sent him (with this message) that sermon (is to be delivered) after the prayer, and thus it was done. So lbn Zubair observed prayer before Khutba.","reference":"Sahih Muslim 886b, Book 8, Hadith 6","question #":"question #3","question":"How did Ibn Zubair implement the instructions regarding the 'Id-ul-Fitr prayer and sermon?","id":"muslim-8-54"},{"hadith-eng":"I prayed with the Messenger of Allah (ﷺ) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.","reference":"Sahih Muslim 887, Book 8, Hadith 7","question #":"question #3","question":"What are the differences in the prayer rituals for Eid compared to regular daily prayers in Islam?","id":"muslim-8-55"},{"hadith-eng":"Ibn 'Umar reported that the Messenger of Allah (ﷺ), Abu Bakr and 'Umar used to observe the two 'Id prayers before the sermon.","reference":"Sahih Muslim 888, Book 8, Hadith 8","question #":"question #3","question":"What significance does the order of prayer and sermon hold in the context of 'Id celebrations?","id":"muslim-8-56"},{"hadith-eng":"Give alms, give alms, give alms, and the majority that gave alms was of women. He then returned and this (practice) remained (in vogue) till Marwan b. al- Hakam (came into power). I went out hand in hand with Marwan till we came to the place of worship and there Kathir b. Salt had built a pulpit of clay and brick. Marwan began to tug me with his hand as though he were pulling me towards the pulpit, while I was pulling him towards the prayer. When I saw him doing that I said: What has happened to the practice of beginning with prayer? He said: No, Abu Sa'id, what you are familiar with has been abandoned. I thereupon said (three times and went back): By no means, by Him in Whose hand my life is, you are not doing anything better than what I am familiar with.","reference":"Sahih Muslim 889, Book 8, Hadith 9","question #":"question #3","question":"What changes did Marwan b. al-Hakam introduce regarding the Eid prayer and announcements, and how was it received by Abu Sa'id al-Khudri?","id":"muslim-8-57"},{"hadith-eng":"He (the Messenger of Allah) commanded us that we should take out unmarried women and the screened away ladies for 'Id prayers, and he commanded the menstruating women to remain away from the place of worship of the Muslims.","reference":"Sahih Muslim 890a, Book 8, Hadith 10","question #":"question #3","question":"What is the significance of including unmarried and screened women in 'Id prayers?","id":"muslim-8-58"},{"hadith-eng":"We were commanded to go out as well as the hidden away ladies and those unmarried. She said menstruating women were to come out amongst you, but remain behind people and pronounce takbir (Allah-o-Akbar) along with them.","reference":"Sahih Muslim 890b, Book 8, Hadith 11","question #":"question #3","question":"What is the importance of pronouncing takbir during religious gatherings?","id":"muslim-8-59"},{"hadith-eng":"The Messenger of Allah (ﷺ) commanded us to bring out on'Id-ul-Fitr and 'Id-ul-Adha young women, menstruating women and screened away ladies, menstruating women kept back from prayer, but participated in goodness and supplication of the Muslims. I said: Messenger of Allah, one of us does not have an outer garment (to cover her face and body). He said: Let her sister cover her with her outer garment.","reference":"Sahih Muslim 890c, Book 8, Hadith 12","question #":"question #3","question":"What role does community support play in ensuring everyone can participate in religious celebrations?","id":"muslim-8-60"},{"hadith-eng":"Ibn 'Abbas reported that the Messenger of Allah (ﷺ) went out on the day of Adha or Fitr and observed two rak'ahs, and did not observe prayer (at that place) before and after that. He then came to the women along with Bilal and commanded them to give alms and the women began to give their rings and necklaces. \nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.","reference":"Sahih Muslim 884d, e, Book 8, Hadith 13","question #":"question #3","question":"What role did Bilal play in the event described in the hadith regarding Eid prayers and charity?","id":"muslim-8-61"},{"hadith-eng":"He used to recite in them:\" Qaf. By the Glorious Qur'an\" (Surah 1),\" The Hour drew near, and the moon was rent asunder\" (Surah liv.).","reference":"Sahih Muslim 891a, Book 8, Hadith 14","question #":"question #3","question":"How did the companions of the Prophet (ﷺ) preserve the practices of the 'Id prayers?","id":"muslim-8-62"},{"hadith-eng":"'Umar b. Khattab asked me what the Messenger of Allah (ﷺ) recited on 'Id day. I said:\" The Hour drew near\" and Qaf. By the Glorious Qur'an\".","reference":"Sahih Muslim 891b, Book 8, Hadith 15","question #":"question #3","question":"What is the significance of reciting specific surahs during the 'Id prayer?","id":"muslim-8-63"},{"hadith-eng":"Abu Bakr came to see me and I had two girls with me from among the girls of the Ansar and they were singing what the Ansar recited to one another at the Battle of Bu'ath. They were not, however, singing girls. Upon this Abu Bakr said: What I (the playing of) this wind instrument of Satan in the house of the Messenger of Allah (ﷺ) and this too on 'Id day? Upon this the Messenger of Allah (ﷺ) said: Abu Bakr, every people have a festival and it is our festival (so let them play on).","reference":"Sahih Muslim 892a, Book 8, Hadith 16","question #":"question #3","question":"What does this incident teach about the balance between religious observance and cultural practices?","id":"muslim-8-64"},{"hadith-eng":"\" Two girls were playing upon a tambourine.\"","reference":"Sahih Muslim 892b, Book 8, Hadith 17","question #":"question #3","question":"What role do children and their activities play in Islamic narratives?","id":"muslim-8-65"},{"hadith-eng":"Abu Bakr, leave them alone for these are the days of 'Id. And 'A'isha said: I recapitulate to my mind the fact that once the Messenger of Allah (ﷺ) screened me with his mantle and I saw the sports of the Abyssinians, and I was only a girl, and so you can well imagine how a girl of tender age is fond of watching the sport.","reference":"Sahih Muslim 892c, Book 8, Hadith 18","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) attitude towards children's enjoyment and entertainment from this narration?","id":"muslim-8-66"},{"hadith-eng":"BY Allah, I remember the Messenger of Allah (ﷺ) standing on the door of my apartment screening me with his mantle enabling me to see the sport of the Abyssinians as they played with their daggers in the mosque of the Messenger of Allah (may peace be upom him). He (the Holy Prophet) kept standing for my sake till I was satiated and then I went back; and thus you can well imagine how long a girl tender of age who is fond of sports (could have watched it).","reference":"Sahih Muslim 892d, Book 8, Hadith 19","question #":"question #3","question":"How does this event reflect the Prophet's (ﷺ) attitude towards leisure and recreation?","id":"muslim-8-67"},{"hadith-eng":"The Messenger of Allah (ﷺ) came (to my apartment) while there were two girls with me singing the song of the Battle of Bu`ath. He lay down on the bed and turned away his face. Then came Abu Bakr and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah (ﷺ)! The Messenger of Allah (ﷺ) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of `Id and the black men were playing with shields and spears. (I do not remember) whether I asked the Messenger of Allah (ﷺ) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go.","reference":"Sahih Muslim 892e, Book 8, Hadith 20","question #":"question #3","question":"What role does the Prophet Muhammad (ﷺ) play in balancing religious practices with cultural activities during festive occasions?","id":"muslim-8-68"},{"hadith-eng":"'A'isha reported that some Abyssinians came and gave a demonstration of armed fight on the 'Id day in the mosque. The Apostle of Allah (ﷺ) invited me (to see that fight). I placed my head on his shoulder and began to see their sport till it was I who turned away from watching them.","reference":"Sahih Muslim 892f, Book 8, Hadith 21","question #":"question #3","question":"What role does the mosque play in community and cultural activities in Islam?","id":"muslim-8-69"},{"hadith-eng":"This hadith has been narrated by Hisham with the same chain of transmitters but (the narrators) did not make mention of the mosque.","reference":"Sahih Muslim 892g, Book 8, Hadith 22","question #":"question #3","question":"Why is it important to note differences in details when studying hadiths?","id":"muslim-8-70"},{"hadith-eng":"I like to see them (fighting). She further said: The Messenger of Allah (ﷺ) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians.","reference":"Sahih Muslim 892h, Book 8, Hadith 23","question #":"question #3","question":"What does this narration reveal about the diversity of people present in the early Islamic community?","id":"muslim-8-71"},{"hadith-eng":"While the Abyssinians were busy playing with their arms in the presence of the Messenger of Allah (ﷺ) 'Umar b. Khattab came there. He bent down to take up pebbles to throw at them (in order to make them go off). The Messenger of Allah (ﷺ) said to him: 'Umar, leave them alone.","reference":"Sahih Muslim 893, Book 8, Hadith 24","question #":"question #3","question":"What can be learned about the Prophet Muhammad's (ﷺ) attitude towards diversity and cultural practices from this event?","id":"muslim-8-72"}]