{"number":37,"edition":"en.sarwar","ayahs":[{"number":1,"text":"I swear by (the angels) who stand in ranks"},{"number":2,"text":"by those who drive away the devil (to protect Our revelation)"},{"number":3,"text":"and those who recite Our revelations"},{"number":4,"text":"that your Lord is the only Lord"},{"number":5,"text":"He is the Lord of the heavens and the earth and all that is between them, the Lord of the Eastern regions"},{"number":6,"text":"We have decked the lower heavens with stars"},{"number":7,"text":"to protect them from the rebellious satan"},{"number":8,"text":"The devils cannot hear those high above. They would be struck from all sides"},{"number":9,"text":"and driven away to suffer the necessary torment"},{"number":10,"text":"Some of them who stealthily steal words from the heavens are pursued by a glistening flame"},{"number":11,"text":"(Muhammad), ask them, \"Have they (people) been created stronger than what We have created?\" We have created them from moist clay"},{"number":12,"text":"(Muhammad), you will be surprised that they still mock (God's revelations)"},{"number":13,"text":"They pay no attention when they are reminded"},{"number":14,"text":"and when they see a miracle, they mock"},{"number":15,"text":"it and say, \"It is only plain magic"},{"number":16,"text":"They say, \"Shall we be brought to life again after we die and turn into dust and bones"},{"number":17,"text":"Will our forefathers also be brought to life again"},{"number":18,"text":"Say, \"You will certainly be brought back to life in disgrace"},{"number":19,"text":"The Day of Judgment will come within a single roar and they will remain gazing at it"},{"number":20,"text":"They will say, \"Woe to us!\" (They will be told), \"This is the day of receiving recompense"},{"number":21,"text":"This is the Day of Judgment in which you disbelieved"},{"number":22,"text":"(God will command the angels), \"Gather together the unjust, their spouses, and what they had worshipped"},{"number":23,"text":"besides God, and show them the way of hell"},{"number":24,"text":"Stop them. They must be questioned"},{"number":25,"text":"They will be asked, \"Why do you not help each other"},{"number":26,"text":"In fact, on that day they will be submissive"},{"number":27,"text":"They will turn to each other saying"},{"number":28,"text":"It was you who tried to mislead us from righteousness"},{"number":29,"text":"Others will respond, \"It was you who did not want to have any faith"},{"number":30,"text":"We had no authority over you, in fact, you were a rebellious people"},{"number":31,"text":"Thus, the words of Our Lord about us have come true and now we are suffering the torment"},{"number":32,"text":"We mislead you and we ourselves had also gone astray"},{"number":33,"text":"On that day they will all share the torment"},{"number":34,"text":"This is how We deal with the criminals"},{"number":35,"text":"They were the ones, who on being told, \"God is only One,\" become puffed-up with pride"},{"number":36,"text":"and said, \"Should we give up our idols for the sake of an insane poet"},{"number":37,"text":"In fact, he had brought them the truth and had acknowledged the Messengers (who were sent before him)"},{"number":38,"text":"(They will be told), \"You will certainly suffer the painful torment"},{"number":39,"text":"and will be recompensed only for what you deserve"},{"number":40,"text":"But the sincere servants of God"},{"number":41,"text":"will have their determined sustenance"},{"number":42,"text":"and fruits while they are honored"},{"number":43,"text":"(They will live) in the bountiful gardens"},{"number":44,"text":"on couches facing each other"},{"number":45,"text":"They will be served with a cup full of crystal clear wine"},{"number":46,"text":"delicious to those who drink it"},{"number":47,"text":"but not harmful or intoxicating"},{"number":48,"text":"They will have with them loving wives with big black and white eyes"},{"number":49,"text":"who are as chaste as sheltered eggs"},{"number":50,"text":"They will turn to each other and ask questions"},{"number":51,"text":"One of them will say, \"I had a companion who asked me"},{"number":52,"text":"Do you believe in the Day of Judgment"},{"number":53,"text":"Shall we be recompensed for our deeds after we die and become bones and dust"},{"number":54,"text":"Do you want to see him"},{"number":55,"text":"He will look down and see him in hell"},{"number":56,"text":"He will say to his friend in hell, \"By God, you almost destroyed me"},{"number":57,"text":"Had I not the guidance of my Lord, I would certainly have been brought into torment"},{"number":58,"text":"He will ask his companion, \"Did you not say that there would only be one death"},{"number":59,"text":"and that we would not be punished"},{"number":60,"text":"This is certainly the greatest triumph"},{"number":61,"text":"for which one must strive hard"},{"number":62,"text":"Is this not a better reward than the tree of Zaqqum"},{"number":63,"text":"which We have made as a torment for the unjust"},{"number":64,"text":"(Zaqqum) is a tree which grows from the deepest part of hell"},{"number":65,"text":"and its fruits are like the heads of devils"},{"number":66,"text":"The dwellers of hell will eat that fruit and fill-up their bellies"},{"number":67,"text":"Then they will have on top of it a mixture of boiling water"},{"number":68,"text":"They can only return to hell"},{"number":69,"text":"They found their father going astray"},{"number":70,"text":"and rushed to follow them"},{"number":71,"text":"Most of the ancient people had also gone astray"},{"number":72,"text":"We had certainly sent warners to them"},{"number":73,"text":"See how terrible was the end of those who were warned"},{"number":74,"text":"Only Our sincere servants were saved"},{"number":75,"text":"Noah called for help. How blessed was the answer which he received"},{"number":76,"text":"We rescued him and his people from the greatest affliction"},{"number":77,"text":"and We made his offspring the only survivors"},{"number":78,"text":"We perpetuated his praise in later generations"},{"number":79,"text":"Peace be with Noah among all men in the worlds"},{"number":80,"text":"Thus do We reward the righteous ones"},{"number":81,"text":"He was one of Our believing servants"},{"number":82,"text":"We drowned all the others (besides Noah and his people)"},{"number":83,"text":"Abraham was one of his followers"},{"number":84,"text":"He turned to his Lord with a sound heart"},{"number":85,"text":"and asked his father and his people, \"What is that you worship"},{"number":86,"text":"Do you want to worship false idols as your lords besides God"},{"number":87,"text":"What do you think about the Lord of the Universe"},{"number":88,"text":"(The people invited him to attend their feast). Then he looked at the stars"},{"number":89,"text":"and said, \"I am sick"},{"number":90,"text":"All the people turned away from him"},{"number":91,"text":"and he turned to their idols and asked them, \"Do you eat"},{"number":92,"text":"Why do you not speak"},{"number":93,"text":"He struck them with his right hand"},{"number":94,"text":"Thereupon the people came running to him"},{"number":95,"text":"He said, \"How can you worship what you yourselves have carved"},{"number":96,"text":"even though God created both you and that which you have made"},{"number":97,"text":"They said, \"Let us build a fire and throw him into the flames"},{"number":98,"text":"They plotted against him, but We brought humiliation upon them"},{"number":99,"text":"(Abraham) said, \"I will go to my Lord who will guide me"},{"number":100,"text":"Abraham prayed, \"Lord, grant me a righteous son"},{"number":101,"text":"We gave him the glad news of the birth of a forbearing son"},{"number":102,"text":"When his son was old enough to work with him, he said, \"My son, I have had a dream that I must sacrifice you. What do you think of this?\" He replied, \"Father, fulfill whatever you are commanded to do and you will find me patient, by the will of God"},{"number":103,"text":"When they both agreed and Abraham had lain down his son on the side of his face (for slaughtering)"},{"number":104,"text":"We called to him, \"Abraham"},{"number":105,"text":"you have fulfilled what you were commanded to do in your dream.\" Thus do We reward the righteous ones"},{"number":106,"text":"It was certainly an open trial"},{"number":107,"text":"We ransomed his son with a great sacrifice"},{"number":108,"text":"and perpetuated his praise in later generations"},{"number":109,"text":"Peace be with Abraham"},{"number":110,"text":"Thus, do We reward the righteous ones"},{"number":111,"text":"He was one of Our believing servants"},{"number":112,"text":"We gave him the glad news of the birth of Isaac, one of the righteous Prophets"},{"number":113,"text":"We had blessed him and Isaac. Some of their offspring were righteous and others were openly unjust to themselves"},{"number":114,"text":"We certainly bestowed Our favor upon Moses and Aaron"},{"number":115,"text":"and saved them and their people from great distress"},{"number":116,"text":"We helped them and they were victorious"},{"number":117,"text":"We gave them the enlightening Book"},{"number":118,"text":"guided them to the right path"},{"number":119,"text":"and perpetuated their praise in later generations"},{"number":120,"text":"Peace be with Moses and Aaron"},{"number":121,"text":"Thus do We reward the righteous ones"},{"number":122,"text":"They were two of Our believing servants"},{"number":123,"text":"Elias was certainly a Messenger"},{"number":124,"text":"He told his people, \"Why do you not have fear of God"},{"number":125,"text":"Do you worship Ba`al and abandon the Best Creator"},{"number":126,"text":"who is your Lord and the Lord of your forefathers"},{"number":127,"text":"They called him a liar. Thus, all of them will suffer torment"},{"number":128,"text":"except the sincere servants of God"},{"number":129,"text":"We perpetuated his praise in the later generations"},{"number":130,"text":"Peace be with the followers of Elias"},{"number":131,"text":"In this way do We reward the righteous ones"},{"number":132,"text":"He was one of Our believing servants"},{"number":133,"text":"Lot was certainly a Messenger"},{"number":134,"text":"We rescued him and his whole family"},{"number":135,"text":"except for an old woman who remained behind"},{"number":136,"text":"Then We totally destroyed the others"},{"number":137,"text":"You pass by (their ruined town) in the morning and at night"},{"number":138,"text":"Will you then not understand"},{"number":139,"text":"Jonah was certainly a Messenger"},{"number":140,"text":"He abandoned his people"},{"number":141,"text":"and sailed away in a laden ship, wherein people cast lots. Because he lost, he was thrown into the water"},{"number":142,"text":"The fish swallowed him up and he deserved (all this)"},{"number":143,"text":"Had he not glorified God"},{"number":144,"text":"he would certainly have remained inside the fish until the Day of Resurrection"},{"number":145,"text":"We cast him out of the fish unto dry land and he was sick"},{"number":146,"text":"We made a plant of gourd grow up for him"},{"number":147,"text":"We sent him to a hundred thousand or more people"},{"number":148,"text":"They believed in him so We granted them enjoyment for an appointed time"},{"number":149,"text":"(Muhammad), ask them, \"Do daughters belong to your Lord and sons to them"},{"number":150,"text":"Have We created the angels as females before their very eyes"},{"number":151,"text":"It is only because of their false invention that they say"},{"number":152,"text":"God has begotten a son.' They are certainly liars"},{"number":153,"text":"Has He chosen daughters in preference to sons"},{"number":154,"text":"Woe to you! How terrible is your Judgment"},{"number":155,"text":"Do you not understand"},{"number":156,"text":"Do you have clear authority"},{"number":157,"text":"Bring your book if what you say is true"},{"number":158,"text":"They have said that there is a relationship between Him and the jinn. The jinn certainly know that they will all be brought to suffer torment"},{"number":159,"text":"God is too glorious to be described as they describe Him"},{"number":160,"text":"except the servants of God, sincere and devoted"},{"number":161,"text":"You and whatever you worship"},{"number":162,"text":"cannot mislead anyone"},{"number":163,"text":"except those who are doomed to enter hell"},{"number":164,"text":"The angels say, \"Each of us has an appointed place"},{"number":165,"text":"We stand in ranks (for prayer)"},{"number":166,"text":"and we glorify God"},{"number":167,"text":"Even though they (unbelievers) say"},{"number":168,"text":"Had we received guidance from the people living before us"},{"number":169,"text":"we would have certainly been sincere servants of God"},{"number":170,"text":"They have rejected the Quran. They will soon know the consequences (of their disbelief)"},{"number":171,"text":"We decreed that Our Messenger servants"},{"number":172,"text":"will certainly be victorious"},{"number":173,"text":"and that Our army will be triumphant"},{"number":174,"text":"(Muhammad), stay away from them for a while"},{"number":175,"text":"and watch them. They, too, will watch"},{"number":176,"text":"Do they want to suffer Our torment immediately"},{"number":177,"text":"When it descends into their courtyard, it will be terrible for those who have already been warned"},{"number":178,"text":"Stay away from them for a while"},{"number":179,"text":"and watch. They, too, will watch"},{"number":180,"text":"Your Lord, the Lord of Honor, is too exalted to be considered as they describe Him"},{"number":181,"text":"Peace be with the Messengers (of God)"},{"number":182,"text":"It is only God, the Lord of the Universe, who deserves all praise"}]}