{"number":39,"edition":"en.sarwar","ayahs":[{"number":1,"text":"This Book is a revelation from God, the Majestic and All-Wise"},{"number":2,"text":"We have revealed the Book to you in all truth. Worship God and be devoted to His religion"},{"number":3,"text":"The religion of God is certainly pure. Concerning those whom they consider as their guardians besides God, they say, \"We only worship them so that they may make our positions nearer to God.\" God will certainly issue His decree about their differences. God does not guide the liars and the disbelievers"},{"number":4,"text":"Had God wanted to have a son, He would have chosen one from His creatures according to His will. God is too Exalted to have a son. He is One and Almighty"},{"number":5,"text":"He has created the heavens and the earth for a genuine purpose. He covers the night with the day and the day with the night and has subdued the sun and the moon, each of which floats for an appointed time. God is certainly Majestic and All-Forgiving"},{"number":6,"text":"He has created you from a single soul. Out of this He created your spouse. He sent you eight pairs of cattle. He creates you for a second time in the wombs of your mothers behind three curtains of darkness. He is your Lord to whom belongs the Kingdom. He is the only Lord. Where then will you turn away"},{"number":7,"text":"If you disbelieve, know that God is certainly independent of you. He does not want disbelief for His servants. If you give thanks, He will accept it from you. No one will be responsible for the sins of others. To your Lord you will all return and He will tell you about what you have done. He knows best what the hearts contain"},{"number":8,"text":"When the human being is afflicted with hardship, he starts to pray to his Lord and turns to Him in repentance. When God grants him a favor, he forgets the hardship about which he had prayed to God and starts to consider equal to God things that lead him astray from His path. (Muhammad), tell him, \"You can only enjoy in your disbelief for a short time. You will certainly be a dweller of hell fire"},{"number":9,"text":"Can this one be considered equal to one who worships God during the night, prostrating and standing, who has fear of the Day of Judgment, and who has hope in the mercy of his Lord? Say, \"Are those who know equal to those who do not know? Only the people of reason take heed"},{"number":10,"text":"Say to My believing servants, \"Have fear of your Lord. Those who act righteously in this life will receive good reward. The land of God is vast. God will recompense the deeds of those who have exercised patience, without keeping an account"},{"number":11,"text":"Say, \"I am commanded to worship God and be devoted to His religion"},{"number":12,"text":"and I am commanded to be the first Muslim"},{"number":13,"text":"Say, \"I am afraid that for disobeying my Lord I shall suffer the torment of the great day"},{"number":14,"text":"Say, \"I worship God alone and devote myself to His religion"},{"number":15,"text":"Worship besides Him whatever you want. The greatest losers are those whose souls and family members will be lost on the Day of Judgment for this is certainly a great loss"},{"number":16,"text":"Above and below them their will be shadows of fire. This is how God frightens His servants. My servants have fear of Me"},{"number":17,"text":"Those who have avoided worshipping idols and have turned in repentance to God will receive the glad news"},{"number":18,"text":"(Muhammad), give the glad news to those of Our servants who listen to the words and only follow the best ones. Tell them that they are those whom God has guided. They are the people of understanding"},{"number":19,"text":"How can you rescue the one who is destined to suffer the torment"},{"number":20,"text":"Those who have fear of their Lord will have lofty mansions built upon mansions beneath which streams flow. It is the promise of God. God does not disregard His promise"},{"number":21,"text":"Have you not seen that God has sent down water from the sky and made it flow as springs out of the earth? He makes crops of different colors grow with this water and flourish, which then turn yellow and wither away. In this there is a reminder for the people of understanding"},{"number":22,"text":"One whose chest (heart and mind) is left open for Islam (submission to His will) shall receive light from God. Woe to those whose hearts have become like stone against the remembrance of God. They are clearly in error"},{"number":23,"text":"God has revealed the best reading material in the form of a Book with similar passages which refer to each other and make the skins of those who fear their Lord shiver. Then their skins and hearts incline to the remembrance of God. This is the guidance of God. He guides whomever He wants. No one can guide those whom God has caused to go astray"},{"number":24,"text":"Is there anyone who is afraid of the torment of the Day of Judgment when the unjust will be told, \"Suffer the result of your deeds"},{"number":25,"text":"Those who lived before them had also rejected Our revelations. Thus, the torment struck them and they did not even realize where it came from"},{"number":26,"text":"God made them suffer humiliation in this life. Would that they knew that the torment for them in the next life will be even greater"},{"number":27,"text":"We have given all kinds of examples for the human being in this Quran so that perhaps he may take heed"},{"number":28,"text":"This Quran is a flawless reading text in the Arabic language. Perhaps they will have fear of God"},{"number":29,"text":"God tells a parable in which there is a company of quarrelsome people and only one of them is well disciplined. Can they be considered as equal? It is only God who deserves all praise. In fact, most of them do not know"},{"number":30,"text":"(Muhammad), you will die and all of them will also die"},{"number":31,"text":"Then, on the Day of Judgment, all of you will present your disputes before your Lord"},{"number":32,"text":"Who is more unjust then one who invents falsehood against God and rejects the truth after it has come to them. Is not hell a dwelling for the disbelievers"},{"number":33,"text":"Those who have brought the truth and have acknowledged it are those who have fear of God"},{"number":34,"text":"They will receive whatever they want from their Lord. Thus is the reward of the righteous ones"},{"number":35,"text":"God will certainly expiate their bad deeds and reward them much more for what they have done"},{"number":36,"text":"Is God not sufficient (support) for His servants? They frighten you with what they worship besides God. Who can guide one whom God has caused to go astray"},{"number":37,"text":"Who can mislead one whom God has guided? Is God not Majestic and Revengeful"},{"number":38,"text":"If you ask them, \"Who has created the heavens and the earth?\" They will certainly say, \"God has created them.\" Ask them, \"Do you think that you can rescue me from the punishment of God with which He may afflict me? Can you prevent His mercy if He wants to grant it to me?\" Say, \"God is Sufficient (support) for me. In Him alone one must trust"},{"number":39,"text":"Say, \"My people, act as you wish. I shall do as I like and you will soon know"},{"number":40,"text":"who will face the humiliating torment and suffer everlasting retribution"},{"number":41,"text":"(Muhammad), We have revealed the Book to you for mankind in all truth. Whoever seeks guidance does so for his own good. Whosoever goes astray goes against his own soul. You are not their representative"},{"number":42,"text":"God will receive their souls when they die. Their souls do not die when they are sleeping. During people's sleep He withholds those souls which He has decreed to die and releases the others for an appointed time. In this there is evidence (of the Truth) for the thoughtful people"},{"number":43,"text":"Have they chosen intercessors besides God? Say, \"Would you choose them as your intercessors even though they do not possess anything and have no understanding"},{"number":44,"text":"Say, \"Intercession belongs to God. To Him belongs the heavens and the earth and to Him you will all return"},{"number":45,"text":"When one God is mentioned, the hearts of those who do not believe in the Day of Judgment begin to shrink, but when the idols are mentioned, they rejoice"},{"number":46,"text":"Say, \"Lord, the Creator of the heavens and the earth, knower of the seen and unseen, it is You who will issue Your decree about the differences of Your servants"},{"number":47,"text":"Had the unjust possessed double the amount of the wealth of the whole earth, they would certainly have liked to offer it on the Day of Resurrection as redemption from the torment of Our scourge when God would make public what they had never expected"},{"number":48,"text":"Their bad deeds will become public and they will be surrounded by the torment which they had mocked during their worldly life"},{"number":49,"text":"When the human being is afflicted with hardship, he cries out to us for help. When We grant him a favor, he says, \"I knew that I deserved it.\" In fact, it is only a test for him, but most people do not know this"},{"number":50,"text":"People who lived before them had also said, \"Our wealth has been earned by our own merits.\" What they had earned was of no benefit to them"},{"number":51,"text":"They were afflicted by the terrible result of whatever they gained. Besides this affliction, the unjust among them will also suffer the consequence of their deeds. They will not be able to challenge God"},{"number":52,"text":"Did they not know that God determines and increases the sustenance of whomever He wants. In this there is evidence (of the truth) for the believing people"},{"number":53,"text":"(Muhammad), tell my servants who have committed injustice to themselves, \"Do not despair of the mercy of God. God certainly forgives all sins. He is All-forgiving and All-merciful"},{"number":54,"text":"Turn in repentance to your Lord and submit to His will before you are afflicted with the torment after which you can receive no help"},{"number":55,"text":"Follow the best of what is revealed to you from your Lord before the torment suddenly approaches you and you will not realize how it came about"},{"number":56,"text":"Turn to God in repentance before a soul says, \"Woe to me because of my failure to fulfill my duties to God. Woe to me for mocking God's guidance"},{"number":57,"text":"Or before the soul says, \"Had God guided me, I could have been a pious man"},{"number":58,"text":"Or, on seeing the torment, it would say, \"Would I have the opportunity, this time I would certainly become a pious person"},{"number":59,"text":"God will reply to the soul, \"My revelations had certainly come to you but you rejected them. You were puffed-up with pride and you became an unbeliever"},{"number":60,"text":"On the Day of Judgment you will see the faces of those who had invented falsehood against God blackened. Is not hell the dwelling of the arrogant ones"},{"number":61,"text":"God will save the pious ones because of their virtuous deeds. No hardship will touch them nor will they be grieved"},{"number":62,"text":"God is the Creator and Guardian of all things"},{"number":63,"text":"In His hands are the keys of the treasuries of the heavens and the earth. Those who reject God's revelations will be lost"},{"number":64,"text":"(Muhammad), say, \"Ignorant ones, do you command me to worship things other than God"},{"number":65,"text":"even though God has said, \"It has been revealed to you and to those who lived before you that if you consider other things equal to God, your deeds will be made devoid of all virtue and you will certainly be lost"},{"number":66,"text":"(Muhammad), You must worship God alone and give Him thanks"},{"number":67,"text":"They have not paid due respect to God. The whole earth will be gripped in His hands on the Day of Judgment and the heavens will be just like a scroll in His right hand. God is too Glorious and High to be considered equal to their idols"},{"number":68,"text":"Everyone in the heavens and the earth will faint in terror except for those whom God will save when the trumpet is sounded. They will all stand up and wait when the trumpet sounds for the second time"},{"number":69,"text":"The earth will become bright from the light of your Lord. The Book of Records will be presented and the Prophets and witness will be summoned. All will be judged with justice and no wrong will be done to anyone"},{"number":70,"text":"Every soul will be recompensed for its deeds. God knows best whatever they have done"},{"number":71,"text":"The disbelievers will be driven to hell in hordes. Its gates will be opened when they are brought nearby and the keepers will ask them, \"Did Messengers from your own people not come to you to recite your Lord's revelations and to warn you about this day?\" They will reply, \"Yes, the Messengers did come to us, but the unbelievers were doomed to face the torment"},{"number":72,"text":"They will be told, \"Enter the gates of hell to live therein forever. What a terrible dwelling for the arrogant ones"},{"number":73,"text":"The pious ones will be led to Paradise in large groups. Its gates will be opened to them when they are brought nearby and its keepers will say, \"Welcome! Peace be with you. Enter the gates of Paradise to live therein forever"},{"number":74,"text":"They will say, \"It is only God who deserves all praise. He has made His promise come true and has given the earth as an inheritance to us. Now we live in the gardens as we wished. Blessed is the reward of those who labor"},{"number":75,"text":"(Muhammad), on that day you will see the angels circling around the Throne, glorifying and praising their Lord. Judgment with justice will be decreed between the people of Paradise and hell and it will be said, \"It is only God, Lord of the Universe who deserves all praise"}]}