{"number":74,"edition":"en.sarwar","ayahs":[{"number":1,"text":"Cloaked one"},{"number":2,"text":"stand up, deliver your warning"},{"number":3,"text":"proclaim the greatness of your Lord"},{"number":4,"text":"cleanse your clothes"},{"number":5,"text":"stay away from sins"},{"number":6,"text":"and do not think that by doing such deeds, you have done a great favor to God"},{"number":7,"text":"Exercise patience to please your Lord"},{"number":8,"text":"When the trumpet is sounded"},{"number":9,"text":"it will be a hard day"},{"number":10,"text":"and for the disbelievers, in particular, it will not be at all easy"},{"number":11,"text":"Leave to Me the one, whom I have created all by Myself"},{"number":12,"text":"and whom I have granted abundant wealth"},{"number":13,"text":"and children living in his presence"},{"number":14,"text":"whose life I have made run smoothly"},{"number":15,"text":"and who still desires more"},{"number":16,"text":"Never will he receive more. He has been hostile to Our revelations"},{"number":17,"text":"We shall make him suffer the torment of hell without relief"},{"number":18,"text":"He planned and plotted"},{"number":19,"text":"May he be condemned"},{"number":20,"text":"What an evil plan he has made"},{"number":21,"text":"May he be condemned again for his schemes! He looked around"},{"number":22,"text":"frowned and scowled"},{"number":23,"text":"then turned back, and swelling-up with pride"},{"number":24,"text":"said, \"This (the Quran) is nothing but magic, inherited from ancient magicians"},{"number":25,"text":"These are only words from a mere mortal"},{"number":26,"text":"I shall make him suffer the torment of hell"},{"number":27,"text":"Would that you really knew what hell is"},{"number":28,"text":"It leaves and spares no one and nothing"},{"number":29,"text":"It scorches people's skin"},{"number":30,"text":"and it has nineteen angelic keepers"},{"number":31,"text":"We have made only angels as the keepers of the fire (for they are the strongest in carrying out Our commands). Our informing (people) of the numbers of these angels is a trial for the disbelievers. It gives more certainty to the people of the Book and strengthens the faith of the believers. The people of the Book and the believers have no doubt about it. We have fixed the number to make the disbelievers and those whose hearts are sick say, \"What does God mean by such a parable?\" Thus, God guides and causes to go astray whomever He wants. No one knows about the army of your Lord except He Himself. This parable is a reminder for mankind"},{"number":32,"text":"By the moon"},{"number":33,"text":"by the retreating night"},{"number":34,"text":"by the brightening dawn"},{"number":35,"text":"hell is certainly the greatest calamity"},{"number":36,"text":"It is a warning for mankind"},{"number":37,"text":"whether one steps forward to embrace the faith or one turns away from it"},{"number":38,"text":"Every soul will be in captivity for its deeds"},{"number":39,"text":"except the people of the right hand"},{"number":40,"text":"who will be in Paradise"},{"number":41,"text":"and will ask of the criminals"},{"number":42,"text":"what led you into hell"},{"number":43,"text":"They will reply, \"We did not pray"},{"number":44,"text":"nor did we feed the destitute"},{"number":45,"text":"We indulged and persisted in useless disputes"},{"number":46,"text":"and rejected the Day of Judgment"},{"number":47,"text":"until death approached us"},{"number":48,"text":"The intercession of the intercessors will be of no benefit to them"},{"number":49,"text":"If such will be the Day of Judgment, what is the matter with them? Why do they run away from guidance"},{"number":50,"text":"like frightened donkeys"},{"number":51,"text":"running away from a lion"},{"number":52,"text":"Is it that everyone of them wants to receive a heavenly book addressed to him personally"},{"number":53,"text":"This will certainly never be the case! In fact, they are not afraid of the Day of Judgment"},{"number":54,"text":"There is no doubt that the Quran is a guide"},{"number":55,"text":"Let anyone who seeks guidance do so"},{"number":56,"text":"No one will seek guidance unless God wills it. He alone is worthy of being feared and He is the Source of Forgiveness"}]}