{"number":75,"edition":"en.sarwar","ayahs":[{"number":1,"text":"I swear by the Day of Resurrection"},{"number":2,"text":"and by the self accusing soul (that you will certainly be resurrected)"},{"number":3,"text":"Do men think that We shall never be able to assemble their bones"},{"number":4,"text":"We certainly have the power to restore them even the very tips of their finger"},{"number":5,"text":"In fact, people want to have eternal life in this world"},{"number":6,"text":"He asks, \"When will be the Day of Judgment"},{"number":7,"text":"When the eye is bewildered"},{"number":8,"text":"the moon eclipsed"},{"number":9,"text":"and the sun and the moon are brought together"},{"number":10,"text":"people will say, \"Is there anywhere to run away"},{"number":11,"text":"Certainly not! There will be no place of refuge"},{"number":12,"text":"The only place of refuge will be with God"},{"number":13,"text":"On that day, people will be informed of all that they had done and all that they were supposed to do"},{"number":14,"text":"In fact, people are well-aware of their own soul"},{"number":15,"text":"even though they make excuses"},{"number":16,"text":"(Muhammad), do not move your tongue too quickly to recite the Quran"},{"number":17,"text":"We shall be responsible for its collection and its recitation"},{"number":18,"text":"When We recite it, follow its recitation (by Us)"},{"number":19,"text":"We shall be responsible for its explanation"},{"number":20,"text":"Human beings certainly do not want to pay much attention to the Quran. In fact, they love the worldly life"},{"number":21,"text":"and neglect the life to come"},{"number":22,"text":"On the Day of Judgment some faces will be bright"},{"number":23,"text":"and look forward to receiving mercy from their Lord"},{"number":24,"text":"Others will be despondent"},{"number":25,"text":"certain of facing a great calamity"},{"number":26,"text":"Some people, certainly, do not believe in it, but when a person's soul reaches up to his throat"},{"number":27,"text":"and the angels say, \"Who will take away his soul"},{"number":28,"text":"(the angels of mercy or the angels of wrath,)\" then, he will realize that it is time to leave this world"},{"number":29,"text":"When legs are twisted around each other"},{"number":30,"text":"that will be the time to be driven to one's Lord"},{"number":31,"text":"The human being does not want to believe the Truth, nor does he want to pray"},{"number":32,"text":"He rejects the faith, turns away"},{"number":33,"text":"and haughtily goes to his people"},{"number":34,"text":"Woe to you"},{"number":35,"text":"Woe to you"},{"number":36,"text":"For you, the human being of such behavior, will certainly deserve it"},{"number":37,"text":"Does the human being think that he will be left uncontrolled"},{"number":38,"text":"Was he not once just a drop of discharged sperm"},{"number":39,"text":"Was he not turned into a clot of blood? God then formed him and gave him proper shape. From the human being, God made males and females in pairs"},{"number":40,"text":"Does He then not have the power to bring the dead back to life"}]}