{"number":38,"edition":"fa.ayati","ayahs":[{"number":1,"text":"صاد. سوگند به قرآن شريف صاحب اندرز"},{"number":2,"text":"كه كافران همچنان در سركشى و خلافند"},{"number":3,"text":"چه بسا مردمى را كه پيش از آنها به هلاكت رسانيديم. آنان فرياد برمى‌آوردند ولى گريزگاهى نبود"},{"number":4,"text":"در شگفت شدند از اينكه بيم‌دهنده‌اى از ميان خودشان برخاست. و كافران گفتند: اين جادوگرى دروغگوست"},{"number":5,"text":"آيا همه خدايان را يك خدا گردانيده است؟ و اين چيزى شگفت است"},{"number":6,"text":"مهترانشان به راه افتادند و گفتند: برويد و بر پرستش خدايان خويش پايدارى ورزيد كه اين است چيزى كه از شما خواسته شده"},{"number":7,"text":"ما در اين آخرين آيين، چنين سخنى نشنيده‌ايم و اين جز دروغ هيچ نيست"},{"number":8,"text":"آيا از ميان همه ما وحى بر او نازل شده است؟ بلكه آنها از وحى من در ترديدند، و هنوز عذاب مرا نچشيده‌اند"},{"number":9,"text":"يا آنكه خزاين رحمت پروردگار پيروزمند بخشنده‌ات در نزد آنهاست؟"},{"number":10,"text":"يا فرمانروايى آسمانها و زمين و هر چه ميان آن دوست، از آن آنهاست؟ پس با نردبامهايى خود را به آسمان كشند"},{"number":11,"text":"آنجا لشكرى است ناچيز از چند گروه شكست‌خورده به هزيمت رفته"},{"number":12,"text":"پيش از آنها قوم نوح و عاد و فرعون، كه مردم را به چهار ميخ مى‌كشيد، پيامبران را تكذيب مى‌كردند"},{"number":13,"text":"و نيز قوم ثمود و قوم لوط و مردم اَيكه از آن جماعتها بودند"},{"number":14,"text":"از اينان كس نبود مگر آنكه پيامبران را تكذيب كرد، و عقوبت من واجب آمد"},{"number":15,"text":"اينان نيز جز بانگى سهمناك انتظارى ندارند، چنان كه آدمى را ديگر بازگشت نباشد"},{"number":16,"text":"و گفتند: اى پروردگار ما، نامه اعمال ما را پيش از فرارسيدن روز حساب به دست ما بده"},{"number":17,"text":"بر هر چه مى‌گويند صبر كن. و از بنده ما داود قدرتمند، كه همواره به درگاه ما توبه مى‌كرد، يادآور"},{"number":18,"text":"ما كوه‌ها را رام كرديم و كوه‌ها هر شامگاه و بامدادان با او تسبيح مى‌كردند"},{"number":19,"text":"و پرندگان بر او گرد مى‌آمدند، همه فرمانبر او بودند"},{"number":20,"text":"فرمانرواييش را استوارى بخشيديم و او را حكمت و فصاحت در سخن عطا كرديم"},{"number":21,"text":"آيا خبر آن مدعيان را شنيده‌اى آنگاه كه از ديوار قصر بالا رفتند؟"},{"number":22,"text":"بر داود داخل شدند. داود از آنها ترسيد. گفتند: مترس، ما دو مدعى هستيم كه يكى بر ديگرى ستم كرده است. ميان ما به حق داورى كن و پاى از عدالت بيرون منه و ما را به راه راست هدايت كن"},{"number":23,"text":"اين برادر من است. او را نَوَد و نُه ميش است و مرا يك ميش. مى‌گويد: آن را هم به من واگذار، و در دعوى بر من غلبه يافته است"},{"number":24,"text":"داود گفت: او كه ميش تو را از تو مى‌خواهد تا به ميشهاى خويش بيفزايد بر تو ستم مى‌كند. و بسيارى از شريكان جز كسانى كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند -و اينان نيز اندك هستند- بر يكديگر ستم مى‌كنند. و داود دانست كه او را آزموده‌ايم. پس از پروردگارش آمرزش خواست و به ركوع درافتاد و توبه كرد"},{"number":25,"text":"ما اين خطايش را بخشيديم. او را به درگاه ما تقرب است و بازگشتى نيكو"},{"number":26,"text":"اى داود، ما تو را خليفه روى زمين گردانيديم. در ميان مردم به حق داورى كن و از پى هواى نفس مرو كه تو را از راه خدا منحرف سازد. آنان كه از راه خدا منحرف شوند، بدان سبب كه روز حساب را از ياد برده‌اند، به عذابى شديد گرفتار مى‌شوند"},{"number":27,"text":"ما اين آسمان و زمين و آنچه را كه ميان آنهاست به باطل نيافريده‌ايم. اين گمان كسانى است كه كافر شدند. پس واى بر كافران از آتش"},{"number":28,"text":"آيا كسانى را كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند، همانند فسادكنندگان در زمين قرار خواهيم داد؟ يا پرهيزگاران را چون گناهكاران؟"},{"number":29,"text":"كتابى مبارك است كه آن را بر تو نازل كرده‌ايم، تا در آياتش بينديشند و خردمندان از آن پند گيرند"},{"number":30,"text":"سليمان را به داود عطا كرديم. چه بنده نيكويى بود و روى به خدا داشت"},{"number":31,"text":"آنگاه كه به هنگام عصر اسبان تيزرو را كه ايستاده بودند به او عرضه كردند،"},{"number":32,"text":"گفت: من دوستى اين اسبان را بر ياد پروردگارم بگزيدم تا آفتاب در پرده غروب پوشيده شد،"},{"number":33,"text":"آن اسبان را نزد من بازگردانيد. پس به بريدن ساقها و گردنشان آغاز كرد"},{"number":34,"text":"ما سليمان را آزموديم و بر تخت او جسدى را افكنديم و او روى به خدا آورد"},{"number":35,"text":"گفت: اى پروردگار من، مرا بيامرز و مرا مُلكى عطا كن كه پس از من كسى سزاوار آن نباشد، كه تو بخشاينده‌اى"},{"number":36,"text":"پس باد را رام او كرديم كه به نرمى هر جا كه آهنگ مى‌كرد، به فرمان او مى‌رفت"},{"number":37,"text":"و ديوان را، كه هم بنّا بودند و هم غوّاص"},{"number":38,"text":"و گروهى ديگر را، كه همه بسته در زنجير او بودند"},{"number":39,"text":"اين عطاى بى‌حساب ماست خواهى آن را ببخش و خواهى نگه دار"},{"number":40,"text":"او راست نزد ما تقرب و بازگشتى نيكو"},{"number":41,"text":"و از بنده ما ايّوب ياد كن آنگاه كه پروردگارش را ندا داد كه: مرا شيطان به رنج و عذاب افكنده است"},{"number":42,"text":"پايت را بر زمين بكوب: اين آبى است براى شستشو و سرد براى آشاميدن"},{"number":43,"text":"و به او خانواده‌اش و همچند آن از ديگر ياران را عطا كرديم و اين خود رحمتى از ما بود و براى خردمندان اندرزى"},{"number":44,"text":"دسته‌اى از چوبهاى باريك به دست گير و با آن بزن و سوگند خويش را مشكن. او را بنده‌اى صابر يافتيم. او كه همواره روى به درگاه ما داشت چه نيكو بنده‌اى بود"},{"number":45,"text":"بندگان ما ابراهيم و اسحاق و يعقوب آن مردان قدرتمند و بابصيرت را ياد كن"},{"number":46,"text":"آنان را خصلت پاكدلى بخشيديم تا ياد قيامت كنند"},{"number":47,"text":"آنها در نزد ما برگزيدگان و نيكانند"},{"number":48,"text":"و اسماعيل و اَليَسع و ذوالكِفل را ياد كن كه همه از نيكانند"},{"number":49,"text":"اين قرآن پندى است، و پرهيزكاران را بازگشتى نيكوست؛"},{"number":50,"text":"بهشتهاى جاويدان كه درِ آن به رويشان گشاده است"},{"number":51,"text":"در آنجا تكيه زده‌اند و هرگونه ميوه و نوشيدنى كه بخواهند مى‌طلبند"},{"number":52,"text":"زنانى همسال از آن گونه كه جز به شوى خويش نظر ندارند نزد آنهايند"},{"number":53,"text":"اين است آن چيزهايى كه براى روز حساب به شما وعده داده‌اند"},{"number":54,"text":"اين رزق ماست كه پايان نيافتنى است،"},{"number":55,"text":"چنين است. و سركشان را بدترين بازگشتهاست"},{"number":56,"text":"به جهنم مى‌روند كه بد جايگاهى است"},{"number":57,"text":"بايد آب جوشان و چرك و خونابه دوزخيان را بنوشند"},{"number":58,"text":"و شكنجه‌هايى ديگر، از هر نوع"},{"number":59,"text":"اين گروه با شما به آتش در مى‌آيند. خوش آمدشان مباد كه به آتش مى‌افتند"},{"number":60,"text":"گويند: نه، خوش آمد شما را مباد. شما اين عذاب را پيشاپيش براى ما فرستاده بوديد، چه بد جايگاهى است"},{"number":61,"text":"گويند: اى پروردگار ما، هر كس كه اين عذاب را پيشاپيش براى ما آماده كرده است عذابش را در آتش دو چندان افزون كن"},{"number":62,"text":"و گويند: چرا مردانى را كه از اشرار مى‌شمرديم اكنون نمى‌بينيم؟"},{"number":63,"text":"آنان را به مسخره مى‌گرفتيم. آيا از نظرها دور مانده‌اند؟"},{"number":64,"text":"اين جدال اهل جهنم با يكديگر چيزى است كه به حقيقت واقع شود"},{"number":65,"text":"بگو: جز اين نيست كه من بيم‌دهنده‌اى هستم و هيچ خدايى جز خداى يكتاى قهار نيست"},{"number":66,"text":"آن پيروزمند و آمرزنده، پروردگار آسمانها و زمين و هر چه ميان آنهاست"},{"number":67,"text":"بگو: اين خبرى بزرگ است،"},{"number":68,"text":"كه شما از آن اعراض مى‌كنيد"},{"number":69,"text":"هنگامى كه با يكديگر جدال مى‌كردند من خبرى از ساكنان عالم بالا نداشتم"},{"number":70,"text":"تنها از آن روى به من وحى مى‌شود كه بيم‌دهنده‌اى روشنگر هستم"},{"number":71,"text":"پروردگارت به فرشتگان گفت: من بشرى را از گل مى‌آفرينم"},{"number":72,"text":"چون تمامش كردم و در آن از روح خود دميدم، همه سجده‌اش كنيد"},{"number":73,"text":"همه فرشتگان سجده كردند"},{"number":74,"text":"مگر ابليس كه بزرگى فروخت و از كافران شد"},{"number":75,"text":"گفت: اى ابليس، چه چيز تو را از سجده كردن در برابر آنچه من با دو دست خود آفريده‌ام منع كرد؟ آيا بزرگى فروختى يا مقامى ارجمند داشتى؟"},{"number":76,"text":"گفت: من از او بهترم. مرا از آتش آفريده‌اى و او را از گل"},{"number":77,"text":"گفت: از اينجا بيرون شو كه تو مطرودى"},{"number":78,"text":"و تا روز قيامت لعنت من بر توست"},{"number":79,"text":"گفت: اى پروردگار من، مرا تا روزى كه از نو زنده شوند مهلت ده"},{"number":80,"text":"گفت: تو از مهلت يافتگانى،"},{"number":81,"text":"تا آن روز معين معلوم"},{"number":82,"text":"گفت: به عزت تو سوگند كه همگان را گمراه كنم،"},{"number":83,"text":"مگر آنها كه از بندگان مخلص تو باشند"},{"number":84,"text":"گفت: حق است و آنچه مى‌گويم راست است"},{"number":85,"text":"كه جهنم را از تو و از همه پيروانت پر كنم"},{"number":86,"text":"بگو: من از شما مزدى نمى‌طلبم و نيستم از آنان كه به دروغ چيزى بر خود مى‌بندند"},{"number":87,"text":"و اين جز اندرزى براى مردم جهان نيست"},{"number":88,"text":"و تو بعد از اين از خبر آن آگاه خواهى شد"}]}