{"number":56,"edition":"th.thai","ayahs":[{"number":1,"text":"เมื่อเหตุการณ์ (วันกิยามะฮ.) ได้เกิดขึ้น"},{"number":2,"text":"ไม่มีผู้ปฏิเสธคนใดปฏิเสธต่อเหตุการณ์ของมัน"},{"number":3,"text":"ต่อเหตุการณ์นั้นทำให้ชนกลุ่มหนึ่งต่ำต้อย ชนอีกกลุ่มหนึ่งสูงส่ง"},{"number":4,"text":"เมื่อแผ่นดินถูกสั่นสะเทือนอย่างรุนแรง"},{"number":5,"text":"และบรรดาภูเขาได้แตกสลาย"},{"number":6,"text":"และมันกลายเป็นผุยผงปลิวว่อน"},{"number":7,"text":"และพวกเจ้าจะแยกออกเป็นสามกลุ่ม"},{"number":8,"text":"คือกลุ่มทางขวา (ผู้ได้รับบันทึกด้วยมือขวา) เจ้ารู้ได้อย่างไรว่ากลุ่มทางขวาคือใคร"},{"number":9,"text":"และกลุ่มทางซ้าย (ผู้ได้รับบันทึกด้วยมือซ้าย) เจ้ารู้ได้อย่างไรว่ากลุ่มทางซ้ายคือใคร"},{"number":10,"text":"และกลุ่มแนวหน้า คือกลุ่มแนวหน้า"},{"number":11,"text":"เขาเหล่านั้น คือบรรดาผู้ใกล้ชิด"},{"number":12,"text":"ในสวนสวรรค์หลากหลายแห่งความสุขสำราญ"},{"number":13,"text":"เป็นกลุ่มชนจำนวนมาก จากชนรุ่นก่อน ๆ"},{"number":14,"text":"และเป็นกลุ่มชนจำนวนน้อย จากชนรุ่นหลัง ๆ"},{"number":15,"text":"โดยอยู่บนเตียงที่ประดับด้วยทองคำ"},{"number":16,"text":"พวกเขานอนเอกเขนกอยู่บนนั้น โดยผินหน้าเข้าหากัน"},{"number":17,"text":"มีเด็ก ๆ ที่มีอายุเช่นนั้น วนเวียนรับใช้พวกเขาตลอดไป"},{"number":18,"text":"ถ้วยภาชนะใหญ่ และแก้วที่มีหู และจอกใส่สุราที่ไหลรินมา"},{"number":19,"text":"พวกเขาจะไม่มึนศรีษะ และไม่หมดสติ เมื่อดื่มสุรานั้น"},{"number":20,"text":"และผลไม้หลากชนิด ตามแต่พวกเขาจะเลือกกิน"},{"number":21,"text":"และเนื้อนกที่พวกเขาอยากรับประทาน"},{"number":22,"text":"และหญิงสาวที่มีนัยตาคมสวยงาม"},{"number":23,"text":"ประหนึ่งไข่มุกที่ถูกพิทักษ์รักษาไว้อย่างดี"},{"number":24,"text":"ทั้งนี้เป็นการตอบแทนเนื่องจากความดีที่พวกเขากระทำไว้"},{"number":25,"text":"ในสวนสวรรค์นั้นพวกเขาจะไม่ได้ยินคำพูดที่ไร้สาระ และเป็นบาป"},{"number":26,"text":"เว้นแต่คำกล่าวที่ว่า ศานติ ศานติ"},{"number":27,"text":"และกลุ่มทางขวา (ผู้ได้รับบันทึกด้วยมือขวา) เจ้ารู้หรือไม่ว่ากลุ่มทางขวาเป็นอย่างไร"},{"number":28,"text":"(พวกเขา) อยู่ภายใต้ต้นพุทราที่ไร้หนาม"},{"number":29,"text":"และต้นกล้วยที่ออกผลเป็นเครือตั้งแต่ยอดจรดโคนต้น (ไม่เห็นลำต้น)"},{"number":30,"text":"และร่มเงาที่แผ่กระจาย"},{"number":31,"text":"และน้ำที่ไหลรินตลอดเวลา"},{"number":32,"text":"และผลไม้อันมากหลาย"},{"number":33,"text":"โดยไม่หมดสิ้นตามฤดูและไม่เป็นที่ต้องห้าม"},{"number":34,"text":"และเตียงนอนที่ถูกยกให้สูงขึ้น"},{"number":35,"text":"แท้จริงเราได้บังเกิดพวกนาง เป็นกรณีพิเศษจริง ๆ"},{"number":36,"text":"แล้วเราได้ทำให้พวกนางเป็นสาวพรหมจรรย์"},{"number":37,"text":"เป็นที่น่ารักชื่มชมแก่คู่ครอง อยู่ในวัยสาวคราวเดียวกัน"},{"number":38,"text":"สำหรับกลุ่มทางขวา (ผู้ได้รับบันทึกด้วยมือขวา)"},{"number":39,"text":"(คือ)กลุ่มชนจากรุ่นก่อน ๆ"},{"number":40,"text":"และกลุ่มชนจากรุ่นหลัง ๆ"},{"number":41,"text":"และกลุ่มทางซ้าย (ผู้ได้รับบันทึกด้วยมือซ้าย) เจ้ารู้หรือไม่ว่ากลุ่มทางซ้ายเป็นอย่างไร"},{"number":42,"text":"อยู่ในลมร้อน และน้ำกำลังเดือด"},{"number":43,"text":"อยู่ใต้ร่มเงาของควันที่ดำทึบ"},{"number":44,"text":"ไม่ร่มเย็น และไม่เป็นที่น่าชื่มชม"},{"number":45,"text":"แท้จริงพวกเขาแต่กาลก่อนนั้นเป็นพวกเจ้าสำราญ"},{"number":46,"text":"และพวกเขาเคยดื้อรั้นในการทำบาปใหญ่ ๆ อยู่เป็นเนือง"},{"number":47,"text":"และพวกเขาเคยกล่าวว่า เมื่อเราตายไปแล้วและเราได้กลายเป็นดินผงและกระดูกป่น แล้วเราจะถูกให้ฟื้นคืนชีพอีกกระนั้นหรือ"},{"number":48,"text":"และรวมทั้งบรรพบุรุษของเราแต่กาลก่อนนั้นด้วยหรือ"},{"number":49,"text":"จงกล่าวเถิด (มุฮัมมัด) แท้จริงชนรุ่นก่อน ๆ และรุ่นหลัง ๆ นั้น"},{"number":50,"text":"จะถูกรวบรวมไว้จนกระทั่งถึงวันอันเป็นที่รู้กัน (วันกิยามะฮ)"},{"number":51,"text":"แล้วรวมทั้งพวกเจ้าอีกด้วย โอ้บรรดาผู้หลงผิด บรรดาผู้ปฏิเสธทั้งหลาย"},{"number":52,"text":"แน่นอนพวกเจ้าจะเป็นผู้กินต้นซักกูม"},{"number":53,"text":"และพวกเขาจะใส่มันเข้าไปเต็มท้อง"},{"number":54,"text":"และพวกเขาจะดื่มน้ำกำลังเดือดตามลงไป"},{"number":55,"text":"พวกเขาจะดื่ม (น้ำ) เช่นกับการดื่มของอูฐ ที่กระหายน้ำจัด"},{"number":56,"text":"นี่คือที่พำนักของพวกเขาในวันแห่งการตอบแทน"},{"number":57,"text":"เรานั้นได้สร้างพวกเจ้าขึ้นมา ไฉนเล่าพวกเจ้าจึงไม่เชื่อ (ในวันฟื้นคืนชีพ)"},{"number":58,"text":"พวกเจ้าเห็นสิ่งที่พวกเจ้าหลั่งออกมา (อสุจิ) แล้วมิใช่หรือ"},{"number":59,"text":"พวกเจ้าสร้างมันขึ้นมา หรือว่าเราเป็นผู้สร้าง"},{"number":60,"text":"เรานั้นเป็นผู้กำหนดความตายขึ้นในระหว่างพวกเจ้า และเราก็จะไม่ถูกขัดขวาง"},{"number":61,"text":"ในการที่เราจะเปลี่ยนบุคคลเยี่ยงพวกเจ้า และเราจะให้พวกเจ้าเกิดขึ้นมาอีกในสิ่งที่พวกเจ้าไม่รู้"},{"number":62,"text":"และโดยแน่นอน พวกเจ้าได้รู้มาแล้วถึงการเกิดครั้งแรก แล้วไฉนเล่าพวกเจ้าจึงไม่ใคร่ครวญ"},{"number":63,"text":"พวกเจ้าเห็นสิ่งที่พวกเจ้าหว่านมาแล้วมิใช่หรือ"},{"number":64,"text":"พวกเจ้าทำให้มันงอกเงยขึ้นมา หรือว่าเราเป็นผู้ทำให้มันงอกเงยขึ้นมา"},{"number":65,"text":"หากเราประสงค์ทำให้มันหักเป็นชิ้น ๆ แล้ว แน่นอนเราก็ย่อมทำมันได้ แล้วพวกเจ้าคงประหลาดใจ"},{"number":66,"text":"(พวกเจ้าจะกล่าวขึ้นว่า) แท้จริงเราได้รับความหายนะแล้ว"},{"number":67,"text":"ไม่เพียงแต่เท่านั้น เรายังขาดแคลนปัจจัยเพาะปลูกอีกด้วย"},{"number":68,"text":"พวกเจ้าเห็นน้ำที่พวกเจ้าดื่มแล้วมิใช่หรือ"},{"number":69,"text":"พวกเจ้าเป็นผู้หลั่งมันลงมาจากก้อนเมฆ หรือว่าเราเป็นผู้หลั่งมันลงมา"},{"number":70,"text":"หากเราประสงค์ เราจะทำให้มันเค็มจัด แล้วไฉนเล่าพวกเจ้าจึงไม่กตัญญู"},{"number":71,"text":"พวกเจ้าเห็นไฟที่พวกเจ้าจุดขึ้นมาแล้วมิใช่หรือ"},{"number":72,"text":"พวกเจ้าเป็นผู้ทำให้ต้นไม้ของมันงอกเงยขึ้นมา หรือว่าเราเป็นผู้ทำให้มันงอกขึ้นมา"},{"number":73,"text":"เราได้ทำให้มันมีขึ้นเพื่อเป็นการเตือนสติ และอำนวนประโยชน์แก่ผู้เดินทางรอนแรม"},{"number":74,"text":"ดังนั้น เจ้าจงสดุดีด้วยพระนามแห่งพระเจ้าของเจ้าผู้ทรงยิ่งใหญ่เถิด"},{"number":75,"text":"ข้า (อัลลอฮ.) ขอสาบานด้วยตำแหน่งต่าง ๆ ของดวงดาว"},{"number":76,"text":"และแท้จริงมันเป็นการสาบานอันยิ่งใหญ่ หากพวกเจ้ารู้"},{"number":77,"text":"นั่นคือ กุรอานอันทรงเกียรติ"},{"number":78,"text":"ซึ่งอยู่ในบันทึกที่ถูกพิทักษ์รักษาไว้"},{"number":79,"text":"ไม่มีผู้ใดจะแตะต้องอัลกุรอาน นอกจากบรรดาผู้บริสุทธิ์เท่านั้น"},{"number":80,"text":"ถูกประทานลงมาจากพระเจ้าแห่งสากลโลก"},{"number":81,"text":"และด้วยเรื่องนี้ (อัลกุรอาน) กระนั้นหรือที่พวกเจ้าปฏิเสธเย้ยหยัน"},{"number":82,"text":"และทั้งๆ ที่พระองค์ทรงประทานปัจจัยยังชีพแก่พวกเจ้า พวกเจ้าก็ยังคงปฏิเสธศรัทธาต่ออัลลอฮฺ กระนั้นหรือ"},{"number":83,"text":"และเมื่อวิญญาณได้มาถึงคอหอย (กำลังจะตาย) แล้วพวกเจ้าสามารถจะยับยั้งไว้ได้หรือ"},{"number":84,"text":"และในขณะนั้นพวกเจ้ากำลังมองดูกันอยู่"},{"number":85,"text":"และเรานั้นอยู่ใกล้ชิดเขายิ่งกว่าพวกเจ้าแต่ทว่าพวกเจ้ามองไม่เห็น(มะลาอิกะฮ)"},{"number":86,"text":"หากว่าพวกเจ้ามิได้อยู่ภายใต้อำนาจของผู้ใด และไม่มีพระเจ้าเป็นผู้มีอำนาจเหนือพวกเจ้าแล้ว"},{"number":87,"text":"ไฉนเล่า พวกเจ้าจึงไม่ให้วิญญาณกลับมาสู่ร่างอีก หากพวกเจ้าพูดจริง"},{"number":88,"text":"สำหรับผู้ที่หากว่าเขา (ผู้ตาย) เป็นผู้ใกล้ชิดกับอัลลอฮ"},{"number":89,"text":"ดังนั้นความอิ่มเอิบสดชื่น และสวรรค์อันเป็นที่โปรดปรานจะได้แก่เขา"},{"number":90,"text":"และหากว่าเขาอยู่ในกลุ่มทางขวา (ผู้ได้รับบันทึกด้วยมือขวา)"},{"number":91,"text":"ดังนั้นความปลอดภัยก็เป็นของเจ้า ในฐานะเป็นผู้อยู่ ในกลุ่มทางขวา (ผู้ได้รับบันทึกด้วยมือขวา)"},{"number":92,"text":"และหากว่าเขาอยู่ในหมู่ผู้ปฏิเสธหลงทาง"},{"number":93,"text":"ดังนั้นสิ่งที่เตรียมไว้สำหรับเขาก็คือน้ำร้อนที่กำลังเดือด"},{"number":94,"text":"และเปลวไฟที่ลุกไหม้"},{"number":95,"text":"แท้จริงนี้แหละคือความจริงที่แน่นอน"},{"number":96,"text":"ดังนั้นเจ้าจงสดุดีด้วยพระนามพระเจ้าของเจ้าผู้ยิ่งใหญ่เถิด"}]}