{"number":77,"edition":"th.thai","ayahs":[{"number":1,"text":"ขอสาบานต่อลมที่พัดออกมาติดต่อกัน"},{"number":2,"text":"ขอสาบานต่อลมพายุที่พัดมาอย่างแรง"},{"number":3,"text":"ขอสาบานต่อมะลาอิกะฮฺที่อุ้มเมฆฝน"},{"number":4,"text":"ขอสาบานต่อมะลาอิกะฮฺที่จำแนกระหว่างความจริงกับความเท็จ"},{"number":5,"text":"ขอสาบานต่อมะลาอิกะฮฺที่นำมามอบแก่บรรดานะบี"},{"number":6,"text":"ด้วยการให้เหตุผลและการเตือนสำทับ"},{"number":7,"text":"แท้จริงสิ่งที่พวกเจ้าถูกสัญญาไว้นั้น จะเกิดขึ้นอย่างแน่นอน"},{"number":8,"text":"เมื่อดวงดาวถูกทำให้มืดลง"},{"number":9,"text":"และเมื่อชั้นฟ้าถูกแยกออก"},{"number":10,"text":"และเมื่อภูเขาถูกแตกออกเป็นผุยผง"},{"number":11,"text":"และเมื่อบรรดาร่อซูลถูกรวมไว้ตามเวลาที่กำหนด"},{"number":12,"text":"สำหรับวันไหนเล่าที่พวกเขา (บรรดาร่อซูล) ถูกเลื่อนออกไป"},{"number":13,"text":"สำหรับวันแห่งการตัดสิน"},{"number":14,"text":"และอันใดเล่าให้เจ้ารู้ได้ว่าวันแห่งการตัดสินคืออะไร"},{"number":15,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":16,"text":"เรามิได้ทำลายชนชาติรุ่นก่อน ๆ ดอกหรือ"},{"number":17,"text":"หลังจากนั้นเราได้ให้ชนชาติรุ่นหลัง ๆ ปฏิบัติตามพวกเขา"},{"number":18,"text":"เช่นนั้นแหละเราได้ปฏิบัติแก่บรรดาอาชญากร"},{"number":19,"text":"ความหายนะในวันนั้น จงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":20,"text":"เรามิได้สร้างพวกเจ้าจากน้ำที่ต่ำต้อยไร้ค่า (อสุจิ) ดอกหรือ"},{"number":21,"text":"แล้วเราได้ให้เข้าไปอยู่ในที่อับมั่นคง (มดลูก)"},{"number":22,"text":"จนถึงกำหนดอันแน่นอน"},{"number":23,"text":"ดังนั้นเราได้กำหนดไว้แล้ว เราจึงเป็นผู้กำหนดที่ดีเลิศจริง ๆ"},{"number":24,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":25,"text":"และเรามิได้ทำให้แผ่นดินนี้เป็นจุดรวมดอกหรือ"},{"number":26,"text":"ทั้งคนเป็นและคนตาย"},{"number":27,"text":"และในแผ่นดินเราได้ตั้งภูเขาไว้สูงตะหง่าน และเราได้ให้พวกเจ้าดื่มน้ำจืดสนิท"},{"number":28,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":29,"text":"(จะมีเสียงกล่าวขึ้นว่า) พวกเจ้าจงออกเดินไปยังที่พวกเจ้าเคยปฏิเสธ"},{"number":30,"text":"จงออกเดินไปยังเงาควันสามแฉก"},{"number":31,"text":"(มัน) ไม่ทำให้เกิดร่ม และจะไม่ช่วยให้พ้นจากเปลวไฟได้"},{"number":32,"text":"แท้จริงมันจะพ่นประกายออกมา (มีขนาด) เท่าป้อมปราการ"},{"number":33,"text":"ประหนึ่งมัน (ประกายนั้น) เป็นอูฐสีเหลืองเข้ม"},{"number":34,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":35,"text":"นี่คือวันที่พวกเขาไม่สามารถจะพูดออกมาได้"},{"number":36,"text":"และจะไม่เปิดโอกาสให้แก่พวกเขาเพื่อแก้ตัว"},{"number":37,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":38,"text":"นี่คือวันแห่งการตัดสิน เราได้รวบรวมพวกเจ้าไว้กับชนชาติรุ่นก่อน ๆ"},{"number":39,"text":"ดังนั้นถ้าพวกเจ้ามีแผนอุบายอันใดก็จงวางแผนต่อข้า"},{"number":40,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":41,"text":"แท้จริงบรรดาผู้ยำเกรงจะอยู่ท่ามกลางร่มเงาและน้ำพุ"},{"number":42,"text":"และผลไม้ตามที่พวกเขาต้องการ"},{"number":43,"text":"พวกเจ้าจงกินจงดื่มอย่างสบายใจตามที่พวกเจ้าได้กระทำไว้"},{"number":44,"text":"แท้จริงเช่นนั้นแหละเราจะตอบแทนผู้กระทำความดีทั้งหลาย"},{"number":45,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":46,"text":"พวกเจ้าจงกินและรื่นรมย์เพียงเล็กน้อย แท้จริงพวกเจ้านั้นเป็นอาชญากร"},{"number":47,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":48,"text":"เมื่อได้กล่าวแก่พวกเขาว่า จงรุกั๊วะ พวกเขาก็จะไม่รุกั๊วะ"},{"number":49,"text":"ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ"},{"number":50,"text":"ดังนั้น คำบอกเล่าอันใดเล่าหลังจากอัลกุรอานที่พวกเขาจะศรัทธากัน"}]}