{"number":38,"edition":"bs.korkut","ayahs":[{"number":1,"text":"Sād. Tako Mi Kur'ana slavnog"},{"number":2,"text":"doista su bahati i inadžije oni koji neće da vjeruju"},{"number":3,"text":"Koliko smo Mi naroda prije njih uništili. I oni su za pomoć vapili, ali je bilo kasno"},{"number":4,"text":"Oni se čude što im je jedan od njih došao da ih opominje, i govore nevjernici: \"Ovo je čarobnjak, lažov"},{"number":5,"text":"Zar on da bogove svede na Boga jednog? To je, zaista, nešto veoma čudno"},{"number":6,"text":"I onī ugledni između njih krenuše: \"Idite i ostanite pri klanjanju bogovima svojim, ovim se, uistinu, nešto veliko hoće"},{"number":7,"text":"Za ovo nismo čuli u vjeri predaka naših, ovo nije ništa drugo već namještena laž"},{"number":8,"text":"zašto baš njemu, između nas, da bude poslana Opomena?!\" Ali, oni u Opomenu Moju sumnjaju zato što kaznu Moju nisu iskusili"},{"number":9,"text":"Zar su u njih riznice milosti Gospodara tvoga, Silnoga i Darežljivog"},{"number":10,"text":"Zar oni imaju vlast na nebesima i na Zemlji i nad onim što je između njih? – neka se, onda, uz ljestve popnu"},{"number":11,"text":"Oni predstavljaju neznatnu urotničku vojsku koja će tamo biti poražena"},{"number":12,"text":"I prije njih su narod Nuhov, i Ad, i faraon, vlasnik građevina ogromnih, poricali"},{"number":13,"text":"i Semud i Lutov narod i stanovnici Ejke; oni su se protiv poslanika urotili"},{"number":14,"text":"svi su oni poslanike u laž utjerivali i kaznu Moju zaslužili"},{"number":15,"text":"A i ovi ne čekaju do jedan zvuk Roga koji neće biti potrebno ponoviti"},{"number":16,"text":"i govore: \"Gospodaru naš, požuri, kazni nas, prije Dana u kojem će se račun polagati"},{"number":17,"text":"Ti otrpi ono što oni govore i sjeti se roba Našeg Davuda, čvrstog u vjeri, koji se uvijek Allahu obraćao"},{"number":18,"text":"Mi smo brda potčinili da zajedno s njim hvale Allaha prije nego što Sunce zađe i poslije pošto grane"},{"number":19,"text":"a i ptice okupljene – svi su oni zbog njegova hvaljenja hvalu ponavljali"},{"number":20,"text":"I učvrstili smo carstvo njegovo i dali mu vjerovjesništvo i sposobnost da rasuđuje"},{"number":21,"text":"A da li je do tebe doprla vijest o parničarima kada su preko zida hrama prešli"},{"number":22,"text":"kad su Davudu upali, pa se on njih uplašio. \"Ne boj se\" – rekli su – \"mi smo dvojica parničara, jedan drugom smo nažao učinili, pa nam po pravdi presudi; ne budi pristrasan, i na Pravi put nas uputi"},{"number":23,"text":"Ovaj prijatelj moj ima devedeset i devet ovaca, a ja samo jednu, i on mi reče: 'Daj ti nju meni!' – i u prepirci me pobijedi"},{"number":24,"text":"Učinio ti je, doista, krivo!\" – reče Davud – \"time što je tražio da tvoju ovcu doda ovcama svojim; mnogi ortaci čine nepravdu jedni drugima, ne čine jedino oni koji vjeruju i rade dobra djela; a takvih je malo.\" I Davud se uvjeri da smo Mi baš njega na kušnju stavili, pa oprost od Gospodara svoga zamoli, pade licem na tle i pokaja se"},{"number":25,"text":"I Mi smo mu to oprostili, i on je, doista, blizak Nama i divno prebivalište ga čeka"},{"number":26,"text":"O Davude, Mi smo te namjesnikom na Zemlji učinili, zato sudi ljudima po pravdi i ne povodi se za strašću da te ne odvede s Allahova puta; one koji skreću s Allahova puta čeka teška patnja na onome svijetu zato što su zaboravljali na Dan u kome će se račun polagati"},{"number":27,"text":"Mi nismo uzalud stvorili nebo i Zemlju i ono što je između njih; tako misle nevjernici, pa teško nevjernicima kad budu u vatri"},{"number":28,"text":"Zar ćemo postupiti s onima koji vjeruju i čine dobro kao s onima koji prave nered na Zemlji, ili, zar ćemo postupiti s onima koji se grijeha klone isto kao i s grješnicima"},{"number":29,"text":"Knjiga koju ti objavljujemo blagoslovljena je, da bi oni o riječima njezinim razmislili i da bi oni koji su razumom obdareni pouku primili"},{"number":30,"text":"Mi smo Davudu poklonili Sulejmana, divan je on rob bio, i mnogo se kajao"},{"number":31,"text":"Kad su jedne večeri preda nj bili izvedeni punokrvni konji koji su na tri noge stajali, a četvrtom jedva zemlju doticali"},{"number":32,"text":"on reče: \"Umjesto da mislim na Gospodara svoga, ja pokazujem ljubav prema blagu!\" – i oni se izgubiše iz vida"},{"number":33,"text":"Vratite mi ih!\" – i on ih poče gladiti po nogama i vratovima"},{"number":34,"text":"Mi smo Sulejmana u iskušenje doveli i njegovo bolesno tijelo na prijestolju zadržali, ali je poslije ozdravio"},{"number":35,"text":"Gospodaru moj\" – rekao je – \"oprosti mi i daruj mi vlast kakvu niko, osim mene, neće imati! Ti, uistinu, bogato daruješ"},{"number":36,"text":"I Mi smo dali da mu služe: vjetar – koji je prema zapovijedi njegovoj blago puhao onamo kuda je on htio –"},{"number":37,"text":"i šejtani, sve graditelji i gnjurci"},{"number":38,"text":"i drugi u bukagije okovani"},{"number":39,"text":"Ovo je Naš dar, pa ti oslobodi ili zadrži, nećeš zbog toga odgovarati"},{"number":40,"text":"On je, doista, blizak Nama i čeka ga krasno prebivalište"},{"number":41,"text":"I sjeti se roba Našeg Ejjuba kada je Gospodaru svome zavapio: \"Šejtan me na zlo navraća i misli lažne mi uliva"},{"number":42,"text":"Udari nogom o zemlju – eto hladne vode za kupanje i piće!\" –"},{"number":43,"text":"i Mi smo mu iz milosti Naše čeljad njegovu darovali i još toliko uz njih, da bude pouka za one koji imaju pameti –"},{"number":44,"text":"I uzmi rukom svojom snop i njime udari, samo zakletvu ne prekrši!\" Mi smo znali da je on izdržljiv; divan je rob on bio i mnogo se kajao"},{"number":45,"text":"I sjeti se robova Naših Ibrahima i Ishaka i Jakuba, sve u vjeri čvrstih i dalekovidnih"},{"number":46,"text":"Mi ih posebno obdarismo vrlinom jednom: da im je uvijek bio na umu onaj svijet"},{"number":47,"text":"i oni su, zaista, u Nas od onih odabranih dobrih ljudi"},{"number":48,"text":"I sjeti se Ismaila i Eljese'a i Zulkifla, svi su oni bili dobri"},{"number":49,"text":"Ovo je lijep spomen! A one koji se grijeha budu klonili čeka divno prebivalište"},{"number":50,"text":"edenski vrtovi, čije će kapije biti za njih otvorene"},{"number":51,"text":"u kojima će se odmarati, i raznovrsno voće i piće tražiti"},{"number":52,"text":"Pored njih biće hurije, istih godina, koje će preda se gledati"},{"number":53,"text":"To je ono što vam se obećava za Dan u kome će se račun polagati"},{"number":54,"text":"to će, doista, blagodat Naša biti, koja nikada neće prestajati"},{"number":55,"text":"Eto toliko! A one koji budu zlo činili čeka najgore prebivalište"},{"number":56,"text":"Džehennem, u kojem će gorjeti; a grozne li postelje"},{"number":57,"text":"Eto toliko! Pa neka okušaju vodu ključalu i kapljevinu smrdljivu"},{"number":58,"text":"i druge slične ovima muke, mnogostruke"},{"number":59,"text":"Ova gomila će zajedno s vama tiskajući se u Džehennem ući!\" – \"Ne bilo im prostrano! U vatri će oni, doista, gorjeti"},{"number":60,"text":"Vama ne bilo prostrano!\" – reći će oni – \"vi ste nam ovo pripremili, a grozna li boravišta"},{"number":61,"text":"Gospodaru naš\" – reći će – \"udvostruči patnju u vatri onima koji su nam ovo priredili"},{"number":62,"text":"I govoriće: \"Zašto ne vidimo ljude koje smo u zle ubrajali"},{"number":63,"text":"i koje smo ismijavali? Da nam se nisu iz vida izgubili"},{"number":64,"text":"Istina je, sigurno, da će se stanovnici Džehennema među sobom raspravljati"},{"number":65,"text":"Reci: \"Ja samo opominjem; nema boga osim Allaha, Jedinoga i Moćnog"},{"number":66,"text":"Gospodara nebesa i Zemlje i onoga što je između njih, Silnoga, Onoga koji prašta"},{"number":67,"text":"Reci: \"Ovo je vijest velika"},{"number":68,"text":"a vi od nje glave okrećete"},{"number":69,"text":"Ja nisam ništa znao o melekima uzvišenim kada su se prepirali –"},{"number":70,"text":"meni se objavljuje samo da jasno opominjem\" –"},{"number":71,"text":"i kad je melekima Gospodar tvoj rekao: \"Stvoriću čovjeka od ilovače"},{"number":72,"text":"pa kad mu savršen oblik dam u život u nj udahnem, vi mu se poklonite"},{"number":73,"text":"meleki su se, svi do posljednjeg, zajedno poklonili"},{"number":74,"text":"osim Iblisa; on se uzoholio i postao nevjernik"},{"number":75,"text":"O Iblisu!\" – rekao je On – \"šta te navelo da se ne pokloniš onome koga sam sobom stvorio? Jesi li se uzoholio ili misliš da si uzvišen"},{"number":76,"text":"Bolji sam od njega\" – rekao je on – \"mene si stvorio od vatre a njega od ilovače"},{"number":77,"text":"E, izlazi onda iz Dženneta!\" – reče On – \"proklet da si"},{"number":78,"text":"Moje prokletstvo će te do Sudnjeg dana pratiti"},{"number":79,"text":"Gospodaru moj\" – reče on – \"daj mi vremena do Dana kada će oni oživljeni biti"},{"number":80,"text":"Dajem ti\" – reče On –"},{"number":81,"text":"do Dana već određenog"},{"number":82,"text":"E tako mi dostojanstva Tvoga\" – reče – \"sigurno ću ih sve na stranputicu navesti"},{"number":83,"text":"osim Tvojih među njima robova iskrenih"},{"number":84,"text":"Istinom se kunem i istinu govorim\" – reče Allah –"},{"number":85,"text":"sigurno ću sa svima, tobom i onima koji se budu poveli za tobom, Džehennem napuniti"},{"number":86,"text":"Reci: \"Ne tražim ja od vas za ovo nikakvu nagradu i ja nisam izvještačen"},{"number":87,"text":"Kur'an je doista svijetu cijelome opomena! –"},{"number":88,"text":"i vi ćete uskoro saznati njegovu poruku"}]}