{"number":74,"edition":"ur.junagarhi","ayahs":[{"number":1,"text":"اے کپڑا اوڑھنے والے"},{"number":2,"text":"کھڑا ہوجا اور آگاه کردے"},{"number":3,"text":"اور اپنے رب ہی کی بڑائیاں بیان کر"},{"number":4,"text":"اپنے کپڑوں کو پاک رکھا کر"},{"number":5,"text":"ناپاکی کو چھوڑ دے"},{"number":6,"text":"اور احسان کرکے زیاده لینے کی خواہش نہ کر"},{"number":7,"text":"اور اپنے رب کی راه میں صبر کر"},{"number":8,"text":"پس جب کہ صور میں پھونک ماری جائے گی"},{"number":9,"text":"تو وه دن بڑا سخت دن ہوگا"},{"number":10,"text":"جو کافروں پر آسان نہ ہوگا"},{"number":11,"text":"مجھے اور اسے چھوڑ دے جسے میں نے اکیلا پیدا کیا ہے"},{"number":12,"text":"اور اسے بہت سا مال دے رکھا ہے"},{"number":13,"text":"اور حاضر باش فرزند بھی"},{"number":14,"text":"اور میں نے اسے بہت کچھ کشادگی دے رکھی ہے"},{"number":15,"text":"پھر بھی اس کی چاہت ہے کہ میں اسے اور زیاده دوں"},{"number":16,"text":"نہیں نہیں، وه ہماری آیتوں کا مخالف ہے"},{"number":17,"text":"عنقریب میں اسے ایک سخت چڑھائی چڑھاؤں گا"},{"number":18,"text":"اس نے غور کرکے تجویز کی"},{"number":19,"text":"اسے ہلاکت ہو کیسی (تجویز) سوچی؟"},{"number":20,"text":"وه پھر غارت ہو کس طرح اندازه کیا"},{"number":21,"text":"اس نے پھر دیکھا"},{"number":22,"text":"پھر تیوری چڑھائی اور منھ بنایا"},{"number":23,"text":"پھر پیچھے ہٹ گیا اور غرور کیا"},{"number":24,"text":"اور کہنے لگا تو یہ صرف جادو ہے جو نقل کیا جاتا ہے"},{"number":25,"text":"سوائے انسانی کلام کے کچھ بھی نہیں ہے"},{"number":26,"text":"میں عنقریب اسے دوزخ میں ڈالوں گا"},{"number":27,"text":"اور تجھے کیا خبر کہ دوزخ کیا چیز ہے؟"},{"number":28,"text":"نہ وه باقی رکھتی ہے نہ چھوڑتی ہے"},{"number":29,"text":"کھال کو جھلسا دیتی ہے"},{"number":30,"text":"اور اس میں انیس (فرشتے مقرر) ہیں"},{"number":31,"text":"ہم نے دوزخ کے داروغے صرف فرشتے رکھے ہیں۔ اور ہم نے ان کی تعداد صرف کافروں کی آزمائش کے لیے مقرر کی ہے تاکہ اہل کتاب یقین کرلیں، اوراہل ایمان کے ایمان میں اضافہ ہو جائے اور اہل کتاب اور اہل ایمان شک نہ کریں اور جن کے دلوں میں بیماری ہے وه اور کافر کہیں کہ اس بیان سے اللہ تعالیٰ کی کیا مراد ہے؟ اسی طرح اللہ تعالیٰ جسے چاہتا ہے گمراه کرتا ہے اور جسے چاہتا ہے ہدایت دیتا ہے۔ تیرے رب کے لشکروں کو اس کے سوا کوئی نہیں جانتا، یہ تو کل بنی آدم کے لیے سراسر پند ونصیحت ہے"},{"number":32,"text":"سچ کہتا ہوں قسم ہے چاند کی"},{"number":33,"text":"اور رات کی جب وه پیچھے ہٹے"},{"number":34,"text":"اور صبح کی جب کہ روشن ہو جائے"},{"number":35,"text":"کہ (یقیناً وه جہنم) بڑی چیزوں میں سے ایک ہے"},{"number":36,"text":"بنی آدم کو ڈرانے والی"},{"number":37,"text":"(یعنی) اسے جو تم میں سے آگے بڑھنا چاہے یا پیچھے ہٹنا چاہے"},{"number":38,"text":"ہر شخص اپنے اعمال کے بدلے میں گروی ہے"},{"number":39,"text":"مگر دائیں ہاتھ والے"},{"number":40,"text":"کہ وه بہشتوں میں (بیٹھے ہوئے) گناه گاروں سے"},{"number":41,"text":"سوال کرتے ہوں گے"},{"number":42,"text":"تمہیں دوزخ میں کس چیز نے ڈاﻻ"},{"number":43,"text":"وه جواب دیں گے کہ ہم نمازی نہ تھے"},{"number":44,"text":"نہ مسکینوں کو کھانا کھلاتے تھے"},{"number":45,"text":"اور ہم بحﺚ کرنے والے (انکاریوں) کا ساتھ دے کر بحﺚ مباحثہ میں مشغول رہا کرتے تھے"},{"number":46,"text":"اور روز جزا کو جھٹلاتے تھے"},{"number":47,"text":"یہاں تک کہ ہمیں موت آگئی"},{"number":48,"text":"پس انہیں سفارش کرنے والوں کی سفارش نفع نہ دے گی"},{"number":49,"text":"انہیں کیا ہو گیا ہے؟ کہ نصیحت سے منھ موڑ رہے ہیں"},{"number":50,"text":"گویا کہ وه بِدکے ہوئے گدھے ہیں"},{"number":51,"text":"جو شیر سے بھاگے ہوں"},{"number":52,"text":"بلکہ ان میں سے ہر شخص چاہتا ہے کہ اسے کھلی ہوئی کتابیں دی جائیں"},{"number":53,"text":"ہرگز ایسا نہیں (ہوسکتا بلکہ) یہ قیامت سے بے خوف ہیں"},{"number":54,"text":"سچی بات تو یہ ہے کہ یہ (قرآن) ایک نصیحت ہے"},{"number":55,"text":"اب جو چاہے اس سے نصیحت حاصل کرے"},{"number":56,"text":"اور وه اس وقت نصیحت حاصل کریں گے جب اللہ تعالیٰ چاہے، وه اسی ﻻئق ہے کہ اس سے ڈریں اور اس ﻻئق بھی کہ وه بخشے"}]}