{"number":77,"edition":"ur.junagarhi","ayahs":[{"number":1,"text":"دل خوش کن چلتی ہواؤں کی قسم"},{"number":2,"text":"پھر زور سے جھونکا دینے والیوں کی قسم"},{"number":3,"text":"پھر (ابر کو) ابھار کر پراگنده کرنے والیوں کی قسم"},{"number":4,"text":"پھر حق وباطل کو جدا جدا کر دینے والے"},{"number":5,"text":"اور وحی ﻻنے والے فرشتوں کی قسم"},{"number":6,"text":"جو (وحی) الزام اتارنے یا آگاه کردینے کے لیے ہوتی ہے"},{"number":7,"text":"جس چیز کا تم سے وعده کیا جاتا ہے وہ یقیناً ہونے والی ہے"},{"number":8,"text":"پس جب ستارے بے نور کردئے جائیں گے"},{"number":9,"text":"اور جب آسمان توڑ پھوڑ دیا جائے گا"},{"number":10,"text":"اور جب پہاڑ ٹکڑے ٹکڑے کر کے اڑا دیئے جائیں گے"},{"number":11,"text":"اور جب رسولوں کو وقت مقرره پر ﻻیا جائے گا"},{"number":12,"text":"کس دن کے لیے (ان سب کو) مؤخر کیا گیا ہے؟"},{"number":13,"text":"فیصلے کے دن کے لیے"},{"number":14,"text":"اور تجھے کیا معلوم کہ فیصلے کا دن کیا ہے؟"},{"number":15,"text":"اس دن جھٹلانے والوں کی خرابی ہے"},{"number":16,"text":"کیا ہم نے اگلوں کو ہلاک نہیں کیا؟"},{"number":17,"text":"پھر ہم ان کے بعد پچھلوں کو ﻻئے"},{"number":18,"text":"ہم گنہگاروں کے ساتھ اسی طرح کرتے ہیں"},{"number":19,"text":"اس دن جھٹلانے والوں کے لیے ویل (افسوس) ہے"},{"number":20,"text":"کیا ہم نے تمہیں حقیر پانی سے (منی سے) پیدا نہیں کیا"},{"number":21,"text":"پھر ہم نے اسے مضبوط ومحفوظ جگہ میں رکھا"},{"number":22,"text":"ایک مقرره وقت تک"},{"number":23,"text":"پھر ہم نے اندازه کیا اور ہم کیا خوب اندازه کرنے والے ہیں"},{"number":24,"text":"اس دن تکذیب کرنے والوں کی خرابی ہے"},{"number":25,"text":"کیا ہم نے زمین کو سمیٹنے والی نہیں بنایا؟"},{"number":26,"text":"زندوں کو بھی اور مردوں کو بھی"},{"number":27,"text":"اور ہم نے اس میں بلند وبھاری پہاڑ بنادیے اور تمہیں سیراب کرنے واﻻ میٹھا پانی پلایا"},{"number":28,"text":"اس دن جھٹلانے والوں کے لیے وائے اور افسوس ہے"},{"number":29,"text":"اس دوزخ کی طرف جاؤ جسے تم جھٹلاتے رہے تھے"},{"number":30,"text":"چلو تین شاخوں والے سائے کی طرف"},{"number":31,"text":"جو در اصل نہ سایہ دینے واﻻ ہے اور نہ شعلے سے بچاسکتا ہے"},{"number":32,"text":"یقیناً دوزخ چنگاریاں پھینکتی ہے جو مثل محل کے ہیں"},{"number":33,"text":"گویا کہ وه زرد اونٹ ہیں"},{"number":34,"text":"آج ان جھٹلانے والوں کی درگت ہے"},{"number":35,"text":"آج (کا دن) وه دن ہے کہ یہ بول بھی نہ سکیں گے"},{"number":36,"text":"نہ انہیں معذرت کی اجازت دی جائے گی"},{"number":37,"text":"اس دن جھٹلانے والوں کی خرابی ہے"},{"number":38,"text":"یہ ہے فیصلے کا دن ہم نے تمہیں اور اگلوں کو سب کو جمع کرلیا ہے"},{"number":39,"text":"پس اگر تم مجھ سے کوئی چال چل سکتے ہو تو چل لو"},{"number":40,"text":"وائے ہے اس دن جھٹلانے والوں کے لیے"},{"number":41,"text":"بیشک پرہیزگار لوگ سایوں میں ہیں اور بہتے چشموں میں"},{"number":42,"text":"اور ان میووں میں جن کی وه خواہش کریں"},{"number":43,"text":"(اے جنتیو!) کھاؤ پیو مزے سےاپنے کیے ہوئے اعمال کے بدلے"},{"number":44,"text":"یقیناً ہم نیکی کرنے والوں کو اسی طرح جزا دیتے ہیں"},{"number":45,"text":"اس دن سچا نہ جاننے والوں کے لیے ویل (افسوس) ہے"},{"number":46,"text":"(اے جھٹلانے والو) تم دنیا میں تھوڑا سا کھا لو اور فائده اٹھا لو بیشک تم گنہگار ہو"},{"number":47,"text":"اس دن جھٹلانے والوں کے لیے سخت ہلاکت ہے"},{"number":48,"text":"ان سے جب کہا جاتا ہے کہ رکوع کر لو تو نہیں کرتے"},{"number":49,"text":"اس دن جھٹلانے والوں کی تباہی ہے"},{"number":50,"text":"اب اس قرآن کے بعد کس بات پر ایمان ﻻئیں گے؟"}]}