{"number":21,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Yaklaştı insanlara hesapları! Ve onlar hâlâ gaflet içinde yüz çevirip durmadalar"},{"number":2,"text":"Rablerinden kendilerine ulaşan, söze bürünmüş her yeni öğüt ve hatırlatmayı ancak eğlenerek dinliyorlar"},{"number":3,"text":"Kalpleri hep oyun ve oyalanmada. O zulüm sergileyenler, şu yolda bir fısıldaşmayı iyice koyulaştırdılar: \"Bu adam, sizin gibi bir insandan başkası değil. Gözünüz baka baka büyüye mi gidiyorsunuz"},{"number":4,"text":"Dedi: \"Rabbim, gökteki sözü de yerdeki sözü de bilir. O, herşeyi duyan, her şeyi bilendir"},{"number":5,"text":"Şöyle de dediler: \"Saçma sapan rüyalar bunlar! Belki de uydurduğu bir yalandır. Belki de bir şairdir o. Hadi bir mucize getirsin bize, öncekilere gönderildiği gibi"},{"number":6,"text":"Onlardan önce yere batırdığımız hiçbir yurt ve uygarlık iman etmemiştir. Onlar mı iman edecekler"},{"number":7,"text":"Senden önce de ancak kendilerine vahyettiğimiz erler gönderdik. Hadi, sorun zikir/Kur'an ehline, eğer bilmiyorsanız"},{"number":8,"text":"Biz onları yemek yemez bir ceset olarak yaratmadık. Onlar sonsuza dek kalıcı da değillerdi"},{"number":9,"text":"Sonra onlara verilen söze sadık kaldık da onları ve dilediklerimizi kurtardık. Ve israfa saplanıp haddi aşanları helâk ettik"},{"number":10,"text":"Yemin olsun, size bir Kitap gönderdik ki, öğüt ve uyarınız/zikriniz/şerefiniz yalnız ondadır. Hâlâ aklınızı çalıştırmayacak mısınız"},{"number":11,"text":"Zulmetmiş nice kenti/medeniyeti biz kırıp geçirdik ve arkalarından başka bir topluluk oluşturduk"},{"number":12,"text":"Şiddetimizi hissettiklerinde hiç vakit geçirmeksizin oradan dört nala kaçıyorlardı"},{"number":13,"text":"Kaçmayın, içinde servet şımarıklığına düştüğünüz yere, meskenlerinize dönün ki, hesaba çekilebilesiniz"},{"number":14,"text":"Dediler: \"Eyvah bize! Biz gerçekten zalimlermişiz"},{"number":15,"text":"Bu davaları sürüp giderken biz onları kökten biçiverdik, sönüp silindiler"},{"number":16,"text":"Biz, gökleri de yeri de bunlar arasındakileri de eğlenip eğlendirelim diye yaratmadık"},{"number":17,"text":"Eğer bir eğlence edinmek isteseydik onu kendi katımızdan edinirdik. Ama böyle yapanlar değildik/yapsaydık öyle yapardık"},{"number":18,"text":"Hayır, biz hakkı, bâtılın üzerine fırlatırız da o, onun beynini parçalar. Bir de bakarsın o yok olup gitmiştir. Yakıştırdığınız niteliklerden ötürü yazıklar olsun size"},{"number":19,"text":"Göklerde ve yerde kim varsa O'na aittir. Ve O'nun katındakiler, O'na ibadet etmekten ne çekinirler ne de yorulurlar"},{"number":20,"text":"Gece ve gündüz tespih ederler, bıkıp usanmazlar"},{"number":21,"text":"Yoksa yerden bazı ilahlar edindiler de topraktan çıkarıp diriltme işini onlar mı yapacak"},{"number":22,"text":"Eğer yerde-gökte Allah'tan başka tanrılar olsaydı, o ikisi de mutlaka fesada uğrardı. Arşın Rabbi o Allah, onların nitelendirmelerinden yücedir, uzaktır"},{"number":23,"text":"O, yaptığından hesaba çekilmez ama onlar hesaba çekilirler"},{"number":24,"text":"Yoksa O'nun dışında bazı ilahlar mı edindiler? De ki: \"Susturucu delilinizi getirin! Benimle beraber olanların da benden öncekilerin de Zikir'i budur. Ne yazık ki onların çokları hakkı bilmezler; bu yüzden de yüz çevirirler"},{"number":25,"text":"Senden önce hiçbir resul göndermedik ki ona şöyle vahyetmiş olmayalım: \"Gerçek şu: İlah yok benden başka, artık bana kulluk/ibadet edin"},{"number":26,"text":"Rahman çocuk edindi\" dediler. Hâşâ, bundan arınmıştır O! Onlar, lütuflandırılmış kullardır"},{"number":27,"text":"Onlar O'nun sözünün önüne geçmezler; onlar yalnız O'nun emriyle iş yaparlar"},{"number":28,"text":"O, onların önlerindekini de arkalarındakini de bilir. Onlar, O'nun hoşnutluk verdiklerinden başkasına da şefaat etmezler. Ve onlar O'nun korkusundan titrerler"},{"number":29,"text":"İçlerinden her kim, \"Ben O'nun berisinden/alt mertebesinden bir ilahım!\" derse böylesini cehennemle cezalandırırız. Zalimleri işte böyle cezalandırırız biz"},{"number":30,"text":"O küfre sapanlar görmediler mi ki gökler ve yer bitişik idi, biz onları ayırdık. Her canlı şeyi sudan oluşturduk. Hâlâ iman etmeyecekler mi"},{"number":31,"text":"Yerküreye, onları çalkalamasın diye bir takım dağlar diktik. Ve orada geniş geniş yollar açtık ki, doğru gidebilsinler"},{"number":32,"text":"Göğü, korunmuş bir tavan yaptık. Ama onlar göğün ayetlerinden hâlâ yüz çeviriyorlar"},{"number":33,"text":"O odur ki, geceyi, gündüzü, Güneş'i ve Ay'ı yarattı. Her biri bir yörüngede yüzmektedir"},{"number":34,"text":"Senden önce hiçbir insana ölümsüzlük vermedik. Şimdi sen ölürsen, onlar ölümsüz mü olacaklar"},{"number":35,"text":"Her canlı, ölümü tadacaktır. Biz bir imtihan olarak sizi şer ile de hayır ile de deniyoruz. Sonunda bize döndürüleceksiniz"},{"number":36,"text":"O küfredenler seni gördüklerinde, seni şu şekilde alaya almaktan başka birşey yapmazlar: \"İlahlarınızı diline dolayan bu mu?\" Ama Rahman'ın zikrini/Kur'an'ı bizzat onlar örtüp inkâr ediyorlar"},{"number":37,"text":"İnsan, aceleden yaratılmıştır. Ayetlerimi size göstereceğim. Benden acele istemeyin"},{"number":38,"text":"Diyorlar ki: \"Eğer doğru sözlüler iseniz bu vaat ne zaman"},{"number":39,"text":"O inkâr edenler, ne yüzlerinden ne sırtlarından azabı uzak tutamayacakları ve hiçbir yardım da göremeyecekleri zamanı bir bilselerdi"},{"number":40,"text":"Doğrusu şu ki, o onlara ansızın gelecek de onları şaşkınlıktan donduracak. Artık ne onu geri çevirmeye güçleri yetecek ne de yüzlerine bakılacak"},{"number":41,"text":"Yemin olsun, senden önceki resullerle de alay edilmiştir. Sonunda, onlarla eğlenenleri, alay konusu yaptıkları şey kuşatıverdi"},{"number":42,"text":"De ki: \"Sizi gece ve gündüz Rahman'dan kim koruyabilir?\" Hayır, hayır! Onlar, Rablerinin zikrinden/Kur'an'ından yüz çeviriyorlar"},{"number":43,"text":"Yoksa onların; kendilerini bize karşı siperleyecek tanrıları mı var? Ne kendilerine yardıma güç yetirebilirler ne de bizden bir dostluğa muhatap olurlar"},{"number":44,"text":"Gerçek şu ki, biz onları ve atalarını, ömür kendilerine uzun gelecek kadar nimetlendirdik. Hâlâ görmüyorlar mı ki, biz yerküreye geliyor, onu uçlarından eksiltiyoruz. Galip gelenler onlar mı"},{"number":45,"text":"De ki: \"Ben sizi ancak vahiyle uyarıyorum.\" Ama sağırlar, uyarıldıklarında çağrıyı işitmezler ki"},{"number":46,"text":"Rabbinin azabından onlara bir esinti dokunsa, yemin olsun şöyle diyecekler: \"Vay bizlere, biz zalimlermişiz"},{"number":47,"text":"Kıyamet günü için adalet terazilerini kuracağız/adaleti terazilere koyacağız. Hiç kimseye zere kadar zulüm edilmeyecek. Hardal tanesi kadar birşey olsa onu ortaya getiririz. Hesapçılar olarak biz yeteriz"},{"number":48,"text":"Yemin olsun, biz, Mûsa'ya ve Hârun'a hak ile bâtılı ayıran, korunanlar için bir ışık ve öğüt olan furkanı verdik"},{"number":49,"text":"O korunanlar ki, hiç görmeden Rablerinden korkarlar. Kıyamet saatinden de ürperirler onlar"},{"number":50,"text":"Bu, bereketli bir Zikir'dir ki, onu indirdik. Yoksa siz onu inkâr mı ediyorsunuz"},{"number":51,"text":"Yemin olsun, İbrahim'e daha önceden, doğruyu bulma gücünü vermiştik. Onu bilmekteydik biz"},{"number":52,"text":"Babasına ve toplumuna şöyle demişti: \"Şu başına toplanıp durduğunuz heykeller de ne"},{"number":53,"text":"Dediler: \"Atalarımızı onlara kulluk/ibadet eder bulduk"},{"number":54,"text":"Dedi: \"Vallahi, siz de atalarınız da açık bir sapıklık içine düşmüşsünüz"},{"number":55,"text":"Dediler: \"Sen gerçeği mi getirdin yoksa oynayıp eğlenenlerden biri misin"},{"number":56,"text":"Dedi: \"Hiç de değil! Sizin Rabbiniz, göklerin ve yerin Rabbidir ki, onları yaratmıştır. Ben de bunlara tanıklık edenlerdenim"},{"number":57,"text":"Allah'a yemin ederim, sırtınızı dönüp gidişinizden sonra, putlarınıza bir oyun çevireceğim"},{"number":58,"text":"Sonunda onları parça parça etti. Yalnız en büyüklerini bıraktı ki, dönüp ona başvurabilsinler"},{"number":59,"text":"Dediler: \"Tanrılarımıza bunu yapan kesinlikle zalimlerdendir"},{"number":60,"text":"Dediler: \"Onları diline dolayan bir genç duymuştuk. Kendisine 'İbrahim' deniyor"},{"number":61,"text":"Dediler: \"Halkın gözleri önüne getirin onu ki, açıkça görebilsinler"},{"number":62,"text":"Dediler: \"Tanrılarımıza bunu sen mi yaptın, ey İbrahim"},{"number":63,"text":"Dedi: \"Hayır, ben değil. Şu büyükleri yapmıştır onu. Hadi, sorun onlara eğer konuşabiliyorlarsa"},{"number":64,"text":"Bunun üzerine kendi benliklerine döndüler de şöyle dediler: \"Siz, zalimlerin ta kendilerisiniz"},{"number":65,"text":"Sonra, yine kendi kafalarına döndürüldüler: \"Vallahi, sen de bilirsin ki, bunlar konuşamazlar"},{"number":66,"text":"İbrahim dedi: \"Siz, Allah'ın berisinden, size hiçbir şekilde yarar sağlamayan, zarar veremeyen şeylere mi tapıyorsunuz"},{"number":67,"text":"Yazıklar olsun size ve Allah'ın berisinden taptıklarınıza! Siz hâlâ aklınızı kullanmayacak mısınız"},{"number":68,"text":"Dediler: \"Yakın bunu! Eğer birşey yapacak kişilerseniz, ilahlarınıza yardım edin"},{"number":69,"text":"Biz de şöyle dedik: \"Ey ateş, İbrahim'e bir serinlik ol, bir selam ol"},{"number":70,"text":"Ona tuzak kurmak istediler de biz onları hüsranın en beterine uğrayanlar yaptık"},{"number":71,"text":"Biz onu da Lût'u da kurtarıp içinde âlemlere bereketler sakladığımız toprağa ulaştırdık"},{"number":72,"text":"Ona İshak'ı bağışladık, ayrıca Yakub'u da hediye ettik. Hepsini hak ve barış için çalışan insanlar yaptık"},{"number":73,"text":"Onları, bizim buyruğumuzla yol alan önderler yaptık. Onlara iyilikler yapmayı, duayı/namazı yerine getirmeyi, zekât vermeyi vahyettik. Onlar, yalnız bize kulluk ediyorlardı"},{"number":74,"text":"Lût'a da hükümranlık ve ilim verdik. Onu, pislikler üretip duran bir kentten kurtardık. O kent halkı yoldan çıkmış kötü bir kavimdi"},{"number":75,"text":"Onu rahmetimizin içine soktuk. O, hak ve barış için çalışanlardandı"},{"number":76,"text":"Nûh'a gelince, o da daha önce bize yakarmıştı. Yakarışına cevap verdik de onu ve ailesini, o büyük sıkıntıdan kurtardık"},{"number":77,"text":"Ona, ayetlerimizi yalanlayan topluluğa karşı yardım ettik. Kötülüğün toplumuydu onlar. Hepsini birden batırıp boğduk"},{"number":78,"text":"Ve Dâvud ile Süleyman... Hani, halkın davarının yayıldığı ekinler hakkında hüküm veriyorlardı da biz hükümlerine tanıklar olmuştuk"},{"number":79,"text":"Onu Süleyman'a derhal kavrattık. Her birine hükümdarlık ve bilgi verdik. Dâvud'a dağları boyun eğdirdik. Kuşlarla beraber tespih ediyorlardı. Yapmak isteyince yapanlarız biz"},{"number":80,"text":"Ona, sizi sizin şiddetinizden koruyacak olan zırh yapma sanatını öğrettik. Peki, siz şükrediyor musunuz"},{"number":81,"text":"Ve Süleyman'a kasırgayı boyun eğdirdik. İçini bereketlerle doldurduğumuz toprağa doğru onun emriyle akıp giderdi. Her şeyi bilenleriz biz"},{"number":82,"text":"Kendisi için dalgıçlık eden, daha başka iş de yapan bazı şeytanları da onun emrine verdik. Biz onları koruyup gözetiyorduk"},{"number":83,"text":"Ve Eyyûb... Rabbine şöyle yakarmıştı: \"Dert/zorluk gelip çattı bana; sen, rahmet edenlerin en merhametlisisin"},{"number":84,"text":"Hemen cevap verdik ona, kendisindeki derdi kaldırdık. Tarafımızdan bir rahmet ve ibadet edenler için bir hatırlatma olarak, ona ailesini ve beraberinde, benzerlerini de verdik"},{"number":85,"text":"İsmail, İdris, Zülkifl, hepsi sabredenlerdendi"},{"number":86,"text":"Hepsini rahmetimize soktuk. Onlar hak ve barış için çalışanlardandı"},{"number":87,"text":"Ve Zünnûn. Hani, kızarak gitmişti de ona asla güç yetiremeyeceğimizi/ölçüyü kendisine uygulamayacağımızı sanmıştı. Sonra, karanlıkların bağrında şöyle yakardı: \"Senden başka ilah yok, tespih ederim seni! Kuşkusuz, ben zalimlerden oldum"},{"number":88,"text":"Hemen imdadına yetiştik. Gamdan kurtardık onu. İnananları işte böyle kurtarırız biz"},{"number":89,"text":"Ve Zekeriyya. Hani, Rabbine yakarmıştı: \"Rabbim, beni yapayalnız, bir başıma bırakma! Sen, Vâris olanların/mirasçıların en hayırlısısın"},{"number":90,"text":"Kendisine hemen cevap vermiş. Yahya'yı ona hediye etmiş, karısını kendisi için doğurmaya elverişli hale getirmiştik. Onlar, hayırlarda yarışırlar, umarak ve korkarak bize yalvarırlardı. Onlar, bize ürpererek saygı gösterirlerdi"},{"number":91,"text":"Ve o, cinsiyet organını/ırzını titizlikle koruyan kadın. Onun bağrına ruhumuzdan üfledik de kendisini ve oğlunu âlemler için bir mucize yaptık"},{"number":92,"text":"İşte şu sizin ümmetiniz bir tek ümmettir. Ben de Rabbinimiz. O halde bana ibadet edin"},{"number":93,"text":"İşlerini aralarında parçaladılar. Hepsi bize dönecekler"},{"number":94,"text":"Kim inanmış olarak hayra ve barışa yönelik işlerden bir şey yaparsa, onun gayretine nankörlük edilmez. Biz böylesi lehine kâtiplik ederiz"},{"number":95,"text":"Helâk ettiğimiz bir kente/medeniyete yaşamak haram edilmiştir. Onlar bir daha geri dönemezler"},{"number":96,"text":"Ye'cûc ve Me'cûc'ün önü açıldığı zaman onlar, her tepeden akın ederler"},{"number":97,"text":"Hak olan vaat yaklaşmıştır. İnkâr edenlerin gözleri birden donup kalmıştır. \"Vay başımıza! Biz bundan gafil bulunuyorduk. Hayır, biz zalimlerdik!\" derler"},{"number":98,"text":"Siz ve Allah'ın berisinden, kulluk/kölelik ettikleriniz, cehennem odunusunuz. Hepiniz oraya gireceksiniz"},{"number":99,"text":"Eğer onlar ilah olsalardı, oraya girmezlerdi. Oysaki, hepsi orada uzun süre kalacaklardır"},{"number":100,"text":"Onlar için orada derin bir iç çekiş var. Ve onlar orada hiçbir şey işitmezler"},{"number":101,"text":"Tarafımızdan kendilerine güzellik hazırlananlara gelince, bunlar cehennemden uzaklaştırılmışlardır"},{"number":102,"text":"Onun uğultusunu duymazlar. Onlar, gönüllerinin istediği şeyler içinde sürekli yaşayacaklardır"},{"number":103,"text":"O en büyük korku onları tasalandırmaz. Melekler onları şöyle karşılarlar: \"Bu size o vaat edilen gününüzdür"},{"number":104,"text":"Gün olur, göğü, yazı tomarlarını dürer gibi düreriz. İlk yaratılışta başladığımız gibi onu baştan yaparız. Üzerimizde bir vaat olarak biz bunu mutlaka yapacağız"},{"number":105,"text":"Yemin olsun, zikirden sonra Zebur'da şunu yazmıştık: Yeryüzüne benim iyilik ve barış seven kullarım vâris olacaktır"},{"number":106,"text":"Kuşkusuz, bunda, ibadet eden/iş yapıp değer üreten bir topluluk için kesin bir tebliğ vardır"},{"number":107,"text":"Ve biz seni ancak âlemlere bir merhamet/bir sevgi olman dışında bir şey için göndermedik"},{"number":108,"text":"De ki: \"Bana şu vahyediliyor: \"Tanrınız ancak bir tek tanrıdır. Peki, siz, müslümanlar/Allah'a teslim olanlar mısınız"},{"number":109,"text":"Eğer yüz çevirirlerse de ki: \"Hepinize aynı şekilde, aynı düzeyde açıkladım. Artık bilmiyorum, tehdit edildiğiniz şey yakın mıdır, uzak mıdır"},{"number":110,"text":"Kuşkusuz O, sözün açığa vurulanını da bilir; saklamakta olduklarımızı da bilir"},{"number":111,"text":"Bilmiyorum, belki de o, sizin için bir fitnedir. Belirli bir süreye kadar bir nimetlendirmedir"},{"number":112,"text":"Resul şöyle yakardı: \"Rabbim, hak ile hükmet! Bizim Rabbimiz Rahman'dır. Sizin nitelendirmelerinize karşı yardımına başvurulandır, Müsteân'dır"}]}