{"number":23,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Hiç kuşku yok, kurtulmuştur müminler"},{"number":2,"text":"Namazlarında/dualarında huşû sahipleridir onlar"},{"number":3,"text":"Boş ve lüzumsuz sözden yüz çevirmişlerdir onlar"},{"number":4,"text":"Zekâtı vermek için faaliyettedir onlar"},{"number":5,"text":"Cinsiyet organlarını/ırzlarını koruyanlardır onlar"},{"number":6,"text":"Eşleri yahut akitleri aracılığıyla sahip bulundukları müstesnadır. Bu durumda kınanmış değillerdir onlar"},{"number":7,"text":"Kim bundan ötesini isterse, işte onlar, sınırı aşanlardır"},{"number":8,"text":"O müminler, emanetlerine, ahitlerine saygı duyup sahip çıkanlardır"},{"number":9,"text":"Namazlarını/dualarını korumaya devam ederler onlar"},{"number":10,"text":"İşte bunlardır mirasçı olanlar"},{"number":11,"text":"Ki, Firdevs cennetine mirasçı olurlar, onda sürekli kalırlar"},{"number":12,"text":"Yemin olsun ki, biz insanı topraktan oluşan bir özden yarattık"},{"number":13,"text":"Sonra onu çok dayanaklı bir karargâhta bir damlacık yaptık"},{"number":14,"text":"Sonra o damlacığı bir embriyo halinde yarattık, sonra o embriyoyu bir et parçası halinde yarattık, sonra o et parçasını bir kemik halinde yarattık ve nihayet o kemiğe de bir et giydirdik. Sonra onu bir başka yaratılışta yeniden kurduk. Yaratıcıların en güzeli Allah'ın kudret ve sanatı ne yücedir"},{"number":15,"text":"Sonra, siz bütün bunların ardından mutlaka öleceksiniz"},{"number":16,"text":"Sonra, siz kıyamet gününde yeniden diriltileceksiniz"},{"number":17,"text":"Yemin olsun, biz sizin üstünüzde yedi yol yarattık! Ve biz yaratılıştan/yaratılmışlardan gafil de değiliz"},{"number":18,"text":"Gökten bir kaderle/belli ölçüde bir su indirdik de onu yeryüzünde durdurduk. Elbette ki biz, onu gidermeye de gücü yetenleriz"},{"number":19,"text":"Onunla size hurmalardan ve üzümlerden bahçeler yetiştirdik, onlarda sizin için birçok meyveler vardır; onlardan yiyorsunuz"},{"number":20,"text":"Ve bir ağaç da yetiştirdik ki, Tûr-i Sina'dan çıkar, yağlı olarak biter; yiyenlere katıktır"},{"number":21,"text":"Davarlarda da sizin için elbette bir ibret vardır! Onların karınlarındakilerden size içiriyoruz. Onlarda sizin için birçok yarar var. Onlardan yiyorsunuz da"},{"number":22,"text":"Hem onlar üzerinde hem de gemiler üzerinde taşınıyorsunuz"},{"number":23,"text":"Yemin olsun, Nûh'u toplumuna resul olarak gönderdik de o şöyle dedi: \"Ey toplumum! Allah'a kulluk/ibadet edin! O'ndan başka tanrınız yok sizin. Hâlâ sakınmayacak mısınız"},{"number":24,"text":"Toplumu içinden inkârcı kodaman grup şöyle dedi: \"Bu adam, sizin gibi bir insandan başka şey değil; size üstünlük taslamak istiyor. Eğer Allah dileseydi, melekler indirirdi. Biz ilk atalarımız arasında böyle bir şey duymadık"},{"number":25,"text":"Cinnet getirmiş bir adamdan başkası değildir o. Belli bir süreye kadar göz altında tutun onu"},{"number":26,"text":"Nûh şöyle yakardı: \"Rabbim, beni yalanlamaları karşısında yardım et bana"},{"number":27,"text":"Bunun üzerine biz, Nûh'a şöyle vahyettik: \"Gözlerimizin önünde ve vahyimize uygun olarak gemiyi yap. Emrimiz gelip tandır kaynayınca, ailenle birlikte her türden iki çifti gemiye sok. İçlerinden, haklarında daha önce hüküm verilmiş olanları dışta bırak. Zulmetmiş olanlar hakkında bana yakarıp durma. Onlar kesinlikle boğulacaklardır"},{"number":28,"text":"Sen, yanındakilerle birlikte geminin üzerine çıktığında şöyle de: \"Zalimler topluluğundan bizi kurtaran Allah'a hamt olsun"},{"number":29,"text":"Şunu da söyle: \"Rabbim, beni bereketli bir yere indir! Sen, konuk ağırlayanların en hayırlısısın"},{"number":30,"text":"Biz onları imtihan ediyor idiysek de bunda elbette ibretler vardır"},{"number":31,"text":"Sonra onların ardından başka bir nesil oluşturduk"},{"number":32,"text":"Onlara da içlerinden şu yolda tebliğde bulunan bir resul gönderdik: Allah'a kulluk/ibadet edin. O'ndan başka tanrınız yok sizin. Hâlâ ürpermiyor musunuz"},{"number":33,"text":"Toplumunun, dünya hayatında servet ve refaha ulaştırdığımız halde inkâra sapıp âhiretteki buluşmayı yalanlayan kodaman takımı şöyle dedi: \"Bu adam, sadece sizin gibi bir insan; yemekte olduğunuzdan yiyor, içmekte olduğunuzdan içiyor"},{"number":34,"text":"Kendiniz gibi bir insana itaat ederseniz, o takdirde mutlaka hüsrana uğrayanlar olursunuz"},{"number":35,"text":"Size, ölüp toprak ve kemik haline geldikten sonra tekrar meydana çıkarılacağınızı mı vaat ediyor"},{"number":36,"text":"Heyhat! Size vaat edilen o şey ne kadar uzak"},{"number":37,"text":"Hayat, şu dünya hayatımızdan başkası değildir. Ölürüz, yaşarız ama biz tekrar diriltilecek değiliz"},{"number":38,"text":"O, yalan düzüp Allah'a iftira eden bir adamdan başkası değil. Biz ona inanmıyoruz"},{"number":39,"text":"O peygamber şöyle yakardı: \"Rabbim, beni yalanlamaları karşısında yardım et bana"},{"number":40,"text":"Allah buyurdu: \"Biraz sonra kesinlikle pişman olacaklar"},{"number":41,"text":"Nihayet, o korkunç titreşimli ses onları tam bir biçimde yakaladı da hepsini sel süprüntüsü haline getirdik. Dönmeze gitsin o zalimler topluluğu"},{"number":42,"text":"Sonra onların arkasından başka nesiller oluşturduk"},{"number":43,"text":"Hiçbir ümmet ne süresinden ileri geçebilir ne de geri kalır"},{"number":44,"text":"Sonra, resullerimizi art arda gönderdik. Hangi ümmete resulü geldiyse onu yalanladılar. Biz de onları birbiri ardınca yuvarladık ve hepsini birer efsane yaptık. Dönmeze gitsin iman etmeyen bir topluluk"},{"number":45,"text":"Sonra, Mûsa ile kardeşi Hârun'u mucizelerimizle, açık bir kanıtla gönderdik"},{"number":46,"text":"Firavun'a ve kodamanlarına. Ancak kibre saptılar, çünkü kendilerini büyük gören bir topluluktu onlar"},{"number":47,"text":"Şöyle dediler: \"Kendilerine bağlı toplum bize kulluk-kölelik ederken, biz kalkıp bizim gibi iki insan olan şu adamlara mı inanacağız"},{"number":48,"text":"İkisini de yalanladılar, böylece helâk edilenler arasına katıldılar"},{"number":49,"text":"Yemin olsun, Mûsa'ya o Kitap'ı vermiştik ki, hidayete erebilsinler"},{"number":50,"text":"Meryem'in oğluyla annesini birer ayet kıldık ve onları oturmaya uygun pınarlı bir tepeye yerleştirdik"},{"number":51,"text":"Ey resuller! Güzel ve temiz şeylerden yiyin ve barışa, hayra yönelik iş yapın! Çünkü ben, yapmakta olduğuklarınızı çok iyi bilmekteyim"},{"number":52,"text":"İşte sizin bu ümmetiniz bir tek ümmettir. Ve ben de sizin Rabbinizim; o halde benden sakının"},{"number":53,"text":"Fakat onlar işlerini aralarında parçalayıp çeşitli zübürlere/kutsallaştırılmış hizip kitaplarına ayırdılar. Her hizip, yalnız kendi yanındakiyle sevinip övünmektedir"},{"number":54,"text":"Artık sen onları bir süreye kadar kendi gafletleri içinde bırak"},{"number":55,"text":"Sanıyorlar mı ki, kendilerine verdiğimiz mal ve oğullarla güçlendiriyoruz onları"},{"number":56,"text":"Ve iyiliklerine koşuyoruz. Hayır, farkında olmuyorlar"},{"number":57,"text":"Onlar ki, Rablerine saygıdan titrerler"},{"number":58,"text":"Onlar ki, Rablerinin ayetlerine iman ederler"},{"number":59,"text":"Onlar ki, Rablerine ortak koşmazlar"},{"number":60,"text":"Onlar ki, verdiklerini, Rablerine dönecekleri için kalpleri ürpererek verirler"},{"number":61,"text":"İşte bunlar, hayırlarda yarışırlar. Ve hayırlarda önde gidenler de onlardır"},{"number":62,"text":"Biz, hiçbir benliğe gücünün yeteceğinden daha azını yüklemenin dışında bir teklifte bulunmayız. Bizim katımızda, hakkı söyleyen bir kitap vardır. Onlara haksızlık edilmez"},{"number":63,"text":"Fakat onların kalpleri bundan gaflet içindedir. Onların bundan başka da işleri vardır ki, hep o işler için çalışmaktadırlar"},{"number":64,"text":"Sonunda, servet ve refahla şımarmışlarını azapla yakaladığımızda, hemen bağırıp dövünmeye başlarlar"},{"number":65,"text":"Bağırıp dövünmeyin bugün, bizim karşımızda kimseden yardım göremezsiniz"},{"number":66,"text":"Ayetlerimiz size okunuyordu da siz ökçeleriniz üzerine gerisin geri dönüyordunuz"},{"number":67,"text":"Ona karşı büyüklük taslayarak, gece boyunca hezeyanlar savuruyordunuz"},{"number":68,"text":"Sözü gereğince düşünmediler de ondan mı, yoksa kendilerine ilk atalarına gelmeyen bir şey geldi diye mi"},{"number":69,"text":"Yoksa resullerini tanımadılar da bu yüzden mi onu inkâr ediyorlar"},{"number":70,"text":"Yoksa, \"Onda bir cinnet mi var\" diyorlar! Hayır, o kendilerine hakkı getirdi ama onların çoğu haktan tiksinen kişilerdir"},{"number":71,"text":"Eğer hak onların keyiflerine uysaydı, gökler de yer de bunların içindekiler de kesinlikle fesada uğrardı. Hayır, biz onlara zikirlerini/Kur'anlarını getirdik ama onlar zikirlerinden/Kur'anlarından yüz çeviriyorlar"},{"number":72,"text":"Yoksa onlardan bir vergi mi istiyorsun? Rabbinin vereceği daha hayırlıdır. Rızık verenlerin en hayırlısıdır O"},{"number":73,"text":"Şu bir gerçek ki, sen onları dosdoğru bir yola çağırıyorsun"},{"number":74,"text":"Ama âhirete inanmayanlar, o yoldan hep yan çiziyorlar"},{"number":75,"text":"Eğer biz onlara acıyıp da üstlerindeki sıkıntıyı kaldırsaydık, azgınlıkları içinde sersem sersem bocalamaya devam edeceklerdi"},{"number":76,"text":"Yemin olsun, biz onları azapla yakaladık. Ama yine de Rablerine boyun eğmediler. Sığınıp yakarmıyorlar"},{"number":77,"text":"Nihayet, üzerlerine şiddetli bir azabın kapısını açtığımızda hemencecik ümitsizliğe düşüverecekler"},{"number":78,"text":"Allah odur ki; sizin için işitme gücü, gözler ve gönüller oluşturdu. Ne kadar da az şükrediyorsunuz"},{"number":79,"text":"Sizi yeryüzünde yaratıp yayan da O'dur. O'nun huzurunda haşredileceksiniz"},{"number":80,"text":"O hayat veriyor, O öldürüyor. Gece ile gündüzün birbiri ardınca gelişi O'nun için. Hâlâ aklınızı kullanmayacak mısınız"},{"number":81,"text":"İşin doğrusu şu: Onlar da öncekilerin söylediği gibi söylediler"},{"number":82,"text":"Dediler ki: \"Ölüp, toprak ve kemik haline geldiğimiz zaman mı, gerçekten o zaman mı diriltileceğiz"},{"number":83,"text":"Yemin olsun, biz de bizden önce atalarımız da bununla tehdit edildik. Öncekilerin masallarından başka bir şey değil bu"},{"number":84,"text":"De ki: \"Eğer biliyorsanız, yeryüzü ve içindekiler kimindir"},{"number":85,"text":"Allah'ındır!\" diyecekler. De ki: \"Hâlâ düşünüp ibret almıyor musunuz"},{"number":86,"text":"Sor: \"Yedi göklerin Rabbi ve o büyük arşın Rabbi kimdir"},{"number":87,"text":"Allah'tır!\" diyecekler. De ki: \"Hâlâ benden sakınmıyor musunuz"},{"number":88,"text":"Şunu da sor: \"Eğer biliyorsanız söyleyin. Kimdir o, her şeyin melekûtu/aslı-esası elinde olan? O koruyup gözeten ama korunup gözetilmeyen"},{"number":89,"text":"Allah'tır!\" diyecekler. De ki: \"Nasıl oluyor da büyüleniyorsunuz"},{"number":90,"text":"Hayır, hayır! Biz onlara hakkı getirdik ama onlar tam anlamıyla yalancıdırlar"},{"number":91,"text":"Allah, çocuk edinmemiştir. O'nunla beraber herhangi bir ilah da yoktur. Eğer böyle olsaydı, her ilah kendi yarattığını yok ederdi ve mutlaka biri ötekine üstün gelmeye çalışırdı. Allah'ın şanı onların nitelendirmelerinden yücedir, arınmıştır"},{"number":92,"text":"Gözle görülmeyeni de görüleni de bilendir O. Uzaktır onların ortak koştuklarından"},{"number":93,"text":"De ki: \"Rabbim, tehdit edildikleri şeyi bana mutlaka göstereceksen"},{"number":94,"text":"Beni o zalimler topluluğunun içinde tutma Rabbim"},{"number":95,"text":"Biz, onları tehdit ettiğimiz şeyi sana göstermeye elbette kadiriz"},{"number":96,"text":"En güzel olan neyse onunla sav kötülüğü. Onların nasıl nitelendirme yaptıklarını biz daha iyi biliriz"},{"number":97,"text":"Ve de ki: \"Rabbim, şeytanların dürtüklemelerinden sana sığınırım"},{"number":98,"text":"Onların, başıma üşüşmelerinden de sana sığınırım Rabbim"},{"number":99,"text":"Sonunda onlardan birine ölüm geldiğinde şöyle der: \"Rabbim, beni geri döndürün"},{"number":100,"text":"Döndürün ki, o arkada bıraktığım yerde iyi bir iş yapayım.\" Hayır, bir kelime ki bu, o söyler onu. Ötelerinde, dirilecekleri güne kadar bir berzah vardır"},{"number":101,"text":"Sûra üfürüldüğünde, aralarında artık soy-sop/şuna-buna mensup olmalar söz konusu edilemez. Birbirlerini soruşturamazlar da"},{"number":102,"text":"Artık kimin tartıları ağır gelirse onlar kurtulmuş olacaklardır"},{"number":103,"text":"Tartıları hafif gelenler ise kendilerini kayba uğratanlar, uzun süre cehennemde kalanlar olacaklardır"},{"number":104,"text":"Ateş, yüzlerini yalar. Ve onlar da içinde sırıtıp kalacaklar"},{"number":105,"text":"Ayetlerim size okunmadı mı?\" Ve siz onları yalanlamıyor muydunuz"},{"number":106,"text":"Derler ki: \"Rabbimiz, bahtsızlığımız bize baskın çıktı. Sapıp gitmiş bir topluluk olduk biz"},{"number":107,"text":"Rabbimiz, çıkar bizi oradan. Eğer bir daha aynısını yaparsak, gerçekten zalimler olacağız"},{"number":108,"text":"Buyurur: \"Yıkılıp gidin oraya, konuşmayın benimle"},{"number":109,"text":"Kullarımdan bir zümre \"Rabbimiz, inandık; affet bizi, acı bize, sen merhametlilerin en hayırlısısın\" diyorken"},{"number":110,"text":"Siz onları alaya aldınız. Öyle ki, zikrimi/Kur'anımı size unutturdular. Siz onlara hep gülüyordunuz"},{"number":111,"text":"Bugün onlara ben, sabretmiş olmalarının karşılığını verdim. Başarıya erip kurtulanlar, onlardır"},{"number":112,"text":"Buyurur: \"Yeryüzünde yıllar sayısıyla ne kadar kaldınız"},{"number":113,"text":"Derler: \"Bir gün yahut günün bir kısmı kadar; sayanlara sor"},{"number":114,"text":"Buyurdu: \"Sadece birazcık kaldınız. Keşke biliyor olsaydınız"},{"number":115,"text":"Sizi, boş yere yarattığımızı ve bize döndürülmeyeceğinizi mi sandınız"},{"number":116,"text":"Yücelerden yücedir, o hak padişah olan Allah! İlah yok O'ndan başka. O şanlı arşın Rabbidir O"},{"number":117,"text":"Kim Allah'ın yanında, hakkında hiçbir kanıt olmayan bir başka ilaha yakarır/davet ederse, onun hesabı rabbi katındadır. Hiç kuşkusuz, küfre sapanlar iflah etmezler"},{"number":118,"text":"Şöyle yakar: \"Rabbim! Affet, merhamet et! Sen merhametlilerin en hayırlısısın"}]}