{"number":25,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Şanı yücedir o kudretin ki, hakla bâtılı ayıran o Furkan'ı, bütün âlemler için bir uyarıcı olsun diye kuluna indirdi"},{"number":2,"text":"Göklerin ve yerin mülk ve saltanatı yalnız O'nundur. Çocuk edinmemiştir O. Mülk ve saltanatında ortak yoktur O'na. Herşeyi yaratmış ve herşeye bir ölçü ve oluş tarzı takdir etmiştir"},{"number":3,"text":"Böyleyken O'nun dışında bir takım ilahlar edindiler. Hiçbir şey yaratamaz bunlar. Kendileri yaratılmışlardır zaten... Kendi benlikleri için bile ne bir zarara güç yetirebilirler ne bir yarara. Ne bir ölüme güçleri yeter ne bir dirime ne de kabirden çıkarıp hesap sormaya"},{"number":4,"text":"Küfre batanlar dediler ki: \"Bu, onun uydurduğu bir düzmeceden başka şey değildir. Ve bu düzmecede ona, başka bir topluluk da yardım etmiştir.\" Yemin olsun ki, bunu söyleyenler bir zulüm, günah ve iftira sergilemişlerdir"},{"number":5,"text":"Dediler ki: \"Öncekilerin masallarıdır bu. Birilerine yazdırdı onu. O ona sabah-akşam birileri tarafından yazdırılıyor"},{"number":6,"text":"Şöyle söyle: \"Onu göklerde ve yerdeki sırrı bilen indirmiştir. Kuşkusuz O, Gafûr'dur, Rahîm'dir"},{"number":7,"text":"Şunu da söylemişlerdir: \"Ne biçim resuldür bu; yemek yiyor, sokaklarda yürüyor. Üzerine bir melek indirilmeli, beraberinde özel bir uyarıcı olmalı değil miydi"},{"number":8,"text":"Yahut ona bir hazine gönderilmeli, yahut ürününden yediği bir bahçesi olmalı değil miydi?\" O zalimler şunu da söylediler: \"Sizler büyülenmiş bir adamdan başkasının ardı sıra gitmiyorsunuz"},{"number":9,"text":"Bak da gör! Nasıl da örnekler sunuyorlar sana. Sapıttılar, artık bir daha yol bulamazlar"},{"number":10,"text":"Şanı yücedir o kudretin ki, dilerse sana ondan daha hayırlısını, altından nehirler akan bahçeleri verir ve senin için köşkler de yapar"},{"number":11,"text":"İş onların söyledikleri gibi değil. Onlar o kıyamet saatini yalanladılar. Ve biz, kıyamet saatini yalanlayanlara alevli bir ateş hazırlamışızdır"},{"number":12,"text":"O, onları uzak bir yerden gördüğünde, onlar onun kaynayan öfkesini ve uğultusunu işitirler"},{"number":13,"text":"Elleri boyunlarına bağlı olarak onun dar bir yerine atıldıklarında, orada haykırırlar: \"Nerdesin ey ölüm"},{"number":14,"text":"Bugün bir ölüm çağırmayın, birçok ölümü davet edin"},{"number":15,"text":"De ki: \"Bu mu daha iyi, yoksa korunanlara vaat edilen o sürekli cennet mi? O cennet de bu korunanların ödülü ve dönüş yeridir"},{"number":16,"text":"Onlar için orada, diledikleri herşey sürekli vardır. Bu, Rabbin üzerinde sorumluluğu üstlenilen bir vaattir"},{"number":17,"text":"Onları ve Allah dışındaki taptıklarını haşredeceği gün şöyle sorar: \"Şu kullarımı siz mi saptırdınız yoksa onlar mı yoldan çıktılar"},{"number":18,"text":"Derler ki: \"Tespih ederiz seni; seni bırakıp da başka dostlar edinmek bize yaraşmazdı. Ama sen onları ve atalarını öylesine nimetlendirdin ki, zikiri/Kur'an'ı unuttular ve helâke giden bir topluluk oldular"},{"number":19,"text":"İşte, haklarında söz söyledikleriniz de sizi yalanladılar. Artık ne azabı savabilirsiniz ne de yardımcı bulabilirsiniz. Zulmedenlerinize zorlu bir azap tattıracağız"},{"number":20,"text":"Senden önce gönderdiğimiz peygamberler de mutlaka yemek yiyorlar, sokaklarda yürüyorlardı. Biz sizi birbiriniz için imtihan aracı yaptık. Sabrediyor musunuz? Rabbin her şeyi görmektedir"},{"number":21,"text":"Bize kavuşmayı ummayanlar dediler ki: \"Üstümüze melekler inse, yahut Rabbimizi görsek olmaz mı?\" Yemin olsun ki, kendi benliklerinde büyüklük kuruntusuna düştüler ve korkunç bir biçimde azdılar"},{"number":22,"text":"Melekleri görecekleri günde, o günahkârlara hiçbir müjde yoktur. Şöyle diyecekler: \"Yasaktır, yasaklanmıştır"},{"number":23,"text":"Yaptıkları her işin önüne geçmiş, onu un-ufak hale getirip silmişizdir"},{"number":24,"text":"O gün, konakladıkları yer çok hayırlı, dinlenip eğlendikleri yer çok güzel olanlar, cennet halkıdır"},{"number":25,"text":"Gün olur, gök, bulutlarla yarılır ve melekler ardarda indirilir"},{"number":26,"text":"O gün gerçek mülk/yönetim Rahman'ındır. Ve o, kâfirler için çok zorlu bir gündür"},{"number":27,"text":"O gün, zalim, ellerini ısırarak diyecek ki: \"Ne olurdu, resulle birlikte bir yol tutsaydım"},{"number":28,"text":"Ah, ne olurdu, falancayı dost edinmeseydim"},{"number":29,"text":"Zikir/Kur'an bana geldikten sonra, o saptırdı beni ondan. Şeytan, insan için bir rezil edicidir"},{"number":30,"text":"Resul de şöyle der: \"Ey Rabbim, benim toplumum, bu Kur'an'ı terk edilmiş/dışlanmış halde tuttular"},{"number":31,"text":"Biz böylece her peygambere, suçlulardan bir düşman musallat ettik. Kılavuz ve yardımcı olarak Rabbin yeter"},{"number":32,"text":"Gerçeği örten nankörler/inkârcılar dediler ki: \"Kur'an ona toptan, bir kerede indirilsedi ya!\" Biz böyle yaptık ki, onunla senin kalbini dayanıklı kılalım. Biz onu parça parça/ayet ayet okuduk"},{"number":33,"text":"Onlar sana bir mesel getirdikçe, biz sana hakkı ve en güzel yorumu getiririz"},{"number":34,"text":"O yüzleri üstü cehenneme sevk edilecek olanlar, mekân bakımından en şerli, yol bakımından en sapık kişilerdir"},{"number":35,"text":"Yemin olsun ki, biz Mûsa'ya Kitap verdik. Kardeşi Hârun'u da onun yanında vezir yaptık"},{"number":36,"text":"Ardından şöyle dedik: \"Ayetlerimizi yalanlayan topluluğa gidin.\" Biraz sonra da o topluluğu yerle bir ettik"},{"number":37,"text":"Ve Nûh kavmi... Resulleri yalanladıklarında hepsini boğup, insanlara bir ibret yaptık. Zalimler için acıklı bir azap hazırladık"},{"number":38,"text":"Âd'ı, Semûd'u, Ress, halkını ve bunlar arasında birçok nesilleri yere batırdık"},{"number":39,"text":"Bunların her birine türlü türlü örnekler verdik. Ve bunların hepsini perişan edip batırdık"},{"number":40,"text":"Yemin olsun, onlar o kötülük yağmuruna tutulan kente vardılar. Peki onu görmüyorlar mıydı? Hayır, onlar dirilip hesap vermeyi ummuyorlardı"},{"number":41,"text":"Seni gördüklerinde, şu şekilde alaya almaktan başka şey yapmazlar: \"Allah, resul olarak şunu mu gönderdi"},{"number":42,"text":"Eğer biz kendilerine bağlılıkta sabırlı olmasaydık, bu bizi ilahlarımızdan saptıracaktı.\" Azabı gördüklerinde, yolca kimin daha sapık olduğunu bilecekler"},{"number":43,"text":"İğreti arzusunu ilah edinen kişiyi gördün mü? Şimdi ona sen mi vekil olacaksın"},{"number":44,"text":"Yoksa sen bunların çoğunun işittiklerini, aklettiklerini mi sanıyorsun? Onlar hayvanlar gibidirler, hatta yolca, hayvanlardan da şaşkındırlar"},{"number":45,"text":"Görmedin mi Rabbini, nasıl uzatmıştır gölgeyi? Eğer dileseydi, onu elbette hareketsiz kılardı. Sonra nasıl Güneş'i ona delil yapmışız"},{"number":46,"text":"Sonra nasıl tutup onu ağır ağır kendimize çekmişiz"},{"number":47,"text":"O'dur sizin için geceyi elbise, uykuyu dinlence yapan. Gündüzü, dağılıp yayılma zamanı yapan da O'dur"},{"number":48,"text":"O gönderdi rüzgârı bir müjde olarak rahmetinin önünden. Biz indirdik gökten tertemiz bir su"},{"number":49,"text":"Ki onunla ölü bir beldeyi diriltelim ve onunla, yarattıklarımızdan bir takım hayvanları ve birçok insanları suvaralım"},{"number":50,"text":"Yemin olsun, onu aralarında çeşitli biçimlerde ifade ettik ki öğüt alabilsinler. Ama insanların çoğu sadece nankörlükte ısrar etmektedir"},{"number":51,"text":"Eğer dileseydik, her kente bir uyarıcı gönderirdik"},{"number":52,"text":"Artık inkârcılara boyun eğme, onlara karşı Kur'an ile zorlu bir cihat aç"},{"number":53,"text":"İki denizi birbiri üstüne salan O'dur. Bu, tatlı ve yürek ferahlatıcı; şu, tuzlu ve acı. Ve ikisinin arasında bir berzah, geçişi engelleyen bir perde koymuştur"},{"number":54,"text":"Sudan bir insan yaratıp, onu nesep ve sıhriyet akrabaları halinde oluşturan O'dur. Rabbin çok güçlüdür"},{"number":55,"text":"Allah'ın berisinden, kendisine yarar sağlamayacak, zarar da veremeyecek şeylere ibadet/kulluk ediyorlar. İnkârcı, Rabbi aleyhine başkalarına arka çıkar"},{"number":56,"text":"Biz seni sadece müjdeci ve uyarıcı olarak gönderdik"},{"number":57,"text":"De ki: \"Onun karşılığında sizden bir ücret istemiyorum; ancak Rabbine varmak için bir yol tutmayı dileyenler istiyorum"},{"number":58,"text":"O hiç ölmeyecek diriye, o Hayy olana dayanıp güven, O'nu överek tespih et! Kullarının günahlarından O'nun haberdar olması yeter"},{"number":59,"text":"Gökleri, yeri ve bunlar arasındakileri altı günde yaratıp sonra arş üzerinde egemenlik kuran O'dur. Rahman'dır O. Haberdar olana sor O'nu"},{"number":60,"text":"Onlara, \"Rahman'a secde edin!\" dendiğinde şöyle derler: \"Rahman da neymiş? Senin emrettiğin şeye secde eder miyiz hiç?\" Ve bu söz onların nefretini artırdı"},{"number":61,"text":"Şanı yücedir o kudretin ki; gökte burçlar yarattı, orada bir kandil ve ışık yansıtıcı bir ay oluşturdu"},{"number":62,"text":"Geceyle gündüzü, öğüt almak isteyenlerle şükretmek isteyenler için, birbirini izler hale getiren O'dur"},{"number":63,"text":"Rahman'ın kulları, yeryüzünde böbürlenmeden/rahatsız etmeden yürüyen kişilerdir. Cahiller onlara hitap edince, \"Selam!\" derler"},{"number":64,"text":"Geceleri, Rableri huzurunda secde ederek, ayakta durarak geçirirler"},{"number":65,"text":"Ve şöyle yakarırlar: \"Rabbimiz, cehennem azabını bizden uzak tut! Doğrusu, onun azabı inatçı ve yapışkandır"},{"number":66,"text":"Ne kötü bir durak yeridir o, ne kötü bir dinlenme yeri"},{"number":67,"text":"Onlar harcama yaptıkları zaman ne savurganlığa saparlar ne de cimrilik ederler. O ikisi arasında bir dengededir bu"},{"number":68,"text":"Onlar Allah'ın yanında bir başka ilaha yakarmazlar/davet etmezler. Allah'ın saygıya layık kıldığı canı haksız yere almazlar. Zina etmezler. Bunları yapan, cezaya çarpılır"},{"number":69,"text":"Kıyamet günü azap kendisi için kat kat artırılır da hor ve ezik halde onun içinde uzun süre kalır"},{"number":70,"text":"Tövbe ederek inanan ve hayra/barışa yönelik bir iş yapan müstesna. Allah, böylelerinin kötülüklerini güzelliğe dönüştürür. Allah Gafûr'dur, Rahîm'dir"},{"number":71,"text":"Kim tövbe edip hayra ve barışa yönelik iş yaparsa, hiç kuşkusuz tövbesi kabul edilmiş olarak Allah'a döner"},{"number":72,"text":"Onlar yalana tanıklık etmezler/yalan söze kulak vermezler. Boş lakırdıya rastladıklarında soylu bir tavırla geçip giderler"},{"number":73,"text":"Rablerinin ayetleri kendilerine hatırladıldığında, kör ve sağırlar gibi onlar üzerine kapanmazlar"},{"number":74,"text":"Onlar şöyle yakarırlar: \"Rabbimiz, eşlerimizden ve çocuklarımızdan bize göz aydınlığı bağışla. Bizi takvaya sarılanlara önder kıl"},{"number":75,"text":"İşte bunlar, sabretmiş olmalarına karşılık yüksek konaklarla ödüllendirilirler. Ve o konaklarda sağlık dileğiyle ve selamla karşılanırlar"},{"number":76,"text":"Orada sürekli kalacaklardır. Ne güzel konak yeri, ne güzel dinlenme yeri"},{"number":77,"text":"De ki: \"Duanız/davetiniz yoksa, Rabbim sizi ne yapsın? Yalanladınız; bu yüzden azap kaçınılmaz olacaktır"}]}