{"number":36,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Yâ, Sîn"},{"number":2,"text":"Yemin olsun o hikmetlerle dolu Kur'an'a ki"},{"number":3,"text":"Hiç kuşkusuz, sen, gönderilen elçilerdensin"},{"number":4,"text":"Dosdoğru bir yol üzerindesin"},{"number":5,"text":"Azîz ve Rahîm'in indirdiği üzeresin"},{"number":6,"text":"Babaları uyarılmamış, tam gaflet içinde bir toplumu uyarman için gönderildin"},{"number":7,"text":"Yemin olsun ki, onların çoğuna söz hak olmuştur, artık onlar iman etmezler"},{"number":8,"text":"Biz onların boyunlarına bukağılar geçirdik. Bukağılar çenelere dayanmıştır da bu yüzden onların kafaları yukarı kalkıktır"},{"number":9,"text":"Önlerine bir set, arkalarına da başka bir set çektik. Böylece onları kuşatıp sardık; artık onlar görmezler"},{"number":10,"text":"Sen ha uyarmışsın onları ha uyarmamışsın, fark etmez onlar için; inanmazlar"},{"number":11,"text":"Sen ancak o zikire/Kur'an'a uyan ve görmediği halde Rahman'dan korkan kimseyi uyarırsın. Böylesini, bir bağışlanma ve seçkin bir ödülle müjdele"},{"number":12,"text":"Biz, yalnız biz, ölüleri diriltiriz ve onların önden gönderdiklerini de eserlerini de yazarız! Zaten biz her şeyi apaçık bir kütükte ayrıntılı olarak kaydetmişizdir"},{"number":13,"text":"Onlara o kent halkını örnek ver. Hani, elçiler gelmişti oraya"},{"number":14,"text":"Hani, biz onlara iki kişi göndermiştik, onları yalanlamışlardı. Bunun üzerine biz, üçüncü bir kişiyle destek vermiştik. Şöyle demişlerdi: \"Biz, size gönderilen elçileriz"},{"number":15,"text":"Kent halkı dedi ki: \"Siz, bizim gibi birer insandan başka şey değilsiniz. Rahman hiçbir şey indirmemiştir. Siz sadece yalan söylüyorsunuz"},{"number":16,"text":"Dediler: \"Rabbimiz biliyor ki, biz size gönderilmiş elçileriz"},{"number":17,"text":"Bize düşen, açık bir tebliğden başka şey değildir"},{"number":18,"text":"Dediler: \"Sizin yüzünüzden uğursuzlukla karşılaştık/biz sizi uğursuzluk sebebi saymaktayız. Eğer bu işe son vermezseniz, sizi mutlaka taşlayacağız. Ve bizden size acıklı bir azap kesinlikle dokunacaktır"},{"number":19,"text":"Dediler: \"Uğursuzluk kuşunuz sizinle beraberdir. Size öğüt verildi diye mi bütün bunlar? Hayır, siz savurganlığa, aşırılığa sapmış bir topluluksunuz"},{"number":20,"text":"Kentin öbür ucundan bir adam koşarak gelip şöyle dedi: \"Ey topluluk, bu elçilere uyun"},{"number":21,"text":"Sizden herhangi bir ücret istemeyelere uyun. Onlardır doğruyu ve güzeli bulanlar"},{"number":22,"text":"Beni yaratana ne diye kulluk etmeyecek mişim ben? Ve sizler de O'na döndürüleceksiniz"},{"number":23,"text":"O'ndan başka tanrılar mı edineyim ben? Eğer Rahman bana bir zorluk/zarar dilerse onların şefaati benden hiçbir şeyi savamaz; beni kurtaramazlar"},{"number":24,"text":"Bu durumda ben elbette ki açık bir sapıklığın içine düşerim"},{"number":25,"text":"Ben, sizin Rabbinize iman ettim, artık dinleyin beni"},{"number":26,"text":"Gir cennete!\" denildi. Dedi: \"Kavmim bir bilebilseydi"},{"number":27,"text":"Ki Rabbim beni affetti; beni, ikram edilenlerden kıldı"},{"number":28,"text":"Biz onun ardından kavmi üzerine gökten bir ordu indirmedik, indirecek de değildik"},{"number":29,"text":"Olan, sadece korkunç titreşimli bir sesti. Ve bir anda sönüverdiler"},{"number":30,"text":"Yazık şu kullara! Kendilerine gelen her resulle mutlaka alay ederlerdi"},{"number":31,"text":"Görmediler mi, kendilerinden önce nice nesilleri helâk ettik! Onlar artık bir daha bunlara dönmeyecekler"},{"number":32,"text":"Ancak herkes toplandığında, onlar da huzurumuzda hazır bulundurulacaklar"},{"number":33,"text":"Ölü toprak onlar için bir mucizedir. Onu dirilttik, ondan dâne çıkardık; bak işte ondan yiyorlar"},{"number":34,"text":"Onda hurmalardan, üzümlerden bahçeler oluşturduk, ondan pınarlar fışkırttık"},{"number":35,"text":"Ki onun ürününden ve ellerinin yapıp ettiğinden yesinler. Hâlâ şükretmiyorlar mı"},{"number":36,"text":"Şanı yücedir o Allah'ın ki toprağın bitirdiklerinden, onların öz benliklerinden ve nice bilmediklerinden bütün çiftleri yaratmıştır"},{"number":37,"text":"Gece de onlar için bir mucizedir. Gündüzü ondan soyup alırız da onlar karanlığa gömülüverirler"},{"number":38,"text":"Güneş, kendine özgü bir durak noktasına/bir durma zamanına doğru akıp gidiyor. Azîz, Alîm olanın takdiridir bu"},{"number":39,"text":"Ay'a gelince, biz onun için de bir takım durak noktaları/birtakım evreler belirledik. Nihayet o, eski hurma sapının eğrilmişi gibi geri döner"},{"number":40,"text":"Güneş'in Ay'a ulaşıp çatması gerekmiyor. Gecenin de gündüzü geçmesi gerekmez. Her biri bir yörüngede yüzmektedir"},{"number":41,"text":"Zürriyetlerini o dopdolu gemilerde taşımamız da onlar için bir ayettir"},{"number":42,"text":"Onlar için gemilere benzer, binecekleri başka şeyler de yarattık"},{"number":43,"text":"Eğer dilersek onları boğarız. Bu durumda ne kendileri için feryat eden olur ne de kurtarılırlar"},{"number":44,"text":"Ancak bizden bir rahmet olarak bir süreye kadar daha nimetlensinler diye kurtarılırlar"},{"number":45,"text":"Onlara, \"Önünüzdekinden ve arkanızdakinden sakının ki, size merhamet edilebilsin!\" denildiğinde, hiç aldırmazlar"},{"number":46,"text":"Çünkü Rablerinin ayetlerinden kendilerine bir ayet gelince, ondan mutlaka yüz çevirmişlerdir"},{"number":47,"text":"Onlara, \"Allah'ın size lütfettiği rızıklardan dağıtın!\" dendiğinde, nankörlüğe sapanlar, iman edenlere şöyle derler: \"Allah'ın, dilediği takdirde yedirip doyuracağı kişiyi biz mi doyuracağız? Siz açık bir sapıklık içindesiniz, hepsi bu"},{"number":48,"text":"Bir de şöyle derler: \"Eğer doğru sözlüler iseniz, bu tehdit ne zaman"},{"number":49,"text":"Sadece korkunç titreşimli bir sesi bekliyorlar. Onlar çekişip dururlarken, o ses kendilerini enseleyecektir"},{"number":50,"text":"O zaman ne bir tavsiyede bulunmaya güçleri yetecek ne de ailelerine dönebilecekler"},{"number":51,"text":"Sûra üfürülmüştür! Bak, işte kabirlerden, Rablerine doğru akın akın gidiyorlar"},{"number":52,"text":"Şöyle diyecekler: \"Vay başımıza gelene! Kim kaldırdı bizi mezarımızdan? Rahman'ın vaat ettiği işte bu! Peygamberler doğru söylemişler"},{"number":53,"text":"Topu topu korkunç titreşimli bir tek ses. Ve bakmışsın, hepsi birden huzurumuzda divan durmaktadır"},{"number":54,"text":"O gün hiçbir canlıya, hiçbir şekilde haksızlık edilmez. Sizler, sadece yapıp ettiklerinizin karşılığı olarak cezalandırılırsınız"},{"number":55,"text":"O gün cennet halkı bir uğraş içinde eğlenip ferahlamaktadır"},{"number":56,"text":"Kendileri ve eşleri, gölgeliklerde, koltuklar üzerinde yaslanmışlardır"},{"number":57,"text":"Orada kendileri için meyveler var. İstedikleri her şey kendilerinin olacak"},{"number":58,"text":"Rahîm Rab'den bir de sözlü selam"},{"number":59,"text":"Ey günahkârlar! Bugün şöyle ayrılın"},{"number":60,"text":"Ey âdemoğulları! Ben size, \"Şeytana kulluk etmeyin, o sizin için açık bir düşmandır!\" demedim mi"},{"number":61,"text":"Bana ibadet edin, dosdoğru yol budur!\" demedim mi"},{"number":62,"text":"Yemin olsun, şeytan, içinizden birçok nesli saptırmıştı. Aklınızı hiç işletmiyor muydunuz"},{"number":63,"text":"Alın size, tehdit edildiğiniz cehennem"},{"number":64,"text":"İnkâr edip durmanız yüzünden dalın oraya bugün"},{"number":65,"text":"O gün, ağızlarını mühürleyeceğiz. Bize elleri konuşacak, ayakları da kazanmış olduklarına tanıklık edecek"},{"number":66,"text":"Dilesek, gözlerini siler, onları elbette kör ederiz. O zaman yola koyulmak isterler ama nasıl görecekler"},{"number":67,"text":"Dilesek, onları oldukları yerde hayvana çeviririz. O zaman ne ileri gitmeye güçleri yeter ne de geri dönebilirler"},{"number":68,"text":"Kimi uzun ömürlü kılarsak, onu yaratılışta gerisin geri çeviririz. Hâlâ akıllarını işletmiyorlar mı"},{"number":69,"text":"Biz o peygambere şiir öğretmedik. Şiir ona yaraşmaz/layık olamaz da. Ona vahyedilen, bir öğütten ve apaçık bir Kur'an'dan başka şey değildir"},{"number":70,"text":"Diri olanı uyarsın ve gerçeği örten nankörler/inkârcılar aleyhine söz hak olsun diye indirilmiştir"},{"number":71,"text":"Görmediler mi, ellerimizin yapıp ettiklerinden, kendileri için nice hayvanlar yarattık da onlar, bu hayvanlara sahip oluyorlar"},{"number":72,"text":"O hayvanları bunlara boyun eğdirdik. Onlardan binekleri vardır ve onlardan bir kısmını da yiyorlar"},{"number":73,"text":"O hayvanlarda bunlar için birçok yararlar var, içecekler var. Hâlâ şükretmiyorlar mı"},{"number":74,"text":"Kendilerine yardım edilir ümidiyle Allah'tan başka ilahlar edindiler"},{"number":75,"text":"Oysaki, o ilahlar bunlara yardım edemezler. Tam aksine, bunlar, o ilahlara hizmet eden ordular durumundadır"},{"number":76,"text":"Artık onların sözü seni üzmesin! Biz onların sır olarak tuttuklarını da açıkladıklarını da biliyoruz"},{"number":77,"text":"Görmedi mi insan, kendisini bir spermden yarattığımızı! Bir de bize açık bir hasım kesilmiştir o"},{"number":78,"text":"Kendi yaratılışını unutmuş da bize örnek veriyor. Ve bir de şöyle diyor: \"Şu çürümüş kemiklere kim hayat verecek"},{"number":79,"text":"De ki: \"Onlara hayat verecek olan, onları ilk kez yaratandır. O, bütün yaratılmışları/her türlü yaratmayı çok iyi bilmektedir"},{"number":80,"text":"O size, o yeşil ağaçtan bir ateş oluşturdu da siz ondan tutuşturup duruyorsunuz"},{"number":81,"text":"Gökleri ve yeri yaratan, onların benzerini yaratmaya güç yetiremez mi? Elbette güç yetirir. Her şeyi bilen Alîm, sürekli yaratan Hallâk O'dur"},{"number":82,"text":"O, bir şeyi istediğinde, buyruğu sadece şunu söylemektir: \"Ol!\" Artık o, oluverir"},{"number":83,"text":"Her şeyin kaynağı/egemenliği elinde olan o yaratıcının şanı çok yücedir! Sonunda O'na döndürüleceksiniz"}]}