{"number":59,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Göklerde ne var, yerde ne varsa Allah'ı tespih etmiştir. Azîz'dir O, Hakîm'dir"},{"number":2,"text":"Ehlikitap'tan küfre sapanları, ilk toplanma gününde yurtlarından O çıkardı. Siz onların çıkacaklarını sanmamıştınız; onlarsa kalelerinin kendilerini Allah'tan koruyacağını zannetmişlerdi. Ama Allah onlara hiç ummadıkları yerden geldi, yüreklerine korku saldı; kendi evlerini kendi elleriyle ve iman sahiplerinin elleriyle tahrip ediyorlardı. Artık ibret alın, ey gözleri olanlar"},{"number":3,"text":"Eğer Allah onlar üzerine sürgünü yazmamış olsaydı, onlara mutlaka dünyada azap ederdi. Âhirette de onlara ateş azabı vardır"},{"number":4,"text":"Çünkü onlar, Allah'a ve resulüne kafa tuttular. Kim Allah'a kafa tutarsa, bilsin ki Allah'ın azabı çok çetindir"},{"number":5,"text":"Bir hurma ağacını kestiniz, yahut onu kökleri üzerine dikili bıraktınızsa, bu Allah'ın izniyledir; yoldan çıkmışları rezil etmesi içindir"},{"number":6,"text":"Allah'ın onlardan resulüne aktardığı ganimetlere gelince, siz onun için ne at bindiniz ne deve sürdünüz; ama Allah, resullerini dilediği kimselerin üzerine salar. Allah her şeyi yapmakta sonsuz kudret sahibidir"},{"number":7,"text":"Allah'ın, kentler halkından resulüne zahmetsizce aktardığı mal ve nimetler şunlar içindir: Allah, Peygamber, yakınlar, yetimler, yoksullar, yolda kalmışlar. Bu böyle düzenlenmiştir ki, o mal ve nimetler sizden yalnız zengin olanlar arasında dönüp duran bir kudret aracı olmasın. Resul size ne verdiyse onu alın; sizi neden yasakladıysa ona son verin ve Allah'tan korkun. Hiç kuşkusuz, Allah'ın azabı çok şiddetlidir"},{"number":8,"text":"Sözü edilen o mallar, göçmen yoksullar içindir. Onlar ki, yurtlarından çıkarılıp mallarından yoksun bırakılmışlardır; Allah'tan bir lütuf ve bir hoşnutluk peşindedirler; Allah'a ve resulüne yardım ederler. İşte onlardır, özü-sözü doğru olanlar"},{"number":9,"text":"Onlardan önce yurda konmuş ve imana sarılmış olanlar, kendilerine hicret edenleri severler. Onlara verilenlerden ötürü göğüslerinde bir ihtiyaç duymazlar. Kendilerinin ihtiyaçları olsa bile, ötekileri kendi nefslerine tercih ederler. Nefsinin cimriliğinden/doymazlığından korunanlar, kurtuluşa erenlerin ta kendileridir"},{"number":10,"text":"Onlardan sonra gelenler de şöyle derler: \"Rabbimiz! Bizi ve bizden önce iman etmiş kardeşlerimizi affet; kalplerimizde, inananlara karşı bir düşmanlık bırakma! Rabbimiz, sen çok şefkatli, çok merhametlisin"},{"number":11,"text":"Görmedin mi o ikiyüzlülüğe sapanları ki, Ehlikitap'tan inkâra giden dostlarına şöyle diyorlar: \"Eğer toprağınızdan çıkarılırsanız, yemin olsun sizinle birlikte biz de çıkacağız. Sizinle ilgili olarak hiçbir zaman kimseye boyun eğmeyeceğiz. Eğer sizinle savaşılırsa mutlaka size yardım edeceğiz.\" Allah tanıktır ki onlar kesinlikle yalancıdırlar"},{"number":12,"text":"Eğer çıkarılsalar onlarla beraber çıkmazlar; eğer savaşa maruz bırakılsalar onlara yardım etmezler; yardım etmeye kalksalar da mutlaka arkalarını dönüp kaçarlar. Sonunda kendilerine de yardım edilmez"},{"number":13,"text":"Onların gönüllerinde, korku bakımından siz, Allah'tan daha zorlusunuz. Bu böyledir, çünkü onlar anlamayan bir topluluktur"},{"number":14,"text":"Onlar sizinle toplu halde değil ancak müstahkem kaleler içinde yahut duvarlar arasından savaşabilirler. Onların kendi aralarındaki problemleri/çıkmazları çetindir/ciddidir. Sen onları birlik/beraberlik halinde sanıyorsun, oysaki onların kalpleri darmadağınık/parça parçadır. Böyledir; çünkü onlar akıllarını işletmeyen bir topluluktur"},{"number":15,"text":"Kendilerinden biraz önce günahlarının vebalini tadanlara benziyorlar. Acı bir azap var onlara"},{"number":16,"text":"Durumları, şeytanın durumuna benziyor. Hani, şeytan insana, \"Küfret/inkâr et!\" der, insan küfür ve inkâra sapınca da şöyle konuşur: \"Vallahi ben senden uzağım; ben, âlemlerin Rabbi olan Allah'tan korkarım"},{"number":17,"text":"Bu yüzden ikisinin de sonu, içinde sürekli kalacakları ateşe girmek oldu. Zalimlerin cezası işte budur"},{"number":18,"text":"Ey iman edenler! Allah'tan korkun! Ve her benlik, yarın için önden ne gönderdiğine bir baksın. Allah, yapmakta olduklarınızdan haberdardır"},{"number":19,"text":"O kimseler gibi olmayın ki, Allah'ı unuttular da Allah da onlara öz benliklerini unutturdu. Yoldan çıkmışların ta kendileridir onlar"},{"number":20,"text":"Ateşin dostlarıyla cennetin dostları bir olmaz. Cennetin dostları, kurtuluşu/zaferi elde edenlerin ta kendileridir"},{"number":21,"text":"Eğer biz bu Kur'an'ı bir dağın üzerine indirseydik, her halde sen onu Allah korkusundan huşû ile boynunu bükmüş, çatlayıp yarılmış görürdün. Biz benzetmeleri insanlar için yapıyoruz ki, inceden inceye düşünebilsinler"},{"number":22,"text":"Öyle Allah ki O, tanrı yok O'ndan başka. Gaybı da görünen âlemi de bilen O! Rahman O, Rahîm O"},{"number":23,"text":"Öyle Allah ki O, ilah yok O'ndan gayrı! Melik, Kuddûs, Selâm, Mümin, Müheymin, Azîz, Cebbâr, Mütekebbir. Allah, onların ortak koşmalarından yücedir, arınmıştır"},{"number":24,"text":"Allah'tır O! Haalik, Bâri', Musavvir'dir O! En güzel isimler/Esmâül Hüsna O'nundur. Göklerde ne var, yerde ne varsa O'nu tespih eder. Azîz'dir O, Hakîm'dir"}]}