{"number":73,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Ey giysisine bürünüp yatan"},{"number":2,"text":"Geceleyin kalk! Kısa bir süre hariç"},{"number":3,"text":"Gecenin yarısını ayakta ol yahut bundan biraz eksilt"},{"number":4,"text":"Yahut buna biraz ekle! Ve Kur'an'ı ağır ağır, düşüne düşüne oku"},{"number":5,"text":"Doğrusu, biz senin üzerine ağır bir söz bırakacağız"},{"number":6,"text":"Şu bir gerçek ki, yeni bir oluşa koyulmak üzere geceleyin kalkan, yer tutma bakımından daha güçlü, söz bakımından daha etkilidir"},{"number":7,"text":"Kuşkusuz, gündüz boyu senin için uzun bir dolaşma/yoğun bir uğraş vardır"},{"number":8,"text":"Rabbinin adını an ve tüm benliğinle O'na yönel"},{"number":9,"text":"Doğunun ve batının Rabbidir O. Tanrı yoktur O'ndan başka. O'nu vekil et"},{"number":10,"text":"Onların söylediklerine sabret! Ve güzelce ayrıl onlardan"},{"number":11,"text":"Benimle, o nimete boğulmuş yalanlayıcıları baş başa bırak! Birazcık süre tanı onlara"},{"number":12,"text":"Bizim yanımızda bukağılar var, cehennem var"},{"number":13,"text":"Boğazdan zor geçen bir yiyecek, korkunç bir azap var"},{"number":14,"text":"O günde ki yer ve dağlar sarsılır ve dağlar eriyip akan bir kum yığınına dönüşür"},{"number":15,"text":"Biz size, üstünüze tanık olan bir resul gönderdik. Tıpkı Firavun'a bir resul gönderdiğimiz gibi"},{"number":16,"text":"Ama Firavun, resule isyan etti de biz onu korkunç bir tutuşla tutuverdik"},{"number":17,"text":"Eğer inkâr ve nankörlüğe saparsanız, çocukları ak saçlı ihtiyarlara çeviren o günden nasıl korunacaksınız"},{"number":18,"text":"Gök bile o yüzden parçalanır. O'nun vaadi gerçekleşmiştir"},{"number":19,"text":"Bu, bir öğüt verici, düşündürücüdür. Dileyen, Rabbine doğru, bir yol edinir"},{"number":20,"text":"Hiç kuşkun olmasın, Rabbin senin durumunu biliyor. Gecenin üçte ikisinden daha azını, yarısını, üçte birini ayakta geçiriyorsun. Seninle beraber olanlardan bir grup da öyle. Allah, geceyi de gündüzü de ölçüye bağlamıştır. Sizin onu kuşatamayacağınızı bildi de size tövbe nasip etti. O halde Kur'an'dan, kolay geleni okuyun. Sizden hastalar olacağını bildi. Bir kısmının yeryüzünde dolaşıp Allah'ın lütfundan bir şeyler isteyeceklerini, diğer bir kısmının da Allah yolunda çarpışacaklarını bildi. O halde Kur'an'dan, kolay geleni okuyun! Namazı/duayı yerine getirin! Zekâtı verin. Güzel bir ödünçle Allah'a ödünç verin! Öz benlikleriniz için önden gönderdiğiniz iyiliğin, Allah katında hayrını daha çok, ödülünü daha büyük olarak bulacaksınız. Allah'tan af dileyin. Hiç kuşkusuz, Allah çok affedici, çok esirgeyicidir"}]}