{"number":19,"edition":"bs.korkut","ayahs":[{"number":1,"text":"Kāf Hā Jā Ajīn Sād"},{"number":2,"text":"Kazivanje o milosti Gospodara tvoga prema robu Njegovu Zekerijjau"},{"number":3,"text":"kad je on Gospodara svoga tiho zovnuo"},{"number":4,"text":"i rekao: \"Gospodaru moj, kosti su mi oronule i glava osijedjela, a nikada nisam, kad sam Ti, Gospodaru moj, molbu uputio, nesretan ostao"},{"number":5,"text":"Bojim se rođaka svojih po krvi poslije mene, a žena mi je nerotkinja, zato mi pokloni od Sebe sina"},{"number":6,"text":"da naslijedi mene i porodicu Jakubovu, i učini, Gospodaru moj, da budeš s njim zadovoljan"},{"number":7,"text":"O Zekerijja, javljamo ti radosnu vijest da će ti se dječak roditi, ime će mu Jahja biti, nikome prije njega to ime nismo htjeli dati"},{"number":8,"text":"Gospodaru moj\" – reče on – \"kako ću imati sina kad mi je žena nerotkinja, a već sam duboku starost doživio"},{"number":9,"text":"Eto tako!\" – reče. \"Gospodar tvoj je rekao: 'To je Meni lahko, i tebe sam ranije stvorio, a nisi ništa bio"},{"number":10,"text":"Gospodaru moj\" – reče – \"daj mi neki znak!\" – \"Znak će ti biti to što tri noći nećeš s ljudima razgovarati, a zdrav ćeš biti"},{"number":11,"text":"I on iziđe iz hrama u narod svoj i znakom im dade na znanje: \"Hvalite Ga ujutro i navečer"},{"number":12,"text":"O Jahja, prihvati Knjigu odlučno!\" – a dadosmo mu mudrost još dok je dječak bio"},{"number":13,"text":"i nježnost i čednost, i čestit je bio"},{"number":14,"text":"i roditeljima svojima bio je dobar, i nije bio drzak i nepristojan"},{"number":15,"text":"I neka je mir njemu na dan kada se rodio i na dan kada je umro i na dan kad bude iz mrtvih ustao"},{"number":16,"text":"I spomeni u Knjizi Merjemu: kada se od ukućana svojih na istočnu stranu povukla"},{"number":17,"text":"i jedan zastor da se od njih zakloni uzela, Mi smo k njoj meleka Džibrila poslali i on joj se prikazao u liku savršeno stvorena muškarca"},{"number":18,"text":"Utječem se Milostivom od tebe, ako se Njega bojiš!\" – uzviknu ona"},{"number":19,"text":"A ja sam upravo izaslanik Gospodara tvoga\" – reče on – \"da ti poklonim dječaka čista"},{"number":20,"text":"Kako ću imati dječaka\" – reče ona – \"kad me nijedan muškarac dodirnuo nije, a ja nisam nevaljalica"},{"number":21,"text":"To je tako!\" – reče on. \"Gospodar tvoj je rekao: 'To je Meni lahko', i zato da ga učinimo znamenjem ljudima i znakom milosti Naše. Tako je unaprijed određeno"},{"number":22,"text":"I ona zanese i bremenita se skloni daleko negdje"},{"number":23,"text":"I porođajni bolovi prisiliše je da dođe do stabla jedne palme. \"Kamo sreće da sam ranije umrla i da sam potpuno u zaborav pala!\" – uzviknu ona"},{"number":24,"text":"I melek je, koji je bio niže nje, zovnu: \"Ne žalosti se, Gospodar tvoj je dao da niže tebe potok poteče"},{"number":25,"text":"Zatresi palmino stablo, posuće po tebi datule svježe"},{"number":26,"text":"pa jedi i pij i budi vesela! A ako vidiš čovjeka kakva, ti reci: 'Ja sam se zavjetovala Milostivom da ću šutjeti, i danas ni s kim neću govoriti"},{"number":27,"text":"I dođe ona s njim porodici svojoj, noseći ga. \"O Merjemo\" – rekoše oni – \"učinila si nešto nečuveno"},{"number":28,"text":"Ej ti, koja u čednosti ličiš Harunu, otac ti nije bio nevaljao, a ni mati tvoja nije bila nevaljalica"},{"number":29,"text":"A ona im na njega pokaza. \"Kako da govorimo djetetu u bešici?\" – rekoše"},{"number":30,"text":"Ja sam Allahov rob\" – ono reče – \"meni će On Knjigu dati i vjerovjesnikom me učiniti"},{"number":31,"text":"i učiniće me, gdje god budem, blagoslovljenim, i narediće mi da dok sam živ molitvu obavljam i milostinju udjeljujem"},{"number":32,"text":"i da majci svojoj budem dobar, a neće mi dopustiti da budem drzak i nepristojan"},{"number":33,"text":"I neka je mir nada mnom na dan kada sam se rodio i na dan kada budem umro i na dan kada budem iz mrtvih ustajao"},{"number":34,"text":"To je Isa, sin Merjemin – to je prava istina o njemu – onaj u koga oni sumnjaju"},{"number":35,"text":"Nezamislivo je da Allah ima dijete, hvaljen neka je On! Kad nešto odluči, On za to rekne samo: \"Budi!\" – i ono bude"},{"number":36,"text":"Allah je, uistinu, i moj i vaš Gospodar, zato se klanjajte samo Njemu! To je Pravi put"},{"number":37,"text":"I sljedbenici Knjige su se o njemu u mišljenju podvojili, pa teško onima koji ne vjeruju kada budu na Danu velikom prisutni"},{"number":38,"text":"Kako će dobro čuti i kako će dobro vidjeti onoga Dana kad pred Nas stanu! A nevjernici su sada u očitoj zabludi"},{"number":39,"text":"I opomeni ih na Dan tuge kada će biti s polaganjem računa završeno, a oni su ravnodušni bili i nisu vjerovali"},{"number":40,"text":"Mi ćemo Zemlju i one koji žive na njoj naslijediti i Nama će se oni vratiti"},{"number":41,"text":"Spomeni, u Knjizi, Ibrahima! On je bio istinoljubiv, vjerovjesnik"},{"number":42,"text":"Kada je rekao ocu svome: \"O oče moj, zašto se klanjaš onome koji niti čuje niti vidi, niti ti može od ikakve koristi biti"},{"number":43,"text":"O oče moj, meni dolazi znanje, a ne tebi; zato mene slijedi, i ja ću te na Pravi put uputiti"},{"number":44,"text":"o oče moj, ne klanjaj se šejtanu, šejtan je Milostivome uvijek neposlušan"},{"number":45,"text":"o oče moj, bojim se da te od Milostivog ne stigne kazna, pa da budeš šejtanu drug\" –"},{"number":46,"text":"otac njegov je rekao: \"Zar ti mrziš božanstva moja, o Ibrahime? Ako se ne okaniš, zbilja ću te kamenjem potjerati, zato me za dugo vremena napusti"},{"number":47,"text":"Mir tebi!\" – reče Ibrahim. \"Moliću Gospodara svoga da ti oprosti, jer On je vrlo dobar prema meni"},{"number":48,"text":"I napustiću i vas i sve one kojima se mimo Allaha klanjate i klanjaću se Gospodaru svome; nadam se da neću biti nesretan u klanjanju Gospodaru svome"},{"number":49,"text":"I pošto napusti njih i one kojima su se, mimo Allaha, klanjali, Mi mu Ishaka i Jakuba darovasmo, i obojicu vjerovjesnicima učinismo"},{"number":50,"text":"i darovasmo im svako dobro i učinismo da budu hvaljeni i po dobru spominjani"},{"number":51,"text":"I spomeni u Knjizi Musaa! On je bio iskren i bio je poslanik, vjerovjesnik"},{"number":52,"text":"Mi smo ga s desne strane Tura zovnuli i Sebi ga približili da čuje riječi Naše"},{"number":53,"text":"i darovali smo mu milošću Našom kao vjerovjesnika brata njegova Haruna"},{"number":54,"text":"I spomeni u Knjizi Ismaila! On je ispunjavao dato obećanje i bio poslanik, vjerovjesnik"},{"number":55,"text":"i tražio je od čeljadi svoje da molitvu obavljaju i da milostinju udjeljuju, i Gospodar njegov je bio njima zadovoljan"},{"number":56,"text":"I spomeni u Knjizi Idrisa! On je bio istinoljubiv i vjerovjesnik"},{"number":57,"text":"i Mi smo ga na visoko mjesto digli"},{"number":58,"text":"To su ti vjerovjesnici koje je Allah milošću Svojom obasuo, potomci Ademovi i onih koje smo sa Nuhom nosili, i potomci Ibrahimovi i Israilovi, i onih koje smo uputili i odabrali. Kad bi im se ajeti Milostivog čitali, oni bi licem na tle padali i plakali"},{"number":59,"text":"A njih smijeniše zli potomci, koji molitvu napustiše i za požudama pođoše; oni će sigurno zlo proći"},{"number":60,"text":"ali oni koji su se pokajali, i vjerovali, i dobro činili, njima se neće nikakva nepravda učiniti, oni će u Džennet ući"},{"number":61,"text":"u edenske vrtove koje je Milostivi robovima Svojim obećao zato što su u njih vjerovali, a nisu ih vidjeli – a obećanje Njegovo će se doista ispuniti –"},{"number":62,"text":"u njima prazne besjede neće slušati, već samo: \"Mir!\" i u njima će i ujutro i navečer opskrbljeni biti"},{"number":63,"text":"Daćemo da takav Džennet naslijedi onaj od robova Naših koji se bude grijeha klonio"},{"number":64,"text":"Mi smo u Džennet ušli samo dobrotom Gospodara tvoga, On je vladar svega, On zna budućnost našu i prošlost našu i ono što je između toga\" – govoriće. Gospodar tvoj ne zaboravlja"},{"number":65,"text":"On je Gospodar nebesa i Zemlje i onoga što je između njih, zato se samo Njemu klanjaj i u tome budi istrajan! Znaš li da ime Njegovo ima iko"},{"number":66,"text":"Čovjek kaže: \"Zar ću, kad umrem, zbilja biti oživljen"},{"number":67,"text":"A zar se čovjek ne sjeća da smo ga još prije stvorili, a da nije bio ništa"},{"number":68,"text":"I tako mi Gospodara tvoga, Mi ćemo i njih i šejtane sakupiti, zatim ćemo ih dovesti da oko Džehennema na koljenima kleče"},{"number":69,"text":"a onda ćemo iz svake skupine izdvojiti one koji su prema Milostivome najdrskiji bili"},{"number":70,"text":"jer Mi dobro znamo one koji su najviše zaslužili da u njemu gore"},{"number":71,"text":"I svaki od vas će do njega stići! Gospodar tvoj se, sigurno, tako obavezao"},{"number":72,"text":"Zatim ćemo one koji su se grijeha klonili spasiti, a nevjernike ćemo da u njemu na koljenima kleče ostaviti"},{"number":73,"text":"Kad su im se Naši jasni ajeti kazivali, onda su oni koji nisu vjerovali govorili onima koji su vjerovali: \"Ili smo mi ili vi u boljem položaju i ko ima više pobornika"},{"number":74,"text":"A koliko smo Mi prije njih naroda uništili koji su blagom i izgledom divljenje izazivali"},{"number":75,"text":"Reci: \"Onome ko je u zabludi, neka Milostivi dug život dâ!\" – Ali kad takvi dožive da se opomene ostvare, bilo kazna, bilo Smak svijeta, zbilja će saznati ko je u gorem položaju i ko ima pobornika manje –"},{"number":76,"text":"i Allah će pomoći onima koji su na Pravome putu! A dobra djela koja vječno ostaju – od Gospodara tvoga biće bolje nagrađena i ljepše uzvraćena"},{"number":77,"text":"Zar nisi vidio onoga koji u dokaze Naše ne vjeruje i govori: \"Zacijelo će mi biti dato bogatstvo i djeca"},{"number":78,"text":"Ili je on budućnost prozreo ili je od Milostivog obećanje primio"},{"number":79,"text":"Nijedno! Mi ćemo ono što on govori zapisati i patnju mu veoma produžiti"},{"number":80,"text":"a ono što smo mu dali – naslijediti, i sam samcat će Nam se vratiti"},{"number":81,"text":"Oni kao zagovornike nekakva božanstva, a ne Allaha, uzimaju"},{"number":82,"text":"A ne valja tako! Božanstva ta će poreći da su im se klanjali, i biće im protivnici"},{"number":83,"text":"Zar ne vidiš da Mi nevjernike šejtanima prepuštamo da ih što više na zlo navraćaju"},{"number":84,"text":"Zato ne traži da što prije stradaju, Mi im polako dane odbrajamo"},{"number":85,"text":"Onoga Dana kada čestitē kao uzvanike pred Milostivim sakupimo"},{"number":86,"text":"a kad u Džehennem žedne grješnike potjeramo"},{"number":87,"text":"niko se ni za koga neće moći zauzimati, osim onoga kome Milostivi dopusti"},{"number":88,"text":"Oni govore: \"Milostivi je uzeo dijete!\" –"},{"number":89,"text":"Vi, doista, nešto odvratno govorite"},{"number":90,"text":"Gotovo da se nebesa raspadnu, a Zemlja provali i planine zdrobe"},{"number":91,"text":"što Milostivom pripisuju dijete"},{"number":92,"text":"Nezamislivo je da Milostivi ima dijete –"},{"number":93,"text":"ta svi će oni, i oni na nebesima i oni na Zemlji, kao robovi u Milostivog tražiti utočište"},{"number":94,"text":"On ih je sve zapamtio i tačno izbrojio"},{"number":95,"text":"i svi će Mu na Sudnjem danu doći pojedinačno"},{"number":96,"text":"One koji su vjerovali i dobra djela činili Milostivi će, sigurno, voljenim učiniti"},{"number":97,"text":"Mi smo Kur'an učinili lahkim, na tvome jeziku, da bi njime one koji se Allaha boje i grijeha klone obradovao, a inadžije nepopustljive opomenuo"},{"number":98,"text":"A koliko smo samo naroda prije njih uništili! Da li ijednog od njih vidiš i da li i najslabiji glas njihov čuješ"}]}