{"number":31,"edition":"bs.korkut","ayahs":[{"number":1,"text":"Elif Lām Mīm"},{"number":2,"text":"Ovo su ajeti mudre Knjige"},{"number":3,"text":"upute i milosti onima koji budu dobro činili"},{"number":4,"text":"onima koji molitvu budu obavljali i zekat davali i koji u onaj svijet budu čvrsto vjerovali"},{"number":5,"text":"njima će Gospodar njihov na Pravi put ukazati i oni će želje svoje ostvariti"},{"number":6,"text":"Ima ljudi koji kupuju priče za razonodu da bi, ne znajući koliki je to grijeh, s Allahova puta odvodili i da bi ga predmetom za ismijavanje uzimali. Njih čeka sramna kazna"},{"number":7,"text":"Kad se nekom od njih ajeti Naši kazuju, on oholo glavu okreće, kao da ih nije ni čuo, kao da je gluh – zato mu navijesti patnju nesnosnu"},{"number":8,"text":"One koji budu vjerovali i dobra djela činili doista čekaju bašče uživanja"},{"number":9,"text":"u njima će vječno boraviti – obećanje je Allahovo istinito, a On je silan i mudar"},{"number":10,"text":"Nebesa je, vidite ih, bez stupova stvorio, a po Zemlji planine nepomične razbacao da vas ne trese, i po njoj životinje svih vrsta razasuo. Mi s neba kišu spuštamo i činimo da po njoj niču svakovrsne plemenite biljke"},{"number":11,"text":"To je Allahovo djelo; a pokažite Mi šta su drugi, mimo Njega, stvorili? Ništa! Mnogobošci su u pravoj zabludi"},{"number":12,"text":"A Mi smo Lukmanu mudrost darovali: \"Budi zahvalan Allahu! Ko je zahvalan, čini to u svoju korist, a ko je nezahvalan – pa, Allah je, zaista, neovisan i hvale dostojan"},{"number":13,"text":"Kada Lukman reče sinu svome, savjetujući ga: \"O sinko moj, ne smatraj druge Allahu ravnim, mnogoboštvo je, zaista, velika nepravda"},{"number":14,"text":"Mi smo naredili čovjeku da bude poslušan roditeljima svojim. Majka ga nosi, a njeno zdravlje trpi, i odbija ga u toku dvije godine. Budi zahvalan Meni i roditeljima svojim, Meni će se svi vratiti"},{"number":15,"text":"A ako te budu nagovarali da drugog Meni ravnim smatraš, onoga o kome ništa ne znaš, ti ih ne slušaj i prema njima se, na ovome svijetu, velikodušno ponašaj, a slijedi put onoga koji se iskreno Meni obraća; Meni ćete se poslije vratiti i Ja ću vas o onome što ste radili obavijestiti"},{"number":16,"text":"O sinko moj, dobro ili zlo, teško koliko zrno gorušice, bilo u stijeni ili na nebesima ili u zemlji, Allah će na vidjelo iznijeti, jer Allah zna najskrivenije stvari, On je Sveznajući"},{"number":17,"text":"O sinko moj, obavljaj molitvu i traži da se čine dobra djela, a odvraćaj od hrđavih i strpljivo podnosi ono što te zadesi – dužnost je tako postupiti"},{"number":18,"text":"I, iz oholosti, ne okreći od ljudi lice svoje i ne idi zemljom nadmeno, jer Allah ne voli ni gordog ni hvalisavog"},{"number":19,"text":"U hodu budi odmjeren, a u govoru ne budi grlat; ta najneprijatniji glas je revanje magarca"},{"number":20,"text":"Kako ne vidite da vam je Allah omogućio da se koristite svim onim što postoji na nebesima i na Zemlji i da vas darežljivo obasipa milošću Svojom, i vidljivom i nevidljivom? A ima ljudi koji raspravljaju o Allahu bez ikakva znanja, bez ikakve upute i bez knjige svjetilje"},{"number":21,"text":"A kad im se govori: \"Slijedite ono što vam Allah objavljuje!\" – odgovaraju: \"Ne, mi slijedimo ono što smo zapamtili od predaka naših.\" Zar i onda kad ih šejtan poziva na patnju u ognju"},{"number":22,"text":"Onaj ko se sasvim preda Allahu, a uz to čini dobra djela, uhvatio se za najčvršću vezu. Allahu se na koncu sve vraća"},{"number":23,"text":"A onaj koji ne vjeruje, pa, neka te ne zabrinjava nevjerovanje njegovo. Nama će se svi vratiti i Mi ćemo ih o onome šta su radili obavijestiti; Allahu su, uistinu, poznate svačije misli"},{"number":24,"text":"Mi im dajemo da kratko uživaju, a onda ćemo ih natjerati u patnju neizdržljivu"},{"number":25,"text":"A da ih upitaš: \"Ko je stvorio nebesa i Zemlju?\" – sigurno bi rekli: \"Allah!\" – a ti reci: \"Hvaljen neka je Allah!\" – samo što većina njih ne zna"},{"number":26,"text":"Allahovo je sve na nebesima i na Zemlji! Allah je, uistinu, nezavisan i hvale dostojan"},{"number":27,"text":"Da su sva stabla na Zemlji pisaljke, a da se u more, kad presahne, ulije još sedam mora, ne bi se ispisale Allahove riječi; Allah je, uistinu, silan i mudar"},{"number":28,"text":"Stvoriti sve vas i sve vas oživiti isto je kao stvoriti i oživiti jednoga čovjeka; Allah, zaista, sve čuje i sve vidi"},{"number":29,"text":"Kako ne vidiš da Allah uvodi noć u dan i uvodi dan u noć, i da je potčinio Sunce i Mjesec – svako se kreće do roka određenog – i da Allah dobro zna ono što radite"},{"number":30,"text":"To zato što je Allah – Istina, a oni kojima se, pored Njega, oni mole – neistina, i što je Allah uzvišen i velik"},{"number":31,"text":"Zar ne vidiš da lađe Allahovom milošću morem plove da bi vam pokazao neke dokaze Svoje? To su, zaista, pouke za sve strpljive i zahvalne"},{"number":32,"text":"A kad ih talas, kao oblak, prekrije, mole se Allahu iskreno Mu vjeru ispovijedajući; a čim ih On do kopna dovede, samo Mu neki zahvalni ostaju. A dokaze Naše samo izdajnik, nezahvalnik poriče"},{"number":33,"text":"O ljudi, bojte se Gospodara svoga i strahujte od Dana kad roditelj djetetu svome neće moći nimalo pomoći, niti će dijete moći svome roditelju imalo pomoći! Allahova prijetnja je istinita, pa neka vas nikako život na ovome svijetu ne zavara i neka vas u Allaha šejtan ne pokoleba"},{"number":34,"text":"Samo Allah zna kad će Smak svijeta nastupiti, samo On spušta kišu i samo On zna šta je u matericama, a čovjek ne zna šta će sutra zaraditi i ne zna čovjek u kojoj će zemlji umrijeti; Allah, uistinu, sve zna i o svemu je obaviješten"}]}