{
  "number": 62,
  "name": "سُورَةُ الجُمُعَةِ",
  "englishName": "Al-Jumu'a",
  "ayahs": [
    {
      "number": 1,
      "text": "اللہ کی تسبیح کر رہی ہے ہر وہ چیز جو آسمانوں میں ہے اور ہر وہ چیز جو زمین میں ہے بادشاہ ہے، قدوس ہے، زبردست اور حکیم ہے",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 2,
      "text": "وہی ہے جس نے امیوں کے اندر ایک رسول خود اُنہی میں سے اٹھایا، جو اُنہیں اُس کی آیات سناتا ہے، اُن کی زندگی سنوارتا ہے، اور اُن کو کتاب اور حکمت کی تعلیم دیتا ہے حالانکہ اِس سے پہلے وہ کھلی گمراہی میں پڑے ہوئے تھے",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 3,
      "text": "اور (اس رسول کی بعثت) اُن دوسرے لوگوں کے لیے بھی ہے جو ابھی اُن سے نہیں ملے ہیں",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 4,
      "text": "اللہ زبردست اور حکیم ہے یہ اس کا فضل ہے، جسے چاہتا ہے دیتا ہے، اور وہ بڑا فضل فرمانے والا ہے",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 5,
      "text": "جن لوگوں کو توراۃ کا حامل بنایا گیا تھا مگر انہوں نے اس کا بار نہ اٹھا یا، اُن کی مثال اُس گدھے کی سی ہے جس پر کتابیں لدی ہوئی ہوں اِس سے بھی زیادہ بری مثال ہے اُن لوگوں کی جنہوں نے اللہ کی آیات کو جھٹلا دیا ہے ایسے ظالموں کو اللہ ہدایت نہیں دیا کرتا",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 6,
      "text": "اِن سے کہو، \"اے لوگو جو یہودی بن گئے ہو، اگر تمہیں یہ گھمنڈ ہے کہ باقی سب لوگوں کو چھوڑ کر بس تم ہی اللہ کے چہیتے ہو تو موت کی تمنا کرو اگر تم اپنے اِس زعم میں سچے ہو\"",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 7,
      "text": "لیکن یہ ہرگز اس کی تمنا نہ کریں گے اپنے کرتوتوں کی وجہ سے جو یہ کر چکے ہیں، اور اللہ اِن ظالموں کو خوب جانتا ہے",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 8,
      "text": "اِن سے کہو، \"جس موت سے تم بھاگتے ہو وہ تو تمہیں آ کر رہے گی پھر تم اس کے سامنے پیش کیے جاؤ گے جو پوشیدہ و ظاہر کا جاننے والا ہے، اور وہ تمہیں بتا دے گا کہ تم کیا کچھ کرتے رہے ہو",
      "juz": 28,
      "manzil": 7,
      "page": 553,
      "ruku": 486,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 9,
      "text": "اے لوگو جو ایمان لائے ہو، جب پکارا جائے نماز کے لیے جمعہ کے دن تو اللہ کے ذکر کی طرف دوڑو اور خرید و فروخت چھوڑ دو، یہ تمہارے لیے زیادہ بہتر ہے اگر تم جانو",
      "juz": 28,
      "manzil": 7,
      "page": 554,
      "ruku": 487,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 10,
      "text": "پھر جب نماز پوری ہو جائے تو زمین میں پھیل جاؤ اور اللہ کا فضل تلاش کرو اور اللہ کو کثرت سے یاد کرتے رہو، شاید کہ تمہیں فلاح نصیب ہو جائے",
      "juz": 28,
      "manzil": 7,
      "page": 554,
      "ruku": 487,
      "hizbQuarter": 221,
      "sajda": false
    },
    {
      "number": 11,
      "text": "اور جب انہوں نے تجارت اور کھیل تماشا ہوتے دیکھا تو اس کی طرف لپک گئے اور تمہیں کھڑا چھوڑ دیا ان سے کہو، جو کچھ اللہ کے پاس ہے وہ کھیل تماشے اور تجارت سے بہتر ہے اور اللہ سب سے بہتر رزق دینے والا ہے",
      "juz": 28,
      "manzil": 7,
      "page": 554,
      "ruku": 487,
      "hizbQuarter": 221,
      "sajda": false
    }
  ]
}