{"number":30,"edition":"cs.nykl","ayahs":[{"number":1,"text":"Alif. Lám. Mím"},{"number":2,"text":"Poraženi byli Řekové"},{"number":3,"text":"v blízkosti naší země: však po porážce své budou zase vítězi"},{"number":4,"text":"za několik let. Bohu přináleží rozsouzení, před i po (každé události). A v den onen rozradují se věřící"},{"number":5,"text":"nad (vítězstvím) z pomoci Boha: pomáháť Bůh, komu chce, neb on mocný jest, slitovný"},{"number":6,"text":"Toto jest slib Boha a Bůh nikdy nebéře zpět slibu svého, však většina lidí není si toho vědoma"},{"number":7,"text":"Znají pouze po zevnějšku život pozemský a vůči životu budoucímu jsou lhostejní"},{"number":8,"text":"Zdaž nerozvažovali sami v duchu, že Bůh nestvořil nebesa a zemi, a vše, což mezi oběma jest, leda v opravdovosti a pouze až do lhůty předurčené? Však zajisté mnoho lidí v setkání s Pánem svým nevěří"},{"number":9,"text":"Zdaž necestovali v zemi a neviděli, jaký byl konec těch před nimi, kteří byli mocnější jich silou? Rozbrázdili zemi a zalidnili ji ve větším počtu, než jakým oni zalidňují ji: a přišli k nim poslové naši s jasnými důkazy. A nebyl to Bůh, jenž bezpráví jim učinil, nýbrž oni sobě samým bezpráví učinili"},{"number":10,"text":"A konec těch, již páchali zlo, zlý byl: neboť zajisté vylhanými nazývali znamení naše a žert si z nich tropili"},{"number":11,"text":"Bůh vzbuzuje stvoření a pak dává mu navraceti se k němu: a pak všichni navráceni k němu budete"},{"number":12,"text":"A v den, kdy nastane hodina (soudu), oněmí provinilci"},{"number":13,"text":"a nebude jim mezi těmi, jež spolčovali (s Bohem) přímluvců: oni pak budou tyto společníky své zapírati"},{"number":14,"text":"A v den, kdy nastane hodina (soudu), v den ten budou lidé od sebe rozděleni"},{"number":15,"text":"a pokud se týče těch, kdož uvěřili a konali dobré skutky, ti v květnaté lučině radovati se budou"},{"number":16,"text":"a pokud se týče těch, kdož neuvěřili a vylhanými nazývali znamení naše, jakož i setkání v životě budoucím, ti trestu svému odevzdáni budou"},{"number":17,"text":"Chvála budiž tedy Bohu za chvil večerních i za chvil ranních"},{"number":18,"text":"a jemu patří chvála na nebi i na zemi: když noc nadchází i za chvil poledních"},{"number":19,"text":"On vyvádí živé z mrtvých a vyvádí mrtvé z živých: a oživuje zemi zmrtvělou — a tak i vy z mrtvých vyvedeni budete"},{"number":20,"text":"A ze znamení jeho jest, že stvořil vás z prachu: a pak, hle, jste lidmi rozptýlenými"},{"number":21,"text":"A ze znamení jeho jest, že stvořil vám z vás samých manželky, abyste obývali s nimi: a učinil mezi vámi lásku a soucitnost: v tomto zajisté znamení jest pro lid přemýšlivý"},{"number":22,"text":"A ze znamení jeho jest, že stvořil nebe a zemi a rozmanitost jazyků vašich i pletí vašich: v tomto zajisté znamení jsou veškerenstvu"},{"number":23,"text":"A ze znamení jeho jest spánek váš v noci a za dne snažení vaše po docílení (podílu) z milosti jeho: zajisté v tomto znamení jsou lidem slyšícím"},{"number":24,"text":"A ze znamení jeho jest, že ukazuje vám blesk pro strach a naději: a sesílá s nebe vodu, jíž oživuje zemi zmrtvělou: zajisté v tomto znamení jsou pro lid chápavý"},{"number":25,"text":"A ze znamení jeho, jest, že udržují se v stálosti nebe i země z rozkazu jeho: a pak když vyzve vás výzvou k vystoupení ze země, hle, ven z ní vyjdete"},{"number":26,"text":"Jemu přináleží, cožkoliv na nebi jest i na zemi: vše před ním poníženo jest"},{"number":27,"text":"On to jest, jenž vzbuzuje stvoření a pak dává mu navrátiti se k němu: a to přesnadné jest mu. Jemu přináleží, aby přirovnáván byl ke všemu nejvyššímu na nebi i na zemi: a on mocný jest, moudrý"},{"number":28,"text":"Činí vám podobenství vzatá z vás samých: zdaž máte z těch, jichž zmocnila se pravice vaše, společníky v tom, čímž obdařili jsme vás, rovným dílem? Zdaž stejné rozpaky cítíte vůči nim, jako mezi sebou? Takovýmto způsobem vysvětlujeme znamení svá lidu chápavému"},{"number":29,"text":"Jistě, že ne: však nepravostní následují choutky své, z nevědomosti: a kdo uvede na cestu pravou toho, jejž Bůh zavedl v blud? Jim nebude pomocníků"},{"number":30,"text":"Pozdvihni tedy tvář svou věrně k víře, jež ústavou jest Boha, pro kterou byl ustavil lidi: není změny ve stvoření božím. Tato víra jest nepřeměnná, však většina lidí není si toho vědoma"},{"number":31,"text":"Obracejte se (tedy) k Bohu a bojte se ho: a zachovávejte modlitbu, a nepatřte k mnohobožcům"},{"number":32,"text":"k těm, kdož rozštěpili se v náboženství svém a rozdělili na strany: každá strana svým vlastním názorem se holedbajíc"},{"number":33,"text":"Když dotkne se lidí protivenství, volají k Pánu svému, obráceni k němu: pak, když dal okusiti jim milosrdenství svého, hle, část jich s Pánem svým (jiná božstva) spolčují"},{"number":34,"text":"zapírajíce tak to, co dali jsme jim. Jen radujte se z požitků vezdejších — však zvíte"},{"number":35,"text":"Zdaž seslali jsme jim nějaké zmocnění, jež mluvilo by o tom, co spolčují (s Bohem)"},{"number":36,"text":"A když dáme okusiti lidem milosrdenství svého, radují se z něho: však když postihne je něco zlého za to, co byli před tím činili, hle, beznadějní jsou"},{"number":37,"text":"Což neviděli, že Bůh v hojnosti skýtá darů svých, komu chce, aneb odměňuje je? Zajisté v tomto znamení jsou pro lid věřící"},{"number":38,"text":"I dávej příbuzným svým, což patří jim: a taktéž nuzným a počestným: toť lepším jest pro ty, kdož žádají si tváře boží a tito jsou, jimž dobře povede se"},{"number":39,"text":"Cokoliv dáte na lichvu, aby tím lichvařeno bylo se jměním lidí, nebude lichvou rozmnoženo u Boha: však cokoliv dáte na (povinnou) almužnu, žádajíce si tváře boží — tito jsou ti, jimž zdvojnásobeno bude"},{"number":40,"text":"Bůh jest to, jenž stvořil vás, pak živil vás, pak dá vám zemříti, pak vzkřísí vás. Zdaž který ze společníků vašich jest s to, aby učinil s vámi v nejmenším cos podobného? Chválen budiž (Bůh) a daleko povýšen nad to, co spolčují s ním"},{"number":41,"text":"Objevila se spoušť na souši i na moři za to, co vykonaly ruce lidí, aby dala jim okusiti část výsledků činů jejich, aby tak snad (k Bohu) se obrátili"},{"number":42,"text":"Rci: „Procházejte zemí a vizte jaký byl konec těch před vámi, z nichž většina byla mnohobožná.“"},{"number":43,"text":"I pozdvihni tvář svou k víře bezezměnné, dříve než přijde den od Boha, jejž nelze odvrátiti: v den ten na dva tábory rozděleni budou"},{"number":44,"text":"ten, kdož neuvěřil, nesoucí břímě nevíry své: a ten, kdož konal dobro, chystající si místo pohovení"},{"number":45,"text":"aby tak Bůh mohl odměniti ty, kteří uvěřili a konali dobré skutky, z milosti své, neboť on nemiluje nevěřících"},{"number":46,"text":"A ze znamení jeho jest, že posílá větry s radostnou zvěstí, aby okusiti dal vám milosrdenství svého, aby lodi mohly býti hnány z rozkazu jeho, abyste mohli dobývati si (podílu) z milosti jeho, a abyste možná mu byli vděčni"},{"number":47,"text":"A již před tebou poslali jsme proroky k lidu jejich i přinesli jim jasné důkazy a pomstu vykonali jsme na provinilcích; příslušelo nám pak, abychom pomohli věřícím"},{"number":48,"text":"Bůh jest to, jenž posílá větry, které dují v mračno: a rozděluje Bůh toto po obloze, jak chce, a trhá je v kusy: a pak vidíš déšť, an vychází ze středu jeho: a když dá padnouti mu na které chce ze služebníků svých, ajhle, tu radují se"},{"number":49,"text":"třebaže před tím, než byl seslán na ně, trvali v beznaději"},{"number":50,"text":"I viz tedy stopy milosrdenství božího: jak obživuje zemi zmrtvělou! Takto i Křisitelem jest mrtvých, neb on nade všemi věcmi moc má"},{"number":51,"text":"Však kdybychom poslali vichr a oni shlédli (obilí své) sežloutlé jím, tu setrvávali by poté v zatvrzelosti své"},{"number":52,"text":"Ty pak zajisté nedokážeš, aby slyšeli mrtví, aniž aby slyšeli hluší volání, když odvracejí se zády svými odcházejíce"},{"number":53,"text":"Aniž dokážeš vésti slepé od bloudění jejich: zmůžeš jen, aby slyšeli ti, kdož věří ve znamení naše a odevzdáni jsou do vůle boží"},{"number":54,"text":"Bůh to jest, jenž stvořil vás slabé, po slabosti pak dal vám sílu, a po síle pak opět učiní vás slabými a šedovlasými. Bůh tvoří, co chce, a on vševědoucí jest, mocný"},{"number":55,"text":"A v den, kdy nastane hodina (soudu), přisahati budou provinilci, že dleli pouze hodinu v zemi, tak kdysi lhali (za živa)"},{"number":56,"text":"A řeknou ti, jimž dáno bylo vědění a víra: „Dleli jste tam, jak psáno jest v Knize boží, do dne zmrtvýchvstání: a tento jest den zmrtvýchvstání; však vy nebyli jste si toho vědomi.“"},{"number":57,"text":"U den onen neprospěje nepravostným omluva jejich, aniž o smíření s Bohem žádáni budou"},{"number":58,"text":"A nyní učinili jsme lidem v tomto Koránu všeho druhu podobenství: a kdyby předvedeno bylo jim znamení dojista řekli by ti, kdož neuvěřili: „Vyť pouze jste šejdíři.“"},{"number":59,"text":"Takovýmto způsobem zapečeťuje Bůh srdce těch, kdož nevědí"},{"number":60,"text":"I vytrvej v trpělivosti, neboť slib Boha pravdivý jest: a nechť nezviklají tě obavou ti, již (ve víře) nejisti jsou"}]}