{"number":38,"edition":"cs.nykl","ayahs":[{"number":1,"text":"SÁD. Při Koránu, v němž jest napomenutí"},{"number":2,"text":"věru ti, kdož neuvěřili, jednají zpupně a odbojně"},{"number":3,"text":"Kolik zahladili jsme pokolení před nimi! Volali sice (o slitování), však nebyla to již doba k uniknutí"},{"number":4,"text":"Diví se, že přišel jim varovatel ze středu jejich; a říkají nevěřící: „Toť kouzelník jest, velký lhář"},{"number":5,"text":"Cože? On činí božstva Bohem Jediným? Toť věru věc jest údivná!“"},{"number":6,"text":"A oddálili se předáci jejich, (řkouce): „Jděte a vytrvejte trpělivě při božstvech svých! Toť věru věc jest vyžadovaná"},{"number":7,"text":"Neslyšeli jsme ničeho podobného v náboženství předešlém: Toť věru jest jen šejdířství"},{"number":8,"text":"Jemu (jedinému) mezi námi že bylo sesláno Napomenutí?“ Ano, oni pochybují ohledně Napomenutí mého: ano, uvěří, až okusí trestu mého"},{"number":9,"text":"Což oni mají pokladnice milosrdenství Pána svého, Mocného, Obdarovatele"},{"number":10,"text":"Což jim přináleží panství nebes a země a všeho, což mezi oběma jest? Nechť tedy vystoupí vzhůru po provazech"},{"number":11,"text":"Vojsko jakékoliv tam poraženo bude spojenců"},{"number":12,"text":"Před nimi již lháři nazvali proroky lid Noemův, a (kmen) 'Ád, a Farao, jenž kůly měl"},{"number":13,"text":"A (kmen) Tsemúd, a lid Lotův, a obyvatelé Al-Aika tito (všichni) spojenci byli"},{"number":14,"text":"všichni jen lháři zvali proroky: a trest po právu byl vykonán"},{"number":15,"text":"A nač tito zde čekají než na zavřesknutí jediné, jemuž nebude odkladu"},{"number":16,"text":"A (přece ještě) říkají: „Pane náš, urychli nám podíl náš, přede dnem súčtování!“"},{"number":17,"text":"Strp, co říkají, a pomni služebníka našeho Davida, muže silného, jenž často (kajícně k nám) obracel se"},{"number":18,"text":"jak přiměli jsme hory, aby s ním chválily nás s večerem i v zoře východu"},{"number":19,"text":"a ptactvo, jež shromažďovalo se kol něho a všechno k němu navracelo se"},{"number":20,"text":"Jak upevnili jsme království jeho a dali jsme mu moudrost a (bystré) sporů rozsuzování"},{"number":21,"text":"Zdaž došla tě zpráva o sporu oněch dvou, když přelezli zeď výklenku"},{"number":22,"text":"Když objevili se před Davidem a on lekl se jich, řekli: „Neboj se, jsme dva ve sporu, z nichž jeden učinil příkoří druhému. Rozsuď mezi námi dle pravdy, nejsa stranickým, a uveď nás na stezku rovnou"},{"number":23,"text":"Toto jest bratr můj; měl devadesát devět ovcí, já pouze jedinou měl; i řekl mi: ‚Dej mi ji v opatrování.‘ A nyní přemohl mne ve sporu o ni.“"},{"number":24,"text":"Řekl David: „Onť bezpráví ti učinil, žádaje tě o tvoji ovci, aby připojil ji k ovcím svým. A v pravdě mnoho společníků činí si navzájem příkoří, vyjma těch, kdož uvěřili a konali dobré skutky, však jak malý jest (počet) těchto!“ Dovtípil se pak David, že zkoušeli jsme jej pouze tímto; i prosil za odpuštění Pána svého, a padl na kolena svá a kál se"},{"number":25,"text":"I odpustili jsme mu to, a má u nás místo blízké, a krásné přebývání"},{"number":26,"text":"Ó Davide, učinili jsme tě náměstkem svým na zemi: pročež rozsuzuj mezi lidmi dle pravdy, a nenásleduj choutek svých, neb (jinak) zavedou tě od stezky boží. Těm pak, kdož zbloudí od stezky boží, schystán jest trest přísný za to, že zapomněli na den súčtování"},{"number":27,"text":"A nestvořili jsme nebe a zemi a cožkoli mezi nimi jest, zbytečně. Tak mní jen ti, kdož neuvěřili: a běda těm, kdož neuvěřili, před ohněm (pekelným)"},{"number":28,"text":"Zdaž postavíme ty, kdož uvěřili a konali dobré skutky, na roveň těm, kteří spoušť tropí v zemi? Anebo věřící postavíme na roveň bezbožníkům"},{"number":29,"text":"Kniha, již seslali jsme ti, požehnána jest: aby přemítali o znameních jejích a pamětlivi jich byli lidé (pronikavého) rozumu"},{"number":30,"text":"A dali jsme Davidovi Šalamouna: výborný to služebník (náš), jenž rád (k nám) obracel se"},{"number":31,"text":"(Pomni), když předvedeni mu byli jednoho večera dva bujní ořové"},{"number":32,"text":"i řekl: „V pravdě miloval jsem milování statků (pozemských) nad vzpomínání na Pána svého, až (slunce) zašlo za závoj (noci)"},{"number":33,"text":"Přiveďte je zpět přede mne!“ I počal utínati jim nohy a šíje"},{"number":34,"text":"Taktéž zkoušeli jsme Šalamouna, vrhnuvše na trůn jeho mrtvolu: poté (kajícně k nám) obrátil se"},{"number":35,"text":"řka: „Pane můj, odpusť mi a dej mi království, jež nebude příslušeti nikomu po mně; neb tys (štědrým) obdarovatelem.“"},{"number":36,"text":"A podrobili jsme mu vítr, aby vál dle rozkazu jeho, klidně kam on jej nařídil"},{"number":37,"text":"a zlé duchy, stavitele a potápěče"},{"number":38,"text":"jakož i jiné, připoutané k sobě řetězy"},{"number":39,"text":"„Totoť jest dar náš: obdařuj, neb odnímej, bez skládání účtů.“"},{"number":40,"text":"onť pak má u nás místo blízké a krásné přebývání"},{"number":41,"text":"A vzpomeň (též) služebníka našeho Joba, když volal k Pánu svému: „V pravdě stihl mne Satan (zlou) nemocí a mukami!“"},{"number":42,"text":"„Dupni nohou: toto jest ti k omývání chladivému a k pití.“"},{"number":43,"text":"A dali jsme mu (zpět) rodinu jeho, přidavše mu ještě jednou tolik z milosrdenství svého a jako napomenutí pro lidi (pronikavého) rozumu"},{"number":44,"text":"(Řekli jsme mu): „Vezmi v ruku svou svazek (listů palmových) a udeř jím a neporuš přísahy své.“ V pravdě Pak shledali jsme jej trpělivým; výborný to služebník, jenž často (kajícně k nám) obracel se"},{"number":45,"text":"Vzpomeň též služebníka našeho Abrahama a Isáka a Jakuba, mužů silných a prozíravých"},{"number":46,"text":"Zajisté očistili jsme je čistou (vlastností): připomínáním si obydlí (věčného)"},{"number":47,"text":"Oni pak jsou u nás mezi vyvolenými a dobrými"},{"number":48,"text":"A vzpomeň Ismaele a Elisea a Dzu-l-Kifla: ti všichni byli z dobrých"},{"number":49,"text":"Totoť jest Napomenutí: zajisté pak bohabojným dáno bude přebývání krásné"},{"number":50,"text":"zahrady Edenu, s otevřenými jim branami"},{"number":51,"text":"v nich spočívati budou (na pohovkách) a objednávati si ovoce hojné i pití"},{"number":52,"text":"a vedle nich budou děvy velkých očí, zrak (cudně) klopící, stejného s nimi věku"},{"number":53,"text":"„Toto jest, co slíbeno vám bylo v den súčtování.“"},{"number":54,"text":"„Zajisté, totoť jest výživa naše, jež nikdy se nevyčerpá.“"},{"number":55,"text":"Tak! Však svévolným zajisté dáno bude obývání zlé"},{"number":56,"text":"peklo, v němž péci budou se: jak hrozné to (bude) místo odpočinku"},{"number":57,"text":"Tak! Nechť okusí jej: vody vroucí a hnisu"},{"number":58,"text":"a jiných věcí druhu podobného"},{"number":59,"text":"„Tento sbor dolů zajisté vržen bude střemhlav s vámi. Nebude dáno jim přivítání, neboť pečeni budou v ohni!“"},{"number":60,"text":"Řeknou: „Naopak, vám nebude dáno přivítání! Vy předem schystali jste toto nám: a bídné jest to přebývání!“"},{"number":61,"text":"A řeknou pak: „Pane náš, těm, již schystali nám toto, rozmnož dvojnásob muka v ohni!“"},{"number":62,"text":"A řeknou: „Jak to přijde, že nevidíme mužů, jež počítali jsme mezi zlé"},{"number":63,"text":"a z nichž šprým tropili jsme si? Nebo snad, přehlédli je (naši) zrakové?“"},{"number":64,"text":"Ano, toto jest pravda: tak zajisté, hádati se budou obyvatelé ohně"},{"number":65,"text":"Rci: „Jáť pouze jsem varovatelem: a není jiného Boha, kromě Boha Jediného, Vítězného"},{"number":66,"text":"Pána nebes i země, a všeho, cožkoliv mezi nimi jest, Mocného, Odpouštějícího!“"},{"number":67,"text":"Rci: „Totoť zvěst jest velká"},{"number":68,"text":"a vy odvracíte se od ní"},{"number":69,"text":"Neměl jsem nijaké vědomosti o shromáždění nejvyšším, když spor vedli v něm"},{"number":70,"text":"však toto vnuknuto bylo mi jen proto, že varovatelem jsem zjevným"},{"number":71,"text":"když řekl Pán tvůj k andělům: ‚Jáť stvořím člověka z hlíny"},{"number":72,"text":"a až urovnám jej a vdechnu v něho z ducha svého, padněte před ním na tváře své.‘"},{"number":73,"text":"I padli na tváře své andělé, všichni vesměs"},{"number":74,"text":"vyjma Iblíse, jenž zpyšněl a stal se zatvrzelým. Řekl (Bůh): ‚Iblísi, co zabránilo ti, abys padl na tvář svou, před tím, co stvořil jsem rukama svýma"},{"number":75,"text":"Zpyšněl's, či z vyšších jsi?‘"},{"number":76,"text":"Řekl: ‚Jsem lepším jej: mne stvořil's z ohně a jej stvořil's z hlíny.‘"},{"number":77,"text":"Řekl (Bůh): ‚Vyjdi odsud: kamenován jsi"},{"number":78,"text":"a nad tebou stojí zlořečení mé až do dne soudného.‘"},{"number":79,"text":"Řekl: ‚Pane můj, poshov mi, až do dne, kdy vzkříšeni budou.‘"},{"number":80,"text":"Řekl (Bůh): ‚Budiž poshověno ti"},{"number":81,"text":"až do dne doby určené.‘"},{"number":82,"text":"Řekl: ‚Při moci své (přisám), že zavedu je veškeré"},{"number":83,"text":"až na služebníky tvoje mezi nimi upřímné!‘"},{"number":84,"text":"Řekl (Bůh): ‚Při pravdě, a pravdu pronáším"},{"number":85,"text":"dojista peklo tebou a těmi naplním, již následovat budou tebe, všechněmi.‘"},{"number":86,"text":"Rci: ‚Nežádám si od vás za to odměny, aniž jsem z těch, kdož béřou na se (úkol) přílišný"},{"number":87,"text":"Tato (Kniha) pak napomenutím jest veškerenstvu"},{"number":88,"text":"a dojista zvíte zvěst její po čase!‘“"}]}