{"number":52,"edition":"cs.nykl","ayahs":[{"number":1,"text":"Při HOŘE"},{"number":2,"text":"při Knize napsané"},{"number":3,"text":"na svitku rozbaleném"},{"number":4,"text":"při domu (četně) navštíveném"},{"number":5,"text":"při (klenbě) střechy pozdvižené"},{"number":6,"text":"při moři rozbouřeném"},{"number":7,"text":"(přisahám, že) trest Pána tvého jest nezvratný"},{"number":8,"text":"a není, kdo by jej zadržel"},{"number":9,"text":"V den, kdy valiti se budou nebesa valem"},{"number":10,"text":"a hýbati se budou hory hybem"},{"number":11,"text":"běda v den onen těm, kdož (proroka) lhářem zvali"},{"number":12,"text":"kdož si v planém žvastu hráli"},{"number":13,"text":"V den ten vrženi budou, v oheň pekla vrhem"},{"number":14,"text":"„Totoť oheň jest, jejž vylhaným jste zvali"},{"number":15,"text":"Jest kouzlem to, či nevidíte"},{"number":16,"text":"Pecte se v něm: ať trpělivě snášeti jej budete, či nikoli, jedno bude to pro vás: tak od-měněni jen budete za skutky své.“"},{"number":17,"text":"Však bohabojní budou v zahradách (ráje) a v rozkoš"},{"number":18,"text":"radujíce se z toho, co dal jim Pán jejich: a z toho, že spasil je od muk plamene pekelného"},{"number":19,"text":"„Pojídejte a po-píjejte ve zdraví, v odměnu za skutky své!“"},{"number":20,"text":"Spočívati budou na pohovkách seřazených, a za manželky dáme jim děvy velkých očí černých"},{"number":21,"text":"Ti, kdož uvěřili, a jež následovalo potomstvo jejich ve víře, spojíme s potomstvem jejich: a neošidíme je o nic ze skutků jejich. Každý člověk jest rukojmím za to, čeho dobyl si"},{"number":22,"text":"A v hojnosti dáme jim z ovoce i masa, cokoliv přáti si budou"},{"number":23,"text":"Podávati si tam budou pohár, z nějž nepojde řeč svévolná, ni k hříchu příčina"},{"number":24,"text":"Obcházeti budou je mládci-číšníci, jak perly skryté (krásní)"},{"number":25,"text":"I obrátí se k sobě se vzájemnými dotazy"},{"number":26,"text":"řkouce: „Zajisté byli jsme kdys o rodiny své plni starostí"},{"number":27,"text":"však popřál nám Bůh dobrodiní svého a spasil nás od muk větru žárného"},{"number":28,"text":"neb zajisté jsme jej předtím vzývali: onť pak dobrodějný jest a slitovný.“"},{"number":29,"text":"Pročež napomínej, neb nejsi, z milosti Pána svého, ni hadačem, ni (duchem) posedlým"},{"number":30,"text":"Či říkají: „Básník jest to; dávejme pozor naň, jak osud jeho změní se.“"},{"number":31,"text":"Rci: „Dávejte jen pozor: i já s vámi pozor budu dávati!“"},{"number":32,"text":"Či nabádají je k tomuto (jednání) sny jich, anebo lidem jsou svévolným"},{"number":33,"text":"Či říkají: „Podvrhl jej?“ Naopak, však oni nevěří"},{"number":34,"text":"Nechť tedy předvedou vyprávění jemu podobné, jsou-li pravdomluvnými"},{"number":35,"text":"Či stvořeni byli z ničeho — anebo sami jsou stvořiteli"},{"number":36,"text":"Či oni stvořili nebe a zemi? Naopak, ale pevné víry nemají"},{"number":37,"text":"Či mají snad (v moci) pokladnice Pána tvého, aneb vrchními jsou rozhodčími"},{"number":38,"text":"Či mají snad žebřík, pomocí jehož mohli by přislouchati? Nechť ten, jenž přislouchal tak, předvede moc zjevnou"},{"number":39,"text":"Či Bůh má dcery a vy syny"},{"number":40,"text":"Či žádáš si odměny, když oni dluhy jsou obtěžkáni"},{"number":41,"text":"Či znají věci skryté tak, aby je mohli spisovati"},{"number":42,"text":"Či chtějí lest ti strojiti? Však ti, kdož neuvěřili, sami budou obelstěni"},{"number":43,"text":"Či mají jiného boha, mimo Boha? Chválen budiž Bůh nad to, co s ním spolčují"},{"number":44,"text":"A kdyby viděli kus nebe padati na sebe, řekli by: „Toť mračno zhuštěné.“"},{"number":45,"text":"I ponech je až do chvíle, kdy setkají se se dnem (soudu) svého, jímž postiženi budou"},{"number":46,"text":"dnem, kdy neprospěje jim lest jejich pranic a nebude jim pomoženo"},{"number":47,"text":"Zajisté těm, kdož nepravostni byli, připadnou ještě jiné tresty vedle toho: však většina jich není si toho vědoma"},{"number":48,"text":"Vyčkávej tedy trpělivě rozsudek Pána svého, neb tys pod dozorem naším; a vyvyšuj Pána svého ve chvále jeho, když vstáváš"},{"number":49,"text":"a za noci pěj chválu jeho a při odchodu hvězd"}]}