{"number":54,"edition":"cs.nykl","ayahs":[{"number":1,"text":"Přiblížila se hodina a MĚSÍC rozpoltil se"},{"number":2,"text":"však kdykoli vidí znamení, odvrátí se a řeknou, „Totoť jest kouzelnictví ustavičné!“"},{"number":3,"text":"A vylhanými nazvali (znamení toto) a následují vlastní choutky své: však všechno pevně předurčeno jest"},{"number":4,"text":"Však již přišly jim zprávy o dějích, z nichž možno míti výstrahu"},{"number":5,"text":"moudrost to dokonalá: však nic platno jim není varování"},{"number":6,"text":"Odvrať se tedy od nich! V den, kdy zváti bude Zvoucí k věci příšerné"},{"number":7,"text":"se sklopenými zraky vyjdou z hrobů svých jak kobylky rozptýlené"},{"number":8,"text":"spějíce ke Zvoucímu! I řeknou nevěřící: „Totoť den jest přetěžký.“"},{"number":9,"text":"Před nimi již lid Noemův vylhanou nazval (pravdu) a lhárem nazval služebníka našeho; řekli: „Blázen!“ a byl zastrašen"},{"number":10,"text":"I volal k Pánu svému: „Přemožen jsem; ó pomoz (mi)!“"},{"number":11,"text":"Tu otevřeli jsme brány nebes vodě proudící"},{"number":12,"text":"a dali vyvřít ze země (přehojným) pramenům; i setkaly se (tyto) vody dle rozkazu předurčeného"},{"number":13,"text":"Jej pak nesli jsme na (arše) z prken a hřebíků"},{"number":14,"text":"Před naším zrakem plula, odměnou, tomu, jenž s nevírou přijat byl"},{"number":15,"text":"A jako znamení jsme ji ponechali: což není, kdo pamětliv by toho byl"},{"number":16,"text":"A jaký byl trest můj a varování mé"},{"number":17,"text":"Snadným pak učinili jsme Korán (k pochopení) napomenutí: což není, kdo pamětliv by toho byl"},{"number":18,"text":"Lhářem nazval (kmen) 'Ád (proroka svého): a jaký byl trest můj a varování mé"},{"number":19,"text":"Poslali jsme na ně vichr bouřný v den strasti ustavičné"},{"number":20,"text":"Odnášel lidi jako pařezy datlovníků vyvrácené"},{"number":21,"text":"a jaký byl trest můj a varování mé"},{"number":22,"text":"Snadným pak učinili jsme Korán (k pochopení) napomenutí: což není kdo pamětliv by toho byl"},{"number":23,"text":"Lhářem nazval též (kmen) Tsemúd varovatele"},{"number":24,"text":"řkouce: „Zdaž následovati budeme jednoho muže z nás? Tehdy jistě byli bychom v bludu a třeštění"},{"number":25,"text":"Jemu že výhradně dáno bylo napomenutí mezi námi? Kde pak! Toť lhář jest drzounský!“"},{"number":26,"text":"„Z jitra však zvědí, kdo lhář a drzoun byl"},{"number":27,"text":"Neb pošleme jim velbloudici na vyzkoušení jich: dobře je pozopruj a měj strpení"},{"number":28,"text":"a oznam jim, že voda rozdělena bude. mezi nimi a jí; každé napití budiž střídavé.“"},{"number":29,"text":"Však zavolali na druha svého: (nůž) vytasil, žíly přeřízl jí"},{"number":30,"text":"A jaký byl trest můj a varování mé"},{"number":31,"text":"Poslali jsme na ně jen jedno vzkřiknutí a byla z nich suchá stébla s hlínou smísená"},{"number":32,"text":"Snadným pak učinili jsme Korán (k pochopení) napomenutí: což není, kdo pamětliv by toho byl"},{"number":33,"text":"Lhářem též nazval lid Lotův varovatele"},{"number":34,"text":"I poslali jsme na ně vichr bouřlivý, vyjma rodiny Lotovy: je zachránili jsme za zory"},{"number":35,"text":"z milosti své: takto odměňujeme ty, kdož vděčni jsou"},{"number":36,"text":"On pak varoval je před urputností naší; však pochybovali o varování (tom)"},{"number":37,"text":"Z vášně své Pak žádali na něm hosty jeho, i vytloukli jsme jim oči: „Okuste trestu mého a varování!“"},{"number":38,"text":"Z jitra pak časně stihl je trest můj stanovený"},{"number":39,"text":"„Okuste trestu mého a varování!“"},{"number":40,"text":"Snadným pak učinili jsme Korán (k pochopení) napomenutí: což není, kdo pamětliv by toho byl"},{"number":41,"text":"Přišli kdys k rodu Faraonovu varovatelé"},{"number":42,"text":"Vylhanými pak nazývali znamení naše veškerá a zachvátili jsme je, jakž zachvacuje Mocný, Všemocný"},{"number":43,"text":"Zdaž nevěrci vaši lepsími jsou těchto, či zproštění jest pro vás v Písmech snad"},{"number":44,"text":"Či řeknou snad: „My (velké) spolčení jsme, (navzájem) si pomáhající"},{"number":45,"text":"Poražen bude spolek jich a na útěk se obrátí"},{"number":46,"text":"Vskutku: hodina (soudu) bude časem schůzky jejich; hodina trapná, přetrpká"},{"number":47,"text":"Provinilci pak v bludu jsou a třeštění"},{"number":48,"text":"V den, kdy vláčeni budou do ohně na tvářích svých, řečeno bude jim: „Okuste pekla doteku!“"},{"number":49,"text":"Zajisté pak vše stvořili jsme dle určení"},{"number":50,"text":"A rozkaz náš jest pouze slovo jediné, jak oka mžiknutí"},{"number":51,"text":"Kdys zahladili jsme vám podobné: což není, kdo pamětliv by toho byl"},{"number":52,"text":"A vše, co oni činí, zapsáno v knihách jest"},{"number":53,"text":"(čin) malý ať či velký, dobře jest zanesen"},{"number":54,"text":"Zajisté pak bohabojní budou v zahradách a poblíž řek"},{"number":55,"text":"v sídle (to) pravdy, u Krále všemocného"}]}