{"number":52,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"By the mount"},{"number":2,"text":"By the book inscribed"},{"number":3,"text":"In parchment unrolled"},{"number":4,"text":"By the House Frequented"},{"number":5,"text":"By the roof elevated"},{"number":6,"text":"By the sea overflowing"},{"number":7,"text":"Verily the torment of thine Lord is sure to befalls"},{"number":8,"text":"Of it there is no averter"},{"number":9,"text":"On the Day whereon the heaven will shake with an awful shaking"},{"number":10,"text":"And the mountains will move away with an awful movement"},{"number":11,"text":"Woe, then, will be on that Day to the beliers"},{"number":12,"text":"Those who in wading sport themselves"},{"number":13,"text":"On the Day whereon they will be pushed into Hell-Fire with a dreadful push"},{"number":14,"text":"This is the Fire which ye were wont to believe"},{"number":15,"text":"Is this magic? or ye still see not clearly"},{"number":16,"text":"Roast therein; endure it or endure it not, thereof it is equal Unto you. Ye are only being requited for that which ye have been working"},{"number":17,"text":"Verily the God-fearing will bein Gardens and Delight"},{"number":18,"text":"Rejoicing in that which their Lord hath vouchsafed Unto them; and their Lord will protect them from the torment of the Flame"},{"number":19,"text":"Eat and drink with relish for that which ye have been working"},{"number":20,"text":"Reclining on couches ranged. And We shall couple them with maidens wide eyed"},{"number":21,"text":"And those who believe and whose progeny follow them in belief. We shall cause their progeny to join them, and We shall not diminish Unto them aught of their own work. Every man is for that which he hath earned a pledge"},{"number":22,"text":"And We shall increasingly give them fruit and meat such as they desire"},{"number":23,"text":"They will therein snatch from one another a cup; therein will be neither vain babble nor sin"},{"number":24,"text":"And there will go round on them youths appointed to attend them as though they were pearls hidden"},{"number":25,"text":"And they will advance Unto each other asking questions"},{"number":26,"text":"They will say: verily we were aforetime, midst our household, ever in dread"},{"number":27,"text":"Wherefore Allah hath obliged us, and hath protected us from the torment of the Scorch"},{"number":28,"text":"Verily we were wont to pray Unto Him aforetime; verily He! it is He, the Benign, the Merciful"},{"number":29,"text":"Wherefore admonish thou! thou art not, by the grace of thy Lord, a soothsayer or a madman"},{"number":30,"text":"Or say they: a poet for whom we wait some adverse turn of fortune"},{"number":31,"text":"Say thou: waits verily I am, with you, among the waiters"},{"number":32,"text":"Enjoin them their understandings to this? or are they a people conumacious"},{"number":33,"text":"Or say they: he hath fabricated it: aye they will not believe"},{"number":34,"text":"Let them bring a discourse like thereUnto, if they say sooth"},{"number":35,"text":"Have they not been created by aught, or are they the creators"},{"number":36,"text":"Created they the heavens and the earth! Aye! they will not be convinced"},{"number":37,"text":"Are with them the treasures of thy Lord! or are they the dispensers"},{"number":38,"text":"Have they a stairway whereby they overhear? Then let their listener bring an authority manifest"},{"number":39,"text":"Hath He daughters and ye sons"},{"number":40,"text":"Or askest thou a hire from them so that they are with debt laden"},{"number":41,"text":"Is with them the Unseen, and they write it down"},{"number":42,"text":"Seek they to lay a plot? Then those who disbelieve it is they who shall be plotted against"},{"number":43,"text":"Is theirs a god beside Allah? Hallowed be Allah from that which they associate"},{"number":44,"text":"And if they should see a fragment of the heaven falling down, they would say: it is only clouds piled up"},{"number":45,"text":"Wherefore let them alone, till they meet their Day whereon they shall swoon"},{"number":46,"text":"A Day whereon their plotting will avail them not at all, nor will they be succoured"},{"number":47,"text":"And verily for those who do wrong there is a torment before that; but most of them know not"},{"number":48,"text":"And wait thou patiently the judgment of thy Lord; verily thou art before Our eyes; and hallow the praise of thy Lord when thou uprisest"},{"number":49,"text":"And in the night also hallow Him, and at the setting of the stars"}]}