{"number":78,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"Of what ask they"},{"number":2,"text":"Of the mighty Announcement"},{"number":3,"text":"Concerning which they differ"},{"number":4,"text":"By no means! anon they shall know"},{"number":5,"text":"Again, by no means! anon they shall know"},{"number":6,"text":"Have We not made the earth an expanse"},{"number":7,"text":"And the mountains as stakes"},{"number":8,"text":"And We have created you in pairs"},{"number":9,"text":"And We have made your sleep as a rest"},{"number":10,"text":"And We have made the night a covering"},{"number":11,"text":"And We have made the day for seeking livelihood"},{"number":12,"text":"And We have builded over you seven strong heavens"},{"number":13,"text":"And We have set therein lamps glowing"},{"number":14,"text":"And We have sent down from the rain-clouds water plenteous"},{"number":15,"text":"So that We bring forth thereby corn and vegetation"},{"number":16,"text":"And gardens thick with trees"},{"number":17,"text":"Verily the Day of Decision is a time appointed"},{"number":18,"text":"It is a Day whereon the trumpet will be blown, and ye will come in multitudes"},{"number":19,"text":"And the heaven will have been opened, and it will have become doors"},{"number":20,"text":"And the mountains will have been removed away, and they will have become as mirage"},{"number":21,"text":"Verily the Hell is an ambuscade"},{"number":22,"text":"For the exorbitant a receptacle"},{"number":23,"text":"They will tarry therein for ages"},{"number":24,"text":"They will not taste therein cool or any drink"},{"number":25,"text":"Save scalding water and corruption"},{"number":26,"text":"Recompense fitted"},{"number":27,"text":"Verily they were wont not to look for a reckoning"},{"number":28,"text":"And they belied Our revelations with strong belying"},{"number":29,"text":"And everything We have recorded in a book"},{"number":30,"text":"Taste therefore. We shall not increase you in aught but torment"},{"number":31,"text":"Verily for the God-fearing is an achievement"},{"number":32,"text":"Gardens enclosed and vineyards"},{"number":33,"text":"And full-breasted maidens of equal age"},{"number":34,"text":"And a cup overflowing"},{"number":35,"text":"They will hear therein no babble nor falsehood"},{"number":36,"text":"A recompense from thy Lord-a gift sufficient"},{"number":37,"text":"From the Lord of the heavens and the earth and of whatsoever is in bet-ween them, the Compassionate with Whom they can demand not audience"},{"number":38,"text":"On the Day whereon the spirits and the angels will stand arrayed, they will not be able to speak save him whom the Compassionate giveth leave and who speaketh aright"},{"number":39,"text":"That is the Sure Day. Whosoever therefore willeth, let him betake Unto his Lord a resort"},{"number":40,"text":"Verily We! We have warned you of a torment nigh at hand, a Day whereon a man shall behold that which his hands have sent forth, and the infidel will say: would that I were dust"}]}