{"number":68,"edition":"ja.japanese","ayahs":[{"number":1,"text":"ヌーン。筆に誓けて，また書いたものにおいて誓う。"},{"number":2,"text":"主の恩恵において，あなたは気違いではない。"},{"number":3,"text":"いや，本当にあなたには，尽きない報奨があろう。"},{"number":4,"text":"本当にあなたは，崇高な徳性を備えている。"},{"number":5,"text":"やがてあなたは見よう，かれらもまた見るであろう。"},{"number":6,"text":"あなたがたの誰が気違いであるかを。"},{"number":7,"text":"本当にあなたの主は，道から迷い去った者を，最もよく知っておられ，また導かれている者を最もよく知り尽される方である。"},{"number":8,"text":"それであなたは（真理を）否認する者に従ってはならない。"},{"number":9,"text":"かれらの願いは，あなたが歩み寄ることで，そうなればかれらも妥協したいのである。"},{"number":10,"text":"あなたは，卑劣な誓いをたてるどんな者にも屈従してはならない。"},{"number":11,"text":"中傷し，悪口を言い歩く者，"},{"number":12,"text":"善事を妨げ，掟に背く罪深い者，"},{"number":13,"text":"乱暴（残虐）な者，その外素性の卑しい者，"},{"number":14,"text":"富と（多くの）子女を持っているために（そうである，これらの者に従ってはならない）。"},{"number":15,"text":"かれにわが印が読唱されると，「それは昔の物語です。」と言う。"},{"number":16,"text":"やがてわれは，鼻の上に焼印を押すであろう。"},{"number":17,"text":"本当にわれは，（果樹）園の持ち主を試みたように，かれらを試みた。かれらが，早朝にそれ（果物）を収穫することを誓った時に，"},{"number":18,"text":"（アッラーの御望みならば）と，条件を付けることをしなかった。"},{"number":19,"text":"それでかれらが眠っている間に，あなたの主からの天罰がそれを襲った。"},{"number":20,"text":"それで朝には，それは摘み取られたようになった。"},{"number":21,"text":"早朝かれらは互いに叫んだ。"},{"number":22,"text":"「もし収穫するのならあなたがたの畑に急ぎましょう。」"},{"number":23,"text":"そこでかれらは低声に囁き合って出かけた。"},{"number":24,"text":"「今日は一人の貧乏人も，あの（果樹園）に入らせてはなりません。」"},{"number":25,"text":"かれらは強く心に決めて，朝早く出て行った。"},{"number":26,"text":"だがかれらがそれを見た時，言った。「わたしたちは，道を間違えている。"},{"number":27,"text":"いや，わたしたちは（収穫物を）奪われた。」"},{"number":28,"text":"かれらの中，すこし穏やかな一人が言った。「あなたがたはどうして（主を）讃えないのかと，わたしが言ったのに。」"},{"number":29,"text":"かれらは，「わたしたちの主を讃える。本当にわたしたちは不義でありました。」と言った。"},{"number":30,"text":"そこでかれらは，互いに責め合い始めた。"},{"number":31,"text":"かれらは言った。「ああ悲しい，わたしたちは本当に横柄でした。"},{"number":32,"text":"主はこれに代る，更に良い（果樹園）を与えられるかもしれない。本当にわたしたちは，（悔悟して）主に嘆願します。」"},{"number":33,"text":"このようなものが，（現世の）懲罰である。だが来世の懲罰は更に大きなものである。もしかれらに分っていたならば。"},{"number":34,"text":"本当にアッラーを畏れる者に対しては，主の御許に喜こびの楽園があろう。"},{"number":35,"text":"われは信心深い者たちを，罪人のように扱うとでもいうのか。"},{"number":36,"text":"あなたがたはどうしたのか。あなたがたはどう判断するのか。"},{"number":37,"text":"それともあなたがたには，学ぶに足りる啓典があるのか。"},{"number":38,"text":"あなたがたが選ぶものは，何でもその啓典の中にあるのか。"},{"number":39,"text":"それともあなたがたは，審判の日まで有効な誓約をわれと結んだのか。あなたがたが思慮分別することは，確かにあなたがたのものになるのか。"},{"number":40,"text":"（ムハンマドよ）かれらに問え。「かれらの誰がそれを保証するのですか。」"},{"number":41,"text":"または，かれらは（主に）配するものがあるのか。かれらが正しいのなら，その配するものを連れて来させなさい。"},{"number":42,"text":"脛が，現わにされる日（を思いなさい）。かれらはサジダするよう求められる。だがかれらには出来ないであろう。"},{"number":43,"text":"かれらは目を伏せ，屈辱を被るであろう。サジダするよう，確かにかれらは呼びかけられていた。その時五体満足なのに（拒否した）。"},{"number":44,"text":"そこでこの御言葉（クルアーン）を虚偽であるとする者をわれに任せよ。われはかれらが気付かない方面から，一歩一々（堕落に）導き，"},{"number":45,"text":"かれらを猶予するであろう。本当にわれの計略は強く確かである。"},{"number":46,"text":"それともあなたがかれらに報酬を求め，それでかれらは負担を課せられたのか。"},{"number":47,"text":"また幽玄界がかれらの手元にあり，それでかれらは（それを）書き下すことが出来るのか。"},{"number":48,"text":"だから忍耐して，あなたの主の命令を待て。魚の友のようであってはならない。苦しさの余り（かれが）叫んだ時（のように）。"},{"number":49,"text":"主からの恩恵がかれに達しなかったならば，かれは罪を負わされ，不面目に不毛の地に捨てられたであろう。"},{"number":50,"text":"このように主は，かれを選び正義の徒の一人となされた。"},{"number":51,"text":"不信心者は警告を聞く時，その（物凄い）目付きで，あなたを凡んど倒れんばかりにする。かれらは言う。「本当にかれは憑かれた者です。」"},{"number":52,"text":"だが，この（クルアーン）こそは，万有のための訓戒に外ならない。"}]}