{"number":43,"edition":"it.piccardo","ayahs":[{"number":1,"text":"Hâ', Mîm"},{"number":2,"text":"Per il Libro esplicito"},{"number":3,"text":"Ne abbiamo fatto un Corano arabo affinché comprendiate"},{"number":4,"text":"Esso è presso di Noi, nella Madre del Libro, sublime e colmo di saggezza"},{"number":5,"text":"Dovremmo dunque escludervi dal Monito perché siete gente perversa"},{"number":6,"text":"Quanti profeti abbiamo inviato agli antichi"},{"number":7,"text":"E nessun profeta venne loro senza che lo schernissero"},{"number":8,"text":"Ne facemmo perire di ben più temibili! Già è nota la sorte degli antichi"},{"number":9,"text":"E se chiedi loro: “Chi ha creato i cieli e la terra?”, di certo risponderanno: “Li ha creati l'Eccelso, il Sapiente”"},{"number":10,"text":"Colui Che della terra ha fatto una culla e vi ha tracciato i sentieri affinché possiate guidarvi"},{"number":11,"text":"e dal cielo ha fatto scendere con misura un'acqua, tramite la quale ridiamo la vita ad una terra morta: allo stesso modo vi resusciterà"},{"number":12,"text":"Ha creato tutte le specie e vi ha dato vascelli e animali sui quali montate"},{"number":13,"text":"sicché possiate sedere sui loro dorsi e ricordiate i favori del vostro Signore dicendo: “Gloria a Colui Che ha messo tutto ciò a nostro servizio, mentre non eravamo neppure in grado di domarli"},{"number":14,"text":"In verità noi ritorneremo verso il nostro Signore”"},{"number":15,"text":"Gli hanno ascritto i Suoi servi come fossero una parte [di Lui]. L'uomo è davvero ingrato"},{"number":16,"text":"Si sarebbe forse preso delle figlie tra ciò che ha creato e avrebbe concesso a voi i maschi"},{"number":17,"text":"Quando si annuncia a uno di loro ciò che attribuisce al Compassionevole, si adombra il suo viso e si rattrista"},{"number":18,"text":"“Quest'essere allevato tra i fronzoli, illogico nella discussione?”"},{"number":19,"text":"Considerano femmine gli angeli, i servi del Compassionevole. Sono forse stati testimoni della loro creazione? La loro affermazione sarà scritta e saranno interrogati in proposito"},{"number":20,"text":"Dicono: “Se il Compassionevole avesse voluto, non le avremmo adorate”. Non hanno alcuna scienza in proposito, non esprimono che mere supposizioni"},{"number":21,"text":"O forse, prima di questo, demmo loro una Scrittura alla quale si attengono"},{"number":22,"text":"No, dicono piuttosto: “Abbiamo trovato i nostri avi far parte di una comunità, noi seguiamo le loro orme”"},{"number":23,"text":"Mai inviammo prima di te alcun ammonitore ad una città, senza che quelli che vivevano nell'agiatezza dicessero: “Abbiamo trovato i nostri avi far parte di una comunità e ricalchiamo le loro orme”"},{"number":24,"text":"Diceva [l'ammonitore]: “Anche se vi portassi una Guida migliore di quella che seguivano i vostri avi?”. Rispondevano: “Invero non crediamo in quello con cui siete stati inviati”"},{"number":25,"text":"Ci vendicammo di loro. Considera perciò quel che subirono quanti tacciavano di menzogna"},{"number":26,"text":"E [ricorda] quando Abramo disse a suo padre e al suo popolo: “Io rinnego tutto quello che voi adorate"},{"number":27,"text":"eccetto Colui Che mi ha creato, poiché è Lui che mi guiderà”"},{"number":28,"text":"E di ciò fece una parola che doveva perpetuarsi nella sua discendenza: forse ritorneranno [ad Allah]"},{"number":29,"text":"E anzi, concessi a quelle genti e ai loro avi temporaneo godimento, finché fosse giunta loro la Verità e un Messaggero esplicito"},{"number":30,"text":"Ma quando la Verità giunse loro, dissero: “È magia, noi non crediamo in essa!”"},{"number":31,"text":"E dicono: “Perché questo Corano non è stato rivelato ad un maggiorente di una di queste due città?”"},{"number":32,"text":"Sono forse loro i dispensatori della misericordia del tuo Signore? Siamo Noi che distribuiamo tra loro la sussistenza in questa vita, che innalziamo alcuni di loro sugli altri, in modo che gli uni prendano gli altri a loro servizio. La misericordia del tuo Signore è però [di gran lunga] migliore di quello che accumulano"},{"number":33,"text":"Se non fosse per il fatto che [in tal modo] gli uomini sarebbero diventati una sola comunità [di miscredenti], avremmo fatto d'argento i tetti delle case di coloro che non credono al Compassionevole, e scale per accedervi"},{"number":34,"text":"[Ugualmente avremmo fatto] per le loro case, porte e divani [d'argento] sui quali distendersi"},{"number":35,"text":"e ornamenti d'oro. Tutto ciò non sarebbe che godimento effimero di questa vita, mentre l'Altra vita, presso il tuo Signore, è per i timorati"},{"number":36,"text":"Assegneremo la compagnia inseparabile di un diavolo a chi si distoglie dal Monito del Compassionevole"},{"number":37,"text":"In verità [i diavoli] frappongono ostacoli sulla via di Allah e [gli uomini] credono di essere sulla buona strada"},{"number":38,"text":"Quando poi [un tal uomo] verrà a Noi, dirà: “Ahimè, quanto vorrei che tra te e me ci fosse la distanza che separa i due Orienti!” Che detestabile compagno"},{"number":39,"text":"Ma non vi servirà a nulla in quel Giorno, poiché siete stati ingiusti e pertanto sarete insieme nel castigo"},{"number":40,"text":"Puoi forse far sentire il sordo o dirigere il cieco e colui che persiste nell'errore palese"},{"number":41,"text":"Ci vendicheremo di loro, sia che ti facciamo morire"},{"number":42,"text":"sia che ti facciamo vedere quel che gli promettemmo, poiché Noi prevarremo su di loro"},{"number":43,"text":"Stringi con forza quello che ti è stato rivelato. Tu sei sulla retta via"},{"number":44,"text":"In verità questo è un Monito per te e per il tuo popolo; presto sarete interrogati [in proposito]"},{"number":45,"text":"Chiedi ai Nostri messaggeri che inviammo prima di te, se mai indicammo dèi da adorare all'infuori del Compassionevole"},{"number":46,"text":"Già inviammo Mosè con i Nostri segni al Faraone e ai suoi notabili. Disse: “Io sono il messaggero del Signore dei mondi”"},{"number":47,"text":"Quando mostrò loro i Nostri segni, essi li schernirono"},{"number":48,"text":"mentre ogni segno che facemmo vedere loro era più grande dell'altro! Li colpimmo con il castigo affinché tornassero a Noi"},{"number":49,"text":"Dissero: “O mago, implora per noi il tuo Signore, in nome del patto che ha stretto con te. Allora certamente ci lasceremo guidare”"},{"number":50,"text":"Quando poi allontanammo il castigo da loro, vennero meno [al giuramento]"},{"number":51,"text":"Faraone arringò il suo popolo e disse: “O popol mio, forse non mi appartiene il regno dell'Egitto, con questi canali che scorrono ai miei piedi? Non vedete dunque"},{"number":52,"text":"Non son forse migliore di questo miserabile che sa appena esprimersi"},{"number":53,"text":"Perché non gli sono stati lanciati braccialetti d'oro [dal cielo], perché non lo accompagnano schiere di angeli?”"},{"number":54,"text":"Cercò così di confondere il suo popolo ed essi gli obbedirono: era gente malvagia"},{"number":55,"text":"Quando poi Ci irritarono, Ci vendicammo di loro e li affogammo tutti"},{"number":56,"text":"Facemmo di loro un ricordo e un esempio per i posteri"},{"number":57,"text":"Quando viene proposto l'esempio del figlio di Maria, il tuo popolo lo rifiuta"},{"number":58,"text":"dicendo: “I nostri dèi non sono forse migliori di lui?”. Ti fanno questo esempio solo per amor di polemica, ché sono un popolo litigioso"},{"number":59,"text":"Egli non era altro che un Servo, che Noi abbiamo colmato di favore e di cui abbiamo fatto un esempio per i Figli di Israele"},{"number":60,"text":"Se volessimo, trarremmo angeli da voi ed essi vi sostituirebbero sulla terra"},{"number":61,"text":"Egli è un annuncio dell'Ora. Non dubitatene e seguitemi, questa è la retta via"},{"number":62,"text":"Non ve ne distolga Satana, egli è vostro dichiarato nemico"},{"number":63,"text":"Quando Gesù portò le prove evidenti disse: “Sono venuto a voi con la saggezza e per rendervi esplicita una parte delle cose su cui divergete. Temete Allah e obbeditemi"},{"number":64,"text":"In verità Allah è il mio e vostro Signore. AdorateLo allora. Ecco la retta via”"},{"number":65,"text":"Ma le loro fazioni furono tra loro discordi. Guai agli ingiusti per via del castigo di un Giorno doloroso"},{"number":66,"text":"Aspettano altro che l'Ora? Verrà all'improvviso, senza che se ne avvedano"},{"number":67,"text":"In quel Giorno gli amici saranno nemici gli uni degli altri, eccetto i timorati"},{"number":68,"text":"[Verrà loro detto:] “O Miei servi, oggi non avrete paura e non sarete afflitti"},{"number":69,"text":"[poiché siete] coloro che credono nei Miei segni e sono sottomessi"},{"number":70,"text":"entrate nel Paradiso, voi e le vostre spose, sarete onorati"},{"number":71,"text":"circoleranno tra loro vassoi d'oro e calici, e colà ci sarà quel che desiderano le anime e la delizia degli occhi - e vi rimarrete in perpetuo"},{"number":72,"text":"Ecco il Paradiso che vi è stato fatto ereditare per quel che avete fatto"},{"number":73,"text":"E vi saranno molti frutti e ne mangerete”"},{"number":74,"text":"I malvagi rimarranno in eterno nel castigo dell'Inferno"},{"number":75,"text":"che non sarà mai attenuato e in cui si dispereranno"},{"number":76,"text":"Non saremo Noi ad essere ingiusti nei loro confronti: sono loro gli ingiusti"},{"number":77,"text":"Urleranno: “O Mâlik, che ci finisca il tuo Signore!”"},{"number":78,"text":"Già vi portammo la verità, ma la maggior parte di voi detestava la verità"},{"number":79,"text":"Hanno voluto tendere le loro trame? Anche Noi abbiamo tramato"},{"number":80,"text":"O forse credono che non ascoltiamo i loro segreti e le loro confidenze? Invece sì, i Nostri angeli registrano dinnanzi a loro"},{"number":81,"text":"Di': “Se il Compassionevole avesse un figlio, sarei il primo ad adorarlo”"},{"number":82,"text":"Gloria al Signore dei cieli e della terra, al Signore del Trono, ben al di sopra di quel che Gli attribuiscono"},{"number":83,"text":"Lasciali divagare e giocare, finché non incontreranno il Giorno che è stato loro promesso"},{"number":84,"text":"Egli è Colui Che è Dio nel cielo e Dio sulla terra. Egli è il Saggio, il Sapiente"},{"number":85,"text":"Sia benedetto Colui cui appartiene la sovranità dei cieli, della terra e di quel che vi è frammezzo. Presso di Lui è la scienza dell'Ora. A Lui sarete ricondotti"},{"number":86,"text":"Coloro che essi invocano all'infuori di Lui, non hanno alcun potere di intercessione, eccetto coloro che avranno testimoniato la verità con piena conoscenza"},{"number":87,"text":"Se chiedi loro chi li abbia creati, risponderanno certamente: “Allah”. Come possono allora allontanarsi da Lui"},{"number":88,"text":"E [a] quel grido [del Profeta]: “O Signore! Questo è un popolo che non crede!”"},{"number":89,"text":"[risponderà Allah]: “Allontanati da loro [o Muhammad] e di': \"Pace\". Presto sapranno”"}]}