{"number":15,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Alif. Lam. Ra. To su znaci Kitaba i Kur'ana jasnog"},{"number":2,"text":"Često će voljeti oni koji ne vjeruju, da su muslimani"},{"number":3,"text":"Ostavi ih da jedu i uživaju i neka ih zavara nada. Pa saznaće"},{"number":4,"text":"I nismo uništili nijedan grad, a da mu Knjiga nije bila poznata"},{"number":5,"text":"Neće preteći nijedna umma rok svoj, i neće zadržati"},{"number":6,"text":"I govore: \"O ti kojem se objavljuje Zikr, uistinu si ti luđak"},{"number":7,"text":"Zašto nam ne dovedeš meleke, ako si od iskrenih"},{"number":8,"text":"Ne spuštamo meleke, izuzev s Istinom, a oni tad ne bi bili oni kojima se odlaže"},{"number":9,"text":"Uistinu! Mi, Mi objavljujemo Zikr, i uistinu!, Mi smo njegovi čuvari"},{"number":10,"text":"I doista, slali smo prije tebe (poslanike) među stranke ranijih (naroda)"},{"number":11,"text":"I nije im došao nijedan poslanik, a da se nisu njime ismijavali"},{"number":12,"text":"Tako tome činimo put u srca prestupnika"},{"number":13,"text":"Ne vjeruju u njega, a već je prošao sunnet ranijih"},{"number":14,"text":"I da im otvorimo kapiju neba, pa da stalno kroz nju uzlaze"},{"number":15,"text":"Sigurno bi rekli: \"Samo su opijeni vidovi naši. Naprotiv, mi smo ljudi opčinjeni"},{"number":16,"text":"I doista, načinili smo u nebu galaksije i uljepšali ih za posmatrače"},{"number":17,"text":"I čuvamo ga od svakog šejtana prokletog"},{"number":18,"text":"Izuzev ko ukrade ono šta se čuje - tad ga slijedi svjetlica očita"},{"number":19,"text":"I Zemlju - prostrli smo je i razbacali po njoj stabilne planine, i dali da na njoj izraste od svake stvari odmjereno"},{"number":20,"text":"I načinili smo u njoj sredstva za život vama i onom kome niste opskrbitelji"},{"number":21,"text":"I nema niti jedne stvari, a da kod Nas nisu riznice njene, a spuštamo je samo s mjerom poznatom"},{"number":22,"text":"I šaljemo vjetrove oplođavajuće, pa spuštamo s neba vodu, te vas njome napajamo, a niste vi njeni rizničari"},{"number":23,"text":"A uistinu! Mi, Mi oživljavamo i usmrćujemo i Mi smo Nasljednici"},{"number":24,"text":"I doista znamo prethodnike vaše, i doista znamo one koji slijede"},{"number":25,"text":"A uistinu, Gospodar tvoj, On će ih sakupiti. Uistinu! On je Mudri, Znalac"},{"number":26,"text":"I doista, stvorili smo čovjeka od gline zvečeće, od blata oblikovanog"},{"number":27,"text":"A džinna - stvorili smo ga ranije od vatre vrele"},{"number":28,"text":"I kad reče Gospodar tvoj melecima: \"Uistinu! Ja sam Taj koji će stvoriti smrtnika od zvečeće ilovače, od blata oblikovanog"},{"number":29,"text":"Pa kad ga sredim i udahnem u njega od Duha Svog, tad mu padnite ničice"},{"number":30,"text":"Pa su pali na sedždu meleci, svaki od njih, zajedno"},{"number":31,"text":"Izuzev Iblisa; odbio je da bude sa onima koji padaju na sedždu"},{"number":32,"text":"(Allah) reče: \"O Iblisu! Šta ti je, zar nećeš biti sa onima koji padaju na sedždu"},{"number":33,"text":"Reče: \"Neću da činim sedždu smrtniku kojeg si stvorio od zvečeće ilovače, od blata oblikovanog"},{"number":34,"text":"(Allah) reče: \"Onda izlazi iz njega, pa uistinu, ti si proklet"},{"number":35,"text":"I uistinu, na tebi će biti prokletstvo do Dana sudnjeg"},{"number":36,"text":"Reče: \"Gospodaru moj! Ta odloži mi do Dana kad će (mrtvi) biti podignuti"},{"number":37,"text":"(Allah) reče: \"Pa uistinu, ti si od onih kojima se odlaže"},{"number":38,"text":"Do Dana, wakta poznatog"},{"number":39,"text":"Reče: \"Gospodaru moj! Zato što si me zaveo, sigurno ću im (zlo) učiniti lijepim na Zemlji i sigurno ću ih sve zavesti"},{"number":40,"text":"Izuzev robova Tvojih - od njih odanih"},{"number":41,"text":"(Allah) reče: \"Ovo je put zbog Mene ispravan"},{"number":42,"text":"Uistinu, robovi Moji - nemaš ti nad njima vlast, izuzev ko te slijedi od zalutalih"},{"number":43,"text":"A uistinu, Džehennem je obećano mjesto njih svih"},{"number":44,"text":"Ima on sedam kapija, svaka od tih kapija ima dio odijeljen"},{"number":45,"text":"Uistinu, bogobojazni će biti u baščama i (među) izvorima"},{"number":46,"text":"Uđite u njih sa selamom, sigurni"},{"number":47,"text":"I istrgnućemo šta je u grudima njihovim od zlobe, (kao) braća će biti na sofama, naspramni"},{"number":48,"text":"Neće ih u njima dotaći umor, i neće oni iz njih biti izvedeni"},{"number":49,"text":"Obavijesti robove Moje da sam Ja, Ja Oprosnik, Milosrdni"},{"number":50,"text":"I da je Moja kazna - to kazna bolna"},{"number":51,"text":"I obavijesti ih o gostima Ibrahimovim"},{"number":52,"text":"Kad mu uđoše, pa rekoše: \"Selam!\" reče: \"Uistinu, mi vas se plašimo"},{"number":53,"text":"rekoše: \"Ne boj se! Uistinu, mi ćemo te obradovati dječakom, znalcem"},{"number":54,"text":"(Ibrahim) reče: \"Zar ćete me obradovati kad me je pritiskla starost? Pa čime ćete me obradovati"},{"number":55,"text":"Rekoše: \"Obradovaćemo te Istinom, zato ne budi od očajnih"},{"number":56,"text":"Reče: \"A ko gubi nadu u milost Gospodara svog, osim zalutalih"},{"number":57,"text":"Reče: \"Pa šta je posao vaš, o izaslanici"},{"number":58,"text":"(Meleci) rekoše: \"Uistinu, mi smo poslani narodu prestupnika"},{"number":59,"text":"Izuzev porodice Lutove. Uistinu, Mi ćemo ih sve spasiti"},{"number":60,"text":"Osim žene njegove; odredili smo da ona uistinu bude od izostalih"},{"number":61,"text":"Pa pošto izaslanici dođoše porodici Lutovoj"},{"number":62,"text":"Reče: \"Uistinu, vi ste ljudi neznani"},{"number":63,"text":"Rekoše: \"Naprotiv, došli smo ti s onim u što sumnjaju"},{"number":64,"text":"A donijeli smo ti Istinu, i uistinu, mi istinu govorimo"},{"number":65,"text":"Zato otputuj s porodicom svojom u dijelu noći, i slijedi pozadine njihove, i nek se niko od vas ne okreće, i idite kamo vam se naređuje"},{"number":66,"text":"I javili smo mu tu stvar, da će korijen takvih biti odsječen u zoru"},{"number":67,"text":"I dođoše stanovnici grada, radujući se"},{"number":68,"text":"(Lut) reče: \"Uistinu, ovo su moji gosti, zato me ne sramotite"},{"number":69,"text":"I bojte se Allaha, i ne ponižavajte me"},{"number":70,"text":"Rekoše: \"Zar ti nismo zabranili svjetove"},{"number":71,"text":"Reče: \"Evo kćeri mojih, ako ste izvršitelji"},{"number":72,"text":"Tako mi života tvog, uistinu su oni u opijenosti svojoj lutali"},{"number":73,"text":"Pa ih pogodi krik dok se Sunce rađalo"},{"number":74,"text":"Te učinismo visoko njegovo niskim njegovim, i sasusmo na njih kamenje od gline otvrdnute"},{"number":75,"text":"Uistinu! U tome su znaci za one koji čitaju biljege"},{"number":76,"text":"I uistinu! Oni su uz put postojeći"},{"number":77,"text":"Uistinu! U tome je znak za vjernike"},{"number":78,"text":"A doista su stanovnici Ejke bili zalimi"},{"number":79,"text":"Zato smo im se osvetili; a uistinu, njih dvoje su na drumu vidljivom"},{"number":80,"text":"I doista su stanovnici Hidžra poricali izaslanike"},{"number":81,"text":"A dali smo im znakove Naše, pa su od njih bili odvraćeni"},{"number":82,"text":"I klesali su iz brda kuće sigurni"},{"number":83,"text":"Pa ih je pogodio krik jutrom"},{"number":84,"text":"Te im nije koristilo ono što su stekli"},{"number":85,"text":"I stvorili smo nebesa i Zemlju i ono što je između njih samo s Istinom; a uistinu, Čas dolazi, zato praštaj oprostom lijepim"},{"number":86,"text":"Uistinu! Gospodar tvoj, On je Tvorac, Znalac"},{"number":87,"text":"I doista smo ti dali sedam (ajeta) ponavljajućih, i Kur'an veličanstveni"},{"number":88,"text":"Ne upravljaj oči svoje onome što smo dali da uživaju parovi između njih, i ne žali za njima, i spusti krilo svoje vjernicima"},{"number":89,"text":"I reci: \"Uistinu! Ja, ja sam opominjač jasan"},{"number":90,"text":"Kao što smo objavili djeliteljima"},{"number":91,"text":"Koji su Kur'an učinili odlomcima"},{"number":92,"text":"Pa tako mi Gospodara tvog, sigurno ćemo ih sve pitati"},{"number":93,"text":"O onom šta su radili"},{"number":94,"text":"Zato iznesi šta ti se naređuje i kloni se mušrika"},{"number":95,"text":"Uistinu! Mi smo ti dovoljni protiv podrugljivaca"},{"number":96,"text":"Koji uz Allaha stavljaju boga drugog, pa saznaće"},{"number":97,"text":"I doista znamo da ti tišti grudi tvoje ono šta govore"},{"number":98,"text":"Zato slavi sa hvalom Gospodara svog, i budi od onih koji padaju na sedždu"},{"number":99,"text":"I obožavaj Gospodara svog, dok ti nije došlo zagarantovano"}]}