{"number":28,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Ta. Sin. Mim"},{"number":2,"text":"To su znaci Kitaba jasnog"},{"number":3,"text":"Recitiramo ti (dio) vijesti o Musau i faraonu s Istinom, za ljude koji vjeruju"},{"number":4,"text":"Uistinu! Faraon se uzdigao na Zemlji i učinio stanovnike njene sektama, tlačeći skupinu njih, koljući sinove njihove, a dajući da žive žene njihove. Uistinu, on je bio od mufsida"},{"number":5,"text":"I željeli smo da obdarimo one koji su učinjeni slabima na Zemlji, i učinimo ih imamima, i učinimo ih nasljednicima"},{"number":6,"text":"I da ih učvrstimo na Zemlji, i pokažemo faraonu i Hamanu i vojskama njih dvojice - ono čega su se od njih pribojavali"},{"number":7,"text":"I objavismo majci Musaovoj: \"Zadoji ga, pa kad se za njega uplašiš, tad ga baci u rijeku, i ne plaši se, niti tuguj. Uistinu, Mi ćemo ti ga vratiti i učiniti ga (jednim) od izaslanika"},{"number":8,"text":"Pa je pokupila njega porodica faraonova, da bi im bio neprijatelj i jad. Uistinu! Faraon i Haman i vojske njihove bili su oni koji čine greške"},{"number":9,"text":"I reče žena faraonova: \"Osvježenje oka je meni i tebi. Ne ubijte ga! Možda će nam koristiti ili da ga uzmemo djetetom\" - i oni ne zapaziše"},{"number":10,"text":"I posta srce majke Musaove prazno; skoro bi ga sigurno pokazala, da nismo učvrstili srce njeno, da bude od vjernika"},{"number":11,"text":"I reče sestri njegovoj: \"Slijedi ga!\" Pa je gledala njega izdaleka, a oni ne opaziše"},{"number":12,"text":"I zabranili smo njemu dojilje od ranije, pa (ona) reče: \"Hoćete li da vam ukažem na čeljad kuće (koja) će se brinuti o njemu za vas, i oni će mu biti savjetnici"},{"number":13,"text":"Tad ga vratismo majci njegovoj da joj se oko osvježi i ne žalosti, i da zna da je obećanje Allahovo Istina. Ali većina njih ne zna"},{"number":14,"text":"I pošto je dostigao snagu svoju i dozrio, dadosmo mu sud i znanje; a tako plaćamo dobročinitelje"},{"number":15,"text":"I uđe u grad za vrijeme nehajnosti stanovnika njegovih, i nađe u njemu dva čovjeka (kako) se biju, ovaj iz sekte njegove, a ovaj od neprijatelja njegovog. Tad od njega zatraži pomoć onaj iz sekte njegove, protiv onog od neprijatelja njegovog. Tad ga udari Musa šakom, te ga dokrajči. Reče: \"Ovo je od posla šejtanovog.\" Uistinu, on je neprijatelj, zavodnik očiti"},{"number":16,"text":"Reče: \"Gospodaru moj! Uistinu, ja sam učinio zulm duši svojoj, pa oprosti mi!\" Pa mu je oprostio. Uistinu! On, On je Oprosnik, Milosrdni"},{"number":17,"text":"Reče: \"Gospodaru moj! Zato što si me obdario, zato neću biti pomagač prestupnika"},{"number":18,"text":"Pa osvanu u gradu prestrašen, iščekujući, tad gle! onaj koji ga je zvao u pomoć jučer, zove ga. Musa mu reče: \"Uistinu, ti si očito onaj koji je zabludio"},{"number":19,"text":"Pa pošto je želio da dograbi onog koji je neprijatelj njima dvojici, (taj) reče: \"O Musa! Zar želiš da me ubiješ, kao što si ubio dušu jučer? Samo želiš da budeš tiranin na Zemlji, a ne želiš da budeš od onih koji popravljaju"},{"number":20,"text":"I dođe čovjek s najdaljeg kraja grada trčeći. Reče: \"O Musa! Uistinu, velikani o tebi odlučuju da te ubiju, zato izlazi (iz grada). Uistinu, ja sam ti od savjetnika"},{"number":21,"text":"Tad izađe iz njega prestrašen, iščekujući. Reče: \"Gospodaru moj! Spasi me od naroda zalima"},{"number":22,"text":"Pa pošto se zaputio prema Medjenu, reče: \"Možda će Gospodar moj da me uputi pravom putu"},{"number":23,"text":"Pa pošto stiže vodi Medjena, nađe na njoj zajednicu ljudi napajaju (stoku); i nađe pored njih dvije žene - odbijaju. Reče: \"Šta je s vama dvjema?\" Rekoše: \"Ne napajamo dok ne odu čobani, a naš otac je starac uveliko"},{"number":24,"text":"Tad napoji njima dvjema, zatim se okrenu sjenci, pa reče: \"Gospodaru moj! Uistinu, ja sam - šta god mi spustiš od dobra - onaj kojem treba"},{"number":25,"text":"Tad mu dođe jedna od njih dvije, idući stidljivo. Reče: \"Uistinu, moj otac te poziva da ti isplati nagradu što si napojio za nas.\" Pa pošto mu je došao i ispričao priču, reče: \"Ne boj se! Spasio si se od naroda zalima"},{"number":26,"text":"Jedna od njih reče: \"O oče moj! Unajmi ga! Uistinu je najbolji taj kojeg bi unajmio, snažan, pouzdan"},{"number":27,"text":"Reče: \"Uistinu, ja želim da te oženim jednom od mojih kćeri, ovih dviju, da se unajmiš meni osam godina. Pa ako ispuniš deset, pa od tebe je; i ne želim da ti otežam. Naći ćeš - inšaAllah - da sam od pravednih"},{"number":28,"text":"(Musa) reče: \"To je između mene i između tebe. Koji god od dva roka ispunim, pa neće biti neprijateljstva protiv mene; a Allah je nad onim šta govorimo Jamac"},{"number":29,"text":"Pa pošto Musa ispuni rok i pođe s porodicom svojom, opazi na obronku brda vatru. Reče porodici svojoj: \"Sačekajte! Uistinu ja sam spazio vatru; možda ću vam ja od nje donijeti vijest, ili glavnju vatre, da biste se vi ogrijali"},{"number":30,"text":"Pa pošto joj priđe, bi pozvan s desne strane doline, u kraju blagoslovljenom, iz drveta: \"O Musa! Uistinu! Ja, Ja sam Allah, Gospodar svjetova"},{"number":31,"text":"I baci štap svoj!\" Pa pošto ga vidje da se brzo kreće kao da je on džinn, okrenu se bježeći i ne vraćajući se. \"O Musa! Priđi i ne plaši se. Uistinu, ti si od sigurnih"},{"number":32,"text":"Zavuci ruku svoju u njedra svoja, izaći će bijela, bez ozljede. I saberi si krilo svoje od straha. Pa to će biti dva dokaza od Gospodara tvog faraonu i uglednicima njegovim: uistinu, oni su narod grješnika"},{"number":33,"text":"Reče: \"Gospodaru moj! Uistinu, ja sam ubio od njih dušu, zato se bojim da će me ubiti"},{"number":34,"text":"A brat moj Harun, on je rječitiji od mene jezikom, pa pošalji ga sa mnom (kao) potporu, potvrđujući mene. Uistinu, ja se plašim da će me poreći"},{"number":35,"text":"Reče: \"Ojačat ćemo ruku tvoju bratom tvojim i dati vama dvojici moć, pa vam neće doseći. Sa znacima Našim, vas dvojica i ko vas bude slijedio, bićete pobjednici"},{"number":36,"text":"Pa pošto im dođe Musa sa znakovima Našim jasnim, rekoše: \"Ovo je samo sihr izmišljeni, i nismo mi ovo čuli u očeva naših ranijih"},{"number":37,"text":"I reče Musa: \"Gospodar moj je Najbolji znalac onog ko je došao s Uputom od Njega, i ko će za kraj imati dom. Uistinu, to neće uspjeti zalimi"},{"number":38,"text":"I reče faraon: \"O uglednici! Ne znam da vi imate drugog boga osim mene, zato mi zapali o Hamane, na ilovači, te mi načini toranj, da bih se ja uspeo bogu Musaovom; a uistinu, ja ga smatram (jednim) od lažova"},{"number":39,"text":"I uzoholi se on i vojske njegove na zemlji bez prava, i misliše da se oni Nama neće vratiti"},{"number":40,"text":"Pa smo dograbili njega i vojske njegove, te ih bacili u more. Zato pogledaj kakav je bio kraj zalima"},{"number":41,"text":"I učinili smo ih imamima (koji) pozivaju vatri, a na Dan kijameta neće biti pomognuti"},{"number":42,"text":"I pratili smo ih na ovom Dunjau prokletstvom, a na Dan kijameta oni će biti od odvratnih"},{"number":43,"text":"I doista smo dali Musau Knjigu - nakon što smo uništili pokoljenja ranija - jasne uvide ljudima, i uputu i milost, da bi se oni poučili"},{"number":44,"text":"I nisi bio na strani zapadnoj kad smo Musau izdali naredbu, i nisi bio od svjedoka"},{"number":45,"text":"Ali, Mi smo stvorili pokoljenja, pa im se život odužio. I nisi bio stanovnik među stanovnicima Medjena, da im učiš ajete Naše. Međutim, Mi smo bili ti koji su slali (poslanike)"},{"number":46,"text":"I nisi bio na obronku planine kad smo pozvali. Ali (poslat si) kao milost Gospodara svog da opominješ narod kojem nije došao nijedan opominjač prije tebe - da bi se oni poučili"},{"number":47,"text":"I da ih ne snađe nesreća zbog onog šta su unaprijed poslale ruke njihove, pa reknu: \"Gospodaru naš! Zašto nam nisi poslao poslanika, pa da slijedimo ajete Tvoje i budemo od vjernika"},{"number":48,"text":"Pa pošto im je došla Istina od Nas, rekoše: \"Zašto (mu) nije dato slično šta je dato Musau?\" Zar nisu nevjerovali u ono šta je dato Musau od ranije? Rekoše: \"Sihra dva, međusobno pomažuća\", i rekoše: \"Uistinu, mi smo u svako nevjernici"},{"number":49,"text":"Reci: \"Pa donesite od Allaha Knjigu koja je bolja uputa od ove dvije, da bih je slijedio, ako istinu govorite"},{"number":50,"text":"Pa ako ti se ne odazovu, tad znaj da slijede strasti svoje. A ko je zabludjeliji od onog ko slijedi strast svoju bez ikakve upute od Allaha? Uistinu! Allah ne upućuje narod zalima"},{"number":51,"text":"I doista smo im dopremili Riječ, da bi se oni poučili"},{"number":52,"text":"Oni kojima smo dali Knjigu prije njega, oni u njega vjeruju"},{"number":53,"text":"I kad im se uči, govore: \"Vjerujemo u njega. Uistinu, on je Istina od Gospodara našeg, uistinu, mi smo prije njega bili muslimani"},{"number":54,"text":"Takvima će se dati nagrada njihova dva puta, što su se strpili i dobrim djelom odbijali zlo, i iz onog čim smo ih opskrbili, udjeljivali"},{"number":55,"text":"I kad čuju besmislicu, okrenu se od nje i reknu: \"Nama djela naša, a vama djela vaša. Selamun alejkum! Ne tražimo neznalice"},{"number":56,"text":"Uistinu, ti ne upućuješ koga voliš, nego Allah upućuje koga hoće, a On je Najbolji znalac upućenih"},{"number":57,"text":"I rekoše: \"Ako s tobom budemo slijedili Uputu, bićemo izbačeni iz naše zemlje.\" A zar nismo za njih Harem učinili sigurnim?, skupljaju se njemu plodovi svake vrste - opskrba od Nas. Međutim, većina njih ne zna"},{"number":58,"text":"A koliko smo uništili naselja nezadovoljnih svojim sredstvima za život! Pa to su nastambe njihove, nisu nastanjivane poslije njih, izuzev malo, i bili smo Mi nasljednici"},{"number":59,"text":"I nije bio Gospodar tvoj uništilac gradova, dok ne bi podigao u prijestonici njihovoj poslanika, da im uči ajete Naše. I nismo bili Uništioci gradova, izuzev kad bi stanovnici njihovi bili zalimi"},{"number":60,"text":"A šta vam je dato od stvari, pa uživanje je života Dunjaa i ukras njegov; a što je kod Allaha, bolje je i trajnije. Pa zar ne razumijete"},{"number":61,"text":"Pa da li je onaj kome smo dali obećanje lijepo - ta on će ga susresti - kao onaj koga naslađujemo užitkom života Dunjaa, zatim će on na Dan kijameta biti od privedenih"},{"number":62,"text":"A na Dan kad ih pozove, pa rekne: \"Gdje su ortaci Moji, oni za koje ste tvrdili"},{"number":63,"text":"Reći će oni na kojima se obistinila Riječ: \"Gospodaru naš! Ovo su ti koje smo zaveli. Zaveli smo njih, kao što smo sebe zaveli. Opravdavamo se Tebi: nisu nas obožavali"},{"number":64,"text":"I biće rečeno: \"Pozovite ortake svoje!\" Tad će ih pozvati, pa im neće odgovoriti, a vidjeće kaznu. Ah, da su se oni upućivali"},{"number":65,"text":"A na Dan kad ih pozove pa rekne: \"Šta ste odgovorili poslanicima"},{"number":66,"text":"Pa nejasne će im biti vijesti Toga dana, te se oni neće raspitivati"},{"number":67,"text":"Pa što se tiče onog ko se pokaje i bude vjerovao i radio dobro, pa možda da bude od uspjelih"},{"number":68,"text":"A Gospodar tvoj stvara šta hoće i odabire! Nema za njih izbora! Slava Allahu, i Uzvišen neka je od onog šta pridružuju"},{"number":69,"text":"A Gospodar tvoj zna šta kriju grudi njihove, i šta (oni) objelodanjuju"},{"number":70,"text":"I On je Allah - nema boga osim Njega! Njemu hvala u prvom i drugom, a Njegova je presuda, i Njemu se vraćate"},{"number":71,"text":"Reci: \"Vidite li, ako vam Allah učini noć trajnom do Dana kijameta - koji će vam bog pored Allaha donijeti svjetlost? Pa zar ne čujete"},{"number":72,"text":"Reci: \"Vidite li, ako vam Allah učini dan trajnim do Dana kijameta - koji će vam bog pored Allaha donijeti noć, da se smirite u njoj? Pa zar ne vidite"},{"number":73,"text":"I iz milosti Svoje, načinio je za vas noć i dan, da se odmarate u njoj, i da tražite od blagodati Njegove, i da biste vi zahvaljivali"},{"number":74,"text":"A na Dan kad ih pozove, pa rekne: \"Gdje su ortaci Moji, za koje ste tvrdili"},{"number":75,"text":"I iz svake zajednice ćemo istrgnuti svjedoka, pa ćemo reći: \"Donesite dokaz vaš!\" Tad će znati da je Istina Allahova, a nestaće od njih šta su izmišljali"},{"number":76,"text":"Uistinu, Karun je bio iz naroda Musaovog, pa ih je tlačio. A dali smo mu od blaga toliko, da bi uistinu ključevi njegovi oborili skupinu snažnih. Kad mu reče narod njegov: \"Ne likuj! Uistinu, Allah ne voli one koji likuju"},{"number":77,"text":"I traži u onom šta ti je dao Allah kuću Ahireta, i ne zaboravi udio svoj od Dunjaa, i čini dobro kao što tebi Allah čini dobro, i ne traži fesad na Zemlji. Uistinu! Allah ne voli mufside"},{"number":78,"text":"Reče: \"To mi je dato samo zbog mog znanja.\" Zar nije znao da je Allah već uništio prije njega od pokoljenja (onog) ko je od njega bio moćniji silom i veći skupom? A prestupnici neće biti pitani za svoje grijehe"},{"number":79,"text":"Tad je izlazio narodu svom u sjaju svom. Oni koji žele život Dunjaa govorili su: \"O da nam je slično šta je dato Karunu! Uistinu, on je posjednik sreće goleme"},{"number":80,"text":"A oni kojima je dato znanje rekoše: \"Teško vama! Allahova nagrada je bolja za onog ko vjeruje i radi dobro, a ona neće biti data, izuzev strpljivima"},{"number":81,"text":"Pa smo dali da njega i kuću njegovu proguta zemlja. Tad on nije imao nikakvu skupinu (da) ga pomognu mimo Allaha, i nije bio od onih koji se mogu odbraniti"},{"number":82,"text":"I osvanuše oni koji su željeli njegovo mjesto jučer, govoreći: \"Ah, Allah pruža opskrbu kome hoće od robova Svojih i uskraćuje. Da nam nije Allah dobar bio, sigurno bi dao da nas proguta. Ah, ne uspijevaju nezahvalnici"},{"number":83,"text":"Ta kuća Ahireta - načinili smo je za one koji ne žele visinu na Zemlji, niti fesad. A ishod je za bogobojazne"},{"number":84,"text":"Ko dođe s dobrim djelom, pa imaće on bolje od njega; a ko dođe sa zlim djelom - pa oni koji su činili zlodjela biće plaćeni jedino (prema) onom šta su radili"},{"number":85,"text":"Uistinu! Onaj koji te je obavezao Kur'anom, sigurno će te vratiti povratištu. Reci: \"Gospodar moj je Najbolji znalac onog ko donosi Uputu i onog ko je u zabludi očitoj"},{"number":86,"text":"I nisi se nadao da će se tebi dati Knjiga, izuzev kao milost od Gospodara tvog. Zato nikako ne budi pomagač nevjernicima"},{"number":87,"text":"I neka te nikako ne odvrate od ajeta Allahovih, nakon što su ti objavljeni; i pozivaj Gospodaru svom, i ne budi nikako od mušrika"},{"number":88,"text":"I ne prizivaj uz Allaha boga drugog! Samo je On Bog! Svaka stvar je propadajuća, izuzev lica Njegovog! Njegov je sud i Njemu ćete biti vraćeni"}]}