{"number":38,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Sad. Tako mi Kur'ana, posjednika Opomene"},{"number":2,"text":"Naprotiv, oni koji ne vjeruju u oholosti su i razdoru"},{"number":3,"text":"Koliko smo prije njih uništili pokoljenja, pa su prizivali, a prošlo bi vrijeme za uzmicanje"},{"number":4,"text":"A čudili su se da im je došao opominjač između njih, i govorili nevjernici: \"Ovo je čarobnjak, lažac"},{"number":5,"text":"Je li učinio bogove Bogom Jedinim? Uistinu, ovo je stvar čudesna"},{"number":6,"text":"I krenuše velikani izmeđe njih: \"Idite i ustrajte uz bogove svoje! Uistinu, ovo je stvar koja se želi"},{"number":7,"text":"Nismo o ovome čuli u milletu zadnjem. Ovo je samo izmišljotina"},{"number":8,"text":"Zar je njemu objavljena Opomena između nas?\" Naprotiv! Oni su u sumnji o Opomeni Mojoj. Naprotiv, još nisu okusili kaznu Moju"},{"number":9,"text":"Zar su kod njih riznice milosti Gospodara tvog, Moćnog, Darivaoca"},{"number":10,"text":"Zar je njihova vlast nebesa i Zemlje i onog šta je između njih? Pa neka se uspnu (kakvim) sredstvima"},{"number":11,"text":"Vojska su što je ondje poražena od saveznika"},{"number":12,"text":"Poricali su prije njih narod Nuhov i Ad i faraon, posjednik stubova"},{"number":13,"text":"I Semud i narod Lutov i stanovnici Ejke - takve su partije"},{"number":14,"text":"Svaki je samo poricao poslanike, pa se obistinila kazna Moja"},{"number":15,"text":"A takvi čekaju samo krik jedan, za kojeg nema odlaganja"},{"number":16,"text":"I govore: \"Gospodaru naš! Ubrzaj nam dio naš prije Dana obračuna"},{"number":17,"text":"Strpi se nad onim šta govore, i sjeti se roba Našeg Dawuda, posjednika moći. Uistinu, on je bio taj koji se obraćao (Allahu)"},{"number":18,"text":"Uistinu! Mi smo potčinili brda (da) s njim slave u sutonu i obasjavanju"},{"number":19,"text":"I ptice okupljene; svako je Njemu obraćenik"},{"number":20,"text":"I ojačali smo carstvo njegovo, i dali mu mudrost i odlučan govor"},{"number":21,"text":"A da li je tebi stigla vijest o parničarima? - kad se ispeše na mihrab"},{"number":22,"text":"Kad uđoše Dawudu, pa se prestraši od njih, rekoše: \"Ne boj se! Dva smo parničara, učinili smo nepravdu jedan drugom, zato među nama presudi s Istinom; i ne budi nepravedan; i uputi nas putu ravnom"},{"number":23,"text":"Uistinu, ovo je brat moj. On ima devedeset devet ovaca, a ja imam jednu ovcu, pa je rekao: 'Povjeri je meni!' - i nadmaši me u govoru"},{"number":24,"text":"(Dawud) reče: \"Zaista ti je učinio zulm traženjem ovce tvoje ovcama svojim. A uistinu, mnogi od ortaka čine nasilje jedni drugima, izuzev koji vjeruju i čine dobra djela - a njih je malo.\" I Dawud pomisli da ga iskušavamo, pa zamoli oprost Gospodara svog i pade na ruku' i pokaja se"},{"number":25,"text":"Tad smo mu to oprostili, a uistinu, on ima kod Nas bliskost i lijepo povratište"},{"number":26,"text":"O Dawude! Uistinu! Mi smo te učinili halifom na Zemlji, zato sudi među ljudima s Istinom, i ne slijedi strast, pa da te zavede s puta Allahovog. Uistinu, koji zavode s puta Allahovog, imaće oni kaznu žestoku što su zaboravili Dan obračuna"},{"number":27,"text":"I nismo stvorili nebo i Zemlju i šta je između njih, uzaludno. To je mišljenje onih koji ne vjeruju. Pa teško onima koji ne vjeruju - od vatre"},{"number":28,"text":"Zar tretiramo one koji vjeruju i rade dobra djela, kao mufside na Zemlji? Ili tretiramo bogobojazne kao razvratnike"},{"number":29,"text":"Knjiga koju smo ti objavili je blagoslovljena; da razmatraju ajete njene i da se pouče posjednici razuma"},{"number":30,"text":"I podarili smo Dawudu Sulejmana. Divan rob! Uistinu, on je bio onaj koji se obraćao"},{"number":31,"text":"Kad mu se izvedoše u sumrak safinati brzi"},{"number":32,"text":"Tad reče: \"Uistinu! Ja sam iskazao ljubav prema dobru (više) no zikru Gospodara svog\" - dok ne bi skriveno u velu (noći)"},{"number":33,"text":"Vratite mi ih\", pa je počeo glađenjem nogu i vratova"},{"number":34,"text":"I doista smo iskušavali Sulejmana, i bacili na prijesto njegov tijelo - zatim se obratio"},{"number":35,"text":"Reče: \"Gospodaru moj! Oprosti mi, daruj mi vlast kakvu niko neće imati poslije mene! Uistinu, Ti, Ti si Darivalac"},{"number":36,"text":"Pa smo potčinili njemu vjetar - puhao je povjetarac po naredbi njegovoj blago kud je htio"},{"number":37,"text":"I šejtane, svakog graditelja i ronioca"},{"number":38,"text":"I druge povezane u okove"},{"number":39,"text":"Ovo je poklon Naš, pa daruj ili zadrži, bez računa"},{"number":40,"text":"A uistinu, on kod Nas ima bliskost i lijepo povratište"},{"number":41,"text":"I spomeni roba Našeg Ejjuba, kad pozva Gospodara svog: \"Uistinu me šejtan dotiče jadom i patnjom"},{"number":42,"text":"Udri nogom svojom!\" Ovo je mjesto pranja - hladno, i (voda za) piće"},{"number":43,"text":"I podarili smo mu porodicu njegovu, i slično njima uz njih - milost od Nas - i Opomenu za imaoce razuma"},{"number":44,"text":"I uzmi rukom svojom snop, pa udri njime i ne prekrši zakletvu!\" Uistinu, Mi smo ga našli strpljivim. Divan rob! Uistinu, on je bio pokajanik"},{"number":45,"text":"I spomeni robove Naše, Ibrahima i Ishaka i Jakuba - posjednike čvrstine i zapažanja"},{"number":46,"text":"Uistinu! Mi smo ih pročistili čistom (osobinom), sjećanjem Kuće"},{"number":47,"text":"I uistinu, oni su kod Nas od odabranih, najbolji"},{"number":48,"text":"I spomeni Isma'ila i Eljese'a i Zul'kifla; a svaki je bio od najboljih"},{"number":49,"text":"Ovo je podsjećanje; a uistinu, bogobojazni će imati divno povratište"},{"number":50,"text":"Bašče Adna, za njih otvorenih kapija"},{"number":51,"text":"Naslonjeni u njima, tražiće u njima mnogo voća, i piće"},{"number":52,"text":"A kod njih će biti (hurije) kratkih pogleda, vršnjakinje"},{"number":53,"text":"Ovo je ono šta vam se obećava za Dan obračuna"},{"number":54,"text":"Uistinu, ovo je opskrba Naša, nema za nju nikakva iscrpljenja"},{"number":55,"text":"Ovo! A uistinu, prevršitelji će imati zlo povratište"},{"number":56,"text":"Džehennem - pržiće se njime, ta loše je odmorište"},{"number":57,"text":"Ovo! Zato neka ga kušaju - ključalu tekućinu i ledenu"},{"number":58,"text":"I druge, od sličnih tome, u parovima"},{"number":59,"text":"Ovo je skupina koja se s vama gura; neće za njih biti dobrodošlice! Uistinu, oni će biti prženi vatrom"},{"number":60,"text":"Reći će: \"Naprotiv, vi - vama nema merhaba: vi ste ga pripremili za nas, pa loše je stanište"},{"number":61,"text":"Reći će: \"Gospodaru naš! Ko je ovo pripremio za nas, pa dodaj mu dvostruku kaznu u vatri"},{"number":62,"text":"I govoriće: \"Šta nam je, ne vidimo ljude koje smo brojali ozloglašenima"},{"number":63,"text":"Jesmo li ih uzeli ruglom ili su skrenuli s njih pogledi (naši)"},{"number":64,"text":"Doista, to će biti istina: svađa stanovnika vatre"},{"number":65,"text":"Reci: \"Ja sam samo opominjač, i nema nikakva boga, izuzev Allaha Jedinog, Onog koji pokorava"},{"number":66,"text":"Gospodara nebesa i Zemlje i šta je između njih, Moćnog, Oprosnika"},{"number":67,"text":"Reci: \"To je vijest veličanstvena"},{"number":68,"text":"Vi ste od nje odvraćeni"},{"number":69,"text":"Nisam imao nikakvog znanja o Skupu najvišem, kad su raspravljali"},{"number":70,"text":"Meni se objavljuje da sam ja samo opominjač jasni"},{"number":71,"text":"Kad reče Gospodar tvoj melecima: \"Uistinu, Ja sam Tvorac smrtnika od ilovače"},{"number":72,"text":"Zato kad ga sredim i udahnem u njega od Duha Svog, tad padnite njemu ničice"},{"number":73,"text":"Pa su učinili sedždu meleci, svi oni zajedno"},{"number":74,"text":"Osim Iblisa; uzoholio se i bio od nevjernika"},{"number":75,"text":"(Allah) reče: \"O Iblisu! Šta te je spriječilo da padneš na sedždu onom šta sam stvorio rukama Svojim? Jesi li se uzoholio ili si od uzvišenih"},{"number":76,"text":"Reče: \"Ja sam bolji od njega, mene si stvorio od vatre, a njega si stvorio od ilovače"},{"number":77,"text":"(Allah) reče: \"Pa izlazi iz njega, pa uistinu si ti protjeran"},{"number":78,"text":"I uistinu! Na tebi je prokletstvo Moje do Dana sudnjeg"},{"number":79,"text":"Reče: \"Gospodaru moj! Pa odgodi mi do Dana kad će biti podignuti"},{"number":80,"text":"(Allah) reče: \"Pa uistinu si ti od onih kojima se odgađa"},{"number":81,"text":"Do Dana - wakta poznatog"},{"number":82,"text":"Reče: \"Pa tako mi moći Tvoje, sigurno ću ih sve zavesti"},{"number":83,"text":"Izuzev robova Tvojih - od njih čistih"},{"number":84,"text":"(Allah) reče: \"Pa Istina je, a Istinu govorim"},{"number":85,"text":"Sigurno je da ću napuniti Džehennem tobom i onim ko te između njih bude slijedio - svima"},{"number":86,"text":"Reci (Muhammede): \"Ne tražim od vas za njega nikakvu nagradu, i nisam ja od izvještačenih"},{"number":87,"text":"On je samo Opomena svjetovima"},{"number":88,"text":"A sigurno ćete saznati vijest njegovu nakon (izvjesnog) vremena"}]}