{"number":54,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Približio se čas i razdvojio Mjesec"},{"number":2,"text":"A ako vide znak, okreću se i govore: \"Sihr neprestani"},{"number":3,"text":"I porekli su i slijedili strasti svoje; a svaka stvar (ima) rok"},{"number":4,"text":"I već im je od vijesti došlo ono u čemu je preventiva"},{"number":5,"text":"Mudrost savršena - pa ne koriste opomene"},{"number":6,"text":"Zato se okreni od njih! Na dan kad pozove pozivač stvari ružnoj"},{"number":7,"text":"Oborenih pogleda svojih izaći će iz kabura, kao da su oni skakavci raštrkani"},{"number":8,"text":"Žureći k pozivaču. Govoriće nevjernici: \"Ovo je dan težak"},{"number":9,"text":"Porekao je prije njih narod Nuhov: tad su porekli roba Našeg i rekli: \"Luđak\", i onemogućen je bio"},{"number":10,"text":"Tad je pozvao Gospodara svog: \"Ja sam poražen, zato pomozi"},{"number":11,"text":"Pa smo otvorili kapije neba sa vodom lijućom"},{"number":12,"text":"I dali da provrije zemlja izvorima, pa se susrela voda na stvari već predodređenoj"},{"number":13,"text":"I nosili smo njega na (lađi) od samih dasaka i klinaca"},{"number":14,"text":"Plovila je pod očima Našim; plaća za onog ko je bio zanijekan"},{"number":15,"text":"I zaista smo to ostavili znakom; pa ima li iko poučen"},{"number":16,"text":"Pa kakva je bila kazna Moja i opomene Moje"},{"number":17,"text":"I zaista smo olakšali Kur'an za pouku, pa ima li iko da se pouči"},{"number":18,"text":"Porekao je Ad, pa kakva je bila kazna Moja i opomene Moje"},{"number":19,"text":"Uistinu! Mi smo poslali na njih vjetar ledeni u danu nesreće neprestajuće"},{"number":20,"text":"Čupao je ljude kao da su oni debla palmi izvaljena"},{"number":21,"text":"Pa kakva je bila kazna Moja i opomene Moje"},{"number":22,"text":"I zaista smo olakšali Kur'an za zikr, pa ima li iko ko zikri"},{"number":23,"text":"Poricao je Semud opomene"},{"number":24,"text":"Pa su rekli: \"Zar smrtnika - od nas jednoga - njega (da) slijedimo? Uistinu, mi bismo tad bili u zabludi i bezumlju"},{"number":25,"text":"Zar da njemu bude spuštena Opomena između nas? Naprotiv, on je lažov drski"},{"number":26,"text":"Saznat će sutra ko je lažov drski"},{"number":27,"text":"Uistinu! Mi im šaljemo devu iskušenjem, zato ih promatraj i strpi se"},{"number":28,"text":"I obavijesti ih da će biti dioba vode među njima. Svakom pojenju biće se prisutno"},{"number":29,"text":"Tad pozvaše druga svog, pa uze (mač), te (je) rani"},{"number":30,"text":"Pa kakva je bila kazna Moja i opomene Moje"},{"number":31,"text":"Uistinu! Mi smo poslali na njih krik jedan, pa bijahu kao suharci graditelja tora"},{"number":32,"text":"A zaista smo olakšali Kur'an za podsjećanje, pa ima li iko ko se podsjeća"},{"number":33,"text":"Poricao je narod Lutov opomene"},{"number":34,"text":"Uistinu! Mi smo poslali na njih kišu kamenu, izuzev porodice Lutove; spasli smo ih u ranu zoru"},{"number":35,"text":"Blagodat od Nas; tako nagrađujemo onog ko zahvaljuje"},{"number":36,"text":"I doista ih je upozorio na udar Naš, pa su sumnjali u opomene"},{"number":37,"text":"I doista su od njega htjeli goste njegove, pa smo oslijepili oči njihove: \"Ta iskusite kaznu Moju i opomene Moje"},{"number":38,"text":"I doista, pogodila ih je jutrom kazna trajna"},{"number":39,"text":"Pa iskusite kaznu Moju i opomene Moje"},{"number":40,"text":"I doista smo olakšali Kur'an za pouku, pa ima li iko ko se poučava"},{"number":41,"text":"A doista su ljudstvu faraonovu došle opomene"},{"number":42,"text":"Porekli su znakove Naše, sve njih, pa smo ih dograbili grabljenjem Svemoćnog, Snažnog"},{"number":43,"text":"Jesu li nevjernici vaši bolji od takvih, ili imate imunitet u zeburima"},{"number":44,"text":"Zar kažu: \"Mi smo skup pobjednički"},{"number":45,"text":"Biće poražen skup, i okrenut će leđa"},{"number":46,"text":"Naprotiv! Čas je obećano vrijeme njihovo, a Čas će biti teži i gorči"},{"number":47,"text":"Uistinu! Biće prestupnici u zabludi i bezumlju"},{"number":48,"text":"Na Dan kad budu dovučeni u vatru na licima svojim: \"Iskusite dodir sekara"},{"number":49,"text":"Uistinu! Mi smo svaku stvar stvorili po mjeri"},{"number":50,"text":"A komanda Naša je samo jedna, kao sijev oka"},{"number":51,"text":"I doista smo uništili pobornike vaše; pa ima li iko ko se poučava"},{"number":52,"text":"A svaku stvar koju su učinili, u zeburima je"},{"number":53,"text":"I sve malo i veliko, zapisano je"},{"number":54,"text":"Uistinu, bogobojazni će u baščama i rijekama biti"},{"number":55,"text":"U sjedištu Istine, kod Vladara Svemoćnog"}]}