{"number":71,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Uistinu, Mi smo poslali Nuha narodu njegovom: \"Upozori narod svoj, prije nego im dođe kazna bolna"},{"number":2,"text":"Reče: \"O narode moj! Uistinu! Ja sam vam opominjač jasni"},{"number":3,"text":"Obožavajte Allaha i bojte Ga se i poslušajte mene"},{"number":4,"text":"Oprostiće vam neke grijehe vaše i odložiće vam do roka utvrđenog. Uistinu, rok Allahov kad dođe, ne odlaže se, kad biste znali"},{"number":5,"text":"Reče: \"Gospodaru moj! Doista sam ja pozivao narod svoj noću i danju"},{"number":6,"text":"Pa im je moje pozivanje samo povećalo izbjegavanje"},{"number":7,"text":"I uistinu, kad god sam ih ja pozivao da im oprostiš, stavljali su prste svoje u uši svoje i pokrivali se odjećom svojom, i ustrajali i uznosili se ohološću"},{"number":8,"text":"Zatim sam ih ja uistinu pozivao glasno"},{"number":9,"text":"Potom sam im ja doista razglašavao i povjeravao im tajno"},{"number":10,"text":"Pa govorio: 'Tražite oprost Gospodara svog! Uistinu, On je Oprosnik"},{"number":11,"text":"Poslaće na vas nebo lijuće"},{"number":12,"text":"I pomoći vas imecima i sinovima, i načiniće vam bašče i načiniće vam rijeke"},{"number":13,"text":"Šta vam je? Ne nadate se od Allaha dostojanstvenosti"},{"number":14,"text":"A uistinu, stvorio vas je u fazama"},{"number":15,"text":"Zar ne vidite kako je Allah stvorio sedam nebesa slojevito"},{"number":16,"text":"I učinio Mjesec u njima svjetlom, a učinio Sunce svjetiljkom"},{"number":17,"text":"A Allah vas razvija od zemlje izrastanjem"},{"number":18,"text":"Zatim vas vraća u nju i izvešće vas (novim) izvođenjem"},{"number":19,"text":"I učinio vam je Allah zemlju sagom"},{"number":20,"text":"Da vi stupate po njoj putevima širokim"},{"number":21,"text":"Nuh reče: \"Gospodaru moj! Doista me oni nisu poslušali i slijedili su onog čiji mu imetak i njegovo dijete ne povećava - izuzev gubitak"},{"number":22,"text":"I spleli su spletku veliku"},{"number":23,"text":"Pa rekli: \"Ne napuštajte nipošto bogove svoje, i ne napuštajte nipošto Wedda, niti Suwaa, niti Jegusa i Jeuka i Nesra"},{"number":24,"text":"I zaista su zaveli mnoge, a povećaj zalimima jedino zabludu"},{"number":25,"text":"Zbog grešaka njihovih su potopljeni, pa će biti u vatru uvedeni. Pa nisu našli sebi mimo Allaha pomagače"},{"number":26,"text":"I reče Nuh: \"Gospodaru moj! Ne ostavljaj na Zemlji (nijednog) ukućanina od nevjernika"},{"number":27,"text":"Uistinu, Ti ako ih ostaviš, zavešće robove Tvoje i rađati samo razvratnika, nevjernika"},{"number":28,"text":"Gospodaru moj! Oprosti meni i roditeljima mojim, i ko uđe u kuću moju vjernikom, i vjernicima i vjernicama, a povećaj zalimima samo propast"}]}