{"number":44,"edition":"tr.ates","ayahs":[{"number":1,"text":"Ha mim"},{"number":2,"text":"Apaçık Kitaba andolsun ki"},{"number":3,"text":"Biz onu mübarek bir gecede indirdik. Çünkü biz, uyarıcıyız"},{"number":4,"text":"Her hikmetli emir, o gecede ayırdedilir"},{"number":5,"text":"Katımızdan (verilen her) emir. Çünkü biz elçi göndericiyiz"},{"number":6,"text":"Senin Rabbinin acıması gereği olarak (gönderdiğimiz elçilere o gece emirlerimizi açıklar, vahiylerimizi bildiririz). Doğrusu O, işitendir, bilendir"},{"number":7,"text":"Eğer kesin olarak inanıyorsanız (bilin ki Allah), göklerin, yerin ve ikisi arasında bulunanların Rabbidir"},{"number":8,"text":"O'ndan başka tanrı yoktur, yaşatır, öldürür. Sizin de Rabbiniz, önceki atalarınızın da Rabbidir"},{"number":9,"text":"Ama onlar, şüphe içinde oynuyorlar"},{"number":10,"text":"Göğün, açık bir duman getireceği günü gözetle"},{"number":11,"text":"(Duman) İnsanları sarar. Bu, acı bir azabdır"},{"number":12,"text":"Rabbimiz, bizden azabı kaldır, çünkü biz artık inanıyoruz derler"},{"number":13,"text":"Artık onlar nasıl düşünüp öğüt alacaklar (öğüt alma zamanı geçti)? Oysa kendilerine apaçık bir elçi gelmişti"},{"number":14,"text":"Ondan yüz çevirdiler: \"Bu, öğretilmiştir, cinlenmiştir\" dediler"},{"number":15,"text":"Biz sizden azabı birazcık kaldırırız ama siz yine (inkarınıza) dönersiniz"},{"number":16,"text":"O gün büyük vuruşla vururuz; zira biz öc alıcıyız"},{"number":17,"text":"Andolsun, onlardan önce Fir'avn toplumunu da (imkanlar vererek) sınadık. Onlara değerli bir elçi geldi, (şöyle diyerek)"},{"number":18,"text":"Allah'ın kullarını bana teslim edin; çünkü ben sizin için güvenilir bir elçiyim"},{"number":19,"text":"Allah'a karşı ululanmayın. Ben size apaçık bir delil getiriyorum"},{"number":20,"text":"Ben, beni taşla(yıp öldür)menizden, benim de Rabbim, sizin de Rabbiniz olan(Allah)a sığındım"},{"number":21,"text":"Eğer bana inanmadınızsa bari ben(im yolum)dan çekilin"},{"number":22,"text":"Sonra (Musa): \"Bunlar, suç işleyen bir toplumdur!\" diye Rabbine du'a etti"},{"number":23,"text":"(Allah): \"O halde kullarımı geceleyin yürüt. Çünkü takibedileceksiniz\" (dedi)"},{"number":24,"text":"Denizi (yarıp toplumunu geçirdikten sonra olduğu gibi) açık bırak. Çünkü onlar boğulacak bir ordudur"},{"number":25,"text":"Onlar geride nice şeyler bıraktılar: Bahçeler, çeşmeler"},{"number":26,"text":"Ekinler, güzel makamlar"},{"number":27,"text":"Ve zevkü sefa sürdükleri nice ni'metler"},{"number":28,"text":"İşte böyle oldu ve biz onları başka bir topluma miras verdik"},{"number":29,"text":"Onlara gök ve yer ağlamadı. Ve kendilerine fırsat da verilmedi"},{"number":30,"text":"Andolsun biz, İsrail oğullarını o küçültücü azabdan kurtardık"},{"number":31,"text":"Fir'avn'dan. Çünkü o, (insanları ezip) ululanan, sınırı aşanlardan biri idi"},{"number":32,"text":"Andolsun biz, onları bir bilgiye göre alemlere üstün kıldık"},{"number":33,"text":"Onlara, içinde açık bir sınav bulunan ayetler verdik"},{"number":34,"text":"Şunlar (Kureyş kafirleri) de diyorlar ki"},{"number":35,"text":"İlk ölümümüzden sonra bir şey yoktur. Biz diriltilecek değiliz"},{"number":36,"text":"Doğru söylüyorsanız, babalarımızı getirin"},{"number":37,"text":"Onlar mı hayırlı, yoksa Tubba' kavmi ve onlardan önce gelen(kavim)ler mi? Suç işledikleri için biz onların hepsini helak ettik"},{"number":38,"text":"Biz gökleri, yeri ve bunlar arasında bulunanları eğlenmek için yaratmadık"},{"number":39,"text":"Onları sadece gerçek bir sebeple, (hikmetli bir gaye ile) yarattık. Fakat onların çoğu bilmiyorlar"},{"number":40,"text":"(Hakkın batıldan ayrılacağı) Hüküm günü, hepsinin varacağı gündür"},{"number":41,"text":"O gün dost, dostundan bir şey savamaz. Ve onlara yardım da edilmez"},{"number":42,"text":"Ancak Allah'ın acıdığı kimseler (kurtulur). Şüphesiz O, üstündür esirgeyendir"},{"number":43,"text":"Zakkum ağacı"},{"number":44,"text":"Günahkarların yemeğidir"},{"number":45,"text":"Pota gibi karınlarda kaynar"},{"number":46,"text":"Sıcak suyun kaynaması gibi"},{"number":47,"text":"(Allah, zebanilere emreder): \"Tutun onu, cehennemin ortasına sürükleyin"},{"number":48,"text":"Sonra başının üstüne kaynar su azabından dökün"},{"number":49,"text":"Tad, zira sen kendince üstündün, şerefliydin"},{"number":50,"text":"İşte o kuşkulanıp durduğunuz şey budur"},{"number":51,"text":"Korunanlar ise güvenli bir makamdadır"},{"number":52,"text":"Bahçelerde ve çeşme başlarında"},{"number":53,"text":"İnce ipekten ve parlak atlastan giysiler giyerek karşılıklı otururlar"},{"number":54,"text":"Ayrıca onları, iri gözlü hurilerle de evlendirmişizdir"},{"number":55,"text":"Orada, güven içinde, her meyveyi isterler"},{"number":56,"text":"Orada ilk ölümden başka ölüm tadmazlar (sürekli yaşarlar). Ve (Allah) onları cehennem azabından korumuştur"},{"number":57,"text":"Rabbinden bir lutuf olarak (bu ni'metler kendilerine verilmiştir). İşte, o büyük başarı budur"},{"number":58,"text":"Biz o(Kur'a)nı senin diline kolaylaştırdık ki, düşünüp öğüt alsınlar"},{"number":59,"text":"Biraz bekle, onlar da beklemektedirler (yakında başlarına neler geleceğini göreceklerdir)"}]}