{"number":68,"edition":"tr.ates","ayahs":[{"number":1,"text":"Nun. Kaleme ve (kalemle) yazdıklarına andolsun"},{"number":2,"text":"Sen, Rabbinin ni'metiyle cinlenmiş (deli) değilsin"},{"number":3,"text":"Senin için kesintisiz bir mükafat vardır"},{"number":4,"text":"Ve sen, büyük bir ahlak üzerindesin"},{"number":5,"text":"(Sen de) Göreceksin, onlar da görecekler"},{"number":6,"text":"Hanginizin fitnelenmiş (cin çarpmış delirmiş) olduğunu"},{"number":7,"text":"Şüphesiz Rabbin, kim(ler)in kendi yolundan saptığını ve kimlerin yolda olduğunu en iyi bilen O'dur"},{"number":8,"text":"Öyleyse yalanlayanlara ita'at etme"},{"number":9,"text":"İstediler ki, sen yağcılık yapasın da onlar da yağcılık yapsınlar (sana yumuşak davransınlar)"},{"number":10,"text":"Şunların hiçbirine ita'at etme: Yemin edip duran aşağılık"},{"number":11,"text":"Kötüleyip duran, söz götürüp getiren"},{"number":12,"text":"Hayra engel olan, saldırgan, günahkar"},{"number":13,"text":"Kaba, sonra da kötülükle damgalı"},{"number":14,"text":"Mal ve oğullar sahibi olmuş diye (yolunu şaşırmış)"},{"number":15,"text":"Kendisine ayetlerimiz okunduğu zaman: \"Eskilerin masalları\" der"},{"number":16,"text":"Biz onu burnunun üzerine damga vurup işaretleyeceğiz"},{"number":17,"text":"Biz bunlara da bela verdik, şu bahçe sahiplerine bela verdiğimiz gibi: Hani onlar, sabah olunca bahçeyi mutlaka devşireceklerine yemin etmişlerdi"},{"number":18,"text":"İstisna da etmiyorlar(Allah dilerse biçeriz demiyorlar)dı"},{"number":19,"text":"Fakat onlar uyurlarken hemen (gönderilen) dolaşıcı bir bela, onu sardı da"},{"number":20,"text":"Bahçe simsiyah kesiliverdi"},{"number":21,"text":"Sabahleyin birbirlerine seslendiler"},{"number":22,"text":"Haydi devşirecekseniz erkenden ekininize gidin diye"},{"number":23,"text":"Derken yürüdüler; fısıldaşıyorlardı"},{"number":24,"text":"Sakın, bugün hiçbir yoksul bahçeye girip yanınıza sokulmasın diye"},{"number":25,"text":"Devşirebileceklerini umarak erkenden gittiler"},{"number":26,"text":"Fakat bahçeyi görünce: \"Herhalde biz yolu şaşırdık.\" dediler"},{"number":27,"text":"Hayır, doğrusu biz mahrum bırakıldık"},{"number":28,"text":"Orta(yolda giden iyi)leri: \"Ben size demedim mi? Rabbinizi tesbih etmeniz gerekmez miydi?\" dedi"},{"number":29,"text":"Rabbimizi tesbih ederiz, doğrusu biz zulmedenlermişiz! dediler"},{"number":30,"text":"Dönüp birbirlerini kınamağa başladılar"},{"number":31,"text":"Yazık bize, dediler, biz azgınlarmışız"},{"number":32,"text":"Belki Rabbimiz, bize onun yerine ondan daha iyisini verir. Biz Rabbimize yönelir, O'ndan umarız. It may be that our Lord will give us better than this in place thereof. Lo! we beseech our Lord"},{"number":33,"text":"İşte azab böyledir. Ahiret azabı ise daha büyüktür, keşke bilselerdi"},{"number":34,"text":"Korunanlar için de Rableri katında ni'met bahçeleri vardır"},{"number":35,"text":"Biz müslümanları suçlular gibi yapar mıyız hiç"},{"number":36,"text":"Neyiniz var, nasıl hüküm veriyorsunuz"},{"number":37,"text":"Yoksa sizin bir Kitabınız var da onda mı (bu hükümleri) okuyorsunuz"},{"number":38,"text":"Onda istediğiniz her şeyi buluyorsunuz"},{"number":39,"text":"Yoksa sizin istediğiniz hükmü verebileceğinize dair, kıyamete kadar sürecek andlarınız mı var üzerimizde"},{"number":40,"text":"Sor onlara: Onların hangisi buna kefil olacak"},{"number":41,"text":"Yoksa kendilerinin ortakları mı var? Doğru iseler ortaklarını çağırsınlar"},{"number":42,"text":"Bacaktan açılacağı (paçanın sıvanacağı, işlerin güçleşeceği) ve secdeye da'vet edilecekleri gün (secde) edemezler"},{"number":43,"text":"Gözleri düşük olarak yüzlerini bir zillet kaplar. Onlar sağlam iken de secdeye da'vet edilirler(fakat secde etmezler)di"},{"number":44,"text":"Bu sözü yalanlayanı bana bırak; onları bilmedikleri yerden derece derece (azaba) yaklaştıracağız"},{"number":45,"text":"Onlara mühlet veriyorum. Doğrusu benim tuzağım sağlamdır (onu kimse bozamaz)"},{"number":46,"text":"Yoksa sen onlardan bir ücret istiyorsun da onlar ağır borç altında mı kalıyorlar"},{"number":47,"text":"Yoksa gayb (görünmez bilgi hazinesi), kendi yanlarında da onlar mı (istedikleri gibi) yazıyorlar"},{"number":48,"text":"Sen Rabbinin hükmüne sabret, balık sahibi (Yunus) gibi olma. Hani o, sıkıntıdan yutkunarak (Allah'a) seslenmişti"},{"number":49,"text":"Eğer Rabbinden ona bir ni'met yetişmeseydi, yerilerek çıplak bir yere atılırdı"},{"number":50,"text":"Fakat Rabbi onun du'asını kabul etti de onu Salih(iyi insan)lardan yaptı"},{"number":51,"text":"O inkar edenler Zikr(Kur'an)'ı işittikleri zaman, neredeyse seni gözleriyle devireceklerdi. \"O mecnundur\" diyorlardı"},{"number":52,"text":"Halbuki o, alemler için uyarıdan başka bir şey değildir"}]}