{"number":89,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"فجر کی قسم ہے"},{"number":2,"text":"اور دس راتوں کی"},{"number":3,"text":"اور جفت اور طاق کی"},{"number":4,"text":"اور رات کی جب وہ گزر جائے"},{"number":5,"text":"ان چیزو ں کی قسم عقلمندوں کے واسطے معتبر ہے"},{"number":6,"text":"کیا آپ نے نہیں دیکھا کہ آپ کے رب نے عاد کے ساتھ کیا سلوک کیا"},{"number":7,"text":"جو نسل ارم سے ستونوں والے تھے"},{"number":8,"text":"کہ ان جیسا شہرو ں میں پیدا نہیں کیا گیا"},{"number":9,"text":"اور ثمود کے ساتھ جنہوں نے پتھروں کو وادی میں تراشا تھا"},{"number":10,"text":"اور فرعون میخوں والوں کے ساتھ"},{"number":11,"text":"ان سب نے ملک میں سرکشی کی"},{"number":12,"text":"پھر انہوں نے بہت فساد پھیلایا"},{"number":13,"text":"پھر ان پر تیرے رب نے عذاب کا کوڑا پھینکا"},{"number":14,"text":"بے شک آپ کا رب تاک میں ہے"},{"number":15,"text":"لیکن انسان تو ایسا ہے کہ جب اسے اس کا رب آزماتا ہے پھر اسے عزت اور نعمت دیتا ہے تو کہتا ہے کہ میرے رب نے مجھے عزت بخشی ہے"},{"number":16,"text":"لیکن جب اسے آزماتا ہے پھر اس پر اس کی روزی تنگ کر تا ہے تو کہتا ہے میرے رب نے مجھے ذلیل کر دیا"},{"number":17,"text":"ہرگز نہیں بلکہ تم یتیم کی عزت نہیں کرتے"},{"number":18,"text":"اور نہ مسکین کو کھانا کھلانے کی ترغیب دیتے ہو"},{"number":19,"text":"اور میت کا ترکہ سب سمیٹ کر کھا جاتے ہو"},{"number":20,"text":"اور مال سے بہت زیادہ محبت رکھتے ہو"},{"number":21,"text":"ہرگز نہیں جب زمین کوٹ کوٹ کر ریزہ ریزہ کر دی جائے گی"},{"number":22,"text":"اور آپ کے رب کا (تخت) آجائے گا اور فرشتے بھی صف بستہ چلے آئيں گے"},{"number":23,"text":"اوراس دن دوزخ لائی جائے گی اس دن انسان سمجھے گا اور اس وقت اس کو سمجھنا کیا فائدہ دے گا"},{"number":24,"text":"کہے گا اے کاش میں اپنی زندگی کے لیے کچھ آگے بھیجتا"},{"number":25,"text":"پس اس دن اس کا ساعذاب کوئی بھی نہ دے گا"},{"number":26,"text":"اور نہ اس کے جکڑنے کے برابر کوئی جکڑنے والا ہو گا"},{"number":27,"text":"(ارشاد ہوگا) اے اطمینان والی روح"},{"number":28,"text":"اپنے رب کی طرف لوٹ چل تو اس سے راضی وہ تجھ سے راضی"},{"number":29,"text":"پس میرے بندو ں میں شامل ہو"},{"number":30,"text":"اور میری جنت میں داخل ہو"}]}