{"number":26,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Ta. Sin. Mim"},{"number":2,"text":"Acestea sunt versetele Cărţii desluşite"},{"number":3,"text":"S-ar putea să te îmbolnăveşti de mâhnire fiindcă ei nu sunt credincioşi"},{"number":4,"text":"Dacă am voi, am pogorî din cer un semn asupra lor şi grumazurile lor se vor pleca smerite înaintea lui"},{"number":5,"text":"Nici o nouă amintire de la Milostivul nu le va veni fără ca ei să nu-i întoarcă spatele"},{"number":6,"text":"Ei hulesc acum, însă curând le vor veni proorocirile despre ceea ce ei batjocoresc"},{"number":7,"text":"Oare ei nu văd pământul? Câte soiuri folositoare am făcut să răsară pe el"},{"number":8,"text":"Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":9,"text":"Domnul tău este Puternicul, Milostivul"},{"number":10,"text":"Domnul tău l-a strigat pe Moise: “Du-te la poporul nedrept"},{"number":11,"text":"poporul lui Faraon. Oare ei nu se tem?”"},{"number":12,"text":"El spuse: “Domnul meu! Mă tem că mă vor socoti mincinos"},{"number":13,"text":"Inima mi se strânge, limba mi se împleticeşte. Trimite-l pe Aaron"},{"number":14,"text":"Ei vor arunca asupra mea vreun păcat şi îmi este teamă că mă vor ucide”"},{"number":15,"text":"Dumnezeu spuse: “Ba nu!... Plecaţi amândoi cu semnele Noastre. Vom fi cu voi şi vom asculta"},{"number":16,"text":"Duceţi-vă amândoi la Faraon şi spuneţi-i: “Noi suntem solia Domnului lumilor"},{"number":17,"text":"Trimite-i cu noi pe fiii lui Israel!”"},{"number":18,"text":"Faraon spuse: “Nu te-am crescut între noi pe când erai copil? N-ai petrecut între noi ani din viaţa ta"},{"number":19,"text":"Tu ai făcut apoi fapta pe care ai făcut-o, căci eşti dintre cei nemulţumitori.”"},{"number":20,"text":"Moise spuse: “Am făcut-o pe când eram între cei rătăciţi"},{"number":21,"text":"Am fugit de la voi, căci îmi era frică de voi. Domnul meu mi-a dăruit înţelepciunea şi m-a rânduit între trimişi"},{"number":22,"text":"Oare binefacerea pe care mi-ai arătat-o să fie aceea că ai robit pe fiii lui Israel?”"},{"number":23,"text":"Faraon spuse: “Cine este, aşadar, Domnul lumilor?”"},{"number":24,"text":"Moise spuse: “Este Domnul cerurilor şi al pământului şi a ceea ce se află între ele. O, dacă aţi crede cu tărie!”"},{"number":25,"text":"Faraon spuse suitei sale: “Aţi auzit?”"},{"number":26,"text":"Moise spuse: “Este Domnul vostru, Domnul strămoşilor voştri dintâi.”"},{"number":27,"text":"Faraon spuse: “Trimisul ce v-a fost trimis este nebun.”"},{"number":28,"text":"Moise spuse: “El este Domnul Răsăritului şi al Asfinţitului şi a ceea ce se află între ele. O, dacă aţi pricepe!”"},{"number":29,"text":"Faraon spuse: “Dacă îţi iei alt dumnezeu în locul meu, te voi arunca între întemniţaţi.”"},{"number":30,"text":"Moise spuse: “Şi dacă îţi voi aduce un lucru fără tăgadă?”"},{"number":31,"text":"Faraon spuse: “Adu-l dacă eşti sincer!”"},{"number":32,"text":"Atunci îşi aruncă toiagul, şi iată-l un adevărat balaur"},{"number":33,"text":"El întinde mâna, şi iat-o albă pentru cei care priveau"},{"number":34,"text":"Faraon spuse căpeteniilor care îl înconjurau: “Acesta este un vrăjitor iscusit"},{"number":35,"text":"El vrea să vă alunge din ţinutul vostru prin vraja sa. Ce porunciţi?”"},{"number":36,"text":"Ei au răspuns: “Spune-le să aştepte, el şi fratele său şi trimite solii în cetăţi să-i adune"},{"number":37,"text":"şi să-ţi aducă pe toţi vrăjitorii iscusiţi.”"},{"number":38,"text":"Fură adunaţi toţi vrăjitorii la vremea din ziua hotărâtă"},{"number":39,"text":"şi li se spuse oamenilor: “V-aţi adunat"},{"number":40,"text":"Poate îi vom urma pe vrăjitori, dacă vor ieşi învingători.”"},{"number":41,"text":"Vrăjitorii i-au spus lui Faraon apropiindu-se: “De vom ieşi învingători, vom căpăta vreo răsplată?”"},{"number":42,"text":"“Da, şi veţi fi în suita mea.”"},{"number":43,"text":"Moise le spuse: “Aruncaţi ce aveţi de aruncat.”"},{"number":44,"text":"Ei îşi aruncară funiile şi toiegele spunând: “Prin puterea lui Faraon, vom fi învingători!”"},{"number":45,"text":"Moise îşi aruncă toiagul şi acesta înghiţi ceea ce ei născociseră"},{"number":46,"text":"Vrăjitorii căzură atunci în genunchi"},{"number":47,"text":"spunând: “Noi credem în Domnul lumilor"},{"number":48,"text":"Domnul lui Moise şi al lui Aaron!”"},{"number":49,"text":"Faraon spuse: “Voi aţi crezut în El înainte ca eu să vă dau îngăduinţa, căci El este mai marele vostru care v-a învăţat vrăjitoria. Veţi afla curând! Voi pune să vi se taie mâinile şi picioarele în curmeziş, iar apoi voi pune să vă răstignească pe toţi”"},{"number":50,"text":"Ei spuseră: “Nu ne pasă, căci noi la Domnul nostru ne întoarcem"},{"number":51,"text":"Noi cu tărie dorim ca Domnul nostru să ne ierte nouă greşelile noastre, căci noi suntem întâii credincioşi.”"},{"number":52,"text":"Noi i-am dezvăluit lui Moise: “Pleacă cu robii Mei noaptea. Veţi fi urmăriţi.”"},{"number":53,"text":"Faraon îşi trimise adunători în cetăţi"},{"number":54,"text":"“Aceştia nu sunt decât o ceată mică"},{"number":55,"text":"şi sunt foarte furioşi pe noi"},{"number":56,"text":"însă noi suntem mulţi şi cu mintea trează.”"},{"number":57,"text":"Noi i-am izgonit din grădini, de la izvoare"},{"number":58,"text":"de la comori şi de la loc îmbelşugat"},{"number":59,"text":"Astfel Noi le-am dat moştenire fiilor lui Israel"},{"number":60,"text":"I-au urmărit înspre Răsărit"},{"number":61,"text":"Când cele două gloate se zăriră, soţii lui Moise spuseră: “Suntem ajunşi din urmă!”"},{"number":62,"text":"Moise spuse: “Ba nu!... Domnul meu este cu mine şi El mă va călăuzi"},{"number":63,"text":"Noi i-am dezvăluit atunci lui Moise: “Loveşte marea cu toiagu-ţi.” Ea se va despica atunci, şi fiece parte va fi asemenea unui munte grozav"},{"number":64,"text":"Noi i-am lăsat pe ceilalţi să se apropie"},{"number":65,"text":"în timp ce pe Moise l-am mântuit cu cei care se aflau cu el"},{"number":66,"text":"i-am înecat pe cei care îi urmăreau"},{"number":67,"text":"Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":68,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":69,"text":"Istoriseşte-le povestea lui Abraham"},{"number":70,"text":"El spuse tatălui său şi poporului său: “Cui vă închinaţi voi?”"},{"number":71,"text":"Ei spuseră: “Ne închinăm unor idoli, de care rămânem legaţi.”"},{"number":72,"text":"El spuse: “Vă aud când îi chemaţi"},{"number":73,"text":"Vă folosesc ori vă păgubesc?”"},{"number":74,"text":"Ei spuseră: “Nu!... Noi i-am aflat şi pe taţii noştri făcând la fel.”"},{"number":75,"text":"El spuse: “Aţi văzut la ce vă închinaţi"},{"number":76,"text":"voi şi strămoşii voştri dintâi"},{"number":77,"text":"Aceşti idoli îmi sunt vrăjmaşi, şi nu Domnul lumilor"},{"number":78,"text":"care m-a creat. El este Cel ce mă călăuzeşte"},{"number":79,"text":"El este Cel ce mă hrăneşte şi mă adapă"},{"number":80,"text":"El este Cel ce mă lecuieşte când sunt bolnav"},{"number":81,"text":"El este Cel ce mă va da morţii şi El mă va învia"},{"number":82,"text":"El este Cel ce — aşa râvnesc — îmi va ierta mie greşelile mele în Ziua judecăţii"},{"number":83,"text":"Domnul meu! Dăruieşte-mi înţelepciunea şi rânduieşte-mă între cei drepţi"},{"number":84,"text":"Fă-mi o limbă ce va vesti Adevărul celor care va să vină"},{"number":85,"text":"Rânduieşte-mă printre moştenitorii Grădinii plăcerilor"},{"number":86,"text":"Iartă-i tatălui meu, căci el a fost dintre cei rătăciţi"},{"number":87,"text":"Nu mă ruşina în Ziua când (oamenii) vor fi sculaţi"},{"number":88,"text":"în Ziua când nici averile, nici copiii nu vor sluji la nimic"},{"number":89,"text":"în afara celor care vin la Dumnezeu cu o inimă curată.”"},{"number":90,"text":"Grădinile vor fi apropiate de cei temători"},{"number":91,"text":"iar Iadul va fi ivit celor rătăciţi"},{"number":92,"text":"Li se va spune: “Unde sunt cei cărora vă închinaţi în locul lui Dumnezeu"},{"number":93,"text":"Vă vor ajuta pe voi ori se vor ajuta pe ei înşişi?”"},{"number":94,"text":"Vor fi repeziţi în Gheena, ei şi toţi rătăciţii"},{"number":95,"text":"precum şi toate oştirile lui Iblis"},{"number":96,"text":"Ei vor spune certându-se între ei"},{"number":97,"text":"“Pe Dumnezeu! Noi ne aflam într-o rătăcire vădită"},{"number":98,"text":"când ne socoteam deopotrivă cu Domnul lumilor"},{"number":99,"text":"Numai cei nelegiuiţi ne-au rătăcit"},{"number":100,"text":"Noi nu avem nici un mijlocitor"},{"number":101,"text":"nici un prieten zelos"},{"number":102,"text":"Dacă ar mai fi pentru noi întoarcere, atunci am fi credincioşi!”"},{"number":103,"text":"Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":104,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":105,"text":"Poporul lui Noe i-a socotit pe trimişi mincinoşi"},{"number":106,"text":"când fratele lor Noe le spuse: “Nu vă temeţi, oare"},{"number":107,"text":"Eu, vouă, vă sunt trimis vrednic de încredere"},{"number":108,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":109,"text":"Eu nu vă cer răsplată, căci răsplata mea se află la Domnul lumilor"},{"number":110,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare!”"},{"number":111,"text":"Ei spuseră: “Să credem în tine, când cei care te urmează sunt cei prea-umili?”"},{"number":112,"text":"El spuse: “Nu am ştiinţă de ceea ce fac ei"},{"number":113,"text":"numai Domnul meu îi poate judeca. O, dacă v-aţi da seama"},{"number":114,"text":"Eu nu-i alung pe credincioşi"},{"number":115,"text":"căci eu nu sunt decât un predicator cu vorbă limpede.”"},{"number":116,"text":"Ei spuseră: “Dacă nu încetezi, o, Noe, vei fi omorât cu pietre!”"},{"number":117,"text":"El spuse: “Domnul meu! Poporul meu m-a socotit mincinos"},{"number":118,"text":"Judecă între mine şi ei. Mântuieşte-mă pe mine şi pe credincioşii ce sunt cu mine.”"},{"number":119,"text":"Noi l-am mântuit pe el şi pe cei care erau cu el pe arca încărcată"},{"number":120,"text":"şi i-am înecat apoi pe cei rămaşi"},{"number":121,"text":"Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":122,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":123,"text":"Adiţii i-au socotit pe trimişi mincinoşi"},{"number":124,"text":"când Hud, fratele lor le spuse: “Nu vă temeţi, oare?”"},{"number":125,"text":"Eu vouă vă sunt trimis vrednic de încredere"},{"number":126,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":127,"text":"Eu nu vă cer răsplată, căci răsplata mea se află la Domnul lumilor"},{"number":128,"text":"Veţi zidi pe fiece înălţime un semn ca să vă jucaţi"},{"number":129,"text":"Vă veţi face întărituri ca şi cum aţi veşnici"},{"number":130,"text":"Când loviţi, loviţi ca nişte despoţi"},{"number":131,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":132,"text":"Temeţi-vă de Cel ce v-a dăruit ceea ce ştiţi"},{"number":133,"text":"de Cel ce v-a dăruit dobitoace şi copii"},{"number":134,"text":"grădini şi izvoare"},{"number":135,"text":"Eu mă tem pentru voi de osânda unei Zile mari.”"},{"number":136,"text":"“Deopotrivă ne este dacă ne ţii predici ori dacă nu ne ţii"},{"number":137,"text":"Aceasta nu este decât felul de a fi al celor dintâi şi"},{"number":138,"text":"noi nu vom fi osândiţi.”"},{"number":139,"text":"Ei l-au socotit mincinos şi Noi, atunci, i-am nimicit. Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":140,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":141,"text":"Tamudiţii i-au socotit pe trimişi mincinoşi"},{"number":142,"text":"când Salih, fratele lor, le spuse: “Nu vă temeţi, oare"},{"number":143,"text":"Eu vouă vă sunt trimis vrednic de încredere"},{"number":144,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":145,"text":"Eu nu vă cer răsplată, căci răsplata mea se află la Domnul lumilor"},{"number":146,"text":"Veţi fi lăsaţi oare să vă tihnească ceea ce aveţi aici"},{"number":147,"text":"grădini şi izvoare"},{"number":148,"text":"holde şi curmali cu ciorchini grei"},{"number":149,"text":"Vă scobiţi cu îndemânare case în munţi"},{"number":150,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":151,"text":"Nu ascultaţi porunca celor necumpătaţi"},{"number":152,"text":"care seamănă stricăciune pe pământ şi nu fac nimic drept.”"},{"number":153,"text":"Ei spuseră: “Tu eşti dintre cei vrăjiţi"},{"number":154,"text":"Şi fiindcă eşti un om asemenea nouă, adu-ne un semn, dacă spui adevărul!”"},{"number":155,"text":"El spuse: “Această cămilă va bea, şi voi veţi bea, fiecare în ziua hotărâtă"},{"number":156,"text":"Nu-i faceţi nici un rău, căci o osândă într-o zi mare vă va lua.”"},{"number":157,"text":"Ei o ologiră, însă dimineaţa se căiră"},{"number":158,"text":"căci osânda îi luă. Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":159,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":160,"text":"Poporul lui Lot i-a socotit pe trimişi mincinoşi"},{"number":161,"text":"când Lot, fratele lor, le spuse: “Nu vă temeţi, oare"},{"number":162,"text":"Eu, vouă, vă sunt trimis vrednic de încredere"},{"number":163,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":164,"text":"Eu nu vă cer răsplată, căci răsplata mea se află la Domnul lumilor"},{"number":165,"text":"Vă apropiaţi de bărbaţii din aceste lumi"},{"number":166,"text":"părăsindu-vă soţiile, create vouă de Domnul vostru? Sunteţi un popor călcător al legii.”"},{"number":167,"text":"Ei spuseră: “Dacă nu încetezi, o, Lot, vei fi izgonit.”"},{"number":168,"text":"El spuse: “Urăsc fapta voastră"},{"number":169,"text":"Domnul meu! Mântuieşte-mă pe mine şi pe ai mei de ceea ce fac ei.”"},{"number":170,"text":"Noi l-am mântuit pe el şi pe toţi ai săi"},{"number":171,"text":"în afara unei bătrâne rămase în urmă"},{"number":172,"text":"şi i-am stârpit apoi pe ceilalţi"},{"number":173,"text":"trimiţând asupra lor o ploaie. Rea a fost ploaia pentru cei cărora li s-a predicat"},{"number":174,"text":"Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":175,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":176,"text":"Oamenii din al’Aika i-au socotit pe trimişi mincinoşi"},{"number":177,"text":"când Şu’aib le spuse: “Nu vă temeţi, oare"},{"number":178,"text":"Eu, vouă, vă sunt trimis vrednic de încredere"},{"number":179,"text":"Temeţi-vă de Dumnezeu şi daţi-mi ascultare"},{"number":180,"text":"Eu nu vă cer răsplată, căci răsplata mea se află la Domnul lumilor"},{"number":181,"text":"Fiţi cinstiţi la măsură şi nu fiţi dintre cei păgubitori"},{"number":182,"text":"Cântăriţi cu drept cântar"},{"number":183,"text":"Nu-i păgubiţi pe oamenii în avutul lor. Nu săvârşiţi fărădelegi pe pământ, semănând stricăciune"},{"number":184,"text":"Temeţi-vă de Cel ce v-a creat pe voi şi pe leaturile dintâi.”"},{"number":185,"text":"Ei spuseră: “Tu eşti dintre cei vrăjiţi"},{"number":186,"text":"Şi fiindcă nu eşti decât un om asemenea vouă, noi gândim că eşti dintre mincinoşi"},{"number":187,"text":"Prăvale cerul în bucăţi asupra noastră, dacă spui adevărul!”"},{"number":188,"text":"El spuse: “Domnul meu ştie prea bine ceea ce faceţi.”"},{"number":189,"text":"Ei l-au socotit pe Şu’aib mincinos, însă i-a luat osânda zilei Întunecării. Şi a fost osânda unei zile mari"},{"number":190,"text":"Întru aceasta este un semn, însă cei mai mulţi nu sunt credincioşi"},{"number":191,"text":"Domnul tău, El este Puternicul, Milostivul"},{"number":192,"text":"El este o pogorâre de la Domnul lumilor"},{"number":193,"text":"Duhul lui credincios a pogorât cu el"},{"number":194,"text":"asupra inimii tale ca tu să fii dintre predicatori"},{"number":195,"text":"într-o limbă arabă desluşită"},{"number":196,"text":"Aceasta se află deja în Psalmii celor dintâi"},{"number":197,"text":"Nu este pentru ei un semn pe care învăţaţii fiilor lui Israel îl cunosc"},{"number":198,"text":"Dacă l-am fi pogorât asupra unui străin"},{"number":199,"text":"şi li l-ar fi citit, ei n-ar fi crezut"},{"number":200,"text":"Astfel îi tăiem drum în inimile nelegiuiţilor"},{"number":201,"text":"însă ei nu cred în el, până ce nu văd osânda cea dureroasă"},{"number":202,"text":"ce le va veni deodată, fără ca ei să presimtă"},{"number":203,"text":"Ei vor spune atunci: “Ni se mai dă un răgaz?”"},{"number":204,"text":"Ei cer venirea osândei Noastre degrabă"},{"number":205,"text":"Chiar de le dăruim bucurii ani de zile, tu nu vezi că"},{"number":206,"text":"tot vine la ei ceea ce li s-a făgăduit şi"},{"number":207,"text":"îndestularea nu le va mai fi de nici un folos"},{"number":208,"text":"Noi n-am nimicit nici o cetate care să nu fi avut predicatori"},{"number":209,"text":"întru amintire, căci Noi nu suntem nedrepţi"},{"number":210,"text":"Nu diavolii s-au pogorât cu el"},{"number":211,"text":"Acesta nu le este pe plac, însă sunt neputincioşi"},{"number":212,"text":"Ei vor fi îndepărtaţi de la ascultarea lui"},{"number":213,"text":"Nu chema alt dumnezeu alături de Dumnezeu, căci astfel vei fi printre cei osândiţi"},{"number":214,"text":"Previne-i pe cei mai apropiaţi din obştea ta"},{"number":215,"text":"Coboară-ţi aripa asupra credincioşilor care te urmează"},{"number":216,"text":"Spune-le când nu-ţi dau ascultare: “Eu n-am nici o vină pentru ceea ce faceţi!”"},{"number":217,"text":"Încrede-te în Puternicul, Milostivul"},{"number":218,"text":"El te vede când te ridici"},{"number":219,"text":"şi când te vânzoleşti printre cei prosternaţi"},{"number":220,"text":"El este Auzitorul, Ştiutorul"},{"number":221,"text":"Să vă dau de ştire asupra cui vor pogorî diavolii"},{"number":222,"text":"Ei pogoară asupra oricărui clevetitor păcătos"},{"number":223,"text":"Ei ciulesc urechea..., însă cei mai mulţi sunt mincinoşi"},{"number":224,"text":"Şi poeţii! Ei sunt urmaţi doar de cei care se rătăcesc"},{"number":225,"text":"Nu-i vezi oare? Ei aiurează în fiece vale"},{"number":226,"text":"spunând ceea ce nu fac"},{"number":227,"text":"în afară de cei care cred şi săvârşesc fapte bune şi-L amintesc pe Dumnezeu adesea, şi se apără când sunt nedreptăţiţi. Cei nedrepţi vor cunoaşte curând pe ce parte s-au întors"}]}