{"number":51,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Pe împrăştietoarele ce împrăştie"},{"number":2,"text":"Pe cărătoarele de povară"},{"number":3,"text":"Pe alergătoarele cu iuţeală"},{"number":4,"text":"Pe împărţitoarele de poruncă"},{"number":5,"text":"Ceea ce vi s-a făgăduit este adevărat"},{"number":6,"text":"Judecata de Apoi este fără tăgadă"},{"number":7,"text":"Pe cerul cu ale sale cărări"},{"number":8,"text":"Voi aveţi asupra lui păreri felurite"},{"number":9,"text":"şi îl întoarce pe dos cel care este întors"},{"number":10,"text":"Să fie ucişi bănuitorii"},{"number":11,"text":"ei, cei care sunt într-o prăpastie şi nu-şi dau seama"},{"number":12,"text":"Ei întreabă: “Când va veni Ziua Judecăţii?”"},{"number":13,"text":"În Ziua când vor fi puşi la încercare în Foc"},{"number":14,"text":"“Gustaţi încercarea voastră! Aceasta este ceea ce voi cereaţi degrabă!”"},{"number":15,"text":"Cei temători vor trăi în Grădini cu izvoare"},{"number":16,"text":"luând ceea ce Domnul lor le va dărui. Ei au fost înainte dintre făptuitorii de bine"},{"number":17,"text":"ce dormeau noaptea puţin"},{"number":18,"text":"iar dis-de-dimineaţă cereau iertare"},{"number":19,"text":"Din averile lor aveau parte şi cerşetorul şi lipsitul"},{"number":20,"text":"Pe pământ sunt semne pentru cei care cred cu tărie"},{"number":21,"text":"Precum şi în voi înşivă. Nu le vedeţi, oare"},{"number":22,"text":"În cer este înzestrarea voastră şi ceea ce vi s-a făgăduit"},{"number":23,"text":"Pe Domnul cerului şi al pământului! Acesta este Adevărul precum faptul că vorbiţi"},{"number":24,"text":"A venit la tine spusa despre oaspeţii prea-cinstiţi ai lui Abraham"},{"number":25,"text":"Ei intrară la el spunându-i: “Pace!” Abraham spuse: “Pace! O, oameni necunoscuţi!”"},{"number":26,"text":"El s-a dus apoi pe nesimţite la ai săi şi a adus un viţel gras"},{"number":27,"text":"L-a apropiat de ei, spunând: “Nu mâncaţi?”"},{"number":28,"text":"Şi atunci îl prinse frica de ei. Aceştia spuseră: “Să nu-ţi fie frică! Şi îi vestiră un fecior însemnat"},{"number":29,"text":"Femeia sa înaintă văitându-se şi lovindu-se peste faţă. Ea spuse: “O bătrână stearpă?...”"},{"number":30,"text":"Ei spuseră: “Domnul tău a spus astfel. El este Înţeleptul, Ştiutorul"},{"number":31,"text":"Abraham spuse: “O, voi trimişilor! Care este treaba voastră?”"},{"number":32,"text":"Ei spuseră: “Noi am fost trimişi la un popor de nelegiuiţi"},{"number":33,"text":"ca să trimitem asupra lui bolovani de lut"},{"number":34,"text":"însemnaţi de Domnul tău pentru cei desfrânaţi.”"},{"number":35,"text":"Noi i-am scos aşadar din cetate pe cei credincioşi şi"},{"number":36,"text":"nu am aflat decât o casă de supuşi"},{"number":37,"text":"Am pus în ea un semn pentru cei care se tem de Osânda cea dureroasă"},{"number":38,"text":"precum în Moise când l-am trimis cu o împuternicire desluşită la Faraon"},{"number":39,"text":"care s-a întors către suita sa spunând: “Este fie vrăjitor, fie îndrăcit!”"},{"number":40,"text":"Noi i-am luat pe ei şi oştile lor şi i-am aruncat în mare, în vreme ce el se dojenea pe sine"},{"number":41,"text":"Aşa a fost şi cu adiţii când am trimis asupra lor vântul pustiilor"},{"number":42,"text":"care nu a lăsat nimic peste care a trecut fără să nu-l facă fărâme"},{"number":43,"text":"Aşa a fost şi cu tamudiţii când li s-a spus: “Bucuraţi-vă o vreme!”"},{"number":44,"text":"Ei n-au luat însă în seamă porunca Domnului lor, iar trăsnetul i-a luat pe când priveau"},{"number":45,"text":"Atunci nu s-au putut ţine pe picioare şi nici ajuta"},{"number":46,"text":"Aşa a fost şi cu poporul lui Noe: Era un popor de desfrânaţi"},{"number":47,"text":"Şi cerul? Noi l-am zidit cu trăinicie şi i-am dat apoi lărgime"},{"number":48,"text":"Şi pământul? Noi l-am aşternut şi ce buni întinzători am fost"},{"number":49,"text":"Din fiece lucru am creat o pereche. Poate vă veţi aminti"},{"number":50,"text":"Zoriţi către Dumnezeu! Eu de la El vă previn desluşit"},{"number":51,"text":"Nu puneţi lângă Dumnezeu alt dumnezeu! Eu de la El vă previn desluşit"},{"number":52,"text":"Aşa a fost întotdeauna. Nici un trimis n-a venit la cei dinaintea lor fără ca ei să nu-i fi spus: “Este fie vrăjitor, fie îndrăcit!”"},{"number":53,"text":"Ei s-au sfătuit unii pe alţii asupra lui? Acesta este un popor de ticăloşi"},{"number":54,"text":"Întoarce-le spatele şi nu vei fi dojenit"},{"number":55,"text":"Adu-le aminte, căci amintirea le este credincioşilor de folos"},{"number":56,"text":"Eu nu i-am creat nici pe ginnii şi nici pe oamenii decât ca să Mi se închine"},{"number":57,"text":"Eu nu vreau nici un dar de la ei. Eu nu vreau să Mă ospăteze"},{"number":58,"text":"Dumnezeu este Împărţitorul de bunuri. El este Stăpânul de nezdruncinat al puterii"},{"number":59,"text":"Cei care s-au ticăloşit în păcate, precum păcatele semenilor lor, să nu o ceară degrabă (Judecata)"},{"number":60,"text":"Vai tăgăduitorilor pentru Ziua ce li s-a făgăduit"}]}