{"number":52,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Pe Munte"},{"number":2,"text":"Pe Cartea scrisă"},{"number":3,"text":"pe un pergament desfăşurat"},{"number":4,"text":"Pe Casa vizitată"},{"number":5,"text":"Pe bolta înălţată"},{"number":6,"text":"Pe marea umflată"},{"number":7,"text":"Osânda Domnului tău va cădea fără tăgadă"},{"number":8,"text":"şi nimeni nu-i va putea sta în cale"},{"number":9,"text":"În Ziua când cerul va fi învârtejit"},{"number":10,"text":"şi munţii se vor pune în mişcare"},{"number":11,"text":"în Ziua aceea, vai celor care hulesc"},{"number":12,"text":"şi celor care cu vorbe deşarte se joacă"},{"number":13,"text":"În Ziua aceea, vor fi îmbrânciţi în Focul Gheenei"},{"number":14,"text":"“Acesta este Focul pe care l-aţi socotit minciună"},{"number":15,"text":"Este o vrajă ori nu vedeţi nimic"},{"number":16,"text":"Ardeţi în el! De-l răbdaţi ori nu-l răbdaţi, totuna-i pentru voi. Sunteţi răsplătiţi pentru ceea ce aţi făptuit!”"},{"number":17,"text":"Cei care se tem de Dumnezeu vor trăi în Grădini, în desfătare"},{"number":18,"text":"bucurându-se de ceea ce Domnul lor le-a dăruit. Domnul lor i-a ferit de osânda Iadului"},{"number":19,"text":"“Mâncaţi şi beţi în tihnă pentru ceea ce aţi făptuit"},{"number":20,"text":"întinşi pe paturi rânduite!” Noi le vom da de soţii hurii cu ochii mari"},{"number":21,"text":"Pe cei care cred şi a căror seminţie i-a urmat în credinţă, Noi îi vom aduna la un loc cu seminţia lor şi cu nimic nu le vom micşora faptele lor. Fiece suflet a ceea ce a agonisit este chezaş"},{"number":22,"text":"Noi le vom rostui fructele şi carnea ce poftesc"},{"number":23,"text":"Ei îşi vor trece unii altora pocale ce nu duc la vorbe deşarte, nici la învinuire de păcate"},{"number":24,"text":"Flăcăiandrii, ce vor umbla printre ei, în slujba lor, vor fi asemenea mărgăritarelor ascunse"},{"number":25,"text":"Ei se vor întoarce unii către alţii întrebându-se"},{"number":26,"text":"Vor spune: “Ne temeam mai înainte pentru ai noştri"},{"number":27,"text":"însă Dumnezeu ne-a oblăduit şi ne-a ferit de osânda vântului arzător"},{"number":28,"text":"Noi L-am chemat şi mai înainte, căci El este Blândul, Milostivul”"},{"number":29,"text":"Aminteşte-ţi! Tu nu eşti, har Domnului tău, nici prezicător şi nici îndrăcit"},{"number":30,"text":"Ei vor spune: “Este un poet! Şi pentru el aşteptăm necazurile vremii!”"},{"number":31,"text":"Spune: “Aşteptaţi! Eu sunt cu voi printre cei care aşteaptă!”"},{"number":32,"text":"Oare visele lor le poruncesc aceasta ori sunt un popor de ticăloşi"},{"number":33,"text":"Vor spune: “El l-a născocit!” Nu!... Ei nu cred"},{"number":34,"text":"Să aducă o spusă asemenea lui, dacă spun adevărul"},{"number":35,"text":"Au fost creaţi din nimic ori sunt ei creatorii"},{"number":36,"text":"Au creat ei cerurile şi pământul? Nu!... Ei nu sunt convinşi"},{"number":37,"text":"Au ei comorile Domnului tău ori le pot stăpâni"},{"number":38,"text":"Au ei vreo scară de pe care să asculte? Să vină cel care a ascultat dintre ei cu o împuternicire desluşită"},{"number":39,"text":"Dumnezeu o fi având fiice, iar voi fii"},{"number":40,"text":"Le ceri tu vreo răsplată? Atunci ar fi împovăraţi de datorii"},{"number":41,"text":"Au ei Taina, aşa încât să o scrie"},{"number":42,"text":"Vor vreun vicleşug? Cei care au tăgăduit vor fi cei vicleniţi"},{"number":43,"text":"Au ei un dumnezeu afară de Dumnezeu? Mărire lui Dumnezeu. deasupra celor pe care I-i alătură"},{"number":44,"text":"Dacă văd o bucată de cer năruindu-se, ei vor spune: “Sunt numai nori vălătuciţi.”"},{"number":45,"text":"Lasă-i până când vor întâlni Ziua în care vor fi trăsniţi"},{"number":46,"text":"Ziua în care vicleşugul lor nu le va mai sluji la nimic, Ziua în care nu vor mai fi ajutaţi"},{"number":47,"text":"Ticăloşii vor avea parte de o osândă înaintea acesteia, însă cei mai mulţi dintre ei nu vor şti nimic"},{"number":48,"text":"Rabdă pentru Judecata Domnului tău, căci tu eşti sub ochii Noştri. Preamăreşte-L cu laude pe Domnului tău când te scoli"},{"number":49,"text":"Preamăreşte-L noaptea şi la pălitul stelelor"}]}