{"number":53,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Pe stelele ce asfinţesc"},{"number":2,"text":"Prietenul vostru nu se rătăceşte şi nici nu cade în greşeală"},{"number":3,"text":"el nu vorbeşte din patimă"},{"number":4,"text":"Aceasta este o Dezvăluire ce i-a fost dezvăluită"},{"number":5,"text":"I-a făcut-o cunoscută cel tare la putere"},{"number":6,"text":"cel cu iscusinţă, ce s-a aşezat"},{"number":7,"text":"pe orizontul cel mai înalt"},{"number":8,"text":"apoi s-a apropiat stând aninat"},{"number":9,"text":"El era la o depărtare de două aruncături de suliţă"},{"number":10,"text":"şi atunci i-a dezvăluit robului Său ceea ce i-a dezvăluit"},{"number":11,"text":"Inima nu a socotit amăgire ceea ce el a văzut"},{"number":12,"text":"Vă îndoiţi de ceea ce el a văzut"},{"number":13,"text":"El l-a văzut încă o dată"},{"number":14,"text":"lângă Lotusul de la capăt"},{"number":15,"text":"unde se află Grădina Lăcaşului"},{"number":16,"text":"atunci când Lotusul era învăluit de ceea ce era învăluit"},{"number":17,"text":"Privirea sa nu s-a abătut şi nici nu a fost stingherită"},{"number":18,"text":"El a văzut semnele cele mari ale Domnului său"},{"number":19,"text":"Ce socotiţi despre Al-Lat şi Al-Uzza"},{"number":20,"text":"şi cealaltă, Manat, a treia"},{"number":21,"text":"Veţi avea voi băieţi şi El fete"},{"number":22,"text":"Ce împărţire samavolnică"},{"number":23,"text":"Nu sunt decât nişte nume pe care voi şi taţii voştri li le-aţi dat, fără ca Dumnezeu să vă fi pogorât vouă vreo împuternicire pentru aceasta. Părinţii voştri nu-şi urmează decât închipuirea şi ceea ce poftesc sufletele lor, cu toate că le-a venit de la Domnul lor călăuzire"},{"number":24,"text":"Va avea omul ceea ce-şi doreşte"},{"number":25,"text":"Ale lui Dumnezeu sunt Viaţa de Apoi şi Viaţa Dintâi"},{"number":26,"text":"Câţi îngeri sunt în cer? Mijlocirea lor nu va sluji la nimic decât după ce Dumnezeu îngăduie aceasta pentru cine voieşte El şi pentru cel de care El este mulţumit"},{"number":27,"text":"Cei care nu cred în Viaţa de Apoi dau îngerilor nume de femei"},{"number":28,"text":"Ei nu au nici o ştiinţă, ci urmează o închipuire. Închipuirea nu slujeşte la nimic în faţa Adevărului"},{"number":29,"text":"Îndepărtează-te de cel care întoarce spatele amintirii şi care nu doreşte decât Viaţa de Acum"},{"number":30,"text":"Aceasta este toată întinderea ştiinţei lor! Domnul tău îl ştie prea bine pe cel care se rătăceşte de la calea Sa, precum îl ştie prea bine şi pe cel drept călăuzit"},{"number":31,"text":"Ale lui Dumnezeu sunt cele din ceruri şi de pe pământ. El îi va răsplăti pe cei care fac răul după ceea ce fac, precum îi va răsplăti şi pe cei care fac binele cu şi mai bine"},{"number":32,"text":"Domnul tău este darnic la iertare cu cei care se feresc de păcatele grele şi de desfrâu, precum şi cu cei care săvârşesc greşeli uşoare. El vă ştie prea bine de pe când v-a înălţat din pământ şi de pe când eraţi feţi în pântecele mamelor voastre. Nu vă daţi voi singuri mântuirea! El îi ştia prea bine pe cei care se tem"},{"number":33,"text":"L-ai văzut pe cel care a întors spatele"},{"number":34,"text":"Are el ştiinţa Tainei ca s-o poată vedea"},{"number":35,"text":"Nu i s-a dat de ştire oare de ceea ce era în sulurile lui Moise"},{"number":36,"text":"şi în cele ale lui Abraham cel atât de credincios"},{"number":37,"text":"Nimănui nu i se va pune în cârcă povara altuia"},{"number":38,"text":"Omul nu va avea decât ceea ce trudeşte"},{"number":39,"text":"Truda sa va fi recunoscută"},{"number":40,"text":"şi va fi din plin răsplătit"},{"number":41,"text":"La Domnul tău este capătul"},{"number":42,"text":"El este Cel ce dăruieşte râsul şi Cel ce dăruieşte plânsul"},{"number":43,"text":"El este Cel ce dăruieşte moartea şi Cel ce dăruieşte viaţa"},{"number":44,"text":"El a creat perechea, bărbat şi femeie"},{"number":45,"text":"dintr-o picătură de sămânţă după ce a fost vărsată"},{"number":46,"text":"A Lui este Facerea cea de apoi"},{"number":47,"text":"El îmbogăţeşte şi îndestulează"},{"number":48,"text":"El este Domnul lui Sirius"},{"number":49,"text":"El i-a nimicit pe adiţii de odinioară"},{"number":50,"text":"precum şi pe tamudiţi — pe nimeni n-a lăsat dintre ei —"},{"number":51,"text":"şi mai înainte pe poporul lui Noe — oameni nedrepţi şi ticăloşi"},{"number":52,"text":"El a dărâmat cetatea cea de-a-ndoaselea"},{"number":53,"text":"acoperind-o cu ceea ce trebuia s-o acopere"},{"number":54,"text":"Care sunt binefacerile Domnului tău pe care tu le tăgădui"},{"number":55,"text":"Aceasta este o mustrare dintre mustrările dintâi"},{"number":56,"text":"Cea care trebuie să se apropie, se va apropia"},{"number":57,"text":"Nimeni, afară de Dumnezeu, nu o poate dezvălui"},{"number":58,"text":"Sunteţi miraţi de această spusă"},{"number":59,"text":"Râdeţi în loc să plângeţi"},{"number":60,"text":"Voi sunteţi nepăsători"},{"number":61,"text":"Prosternaţi-vă înaintea lui Dumnezeu şi Lui închinaţi-vă"},{"number":62,"text":"Se apropie Ceasul şi luna se despică"}]}