{"number":70,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Unul a cerut o osândă ce va să cadă"},{"number":2,"text":"asupra tăgăduitorilor şi nimeni să nu-i poată sta în cale"},{"number":3,"text":"căci vine de la Dumnezeu, Stăpânul Treptelor"},{"number":4,"text":"pe care îngerii şi Duhul le urcă către El într-o zi cât cincizeci de mii de ani"},{"number":5,"text":"Rabdă-i cu cuviincioasă răbdare"},{"number":6,"text":"Ei o văd departe"},{"number":7,"text":"însă Noi o vedem aproape"},{"number":8,"text":"Cerul, în Ziua aceea, va fi ca argintul topit"},{"number":9,"text":"iar munţii ca lâna scărmănată"},{"number":10,"text":"Nici un prieten nu va întreba de prietenul său apropiat"},{"number":11,"text":"chiar de le va fi dat să se vadă. Nelegiuitul ar dori în Ziua aceea să-şi ispăşească osânda prin fiii săi"},{"number":12,"text":"prin soţia sa, prin fratele său"},{"number":13,"text":"prin obştea sa care-l adăpostea"},{"number":14,"text":"şi prin toţi de pe pământ, numai ca el să scape"},{"number":15,"text":"Iată însă văpaia"},{"number":16,"text":"jupuitoare de ţeste"},{"number":17,"text":"chemându-i pe cei care au dat înapoi şi au întors spatele"},{"number":18,"text":"pe cei care au strâns şi au grămădit"},{"number":19,"text":"Omul a fost creat nestatornic"},{"number":20,"text":"când îl atinge răul, este neliniştit"},{"number":21,"text":"când îl atinge binele, este zgârcit"},{"number":22,"text":"afară de cei rugători"},{"number":23,"text":"de cei care în rugăciune sunt stăruitori"},{"number":24,"text":"şi de cei din ale căror averi au parte"},{"number":25,"text":"creşetorul şi lipsitul"},{"number":26,"text":"afară de cei care socot adevărată Ziua Judecăţii"},{"number":27,"text":"şi se tem de osânda Domnului lor"},{"number":28,"text":"— osânda Domnului lor este fără scăpare"},{"number":29,"text":"de cei care îşi păzesc cele ruşinoase"},{"number":30,"text":"şi intră numai la soţiile lor ori la roabele lor şi n-au de ce să fie dojeniţi"},{"number":31,"text":"pe când cei care poftesc dincolo de aceasta sunt călcători de lege"},{"number":32,"text":"afară de cei care păzesc cele încredinţate lor, precum şi legămintele lor"},{"number":33,"text":"de cei care sunt drepţi în mărturia lor"},{"number":34,"text":"de cei care se îngrijesc de rugăciunile lor"},{"number":35,"text":"Aceştia vor fi cei cinstiţi în Grădini"},{"number":36,"text":"De ce tăgăduitorii se grăbesc către tine"},{"number":37,"text":"venind în cete din dreapta şi din stânga"},{"number":38,"text":"Fiece ins dintre ei ar dori să intre într-o Grădină a Plăcerii"},{"number":39,"text":"Ba nu! Noi i-am creat din ceea ce ştiu"},{"number":40,"text":"Ba nu! Jur pe Domnul Răsăritului şi al Asfinţitului că Noi avem putinţa"},{"number":41,"text":"să-i înlocuim oricând cu alţii mai buni decât ei şi nimeni nu Ne-o poate lua înainte"},{"number":42,"text":"Lasă-i să pălăvrăgească şi să se joace până când vor întâlni Ziua ce le-a fost făgăduită"},{"number":43,"text":"Ziua când vor ieşi din morminte în goană de parcă ar fugi spre pietrele înălţate"},{"number":44,"text":"cu ochii în pământ, prigoniţi de umilinţă. Aceasta este Ziua ce le-a fost făgăduită"}]}