{"number":75,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Nu! Jur pe Ziua Învierii"},{"number":2,"text":"Nu! Jur pe sufletul mereu-dojenitor"},{"number":3,"text":"Omul socoate că nu-i vom strânge la un loc oasele"},{"number":4,"text":"Ba da! Noi avem putinţa de a-i potrivi şi oscioarele degetelor sale"},{"number":5,"text":"Înainte de aceasta însă, omul doreşte întotdeauna desfrâul"},{"number":6,"text":"El întreabă: “Când va veni Ziua Învierii?”"},{"number":7,"text":"Atunci când vederea fi-va fulgerată"},{"number":8,"text":"când luna fi-va acoperită"},{"number":9,"text":"când soarele şi luna împreună fi-vor puşi"},{"number":10,"text":"În Ziua aceea omul va spune: “Încotro este oare scăparea?”"},{"number":11,"text":"Ba nu! Nu este nici un cotlon de ascunzătoare"},{"number":12,"text":"În Ziua aceea, numai la Domnul tău găsi-vei alinare"},{"number":13,"text":"În Ziua aceea, omului i se va da ştire cu ce a ieşit înainte şi cu ce a rămas în urmă"},{"number":14,"text":"Omul asupra lui însuşi este mărturie vădită"},{"number":15,"text":"chiar dacă îşi deşartă dezvinuirile"},{"number":16,"text":"Nu-ţi mişca limba, atunci când îl citeşti zorindu-te la capăt să ajungi"},{"number":17,"text":"Noi trebuie să-l strângem la un loc şi să-l citim"},{"number":18,"text":"Şi dacă l-am citit, să-l citim iarăşi"},{"number":19,"text":"Căci Nouă ne este lăsat să-l facem pe înţeles"},{"number":20,"text":"Ba nu! Voi iubiţi degrabă-trecătoarea"},{"number":21,"text":"şi daţi la spate Viaţa de Apoi"},{"number":22,"text":"În Ziua aceea, vor fi chipuri luminate"},{"number":23,"text":"către Domnul lor căutând"},{"number":24,"text":"În Ziua aceea, vor fi chipuri întunecate"},{"number":25,"text":"la ce le va face zdrobitoarea de coaste, cugetând"},{"number":26,"text":"Ba nu! Când sufletul va sta să iasă"},{"number":27,"text":"i se va spune: “Cine este vrăjitor?”"},{"number":28,"text":"Când omul îşi dă seama că desprinderea este aproape"},{"number":29,"text":"şi picioarele i se vor strânge unul într-altul"},{"number":30,"text":"în Ziua aceea, către Domnul tău vei fi mânat"},{"number":31,"text":"El nu a crezut şi nici nu s-a rugat"},{"number":32,"text":"ci a hulit şi spatele a întors"},{"number":33,"text":"apoi ţanţoş la ai săi a mers"},{"number":34,"text":"Vai ţie! Vai"},{"number":35,"text":"Şi iarăşi: Vai ţie! Vai"},{"number":36,"text":"Socoate omul oare că va fi lăsat de izbelişte"},{"number":37,"text":"N-a fost el oare o picătură de sămânţă lepădată"},{"number":38,"text":"iar apoi un cheag de sânge? Dumnezeu l-a creat şi l-a cizelat"},{"number":39,"text":"apoi din el o pereche a făcut: bărbat şi femeie"},{"number":40,"text":"Oare Cel ce a făcut aceasta n-ar avea putinţa să dăruiască morţilor viaţă"}]}