{"number":75,"edition":"ur.jalandhry","ayahs":[{"number":1,"text":"ہم کو روز قیامت کی قسم"},{"number":2,"text":"اور نفس لوامہ کی (کہ سب لوگ اٹھا کر) کھڑے کئے جائیں گے"},{"number":3,"text":"کیا انسان یہ خیال کرتا ہے کہ ہم اس کی (بکھری ہوئی) ہڈیاں اکٹھی نہیں کریں گے؟"},{"number":4,"text":"ضرور کریں گے (اور) ہم اس بات پر قادر ہیں کہ اس کی پور پور درست کردیں"},{"number":5,"text":"مگر انسان چاہتا ہے کہ آگے کو خود سری کرتا جائے"},{"number":6,"text":"پوچھتا ہے کہ قیامت کا دن کب ہوگا؟"},{"number":7,"text":"جب آنکھیں چندھیا جائیں"},{"number":8,"text":"اور چاند گہنا جائے"},{"number":9,"text":"اور سورج اور چاند جمع کردیئے جائیں"},{"number":10,"text":"اس دن انسان کہے گا کہ (اب) کہاں بھاگ جاؤں؟"},{"number":11,"text":"بےشک کہیں پناہ نہیں"},{"number":12,"text":"اس روز پروردگار ہی کے پاس ٹھکانا ہے"},{"number":13,"text":"اس دن انسان کو جو (عمل) اس نے آگے بھیجے اور پیچھے چھوڑے ہوں گے سب بتا دیئے جائیں گے"},{"number":14,"text":"بلکہ انسان آپ اپنا گواہ ہے"},{"number":15,"text":"اگرچہ عذر ومعذرت کرتا رہے"},{"number":16,"text":"اور (اے محمدﷺ) وحی کے پڑھنے کے لئے اپنی زبان نہ چلایا کرو کہ اس کو جلد یاد کرلو"},{"number":17,"text":"اس کا جمع کرنا اور پڑھانا ہمارے ذمے ہے"},{"number":18,"text":"جب ہم وحی پڑھا کریں تو تم (اس کو سنا کرو اور) پھر اسی طرح پڑھا کرو"},{"number":19,"text":"پھر اس (کے معانی) کا بیان بھی ہمارے ذمے ہے"},{"number":20,"text":"مگر (لوگو) تم دنیا کو دوست رکھتے ہو"},{"number":21,"text":"اور آخرت کو ترک کئے دیتے ہو"},{"number":22,"text":"اس روز بہت سے منہ رونق دار ہوں گے"},{"number":23,"text":"(اور) اپنے پروردگار کے محو دیدار ہوں گے"},{"number":24,"text":"اور بہت سے منہ اس دن اداس ہوں گے"},{"number":25,"text":"خیال کریں گے کہ ان پر مصیبت واقع ہونے کو ہے"},{"number":26,"text":"دیکھو جب جان گلے تک پہنچ جائے"},{"number":27,"text":"اور لوگ کہنے لگیں (اس وقت) کون جھاڑ پھونک کرنے والا ہے"},{"number":28,"text":"اور اس (جان بلب) نے سمجھا کہ اب سب سے جدائی ہے"},{"number":29,"text":"اور پنڈلی سے پنڈلی لپٹ جائے"},{"number":30,"text":"اس دن تجھ کو اپنے پروردگار کی طرف چلنا ہے"},{"number":31,"text":"تو اس (ناعاقبت) اندیش نے نہ تو (کلام خدا) کی تصدیق کی نہ نماز پڑھی"},{"number":32,"text":"بلکہ جھٹلایا اور منہ پھیر لیا"},{"number":33,"text":"پھر اپنے گھر والوں کے پاس اکڑتا ہوا چل دیا"},{"number":34,"text":"افسوس ہے تجھ پر پھر افسوس ہے"},{"number":35,"text":"پھر افسوس ہے تجھ پر پھر افسوس ہے"},{"number":36,"text":"کیا انسان خیال کرتا ہے کہ یوں ہی چھوڑ دیا جائے گا؟"},{"number":37,"text":"کیا وہ منی کا جو رحم میں ڈالی جاتی ہے ایک قطرہ نہ تھا؟"},{"number":38,"text":"پھر لوتھڑا ہوا پھر (خدا نے) اس کو بنایا پھر (اس کے اعضا کو) درست کیا"},{"number":39,"text":"پھر اس کی دو قسمیں بنائیں (ایک) مرد اور (ایک) عورت"},{"number":40,"text":"کیا اس خالق کو اس بات پر قدرت نہیں کہ مردوں کو جلا اُٹھائے؟"}]}