{"number":15,"edition":"ug.saleh","ayahs":[{"number":1,"text":"ئەلىف، لام، را. بۇ، كىتابنىڭ - روشەن قۇرئاننىڭ ئايەتلىرىدۇر"},{"number":2,"text":"كاپىرلار (قىيامەتنىڭ دەھشىتىنى كۆرگەندە، دۇنيادىكى چېغىمىزدا) مۇسۇلمان بولغان بولساقچۇ، دەپ ئارمان قىلىدۇ"},{"number":3,"text":"(ئى مۇھەممەد!) ئۇلارنى (يەنى كۇففارلارنى مەيلىگە) قويۇۋەت، يەپ - ئىچىپ، ئويناپ - كۈلۈپ يۈرسۇن، ئۇلار بىھۇدە ئارزۇلار بىلەن بولىۋەرمىسۇن، ئۇلار ئۇزاققا قالماي (ئۆز قىلمىشلىرىنىڭ يامانلىقىنى) بىلىدۇ"},{"number":4,"text":"بىز قانداق بىر شەھەرنى ھالاك قىلمايلى، پەقەت ئۇنىڭ (ھالاك بولىدىغان) مۇئەييەن ۋاقتى بولىدۇ"},{"number":5,"text":"ھەرقانداق ئۈممەتنىڭ (ھالاك بولىدىغان ۋاقتى) ئىلگىرى سۈرۈلمەيدۇ، ھەم كېچىكتۈرۈلمەيدۇ"},{"number":6,"text":"ئۇلار ئېيتتى: «ئى قۇرئان نازىل قىلىنغان ئادەم! سەن ھەقىقەتەن مەجنۇنسەن"},{"number":7,"text":"ئەگەر سەن (مەن رەسۇلۇللاھ دېگەن سۆزۈڭدە) راستچىللاردىن بولساڭ، (پەيغەمبەرلىكىڭگە گۇۋاھلىق بېرىدىغان) پەرىشتىلەرنى ئالدىمىزغا ئېلىپ كەلسەڭچۇ؟»"},{"number":8,"text":"پەرىشتىلەرنى پەقەت ھەق ئاساسىدا (يەنى ئازاب نازىل قىلىشىمىز مۇقەررەر بولغان چاغدىلا) نازىل قىلىمىز، بۇ چاغدا ئۇلارغا مۆھلەت بېرىلمەيدۇ (يەنى ئۇلارنىڭ ئازابى كېچىكتۈرۈلمەيدۇ)"},{"number":9,"text":"قۇرئاننى ھەقىقەتەن بىز نازىل قىلدۇق ۋە چوقۇم ئۇنى قوغدايمىز"},{"number":10,"text":"شۈبھىسىزكى، سېنىڭدىن ئىلگىرىكى بۇرۇنقى ھەرقايسى تائىپىلەرگە نۇرغۇن پەيغەمبەرلەرنى ئەۋەتتۇق"},{"number":11,"text":"ئۇلار ئۆزلىرىگە پەيغەمبەر كەلسىلا ئۇنى مەسخىرە قىلىشتى"},{"number":12,"text":"شۇنداق مەسخىرە قىلىشنى بىز گۇناھكارلارنىڭ دىللىرىغا سالىمىز"},{"number":13,"text":"ئۇلار قۇرئانغا ئىشەنمەيدۇ، بۇ بۇرۇندىن ئادەت بولۇپ قالغان (يەنى بۇرۇندىن تارتىپ پەيغەمبەرلىرنى ئىنكار قىلغان قەۋملەرنى اﷲ نىڭ ھالاك قىلىشى ئادەت بولۇپ كېلىۋاتقان) ئىش"},{"number":14,"text":"بىز ئۇلارغا ئاسماندىن بىر ئىشىك ئېچىپ بەرگىن، ئۇلار ئۇنىڭدىن ئاسمانغا ئۆرلەپ (ئالەمى ئەرۋاھنى، پەرىشتىلەرنى كۆرگەن تەقدىردىمۇ)"},{"number":15,"text":"ئۇلار چوقۇم: «كۆزلىرىمىز باغلىنىپ قالدى، بەلكىم سېھىرلەنگەن قەۋم بولۇپ قالساق كېرەك» دېيىشىدۇ"},{"number":16,"text":"بىز ئاسماندا بۇرۇجلارنى ياراتتۇق ۋە كۆزەتكۈچىلەر ئۈچۈن ئاسماننى (يۇلتۇزلار بىلەن) بېزىدۇق"},{"number":17,"text":"ھەر بىر قوغلاندى شەيتاندىن ئاسماننى قوغدىدۇق"},{"number":18,"text":"لېكىن (ئاسمان خەۋەرلىرىگە) ئوغرىلىقچە قۇلاق سالماقچى بولغان شەيتاننى روشەن ئاقار يۇلتۇز قوغلاپ يېتىدۇ (يەنى ھالاك قىلىدۇ)"},{"number":19,"text":"يەر يۈزىنى يېيىپ كەڭ قىلدۇق، ئۇنىڭغا تاغلارنى ئورناتتۇق، يەر يۈزىدە ھەرخىل تەكشى ئۆلچەملىك ئۆسۈملۈكلەرنى ئۆستۈردۇق"},{"number":20,"text":"يەر يۈزىدە سىلەر ئۈچۈن ۋە سىلەر رىزقىنى بېرەلمەيدىغانلار (يەنى خادىملار ۋە ھايۋانلار) ئۈچۈن تۇرمۇش لازىمەتلىكلىرىنى ياراتتۇق (ئۇلارنىڭ يېمەك - ئىچمەكلىرىنى سىلەر ئەمەس، بىز يارىتىمىز)"},{"number":21,"text":"قانداق نەرسە بولمىسۇن، ئۇنىڭ خەزىنىسى (يەنى خەزىنىنىڭ ئاچقۇچى) بىزنىڭ دەرگاھىمىزدىدۇر، بىز ئۇنى پەقەت مەلۇم مىقداردىلا چۈشۈرىمىز"},{"number":22,"text":"بىز يامغۇرنى ھەيدەيدىغان شاماللارنى ئەۋەتتۇق، بىز بۇلۇتتىن يامغۇر ياغدۇرۇپ سىلەرنى سۇغاردۇق، سىلەر ھەرگىز ئۇنى ساقلاشقا قادىر ئەمەسسىلەر"},{"number":23,"text":"بىز (ھەممىنى) تىرىلدۈرىمىز، (ھەممىنى) ئۆلتۈرىمىز ۋە (ھەممىگە) ۋارىسلىق قىلىمىز"},{"number":24,"text":"بىز سىلەردىن ئىلگىرى ئۆتكەنلەرنى ھەقىقەتەن بىلىمىز ۋە كېيىن كېلىدىغانلارنىمۇ ھەقىقەتەن بىلىمىز"},{"number":25,"text":"پەرۋەردىگارىڭ ھەقىقەتەن (ھېساب ئېلىش ۋە جازالاش ئۈچۈن) ئۇلارنى يىغىدۇ. اﷲ ھەقىقەتەن ھېكمەت بىلەن ئىش قىلغۇچىدۇر، ھەممىنى بىلگۈچىدۇر"},{"number":26,"text":"شەك - شۈبھىسىزكى، بىز ئىنسان (يەنى ئادەم ئەلەيھىسسالامنى) نى قارا لايدىن ياسىلىپ شەكىلگە كىرگۈزۈلگەن (چەكسە جىرىڭلايدىغان) قۇرۇق لايدىن ياراتتۇق"},{"number":27,"text":"جىنلار (يەنى شەيتانلار ۋە ئۇلارنىڭ باشلىقى ئىبلىس) نى ئىلگىرى تۈتۈنسىز ئوت يالقۇنىدىن ياراتقان ئىدۇق"},{"number":28,"text":"پەرۋەردىگارىڭ ئۆز ۋاقتىدا پەرىشتىلەرگە ئېيتتى: «مەن ھەقىقەتەن قارا لايدىن ياسىلىپ شەكىلگە كىرگۈزۈلگەن (چەكسە جىرىڭلايدىغان) قۇرۇق لايدىن ئىنسان (يەنى ئادەم ئەلەيھىسسالام) نى يارىتىمەن"},{"number":29,"text":"مەن ئۇنى تولۇق ياراتقان (يەنى ئۇنى يارىتىپ سۈرەتكە كىرگۈزۈپ، ئەزالىرى تولۇق ۋە مۇكەممەل ئىنسان ھالىتىگە كەلتۈرگەن) ۋە ئۇنىڭغا جان كىرگۈزگەن چېغىمدا، سىلەر ئۇنىڭغا سەجدە قىلىڭلار"},{"number":30,"text":"پەرىشتىلەرنىڭ بىرىمۇ ئايرىلىپ قالماي ھەممىسى (ئادەم ئەلەيھىسسالامغا) سەجدە قىلدى"},{"number":31,"text":"پەقەت ئىبلىسلا سەجدە قىلىشتىن باش تارتتى"},{"number":32,"text":"اﷲ: «ئى ئىبلىس! سەن نېمىشقا سەجدە قىلمايسەن؟» دېدى"},{"number":33,"text":"ئىبلىس: «قارا لايدىن ياساپ شەكىلگە كىرگۈزۈپ (چەكسە جىرىڭلايدىغان) قۇرۇق لايدىن يارىتىلغان ئىنسان مېنىڭ سەجدە قىلىشىمغا لايىق ئەمەس» دېدى"},{"number":34,"text":"اﷲ ئېيتتى: «سەن جەننەتتىن يوقال، ھەقىقەتەن قوغلاندى بولدۇڭ"},{"number":35,"text":"ساڭا قىيامەت كۈنىگىچە ھەقىقەتەن لەنەت بولسۇن»"},{"number":36,"text":"ئىبلىس: «پەرۋەردىگارىم! ماڭا خالايىقلار تىرىلدۈرۈلىدىغان كۈن (يەنى قىيامەت كۈنى) گىچە مۆھلەت بەرگىن (مېنى ھايات قالدۇرغىن)» دېدى"},{"number":37,"text":"اﷲ: «ساڭا ھەقىقەتەن مەلۇم ۋاقىتقىچە مۆھلەت بېرىلىدۇ» دېدى"},{"number":38,"text":"اﷲ: «ساڭا ھەقىقەتەن مەلۇم ۋاقىتقىچە مۆھلەت بېرىلىدۇ» دېدى"},{"number":39,"text":"ئىبلىس ئېيتتى: «پەرۋەردىگارىم! سەن مېنى گۇمراھ قىغانلىقىڭ ئۈچۈن، يەر يۈزىدە ئادەم بالىلىرىغا (گۇناھلارنى) ئەلۋەتتە چىرايلىق كۆرسىتىمەن، ئۇلارنىڭ ھەممىسىنى ئەلۋەتتە ئازدۇرىمەن"},{"number":40,"text":"ئۇلاردىن پەقەت تاللانغان بەندىلىرىڭلا بۇنىڭدىن مۇستەسنا (يەنى ئۇلارنى ئازدۇرالمايمەن)»"},{"number":41,"text":"اﷲ ئېيتتى: «بۇ مەن ساقلاشقا تېگىشلىك توغرا يولدۇر"},{"number":42,"text":"مېنىڭ بەندىلىرىمگە (يەنى ئۇلارنى ئازدۇرۇشقا) سېنىڭ كۈچۈڭ يەتمەيدۇ، پەقەت گۇمراھلاردىن ساڭا ئەگەشكەنلەرگىلا (سېنىڭ كۈچۈڭ يېتىدۇ)»"},{"number":43,"text":"شۈبھىسىزكى، دوزاخ ئۇلار (يەنى ئىبلىس ۋە ئۇنىڭ تەۋەلىرى) نىڭ ھەممىسىگە ۋەدە قىلىنغان جايدۇر"},{"number":44,"text":"جەھەننەمنىڭ يەتتە دەرۋازىسى بولۇپ، ئۇلارنىڭ ھەربىرىدىن كىرىدىغان مۇئەييەن بىر بۆلۈك (ئادەم) بار"},{"number":45,"text":"تەقۋادارلار ھەقىقەتەن (ئاخىرەتتە ياپيېشىل) باغ - بوستانلاردىن، سۇ، ھەسەل ۋە مەي ئېقىپ تۇرىدىغان) بۇلاقلاردىن بەھرىمەن بولىدۇ"},{"number":46,"text":"(ئۇلارغا) جەننەتكە ئامان - ئېسەن، تىنچ كىرىڭلار! دېيىلىدۇ"},{"number":47,"text":"ئۇلارنىڭ دىللىرىدىكى دۈشمەنلىكنى چىقىرىپ تاشلايمىز، ئۇلار ئۆزئارا قېرىنداش بولغان ھالدا تەختلەر ئۈستىدە بىر - بىرىگە قارىشىپ ئولتۇرىدۇ"},{"number":48,"text":"جەننەتتە ئۇلارغا چارچاش بولمايدۇ، ئۇلار جەننەتتىن چىقىرىۋېتىلمەيدۇ"},{"number":49,"text":"(ئى مۇھەممەد!) مېنىڭ (مۆمىن) بەندىلىرىمگە خەۋەر قىلغىنكى، مەن تولىمۇ مەغپىرەت قىلغۇچىمەن، ناھايىتى رەھىم قىلغۇچىمەن"},{"number":50,"text":"مېنىڭ ئازابىم قاتتىقتۇر"},{"number":51,"text":"ئۇلارغا ئىبراھىمنىڭ مېھمانلىرى ھەققىدىكى (ھېكايىنى) ئېيتىپ بەرگىن"},{"number":52,"text":"ئۆز ۋاقتىدا پەرىشتىلەر ئىبراھىمنىڭ يېنىغا كىرىپ سالام بەردى، ئىبراھىم: «بىز ھەقىقەتەن سىلەردىن قورقۇۋاتىمىز» دېدى"},{"number":53,"text":"ئۇلار: «قورقمىغىن، (بىز پەرۋەردىگارىڭنىڭ ئەلچىلىرىمىز)، ھەقىقەتەن ساڭا (ئۆسۈپ چوڭ بولغىنىدا) ناھايىتى بىلىملىك (بولىدىغان) بىر ئوغۇل (يەنى ئىسھاق) بىلەن خۇش خەۋەر بېرىمىز» دېدى"},{"number":54,"text":"ئىبراھىم: «مەن قېرىغان تۇرسام، ماڭا (بالا بىلەن) خۇش خەۋەر بەردىڭلارمۇ؟ ماڭا نېمە بىلەن خۇش خەۋەر بېرىۋاتىسىلەر؟» دېدى"},{"number":55,"text":"ئۇلار: «بىز ساڭا راست خۇش خەۋەر بەردۇق، نائۈمىد بولمىغىن» دېدى"},{"number":56,"text":"ئىبراھىم: «پەرۋەردىگارىڭنىڭ رەھمىتىدىن گۇمراھلاردىن باشقا كىممۇ نائۈمىد بولار؟» دېدى"},{"number":57,"text":"ئىبراھىم: «ئى ئەلچىلەر! نېمە ئىش بىلەن كەلدىڭلار؟» دېدى"},{"number":58,"text":"ئۇلار ئېيتتى: «بىز ھەقىقەتەن گۇناھكار بىز قەۋم (نى جازالاش) ئۈچۈن ئەۋەتىلدۇق"},{"number":59,"text":"پەقەت لۇتنىڭ تەۋەلىرىلا بۇنىڭدىن مۇستەسنا، بىز ئۇلار (يەنى لۇتنىڭ تەۋەلىرى ۋە ئۇنىڭ ئائىلىسىدىكىلەر) نىڭ ھەممىسىنى (ئازابتىن) چوقۇم قۇتۇلدۇرىمىز"},{"number":60,"text":"پەقەت لۇتنىڭ خوتۇنىلا بۇنىڭدىن مۇستەسنا، بىز ئۇنىڭ چوقۇم باشقىلار بىلەن بىللە ئازابلىنىدىغانلىقىنى ئالدىن بېكىتتۇق»"},{"number":61,"text":"ئەلچىلەر لۇتنىڭ ئائىلىسىگە كەلگەن چاغدا"},{"number":62,"text":"لۇت: «سىلەر ھەقىقەتەن ناتونۇش ئادەملەرغۇ؟» دېدى"},{"number":63,"text":"ئۇلار ئېيتتى: «ئۇنداق ئەمەس (بىز اﷲ نىڭ ئەلچىلىرىمىز)، بىز سېنىڭ ئالدىڭغا ئۇلار (يەنى سېنىڭ قەۋمىڭ) شەكلىنىۋاتقان ئازابنى ئېلىپ كەلدۇق"},{"number":64,"text":"بىز ساڭا ھەقىقەتنى ئېلىپ كەلدۇق، بىز ئەلۋەتتە (سۆزىمىزدە) راستچىلمىز"},{"number":65,"text":"كېچىنىڭ ئاخىرىدا ئائىلەڭدىكىلەرنى ئېلىپ يولغا چىققىن، ئۆزۈڭ ئۇلارنىڭ ئارقىسىدا ماڭغىن، سىلەردىن ھېچبىر ئادەم ئارقىسىغا قارىمىسۇن، سىلەر بۇيرۇلغان يەرگە يەتكۈچە ئالغا قاراپ مېڭىۋېرىڭلار»،"},{"number":66,"text":"سەھەردە بۇلار (يەنى لۇتنىڭ قەۋم) نىڭ يىلتىزى قۇرۇتۇلىدۇ (يەنى تەلتۆكۈس ھالاك قىلىنىدۇ) دېگەن ھۆكۈمنى لۇتقا ۋەھىي قىلدۇق"},{"number":67,"text":"(سەدۇم) شەھرىنىڭ ئاھالىسى (يەنى لۇتنىڭ قەۋمى) خۇشال بولۇشۇپ يېتىپ كېلىشتى"},{"number":68,"text":"لۇت ئېيتتى: «بۇلار مېنىڭ مېھمىنىم، (ئۇلارغا چېقىلىپ قويۇپ ئۇلارنىڭ ئالدىدا) مېنى رەسۋا قىلماڭلار"},{"number":69,"text":"اﷲ تىن قورقۇڭلار (مېھمىنىمنى خارلاش ئارقىلىق) مېنى خارلىماڭلار»"},{"number":70,"text":"ئۇلار: «بىز سېنى كەلگەن مۇساپىرلارنى ھىمايە قىلىشتىن توسمىغانمىدۇق؟» دېدى"},{"number":71,"text":"لۇت: «بۇلار مېنىڭ قىزلىرىم (يەنى قەۋمىمنىڭ قىزلىرى) دۇر، ئەگەر (قازائى شەھۋەت) قىلماقچى بولساڭلار (ئۇلارنى نىكاھلاپ ئېلىڭلار)» دېدى"},{"number":72,"text":"(ئى مۇھەممەد!) سېنىڭ ھاياتىڭ بىلەن قەسەمكى، ئۇلار ئەلۋەتتە گۇمراھلىقلىرىدا تېڭىرقاپ يۈرۈشىدۇ"},{"number":73,"text":"كۈن چىقار ۋاقتىدا ئۇلارغا قاتتىق چۇقان يۈزلەندى"},{"number":74,"text":"بىز ئۇ شەھەرنى ئاستىن - ئۈستۈن قىلىۋەتتۇق (يەنى كۆمتۈرۈۋەتتۇق) ۋە ئۇلارنىڭ ئۈستىىگە (يامغۇردەك) ساپال تاش ياغدۇردۇق"},{"number":75,"text":"ئۇنىڭدا (يەنى ئۇلارغا نازىل بولغان ئازابتا) كۆزەتكۈچىلەر ئۈچۈن ھەقىقەتەن نۇرغۇن ئىبرەتلەر بار"},{"number":76,"text":"ئۇ شەھەر (قۇرەيشلەر شامغا بارىدىغان) يول ئۈستىدە ھەقىقەتەن ھېلىمۇ مەۋجۇت تۇرماقتا"},{"number":77,"text":"بۇنىڭدا مۆمىنلەر ئۈچۈن ھەقىقەتەن ئىبرەت بار"},{"number":78,"text":"ئەيكەلىكلەر، شۈبھىسىزكى، زالىم ئىدى (يەنى كۇفرىدا ھەددىدىن ئاشقانلار ئىدى)"},{"number":79,"text":"(شۇئەيبنىڭ پەيغەمبەرلىكىنى ئىنكار قىلغانلىقلىرى ئۈچۈن) ئۇلارنى ھالاك قىلدۇق، ئۇلار (يەنى بۇ ئىككى شەھەر) نىڭ ھەر ئىككىلىسى، شۈبھىسىزكى، ئاشكارا يول ئۈستىدىدۇر (ئى مەككە ئاھالىسى! ئۇلاردىن ئىبرەت ئالمامسىلەر؟)"},{"number":80,"text":"ھىجرىلىكلەر ھەقىقەتەن پەيغەمبەرلەرنى ئىنكار قىلدى (يەنى ئۇلارنىڭ سالىھ ئەلەيھىسسالامنى ئىنكار قىلغانلىقى باشقا پەيغەمبەرلەرنىمۇ ئىنكار قىلغانلىقىدۇر)"},{"number":81,"text":"ئۇلارغا مۆجىزىلىرىمىزنى كەلتۈردۇق (يەنى تاشتىن چىشى تۆگە چىقىرىشتەك قۇدرىتىمىزگە دالالەت قىلىدىغان مۆجىزىلەرنى ئۇلارغا كۆرسەتتۇق)، ئۇلار بۇ (مۆجىزە) لەردىن يۈز ئۆرۈدى"},{"number":82,"text":"ئۇلار (ئازابتىن) ئەمىن بولغان ھالدا تاغلارنى تېشىپ (بۇ بىزنى اﷲ نىڭ ئازابىدىن ساقلايدۇ دەپ) ئۆي سالاتتى"},{"number":83,"text":"لېكىن قاتتىق چۇقان سەھەردىلا ئۇلارنى ھالاك قىلدى"},{"number":84,"text":"ئۇلارنىڭ قىلغان ئەمگەكلىرى ئۆزلىرىگە ئەسقاتمىدى (يەنى ئۇلارنىڭ سالغان بىنالىرى ئۇلارنى اﷲ نىڭ ئازابىدىن ساقلاپ قالالمىدى)"},{"number":85,"text":"بىز ئاسمانلارنى، زېمىننى ۋە ئۇلاردىكى نەرسىلەرنى پەقەت ھەق ئاساسىدىلا ياراتتۇق، قىيامەتنىڭ بولۇشى چوقۇمدۇر، (ئى مۇھەممەد! نادانلار بىلەن تەڭ بولمىغىن، ئۇلارغا) چىرايلىق مۇئامىلىدە بولغىن"},{"number":86,"text":"پەرۋەردىگارىڭ ھەقىقەتەن ھەممىنى ياراتقۇچىدۇر، (بەندىلەرنىڭ ئەھۋالىنى) بىلىپ تۇرغۇچىدۇر"},{"number":87,"text":"(نامازدا) تەكرارلىنىپ تۇرىدىغان يەتتە ئايەتنى (يەنى سۈرە فاتىھەنى) ۋە ئۇلۇغ قۇرئاننى ھەقىقەتەن ساڭا ئاتا قىلدۇق"},{"number":88,"text":"بەزى كاپىرلارنىڭ بىز بەھرىمەن قىلغان نەرسىلىرىگە كۆز سالمىغىن، ئۇلار (نىڭ ئىمان ئېيتمىغانلىقىدىن) قايغۇرمىغىن، مۆمىنلەرگە كەمتەر بولغىن"},{"number":89,"text":"«مەن ھەقىقەتەن (سىلەرنى اﷲ نىڭ ئازابىنىڭ نازىل بولۇشىدىن) ئاشكارا ئاگاھلاندۇرغۇچىمەن» دېگىن"},{"number":90,"text":"پارچىلىۋەتكۈچىلەرگە (يەنى يەھۇدىيلار ۋە ناسارالارغا تەۋرات بىلەن ئىنجىلنى) نازىل قىلغاندەك (ساڭا سۈرە فاتىھە بىلەن ئۇلۇغ قۇرئاننى نازىل قىلدۇق)"},{"number":91,"text":"ئۇلار (يەنى يەھۇدىيلار ۋە ناسارالار) قۇرئاننى پارچە - پەرچە قىلىۋەتتى (يەنى قۇرئاننىڭ بەزىسىگە ئىشىنىپ، بەزىسىنى ئىنكار قىلدى)"},{"number":92,"text":"پەرۋەردىگارىڭنىڭ نامى بىلەن قەسەمكى، ئۇلار (يەنى خالايىق) نىڭ ھەممىسىنىڭ (بۇ دۇنيادا) قىلغان ئىشلىرىنى چوقۇم سورايمىز"},{"number":93,"text":"پەرۋەردىگارىڭنىڭ نامى بىلەن قەسەمكى، ئۇلار (يەنى خالايىق) نىڭ ھەممىسىنىڭ (بۇ دۇنيادا) قىلغان ئىشلىرىنى چوقۇم سورايمىز"},{"number":94,"text":"ساڭا بۇيرۇلغاننى (يەنى پەرۋەردىگارىڭنىڭ ئەمرىنى) ئاشكارا ئوتتۇرىغا قويغىن، مۇشرىكلار (نىڭ مەسخىرەلىرىگە) پەرۋا قىلمىغىن"},{"number":95,"text":"سېنى مەسخىرە قىلغۇچىلارغا بىز چوقۇم تېتىيمىز"},{"number":96,"text":"ئۇلار باشقا مەبۇدلارنى اﷲ قا شېرىك قىلىدۇ، ئۇلار ئۇزاققا قالماي (ئىشنىڭ ئاقىۋىتىنى) بىلىدۇ"},{"number":97,"text":"بىز ئۇلارنىڭ سۆزلىرىدىن يۈرىكىڭنىڭ سېقىلىۋاتقانلىقىنى ئوبدان بىلىمىز"},{"number":98,"text":"پەرۋەردىگارىڭغا ھەمدۇ ۋە تەسبىھ ئېيتقىن، ھەم سەجدە قىلغۇچىلاردىن بولغىن"},{"number":99,"text":"سەن ئۆزۈڭگە ئۆلۈم كەلگەنگە (يەنى ئەجىلىڭ يەتكەنگە) قەدەر پەرۋەردىگارىڭغا ئىبادەت قىلغىن"}]}