{"number":38,"edition":"ug.saleh","ayahs":[{"number":1,"text":"صاد. شانلىق قۇرئان بىلەن قەسەمكى، (بۇ قۇرئان ھەقىقەتەن مۆجىزىدۇر)"},{"number":2,"text":"بەلكى كاپىرلار ئىماندىن باش تارتماقتا ۋە (رەسۇلۇللاھقا) مۇخالىپەتچىلىك قىلماقتا"},{"number":3,"text":"ئۇلاردىن ئىلگىرى (كۇفرى تۈپەيلىدىن) نۇرغۇن ئۈممەتلەرنى ھالاك قىلدۇق، ئۇلار (ئازابنى كۆرگەندە) پەرياد قىلدى، ھالبۇكى، (بۇ) قاچىدىغان ۋاقىت ئەمەس"},{"number":4,"text":"ئۇلارغا ئۆزلىرىنىڭ ئىچىدىن بىر ئاگاھلاندۇرغۇچى (يەنى پەيغەمبەر) كەلگەنلىكىگە ئۇلار ھەيران قېلىشتى، كاپىرلار ئېيتتى: «بۇ بىر يالغانچى سېھىرگەردۇر"},{"number":5,"text":"ئۇ نۇرغۇن ئىلاھلارنى بىر ئىلاھ قىلماقچىمۇ؟ بۇ ھەقىقەتەن غەلىتە ئىش»"},{"number":6,"text":"ئۇلارنىڭ (يەنى قۇرەيشنىڭ) كاتتىلىرى (سورۇنلىرىدىن) قوزغىلىپ چىقىپ ئېيتتى: «سىلەر مېڭىڭلار، مەبۇدلىرىڭلارغا ئىبادەت قىلىشتا چىڭ تۇرۇڭلار، بۇ ھەقىقەتەن (بىزدىن) ئىرادە قىلىنىدىغان بىر ئىش (يەنى مۇھەممەد سىلەرنى دىنىڭلاردىن تاندۇرۇپ، سىلەرگە ئۆزىنىڭ ئۈستۈنلۈك قازىنىشىنى ئىرادە قىلىدۇ)"},{"number":7,"text":"بۇنى بىز باشقا بىر دىندىن (يەنى ناسارا دىنىدىكىلەردىن) ئاڭلىمىدۇق، بۇ پەقەت ئويدۇرمىدۇر"},{"number":8,"text":"قۇرئان بىزگە نازىل بولماي ئۇنىڭغا نازىل بولدىمۇ؟» بەلكى ئۇلار مېنىڭ زىكرىم (يەنى قۇرئان) دىن شەكتىدۇر، بەلكى ئۇلار تېخى مېنىڭ ئازابىمنى تېتىغىنى يوق"},{"number":9,"text":"ياكى ئۇلاردا غالىب، ناھايىتى كەرەملىك پەرۋەردىگارىڭنىڭ رەھمىتىنىڭ خەزىنىلىرى بارمۇ؟"},{"number":10,"text":"ياكى ئۇلار ئاسمانلارنىڭ، زېمىننىڭ ۋە ئۇلارنىڭ ئارىسىدىكى نەرسىلەرنىڭ پادىشاھلىقىغا ئىگىمۇ؟ (ئەگەر ئۇلار ئىگە بولسا، ئۇلار ئۆزلىرىنى ئاسمانغا ئېلىپ چىقىدىغان) شوتىلارغا چىقسۇن"},{"number":11,"text":"ئۇلار (رەسۇلۇللاھقا قارشى) جامائەلەردىن ئۇيۇشقان مەغلۇب قىلىنىدىغان قوشۇندۇر"},{"number":12,"text":"ئۇلاردىن (يەنى قۇرەيش مۇشرىكلىرىدىن) ئىلگىرى نۇھ قەۋمى، ئاد (قەۋمى) ۋە قوزۇقلار ئىگىسى پىرئەۋن (قەۋمى) (پەيغەمبەرلىرىنى) ئىنكار قىلدى"},{"number":13,"text":"سەمۇد قەۋمى، لۇت قەۋمى ۋە ئەيكىلىكلەر (يەنى شۇئەيب ئەلەيھىسسالام قەۋمى) مۇ (پەيغەمبەرلىرىنى ئىنكار قىلدى)، ئەنە شۇلار (پەيغەمبەرلەرگە قارشى ئۇيۇشقان) جامائەلەر ئىدى"},{"number":14,"text":"ئۇلار (يەنى جامائەلەر) دىن پەيغەمبەرلەرنى ئىنكار قىلمىغان بىرىمۇ يوق، شۇنىڭ ئۈچۈن ئۇلارغا مېنىڭ ئازابىم تېگىشلىك بولدى"},{"number":15,"text":"بۇلار (يەنى مەككە مۇشرىكلىرى) پەقەت بىر ئاۋاز (يەنى بىرىنچى قېتىملىق سۇر) نىلا كۈتىدۇ، ئۇ قايتىلانمايدۇ"},{"number":16,"text":"ئۇلار (مەسخىرە قىلىش يولى بىلەن): «پەرۋەردىگارىمىز! (سەن بىزگە ئازابتىن ۋەدە قىلغان) نېسىۋىمىزنى بىزگە بالدۇرراق – قىيامەت كۈنىدىن ئىلگىرى بەرگىن» دېيىشتى"},{"number":17,"text":"ئۇلارنىڭ سۆزلىرىگە سەۋر قىلغىن، (دىندا) كۈچلۈك بەندىمىز داۋۇدنى ئەسلىگىن، ئۇ ھەقىقەتەن اﷲ قا ئىتائەت قىلغۇچى ئىدى"},{"number":18,"text":"بىز ھەقىقەتەن تاغلارنى (داۋۇدقا) بويسۇندۇرۇپ بەردۇق، ئۇلار داۋۇد بىلەن ئەتىگىنى - ئاخشىمى تەسبىھ ئېيتاتتى"},{"number":19,"text":"قۇشلارنىمۇ ئۇنىڭغا بويسۇندۇرۇپ بەردۇق، ئۇلارمۇ (تەرەپ - تەرەپتىن) توپلىنىپ، داۋۇد بىلەن بىللە تەسبىھ ئېيتاتتى، (تاغلارنىڭ، قۇشلارنىڭ) ھەممىسى اﷲ قا ئىتائەت قىلغۇچىدۇر"},{"number":20,"text":"داۋۇدنىڭ سەلتەنىتىنى كۈچەيتتۇق، ئۇنىڭغا ھېكمەت ۋە (ھەممە ئادەم چۈشىنىدىغان) روشەن سۆز - ئىبارىلەرنى ئاتا قىلدۇق"},{"number":21,"text":"(ئى مۇھەممەد!) دەۋا قىلغۇچىلارنىڭ قىسسىسى ساڭا يەتتىمۇ؟ ئۆز ۋاقتىدا ئۇلار (داۋۇد ئىبادەت قىلىۋاتقان) مەسجىدنىڭ تېمىدىن ئارتىلىپ چۈشۈشتى"},{"number":22,"text":"ئەينى ۋاقىتتا ئۇلار داۋۇدنىڭ يېنىغا كىردى. داۋۇد ئۇلاردىن قورقتى، ئۇلار (داۋۇدقا): «قورقمىغىن، بىز بىرىمىز - بىرىمىزگە چېقىلغان ئىككى دەۋاگەرمىز، بىزنىڭ ئارىمىزدا ئادىللىق بىلەن ھۆكۈم قىلغىن، ناھەق ھۆكۈم چىقارمىغىن، بىزنى توغرا يولغا باشلىغىن» دېدى"},{"number":23,"text":"(ئۇلارنىڭ بىرى) «شۈبھىسىزكى، مېنىڭ بۇ قېرىندىشىمنىڭ 99 ساغلىقى بار، مېنىڭ بىر ساغلىقىم بار، قېرىندىشىم ئۇ بىر ساغلىقنىمۇ ماڭا بەرگىن دەيدۇ، (ئارىمىزدا بۇ توغرۇلۇق مۇنازىرە بولۇپ) ئۇ مېنى سۆزدە يېڭىپ قويدى» دېدى"},{"number":24,"text":"داۋۇد ئېيتتى: «ئۇ سېنىڭ ساغلىقىڭنى ئۆزىنىڭ ساغلىقلىرىغا قوشۇۋېلىشنى تەلەپ قىلىپ راستلا سېنى بوزەك قىلىپتۇ، نۇرغۇن شېرىكلەر (يەنى دوستلار)، شۈبھىسىزكى، بىر - بىرىگە چېقىلىدۇ، پەقەت ئىمان ئېيتقان ۋە ياخشى ئەمەل قىلغانلارلا (بىر - بىرىگە چېقىلمايدۇ) بۇلار ئازدۇر». داۋۇد بىزنىڭ ئۇنى سىنىغانلىقىمىزنى بىلدى. پەرۋەردىگارىدىن مەغپىرەت تەلەپ قىلدى، سەجدىگە باردى. (اﷲ قا) تەۋبە قىلدى"},{"number":25,"text":"بىز ئۇنىڭ خاتالىقىنى ئەپۇ قىلدۇق، ئۇ بىزنىڭ دەرگاھىمىزدا ئەلۋەتتە يېقىنلىققا ۋە ياخشى ئاقىۋەتكە ئىگە بولىدۇ"},{"number":26,"text":"ئى داۋۇد! سېنى بىز ھەقىقەتەن يەر يۈزىدە خەلىپە قىلدۇق، كىشىلەرنىڭ ئارىسىدا ئادىللىق بىلەن ھۆكۈم چىقارغىن، نەپسى خاھىشقا ئەگەشمىگىنكى، ئۇ سېنى اﷲ نىڭ يولىدىن ئازدۇرىدۇ، اﷲ نىڭ يولىدىن ئازغانلار ھېساب كۈنى (يەنى قىيامەت كۈنى) نى ئۇنتۇغانلىقلىرى ئۈچۈن ھەقىقەتەن قاتتىق ئازابقا دۇچار بولىدۇ"},{"number":27,"text":"ئاسماننى، زېمىننى ۋە ئۇلارنىڭ ئارىسىدىكى شەيئىلەرنى بىكار ياراتمىدۇق، ئۇ (يەنى ئۇلارنى بىكار يارىتىلغان دەپ قاراش) كاپىرلارنىڭ گۇمانىدۇر، كاپىرلارغا دوزاختىن ۋاي"},{"number":28,"text":"ئىمان ئېيتقان ۋە ياخشى ئەمەللەرنى قىلغانلارنى يەر يۈزىدە بۇزغۇنچىلىق قىلغانلار بىلەن ئوخشاش قىلامدۇق؟ ياكى تەقۋادارلارنى فاجىرلارغا ئوخشاش قىلامدۇق؟"},{"number":29,"text":"(بۇ) ئۇلارنىڭ ئايەتلەرنى تەپەككۈر قىلىشلىرى ئۈچۈن، ئەقىل ئىگىلىرىنىڭ ۋەز - نەسىھەت ئېلىشلىرى ئۈچۈن بىز ساڭا نازىل قىلغان مۇبارەك كىتابتۇر"},{"number":30,"text":"بىز داۋۇدقا سۇلەيماننى ئاتا قىلدۇق، سۇلەيمان نېمىدېگەن ياخشى بەندە! ئۇ (اﷲ قا) ھەقىقەتەن ئىتائەت قىلغۇچى ئىدى"},{"number":31,"text":"ئۆز ۋاقتىدا كەچقۇرۇنلىقى ئۇنىڭغا ياخشى يۈگۈرۈك ئاتلار توغرىلاندى"},{"number":32,"text":"سۇلەيمان ئېيتتى: «مەن ھەقىقەتەن ئاتلارنى پەرۋەردىگارىمنى ئەسلەش ئۈچۈن ياخشى كۆردۈم، ئۇلار (كۆزۈمدىن) غايىب بولغۇچە (ئۇلارنى كۆزدىن كۆچۈرۈش بىلەن بولدۇم)»"},{"number":33,"text":"سۇلەيمان ئېيتتى: «ئاتلارنى مېنىڭ ئالدىمغا ئېلىپ كېلىڭلار». (ئاتلار ئېلىپ كېلىنگەندىن كېيىن) سۇلەيمان ئۇلارنىڭ پاچاقلىرىنى، بويۇنلىرىنى سىلاشقا باشلىدى"},{"number":34,"text":"بىز ھەقىقەتەن سۇلەيماننى سىنىدۇق، ئۇنىڭ تەختى ئۈستىگە بىر جەسەتنى تاشلىدۇق، ئاندىن ئۇ (بۇنىڭ سىناق ئىكەنلىكىنى بىلىپ) تەۋبە قىلدى"},{"number":35,"text":"سۇلەيمان ئېيىتتى: «پەرۋەردىگارىم! ماڭا مەغپىرەت قىلغىن، ماڭا مەندىن كېيىن (مەندىن باشقا) ھېچ ئادەمگە مۇيەسسەر بولمايدىغان پادىشاھلىقنى ئاتا قىلغىن، سەن ھەقىقەتەن كۆپ ئاتا قىلغۇچىسەن»"},{"number":36,"text":"بىز سۇلەيمانغا شامالنى بويسۇندۇرۇپ بەردۇق. شامال سۇلەيماننىڭ بۇيرۇقى بويىچە ئۇ خالىغان تەرەپكە لەرزان ماڭاتتى"},{"number":37,"text":"ھەمدە ئۇنىڭغا (كاتتا بىنالارنى سالالايدىغان) قۇرغۇچى ۋە (دېڭىزلارغا چۆكۈپ ئۈنچە - مارجانلارنى ئېلىپ چىقالايدىغان) غەۋۋاس شەيتانلارنى بويسۇندۇرۇپ بەردۇق"},{"number":38,"text":"يەنە نۇرغۇن شەيتانلارغا ئىشكەل سېلىنغاندۇر"},{"number":39,"text":"(بىز سۇلەيمانغا ئېيتتۇقكى) «بۇ بىزنىڭ (ساڭا بەرگەن كەڭ) ئاتايىمىز، (ئۇنىڭدىن سەن خالىغان كىشىگە) بەرگىن، ياكى بەرمىگىن، (بۇ ھەقتە سەندىن) ھېساب ئېلىنمايدۇ»"},{"number":40,"text":"ئۇ بىزنىڭ دەرگاھىمىزدا ھەقىقەتەن يېقىنلىققا ۋە ياخشى ئاقىۋەتكە ئىگە بولىدۇ"},{"number":41,"text":"بەندىمىز ئەييۇبنى ئەسلىگىن، ئۇ ئۆز ۋاقتىدا پەرۋەردىگارىغا (ئىلتىجا قىلىپ): «شەيتان ماڭا ھەقىقەتەن جاپا - مۇشەققەت ۋە ئازاب يەتكۈزدى» دەپ نىدا قىلدى"},{"number":42,"text":"ئۇنىڭغا: «پۇتۇڭ بىلەن يەرنى تەپكىن» دېدۇق، ئۇ پۇتى بىلەن يەرنى تېپىۋىدى، سۈزۈك بىر بۇلاق ئېتىلىپ چىقتى. (بىز ئۇنىڭغا) «بۇ يۇيۇنسىمۇ بولىدىغان، ئىچسىمۇ بولىدىغان سوغۇق سۇدۇر» (دېدۇق)"},{"number":43,"text":"بىز ئۇنىڭ (كېسەل ۋاقتىدا ھادىسىگە ئۇچراپ يوق بولغان) ئەھلى - ئەۋلادىنى (يېڭىدىن) بەردۇق، ئۇلار بىلەن بىللە بىر باراۋەر ئارتۇق بەردۇق، (بۇ) بىزنىڭ نازىل قىلغان رەھمىتىمىزدۇر، ئەقىل ئىگىلىرى ئۈچۈن ۋەز - نەسىھەتتۇر"},{"number":44,"text":"(ئۇنىڭغا) «قولۇڭ بىلەن بىر باغلام چۆپنى ئېلىپ، ئۇنىڭ بىلەن (ئايالىڭنى) ئۇرغىن. قەسىمىڭنى بۇزمىغىن» (دېدۇق). بىز ئەييۇبنى ھەقىقەتەن سەۋرچان بايقىدۇق، ئۇ نېمىدېگەن ئوبدان بەندە! ھەقىقەتەن ئۇ (اﷲ قا) تەۋبە بىلەن يۈزلەنگۈچىدۇر"},{"number":45,"text":"ئىبادەتتە كۈچلۈك، (دىندا) بەسىرەتلىك بەندىلىرىمىز ئىبراھىم، ئىسھاق ۋە يەئقۇبنى ئەسلىگىن"},{"number":46,"text":"ئۇلارنى بىز پاك - خىسلەتلىك، ئاخىرەتنى ئەسلەپ تۇرىدىغان سەمىمىي كىشلەر قىلدۇق"},{"number":47,"text":"ئۇلار بىزنىڭ دەرگاھىمىزدا ھەقىقەتەن ئالاھىدە تاللانغان كىشىلەردۇر، ھەقىقەتەن ياخشى كىشىلەردۇر"},{"number":48,"text":"ئىسمائىلنى، ئىليەسەنى ۋە زۇلكىفلنى ئەسلىگىن، (ئۇلارنىڭ) ھەممىسى ياخشىلاردىندۇر"},{"number":49,"text":"بۇ ۋەز - نەسىھەتتۇر، تەقۋادارلارغا ئەلۋەتتە ياخشى ئاقىۋەت بار"},{"number":50,"text":"(ئۇ) تۇرالغۇ بولغان جەننەتلەردىن ئىبارەت بولۇپ، ئۇلارغا ئۇنىڭ دەرۋازىلىرى ئوچۇقتۇر"},{"number":51,"text":"ئۇلار جەننەتلەردە تەختلەرگە يۆلىنىپ ئولتۇرىدۇ، ئۇلار جەننەتلەردە نۇرغۇن مېۋىلەرنى، نۇرغۇن شارابلارنى تەلەپ قىلىپ (ئەكەلدۈرۈپ) تۇرىدۇ"},{"number":52,"text":"ئۇلارنىڭ يانلىرىدا ئەرلىرىدىن غەيرىيگە كۆز سالمايدىغان، ياش قۇرامى ئوخشاش جۈپتىلىرى بولىدۇ"},{"number":53,"text":"بۇ سىلەرگە قىيامەت كۈندە ۋەدە قىلىنغان نېمەتتۇر"},{"number":54,"text":"بۇ ھەقىقەتەن بىزنىڭ ئاتايىمىزدۇركى، ئۇ ھەرگىز تۈگىمەيدۇ"},{"number":55,"text":"بۇ (ھەقىقەتتۇر)، كاپىرلارنىڭ (ئاخىرەتتە بولىدىغان جايى) ھەقىقەتەن ئەڭ يامان جايدۇر"},{"number":56,"text":"ئۇ جەھەننەمدۇر، ئۇلار جەھەننەمگە كىرىدۇ، ئۇ نېمىدېگەن يامان جاي"},{"number":57,"text":"بۇ (كۆيدۈرگۈچى) قىزىق سۇدۇر، قان - يىرىڭدۇر، ئۇلار بۇنى تېتىسۇن"},{"number":58,"text":"يەنە (ئۇلارغا) مۇشۇ خىلدىكى باشقا تۈرلۈك ئازابلار بار"},{"number":59,"text":"(ئەگەشكۈچىلىرى بىلەن دوزاخقا كىرگەن چاغدا، ئەگەشتۈرگۈچىلەرگە ئېيتىلىدۇ) «بۇ جامائە سىلەر بىلەن بىرگە كىرگۈچىدۇر». (ئەگەشتۈرگۈچىلەر ئېيتىدۇ) «ئۇلار قارشى ئېلىنمايدۇ، ئۇلار چوقۇم (بىزگە ئوخشاش) ئازابنى تېتىغۇچىدۇر»"},{"number":60,"text":"ئەگەشكۈچىلەر ئېيتىدۇ: «بەلكى سىلەر قارشى ئېلىنمايسىلەر، سىلەر ئازابنى بىزگە ئېلىپ كەلدىڭلار (يەنى بىزنى ئازدۇرۇپ دوزاخقا كىرىشىمىزگە سەۋەبچى بولدۇڭلار)، بۇ نېمىدېگەن يامان جاي!»"},{"number":61,"text":"ئۇلار (يەنى ئەگەشكۈچىلەر): «پەرۋەردىگارىمىز! بىزگە بۇ ئازابنى ئېلىپ كەلگەن ئادەمگە دوزاخ ئازابىنى ئىككى ھەسسە زىيادە قىلغىن» دەيدۇ"},{"number":62,"text":"ئۇلار (يەنى كاپىرلارنىڭ كاتتىباشلىرى) ئېيتىدۇ: «بىز (دۇنيادىكى چاغدا) يامانلاردىن ھېسابلايدىغان ئادەملەرنى (يەنى مۆمىنلەرنى) (دوزاختا) كۆرمەيمىزغۇ؟"},{"number":63,"text":"ئۇلارنى بىز (دۇنيادىكى چاغدا) مەسخىرە قىلاتتۇقمۇ؟ ياكى ئۇلاردىن كۆزلەر ئېغىپ كەتتىمۇ؟ (يەنى ياكى ئۇلار دوزاختا بىز بىلەن بىللە تۇرسىمۇ كۆرمەيۋاتامدۇق؟)»"},{"number":64,"text":"ئەھلى دوزاخنىڭ بۇ رەۋىشتە ئۆزئارا جاڭجاللىشىشى چوقۇمدۇر"},{"number":65,"text":"(ئى مۇھەممەد! مەككە كاپىرلىرىغا) ئېيتقىنكى، «مەن پەقەت بىر ئاگاھلاندۇرغۇچىمەن، غالىب بىر اﷲ تىن باشقا ھېچ ئىلاھ يوقتۇر"},{"number":66,"text":"(ئۇ اﷲ) ئاسمانلارنىڭ، زېمىننىڭ ۋە ئۇلارنىڭ ئارىسىدىكى شەيئىلەرنىڭ پەرۋەردىگارىدۇر، غالىبتۇر. (ئۆزى خالىغان بەندىلەرنى) ناھايىتى مەغپىرەت قىلغۇچىدۇر»"},{"number":67,"text":"(ئۇلارغا) ئېيتقىنكى، «ئۇ (يەنى اﷲ نىڭ بىرلىكىگە دەۋەت قىلغۇچى پەيغەمبەر ئىكەنلىكىم) چوڭ خەۋەردۇر"},{"number":68,"text":"سىلەر ئۇنىڭدىن يۈز ئۆرۈيسىلەر"},{"number":69,"text":"پەرىشتىلەر (ئادەم ئەلەيھىسسالام توغرىسىدا) مۇنازىرىلىشىۋاتقان چاغدا، مەن ئۇلارنىڭ ئەھۋالىنى بىلمەيتتىم"},{"number":70,"text":"ماڭا پەقەت ۋەھيى قىلىنىدۇكى، مەن روشەن بىر ئاگاھلاندۇرغۇچىمەن»"},{"number":71,"text":"ئۆز ۋاقتىدا پەرۋەردىگارىڭ پەرىشتىلەرگە ئېيتتى: «مەن ھەقىقەتەن لايدىن بىر ئادەم يارىتىمەن"},{"number":72,"text":"ئۇنى مەن راۋۇرۇس ياراتقان (يەنى ئۇنى يارىتىپ سۈرەتكە كىرگۈزۈپ، ئەزالىرىنى تولۇق، مۇكەممەل ئىنسان ھالىتىگە كەلتۈرگەن) ۋە ئۇنىڭغا جان كىرگۈزگەن ۋاقتىمدا ئۇنىڭغا سەجدە قىلىڭلار»"},{"number":73,"text":"پەرىشتىلەرنىڭ بىرىمۇ قالماي، ھەممىسى (ئادەم ئەلەيھىسسالامغا) سەجدە قىلدى"},{"number":74,"text":"پەقەت ئىبلىسلا بويۇنتاۋلىق قىلدى، ئۇ كاپىرلاردىن بولۇپ كەتتى"},{"number":75,"text":"اﷲ ئېيتتى: «ئى ئىبلىس! مەن ئۆز قولۇم بىلەن ياراتقان ئىنسانغا سەجدە قىلىشتىن ساڭا نېمە توسقۇنلۇق قىلدى (ئۇنىڭغا سەجدە قىلماسلىقىڭ تەكەببۇرلۇق قىلغانلىقىڭدىنمۇ؟ ياكى يۇقىرى مەرتىۋىلىكلەردىن بولغانلىقىڭدىنمۇ؟»)"},{"number":76,"text":"ئىبلىس: «مەن ئۇنىڭدىن ئارتۇق، مېنى ئوتتىن ياراتتىڭ، ئۇنى لايدىن ياراتتىڭ» دېدى"},{"number":77,"text":"اﷲ: «سەن جەننەتتىن يوقال! سەن ھەقىقەتەن قوغلاندى بولدۇڭ، ساڭا ھەقىقەتەن قىيامەتكىچە مېنىڭ لەنىتىم بولسۇن» دېدى"},{"number":78,"text":"اﷲ: «سەن جەننەتتىن يوقال! سەن ھەقىقەتەن قوغلاندى بولدۇڭ، ساڭا ھەقىقەتەن قىيامەتكىچە مېنىڭ لەنىتىم بولسۇن» دېدى"},{"number":79,"text":"ئىبلىس: «پەرۋەردىگارىم! ماڭا (خالايىق) تىرىلدۈرۈلىدىغان كۈن (يەنى قىيامەت) گىچە مۆھلەت بەرسەڭ (يەنى مېنى ھايات قالدۇرساڭ)» دېدى"},{"number":80,"text":"اﷲ: «جەزمەن ساڭا مەلۇم ۋاقىتقىچە مۆھلەت بېرىلىدۇ» دېدى"},{"number":81,"text":"اﷲ: «جەزمەن ساڭا مەلۇم ۋاقىتقىچە مۆھلەت بېرىلىدۇ» دېدى"},{"number":82,"text":"ئىبلىس ئېيتتى: «ئىززىتىڭ بىلەن قەسەمكى، ئۇلارنىڭ ھەممىسىنى چوقۇم ئازدۇرىمەن"},{"number":83,"text":"ئۇلاردىن پەقەت تاللانغان بەندىلىرىڭلا بۇنىڭدىن مۇستەسنا (يەنى ئۇلارنى ئازدۇرالمايمەن)»"},{"number":84,"text":"اﷲ ئېيتتى: «مېنىڭ سۆزۈم ھەقتۇر، مەن ھەقنى سۆزلەيمەن"},{"number":85,"text":"سەن بىلەن ۋە ئۇلاردىن ساڭا ئەگەشكەنلەرنىڭ ھەممىسى بىلەن چوقۇم جەھەننەمنى توشقۇزىمەن»"},{"number":86,"text":"ئېيتقىنكى، «(اﷲ تەرىپىدىن كەلگەن ۋەھيىنى) تەبلىغ قىلغانلىقىمغا سىلەردىن ھېچ ھەق تەلەپ قىلمايمەن، مەن (قۇرئاننى) ئىپتىرا قىلغۇچىلاردىن (يەنى يالغاندىن توقۇغۇچىلاردىن) ئەمەسمەن"},{"number":87,"text":"قۇرئان پەقەت جاھان ئەھلى ئۈچۈن ۋەز - نەسىھەتتۇر"},{"number":88,"text":"بىر مۇددەتتىن كېيىن ئۇنىڭ راستلىقىنى چوقۇم بىلىسىلەر»"}]}