{"number":51,"edition":"ug.saleh","ayahs":[{"number":1,"text":"(تۇپراقنى) سورىغۇچى شاماللار بىلەن قەسەمكى،"},{"number":2,"text":"(يامغۇرلارنىڭ) ئېغىرلىقىنى كۆتۈرگۈچى بۇلۇتلار بىلەن قەسەمكى،"},{"number":3,"text":"(سۇ ئۈستىدە) يىنىك ماڭغۇچى كېمىلەر بىلەن قەسەمكى،"},{"number":4,"text":"ئىشنى (يەنى بەندىلەر ئارىسىدا رىزىقلارنى، يۇرتلار ئارىسىدا يامغۇرلارنى) تەقسىم قىلغۇچى پەرىشتىلەر قەسەمكى،"},{"number":5,"text":"سىلەرگە ۋەدە قىلىنغان (ساۋاب، ئازاب، قىيامەت قاتارلىق) لار ئەلۋەتتە راستتۇر"},{"number":6,"text":"(ياخشى ئەمەللەرنى) مۇكاپاتلاش، (يامان ئەمەللەرنى) جازالاش چوقۇم بولىدىغان ئىشتۇر"},{"number":7,"text":"يوللىرى بار ئاسمان بىلەن قەسەمكى، (پەيغەمبەر ھەققىدە) سىلەرنىڭ سۆزۈڭلار ھەقىقەتەن خىلمۇخىلدۇر"},{"number":8,"text":"يوللىرى بار ئاسمان بىلەن قەسەمكى، (پەيغەمبەر ھەققىدە) سىلەرنىڭ سۆزۈڭلار ھەقىقەتەن خىلمۇخىلدۇر"},{"number":9,"text":"(اﷲ تائالانىڭ ئىلمىي ئەزەلىسىدە ھىدايەتتىن) بۇرۇۋېتىلگەن ئادەم (قۇرئانغا ۋە مۇھەممەد ئەلەيھىسسالامغا ئىمان كەلتۈرۈشتىن) بۇرۇۋېتىلىدۇ"},{"number":10,"text":"كاززاپلارغا لەنەت بولسۇنكى، ئۇلار جاھالەتكە چۆمگەن بولۇپ (ئاخىرەت ئىشىدىن) غەپلەتتىدۇر"},{"number":11,"text":"كاززاپلارغا لەنەت بولسۇنكى، ئۇلار جاھالەتكە چۆمگەن بولۇپ (ئاخىرەت ئىشىدىن) غەپلەتتىدۇر"},{"number":12,"text":"ئۇلار رەسۇلۇللاھتىن: «قىيامەت قاچان بولىدۇ؟» دەپ سورايدۇ"},{"number":13,"text":"ئۇ بولسا ئۇ كۈندە دوزاختا ئازابلىنىدىغان كۈندۇر"},{"number":14,"text":"(دوزاخقا مۇئەككەل پەرىشتىلەر ئۇلارغا) «سىلەرگە قىلىنغان ئازابنى تېتىڭلار، مانا بۇ سىلەر (دۇنيادىكى چېغىڭلاردا) ئالدىراتقان نەرسىدۇر» (دەيدۇ)"},{"number":15,"text":"شۈبھىسىزكى، تەقۋادارلار جەننەتلەردە ۋە (ئېقىپ تۇرغان) بۇلاقلارنىڭ ئارىسىدا بولىدۇ"},{"number":16,"text":"ئۇلار پەرۋەردىگارى ئاتا قىلغان نەرسىلەرنى قوبۇل قىلىدۇ، ئۇلار بۇنىڭدىن ئىلگىرى (يەنى دۇنيادىكى چاغدا) ياخشى ئىش قىلغۇچىلار ئىدى"},{"number":17,"text":"ئۇلار كېچىسى ئاز ئۇخلايتتى"},{"number":18,"text":"ئۇلار سەھەرلەردە (پەرۋەردىگارىدىن) مەغپىرەت تىلەيتتى"},{"number":19,"text":"ئۇلارنىڭ پۇل - ماللىرىدا سائىللار ۋە (ئىپپەتلىكىدىن سائىللىق قىلمايدىغان) موھتاجلار ھوقۇققا ئىگە ئىدى (يەنى ئۇلار سائىللارغا ۋە موھتاجلارغا سەدىقە قىلاتتى)"},{"number":20,"text":"(زېمىندا ۋە ئۆزۈڭلاردا اﷲ قا چىن ئېتىقاد قىلىدىغانلار ئۈچۈن) اﷲ نىڭ قۇدرىتىنى ۋە بىرلىكىنى كۆرسىتىدىغان) نۇرغۇن ئالامەتلەر بار، (بۇنى) كۆرمەمسىلەر"},{"number":21,"text":"(زېمىندا ۋە ئۆزۈڭلاردا اﷲ قا چىن ئېتىقاد قىلىدىغانلار ئۈچۈن) اﷲ نىڭ قۇدرىتىنى ۋە بىرلىكىنى كۆرسىتىدىغان) نۇرغۇن ئالامەتلەر بار، (بۇنى) كۆرمەمسىلەر"},{"number":22,"text":"ئاسماندا سىلەرنىڭ رىزقىڭلار بار، سىلەرگە ۋەدە قىلىنغان ساۋاب بار"},{"number":23,"text":"ئاسماننىڭ ۋە زېمىننىڭ پەرۋەردىگارى بىلەن قەسەمكى، سىلەرگە ۋەدە قىلىنغان نەرسە ئۆزۈڭلارنىڭ سۆزلەۋاتقىنىڭلاردەك (يەنى سۆزلىشىڭلارنىڭ ئۆزۈڭلارغا ئېنىق بولغىنىدەك) ھەقتۇر"},{"number":24,"text":"(ئى مۇھەممەد!) ساڭا ئىبراھىمنىڭ ھۆرمەتلىك مېھمانلىرىنىڭ خەۋىرى يەتتىمۇ؟"},{"number":25,"text":"ئۆز ۋاقتىدا ئۇلار ئىبراھىمنىڭ يېنىغا كىرىپ سالام دېدى، ئىبراھىم سالامنى ئىلىك ئالدى. (ئىچىدە) «ناتونۇش ئادەملەرغۇ» دېدى"},{"number":26,"text":"شۇنىڭ بىلەن ئۇ ئاستا ئائىلىسىگە چىقىپ (پىشۇرۇلغان) بىر سېمىز موزاينى ئېلىپ كىرىپ ئۇلارنىڭ ئالدىغا قويۇپ: «يېمەمسىلەر» دېدى"},{"number":27,"text":"شۇنىڭ بىلەن ئۇ ئاستا ئائىلىسىگە چىقىپ (پىشۇرۇلغان) بىر سېمىز موزاينى ئېلىپ كىرىپ ئۇلارنىڭ ئالدىغا قويۇپ: «يېمەمسىلەر» دېدى"},{"number":28,"text":"(ئۇلارنىڭ تاماق يېمىگەنلىكىنى كۆرۈپ) دىلىدا ئۇلاردىن قورقتى، ئۇلار «قورقمىغىن (بىز پەرۋەردىگارىڭنىڭ ئەلچىلىرىمىز)» دېدى، ئۇلار ئىبراھىمغا بىلىملىك بىر ئوغۇل بىلەن خۇش خەۋەر بەردى"},{"number":29,"text":"ئىبراھىمنىڭ ئايالى سۈرەن سېلىپ كېلىپ (ئەجەبلەنگەنلكىدىن ئۆزىنىڭ) يۈزىنى كاچاتلاپ: «مەن تۇغماس موماي تۇرسام (قانداق تۇغىمەن؟)» دېدى"},{"number":30,"text":"ئۇلار: «پەرۋەردىگارىڭ شۇنداق دېدى. ئۇ ھەقىقەتەن ھېكمەت بىلەن ئىش قىلغۇچىدۇر، ھەممىنى بىلگۈچىدۇر» دېدى"},{"number":31,"text":"ئىبراھىم: «ئى ئەلچىلەر! سىلەر نېمە ئىش بىلەن ئەۋەتىلدىڭلار» دېدى"},{"number":32,"text":"ئۇلار: «بىز ھەقىقەتەن بىر گۇناھكار قەۋمنى (ھالاك قىلىش ئۈچۈن) ئەۋەتىلدۇق (يەنى لۇت قەۋمىنىڭ ئۈستىگە لايدىن پىشۇرۇلغان تاش ياغدۇرۇش ئۈچۈن ئەۋەتىلدۇق)"},{"number":33,"text":"ئۇلارنىڭ ئۈستىگە پەرۋەردىگارىڭنىڭ دەرگاھىدا (گۇناھى) ھەددىدىن ئاشقۇچىلار ئۈچۈن بەلگە قويۇلغان (يەنى ھالاك قىلىنغۇچىنىڭ ئىسمى يېزىلغان)، لايدىن پىشۇرۇلغان تاش ياغدۇرىمىز»"},{"number":34,"text":"ئۇلارنىڭ ئۈستىگە پەرۋەردىگارىڭنىڭ دەرگاھىدا (گۇناھى) ھەددىدىن ئاشقۇچىلار ئۈچۈن بەلگە قويۇلغان (يەنى ھالاك قىلىنغۇچىنىڭ ئىسمى يېزىلغان)، لايدىن پىشۇرۇلغان تاش ياغدۇرىمىز»"},{"number":35,"text":"(ھالاك بولمىسۇن دەپ لۇتنىڭ) شەھىرىدىكى مۆمىنلەرنى (سىرتقا) چىقىرىۋەتتۇق"},{"number":36,"text":"بىز ئۇ شەھەردىن مۇسۇلمانلاردىن پەقەت بىر ئائىلىنىلا تاپتۇق"},{"number":37,"text":"ئۇ شەھەردە قاتتىق ئازابتىن قورقىدىغانلار ئۈچۈن نىشان قالدۇردۇق"},{"number":38,"text":"مۇسانىڭ (قىسسىسىدىمۇ) بىر تۈرلۈك ئالامەت بار، ئۆز ۋاقتىدا ئۇنى بىز پىرئەۋنگە روشەن دەلىل بىلەن ئەۋەتتۇق"},{"number":39,"text":"پىرئەۋن ئۆز قوشۇنى بىلەن (ئىماندىن) يۈز ئۆرىدى، ئۇ: «(مۇسا) سېھىرگەردۇر ياكى مەجنۇندۇر» دېدى"},{"number":40,"text":"پىرئەۋننى ۋە ئۇنىڭ قوشۇنىنى جازالىدۇق، ئۇلارنى دېڭىزغا تاشلىدۇق، پىرئەۋن ئەيىبلەنگۈچىدۇر"},{"number":41,"text":"ئادنىڭ (قىسسىسىدىمۇ) بىر تۈرلۈك ئالامەت بار، ئۆز ۋاقتىدا ئۇلارغا يامان بوراننى ئەۋەتتۇق"},{"number":42,"text":"ئۇ (يەنى بوران) ھەر قانداق نەرسىنىڭ يېنىدىن ئۆتسە، ئۇنى چىرىگەن سۆڭەكتەك (تىتما - تالاڭ) قىلىۋېتەتتى"},{"number":43,"text":"سەمۇدنىڭ (قىسسىسىدىمۇ) بىر تۈرلۈك ئالامەت بار، ئۆز ۋاقتىدا ئۇلارغا: «سىلەر ۋاقىتلىق پايدىلىنىڭلار» دېدۇق"},{"number":44,"text":"ئۇلار پەرۋەردىگارىنىڭ ئەمرىگە قارشى چىقتى، ئۇلارنى چاقماق ھالاك قىلدى، ھالبۇكى، ئۇلار (ئازابنىڭ چۈشۈۋاتقانلىقىنى) كۆزلىرى بىلەن كۆرۈپ تۇراتتى"},{"number":45,"text":"ئۇلار (ئازاب چۈشكەن ۋاقىتتا) ئورۇنلىرىدىن تۇرۇشقىمۇ، ئۆزلىرىنى قوغداشقىمۇ قادىر بولالمىدى"},{"number":46,"text":"ئىلگىرى نۇھنىڭ قەۋمىنى ھالاك قىلدۇق، ئۇلار ھەقىقەتەن پاسىق قەۋم ئىدى"},{"number":47,"text":"ئاسماننى قۇدرەت بىلەن بەرپا قىلدۇق، بىز ھەقىقەتەن قۇدرەتلىكمىز"},{"number":48,"text":"زېمىننى يايدۇق، بىز نېمىدېگەن ياخشى يايغۇچىمىز؟"},{"number":49,"text":"سىلەر ئىبرەت ئېلىشىڭلار ئۈچۈن ھەر بىر نەرسىنى جۈپ ياراتتۇق"},{"number":50,"text":"(ئى مۇھەممەد!) ئېيتقىنكى، «اﷲ تەرەپكە قېچىڭلار (يەنى اﷲ قا ئىلتىجا قىلىڭلار)، مەن ھەقىقەتەن سىلەرگە اﷲ تەرىپىدىن (كەلگەن) ئوچۇق ئاگاھلاندۇرغۇچىمەن"},{"number":51,"text":"سىلەر باشقا مەبۇدنى اﷲ قا شېرىك قىلماڭلار، مەن ھەقىقەتەن ئۇنىڭ تەرىپىدىن (كەلگەن) ئوچۇق ئاگاھلاندۇرغۇچىمەن»"},{"number":52,"text":"ئۇلاردىن ئىلگىرىكى ئۈممەتلەرمۇ شۇنداق ئىدى، ئۇلارغا ھەر پەيغەمبەر كەلسىلا ئۇلار (ئۇنى): «بىر سېھرىگەر ياكى بىر مەجنۇن» دېدى"},{"number":53,"text":"ئۇلار (پەيغەمبەرلەرنى ئىنكار قىلىشنى) بىر - بىرىگە تەۋسىيە قىلىشقانمۇ؟ ھەرگىز ئۇنداق ئەمەس (يەنى ئۇلار بىر - بىرىگە ئۇنداق تەۋسىيە قىلىشقان ئەمەس) ئۇلار ھەددىدىن ئاشقۇچى قەۋمدۇر"},{"number":54,"text":"ئۇلاردىن يۈز ئۆرۈگىن، سەن مالامەت قىلىنغۇچى ئەمەسسەن"},{"number":55,"text":"ۋەز - نەسىھەت قىلغىن، ۋەز - نەسىھەت مۆمىنلەرگە پايدىلىق"},{"number":56,"text":"جىنلارنى، ئىنسانلارنى پەقەت ماڭا ئىبادەت قىلىش ئۈچۈنلا ياراتتىم"},{"number":57,"text":"ئۇلاردىن مەن رىزىق تىلىمەيمەن ۋە ئۇلارنىڭ مېنى ئوزۇقلاندۇرۇشىنى تىلىمەيمەن"},{"number":58,"text":"اﷲ ھەقىقەتەن ھەممىگە رىزىق بەرگۈچىدۇر، قۇدرەتلىكتۇر، (اﷲ نىڭ) قۇۋۋىتى ئارتۇقتۇر"},{"number":59,"text":"(ئۆزلىرىگە) زۇلۇم قىلغانلاردىن (ئازابتىن) ئۆتكەنكى (ھالاك بولغان) دوستلىرىنىڭ نېسىۋىسىدەك نېسىۋىسى بولىدۇ، بۇلار (ئازابىمغا) ئالدىراتمىسۇن"},{"number":60,"text":"كاپىرلارغا ۋەدە قىلىنغان كۈندىن كاپىرلارغا ۋاي"}]}