{"number":54,"edition":"ug.saleh","ayahs":[{"number":1,"text":"قىيامەت يېقىنلاشتى، ئاي يېرىلدى"},{"number":2,"text":"(قۇرەيش كۇففارلىرى) بىرەر مۆجىزىنى كۆرسىلا (ئىماندىن) يۈز ئۆرۈپ، بۇ «داۋاملاشقۇچى سېھىردۇر» دېيىشىدۇ"},{"number":3,"text":"ئۇلار (پەيغەمبەر ئەلەيھىسسالامنى) ئىنكار قىلدى، نەپسى خاھىشلىرىغا ئەگەشتى، (ياخشىلىقتىن يا يامانلىقتىن بولسۇن) ھەر ئىش (شۇ ئىشنىڭ ئەھلىنى جەننەتكە يا دوزاخقا) ئورۇنلاشتۇرغۇچىدۇر"},{"number":4,"text":"ئۇلار ھەقىقەتەن (قۇرئان) خەۋەرلىرىدىن ئىبرەت ئېلىنىدىغان مىقداردا نەرسە كەلدى"},{"number":5,"text":"مۇكەممەل ھېكمەت كەلدى، (اﷲ ئۇلارنى شەقى قىلغانلىقى ئۈچۈن) ئۇلارغا ئاگاھلاندۇرۇشلارنىڭ پايدىسى بولمايدۇ"},{"number":6,"text":"ئۇلاردىن يۈز ئۆرۈگىن، ئۇ كۈندە چاقىرغۇچى (يەنى ئىسراپىل) قىيىن ئىشقا (يەنى ھېسابقا) چاقىرىدۇ (يەنى سۇر چالىدۇ)"},{"number":7,"text":"ئۇلار (قورقۇنچتىن) تىكىلىپ قارىيالمىغان ھالدا گويا تارىلىپ كەتكەن چېكەتكىدەك، قەبرىلىرىدىن چىقىپ كېلىدۇ"},{"number":8,"text":"ئۇلار چاقىرغۇچىنىڭ ئالدىغا بويۇنلىرىنى سوزغان ھالدا يۈگرەيدۇ، كاپىرلار: «بۇ قىيىن كۈندۇر» دەيدۇ"},{"number":9,"text":"ئۇلاردىن بۇرۇن نۇھنىڭ قەۋمى ئىنكار قىلدى، ئۇلار بەندىمىزنى (يەنى نۇھنى) ئىنكار قىلىپ، مەجنۇن دېدى. ئۇ (دىنغا دەۋەت قىلىشتىن) ھەيۋە بىلەن مەنئى قىلىندى"},{"number":10,"text":"ئۇ پەرۋەردىگارىڭغا: «ھەقىقەتەن مەن بوزەك قىلىندىم، ياردەم قىلغىن» دەپ دۇئا قىلدى"},{"number":11,"text":"ئاسماننىڭ دەرۋازىلىرىنى قويۇلۇپ ياغقۇچى يامغۇر بىلەن ئېچىۋەتتۇق"},{"number":12,"text":"زېمىندىن بۇلاقلارنى ئېتىلدۇرۇپ چىقاردۇق، (اﷲ تەقدىر قىلغان ئۇلارنى غەرق قىلىپ ھالاك قىلىش) ئىشىغا بىنائەن، يامغۇر سۈيى بىلەن بۇلاق سۈيى (بىر - بىرىگە) قوشۇلدى"},{"number":13,"text":"نۇھنى تاختا ۋە مىخلار بىلەن ياسالغان كېمىگە سالدۇق"},{"number":14,"text":"كېمە بىزنىڭ ھىمايىمىز ئاستىدا ماڭاتتى، ئىنكار قىلىنغاننى (يەنى نۇھنى) مۇكاپاتلاش ئۈچۈن (نۇھنىڭ قەۋمىنى غەرق قىلدۇق)"},{"number":15,"text":"ئۇنى (يەنى توپان بالاسىنى) ئىبرەت قىلىپ قالدۇردۇق، ئىبرەت ئالغۇچى بارمۇ؟"},{"number":16,"text":"مېنىڭ ئازابىم ۋە ئاگاھلاندۇرۇشلىرىم قانداق ئىكەن"},{"number":17,"text":"ھەقىقەتەن بىز قۇرئاننى ھىپزى ئۈچۈن ئاسان قىلدۇق، ئىبرەت ئالغۇچى بارمۇ؟"},{"number":18,"text":"ئاد قەۋمى (پەيغەمبىرى ھۇدنى) ئىنكار قىلدى، مېنىڭ ئازابىم ۋە ئاگاھلاندۇرۇشلىرىم قانداق ئىكەن"},{"number":19,"text":"شۈبھىسىزكى، ئۇلارنى بىز شۇملۇقى ئۈزۈلمەيدىغان شۇم كۈندە سوغۇق بوران ئەۋەتىپ (ھالاك قىلدۇق)، بوران كىشىلەرنى (ئورۇنلىرىدىن يۇلۇپ كېتەتتى، گويا ئۇلار قومۇرىۋېتىلگەن خورما كۆتەكلىرىدەك ياتاتتى)"},{"number":20,"text":"شۈبھىسىزكى، ئۇلارنى بىز شۇملۇقى ئۈزۈلمەيدىغان شۇم كۈندە سوغۇق بوران ئەۋەتىپ (ھالاك قىلدۇق)، بوران كىشىلەرنى (ئورۇنلىرىدىن يۇلۇپ كېتەتتى، گويا ئۇلار قومۇرىۋېتىلگەن خورما كۆتەكلىرىدەك ياتاتتى)"},{"number":21,"text":"مېنىڭ ئازابىم ۋە ئاگاھلاندۇرۇشلىرىم قانداق ئىكەن"},{"number":22,"text":"بىز ھەقىقەتەن قۇرئاننى ھىپزى ئۈچۈن ئاسان قىلدۇق، ئىبرەت ئالغۇچى بارمۇ؟"},{"number":23,"text":"سەمۇد ئاگاھلاندۇرغۇچىلارنى (يەنى پەيغەمبەرلەرنى) يالغانغا چىقاردى"},{"number":24,"text":"ئۇلار ئېيتتى: «ئارىمىزدىكى (بىزگە ئوخشاش) بىر ئادەمگە ئەگىشەمدۇق؟ (ئۇنداق قىلساق) ئۇ چاغدا بىز ھەقىقەتەن گۇمراھلىققا ۋە ساراڭلىققا مۇپتىلا بولىمىز"},{"number":25,"text":"ئارىمىزدىن ئۇنىڭغا ۋەھيى نازىل قىلىندىمۇ؟ ھەرگىز ئۇنداق ئەمەس، ئۇ يالغانچىدۇر، مۇتەكەببىردۇر»"},{"number":26,"text":"ئۇلار ئەتە (يەنى ئاخىرەتتە) كىمنىڭ يالغانچى، مۇتەكەببىر ئىكەنلىكىنى بىلىدۇ"},{"number":27,"text":"بىز ھەقىقەتەن سىناش ئۈچۈن ئۇلارغا چىشى تۆگىنى ئەۋەتىمىز، (ئى سالىھ) ئۇلارنى (ئۇلارنىڭ نېمە قىلارىنى) كۈتكىن، (ئۇلارنىڭ ئەزىيەتلىرىگە) سەۋر قىلغىن"},{"number":28,"text":"سۇنىڭ ئۇلار بىلەن تۆگىنىڭ ئارىسىدا بۆلۈنگەنلىكىنى، قايسىسىنىڭ نۆۋىتى كەلسە شۇنىڭ ھازىر بولىدىغانلىقىنى ئۇلارغا ئۇقتۇرۇپ قويغىن"},{"number":29,"text":"ئۇلار بۇرادىرىنى (تۆگىنى ئۆلتۈرۈشكە) چاقىردى. ئۇ قىلىچنى ئېلىپ تۆگىنى بوغۇزلىدى"},{"number":30,"text":"مېنىڭ ئازابىم ۋە ئاگاھلاندۇرۇشلىرىم قانداق ئىكەن"},{"number":31,"text":"شۈبھىسىزكى، بىز ئۇلارغا قاتتىق بىر ئاۋازنى ئەۋەتىپ (ھالاك قىلىش بىلەن) ئۇلارنى قوتان ياسىغۇچىنىڭ تاشلاندۇق شاخ - شۇمبىلىرىدەك قىلىۋەتتۇق"},{"number":32,"text":"بىز ھەقىقەتەن قۇرئاننى ھىپزى ئۈچۈن ئاسان قىلدۇق، ئىبرەت ئالغۇچى بارمۇ؟"},{"number":33,"text":"لۇتنىڭ قەۋمى ئاگاھلاندۇرۇشلارغا چىنپۈتمىدى"},{"number":34,"text":"بىز ھەقىقەتەن ئۇلارنى تاش ياغدۇرۇپ (ھالاك قىلدۇق)، پەقەت لۇتنىڭ تەۋەلىرى بۇنىڭ سىرتىدىدۇر. ئۇلارنى نېمىتىمىز يۈزىسىدىن سەھەردە قۇتۇلدۇردۇق، شۈكۈر قىلغۇچىنى بىز مۇشۇنداق مۇكاپاتلايمىز"},{"number":35,"text":"بىز ھەقىقەتەن ئۇلارنى تاش ياغدۇرۇپ (ھالاك قىلدۇق)، پەقەت لۇتنىڭ تەۋەلىرى بۇنىڭ سىرتىدىدۇر. ئۇلارنى نېمىتىمىز يۈزىسىدىن سەھەردە قۇتۇلدۇردۇق، شۈكۈر قىلغۇچىنى بىز مۇشۇنداق مۇكاپاتلايمىز"},{"number":36,"text":"شۈبھىسىزكى، لۇت ئۇلارنى بىزنىڭ جازالىشىمىزدىن ئاگاھلاندۇردى، ئۇلار ئاگاھلاندۇرۇشلاردىن شەكلەندى"},{"number":37,"text":"ئۇلار لۇتتىن مېھمانلىرىنى (يەنى ئادەمزات شەكلىدە كەلگەن پەرىشتىلەرنى) (ئۇلار بىلەن لىۋاتە قىلىش ئۈچۈن) قوغدىماسلىقنى سورىدى. ئۇلارنىڭ كۆزلىرىنى كور قىلىۋەتتۇق، (ئۇلارغا) «ئازابىمنى ۋە ئاگاھلاندۇرۇشلىرىمنى تېتىڭلار» (دېدۇق)"},{"number":38,"text":"ھەقىقەتەن ئۇلارغا ئەتىگەندە دائىمىي (يەنى ئاخىرەتنىڭ ئازابىغا ئۇلىنىپ كېتىدىغان) ئازاب نازىل بولدى"},{"number":39,"text":"(ئۇلارغا): «مېنىڭ ئازابىمنى ۋە ئاگاھلاندۇرۇشلىرىمنى تېتىڭلار» (دېيىلدى)"},{"number":40,"text":"بىز ھەقىقەتەن قۇرئاننى ھىپزى ئۈچۈن ئاسان قىلدۇق، ئىبرەت ئالغۇچى بارمۇ؟"},{"number":41,"text":"شەك - شۈبھىسىزكى، پىرئەۋن جامائەسىگە ئاگاھلاندۇرۇشلار كەلدى"},{"number":42,"text":"ئۇلار بىزنىڭ پۈتۈن ئايەتلىرىمىزنى يالغانغا چىقاردى، ئۇلارنى غالىب، قۇدرەتلىك ھالەتتە تۇرۇپ ھالاك قىلدۇق"},{"number":43,"text":"(ئى ئەرەب جامائەسى!) ئۇلار (يەنى مەن ھالاك قىلغان ئۆتكەنكى ئۈممەتلەر) دىن سىلەرنىڭ كۇففارلىرىڭلار ئارتۇقمۇ؟ ياكى سىلەرگە ساماۋى كىتابلاردا (اﷲ نىڭ ئازابىدىن) كەچۈرۈم قىلىنىش بارمۇ؟"},{"number":44,"text":"ياكى ئۇلار «بىز (مۇھەممەد ئۈستىدىن) غالىب قەۋممىز» دەمدۇ؟"},{"number":45,"text":"(مۇشرىكلار) توپى مەغلۇپ قىلىنىدۇ، ئارقىغا قاراپ قاچىدۇ"},{"number":46,"text":"ھەرگىز ئۇنداق ئەمەس (يەنى ئۇلارغا بېرىلىدىغان ئازاب بۇلا ئەمەس)، قىيامەت ئۇلارغا (ئازاب قىلىنىش) ۋەدە قىلىنغان ۋاقىتتۇر، قىيامەت تېخىمۇ قىيىندۇر، تېخىمۇ جاپالىقتۇر"},{"number":47,"text":"گۇناھكارلار ھەقىقەتەن (دۇنيادا) گۇمراھلىقتىدۇر، (ئاخىرەتتە) دوزاختىدۇر"},{"number":48,"text":"ئۇلار دوزاختا دۈم ياتقۇزۇلۇپ سورىلىدىغان كۈندە، (ئۇلارغا) «دوزاخنىڭ ئازابىنى تېتىڭلار» (دېيىلىدۇ)"},{"number":49,"text":"بىز ھەقىقەتەن ھەممە نەرسىنى ئۆلچەملىك ياراتتۇق"},{"number":50,"text":"(بىرەر شەيئىنى ياراتماقچى بولساق) بىزنىڭ ئەمرىمىز پەقەت بىر سۆزدۇر، (ئۇ) كۆزنى يۇمۇپ ئاچقاننىڭ ئارىلىقىدا (ئورۇنلىنىدۇ)"},{"number":51,"text":"بىز ھەقىقەتەن (ئۆتكەنكى ئۈممەتلەردىن كۇفرىدا) سىلەرگە ئوخشاش بولغانلارنى ھالاك قىلدۇق، ئىبرەت ئالغۇچى بارمۇ؟"},{"number":52,"text":"ئۇلارنىڭ قىلغان (ياخشى ۋە يامان) ئىشلىرىنىڭ ھەممىسى نامە - ئەماللىرىدا مەۋجۇتتۇر"},{"number":53,"text":"كىچىك ئىش، چوڭ ئىشنىڭ ھەممىسى (لەۋھۇلمەھپۇزدا) خاتىرىلەنگەندۇر"},{"number":54,"text":"شۈبھىسىزكى، تەقۋادارلار جەننەتلەردە بولىدۇ، (سۇ، مەي، ھەسەل، سۈت) ئۆستەڭلىرىدىن بەھرىمەن بولىدۇ"},{"number":55,"text":"(ئۇلار) قۇدرەتلىك اﷲ نىڭ دەرگاھىدا كۆڭۈلدىكىدەك جايدا بولىدۇ"}]}