{"number":74,"edition":"ug.saleh","ayahs":[{"number":1,"text":"ئى (ۋەھيى نازىل بولغان چاغدا) كىيىمگە چۈمكىلىۋالغۇچى (پەيغەمبەر)"},{"number":2,"text":"تۇر! (ئىنسانلارنى) اﷲ ىڭ ئازابىدىن ئاگاھلاندۇر"},{"number":3,"text":"پەرۋەردىگارىڭنى ئۇلۇغلا"},{"number":4,"text":"كىيىمىڭنى پاك تۇت"},{"number":5,"text":"ئازابتىن (يەنى ئازابقا قالدۇرىدىغان ئىشلاردىن) يىراق بول"},{"number":6,"text":"كۆپ ئېلىش نىيىتىدە بەرمە (يەنى بىر كىشىگە بىرەر سوۋغا بەرسەڭ، ئۇنىڭدىن بەرگەن نەرسەڭدىن كۆپرەك نەرسە ئېلىشنى تەمە قىلما)،"},{"number":7,"text":"پەرۋەردىگارىڭنىڭ (رازىلىقى) ئۈچۈن (قەۋمىڭدىن يەتكەن ئەزىيەتكە) سەۋر قىل"},{"number":8,"text":"سۇر چېلىنغان ۋاقىت - ئۇ كۈن قىيىن كۈندۇر"},{"number":9,"text":"سۇر چېلىنغان ۋاقىت - ئۇ كۈن قىيىن كۈندۇر"},{"number":10,"text":"كاپىرلارغا ئاسان ئەمەستۇر"},{"number":11,"text":"(ئى مۇھەممەد!) مەن تەنھا ياراتقان كىشىنى (يەنى ۋەلىد ئىبن مۇغىرەنى) ماڭا قويۇۋەت"},{"number":12,"text":"ئۇنىڭغا نۇرغۇن مال بەردىم"},{"number":13,"text":"ئۇنىڭغا كۆز ئالدىدا تۇرىدىغان ئوغۇللارنى بەردىم"},{"number":14,"text":"ئۇنىڭ ئابرۇيىنى ئۆستۈردۈم"},{"number":15,"text":"ئاندىن ئۇ يەنە كۆپ بېرىشىمنى تەمە قىلىدۇ"},{"number":16,"text":"ياق، (يەنى ئۇنىڭ خالىغىنى بولمايدۇ)، چۈنكى ئۇ بىزنىڭ ئايەتلىرىمىزگە قارشى چىقتى"},{"number":17,"text":"ئۇنىڭغا قاتتىق ئازابىمنى تېتىتىمەن"},{"number":18,"text":"ئۇ (پەيغەمبەر ۋە قۇرئان ھەققىدە) ئويلاندى، (قۇرئان توغرۇلۇق نېمە دېيىشنى ۋە قانداق بوھتان قىلىشنى) پىلانلىدى"},{"number":19,"text":"لەنەت بولسۇنكى، ئۇ قانداق پىلانلىدى"},{"number":20,"text":"يەنە لەنەت بولسۇنكى، ئۇ قانداق پىلانلىدى"},{"number":21,"text":"ئاندىن ئۇ قارىدى،"},{"number":22,"text":"ئاندىن قوشۇمىسىنى تۈردى ۋە چىرايىنى پۈرۈشتۈردى،"},{"number":23,"text":"ئاندىن (ئىماندىن) يۈز ئۆرۈدى (پەيغەمبەرگە ئەگىشىشتىن) تەكەببۇرلۇق بىلەن باش تارتتى،"},{"number":24,"text":"«بۇ (كالامۇللاھ ئەمەس) پەقەت ئۆگىنىلگەن سېھىردۇر، بۇ پەقەت ئىنسان سۆزىدۇر» دېدى،"},{"number":25,"text":"«بۇ (كالامۇللاھ ئەمەس) پەقەت ئۆگىنىلگەن سېھىردۇر، بۇ پەقەت ئىنسان سۆزىدۇر» دېدى"},{"number":26,"text":"ئۇنى مەن سەقەرگە (يەنى دوزاخقا) سالىمەن"},{"number":27,"text":"سەقەرنىڭ نېمىلىكىنى قانداق بىلەلەيسەن؟"},{"number":28,"text":"ئۇ ھېچ نەرسىنى قالدۇرمايدۇ، قويمايدۇ (بەلكى كۆيدۈرۈپ تاشلايدۇ)"},{"number":29,"text":"ئۇ (چوڭلۇقىدىن) ئىنسانلارنىڭ (كۆزلىرىگە يىراق مۇساپىلەردىن) كۆرۈنۈپ تۇرىدۇ"},{"number":30,"text":"ئۇنىڭغا 19 پەرىشتە مۇئەككەلدۇر"},{"number":31,"text":"بىز دوزاخ مۇئەككەللىرىنى پەقەت پەرىشتىلەردىن قىلدۇق، بىز ئۇلارنىڭ سانى بىلەن پەقەت كاپىرلارنى سىنىدۇق، تاكى ئەھلى كىتاب (ئۆزلىرىنىڭ ساماۋى كىتابلىرىدىكى بۇ ساننى كۆرۈپ قۇرئاننىڭ ھەق ئىكەنلىكىگە) ئىمان ئېيتماي، مۆمىنلەرنىڭ (پەيغەمبەر ئەلەيھىسسالامنىڭ بەرگەن خەۋىرىگە ئىشەنگەنلىكلىرىدىن ۋە ئەھلى كىتابنىڭ قۇرئان خەۋەرلىرىنىڭ تەۋرات، ئىنجىلدىكى خەۋەرلەرگە ئۇيغۇن ئىكەنلىكىنى ئېتىراپ قىلغانلىقىدىن) ئىمانى كۈچەيگەي، ئەھلى كىتاب ۋە مۆمىنلەر (بۇنىڭدىن) شەكلەنمەيدۇ، دىللىرىدا كېسەل بارلار (يەنى مۇناپىقلار)، كاپىرلار: «بۇ مىسالدىن اﷲ نېمىنى ئىرادە قىلىدۇ» دەيدۇ، اﷲ مۇشۇنداق خالىغان ئادەمنى گۇمراھ قىلىدۇ، خالىغان ئادەمنى ھىدايەت قىلىدۇ، پەرۋەردىگارىڭنىڭ قوشۇنىنى (يەنى پەرىشتىلەرنىڭ سانىنىڭ كۆپلۈكىنى، ئۇلارنىڭ كۈچ - قۇۋۋىتىنى ۋە ئۇلارنىڭ يارىتىلىشتىكى چوڭلۇقىنى) پەقەت ئۇ ئۆزى بىلىدۇ، بۇ، (يەنى اﷲ بايان قىلغان دوزاخ) پەقەت ئىنسانلار ئۈچۈن ۋەز - نەسىھەتتۇر"},{"number":32,"text":"ياق (يەنى ئۇ مەسخىرە قىلغۇچىلار قەبىھ قىلمىشىدىن يانسۇن)، ئاي بىلەن قەسەمكى،"},{"number":33,"text":"ئۆتۈپ كەتكەن كېچە بىلەن قەسەمكى،"},{"number":34,"text":"يورۇغان سۈبھى بىلەن قەسەمكى،"},{"number":35,"text":"شۈبھىسىزكى، دوزاخ بالالاردىن بىرىدۇر (ئۇنى قانداقمۇ مەسخىرە قىلىسىلەر ۋە ئۇنىڭغا چىنپۈتمەيسىلەر؟)"},{"number":36,"text":"ئۇ ئىنسانلارنى ئاگاھلاندۇرغۇچىدۇر"},{"number":37,"text":"سىلەردىن (جەننەتكە) ئىلگىرىلەشنى خالىغان ياكى (دوزاختىن) چېكىنىشنى خالىغان ئادەمنى ئاگاھلاندۇرغۇچىدۇر"},{"number":38,"text":"ھەر ئىنسان قىلمىشلىرى تۈپەيلىدىن (دوزاختا) مەھبۇستۇر"},{"number":39,"text":"پەقەت ئەسھابى يەمىن (يەنى سائادەتمەن مۆمىنلەر) بۇنىڭدىن مۇستەسنا"},{"number":40,"text":"ئۇلار جەننەتلەردە بولۇپ، گۇناھكارلاردىن: «سىلەرنى دوزاخقا كىرگۈزگەن نېمە؟» دەپ سورايدۇ"},{"number":41,"text":"ئۇلار جەننەتلەردە بولۇپ، گۇناھكارلاردىن: «سىلەرنى دوزاخقا كىرگۈزگەن نېمە؟» دەپ سورايدۇ"},{"number":42,"text":"ئۇلار جەننەتلەردە بولۇپ، گۇناھكارلاردىن: «سىلەرنى دوزاخقا كىرگۈزگەن نېمە؟» دەپ سورايدۇ"},{"number":43,"text":"ئۇلار (جاۋابەن) ئېيتىدۇ: «بىز ناماز ئوقۇمىدۇق"},{"number":44,"text":"مىسكىنلەرگە تائام بەرمىدۇق"},{"number":45,"text":"بىز بىھۇدە سۆز قىلغۇچىلار بىلەن بىللە بىھودە سۆز قىلاتتۇق"},{"number":46,"text":"قىيامەت كۈنىنى ئىنكار قىلاتتۇق،"},{"number":47,"text":"تاكى بىز ئۆلگۈچە (شۇنداق قىلدۇق)»"},{"number":48,"text":"شاپائەت قىلغۇچىلارنىڭ شاپائىتى ئۇلارغا پايدا بەرمەيدۇ (يەنى ئۇلارنى اﷲ نىڭ ئازابىدىن قۇتقۇزىدىغان شاپائەتچى بولمايدۇ، ئۇلارغا پۈتۈن ئەھلى زېمىن شاپائەت قىلغان تەقدىردىمۇ، ئۇلارنىڭ شاپائىتى قوبۇل قىلىنمايدۇ)"},{"number":49,"text":"ئۇلار نېمىشقا ۋەز (يەنى قۇرئان) دىن يۈز ئۆرۈيدۇ"},{"number":50,"text":"گويا ئۇلار يولۋاستىن قاچقان ياۋايى ئېشەكلەردۇر (يەنى بۇ مۇشرىكلار مۇھەممەد ئەلەيھىسسالامنى كۆرگەندە، ئۇنىڭدىن خۇددى يولۋاسنى كۆرۈپ قاچقان ياۋا ئېشەكلەردەك قاچىدۇ)"},{"number":51,"text":"گويا ئۇلار يولۋاستىن قاچقان ياۋايى ئېشەكلەردۇر (يەنى بۇ مۇشرىكلار مۇھەممەد ئەلەيھىسسالامنى كۆرگەندە، ئۇنىڭدىن خۇددى يولۋاسنى كۆرۈپ قاچقان ياۋا ئېشەكلەردەك قاچىدۇ)"},{"number":52,"text":"بەلكى ئۇلاردىن ھەر كىشى ئۆزىگە ئوچۇق سەھىپىلەر بېرىلىشىنى خالايدۇ (يەنى ئۇلار اﷲ نىڭ مۇھەممەد ئەلەيھىسسالامغا نازىل قىلىنغان كىتابىدەك كىتاب نازىل قىلىنىشىنى تەمە قىلىدۇ)"},{"number":53,"text":"ياق (يەنى ئۇلار مۇنداق تەمەدىن يانسۇن). بەلكى ئۇلار (ئاخىرەتتىن) قورقمايدۇ"},{"number":54,"text":"ياق، مۇقەررەركى، ئۇ (يەنى قۇرئان) ۋەز - نەسىھەتتۇر (ئۇلار ئۆزلىرىنىڭ بەختىيار بولۇشىنى كۆزلەيدىغان بولسا، قۇرئان ئۇلارنىڭ ۋەز - نەسىھەت ئېلىشىغا يېتەرلىكتۇر)"},{"number":55,"text":"خالىغان ئادەم ئۇنىڭدىن ۋەز - نەسىھەت ئالىدۇ"},{"number":56,"text":"ئۇلار پەقەت خالىسا، ئاندىن ۋەز - نەسىھەت ئالىدۇ، اﷲ (بەندىلىرى) قورقۇشقا تېگىشلىك زاتتۇر، (بەندىلىرىنى) مەغپىرەت قىلىشقا لايىق زاتتۇر"}]}