{"number":75,"edition":"ug.saleh","ayahs":[{"number":1,"text":"قىيامەت كۈنى بىلەن قەسەمكى،"},{"number":2,"text":"ئۆزىنى مالامەت قىلغۇچى نەپسى بىلەن قەسەمكى، (سىلەر چوقۇم تىرىلدۈرۈلىسىلەر، سىلەردىن چوقۇم ھېساب ئېلىنىدۇ)"},{"number":3,"text":"ئىنسان (يەنى كاپىر) بىزنى ئۆزىنىڭ (چىرىپ تارقىلىپ كەتكەن) سۆڭەكلىرىنى جەمئى قىلالمايدۇ دەپ گۇمان قىلامدۇ؟"},{"number":4,"text":"ئۇنداق ئەمەس (يەنى ئۇنىڭ سۆڭەكلىرىنى جەمئى قىلىمىز)، ئۇنىڭ (ئەڭ ئىنچىكە، ئەڭ نازۇك بولغان) بارماقلىرىنى ئەسلىگە كەلتۈرەلەيمىز"},{"number":5,"text":"بەلكى ئىنسان كەلگۈسى ھاياتىدا گۇناھتا ئەزۋەيلىمەكچى بولىدۇ"},{"number":6,"text":"ئۇ (مەسخىرە قىلىش يۈزىسىدىن): «قىيامەت كۈنى قاچان بولىدۇ» دەپ سورايدۇ"},{"number":7,"text":"كۆزلەر تورلاشقان، ئاينىڭ نۇرى ئۆچكەن، كۈن بىلەن ئاي بىرلەشتۈرۈلگەن چاغدا، ئىنسان بۇ كۈندە: «قاچىدىغان جاي قەيەردە؟» دەيدۇ"},{"number":8,"text":"كۆزلەر تورلاشقان، ئاينىڭ نۇرى ئۆچكەن، كۈن بىلەن ئاي بىرلەشتۈرۈلگەن چاغدا، ئىنسان بۇ كۈندە: «قاچىدىغان جاي قەيەردە؟» دەيدۇ"},{"number":9,"text":"كۆزلەر تورلاشقان، ئاينىڭ نۇرى ئۆچكەن، كۈن بىلەن ئاي بىرلەشتۈرۈلگەن چاغدا، ئىنسان بۇ كۈندە: «قاچىدىغان جاي قەيەردە؟» دەيدۇ"},{"number":10,"text":"كۆزلەر تورلاشقان، ئاينىڭ نۇرى ئۆچكەن، كۈن بىلەن ئاي بىرلەشتۈرۈلگەن چاغدا، ئىنسان بۇ كۈندە: «قاچىدىغان جاي قەيەردە؟» دەيدۇ"},{"number":11,"text":"ياق، (اﷲ نىڭ ئازابىدىن) قاچىدىغان پاناھگاھ يوقتۇر"},{"number":12,"text":"بۇ كۈندە قارارگاھ پەرۋەردىگارىڭنىڭ تەرىپىدۇر"},{"number":13,"text":"بۇ كۈندە ئىنسانغا (چوڭ بولسۇن، كىچىك بولسۇن، ياخشىلىق بولسۇن، يامانلىق بولسۇن) ئىلگىرى ئاخىرى قىلغان ئەمەللىرى ئۇقتۇرۇلىدۇ"},{"number":14,"text":"بەلكى ئىنسان ئۆزىگە (يەنى قىلغان يامان ئىشلىرىغا) ئۆزى گۇۋاھتۇر"},{"number":15,"text":"ئۇ ئۆزىنى ئاقلاش ئۈچۈن قانچە ئۆزرە ئېيتقان تەقدىردىمۇ (ئۆزرىسى قوبۇل قىلىنمايدۇ)"},{"number":16,"text":"(ساڭا جىبرىئىل ئارقىلىق ۋەھيى نازىل بولۇۋاتقاندا، ئۇنى ئېسىڭغا ئېلىۋېلىش ئۈچۈن) ئالدىراپ تىلىڭنى مىدىرلاتما"},{"number":17,"text":"ئۇنى توپلاش ۋە ئوقۇپ بېرىش بىزنىڭ مەسئۇلىيىتىمىزدۇر"},{"number":18,"text":"ساڭا ئۇنى ئوقۇپ بەرگىنىمىزدە (يەنى جىبرىئىل ساڭا ئوقۇپ بەرگەندە)، ئۇنىڭ ئوقۇشىغا ئەگەشكىن"},{"number":19,"text":"ئاندىن ئۇنى چۈشەندۈرۈپ بېرىش بىزنىڭ مەسئۇلىيىتىمىزدۇر"},{"number":20,"text":"(ئى مۇشرىكلار جامائەسى!) ھەرگىز ئۇنداق ئەمەس (يەنى ئۆلگەندىن كېيىن تىرىلىش، ھېساب بېرىش سىلەر گۇمان قىلغاندەك يوق ئىش ئەمەس)، بەلكى سىلەر بۇ دۇنيانى دوست تۇتىسىلەر"},{"number":21,"text":"ئاخىرەتكە كۆڭۈل بۆلمەيسىلەر"},{"number":22,"text":"بۇ كۈندە، (سائادەتمەنلەرنىڭ) يۈزلىرى نۇرلۇق بولىدۇ"},{"number":23,"text":"(ئۇلار) پەرۋەردىگارىغا قاراپ تۇرىدۇ"},{"number":24,"text":"بۇ كۈندە، نۇرغۇن يۈزلەر تۇتۇق بولىدۇ"},{"number":25,"text":"ئۆزلىرىنىڭ چوڭ مۈشكۈللۈككە دۇچار بولىدىغانلىقىغا ئۇلار جەزمەن ئىشىنىدۇ"},{"number":26,"text":"راستلا جان ھەلقۇمىغا يەتكەندە، «(بۇ كېسەلگە) كىم ئىلاج قىلالايدۇ» دېيىلىدۇ"},{"number":27,"text":"راستلا جان ھەلقۇمىغا يەتكەندە، «(بۇ كېسەلگە) كىم ئىلاج قىلالايدۇ» دېيىلىدۇ"},{"number":28,"text":"(سەكراتتا ياتقان ئادەم) بۇنىڭ (دۇنيادىن) ئايرىلىش ئىكەنلىكىنى جەزمەن بىلىدۇ"},{"number":29,"text":"(سەكراتنىڭ قاتتىقلىقىدىن) پاچاق پاچاققا كىرىشىپ كېتىدۇ"},{"number":30,"text":"بۇ كۈندە ھەيدەپ بېرىلىدىغان جاي پەرۋەردىگارىڭنىڭ دەرگاھىدۇر"},{"number":31,"text":"(كاپىر قۇرئانغا) ئىشەنمىدى، ناماز ئوقۇمىدى"},{"number":32,"text":"لېكىن ئۇ (قۇرئاننى) ئىنكار قىلدى ۋە (ئىماندىن) يۈز ئۆرۈدى"},{"number":33,"text":"ئاندىن كېرىلگەن ھالدا ئۆيىگە قايتتى"},{"number":34,"text":"ۋاي سېنىڭ ھالىڭغا! ۋاي سېنىڭ ھالىڭغا"},{"number":35,"text":"يەنە ۋاي سېنىڭ ھالىڭغا! ۋاي سېنىڭ ھالىڭغا"},{"number":36,"text":"ئىنسان ئۆزىنى بىكار قويۇپ بېرىلىدۇ (يەنى شەرىئەت ئىشلىرىغا تەكلىپ قىلىنماي، مەيلىگە قويۇۋېتىلگەن ھايۋانغا ئوخشاش) دەپ ئويلامدۇ؟"},{"number":37,"text":"ئۇ (بەچچىدانلارغا) تۆكىلىدىغان (ئاجىز مەنىي) ئەمەسمىدى؟"},{"number":38,"text":"ئاندىن ئۇ لەختە قان بولدى، ئاندىن اﷲ ئۇنى چىرايلىق شەكىلدە ياراتتى"},{"number":39,"text":"ئۇ مەنىيدىن ئەر - ئايال (ئىككى تىپنى) ياراتتى"},{"number":40,"text":"ئۇ (يەنى يۇقىرىقىدەك ئىشلارنى قىلالىغان اﷲ) ئۆلۈكلەرنى تىرىلدۈرۈشكە قادىر ئەمەسمۇ؟"}]}