{"number":79,"edition":"ug.saleh","ayahs":[{"number":1,"text":"(كۇففارلارنىڭ جانلىرىنى) قاتتىق تارتىپ ئالغۇچى پەرىشتىلەر بىلەن قەسەمكى،"},{"number":2,"text":"(مۆمىنلەرنىڭ جانلىرىنى) سىلىق ئالغۇچى پەرىشتىلەر بىلەن قەسەمكى،"},{"number":3,"text":"(اﷲ نىڭ ئەمرىنى ئاسماندىن) تېز ئېلىپ چۈشكۈچى پەرىشتىلەر بىلەن قەسەمكى،"},{"number":4,"text":"(مۆمىنلەرنىڭ جانلىرىنى ئېلىپ جەننەتكە) ئىلگىرلىگۈچى پەرىشتىلەر بىلەن قەسەمكى،"},{"number":5,"text":"(اﷲ نىڭ ئەمرى بىلەن) كائىناتنىڭ ئىشلىرىنى باشقۇرغۇچى پەرىشتىلەر بىلەن قەسەمكى، (سىلەر چوقۇم تىرىلدۈرۈلىسىلەر، سىلەردىن چوقۇم ھېساب ئېلىنىدۇ)"},{"number":6,"text":"بۇ كۈن (يەنى قىيامەت كۈنى) دە زېمىن (ۋە ئۇنىڭدىكى شەيئىلەر قوشۇلۇپ) تەۋرەيدۇ"},{"number":7,"text":"ئۇنىڭ ئارقىسىدىنلا ئاسمان (ۋە ئۇنىڭدىكى شەيئىلەر قوشۇلۇپ) تەۋرەيدۇ"},{"number":8,"text":"بۇ كۈندە دىللارنى (يەنى كۇففارلارنىڭ دىللىرىنى) قورقۇنچ باسىدۇ"},{"number":9,"text":"شۇ (دىللارنىڭ ئىگىلىرىنىڭ) كۆزلىرى (قورقۇنچتىن) تىكىلىپ قارىيالمايدۇ"},{"number":10,"text":"ئۇلار ئېيتىدۇ: «راستلا بىز ئاۋۋالقى ھالىمىزغا قايتۇرۇلامدۇق؟ (يەنى ئۆلگەندىن كېيىن تىرىلەمدۇق؟)"},{"number":11,"text":"ئۇ بىزنىڭ چىرىگەن سۆڭەك بولۇپ قالغان ۋاقتىمىز ئەمەسمۇ؟»"},{"number":12,"text":"ئۇلار ئېيتتى: «ئۇنداق بولىدىغان بولسا، بۇ (يەنى ئۆلگەندىن كېيىن تىرىلىش) زىيانلىق قايتىشتۇر (يەنى بىز ئۆلگەندىن كېيىن تىرىلىدىغان بولساق، دوزاخ ئەھلى بولغانلىقىمىز ئۈچۈن زىيان تارتقۇچىلارمىز)»"},{"number":13,"text":"بىر سەيھە (يەنى ئىسراپىلنىڭ سۇر چېلىشى) بىلەنلا ئۇلار (يەنى جىمى خالايىق) (يەر ئاستىدىن) زېمىننىڭ ئۈستىگە چىقىپ قالىدۇ"},{"number":14,"text":"بىر سەيھە (يەنى ئىسراپىلنىڭ سۇر چېلىشى) بىلەنلا ئۇلار (يەنى جىمى خالايىق) (يەر ئاستىدىن) زېمىننىڭ ئۈستىگە چىقىپ قالىدۇ"},{"number":15,"text":"ساڭا مۇسانىڭ خەۋىرى كەلدىمۇ؟"},{"number":16,"text":"ئۆز ۋاقتىدا ئۇنى پەرۋەردىگارى تۇۋا ناملىق مۇقەددەس ۋادىدا (مۇنداق دەپ) چاقىردى"},{"number":17,"text":"«سەن پىرئەۋننىڭ قېشىغا بارغىن، ئۇ ھەقىقەتەن ھەددىدىن ئاشتى"},{"number":18,"text":"ئۇنىڭغا: (كۇفرىدىن ۋە گۇناھلاردىن) پاك بولۇشنى خالامسەن"},{"number":19,"text":"سېنى پەرۋەردىگارىمنى تونۇشقا يېتەكلىشىمنى خالامسەن؟ (ئۇنى تونۇساڭ پەرۋەردىگارىڭدىن) قورقىسەن - دە، (ياخشى ئەمەللەرنى قىلىسەن)، دېگىن»"},{"number":20,"text":"مۇسا پىرئەۋنگە چوڭ مۆجىزىنى كۆرسەتتى"},{"number":21,"text":"پىرئەۋن (اﷲ نىڭ پەيغەمبىرى مۇسانى) ئىنكار قىلدى ۋە (اﷲ نىڭ ئەمرىگە) ئاسىيلىق قىلدى"},{"number":22,"text":"ئاندىن پىرئەۋن (مۇسادىن) يۈز ئۆرۈپ (ھىيلە - مىكىر ئىشلىتىشكە) كىرىشتى"},{"number":23,"text":"(ئۇ سېھرىگەرلەرنى، ئەسكەرلىرىنى، تەۋەلىرىنى) توپلىدى ھەم نىدا قىلىپ"},{"number":24,"text":"دېدى: «مەن سىلەرنىڭ بۈيۈك پەرۋەردىگارىڭلار بولىمەن»"},{"number":25,"text":"اﷲ ئۇنى دۇنيا ۋە ئاخىرەتنىڭ ئازابى بىلەن جازالىدى"},{"number":26,"text":"شەك - شۈبھىسىزكى، اﷲ تىن قورقىدىغانلار بۇنىڭدىن ئىبرەت ئالىدۇ"},{"number":27,"text":"سىلەرنى يارىتىش مۈشكۈلمۇ؟ ياكى ئاسماننى يارىتىش مۈشكۈلمۇ؟ اﷲ ئاسماننى ياراتتى"},{"number":28,"text":"ئۇنىڭ ئېگىزلىكىنى يۈكسەك قىلدى ۋە كەم - كۈتىسىز قىلدى"},{"number":29,"text":"ئۇنىڭ كېچىسىنى قاپقاراڭغۇ، كۈندۈزىنى يوپيورۇق قىلدى"},{"number":30,"text":"شۇنىڭدىن كېيىن زېمىننى (ئەھلى زېمىننىڭ تۇرۇشىغا لايىق قىلىپ) يايدى"},{"number":31,"text":"زېمىندىن بۇلاقلارنى ئاقتۇردى، ئۆسۈملۈكلەرنى ئۆستۈردى"},{"number":32,"text":"تاغلارنى (زېمىندا) مۇقىم قىلدى"},{"number":33,"text":"اﷲ تائالا ئۇلارنىڭ ھەممىسىنى سىلەرنىڭ ۋە ھايۋانلىرىڭلارنىڭ پايدىلىنىشى ئۈچۈن (ياراتتى)"},{"number":34,"text":"قىيامەت كەلگەندە،"},{"number":35,"text":"(شۇ) كۈندە ئىنسان (ياخشى - يامان) قىلمىشلىرىنى ئەسلەيدۇ"},{"number":36,"text":"قارىغۇچىلارغا جەھەننەم ئوچۇق كۆرسىتىلىدۇ"},{"number":37,"text":"كىمكى (كۇفرىدا، گۇناھتا) چېكىدىن ئاشىدىكەن،"},{"number":38,"text":"دۇنيا تىرىكچىلىكىنى (ئاخىرەتتىن) ئارتۇق كۆرىدىكەن،"},{"number":39,"text":"ئۇنىڭ جايى ھەقىقەتەن جەھەننەم بولىدۇ"},{"number":40,"text":"پەرۋەردىگارىنىڭ ئالدىدا (سوراققا تارتىلىشتىن) قورقىدىغان، ئۆزىنى نەپسى خاھىشىغا بېرىلىشتىن (يەنى ھارام قىلىنغان نەرسىلەردىن) چەكلىگەن ئادەمگە كەلسەك،"},{"number":41,"text":"ھەقىقەتەن ئۇنىڭ جايى جەننەت بولىدۇ"},{"number":42,"text":"ئۇلار سەندىن قىيامەتنىڭ قاچان بولىدىغانلىقىنى سورايدۇ"},{"number":43,"text":"سەن ئۇنى قانداقمۇ بايان قىلىپ بېرەلەيسەن؟"},{"number":44,"text":"ئۇنى بىلىش پەرۋەردىگارىڭغا خاستۇر"},{"number":45,"text":"سېنىڭ ۋەزىپەڭ پەقەت قىيامەتتىن قورقىدىغان ئادەمنى ئاگاھلاندۇرۇشتۇر"},{"number":46,"text":"ئۇلار قىيامەتنى كۆرگەن كۈندە، گويا ئۆزلىرىنى (دۇنيادا) پەقەت بىر كەچقۇرۇن ياكى بىر ئەتىگەن تۇرغاندەك (گۇمان قىلىدۇ)"}]}