{"number":84,"edition":"ug.saleh","ayahs":[{"number":1,"text":"ئاسمان يېرىلغان،"},{"number":2,"text":"پەرۋەردىگارنىڭ ئەمرىنى ئاڭلاپ، ئىتائەت قىلغان، پەرۋەردىگارنىڭ ئەمرىنى ئاڭلاشقا، ئىتائەت قىلىشقا لايىق بولغان چاغدا،"},{"number":3,"text":"زېمىن سوزۇلغان،"},{"number":4,"text":"قوينىدىكى نەرسىلەرنى (يەنى ئۆلۈكلەرنى، مەدەنلەرنى) سىرتقا چىقىرىپ قۇرۇقدىنىپ قالغان،"},{"number":5,"text":"پەرۋەردىگارىنىڭ ئەمرىنى ئاڭلاپ ئىتائەت قىلغان، پەرۋەردىگارىنىڭ ئەمرىنى ئاڭلاشقا، ئىتائەت قىلىشقا لايىق بولغان چاغدا (ئىنسان خىيالىغا كەلمىگەن دەھشەتلىك ئەھۋاللارغا يولۇقىدۇ)"},{"number":6,"text":"ئى ئىنسان! سەن ھەقىقەتەن پەرۋەردىگارىڭغا مۇلاقات بولغىنىڭغا قەدەر (ئۆز ئىشىڭدا) سەئيى - ئىجتىھات قىلىسەن (يەنى ئەمەلىڭنىڭ نەتىجىسىنى كۆرىسەن)"},{"number":7,"text":"نامە - ئەمالى ئوڭ تەرىپىدىن بېرىلگەن ئادەمدىن ئاسان ھېساب ئېلىنىدۇ"},{"number":8,"text":"نامە - ئەمالى ئوڭ تەرىپىدىن بېرىلگەن ئادەمدىن ئاسان ھېساب ئېلىنىدۇ"},{"number":9,"text":"(ئۇ جەننەتتىكى) ئائىلىسىگە خۇشال - خۇرام قايتىدۇ"},{"number":10,"text":"نامە - ئەمالى ئارقا تەرىپىدىن بېرىلگەن ئادەم"},{"number":11,"text":"«ۋاي دەپ توۋلايدۇ (يەنى ئۆلۈمنى ئارزۇ قىلىدۇ)،"},{"number":12,"text":"دوزاخقا كىرىدۇ"},{"number":13,"text":"چۈنكى ئۇ (دۇنيادىكى چېغىدا) ئائىلىسىدە شاد - خۇرام ئىدى"},{"number":14,"text":"ئۇ پەرۋەردىگارىنىڭ دەرگاھىغا قايتىمەن دەپ گۇمان قىلدى"},{"number":15,"text":"ئۇنداق ئەمەس، (يەنى ئۇ پەرۋەردىگارىنىڭ دەرگاھىغا قايتىدۇ). پەرۋەردىگارى ھەقىقەتەن ئۇنى كۆرۈپ تورغۇچىدۇر"},{"number":16,"text":"شەپەق (يەنى كۈن پاتقاندىن كېيىنكى ئۇپۇقتىكى قىزىللىق) بىلەن، كېچە ۋە ئۇنىڭ قاراڭغۇلۇقى باسقان نەرسىلەر بىلەن، نۇرى كامالەتكە يەتكەن ئاي (يەنى تولۇن ئاي) بىلەن قەسەمكى"},{"number":17,"text":"شەپەق (يەنى كۈن پاتقاندىن كېيىنكى ئۇپۇقتىكى قىزىللىق) بىلەن، كېچە ۋە ئۇنىڭ قاراڭغۇلۇقى باسقان نەرسىلەر بىلەن، نۇرى كامالەتكە يەتكەن ئاي (يەنى تولۇن ئاي) بىلەن قەسەمكى"},{"number":18,"text":"شەپەق (يەنى كۈن پاتقاندىن كېيىنكى ئۇپۇقتىكى قىزىللىق) بىلەن، كېچە ۋە ئۇنىڭ قاراڭغۇلۇقى باسقان نەرسىلەر بىلەن، نۇرى كامالەتكە يەتكەن ئاي (يەنى تولۇن ئاي) بىلەن قەسەمكى،"},{"number":19,"text":"سىلەر جەزمەن بىر ھالدىن يەنە بىر ھالغا يۆتكىلىپ تورىسىلەر"},{"number":20,"text":"ئۇلار (يەنى مۇشرىكلار) نېمىشقا ئىمان ئېيتمايدۇ؟"},{"number":21,"text":"ئۇلارنىڭ يېنىدا قۇرئان ئوقۇلغان چاغدا نېمىشقا سەجدە قىلمايدۇ؟"},{"number":22,"text":"بەلكى كاپىرلار (ھەقىقەتنى) ئىنكار قىلىدۇ"},{"number":23,"text":"ئۇلارنىڭ دىللىرىدىكى يوشۇرۇن نەرسىلەرنى اﷲ ئوبدان بىلىدۇ"},{"number":24,"text":"ئۇلارغا قاتتىق ئازاب بىلەن خۇش خەۋەر بەرگىن"},{"number":25,"text":"پەقەت ئىمان ئېيتقان ۋە ياخشى ئەمەللەرنى قىلغان كىشىلەر ئۈزۈلمەس ساۋابقا ئېرىشىدۇ"}]}