{"number":15,"edition":"bg.theophanov","ayahs":[{"number":1,"text":"Алиф. Лам. Ра. Това са знаменията на Книгата - ясния Коран"},{"number":2,"text":"Неверниците ще възжелаят да са били мюсюлмани"},{"number":3,"text":"Остави ги да ядат и да се наслаждават, и да ги отвлича надеждата! Те ще узнаят"},{"number":4,"text":"И не сме унищожили Ние никое селище, без да се знае какво му е писано"},{"number":5,"text":"Никоя общност не изпреварва своя срок и не го забавя"},{"number":6,"text":"И рекоха [неверниците]: “О, ти, комуто бе низпослано Напомнянето, ти си луд"},{"number":7,"text":"Защо не ни доведеш ангелите, ако говориш истината?”"},{"number":8,"text":"Ние не низпославаме ангелите с друго освен с истината. И тогава [неверниците] не ще бъдат изчакани"},{"number":9,"text":"Наистина Ние низпослахме Напомнянето и Ние непременно ще го пазим"},{"number":10,"text":"И преди теб изпращахме пратеници сред древните общности"},{"number":11,"text":"И не дойде при тях пратеник, без да го подиграят"},{"number":12,"text":"Така влагаме това [неверие] в сърцата на престъпниците"},{"number":13,"text":"не вярват в него [- Корана], въпреки че е известна съдбата на предците"},{"number":14,"text":"И да разтворехме над тях врата в небето, и да продължаха там да се изкачват"},{"number":15,"text":"пак щяха да рекат: “Погледите ни бяха заслепени. Ние сме омагьосани хора.”"},{"number":16,"text":"И направихме на небето съзвездия, и го разкрасихме за гледащите"},{"number":17,"text":"и го опазихме от всеки прокуден сатана"},{"number":18,"text":"всеки, който слуша скришом, го следва ярък пламък"},{"number":19,"text":"И разпростряхме земята, и положихме върху нея непоклатими планини, и сторихме от нея да поникне от всяко нещо, което се мери"},{"number":20,"text":"И сторихме там препитание за вас и за онзи, когото вие не храните"},{"number":21,"text":"И няма нещо, съкровищниците на което да не са при Нас, и го спускаме Ние само в знайно количество"},{"number":22,"text":"И изпращаме ветровете - оплождащи, и утоляваме жаждата с вода, която изсипваме от небето, а вие не можете да я съхраните"},{"number":23,"text":"Наистина Ние съживяваме и умъртвяваме, и Ние сме наследниците"},{"number":24,"text":"Знаем предишните от вас и знаем оставащите"},{"number":25,"text":"Наистина твоят Господ е Онзи, Който ще ги събере. Той е премъдър, всезнаещ"},{"number":26,"text":"И сътворихме човека от изсъхнала глина, от менлива кал"},{"number":27,"text":"А джиновете сътворихме от пламъка на огъня преди"},{"number":28,"text":"Твоят Господ каза на ангелите: “Аз ще сътворя човек от изсъхнала глина, от менлива кал"},{"number":29,"text":"И когато го сътворя и му вдъхна от Своя дух, поклонете се пред него!”"},{"number":30,"text":"И всички ангели се поклониха заедно"},{"number":31,"text":"освен Иблис, който се възпротиви да е с покланящите се"},{"number":32,"text":"Рече [Аллах]: “О, Иблис, какво ти е, че не си с покланящите се?”"},{"number":33,"text":"Рече: “Не ми подобава да се поклоня на човек, когото Ти сътвори от изсъхнала глина, от менлива кал.”"},{"number":34,"text":"Рече: “Излез тогава оттук! Ти си прокуден"},{"number":35,"text":"Над теб е проклятието до Съдния ден.”"},{"number":36,"text":"Рече: “Господи мой, отсрочи ме до Деня, в който ще бъдат възкресени!”"},{"number":37,"text":"Рече: “Ти си сред отсрочените"},{"number":38,"text":"до Деня на знайното време.”"},{"number":39,"text":"Рече: “Господи мой, затова, че Ти ме остави в заблуда, непременно ще им разкрасявам по земята и непременно ще заблуждавам всички"},{"number":40,"text":"освен Твоите предани раби сред тях.”"},{"number":41,"text":"Рече: “Това е правият път към Мен"},{"number":42,"text":"Над Моите раби нямаш власт, освен за който те последва измежду заблудените.”"},{"number":43,"text":"Наистина Адът е обещан за всички тях"},{"number":44,"text":"Той има седем врати. За всяка врата има отделена група"},{"number":45,"text":"Богобоязливите ще бъдат сред градини и извори"},{"number":46,"text":"“Влезте там с мир - в безопасност!”"},{"number":47,"text":"И ще премахнем от сърцата им всяка омраза - братя на престоли един срещу друг"},{"number":48,"text":"Не ще ги засегне там умора и не ще бъдат оттам изведени"},{"number":49,"text":"Извести Моите раби [о, Мухаммад], че Аз съм Опрощаващия, Милосърдния"},{"number":50,"text":"И че Моето мъчение е болезненото мъчение"},{"number":51,"text":"И ги извести за гостите на Ибрахим"},{"number":52,"text":"Когато влязоха при него и рекоха: “Мир!”, рече: “Ние се страхуваме от вас.”"},{"number":53,"text":"Рекоха: “Не се страхувай! Ние те благовестваме за син, надарен със знание.”"},{"number":54,"text":"Рече: “Нима ме благовествате, при все че ме настигна старостта? И с какво ще ме възрадвате?”"},{"number":55,"text":"Рекоха: “Възрадвахме те с истината. И не губи надежда!”"},{"number":56,"text":"Каза: “А кой губи надежда за милостта на своя Господ освен заблудените?”"},{"number":57,"text":"И каза: “А какво е намерението ви, о, пратеници?”"},{"number":58,"text":"Казаха: “Изпратени сме при хора престъпващи"},{"number":59,"text":"освен семейството на Лут. Ще го спасим цялото"},{"number":60,"text":"освен неговата жена. Известено ни е, че тя ще бъде сред оставащите.”"},{"number":61,"text":"И когато пратениците дойдоха при семейството на Лут"},{"number":62,"text":"той каза: “Вие сте непознати хора.”"},{"number":63,"text":"Казаха: “Да, дойдохме при теб с онова, за което се съмняват [твоите хора]"},{"number":64,"text":"И ти донесохме правдата. Ние казваме истината"},{"number":65,"text":"Тръгни със своето семейство в част от нощта и върви зад тях! И никой от вас да не се обърне! И продължете натам, където ви е повелено!”"},{"number":66,"text":"И го предизвестихме с тази повеля, че коренът на тези ще бъде отсечен на сутринта"},{"number":67,"text":"И дойдоха жителите на града зарадвани"},{"number":68,"text":"Каза [Лут]: “Тези са ми гости. Не ме опозорявайте"},{"number":69,"text":"Бойте се от Аллах! И не ме посрамвайте!”"},{"number":70,"text":"Казаха: “Не те ли възпряхме от хората [да ти гостуват]?”"},{"number":71,"text":"Каза: “Ето дъщерите ми, ако ще вършите!”"},{"number":72,"text":"Кълна се в твоя живот [о, Мухаммад], те в своето опиянение се лутат"},{"number":73,"text":"И Викът ги обзе при изгрев слънце"},{"number":74,"text":"И преобърнахме селището надолу, и изсипахме над тях порой камъни от глина"},{"number":75,"text":"В това има знамения за прозорливите"},{"number":76,"text":"Те [- селищата] са на все още съществуващ път"},{"number":77,"text":"В това има знамение за вярващите"},{"number":78,"text":"И обитателите на Горичката бяха угнетители"},{"number":79,"text":"Затова им отмъстихме. И двете са на видим път"},{"number":80,"text":"И обитателите на ал-Хиджр взеха за лъжци пратениците"},{"number":81,"text":"Дадохме им Наши знамения, ала се отдръпнаха от тях"},{"number":82,"text":"И изсичаха домове в планините - в безопасност"},{"number":83,"text":"Но Викът ги обзе на сутринта"},{"number":84,"text":"И не ги избави онова, което бяха придобили"},{"number":85,"text":"Сътворихме Ние небесата и земята, и онова, което е помежду тях, единствено с мъдрост. Часът непременно ще дойде, затова [о, Мухаммад] прости с великодушна прошка"},{"number":86,"text":"Твоят Господ е Всетворящия, Всезнаещия"},{"number":87,"text":"Ние вече ти дадохме седемте повтарящи се знамения и великия Коран"},{"number":88,"text":"Не устремявай поглед към онова, което дадохме за наслада на групи от тях, и не скърби за тях! И спусни своето крило над вярващите"},{"number":89,"text":"И кажи: “Аз наистина съм ясният предупредител.”"},{"number":90,"text":"Както низпослахме [наказание] и за поделящите"},{"number":91,"text":"които сториха на части Корана"},{"number":92,"text":"Кълна се в твоя Господ! Ще ги питаме всички"},{"number":93,"text":"за онова, което са извършили"},{"number":94,"text":"Извести онова, което ти бе повелено, и се отдръпни от съдружаващите"},{"number":95,"text":"Ние сме ти достатъчни срещу присмехулниците"},{"number":96,"text":"които наред с Аллах приемат друг бог. Ала ще узнаят"},{"number":97,"text":"И знаем Ние, че сърцето ти се свива от техните думи"},{"number":98,"text":"Но прославяй с възхвала своя Господ и бъди от покланящите се в суджуд"},{"number":99,"text":"И служи на своя Господ, докато дойде при теб неизбежното"}]}