{"number":72,"edition":"bg.theophanov","ayahs":[{"number":1,"text":"Кажи [о, Мухаммад]: “Разкрито ми бе, че няколко джинове слушали и рекли: “Чухме удивителен Коран"},{"number":2,"text":"Насочва той към правия път. Затова повярвахме в него и никого не ще съдружим с нашия Господ"},{"number":3,"text":"Той - превисоко е величието на нашия Господ! - не се е сдобивал нито със съпруга, нито със син"},{"number":4,"text":"Глупците измежду нас говорят измислици за Аллах"},{"number":5,"text":"А ние предполагахме, че хората и джиновете никога не ще изрекат лъжа за Аллах"},{"number":6,"text":"Някои хора търсеха убежище при някои джинове, а [хората] им надбавиха безразсъдство"},{"number":7,"text":"И [хората] предполагаха, както и вие предполагахте, че Аллах не ще възкреси никого"},{"number":8,"text":"И досегнахме небето, и открихме, че е пълно със силна стража и с изгарящи звезди"},{"number":9,"text":"А преди седяхме там на места, за да подслушваме. А който подслушва сега, дебне го изгаряща звезда"},{"number":10,"text":"И не знаем дали зло е поискано за онези, които са на земята, или техният Господ е поискал добро за тях"},{"number":11,"text":"Сред нас има правдиви, сред нас има и други освен това. Следваме различни пътища"},{"number":12,"text":"Вече сме убедени, че никога не ще обезсилим Аллах на земята и никога не ще Го обезсилим, дори да бягаме"},{"number":13,"text":"И когато чухме Напътствието, повярвахме в него. А който вярва в своя Господ, да не се страхува нито от ощетяване, нито от угнетяване"},{"number":14,"text":"Сред нас има отдали се на Аллах [мюсюлмани], но сред нас има и отклонили се [неверници]. Онези, които са се отдали на Аллах - те са избрали правия път"},{"number":15,"text":"А отклонилите се - те са горивото за Ада.”"},{"number":16,"text":"И ако се бяха придържали към правия път, Ние щяхме да им дадем вода в изобилие"},{"number":17,"text":"за да ги изпитаме с това. А който се отдръпва от споменаването на своя Господ, Той ще го въведе в тежко мъчение"},{"number":18,"text":"Джамиите са само за Аллах и затова не зовете никой друг заедно с Аллах"},{"number":19,"text":"Когато рабът на Аллах [Мухаммад] се изправи да Го позове, те едва не се струпаха около него на пълчища"},{"number":20,"text":"Кажи: “Зова единствено моя Господ и никого не съдружавам с Него.”"},{"number":21,"text":"Кажи: “Аз нито мога да ви навредя, нито да ви бъда от полза.”"},{"number":22,"text":"Кажи: “Никой не може да ме защити от Аллах и не ще намеря убежище освен при Него"},{"number":23,"text":"Аз предавам само известие от Аллах и Негови послания. А които не се подчиняват на Аллах и на Неговия Пратеник, за тях е Огънят на Ада, там ще пребивават вечно.”"},{"number":24,"text":"Когато видят обещаното им, ще научат кой има по-слаби и по-малобройни помощници"},{"number":25,"text":"Кажи: “Не знам близо ли е това, което ви е обещано, или е сторил за него предел моят Господ"},{"number":26,"text":"Знаещия неведомото. Той на никого не разкрива Своите тайни"},{"number":27,"text":"освен на онзи пратеник, когото е избрал. И сторва Той пред него и зад него да има [ангели] пазители"},{"number":28,"text":"за да знае, че са съобщили посланията на своя Господ. Обгръща Той това, което е у тях, и пресмята всяко нещо.”"}]}