{"number":67,"edition":"en.shakir","ayahs":[{"number":1,"text":"Blessed is He in Whose hand is the kingdom, and He has power over all things"},{"number":2,"text":"Who created death and life that He may try you-- which of you is best in deeds; and He is the Mighty, the Forgiving"},{"number":3,"text":"Who created the seven heavens one above another; you see no incongruity in the creation of the Beneficent Allah; then look again, can you see any disorder"},{"number":4,"text":"Then turn back the eye again and again; your look shall come back to you confused while it is fatigued"},{"number":5,"text":"And certainly We have adorned this lower heaven with lamps and We have made these missiles for the Shaitans, and We have prepared for them the chastisement of burning"},{"number":6,"text":"And for those who disbelieve in their Lord is the punishment of hell, and evil is the resort"},{"number":7,"text":"When they shall be cast therein, they shall hear a loud moaning of it as it heaves"},{"number":8,"text":"Almost bursting for fury. Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner"},{"number":9,"text":"They shall say: Yea! indeed there came to us a warner, but we rejected (him) and said: Allah has not revealed anything, you are only in a great error"},{"number":10,"text":"And they shall say: Had we but listened or pondered, we should not have been among the inmates of the burning fire"},{"number":11,"text":"So they shall acknowledge their sins, but far will be (forgiveness) from the inmates of the burning fire"},{"number":12,"text":"(As for) those who fear their Lord in secret, they shall surely have forgiveness and a great reward"},{"number":13,"text":"And conceal your word or manifest it; surely He is Cognizant of what is in the hearts"},{"number":14,"text":"Does He not know, Who created? And He is the Knower of the subtleties, the Aware"},{"number":15,"text":"He it is Who made the earth smooth for you, therefore go about in the spacious sides thereof, and eat of His sustenance, and to Him is the return after death"},{"number":16,"text":"Are you secure of those in the heaven that He should not make the earth to swallow you up? Then lo! it shall be in a state of commotion"},{"number":17,"text":"Or are you secure of those in the heaven that He should not send down upon you a punishment? Then shall you know how was My warning"},{"number":18,"text":"And certainly those before them rejected (the truth), then how was My disapproval"},{"number":19,"text":"Have they not seen the birds above them expanding (their wings) and contracting (them)? What is it that withholds them save the Beneficent Allah? Surely He sees everything"},{"number":20,"text":"Or who is it that will be a host for you to assist you besides the Beneficent Allah? The unbelievers are only in deception"},{"number":21,"text":"Or who is it that will give you sustenance if He should withhold His sustenance? Nay! they persist in disdain and aversion"},{"number":22,"text":"What! is he who goes prone upon his face better guided or he who walks upright upon a straight path"},{"number":23,"text":"Say: He it is Who brought you into being and made for you the ears and the eyes and the hearts: little is it that you give thanks"},{"number":24,"text":"Say: He it is Who multiplied you in the earth and to Him you shall be gathered"},{"number":25,"text":"And they say: When shall this threat be (executed) if you are truthful"},{"number":26,"text":"Say: The knowledge (thereof is only with Allah and I am only a plain warner)"},{"number":27,"text":"But when they shall see it nigh, the faces of those who disbelieve shall be sorry, and it shall be said; This is that which you used to call for"},{"number":28,"text":"Say: Have you considered if Allah should destroy me and those with me-- rather He will have mercy on us; yet who will protect the unbelievers from a painful punishment"},{"number":29,"text":"Say: He is the Beneficent Allah, we believe in Him and on Him do we rely, so you shall come to know who it is that is in clear error"},{"number":30,"text":"Say: Have you considered if your water should go down, who is it then that will bring you flowing water"}]}