{"number":78,"edition":"en.shakir","ayahs":[{"number":1,"text":"Of what do they ask one another"},{"number":2,"text":"About the great event"},{"number":3,"text":"About which they differ"},{"number":4,"text":"Nay! they shall soon come to know"},{"number":5,"text":"Nay! Nay! they shall soon know"},{"number":6,"text":"Have We not made the earth an even expanse"},{"number":7,"text":"And the mountains as projections (thereon)"},{"number":8,"text":"And We created you in pairs"},{"number":9,"text":"And We made your sleep to be rest (to you)"},{"number":10,"text":"And We made the night to be a covering"},{"number":11,"text":"And We made the day for seeking livelihood"},{"number":12,"text":"And We made above you seven strong ones"},{"number":13,"text":"And We made a shining lamp"},{"number":14,"text":"And We send down from the clouds water pouring forth abundantly"},{"number":15,"text":"That We may bring forth thereby corn and herbs"},{"number":16,"text":"And gardens dense and luxuriant"},{"number":17,"text":"Surely the day of decision is (a day) appointed"},{"number":18,"text":"The day on which the trumpet shall be blown so you shall come forth in hosts"},{"number":19,"text":"And the heaven shall be opened so that it shall be all openings"},{"number":20,"text":"And the mountains shall be moved off so that they shall remain a mere semblance"},{"number":21,"text":"Surely hell lies in wait"},{"number":22,"text":"A place of resort for the inordinate"},{"number":23,"text":"Living therein for ages"},{"number":24,"text":"They shall not taste therein cool nor drink"},{"number":25,"text":"But boiling and intensely cold water"},{"number":26,"text":"Requital corresponding"},{"number":27,"text":"Surely they feared not the account"},{"number":28,"text":"And called Our communications a lie, giving the lie (to the truth)"},{"number":29,"text":"And We have recorded everything in a book"},{"number":30,"text":"So taste! for We will not add to you aught but chastisement"},{"number":31,"text":"Surely for those who guard (against evil) is achievement"},{"number":32,"text":"Gardens and vineyards"},{"number":33,"text":"And voluptuous women of equal age"},{"number":34,"text":"And a pure cup"},{"number":35,"text":"They shall not hear therein any vain words nor lying"},{"number":36,"text":"A reward from your Lord, a gift according to a reckoning"},{"number":37,"text":"The Lord of the heavens and the earth and what is between them, the Beneficent Allah, they shall not be able to address Him"},{"number":38,"text":"The day on which the spirit and the angels shall stand in ranks; they shall not speak except he whom the Beneficent Allah permits and who speaks the right thing"},{"number":39,"text":"That is the sure day, so whoever desires may take refuge with his Lord"},{"number":40,"text":"Surely We have warned you of a chastisement near at hand: the day when man shall see what his two hands have sent before, and the unbeliever shall say: O! would that I were dust"}]}