{"number":53,"edition":"tg.ayati","ayahs":[{"number":1,"text":"Қасам ба он ситора, чун пинҳон шуд"},{"number":2,"text":"ки ёри шумо на гумроҳ шуда ва на ба роҳи каҷ рафтааст"},{"number":3,"text":"Ва сухан аз рӯи ҳаво (ҳавас) намегӯяд"},{"number":4,"text":"Ин сухан фақат он чизест, ки ба ӯ ваҳй мешавад"},{"number":5,"text":"Ӯро он фариштаи пурқувват таълим додааст"},{"number":6,"text":"соҳибнерӯе, ки рост истод"},{"number":7,"text":"ва Ӯ ба канораи балаыди осмон буд"},{"number":8,"text":"сипас наздик шуд ва бисёр наздик шуд"},{"number":9,"text":"то ба қадри ду камон ё наздиктар"},{"number":10,"text":"Ва Худо ба бандаи худ ҳар чӣ бояд, ваҳй кунад, ваҳй кард"},{"number":11,"text":"Дил он чиро, ки, дид, дурӯғ нашумурд"},{"number":12,"text":"Оё дар он чӣ мебинад, бо Ӯ ҷидол (баҳс) мекунед"},{"number":13,"text":"Ӯро дигар бор ҳам бидид"},{"number":14,"text":"назди сидратулмунтаҳо"},{"number":15,"text":"ки оромгоҳи биҳишт назди он дарахт аст"},{"number":16,"text":"Вақте ки сидраро чизе (нурҳои файзи илоҳӣ) дар худ мепӯшид"},{"number":17,"text":"чашм хато накард ва аз ҳад дарнагузашт"},{"number":18,"text":"Албатта баъзе аз оёти бузурги Парвардигорашро бидид"},{"number":19,"text":"Оё Лот ва Уззоро дидаед"},{"number":20,"text":"Ва Манот он бути саввуми дигарро"},{"number":21,"text":"Оё шуморо писар бошад ва Ӯро духтар"},{"number":22,"text":"Ин тақсимест ғайри одилона"},{"number":23,"text":"Инҳо чизе нестанд ғайри номҳое, ки худ ва падаронатон ба онҳо додаед. Ва Худованд ҳеҷ далеле бар онҳо нафиристодааст. Танҳо аз паи гумону ҳавои нафси худ мераванд ва хол он ки аз ҷониби Худо роҳнамоияшон кардаанд"},{"number":24,"text":"Оё ҳарчи одами орзу кунад, барояш ҳосил аст"},{"number":25,"text":"Ҳам охират ва ҳам дунё аз они Худост"},{"number":26,"text":"Ва чӣ бисёр фариштагон дар осмонанд, ки шафоъаташон ҳеҷ нафъ надиҳад, лекин аз он пас, ки Худо барои ҳар кӣ хоҳад, рухсат диҳад ва хушнуд бошад. (нафъ кунад)"},{"number":27,"text":"Онон, ки ба охират имон надоранд, фариштагонро ба номҳои занон меноманд"},{"number":28,"text":"Инҳоро ба он чӣ мегӯянд, ҳеҷ донише нест. Танҳо аз гумони худ пайравӣ мекунанд ва гумон барои шинохти ҳақиқат кофӣ нест"},{"number":29,"text":"Пас ту низ аз касе, ки аз сухани Мо рӯйгардон мешавад ва ғайри зиндагии дунявиро намеҷӯяд, рӯй гардон"},{"number":30,"text":"Ниҳояти донишашон ҳамин аст. Парвардигори ту ба он касе ки аз роҳи Ӯ гумроҳ мешавад ё ба роҳи ҳидоят меафтад, донотар аст"},{"number":31,"text":"Аз они Худост ҳар чӣ дар осмонҳову ҳар чӣ дар замин аст, то бадкоронро дар баробари корҳояшон ҷазо диҳад ва некӯкоронро ба кирдори некашон мукофот диҳад"},{"number":32,"text":"Касоне, ки аз гуноҳони бузургу зиштиҳо парҳез мекунанд, — ғайри он ки гуноҳе кӯчак аз онҳо сар занад, — бидонанд, ки бахшоиши Парвардигори ту васеъ аст ва Ӯ ба шумо он гоҳ ки аз замин биёфаридатон ва он гоҳ ки дар шиками модаратон пинҳон будед, огоҳтар аст. Худатонро бегуноҳ надонед. Ӯст, ки парҳезгорро беҳтар мешиносад"},{"number":33,"text":"Оё онро, ки аз ту рӯйгардои шуд, дидӣ"},{"number":34,"text":"Андак мебахшид ва дар садақа бахилӣ мекард"},{"number":35,"text":"Оё илми ғайб дораду мебинад"},{"number":36,"text":"Ё аз он чӣ дар саҳифаҳои Мӯсо омада, бехабар мондааст"},{"number":37,"text":"Ё аз Иброҳим, ки ҳаққи пайғамбариро адо кард"},{"number":38,"text":"Ки ҳеҷ кас бори гуноҳи, дигареро барнадорад"},{"number":39,"text":"Ва ин ки: барои мардум музде ғайри он чӣ худ кардаанд, нест"},{"number":40,"text":"Ва ба зудӣ, ки кушиши ӯ дар назар ояд (рӯзи қиёмат)"},{"number":41,"text":"Сипас ба ӯ ҷазое комил диҳанд"},{"number":42,"text":"Ва поёни роҳи ҳама Парвардигори туст"},{"number":43,"text":"Ва Ӯст, ки механдонаду мегирёнад"},{"number":44,"text":"Ва Ӯст, ки мемиронаду зинда мекунад"},{"number":45,"text":"Ва Ӯст, ки ҷуфтҳои нару модаро офаридааст"},{"number":46,"text":"аз дутфа, он гоҳ, ки дар раҳм рехта мешавад"},{"number":47,"text":"Ва бар Худованд аст, ки онро бори дигар зинда кунад"},{"number":48,"text":"Ва Ӯст, ки тавонгар кунад ва рӯзӣ диҳад"},{"number":49,"text":"Ва Ӯст Парвардигори ситораи Шиъро"},{"number":50,"text":"Ва Ӯст, ки Од — он қавми пешинро ҳалок кард"},{"number":51,"text":"ва аз Самуд ҳеҷ боқӣ нагузошт"},{"number":52,"text":"Ва пеш аз онҳо қавми Нӯҳро, ки ситамкортару саркаштар буданд"},{"number":53,"text":"ва низ Мӯътафикаро нобуд кард"},{"number":54,"text":"Ва фурӯ пӯшид он қавмро, ҳар чӣ бояд фурӯ пӯшад (сангборон кард)"},{"number":55,"text":"Пас ба кадом як аз неъматҳои Парвардигорат шак мекунӣ"},{"number":56,"text":"Ин бимдиҳандаест монанди бимдиҳандагони пешин"},{"number":57,"text":"Қиёмат фаро расид"},{"number":58,"text":"Кас ҷуз Худованд ошкораш накунад"},{"number":59,"text":"Оё аз ин сухан дар ҳайрат афтодаед"},{"number":60,"text":"Ва механдеду намегирйед"},{"number":61,"text":"Ва шумо ғофил шудаед"},{"number":62,"text":"Пас Худоро саҷда кунед ва Ӯро бипарастед"}]}