{"number":26,"edition":"tr.bulac","ayahs":[{"number":1,"text":"Ta, Sin, Mim"},{"number":2,"text":"Bunlar, apaçık olan Kitab'ın ayetleridir"},{"number":3,"text":"Onlar mü'min olmayacaklar diye neredeyse kendini kahredeceksin (öyle mi)"},{"number":4,"text":"Dilersek, onların üzerine gökten bir ayet (mucize) indiririz de, ona boyunları eğilmiş kalıverir"},{"number":5,"text":"Onlara Rahman (olan Allah) dan yeni bir uyarı gelmeyiversin, hiç tartışmasız ondan yüz çevirirler"},{"number":6,"text":"Gerçekten yalanladılar; fakat, alay konusu yaptıkları şeyin haberi kendilerine pek yakında gelecektir"},{"number":7,"text":"Yeryüzünde bir bakmadılar mı ki, Biz onda her güzel (kerim) çiftten nice ürünler bitirdik"},{"number":8,"text":"Şüphesiz, bunda bir ayet vardır; ancak onların çoğu mü'min değildirler"},{"number":9,"text":"Şüphesiz, senin Rabbin, gerçekten O, üstün ve güçlüdür, merhamet sahibidir"},{"number":10,"text":"Hani senin Rabbin, Musa'ya seslenmişti: \"Zulmetmekte olan kavme git"},{"number":11,"text":"Firavun'un kavmine, hala sakınmıyorlar mı"},{"number":12,"text":"Dedi ki: \"Rabbim, gerçekten ben, onların beni yalanlamalarından korkuyorum"},{"number":13,"text":"Göğsüm sıkışıyor, dilim dönmüyor; bundan dolayı Harun'a da (elçilik görevini bildirmesi için Cibril'i) gönder"},{"number":14,"text":"Üstelik, onların bana karşı (davasını savunacakları bir cinayet) suçu(m) var; bundan dolayı beni öldürmelerinden korkuyorum"},{"number":15,"text":"(Allah:) \"Hayır,\" dedi. \"İkiniz de ayetlerimle gidin, şüphesiz sizinle birlikteyiz (ve) işitmekteyiz"},{"number":16,"text":"Gecikmeksizin Firavun'a giderek deyin ki: Gerçekten biz, alemlerin Rabbinin elçisiyiz"},{"number":17,"text":"İsrailoğulları'nı bizimle birlikte göndermen için (sana geldik)"},{"number":18,"text":"(Gittiler ve Firavun:) Dedi ki: \"Biz seni içimizde daha çocukken yetiştirip büyütmedik mi? Sen ömrünün nice yıllarını aramızda geçirmedin mi"},{"number":19,"text":"Ve sen, yapacağın işi (cinayeti) de işledin; sen nankörlerdensin"},{"number":20,"text":"(Musa) Dedi ki: \"Ben onu yaptığım zaman şaşkınlardandım"},{"number":21,"text":"Sizden korkunca da hemen aranızdan kaçtım; sonra Rabbim bana hüküm (ve hikmet) verdi ve beni gönderilen (elçilerden) kıldı"},{"number":22,"text":"Bana karşı lütuf-dediğin nimet de, İsrailoğulları'nı köle kılmandan dolayıdır"},{"number":23,"text":"Firavun dedi ki: \"Alemlerin Rabbi nedir"},{"number":24,"text":"Dedi ki: \"Göklerin, yerin ve bu ikisi arasında olan herşeyin Rabbidir. Eğer 'kesin bilgiyle inanıyorsanız' (böyledir)"},{"number":25,"text":"Çevresindekilere dedi ki: \"İşitiyor musunuz"},{"number":26,"text":"(Musa:) Dedi ki: \"O sizin de Rabbiniz, geçmişteki atalarınızın da Rabbidir"},{"number":27,"text":"(Firavun) Dedi ki: \"Şüphesiz size gönderilmiş bulunan elçiniz, gerçekten bir delidir"},{"number":28,"text":"Eğer aklınızı kullanabiliyorsanız, O, doğunun da, batının da ve bunlar arasında olan herşeyin de Rabbidir\" dedi (Musa)"},{"number":29,"text":"(Firavun) dedi ki: \"Andolsun, benim dışımda bir ilah edinecek olursan, seni mutlaka hapse atacağım"},{"number":30,"text":"(Musa) Dedi ki: \"Sana apaçık bir şey getirmiş olsam da mı"},{"number":31,"text":"(Firavun) Dedi ki: \"Eğer doğru sözlü isen, onu getir"},{"number":32,"text":"Bunun üzerine asasını bırakıverdi, bir de (ne görsünler) o, açıkça bir ejderha oluverdi"},{"number":33,"text":"Elini de çekip çıkardı, bir de (ne görsün) o, bakanlar için 'parlayıp aydınlanıvermiş"},{"number":34,"text":"(Firavun,) Çevresindeki önde gelenlere: \"Bu” dedi, \"Doğrusu bilgin bir büyücüdür"},{"number":35,"text":"Büyüsüyle sizi yurdunuzdan sürüp çıkarmak istiyor; ne buyurursunuz"},{"number":36,"text":"Dediler ki: \"Bunu ve kardeşini oyala, şehirlere de toplayıcılar gönder"},{"number":37,"text":"Bütün uzman-bilgin büyücüleri sana getirsinler"},{"number":38,"text":"Böylelikle büyücüler, bilinen bir günün belli vaktinde biraraya getirildi"},{"number":39,"text":"Ve insanlara da: \"Siz de toplanıyor musunuz? dendi"},{"number":40,"text":"Umarız ki, eğer galip gelirse biz de büyücülere uyarız"},{"number":41,"text":"Büyücüler geldiklerinde, Firavun'a: \"Şayet biz galip gelirsek, bize bir ücret var gerçekten, değil mi?\" dediler"},{"number":42,"text":"Evet\" dedi. \"Üstelik şüphesiz siz en yakın(larım) kılınanlardan olacaksınız"},{"number":43,"text":"Musa onlara dedi ki: \"Atacağınızı atın"},{"number":44,"text":"Onlar da, iplerini ve asalarını atıverdiler ve: \"Firavun'un üstünlüğü adına, hiç tartışmasız, üstün olanlar gerçekten bizleriz\" dediler"},{"number":45,"text":"Böylelikle Musa da asasını bırakıverdi, bir de (ne görsünler) o, uydurmakta olduklarını yutuveriyor"},{"number":46,"text":"Anında büyücüler secdeye kapandılar"},{"number":47,"text":"(Ve:) \"Alemlerin Rabbine iman ettik\" dediler"},{"number":48,"text":"Musa'nın ve Harun'un Rabbine"},{"number":49,"text":"(Firavun) Dedi ki: \"Ona, ben size izin vermeden önce mi inandınız? Şüphesiz, o, size büyüyü öğreten büyüğünüzdür; öyleyse yakında bileceksiniz. Şüphesiz ellerinizi ve ayaklarınızı çaprazlama kestireceğim ve sizin hepinizi gerçekten asıp-sallandıracağım"},{"number":50,"text":"Hiç zararı yok\" dediler. \"Çünkü biz gerçekten Rabbimiz'e dönücüleriz"},{"number":51,"text":"Doğrusu biz, iman edenlerin ilki olduğumuzdan dolayı Rabbimiz'in bizim hatalarımızı bağışlayacağını umuyoruz"},{"number":52,"text":"Musa'ya: \"Kullarımı gece yürüyüşe geçir, çünkü izleneceksiniz\" diye vahyettik"},{"number":53,"text":"Bunun üzerine Firavun şehirlere (asker) toplayıcılar gönderdi"},{"number":54,"text":"Gerçek şu ki bunlar azınlık olan bir topluluktur"},{"number":55,"text":"Ve elbette bize karşı da büyük bir öfke beslemektedirler"},{"number":56,"text":"Biz ise uyanık bir toplumuz\" (dedi)"},{"number":57,"text":"Böylelikle Biz onları (Firavun ve kavmini) bahçelerden ve pınarlardan sürüp çıkardık"},{"number":58,"text":"Hazinelerden ve soylu makam(lar)dan da"},{"number":59,"text":"İşte böyle; bunlara İsrailoğulları'nı mirasçı kıldık"},{"number":60,"text":"Böylece (Firavun ve ordusu) güneşin doğuş vakti onları izlemeye koyuldular"},{"number":61,"text":"İki topluluk birbirini gördükleri zaman Musa'nın adamları: \"Gerçekten yakalandık\" dediler"},{"number":62,"text":"(Musa:) \"Hayır\" dedi. \"Şüphesiz Rabbim, benimle beraberdir; bana yol gösterecektir"},{"number":63,"text":"Bunun üzerine Musa'ya: \"Asanla denize vur\" diye vahyettik. (Vurdu ve) Deniz hemencecik yarılıverdi de her parçası kocaman bir dağ gibi oldu"},{"number":64,"text":"Ötekileri de buraya yaklaştırdık"},{"number":65,"text":"Musa'yı ve onunla birlikte olanların hepsini kurtarmış olduk"},{"number":66,"text":"Sonra ötekileri suda boğduk"},{"number":67,"text":"Şüphesiz, bunda bir ayet vardır. Ama onların çoğu iman etmiş değildirler"},{"number":68,"text":"Ve hiç şüphesiz, senin Rabbin, güçlü ve üstün olandır, esirgeyendir"},{"number":69,"text":"Onlara İbrahim'in haberini de aktar-oku"},{"number":70,"text":"Hani, babasına ve kavmine: \"Siz neye kulluk ediyorsunuz?\" demişti"},{"number":71,"text":"Demişlerdi ki: \"Putlara tapıyoruz, bunun için sürekli onların önünde bel büküp eğiliyoruz"},{"number":72,"text":"Dedi ki: \"Peki, dua ettiğiniz zaman onlar sizi işitiyorlar mı"},{"number":73,"text":"Ya da size bir yararları veya zararları dokunuyor mu"},{"number":74,"text":"Hayır\" dediler. \"Biz atalarımızı böyle yaparlarken bulduk"},{"number":75,"text":"(İbrahim) Dedi ki: \"Şimdi, neye tapmakta olduğunuzu gördünüz mü"},{"number":76,"text":"Hem siz, hem de eski atalarınız"},{"number":77,"text":"İşte bunlar, gerçekten benim düşmanımdır; yalnızca alemlerin Rabbi hariç"},{"number":78,"text":"Ki beni yaratan ve bana hidayet veren O'dur"},{"number":79,"text":"Bana yediren ve içiren O'dur"},{"number":80,"text":"Hastalandığım zaman bana şifa veren O'dur"},{"number":81,"text":"Beni öldürecek, sonra diriltecek olan da O'dur"},{"number":82,"text":"Din (ceza) günü hatalarımı bağışlayacağını umduğum da O'dur"},{"number":83,"text":"Rabbim, bana hüküm (ve hikmet) bağışla ve beni salih olanlara kat"},{"number":84,"text":"Sonra gelecekler arasında bana bir doğruluk dili (lisan-ı sıdk) ver"},{"number":85,"text":"Beni nimetlerle-donatılmış cennetin mirasçılarından kıl"},{"number":86,"text":"Babamı da bağışla, çünkü o şaşırıp sapanlardandır"},{"number":87,"text":"Ve beni (insanların) diriltilecekleri gün küçük düşürme"},{"number":88,"text":"Malın da, çocukların da bir yarar sağlayamadığı günde"},{"number":89,"text":"Ancak Allah'a selim bir kalp ile gelenler başka"},{"number":90,"text":"(O gün) Cennet takva sahiplerine yaklaştırılır"},{"number":91,"text":"Cehennem de azgınlar için sergilenir"},{"number":92,"text":"Ve onlara: \"Tapmakta olduklarınız nerede?\" denilir"},{"number":93,"text":"Allah'ın dışında olan (ilah)lar; size yardımları dokunuyor mu, veya kendilerine yardımları oluyor mu"},{"number":94,"text":"Artık onlar ve azgınlar onun içine dökülüverilmiştir"},{"number":95,"text":"Ve İblis'in bütün orduları da"},{"number":96,"text":"Orada birbirleriyle çekişip tartışarak derler ki"},{"number":97,"text":"Andolsun Allah'a, biz gerçekten apaçık bir sapıklık içindeymişiz"},{"number":98,"text":"Çünkü sizi (yalancı olanları) alemlerin Rabbiyle eşit tutuyorduk"},{"number":99,"text":"Bizi suçlu-günahkarlardan başka saptıran olmadı"},{"number":100,"text":"Artık bizim için ne bir şefaatçi var"},{"number":101,"text":"Ne de candan-yakın bir dost"},{"number":102,"text":"Bizim bir kere daha (dünyaya dönüşümüz mümkün) olsaydı da iman edenlerden olabilseydik"},{"number":103,"text":"Gerçekten, bunda bir ayet vardır, ama onların çoğu iman etmiş değildirler"},{"number":104,"text":"Ve şüphesiz senin Rabbin, güçlü ve üstün olandır, esirgeyendir"},{"number":105,"text":"Nuh kavmi de gönderilen (peygamber)leri yalanladı"},{"number":106,"text":"Hani onlara kardeşleri Nuh: \"Sakınmaz mısınız?\" demişti"},{"number":107,"text":"Gerçek şu ki, ben size gönderilmiş güvenilir bir elçiyim"},{"number":108,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":109,"text":"Buna karşılık ben sizden bir ücret istemiyorum; ücretim yalnızca alemlerin Rabbine aittir"},{"number":110,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":111,"text":"Dediler ki: \"Sana, sıradan aşağılık insanlar uymuşken inanır mıyız"},{"number":112,"text":"Dedi ki: \"Onların yapmakta oldukları hakkında benim bilgim yoktur"},{"number":113,"text":"Onların hesabı yalnızca Rabbime aittir, eğer şuurundaysanız (anlarsınız)"},{"number":114,"text":"Ve ben mü'min olanları kovacak değilim"},{"number":115,"text":"Ben, yalnızca apaçık bir uyarıcıyım"},{"number":116,"text":"Dediler ki: \"Eğer (bu söylediklerine) bir son vermeyecek olursan, gerçekten taşa tutulup kovulacaksın"},{"number":117,"text":"Dedi ki: \"Rabbim, şüphesiz kavmim beni yalanladı"},{"number":118,"text":"Bundan böyle, benimle onların arasını açık bir hükümle ayır ve beni ve benimle birlikte olan mü'minleri kurtar"},{"number":119,"text":"Bunun üzerine, onu ve onunla birlikte olanları (insan ve hayvanlarla) yüklü gemi içinde kurtardık"},{"number":120,"text":"Sonra bunun ardından geride kalanları da suda-boğduk"},{"number":121,"text":"Gerçekten, bunda bir ayet vardır, ama onların çoğu iman etmiş değildirler"},{"number":122,"text":"Ve şüphesiz senin Rabbin, güçlü ve üstün olandır, esirgeyendir"},{"number":123,"text":"Ad (kavmi) de gönderilen (elçi)leri yalanladı"},{"number":124,"text":"Hani onlara kardeşleri Hud: \"Sakınmaz mısınız?\" demişti"},{"number":125,"text":"Gerçek şu ki, ben size gönderilmiş güvenilir bir elçiyim"},{"number":126,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":127,"text":"Buna karşılık ben sizden bir ücret istemiyorum; ücretim yalnızca alemlerin Rabbine aittir"},{"number":128,"text":"Siz, her yüksekçe yere bir anıt inşa edip (yararsız bir şeyle) oyalanıp eğleniyor musunuz"},{"number":129,"text":"Ölümsüz kılınmak umuduyla sanat yapıları mı ediniyorsunuz"},{"number":130,"text":"Tutup yakaladığınız zaman da zorbalar gibi mi yakalıyorsunuz"},{"number":131,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":132,"text":"Bildiğiniz şeylerle size yardım edenden korkup-sakının"},{"number":133,"text":"Size hayvanlar, çocuklar (vererek) yardım etti"},{"number":134,"text":"Bahçeler ve pınarlar da"},{"number":135,"text":"Doğrusu, ben sizin için büyük bir günün azabından korkuyorum"},{"number":136,"text":"Dediler ki: \"Bizim için fark etmez; öğüt versen de, öğüt verenlerden olmasan da"},{"number":137,"text":"Bu, geçmiştekilerin 'geleneksel tutumundan başkası değildir"},{"number":138,"text":"Ve biz azap görecek de değiliz"},{"number":139,"text":"Böylelikle onu yalanladılar, Biz de onları yıkıma uğrattık. Gerçekten, bunda bir ayet vardır, ama onların çoğu iman etmiş değildirler"},{"number":140,"text":"Ve şüphesiz, senin Rabbin, güçlü ve üstün olandır, esirgeyendir"},{"number":141,"text":"Semud (kavmi) de, gönderilen (elçi)leri yalanladı"},{"number":142,"text":"Hani onlara kardeşleri Salih: \"Sakınmaz mısınız? demişti"},{"number":143,"text":"Gerçek şu ki, ben size gönderilmiş güvenilir bir elçiyim"},{"number":144,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":145,"text":"Buna karşılık ben sizden bir ücret istemiyorum"},{"number":146,"text":"Siz burada güvenlik içinde mi bırakılacaksınız"},{"number":147,"text":"Bahçelerin, pınarların içinde"},{"number":148,"text":"Ekinler ve yumuşak tomurcuklu göz alıcı hurmalıklar arasında"},{"number":149,"text":"Dağlardan ustalıkla zevkli evler yontuyorsunuz"},{"number":150,"text":"Artık Allah'tan sakının ve bana itaat edin"},{"number":151,"text":"Ve ölçüsüzce davrananların emrine itaat etmeyin"},{"number":152,"text":"Ki onlar, yeryüzünde bozgunculuk çıkarıyor ve dirlik-düzenlik kurmuyorlar (ıslah etmiyorlar)"},{"number":153,"text":"Dediler ki: \"Sen ancak büyülenmişlerdensin"},{"number":154,"text":"Sen yalnızca bizim benzerimiz olan bir beşerden başkası değilsin; eğer doğru sözlü isen, bu durumda bir ayet (mucize) getir-görelim"},{"number":155,"text":"Dedi ki: \"İşte, bu bir dişi devedir; su içme hakkı (bir gün) onun, belli bir günün su içme hakkı da sizindir"},{"number":156,"text":"Ona bir kötülükle dokunmayın, sonra büyük bir günün azabı sizi yakalar"},{"number":157,"text":"Sonunda onu (yine de) kestiler, ancak pişman oldular"},{"number":158,"text":"Böylece azap onları yakaladı. Gerçekten, bunda bir ayet vardır, ama onların çoğu iman etmiş değildirler"},{"number":159,"text":"Ve şüphesiz, senin Rabbin, güçlü ve üstün olandır, esirgeyendir"},{"number":160,"text":"Lut (kavmi) de, gönderilen (elçi)leri yalanladı"},{"number":161,"text":"Hani onlara kardeşleri Lut: \"Sakınmaz mısınız?\" demişti"},{"number":162,"text":"Gerçek şu ki, ben size gönderilmiş güvenilir bir elçiyim"},{"number":163,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":164,"text":"Buna karşılık ben sizden bir ücret istemiyorum; ücretim yalnızca alemlerin Rabbine aittir"},{"number":165,"text":"Siz insanlardan (cinsel arzuyla) erkeklere mi gidiyorsunuz"},{"number":166,"text":"Rabbinizin sizler için yaratmış bulunduğu eşlerinizi bırakıyorsunuz. Hayır, siz sınırı çiğneyen bir kavimsiniz"},{"number":167,"text":"Dediler ki: \"Ey Lut, eğer (bu söylediklerine) bir son vermeyecek olursan, gerçekten (burdan) sürülüp çıkarılanlardan olacaksın"},{"number":168,"text":"Dedi ki: \"Gerçekten ben, sizin bu yaptığınıza öfke ile karşı olanlardanım"},{"number":169,"text":"Rabbim, beni ve ailemi bunların yaptıklarından kurtar"},{"number":170,"text":"Bunun üzerine onu ve bütün ailesini kurtardık"},{"number":171,"text":"Yalnızca geri kalanlar içinde bir kocakarı hariç"},{"number":172,"text":"Sonra geride kalanları yerle bir ettik"},{"number":173,"text":"Ve üzerlerine bir yağmur yağdırdık; uyarılıp-korkutulanların yağmuru ne kötü"},{"number":174,"text":"Gerçekten, bunda bir ayet vardır, ama onların çoğu iman etmiş değildirler"},{"number":175,"text":"Ve şüphesiz, senin Rabbin, güçlü ve üstün olandır esirgeyendir"},{"number":176,"text":"Eyke halkı da, gönderilen (peygamber)leri yalanladı"},{"number":177,"text":"Hani onlara Şuayb: \"Sakınmaz mısınız?\" demişti"},{"number":178,"text":"Gerçek şu ki, ben size gönderilmiş güvenilir bir elçiyim"},{"number":179,"text":"Artık Allah'tan korkup-sakının ve bana itaat edin"},{"number":180,"text":"Buna karşılık ben sizden bir ücret istemiyorum; ücretim yalnızca alemlerin Rabbine aittir"},{"number":181,"text":"Ölçüyü tam tutun ve eksiltenlerden olmayın"},{"number":182,"text":"Dosdoğru olan terazi ile tartın"},{"number":183,"text":"İnsanların eşyasını değerden düşürüp-eksiltmeyin ve yeryüzünde bozguncular olarak karışıklık çıkarmayın"},{"number":184,"text":"Sizi ve önceki yaratılmışları yaratandan sakının”"},{"number":185,"text":"Dediler ki: \"Sen ancak büyülenmişlerdensin”"},{"number":186,"text":"Sen, yalnızca benzerimiz olan bir beşerden başkası değilsin ve biz senin gerçekte yalancılardan olduğunu sanıyoruz"},{"number":187,"text":"Eğer doğru sözlü isen, bu durumda gökten üstümüze bir parça düşürüver"},{"number":188,"text":"Dedi ki: \"Rabbim, yaptıklarınızı daha iyi bilir"},{"number":189,"text":"Sonunda onu yalanladılar, böylece onları o gölgelik-gününün azabı yakaladı. Gerçekten o, büyük bir günün azabıydı"},{"number":190,"text":"Gerçekten, bunda bir ayet vardır, ama onların çoğu iman etmiş değildirler"},{"number":191,"text":"Ve şüphesiz, senin Rabbin, güçlü ve üstün olandır, esirgeyendir"},{"number":192,"text":"Gerçekten o (Kur'an), alemlerin Rabbinin (bir) indirmesidir"},{"number":193,"text":"Onu Ruhu'l-emin indirdi"},{"number":194,"text":"Uyarıcılardan olman için, senin kalbinin üzerine (indirmiştir)"},{"number":195,"text":"Apaçık Arapça bir dille"},{"number":196,"text":"Ve hiç şüphesiz, o (Kur'an), geçmişlerin kitaplarında da vardır"},{"number":197,"text":"İsrailoğulları bilginlerinin onu bilmesi onlar için bir delil (ayet) değil mi"},{"number":198,"text":"Onu Arapça bilmeyen birine indirmiş olsaydık"},{"number":199,"text":"Böylece onlara okusaydı, yine ona iman edecek değillerdi"},{"number":200,"text":"Biz onu, suçlu-günahkarların kalbine işte böyle işlettik"},{"number":201,"text":"Onlar, o pek acı azabı görünceye kadar ona inanmazlar"},{"number":202,"text":"Artık o (azap), kendileri şuurunda olmadan onlara apansız gelecektir"},{"number":203,"text":"Derler ki: \"Bize bir süre tanınır mı"},{"number":204,"text":"Onlar yine de azabımızı çabuklaştırmak mı istiyorlar"},{"number":205,"text":"Gördün mü; Biz onları yıllarca yararlandırsak"},{"number":206,"text":"Sonra kendilerine va'dolunan (azap günü) geliverse"},{"number":207,"text":"Onların 'meta ile yararlandıkları' şey, kendilerini (görecekleri azaptan) bağımsız kılamaz"},{"number":208,"text":"Kendisi için bir uyarıcı olmaksızın, Biz hiçbir ülkeyi yıkıma uğratmış değiliz"},{"number":209,"text":"(Onlara) Hatırlatma (yapılmıştır); Biz zulmedici değiliz"},{"number":210,"text":"Onu (Kur'an'ı) şeytanlar indirmemiştir"},{"number":211,"text":"Bu, onlara yaraşmaz ve güç de yetiremezler"},{"number":212,"text":"Çünkü onlar, (vahyedileni) işitmekten kesin olarak uzak tutulmuşlardır"},{"number":213,"text":"Allah ile beraber başka bir İlah'a yalvarıp-yakarma, sonra azaba uğratılanlardan olursun"},{"number":214,"text":"(Öncelikle) En yakın hısımlarını (aşiretini) uyar"},{"number":215,"text":"Ve mü'minlerden, sana tabi olanlara (koruyucu) kanatlarını ger"},{"number":216,"text":"Eğer sana isyan edecek olurlarsa, artık de ki: \"Gerçekten ben, sizin yaptıklarınızdan uzağım"},{"number":217,"text":"Sen, O güçlü ve üstün, esirgeyici olan (Allah')a tevekkül et"},{"number":218,"text":"O, kıyam ettiğin zaman seni görüyor"},{"number":219,"text":"Secde edenler arasında dönüp dolaşmanı da"},{"number":220,"text":"Hiç şüphesiz, O, işitendir, bilendir"},{"number":221,"text":"Şeytanların kimlere inmekte olduklarını size haber vereyim mi"},{"number":222,"text":"Onlar, 'gerçeği ters yüz eden,' günaha düşkün olan her yalancıya inerler"},{"number":223,"text":"Bunlar (şeytanlara) kulak verirler ve çoğu yalan söylemektedirler"},{"number":224,"text":"Şairler ise; gerçekten onlara azgın-sapıklar uyar"},{"number":225,"text":"Görmedin mi; onlar, her bir vadide vehmedip duruyorlar"},{"number":226,"text":"Ve gerçekten onlar, yapmayacakları şeyleri söylüyorlar"},{"number":227,"text":"Ancak iman edenler, salih amellerde bulunanlar ve Allah'ı çokça zikredenler ile zulme uğratıldıktan sonra zafer kazananlar (veya öclerini alanlar) başka. Zulmetmekte olanlar, nasıl bir inkılaba uğrayıp devrileceklerini pek yakında bileceklerdir"}]}