{"number":37,"edition":"tr.bulac","ayahs":[{"number":1,"text":"Saflar halinde dizilenlere andolsun"},{"number":2,"text":"Haykırıp sürükleyenlere"},{"number":3,"text":"Zikir okuyanlara"},{"number":4,"text":"Tartışmasız, sizin İlahınız gerçekten birdir"},{"number":5,"text":"Göklerin, yerin ve ikisi arasında bulunanların Rabbidir, doğuların da Rabbidir"},{"number":6,"text":"Şüphesiz Biz dünya göğünü 'çekici bir süsle', yıldızlarla süsleyip-donattık"},{"number":7,"text":"Ve itaatten çıkmış her azgın şeytandan koruduk"},{"number":8,"text":"Ki onlar, Mele'i A'la'ya kulak verip dinleyemezler, her yandan kovulup atılırlar"},{"number":9,"text":"Uzaklaştırılırlar. Onlara kesintisiz bir azap vardır"},{"number":10,"text":"Ancak (sözü hırsızlama) çalıp-kapan olursa, artık onu da delip geçen 'yakıcı bir alev' izler (ve yok eder)"},{"number":11,"text":"Şimdi onlara sor: Yaratılış bakımından onlar mı daha zorlu, yoksa Bizim yarattıklarımız mı? Doğrusu Biz onları, cıvık-yapışkan bir çamurdan yarattık"},{"number":12,"text":"Hayır, sen (bu muhteşem yaratışa ve onların inkarına) şaşırdın kaldın; onlar ise alay edip duruyorlar"},{"number":13,"text":"Kendilerine öğüt verildiğinde, öğüt almıyorlar"},{"number":14,"text":"Bir ayet (mucize) gördüklerinde de, alay konusu edinip eğleniyorlar"},{"number":15,"text":"Bu, açıkça bir büyüden başkası değildir\" dediler"},{"number":16,"text":"Biz öldüğümüz, toprak ve kemik olduğumuzda mı, gerçekten biz mi diriltilecekmişiz"},{"number":17,"text":"Veya önceki atalarımız da mı"},{"number":18,"text":"De ki: \"Evet, üstelik boyun bükmüş kimseler olarak (diriltileceksiniz).”"},{"number":19,"text":"İşte o, yalnızca bir tek çığlıktan ibarettir; artık kendileri (diriltilmiş olarak) bakıp duruyorlar"},{"number":20,"text":"Derler ki: \"Eyvahlar bize; bu, din günüdür"},{"number":21,"text":"Bu, sizin yalanladığınız (mü'mini kafirden, haklıyı haksızdan) ayırma günüdür"},{"number":22,"text":"Zulmedenleri, eşlerini ve taptıklarını biraraya getirip toplayın"},{"number":23,"text":"Allah'tan başka (taptıklarını); artık onları cehennemin yoluna yöneltip götürün"},{"number":24,"text":"Ve onları durdurup-tutuklayın, çünkü sorguya çekileceklerdir"},{"number":25,"text":"(Onlara seslenilir:) \"Ne oluyor size, birbirinizle (dünyada olduğu gibi) yardımlaşmıyorsunuz"},{"number":26,"text":"Hayır, bugün onlar teslim olmuşlardır"},{"number":27,"text":"Kimi kimine yönelmiş olarak birbirlerine soruyorlar"},{"number":28,"text":"Gerçekten sizler bize sağdan (sağ duyudan ve haktan) yana gelip yanaşıyordunuz.\" derler"},{"number":29,"text":"(Diğerleri de:) \"Hayır\" derler. \"Zaten sizler mü'min kimseler değildiniz"},{"number":30,"text":"Bizim üzerinizde zorlayıcı hiçbir gücümüz yoktu; hayır siz (kendiniz) azgın bir kavimdiniz"},{"number":31,"text":"Böylece Rabbimiz'in sözü (yıkım ve azap va'di) üzerimize hak oldu. Şüphesiz, (azabı) tadıcılarız"},{"number":32,"text":"Evet, sizi azdırdık, çünkü biz de azgın kimselerdik"},{"number":33,"text":"Artık o gün onlar azapta ortaktırlar"},{"number":34,"text":"Doğrusu Biz, suçlu-günahkarlara böyle yaparız"},{"number":35,"text":"Çünkü onlara: \"Allah'tan başka İlah yoktur\" denildiği zaman, büyüklük taslarlardı"},{"number":36,"text":"Ve derlerdi ki: \"Biz, ünlenmiş bir şair için ilahlarımızı terk mi edeceğiz"},{"number":37,"text":"Hayır, o, hakkı getirmiş ve gönderilen (elçi)leri de doğrulamıştı"},{"number":38,"text":"Şüphesiz, siz, acı azabı tadıcılarsınız"},{"number":39,"text":"Yaptıklarınızdan başkasıyla cezalandırılmayacaksınız"},{"number":40,"text":"Ancak muhlis olan kullar başka"},{"number":41,"text":"İşte onlar; onlar için bilinen bir rızık vardır"},{"number":42,"text":"Çeşitli-meyveler. Onlar ikram görenlerdir"},{"number":43,"text":"Nimetlerle donatılmış (naim) cennetlerde"},{"number":44,"text":"Birbirlerine karşı, tahtlar üzerinde (otururlar)"},{"number":45,"text":"Kaynaktan (doldurulmuş) kadehlerle çevrelerinde dolaşılır"},{"number":46,"text":"Bembeyaz; içenlere lezzet (veren bir içki)"},{"number":47,"text":"Onda ne bir gaile vardır, ne de kendilerinden geçip, akılları çelinir"},{"number":48,"text":"Ve yanlarında bakışlarını yalnızca eşlerine çevirmiş iri gözlü kadınlar vardır"},{"number":49,"text":"Sanki onlar, saklı bir yumurta gibi (çarpıcı ve pürüzsüz)"},{"number":50,"text":"Böyleyken, kimi kimine yönelmiş olarak, birbirlerine soruyorlar"},{"number":51,"text":"Bir sözcü der ki: \"Benim bir yakınım vardı"},{"number":52,"text":"Derdi ki: Sen de gerçekten (dirilişi) doğrulayanlardan mısın"},{"number":53,"text":"Bizler öldüğümüz, toprak ve kemikler olduğumuzda mı, gerçekten biz mi (yeniden diriltilip sonra da) sorguya çekilecekmişiz"},{"number":54,"text":"(Konuşan yanındakilere) Der ki: \"Sizler (onun şimdi ne durumda olduğunu) biliyor musunuz"},{"number":55,"text":"Derken, bakıverdi, onu 'çılgınca yanan ateşin' tam ortasında gördü"},{"number":56,"text":"Dedi ki: \"Andolsun Allah'a, neredeyse beni de (şu bulunduğun yere) düşürecektin"},{"number":57,"text":"Eğer Rabbimin nimeti olmasaydı, muhakkak ben de (azap yerine getirilip) hazır bulundurulanlardan olacaktım"},{"number":58,"text":"Nasıl, biz ölecek olanlar değil miymişiz"},{"number":59,"text":"Yalnızca birinci ölümümüzden başka (öyle mi)? Ve biz azaba uğratılacak olanlar değil miymişiz"},{"number":60,"text":"Şüphesiz, bu, asıl büyük 'kurtuluş ve mutluluğun' ta kendisidir"},{"number":61,"text":"Böylece çalışanlar da bunun bir benzeri için çalışmalıdır"},{"number":62,"text":"Nasıl, böyle bir konaklanma mı daha hayırlı yoksa zakkum ağacı mı"},{"number":63,"text":"Doğrusu Biz, onu kafirler için bir fitne (bir imtihan konusu) kıldık"},{"number":64,"text":"Şüphesiz o, ‘çılgınca yanan ateşin’ dibinde bitip çıkar"},{"number":65,"text":"Onun tomurcukları, şeytanların başları gibidir"},{"number":66,"text":"Artık gerçekten, ondan yiyecekler böylelikle karınlarını ondan dolduracaklar"},{"number":67,"text":"Sonra kendileri için onun üzerinde kaynar su karıştırılmış bir içkileri de vardır"},{"number":68,"text":"Sonra onların dönecekleri yer, elbette (yine) çılgınca yanan ateştir"},{"number":69,"text":"Çünkü onlar, atalarını sapık kimseler olarak bulmuşlardı"},{"number":70,"text":"Kendileri de onları izleri üzerinde koşturup-duruyorlardı"},{"number":71,"text":"Andolsun, onlardan önce, evvelkilerin çoğu da sapmıştı"},{"number":72,"text":"Andolsun, Biz onlara uyarıcılar göndermiştik"},{"number":73,"text":"Uyarılanların nasıl bir sona uğradıklarına bir bak"},{"number":74,"text":"Ancak muhlis olan kullar başka"},{"number":75,"text":"Andolsun, Nuh Bize (dua edip) seslenmişti de, ne güzel icabet etmiştik"},{"number":76,"text":"Onu ve ailesini, o büyük üzüntüden kurtarmıştık"},{"number":77,"text":"Ve onun soyunu, (dünyada) onları da baki kıldık"},{"number":78,"text":"Sonra gelenler arasında ona (hayırlı ve şerefli bir isim) bıraktık"},{"number":79,"text":"Alemler içinde selam olsun Nuh’a"},{"number":80,"text":"Gerçekten Biz, ihsanda bulunanları böyle ödüllendiririz"},{"number":81,"text":"Şüphesiz o, Bizim mü’min olan kullarımızdandı"},{"number":82,"text":"Sonra diğerlerini suda boğduk"},{"number":83,"text":"Doğrusu İbrahim de onun (soyunun) bir kolundandır"},{"number":84,"text":"Hani o, Rabbine arınmış (selim) bir kalp ile gelmişti"},{"number":85,"text":"Hani babasına ve kavmine demişti ki: “Sizler neye tapıyorsunuz?”"},{"number":86,"text":"“Birtakım uydurma yalanlar için mi Allah’tan başka ilahlar istiyorsunuz?”"},{"number":87,"text":"“Alemlerin Rabbi hakkındaki zannınız nedir?”"},{"number":88,"text":"Sonra yıldızlara bir göz attı"},{"number":89,"text":"“Ben, doğrusu hastayım” dedi"},{"number":90,"text":"Böylelikle arkalarını çevirip ondan kaçmaya başladılar"},{"number":91,"text":"Bunun üzerine onların ilahlarına sokulup: “Yemek yemiyor musunuz?” dedi"},{"number":92,"text":"“Size ne oluyor ki konuşmuyorsunuz?”"},{"number":93,"text":"Derken onların üstüne yürüyüp sağ eliyle bir darbe indirdi"},{"number":94,"text":"Çok geçmeden (halkı) birbirine girmiş durumda kendisine yönelip geldiler"},{"number":95,"text":"Dedi ki: “Yontmakta olduğunuz şeylere mi tapıyorsunuz?”"},{"number":96,"text":"“Oysa sizi de, yapmakta olduklarınızı da Allah yaratmıştır.”"},{"number":97,"text":"Dediler ki: “Onun için (yüksekçe) bir bina inşa edin de onu çılgınca yanan ateşin içine atın.”"},{"number":98,"text":"Böylelikle ona bir tuzak hazırlamak istediler. Oysa Biz, onları alçaltılmışlar kıldık"},{"number":99,"text":"(İbrahim) Dedi ki: “Şüphesiz ben, Rabbime gidiciyim; O, beni hidayete erdirecektir.”"},{"number":100,"text":"“Rabbim, bana salihlerden (olan bir çocuk) armağan et.”"},{"number":101,"text":"Biz de onu halim bir çocukla müjdeledik"},{"number":102,"text":"Böylece (çocuk) onun yanında koşabilecek çağa erişince (İbrahim ona): “Oğlum” dedi. “Gerçekten ben seni rüyamda boğazlıyorken gördüm. Bir bak, sen ne düşünüyorsun.” (Oğlu İsmail) Dedi ki: “Babacığım, emrolunduğun şeyi yap. İnşaAllah, beni sabredenlerden bulacaksın.”"},{"number":103,"text":"Sonunda ikisi de (Allah’ın emrine ve takdirine) teslim olup (babası, İsmail’i kurban etmek için) onu alnı üzerine yatırdı"},{"number":104,"text":"Biz ona: “Ey İbrahim” diye seslendik"},{"number":105,"text":"“Gerçekten sen, rüyayı doğruladın. Şüphesiz Biz, ihsanda bulunanları böyle ödüllendiririz.”"},{"number":106,"text":"Doğrusu bu, apaçık bir imtihandı"},{"number":107,"text":"Ve ona büyük bir kurbanı fidye olarak verdik"},{"number":108,"text":"Sonra gelenler arasında ona (hayırlı ve şerefli bir isim) bıraktık"},{"number":109,"text":"İbrahim’e selam olsun"},{"number":110,"text":"Biz, ihsanda bulunanları böyle ödüllendiririz"},{"number":111,"text":"Şüphesiz o, Bizim mü’min olan kullarımızdandır"},{"number":112,"text":"Biz ona, salihlerden bir peygamber olarak İshak’ı da müjdeledik"},{"number":113,"text":"Ona ve İshak’a bereketler verdik. İkisinin soyundan, ihsanda bulunan (muhsin olan) da var, açıkça kendi nefsine zulmeden de"},{"number":114,"text":"Andolsun, Biz Musa’ya ve Harun’a lütufta bulunduk"},{"number":115,"text":"Onları ve kavimlerini o büyük üzüntüden kurtardık"},{"number":116,"text":"Onlara yardım ettik, böylece üstün gelenler oldular"},{"number":117,"text":"Ve ikisine anlatımı-açık kitabı verdik"},{"number":118,"text":"Onları dosdoğru yola yöneltip-ilettik"},{"number":119,"text":"Sonra gelenler arasında da ikisine (hayırlı ve şerefli bir isim) bıraktık"},{"number":120,"text":"Musa’ya ve Harun’a selam olsun"},{"number":121,"text":"Şüphesiz Biz, ihsanda bulunanları böyle ödüllendiririz"},{"number":122,"text":"Şüphesiz ikisi, Bizim mü’min olan kullarımızdandılar"},{"number":123,"text":"Gerçekten İlyas da, gönderilmiş (peygamber)lerdendi"},{"number":124,"text":"Hani kendi kavmine demişti ki: “Siz korkup sakınmaz mısınız?”"},{"number":125,"text":"“Siz Ba’le tapıp da Yaratıcıların en güzeli (olan Allah’ı) mı bırakıyorsunuz?”"},{"number":126,"text":"“Allah ki, sizin de Rabbiniz, önceki atalarınızın da Rabbidir.”"},{"number":127,"text":"Fakat onu yalanladılar; bundan dolayı gerçekten onlar, (azap için getirilip) hazır bulundurulacak olanlardır"},{"number":128,"text":"Ancak, muhlis olan kullar başka"},{"number":129,"text":"Sonra gelenler arasında ona (hayırlı ve şerefli bir isim) bıraktık"},{"number":130,"text":"İlyas’a selam olsun"},{"number":131,"text":"Şüphesiz Biz, ihsanda bulunanları böyle ödüllendiririz"},{"number":132,"text":"Şüphesiz o, Bizim mü’min olan kullarımızdandı"},{"number":133,"text":"Gerçekten Lût da gönderilmiş (elçi)lerdendi"},{"number":134,"text":"Hani Biz onu ve ailesini topluca kurtarmıştık"},{"number":135,"text":"Geride bırakılanlar arasında bir yaşlı kadın dışında"},{"number":136,"text":"Sonra geride kalanları yerle bir ettik"},{"number":137,"text":"Siz onların üstünden muhakkak geçip gidiyorsunuz; sabah vakti"},{"number":138,"text":"Ve geceleyin. Yine de akıllanmayacak mısınız"},{"number":139,"text":"Şüphesiz Yunus da gönderilmiş (elçi)lerdendi"},{"number":140,"text":"Hani o, dolu bir gemiye kaçmıştı"},{"number":141,"text":"Böylece kur’aya katılmıştı da, kaybedenlerden olmuştu"},{"number":142,"text":"Derken onu balık yutmuştu, oysa o kınanmıştı"},{"number":143,"text":"Eğer (Allah’ı çokça) tesbih edenlerden olmasaydı"},{"number":144,"text":"Onun karnında (insanların) dirilip-kaldırılacakları güne kadar kalakalmıştı"},{"number":145,"text":"Sonunda o hasta bir durumdayken çıplak bir yere (sahile) attık"},{"number":146,"text":"Ve üzerine, sık-geniş yaprakla (kabağa benzer) türden bir ağaç bitirdik"},{"number":147,"text":"Onu yüzbin veya (sayısı) daha da artan (bir topluluk)a (peygamber olarak) gönderdik"},{"number":148,"text":"Sonunda ona iman ettiler, Biz de onları bir süreye kadar yararlandırdık"},{"number":149,"text":"Şimdi sen onlara sor: -Kızlar senin Rabbinin, erkek çocuklar onların mı"},{"number":150,"text":"Yoksa onlar, şahidlik etmekteyken Biz melekleri dişiler olarak mı yarattık"},{"number":151,"text":"Dikkat edin; gerçekten onlar, düzdükleri yalanlardan dolayı derler ki"},{"number":152,"text":"“Allah doğurdu.” Onlar, hiç şüphesiz, muhakkak yalan söyleyenlerdir"},{"number":153,"text":"(Allah,) Kızları, erkek çocuklara tercih mi etmiş"},{"number":154,"text":"Size ne oluyor, nasıl hüküm veriyorsunuz"},{"number":155,"text":"Hiç mi öğüt alıp-düşünmüyorsunuz"},{"number":156,"text":"Yoksa sizin apaçık olan bir deliliniz mi var"},{"number":157,"text":"Eğer doğru söylüyorsanız, öyleyse getirin kitabınızı"},{"number":158,"text":"Onlar, Kendisi'yle (Allah ile) cinler arasında bir soy-bağı kurdular. Oysa andolsun, cinler de onların gerçekten (azap için getirilip) hazır bulundurulacaklarını bilmişlerdir"},{"number":159,"text":"Onların nitelendirdiklerinden Allah Yücedir"},{"number":160,"text":"Ancak muhlis olan kullar başka"},{"number":161,"text":"Artık siz de, tapmakta olduklarınız da"},{"number":162,"text":"O’na karşı kimseyi fitneye sürükleyecek değilsiniz"},{"number":163,"text":"Ancak kendisi çılgınca yanan ateşe girecek olan başka (onu sürüklersiniz)"},{"number":164,"text":"(Melekler der ki:) “Bizden her birimiz için belli bir makam vardır.”"},{"number":165,"text":"“Biziz, o saflar halinde dizilmiş olanlar, gerçekten biziz.”"},{"number":166,"text":"“Biziz, o tesbih edenler de, gerçekten biziz.”"},{"number":167,"text":"Onlar (putatapıcılar), her ne kadar şöyle diyor idiyseler de"},{"number":168,"text":"”Eğer yanımızda öncekilerden bir zikir (kitap) bulunmuş olsaydı.”"},{"number":169,"text":"“Gerçekten bizler de, Allah’ın muhlis olan kullarından olurduk.”"},{"number":170,"text":"Fakat (kitap gelince) onu tanımayıp-küfrettiler; yakında bileceklerdir"},{"number":171,"text":"Andolsun, (peygamber olarak) gönderilen kullarımıza (şu) sözümüz geçmiştir"},{"number":172,"text":"Gerçekten onlar, muhakkak nusret (yardım ve zafer) bulacaklardır"},{"number":173,"text":"Ve hiç şüphesiz; Bizim ordularımız, üstün gelecek olanlar onlardır"},{"number":174,"text":"Öyleyse sen, bir süreye kadar onlardan yüz çevir"},{"number":175,"text":"Ve onları seyret; (azabı) yakında göreceklerdir"},{"number":176,"text":"Şimdi onlar, Bizim azabımızı mı acele istiyorlar"},{"number":177,"text":"Fakat (azap) onların sahasına indiği zaman uyarılıp-korkutulanların sabahı ne kötü olur"},{"number":178,"text":"Sen bir süreye kadar onlardan yüz çevir"},{"number":179,"text":"Ve seyret; (azabı) yakında göreceklerdir"},{"number":180,"text":"Üstünlük ve güç (izzet) sahibi olan senin Rabbin, onların nitelendirdiklerinden Yücedir"},{"number":181,"text":"Gönderilmiş (peygamber)lere selam olsun"},{"number":182,"text":"Ve alemlerin Rabbi olan Allah’a hamd olsun"}]}