{"number":69,"edition":"tr.bulac","ayahs":[{"number":1,"text":"Elbette gerçekleşecek olan' (kıyamet)"},{"number":2,"text":"Nedir o 'muhakkak gerçekleşecek olan"},{"number":3,"text":"O gerçekleşecek olanı (kıyameti) sana bildiren nedir"},{"number":4,"text":"Semud ve Ad (toplumları), karia’yı yalan saydılar"},{"number":5,"text":"Bu nedenle Semud (halkı), korkunç bir sesle helak edildi"},{"number":6,"text":"Ad (halkın)a gelince; onlar da, uğultu yüklü, azgın bir kasırga ile helak edildiler"},{"number":7,"text":"(Allah) Onu, yedi gece ve sekiz gün, aralık vermeksizin üzerlerine musallat etti. Öyle ki, o kavmin, orada sanki içi kof hurma kütükleriymiş gibi çarpılıp yere yıkıldığını görürsün"},{"number":8,"text":"Şimdi onlardan hiç arta kalan (bir şey) görüyor musun"},{"number":9,"text":"Firavun (kavmi), ondan öncekiler ve yerle bir olan şehirler (halkı da hep) o hata ile (tarih sahnesine) geldiler"},{"number":10,"text":"Böylece Rablerinin elçisine isyan ettiler. Bu yüzden onları, şiddeti gittikçe artan bir yakalayışla yakaladı"},{"number":11,"text":"Gerçek şu ki, su taştığı zaman, o gemide Biz sizi taşıdık"},{"number":12,"text":"Öyle ki, onu sizlere bir ibret (hatırlatma ve öğüt) kılalım. 'Gerçeği belleyip kavrayabilen' kullar da onu belleyip-kavrasın"},{"number":13,"text":"Artık sur'a tek bir üfürülüşle üfürüleceği"},{"number":14,"text":"Yeryüzü ve dağlar yerlerinden oynatılıp kaldırılacağı, ardından tek bir çarpma ile birbirlerine çarpılıp parça parça olacağı zaman"},{"number":15,"text":"İşte o gün, vakıa (bir gerçek olan kıyamet) artık vukubulmuş (gerçekleşmiş)tur"},{"number":16,"text":"Gök yarılıp-çatlamıştır; artık o gün, 'sarkmış-za'fa uğramıştır"},{"number":17,"text":"Melek(ler) ise, onun çevresi üzerindedir. O gün, Rabbinin arşını onların da üstünde sekiz (melek) taşır"},{"number":18,"text":"Siz o gün arzolunursunuz; sizden yana hiçbir gizli (şey), gizli kalmaz"},{"number":19,"text":"Artık kitabı sağ-eline verilen kişi, der ki: \"Alın, kitabımı okuyun"},{"number":20,"text":"Çünkü ben, gerçekten hesabıma kavuşacağımı sanmış (anlamış)tım"},{"number":21,"text":"Artık o, hoşnut bir yaşama içindedir"},{"number":22,"text":"Yüksek bir cennette"},{"number":23,"text":"Devşirilecek (meyve ve eşsiz ürün)leri pek yakındır"},{"number":24,"text":"Geride kalan günlerde, 'peşin olarak sunduklarınıza karşılık olmak üzere,' afiyetle yiyin ve için"},{"number":25,"text":"Kitabı sol eline verilen ise; o da, der ki: \"Bana keşke kitabım verilmeseydi"},{"number":26,"text":"Hesabımı hiç bilmeseydim"},{"number":27,"text":"Keşke o (ölüm herşeyi) kesip bitirseydi"},{"number":28,"text":"Malım bana hiçbir yarar sağlayamadı"},{"number":29,"text":"Güç ve kudretim yok olup gitti"},{"number":30,"text":"(Allah buyruk verir:) \"Onu tutuklayın, hemen bağlayın"},{"number":31,"text":"Sonra çılgın alevlerin içine atın"},{"number":32,"text":"Daha sonra onu, uzunluğu yetmiş arşın olan bir zincire vurup gönderin"},{"number":33,"text":"Çünkü, o, büyük olan Allah'a iman etmiyordu"},{"number":34,"text":"Yoksula yemek vermeye destekçi olmazdı"},{"number":35,"text":"Bundan dolayı bugün, kendisine hiçbir sıcak dost yoktur"},{"number":36,"text":"İrin ve kan karışımından başka bir yemek yoktur"},{"number":37,"text":"Bunu da, hata edenlerden başkası yemez"},{"number":38,"text":"Hayır; gördüklerinize yemin ederim"},{"number":39,"text":"Görmediklerinize de"},{"number":40,"text":"Hiç şüphesiz o (Kur'an), şerefli bir elçinin kesin sözüdür"},{"number":41,"text":"O, bir şairin sözü değildir. Ne az inanıyorsunuz"},{"number":42,"text":"Bir kahinin de sözü değildir. Ne az öğüt alıp-düşünüyorsunuz"},{"number":43,"text":"Alemlerin Rabbinden bir indirilmedir"},{"number":44,"text":"Eğer o, Bize karşı bazı sözleri uydurup-söylemiş olsaydı"},{"number":45,"text":"Muhakkak onun sağ-elini (bütün güç ve kudretini) çekip-alıverirdik"},{"number":46,"text":"Sonra onun can damarını elbette keserdik"},{"number":47,"text":"O zaman, sizden hiç kimse araya girerek bunu kendisinden engelleyip-uzaklaştıramazdı"},{"number":48,"text":"Çünkü o (Kur'an, Allah'tan sakınan) muttakiler için bir öğüttür"},{"number":49,"text":"Elbette Biz, içinizde yalanlayanların bulunduğunu biliyoruz"},{"number":50,"text":"Gerçekten o (Kur'an), kafirler için bir hasrettir"},{"number":51,"text":"Ve şüphesiz o, kesin bir gerçektir (hakku'l-yakîn)"},{"number":52,"text":"Öyleyse, büyük Rabbini ismiyle tesbih et"}]}