{"number":38,"edition":"no.berg","ayahs":[{"number":1,"text":"Ved Koranen, som har formaningen"},{"number":2,"text":"Nei, de som er vantro befinner seg i overmot og tross"},{"number":3,"text":"Hvor mange slektledd har Vi vel utslettet før dem? De ropte, men det var ingen tid til å unnkomme"},{"number":4,"text":"Nå undrer de seg over at en advarer er kommet til dem fra deres egen krets, og de vantro sier: «Dette er en trollmann, som farer med løgn"},{"number":5,"text":"Har han gjort gudene til en eneste Gud? Dette er sannelig en selsom ting.»"},{"number":6,"text":"Rådmennene blant dem fjernet seg, og sa: «Gå hver til sitt, og hold fast ved deres guder! Dette er en planlagt ting"},{"number":7,"text":"Vi hørte ingenting om dette i den siste læren. Det er bare dikt"},{"number":8,"text":"Skulle formaningen åpenbares ham, av oss alle?» Ja, de er i tvil om Min formaning, men de har ennå ikke smakt Min straff"},{"number":9,"text":"Har de hånd om Herrens nådeskatter, den Mektiges, Giverens"},{"number":10,"text":"Har de herredømmet over himlene og jorden og det som mellom dem er? La dem så klatre opp i rep"},{"number":11,"text":"En hel hær av motstandsgrupper er slått på flukt her"},{"number":12,"text":"De holdt sannhet for løgn før deres tid, Noas folk, og Ad, og Farao med pyramidene"},{"number":13,"text":"og Thamod, og Lots folk, og Skogfolket. Dette var folk som stod imot"},{"number":14,"text":"Det var ingen som ikke holdt sendebudene for løgnere, og så ble Min straff realitet"},{"number":15,"text":"Dere kan bare vente et eneste rop, som ikke kan stanses"},{"number":16,"text":"men de sier: «Herre, skynd på med vår andel, før regnskapets dag.»"},{"number":17,"text":"Bær i tålmod det de sier, og kom i hu Vår tjener David, mektig og effektiv. Han var botferdig"},{"number":18,"text":"Sammen med ham påla Vi fjellene å gi lovprisning, om aftenen og ved soloppgang"},{"number":19,"text":"Likeså fuglene i skarer. Alt vendte seg mot Ham"},{"number":20,"text":"Vi styrket hans kongedømme, og gav ham visdom og domsevne"},{"number":21,"text":"Beretningen om tvistepartene har vel nådd deg, da de klatret inn i Helligdommen"},{"number":22,"text":"Da de kom inn til David, ble han redd for dem, og de sa: «Vær ikke redd! Vi er parter i en tvist, hvor den ene har krenket den annen. Døm du med rettferd mellom oss, og gjør ingen avvik, men vis oss en rett vei"},{"number":23,"text":"Denne min bror har niognitti får, og jeg har et eneste får, og så sa han: ’Overlat det til meg,’ og gikk hardt inn på meg i saken.»"},{"number":24,"text":"David sa: «Han har gjort urett mot deg ved å kreve ditt får i tillegg til sine egne. Mange sameiere gjør urett mot hverandre, unntatt slike som tror og lever rettskaffent, og de er få.» David trodde at Vi hadde stilt ham på prøve, og bad Herren om tilgivelse, og kastet seg ned og bøyet seg i bot"},{"number":25,"text":"Og Vi tilgav ham dette. Han har nærhets plass hos oss, et godt sted å komme til"},{"number":26,"text":"«David, Vi innsetter deg som en fullmektig på jorden! Så døm rett mellom menneskene, og følg ikke egne ideer, så det fører deg bort fra Guds vei. De som vandrer bort fra Guds vei, har streng straff i vente, fordi de har glemt regnskapets dag.»"},{"number":27,"text":"Vi har ikke skapt himmel og jord og det som mellom dem er for intet. Dette er de vantros mening. Men ve over de vantro, for Ilden skyld"},{"number":28,"text":"Skulle Vi sette dem som tror og lever rettskaffent på linje med dem som anstiller ufred og elendighet på jorden? Skulle Vi sette gudfryktige på linje med dem som lever i synd"},{"number":29,"text":"Dette er en velsignet skrift, som Vi har åpenbart deg, så de må meditere over dens ord og komme til ettertanke, de som har hjertets forstand"},{"number":30,"text":"Og Vi gav David Salomo. Hvilken utmerket tjener! Han var visselig botferdig"},{"number":31,"text":"Da de raske og spenstige hester ble ført frem for ham om aftenen"},{"number":32,"text":"sa han: «Jeg har nok foretrukket kjærligheten til denne verdens goder fremfor Herrens ihukommen, inntil solen skjulte seg bak nattens forheng"},{"number":33,"text":"Før dem tilbake til meg!» Og han begynte å stryke dem over lendene og halsene"},{"number":34,"text":"Vi har visselig satt Salomo på prøve, idet Vi plasserte på hans trone en skikkelse. Da gjorde han bot"},{"number":35,"text":"Han sa: «Herre, tilgi meg, og gi meg et kongedømme, som ikke må tilkomme noen etter meg! Du er Giveren!»"},{"number":36,"text":"Vi stilte vinden til hans disposisjon, så den på hans bud sakte beveget seg dit han ønsket"},{"number":37,"text":"Likeledes satanene, alle byggmestere og dykkere blant dem"},{"number":38,"text":"og andre, bundet sammen i lenker"},{"number":39,"text":"«Dette er Vår gave! Vær raus eller påholdende uten regnskap!»"},{"number":40,"text":"Han har nærhets plass hos Oss, et godt sted å komme til"},{"number":41,"text":"Omtal også Vår tjener Job, da han ropte til sin Herre: «Satan har rammet meg med elendighet og pine!»"},{"number":42,"text":"Vi sa: «Stamp med foten! Her er kjølig bad, og drikke.»"},{"number":43,"text":"Og Vi gav ham hans familie og andre nære, som en nådesbevisning fra oss, og en formaning for folk som har forstand"},{"number":44,"text":"Og videre. «Ta et knippe ris i din hånd, og slå med det, og svikt ikke!» Vi fant ham visselig standhaftig. Hvilken utmerket tjener! Han var botferdig"},{"number":45,"text":"Omtal også Våre tjenere Abraham, Isak og Jakob, mektige og effektive, og med innsikt"},{"number":46,"text":"Vi viet dem særlig til Husets ihukommelse"},{"number":47,"text":"De hører hos oss til de utvalgte, de beste"},{"number":48,"text":"Omtal også Våre tjenere Ismael, Elisa og Dhul-Kifl! Alle hørte til de beste"},{"number":49,"text":"Dette er en formaning. De gudfryktige har et godt sted å komme til"},{"number":50,"text":"Edens haver med vidåpne porter"},{"number":51,"text":"hvor de ligger tilbakelenet, og ber om rikelig med frukt og drikke"},{"number":52,"text":"De har hos seg jevnaldrende kvinner med blyge blikk"},{"number":53,"text":"«Dette er det dere ble lovet til regnskapets dag"},{"number":54,"text":"Dette er Vår omsorg, som ikke tar ende.»"},{"number":55,"text":"Slik er det. Men de oppsetsige har et dårlig sted å komme til"},{"number":56,"text":"helvete, hvor de stekes, et sørgelig hvilested"},{"number":57,"text":"Slik er det. Så la dem smake det, kokende vann og eiter"},{"number":58,"text":"og annet av samme slag, alt slått sammen"},{"number":59,"text":"Her er en flokk, som kommer hodekulls inn til dere! Det er ingen velkomsthilsen for dem, de skal stekes i Ilden"},{"number":60,"text":"De vil si: «Nei, ingen velkomsthilsen for dere! Det er dere som har stelt i stand dette for oss.» For et sørgelig sted å være"},{"number":61,"text":"Og de fortsetter: «Herre, gi dem som har stelt i stand dette for oss, dobbelt straff i Ilden!»"},{"number":62,"text":"Og videre: «Hvordan kan det ha seg at vi ikke ser menn her"},{"number":63,"text":"som vi regnet blant de onde. Drev vi spott med dem med urette? Eller har vi sett forbi dem?»"},{"number":64,"text":"Dette er visselig sant, helvetesfolket krangler innbyrdes"},{"number":65,"text":"Si: «Jeg er bare en advarer. Det er ingen gud utenom Gud, den Ene, den Uovervinnelige"},{"number":66,"text":"Herren over himlene og jorden, og det som mellom dem er, den Mektige, den Ettergivende.»"},{"number":67,"text":"Si: «Det er stor meddelelse"},{"number":68,"text":"som dere vender dere bort fra"},{"number":69,"text":"Jeg har ingen kunnskap om det himmelske råd, da de diskuterte"},{"number":70,"text":"Kun dette er meg åpenbart, jeg er bare en klar advarer.»"},{"number":71,"text":"En gang sa Herren til englene: «Jeg vil skape mennesket av leire"},{"number":72,"text":"Når Jeg har formet ham og innblåst Min ånd i ham, så skal dere falle ham til fote.»"},{"number":73,"text":"Og englene falt ned alle sammen"},{"number":74,"text":"unntatt Iblis. Han var hovmodig, og hørte til de vantro"},{"number":75,"text":"Han sa: «Nå Iblis, hva hindret deg i å falle ned for det Jeg har skapt med mine hender? Er du hovmodig, eller er du blitt stor på det?»"},{"number":76,"text":"Han svarte: «Jeg er bedre enn ham! Du skapte meg av ild, og ham skapte Du av leire.»"},{"number":77,"text":"Han sa: «Ut med deg herfra! Du er forkastet"},{"number":78,"text":"Min forbannelse skal hvile over deg til dommens dag.»"},{"number":79,"text":"Han svarte: «Se det an med meg til den dag de gjenoppvekkes.»"},{"number":80,"text":"Han sa: «Du er av dem det vil bli sett an med"},{"number":81,"text":"til en bestemt tids dag.»"},{"number":82,"text":"Han svarte: «Ved Din allmakt! Jeg skal føre dem vill alle sammen"},{"number":83,"text":"unntatt Dine oppriktige tjenere blant dem.»"},{"number":84,"text":"Han sa: «Dette står fast, det Jeg sier står fast"},{"number":85,"text":"Jeg vil fylle helvete med deg og alle dem som følger deg.»"},{"number":86,"text":"Si: «Jeg ber dere ikke om noen lønn for dette, og jeg er ikke av dem som gir seg av med geskjeftighet.»"},{"number":87,"text":"Dette er en formaning for all verden"},{"number":88,"text":"Dere vil nok lære nyheten om den å kjenne etter noen tid"}]}