{"number":83,"edition":"pl.bielawskiego","ayahs":[{"number":1,"text":"Biada oszustom"},{"number":2,"text":"Tym, którzy kiedy otrzymują, domagają się od ludzi pełnej miary"},{"number":3,"text":"A kiedy mierzą lub ważą dla nich, to przyczyniają się do ich straty"},{"number":4,"text":"Czyż oni nie myślą, iż będą wskrzeszeni"},{"number":5,"text":"Dnia wielkiego"},{"number":6,"text":"Dnia, kiedy ludzie staną przed Panem światów"},{"number":7,"text":"Wcale nie! Zaprawdę, księga ludzi występnych znajduje się w Sidżdżinie"},{"number":8,"text":"A co ciebie pouczy, co to jest Sidżdżin"},{"number":9,"text":"To jest księga zapisana"},{"number":10,"text":"Biada tego Dnia tym, którzy pomawiają o kłamstwo"},{"number":11,"text":"Tym, którzy uważają za kłamstwo Dzień Sądu"},{"number":12,"text":"Za kłamstwo uważa go tylko każdy człowiek występny, grzeszny"},{"number":13,"text":"Kiedy mu recytują Nasze znaki, on mówi: \"To są baśnie praojców"},{"number":14,"text":"Ależ nie! Przeciwnie, rdza uczynków pokryła ich serca"},{"number":15,"text":"Wcale nie! Zaprawdę, oni tego Dnia będą oddzieleni od swego Pana"},{"number":16,"text":"Potem będą się palić w piekle"},{"number":17,"text":"Wtedy będzie im powiedziane: \"To jest to, co uważaliście za kłamstwo"},{"number":18,"text":"Wcale nie tak! Zaprawdę, księga sprawiedliwych jest w Illijjun"},{"number":19,"text":"A co ciebie pouczy, co to jest Illijjun"},{"number":20,"text":"To jest księga zapisana"},{"number":21,"text":"Będą świadkami jej owi blisko dopuszczeni"},{"number":22,"text":"Zaprawdę, sprawiedliwi zaznają szczęśliwości"},{"number":23,"text":"Spoczywając na łożach, będą spoglądać"},{"number":24,"text":"Na ich twarzach poznasz blask szczęśliwości"},{"number":25,"text":"Będą pojeni winem szlachetnym, pieczętowanym"},{"number":26,"text":"Pieczęcią jego będzie piżmo - niech się starają pragnący tego, współzawodnicząc pilnie w staraniach"},{"number":27,"text":"A domieszką jego będzie woda z Tasnim"},{"number":28,"text":"źródła, z którego pić będą owi blisko dopuszczeni"},{"number":29,"text":"Zaprawdę, ci, którzy zgrzeszyli, naśmiewali się z tych, którzy uwierzyli"},{"number":30,"text":"Kiedy przechodzili mimo nich, wymieniali między sobą spojrzenia"},{"number":31,"text":"A kiedy powracali do swoich domowników, stroili żarty"},{"number":32,"text":"A kiedy ich widzieli, mówili: \"Zaprawdę, oni są zbłąkani"},{"number":33,"text":"Lecz oni nie zostali posłani, aby być ich stróżami"},{"number":34,"text":"Jednak dzisiaj ci, którzy uwierzyli, śmieją się z niewiernych"},{"number":35,"text":"Spoczywając na łożach, spoglądają"},{"number":36,"text":"Czyż niewierni zostali wynagrodzeni za to, co czynili"}]}