{"number":21,"edition":"it.piccardo","ayahs":[{"number":1,"text":"Si avvicina per gli uomini la resa dei loro conti, mentre essi incuranti, trascurano"},{"number":2,"text":"Non giunse loro alcun Monito, da parte del loro Signore, che non ascoltassero irriverenti"},{"number":3,"text":"con i cuori distratti, mentre gli ingiusti tengono tra loro segreti conciliaboli: “Chi è costui, se non un uomo come voi? Volete lasciarvi andare alla magia, voi che lucidamente vedete?”"},{"number":4,"text":"Disse: “Il mio Signore conosce [ogni] parola [pronunciata] nel cielo e sulla terra, Egli tutto ascolta e conosce”"},{"number":5,"text":"Dissero: “Sono invece incubi confusi! O è lui che li ha inventati. Non è che un poeta! Ci mostri piuttosto un segno, come quelli che furono inviati agli antichi [profeti]”"},{"number":6,"text":"Tutte le comunità, che facemmo perire prima di loro, non credettero. Crederanno questi"},{"number":7,"text":"Prima di te, non inviammo che uomini ai quali comunicammo la Rivelazione. Chiedete alla gente della Scrittura, se non lo sapete"},{"number":8,"text":"Non ne facemmo corpi che facessero a meno del cibo, e neppure erano eterni"},{"number":9,"text":"Realizzammo su di loro la promessa: salvammo loro e quelli che volemmo, e facemmo perire i prevaricatori"},{"number":10,"text":"In verità, abbiamo fatto scendere su di voi un Libro contenente il Monito per voi. Non comprenderete"},{"number":11,"text":"Quante ingiuste città distruggemmo, per suscitare poi un altro popolo"},{"number":12,"text":"Quando avvertirono la Nostra severità, fuggirono precipitosamente"},{"number":13,"text":"“Non fuggite, ritornate nel lusso e nelle vostre case! Forse ve ne sarà chiesto conto.”"},{"number":14,"text":"Dissero: “Guai a noi! Invero, siamo stati ingiusti!”"},{"number":15,"text":"Non smisero di gridarlo, finché ne facemmo messi falciate, senza vita"},{"number":16,"text":"Non è per gioco che creammo il cielo e la terra e quel che vi è frammezzo"},{"number":17,"text":"Se avessimo voluto divertirci, lo avremmo fatto presso Noi stessi, se mai avessimo voluto farlo"},{"number":18,"text":"E invece no, scagliamo la verità sulla menzogna, che le schiacci la testa, ed ecco che essa scompare. Siate maledetti per quello che affermate"},{"number":19,"text":"Solo a Lui, appartengono tutti quelli che sono nei cieli e sulla terra! Coloro che sono presso di Lui, non disdegnano di adorarLo e non se ne stancano"},{"number":20,"text":"Lo glorificano notte e giorno, ininterrottamente"},{"number":21,"text":"[oppure] han tratto dalla terra divinità che risuscitano"},{"number":22,"text":"Se nei cieli e sulla terra ci fossero altre divinità, oltre ad Allah, già gli uni e l'altra sarebbero corrotti. Gloria ad Allah, Signore del Trono, ben al di sopra di quello che Gli attribuiscono"},{"number":23,"text":"Non sarà Lui ad essere interrogato, sono loro che lo saranno"},{"number":24,"text":"Si sono presi dèi, all'infuori di Lui? Di': “Mostrate la vostra prova!”. Questo è un Monito per coloro che sono con me e per coloro che furono prima di me; ma la maggior parte di essi non conoscono la verità e se ne discostano"},{"number":25,"text":"Non inviammo prima di te nessun messaggero senza rivelargli: “Non c'è altro dio che Me. AdorateMi!”"},{"number":26,"text":"Dicono: “Il Compassionevole Si è preso un figlio”. Gloria a Lui, quelli non sono che servi onorati"},{"number":27,"text":"che mai precedono il Suo dire e che agiscono secondo il Suo ordine"},{"number":28,"text":"Egli conosce quel che li precede e quel che li segue, ed essi non intercedono se non in favore di coloro di cui Si compiace, e sono compenetrati di timor di Lui"},{"number":29,"text":"Chi di loro dicesse: “Davvero, io sono un dio all'infuori di Lui”, lo compenseremo con l'Inferno. È così che compensiamo gli ingiusti"},{"number":30,"text":"Non sanno dunque i miscredenti che i cieli e la terra formavano una massa compatta? Poi li separammo e traemmo dall'acqua ogni essere vivente. Ancora non credono"},{"number":31,"text":"Abbiamo infisso sulla terra le montagne, affinché non oscilli coinvolgendoli e vi ponemmo larghi passi. Si sapranno dirigere"},{"number":32,"text":"E del cielo abbiamo fatto una volta sicura. Eppure essi si distolgono dai segni"},{"number":33,"text":"Egli è Colui Che ha creato la notte e il giorno, il sole e la luna: ciascuno naviga nella sua orbita"},{"number":34,"text":"Non concedemmo l'immortalità a nessuno uomo che ti ha preceduto. Dovresti forse morire, se essi fossero immortali"},{"number":35,"text":"Ogni anima gusterà la morte. Vi sottoporremo alla tentazione con il male e con il bene, e poi a Noi sarete ricondotti"},{"number":36,"text":"Quando i miscredenti ti vedono, non fanno che burlarsi di te: “Cosa? È costui che dice male dei vostri dèi?”, e negano il Monito del Compassionevole"},{"number":37,"text":"L'uomo è stato creato di impazienza. Vi mostrerò i Miei segni. Non chiedeteMi di affrettarli"},{"number":38,"text":"Dicono: “Quando [si realizzerà] questa promessa? [Ditecelo] se siete veritieri”"},{"number":39,"text":"Ah! Se i miscredenti conoscessero il momento in cui non potranno allontanare il fuoco dai loro volti e dalle loro schiene e non potranno essere soccorsi"},{"number":40,"text":"E invece giungerà loro all'improvviso, e ne saranno sbalorditi. Non potranno allontanarlo e non sarà dato loro un rinvio"},{"number":41,"text":"Già furono derisi i messaggeri che ti precedettero. Ciò di cui si burlavano, avvolgerà coloro che deridevano"},{"number":42,"text":"Di': “Chi potrebbe mai proteggervi, notte e giorno, dal Compassionevole?”. E invece sono indifferenti al Monito del loro Signore"},{"number":43,"text":"Dispongono forse, all'infuori di Noi, di dèi che sappiano proteggerli? Questi non possono neppure difendere loro stessi, né trovare altri che li difendano contro di Noi"},{"number":44,"text":"In effetti, concedemmo a loro e ai loro avi un godimento effimero, finché non furono longevi. Non vedono che investiamo la terra, riducendola da ogni lato? Sono forse loro i vincitori"},{"number":45,"text":"Di': “Non faccio altro che avvertirvi con la Rivelazione”. Ma i sordi non odono il richiamo quando li si avverte"},{"number":46,"text":"Se solo li sfiorasse un alito del castigo del tuo Signore, certamente direbbero: “Guai a noi, invero, siamo stati ingiusti!”"},{"number":47,"text":"Rizzeremo bilance esatte, nel Giorno della Resurrezione e nessuna anima subirà alcun torto; foss'anche del peso di un granello di senape, lo riesumeremo. Basteremo Noi a tirare le somme"},{"number":48,"text":"In verità demmo a Mosè e ad Aronne il Discrimine, una Luce e un Monito per i pii"},{"number":49,"text":"che temono il loro Signore in quello che è invisibile e che trepidano per l'Ora"},{"number":50,"text":"Questo è un Monito benedetto che abbiamo fatto scendere. Lo rinnegherete"},{"number":51,"text":"Siamo Noi che conducemmo Abramo sulla retta via, Noi che lo conoscevamo"},{"number":52,"text":"Quando disse a suo padre e alla sua gente: “Cosa sono queste statue in cui credete?”"},{"number":53,"text":"Risposero: “Trovammo i nostri avi che le adoravano”"},{"number":54,"text":"Disse: “Certo siete stati nell'errore più palese, voi e i vostri avi”"},{"number":55,"text":"Dissero: “Sei venuto con la Verità o stai scherzando?”"},{"number":56,"text":"Disse: “Certo che no! Il vostro Signore è il Signore dei cieli e della terra, è Lui Che li ha creati e io sono tra coloro che lo attestano"},{"number":57,"text":"E [giuro] per Allah che tramerò contro i vostri idoli, non appena volterete le spalle!”"},{"number":58,"text":"E infatti li ridusse in briciole, eccetto il più grande, affinché si rivolgessero ad esso"},{"number":59,"text":"Dissero: “Chi ha fatto questo ai nostri dèi, è certo un iniquo!”"},{"number":60,"text":"Disse [qualcuno di loro]: “Abbiamo sentito un giovane che li disprezzava: si chiama Abramo”"},{"number":61,"text":"Dissero: “Conducetelo al loro cospetto, affinché possano testimoniare”"},{"number":62,"text":"Dissero: “O Abramo, sei stato tu a far questo ai nostri dèi?”"},{"number":63,"text":"Disse: “È il più grande di loro che lo ha fatto. Interrogateli, se possono parlare!”"},{"number":64,"text":"Si avvidero del loro imbarazzo e dissero tra loro: “Davvero siete stati ingiusti”"},{"number":65,"text":"Fecero un voltafaccia [e dissero]: “Ben sai, che essi non parlano!”"},{"number":66,"text":"Disse: “Adorate all'infuori di Allah qualcuno che non vi giova e non vi nuoce"},{"number":67,"text":"Vergognatevi di voi stessi e di ciò che adorate all'infuori di Allah! Non ragionate dunque?”"},{"number":68,"text":"Dissero: “Bruciatelo e andate in aiuto dei vostri dèi, se siete [in grado] di farlo”"},{"number":69,"text":"Dicemmo: “Fuoco, sii frescura e pace per Abramo”"},{"number":70,"text":"Tramarono contro di lui, ma facemmo sì che fossero loro i perdenti"},{"number":71,"text":"Salvammo lui e Lot e [li guidammo] verso una terra che colmammo di benedizione per i popoli"},{"number":72,"text":"E gli demmo Isacco e Giacobbe e ne facemmo dei devoti"},{"number":73,"text":"Ne facemmo capi che dirigessero le genti secondo il Nostro ordine. Rivelammo loro di fare il bene, di osservare l'orazione e di versare la decima. Erano Nostri adoratori"},{"number":74,"text":"E a Lot demmo saggezza e scienza e lo salvammo dalla città in cui si commettevano turpitudini: in verità erano un popolo malvagio e perverso"},{"number":75,"text":"lo facemmo entrare nella Nostra misericordia. Egli era davvero un devoto"},{"number":76,"text":"E quando in precedenza Noè implorò, Noi gli rispondemmo e lo salvammo dal terribile cataclisma, insieme con la sua famiglia"},{"number":77,"text":"Gli prestammo soccorso contro la gente che smentiva i Nostri segni. Erano davvero uomini malvagi: tutti li annegammo"},{"number":78,"text":"Davide e Salomone giudicarono a proposito di un campo coltivato che un gregge di montoni appartenente a certa gente aveva devastato pascolandovi di notte. Fummo testimoni del loro giudizio"},{"number":79,"text":"Facemmo sì che Salomone comprendesse [correttamente]. Demmo ad entrambi saggezza e scienza. Costringemmo le montagne a rendere gloria insieme con Davide e gli uccelli insieme. Siamo Noi che lo abbiamo fatto"},{"number":80,"text":"Gli insegnammo, a vostro vantaggio, la fabbricazione delle cotte di maglia, affinché vi proteggessero dalla vostra stessa violenza. Ne sarete mai riconoscenti"},{"number":81,"text":"E [sottomettemmo] il vento impetuoso a Salomone: al suo ordine soffiava sulla terra che abbiamo benedetta. Noi conosciamo ogni cosa"},{"number":82,"text":"E fra i dèmoni alcuni si tuffavano per lui e compivano altre opere ancora; eravamo Noi a sorvegliarli"},{"number":83,"text":"E si rivolse Giobbe al suo Signore: “Il male mi ha colpito, ma Tu sei il più misericordioso dei misericordiosi!”"},{"number":84,"text":"Gli rispondemmo e lo sollevammo dal male che lo affliggeva e gli restituimmo la sua famiglia e un'altra ancora, segno di misericordia da parte Nostra e Monito per coloro che [Ci] adorano"},{"number":85,"text":"E Ismaele e Idris e Dhû 'l-Kifl! Tutti furono perseveranti"},{"number":86,"text":"che facemmo beneficiare della Nostra misericordia: tutti erano dei devoti"},{"number":87,"text":"E l'Uomo del Pesce, quando se ne andò irritato. Pensava che non potessimo niente contro di lui. Poi implorò così nelle tenebre: “Non c'è altro dio all'infuori di Te! Gloria a Te! Io sono stato un ingiusto!”"},{"number":88,"text":"Gli rispondemmo e lo salvammo dalla disperazione. Così salviamo coloro che credono"},{"number":89,"text":"E Zaccaria si rivolse al suo Signore: “Non lasciarmi solo, Signore, Tu sei il migliore degli eredi”"},{"number":90,"text":"Lo esaudimmo e gli demmo Giovanni e sanammo la sua sposa. In verità tendevano al bene, Ci invocavano con amore e trepidazione, ed erano umili davanti a Noi"},{"number":91,"text":"E [ricorda] colei che ha mantenuto la sua castità! Insufflammo in essa del Nostro Spirito e facemmo di lei e di suo figlio un segno per i mondi"},{"number":92,"text":"Sì, questa vostra Comunità è un'unica Comunità e Io sono il vostro Signore. AdorateMi"},{"number":93,"text":"Si divisero invece. Ma infine tutti a Noi faranno ritorno"},{"number":94,"text":"Chi compie il bene ed è credente non vedrà disconosciuto il suo sforzo, ché Noi lo registriamo"},{"number":95,"text":"[Agli abitanti] delle città che facemmo perire è vietato ritornare [al mondo]"},{"number":96,"text":"fino al momento in cui si scateneranno Gog e Magog e dilagheranno da ogni altura"},{"number":97,"text":"La vera promessa si approssima e gli sguardi dei miscredenti si fanno sbarrati: “Guai a noi! Siamo stati distratti. Peggio ancora, siamo stati ingiusti!”"},{"number":98,"text":"“Voi e quelli che adoravate all'infuori di Allah, sarete combustibile dell'Inferno. Non potrete evitarlo"},{"number":99,"text":"Se quegli altri fossero stati dèi, non vi sarebbero entrati. Vi rimarranno tutti in perpetuo"},{"number":100,"text":"Colà gemeranno, ma nessuno li ascolterà.”"},{"number":101,"text":"Ne saranno esclusi coloro per i quali il Nostro bene ha avuto il sopravvento"},{"number":102,"text":"non ne sentiranno il fragore e godranno per sempre quel che le loro anime desiderano"},{"number":103,"text":"Non li affliggerà la grande angoscia e gli angeli li accoglieranno: “Ecco il Giorno che vi era stato promesso”"},{"number":104,"text":"Il Giorno, in cui avvolgeremo il cielo come gli scritti sono avvolti in rotoli. Come iniziammo la prima creazione, così la reitereremo; è Nostra promessa: saremo Noi a farlo"},{"number":105,"text":"Lo abbiamo scritto nel Salterio, dopo che venne il Monito: “La terra sarà ereditata dai Miei servi devoti”"},{"number":106,"text":"In verità, in ciò vi è un messaggio per un popolo di adoratori"},{"number":107,"text":"Non ti mandammo se non come misericordia per il creato"},{"number":108,"text":"Di': “In verità, mi è stato rivelato che il vostro Dio è un Dio unico. Sarete musulmani?”"},{"number":109,"text":"Se poi volgono le spalle, allora di': “Io vi ho avvertiti tutti, senza discriminazioni; ma non so se ciò che vi è stato promesso è prossimo o lontano"},{"number":110,"text":"Egli conosce quello che proclamate e quello che tenete segreto"},{"number":111,"text":"Non so se ciò sia una tentazione per voi, un effimero godimento!”"},{"number":112,"text":"Di': “Mio Signore, giudica secondo verità! Il nostro Signore è il Compassionevole, da Lui invochiamo aiuto contro ciò che affermate”"}]}