{"number":15,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Elif, Lâm, Râ. İşte sana o Kitap'ın ve açık anlatımlı Kur'an'ın ayetleri"},{"number":2,"text":"O küfre batmış olanlar zaman zaman, keşke Müslüman olsaydılar diye derin bir özlem duyarlar"},{"number":3,"text":"Bırak onları yesinler, nimetlenip zevk etsinler ve sonu gelmez arzu kendilerini oyalasın. Ama yakında bilecekler"},{"number":4,"text":"Biz hiçbir yurt ve medeniyeti, belirlenmiş bir yazgısı olmaksızın ortadan kaldırmadık"},{"number":5,"text":"Hiçbir ümmet kendisi için belirlenen sürenin ne önüne geçebilir ne de o süreyi geriletebilir"},{"number":6,"text":"Şöyle haykırdılar: \"Hey! Kendisine o zikir/Kur'an indirilen! Sen gerçekten tam bir delisin"},{"number":7,"text":"Hadi getirsene bize o melekleri, eğer doğru sözlülerdensen"},{"number":8,"text":"Biz o melekleri ancak ve ancak hak üzere, hak bir yolla indiririz. Ve o zaman inkârcılara göz açtırılmaz"},{"number":9,"text":"Hiç kuşkusuz, o zikiri/Kur'an'ı biz indirdik, biz; her hal ve şartta onu muhakkak koruyacak olan da biziz"},{"number":10,"text":"Yemin olsun ki, senden öncekilerin o ilk kümeleri içine de nebiler gönderdik biz"},{"number":11,"text":"Onlara bir Tanrı elçisi gelir gelmez, onunla mutlaka alay ederlerdi"},{"number":12,"text":"Biz ona, günaha batmışların gönüllerinde böyle bir yol veririz"},{"number":13,"text":"Ona inanmazlar. Oysaki, öncekilerin yol ve yöntemleri gözlerinin önünden geçmiştir"},{"number":14,"text":"Üzerlerine gökten bir kapı açsak da oradan yükseliyor olsalardı"},{"number":15,"text":"Kesinlikle şöyle diyeceklerdi: \"Bizim gözlerimiz döndürüldü, bakışlarımız sarhoş edildi. Belki de biz büyüye çarptırılmış bir toplumuz"},{"number":16,"text":"Yemin olsun, biz gökte burçlar oluşturduk ve onu/onları, seyredenler için süsledik"},{"number":17,"text":"Ve onu/onları, her kovulup taşlanmış şeytandan koruduk"},{"number":18,"text":"Ancak kulak hırsızlığı eden olur; onun peşine de parlak bir ateş alevi düşer"},{"number":19,"text":"Yeri yayıp döşedik, ona kuvvetli dağlar diktik ve içinde ölçülü/ahenkli her şeyden bitirdik"},{"number":20,"text":"Orada sizin için ve rızıklandırıcısı siz olmadığınız kimse için geçimlikler yarattık"},{"number":21,"text":"Hiçbir şey yoktur ki, hazineleri bizim yanımızda olmasın. Ama biz onu ancak belirli bir ölçüde/bir kaderle indiririz"},{"number":22,"text":"Rüzgârları dölleyiciler olarak gönderdik; gökten bir su indirdik de onunla sizi suvardık. Onun depolayıcıları siz değilsiniz"},{"number":23,"text":"Biz, elbette biz, hayat veriyoruz; biz öldürüyoruz. Ve biziz Vâris olanlar/mirasçı kalanlar"},{"number":24,"text":"Yemin olsun, sizin önden gidenlerinizi bilmişizdir; yemin olsun, geriye kalanları da bilmişizdir"},{"number":25,"text":"Hiç kuşkusuz, Rabbindir, evet O'dur onları haşredecek olan. Hakîmdir O, Alîm'dir"},{"number":26,"text":"Yemin olsun, biz insanı; kuru çamurdan, değişken-cıvık bir balçıktan yarattık"},{"number":27,"text":"Cini/İblis'i de daha önce kavurucu ateşten yaratmıştık"},{"number":28,"text":"Hatırla o zamanı ki Rabbin meleklere, \"Ben, kupkuru bir çamurdan, değişken, cıvık balçıktan bir insan yaratacağım.\" demişti"},{"number":29,"text":"Onu, amaçlanan düzgünlüğe ulaştırıp öz ruhumdan içine üflediğim zaman, önünde hemen secdeye kapanın"},{"number":30,"text":"Meleklerin tümü, toplu halde secde ettiler"},{"number":31,"text":"İblis müstesna. O, secde edenlerle beraber olmaya karşı çıktı"},{"number":32,"text":"Allah dedi: \"Ey İblis! Sana ne oluyor da secde edenlerle beraber olmuyorsun"},{"number":33,"text":"Dedi: \"Kuru bir çamurdan, değişken-cıvık bir balçıktan yarattığın bir insana secde etmek için var olmadım"},{"number":34,"text":"Buyurdu: \"Öyleyse çık oradan, çünkü kovuldun"},{"number":35,"text":"Din gününe kadar üzerinde lanet var"},{"number":36,"text":"Dedi: \"Rabbim, onların diriltileceği güne kadar bana süre ver"},{"number":37,"text":"Buyurdu: \"Hadi, süre verilenlerdensin"},{"number":38,"text":"Bilinen vaktin gününe kadar"},{"number":39,"text":"Dedi: \"Rabbim! Beni azdırmana yemin ederim ki, yeryüzünde onlar için mutlaka süslemeler yapacağım ve onların tümünü kesinlikle azdıracağım"},{"number":40,"text":"İçlerinden riyaya sapmamış, samimi kulların müstesna"},{"number":41,"text":"Buyurdu: \"İşte bana varan dosdoğru yol budur"},{"number":42,"text":"Benim kullarım aleyhine senin elinde hiçbir güç/kanıt olmayacak. Azgınların seni izleyenleri müstesna"},{"number":43,"text":"Cehennem onların tümünün şaşmaz buluşma yeridir"},{"number":44,"text":"Yedi kapısı vardır onun. Her kapıya onlardan bir bölük ayrılmıştır"},{"number":45,"text":"Sakınılması gereken şeylerden sakınanlar ise cennetlerde pınarlar içindedir"},{"number":46,"text":"Güvene kavuşmuş olarak selamla girin oraya"},{"number":47,"text":"Göğüslerindeki düşmanlığı çekip almışızdır. Köşkler/divanlar üzerinde karşı karşıya oturan kardeşler olmuşlardır"},{"number":48,"text":"Orada kendilerine zahmet/yorgunluk dokunmaz. Oradan çıkarılmazlar da"},{"number":49,"text":"Haber ver kullarıma: Hiç kuşkusuz benim, evet benim, Gafûr ve Rahîm"},{"number":50,"text":"Ama acıklı azabın ta kendisidir benim azabım"},{"number":51,"text":"Onlara İbrahim'in misafirlerinden bahset"},{"number":52,"text":"Hani onun yanına girmişlerdi de \"Selam!\" demişlerdi. O da \"Biz sizden korkuyoruz.\" diye konuşmuştu"},{"number":53,"text":"Korkma! Biz sana bilgin bir oğlan müjdeliyoruz.\" dediler"},{"number":54,"text":"Dedi: \"İhtiyarlık yakama yapıştıktan sonra mı bana müjde veriyorsunuz! Neye dayanarak müjde veriyorsunuz"},{"number":55,"text":"Dediler: \"Hakk'a dayanarak müjdeledik sana, sakın ümitsizliğe düşenlerden olma"},{"number":56,"text":"Dedi: \"Sapıtmışlardan başka kim ümit keser Rabbin rahmetinden"},{"number":57,"text":"Amacınız nedir ey elçiler?\" diye sordu"},{"number":58,"text":"Dediler: \"Biz günahkâr bir topluluğa gönderildik"},{"number":59,"text":"Yalnız Lût'un ailesi suçlu değildir. Biz onların hepsini kurtaracağız"},{"number":60,"text":"Lût'un karısı hariç. O günahkârlarla geride kalacaktır. Öyle takdir ettik"},{"number":61,"text":"Elçiler Lût ailesine geldiklerinde"},{"number":62,"text":"Lût: \"Siz tanınmayan kimselersiniz.\" dedi"},{"number":63,"text":"Dediler: \"Sana öyle bir şey getirdik ki, onun hakkında kuşkulanıp duruyorlardı"},{"number":64,"text":"Sana gerçeği getirdik. Biz, özü-sözü doğru olanlarız"},{"number":65,"text":"Gecenin bir yerinde aileni yola çıkar. Sen de arkalarından onları izle. Hiçbiriniz geri dönüp bakmasın. Emredildiğiniz yere kadar gidin"},{"number":66,"text":"Ona şu emri bir hüküm olarak ilettik: Şunlar, kökleri kesilmiş olarak sabahlayacaklardır"},{"number":67,"text":"Şehir halkı geldi. Muştulanmış olmanın sevincini yaşıyorlardı"},{"number":68,"text":"Lût dedi: \"Bunlar benim konuklarımdır, aman beni utandırmayın"},{"number":69,"text":"Allah'tan korkun, beni rezil etmeyin"},{"number":70,"text":"Dediler: \"Seni elâlemin işiyle uğraşmaktan men etmemiş miydik"},{"number":71,"text":"Lût dedi: \"Eğer bir şey yapacaksanız, işte kızlarım"},{"number":72,"text":"Senin ömrüne yemin olsun ki onlar, kendi sersemlikleri içinde bocalıyorlardı"},{"number":73,"text":"Nihayet o korkunç titreşimli ses, onları güneş doğarken yakaladı"},{"number":74,"text":"O kentin üstünü altına getirdik/üst düzeydekileri alt düzeye indirdik. Ve üzerlerine pişmiş çamurdan taşlar yağdırdık"},{"number":75,"text":"Hiç kuşkusuz, bunda, işaretlerden anlam çıkaranlar için ibretler vardır"},{"number":76,"text":"O kentin izleri/işaretleri, hâlâ işleyen bir yol üzerindedir"},{"number":77,"text":"İnananlar için bunda elbette bir ibret vardır"},{"number":78,"text":"Eyke halkı da gerçekten zalim insanlardı"},{"number":79,"text":"Onlardan intikam aldık. Her ikisi önde, belirgin bir biçimde durmaktadır"},{"number":80,"text":"Yemin olsun, Hicr halkı da gönderilen elçileri yalanladı"},{"number":81,"text":"Ayetlerimizi onlara verdik ama onlardan yüz çeviriyorlardı"},{"number":82,"text":"Dağlardan güvenli güvenli evler yontuyorlardı"},{"number":83,"text":"Korkunç titreşimli ses onları da sabaha girecekleri sırada yakaladı"},{"number":84,"text":"Kazanıp durdukları şeylerin kendilerine hiçbir yararı olmadı"},{"number":85,"text":"Biz gökleri, yeri ve bunların arasındakileri hak olarak yarattık. O saat elbette gelecektir. Şimdi sen, uzanan elleri tut, güzel davran"},{"number":86,"text":"Kuşkusuz senin Rabbin, evet o, Hallâk'tır, hiç durmadan yaratır; en iyi şekilde bilir"},{"number":87,"text":"Yemin olsun ki, biz sana ikişerlerden/ikililerden/iç içe kıvrımlar halindeki çift mânalılardan yedi taneyi ve şu büyük Kur'an'ı verdik"},{"number":88,"text":"Sakın, onlardan bazı çiftlere verdiğimiz nimet ve zevklere gözlerini dikme. Onlar için tasalanma da. Müminler için kanadını indir sen"},{"number":89,"text":"Ve de ki: \"Ben, evet ben, apaçık konuşan bir uyarıcıyım"},{"number":90,"text":"Aynı şekilde, o bölücülere/yemin edip duranlara da beyyineler indirmiştik"},{"number":91,"text":"Onlar ki Kur'an'ı parça parça/bölük bölük/falcılık aracı yaptılar"},{"number":92,"text":"Rabbine yemin olsun ki, biz onları toplu halde sorgu suale çekeceğiz/hepsinden mutlaka hesap soracağız"},{"number":93,"text":"Yapıp ettiklerinden"},{"number":94,"text":"Emrolunduğun şeyi, kafalarını çatlatırcasına tebliğ et; şirke bulaşmışlara aldırma"},{"number":95,"text":"Alay edip eğlenenlere karşı biz sana yeteriz"},{"number":96,"text":"Allah ile beraber başka tanrılar benimseyenler yakında bilecekler"},{"number":97,"text":"Yemin olsun ki, onların söyledikleri yüzünden senin göğsünün daraldığını biliyoruz"},{"number":98,"text":"Şimdi sen, Rabbine hamt ile tespih et ve secde edenlerden ol"},{"number":99,"text":"Sana şaşmaz ve kesin bilgi gelinceye kadar Rabbine ibadet et"}]}