{"number":44,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Hâ, Mîm"},{"number":2,"text":"O ayan-beyan gösteren Kitap'a yemin olsun ki"},{"number":3,"text":"Biz onu kutlu/bereketli bir gecede indirdik. Hiç kuşkusuz, biz uyarıcılarız"},{"number":4,"text":"Hikmetlerle dolu her iş ve oluş o gecede ayırt edilir"},{"number":5,"text":"Katımızdan bir emir olarak. Hiç kuşkusuz biz, resuller göndeririz"},{"number":6,"text":"Senin Rabbinden bir rahmet olarak. Hiç kuşkusuz O, gereğince duyan, gereğince bilendir"},{"number":7,"text":"Göklerin, yerin ve bunlar arasındakilerin Rabbidir O, eğer görürcesine biliyor iseniz"},{"number":8,"text":"Tanrı yoktur O'ndan başka! Diriltir ve öldürür. Sizin de Rabbinizdir O, önceki atalarınızın da Rabbidir"},{"number":9,"text":"İş, onların sandığı gibi değil! Bir kuşku içinde oynayıp oyalanmaktadırlar"},{"number":10,"text":"Artık sen göğün açıkça izlenen bir duman getireceği günü gözle"},{"number":11,"text":"İnsanları kuşatıp sarar. İnletici bir azaptır bu"},{"number":12,"text":"Ey Rabbimiz, kaldır bizden bu azabı. Biz gerçekten müminleriz"},{"number":13,"text":"Nerede onlarda öğüt almak? Yemin olsun, delillerle açıklayan bir resul gelmişti onlara"},{"number":14,"text":"Ama ondan yüz çevirdiler ve şöyle dediler: \"Eğitilmiş bir mecnun"},{"number":15,"text":"Biz azabı biraz kaldırırız; siz eski halinize tekrar dönersiniz"},{"number":16,"text":"Gün gelir, en büyük vuruşla vururuz biz. Şu bir gerçek ki, intikam da alırız biz"},{"number":17,"text":"Kudretimize yemin olsun ki, onlardan önce Firavun'un kavmini de ince bir imtihana çektik de, asil ve onurlu bir resul geldi onlara"},{"number":18,"text":"Şöyle sesleniyordu: \"Ey Allah'ın kulları, bana gelin! Çünkü ben sizin için güvenilir bir resulüm"},{"number":19,"text":"Allah'a karşı ululuk taslamayın! Ben size apaçık bir kanıt getirmekteyim"},{"number":20,"text":"Ben, beni taşlamınzdan Rabbim ve Rabbinize sığındım"},{"number":21,"text":"Bana inanmadınızsa bari benden uzak durun"},{"number":22,"text":"Sonra Rabbine, \"Bunlar suç işleyen bir topluluktur.\" diye yakardı"},{"number":23,"text":"Bunun üzerine, Allah buyurdu: \"O halde kullarımı geceleyin yola çıkar, çünkü takip edileceksiniz"},{"number":24,"text":"Denizi açık bırak, çünkü onlar, boğulmaya mahkûm edilmiş bir ordudur"},{"number":25,"text":"Geriye nice bahçeler, nice pınarlar bıraktılar"},{"number":26,"text":"Nice ekinler, nice seçkin makamlar"},{"number":27,"text":"İçinde zevk sürdükleri nice nimetler"},{"number":28,"text":"İşte böyle! Onlara başka bir toplumu mirasçı kıldık"},{"number":29,"text":"Gök de ağlamadı onlar için yer de. Yüzlerine bakılmadı bile"},{"number":30,"text":"Yemin olsun, İsrailoğullarını, rezil edici bir azaptan kurtardık"},{"number":31,"text":"Firavun'dan kurtardık. Firavun, haddi aşanların büyüklük taslayanlarından biriydi"},{"number":32,"text":"Yemin olsun, biz onları bir ilim sayesinde âlemlere üstün kılmıştık"},{"number":33,"text":"Onlara, içinde açık bir imtihan bulunan ayetler vermiştik"},{"number":34,"text":"Şimdi, şunlar tutmuş diyorlar ki"},{"number":35,"text":"İlk ölümümüzden başkası yok! Biz diriltilecek filan değiliz"},{"number":36,"text":"Eğer doğru sözlülerseniz, atalarımızı geri getirin"},{"number":37,"text":"Onlar mı hayırlı yoksa Tübba' halkıyla onlardan önce gelenler mi? Onları helâk ettik; çünkü onlar, suç işlemiş insanlardı"},{"number":38,"text":"Biz gökleri, yeri ve bunlar arasındakileri eğlenmek için yaratmadık"},{"number":39,"text":"İkisini de, sadece gerçeği göstermek üzere yarattık. Ama onların çokları bilmiyorlar"},{"number":40,"text":"Hiç kuşkusuz, ayrım günü, hepsinin buluşma zamanıdır/buluşma yeridir"},{"number":41,"text":"Bir gündür ki o, dostun dosta yararı olmaz. Onlara yardım da edilmez"},{"number":42,"text":"Allah'ın rahmet ettiği kimse müstesna. Allah Azîz'dir, Rahîm'dir"},{"number":43,"text":"Şu bir gerçek ki zakkum ağacı"},{"number":44,"text":"Suçluların yemeğidir"},{"number":45,"text":"Erimiş maden misali, karınlarda kaynar"},{"number":46,"text":"Sıcak suyun kaynaması gibi"},{"number":47,"text":"Tutun onu, cehennemin tam ortasına götürün"},{"number":48,"text":"Sonra başının üstüne, kaynar su azabından dökün"},{"number":49,"text":"Tat bakalım! Hani sen onurluydun, seçkindin"},{"number":50,"text":"İşte budur o kuşkulanıp durduğunuz şey"},{"number":51,"text":"Korunup sakınanlar, güvenli bir makamdadır"},{"number":52,"text":"Bahçelerde, pınar başlarında"},{"number":53,"text":"İnce ipekten, parlak atlastan giymiş olarak, karşılıklı oturmaktadırlar"},{"number":54,"text":"İşte böyle! Onları iri gözlü hurilerle de eşleştirmişizdir"},{"number":55,"text":"Orada, güvenli bir biçimde her türlü meyveyi isterler"},{"number":56,"text":"Orada, ilk ölüm dışında ölüm tatmazlar. Allah onları cehennem azabından korumuştur"},{"number":57,"text":"Rabbinden bir lütuf olarak böyledir. İşte budur o büyük başarı"},{"number":58,"text":"Biz o Kur'an'ı senin dilinle/senin diline kolaylaştırdık ki, düşünüp öğüt alabilsinler"},{"number":59,"text":"Artık, beklemeye geç! Çünkü onlar da beklemekteler"}]}