{"number":45,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Hâ, Mîm"},{"number":2,"text":"Azîz ve Hakîm olan Allah'tan Kitap'ın indirilişidir bu"},{"number":3,"text":"Kuşkusuz, göklerde ve yerde, iman sahipleri için sayısız ayetler vardır"},{"number":4,"text":"Ve sizin yaratılışınızda, her yana yaydığı canlılarda, kesinliği yakalayan bir topluluk için ibretler, işaretler vardır"},{"number":5,"text":"Geceyle gündüzün birbiri ardınca gelişinde, Allah'ın gökten bir rızık indirip de onunla yerküreyi ölümünden sonra hayata kavuşturmasında, rüzgârların herbir yana sevkedilişinde de aklını çalıştıran bir topluluk için izler, işaretler vardır"},{"number":6,"text":"İşte bunlar, Allah'ın ayetleridir ki, onları sana hak olarak okuyoruz. Hal böyle iken Allah'tan ve onun ayetlerinden sonra hangi hadise/söze inanıyorlar"},{"number":7,"text":"Yazıklar ve azaplar olsun günaha batmış her yalancı iftiracıya"},{"number":8,"text":"Ki Allah'ın ayetlerinin kendisine okunuşunu dinler, sonra böbürlenmiş olarak inadında devam eder. Sanki hiç duymamıştır onları. Artık acıklı bir azapla muştula böylesini"},{"number":9,"text":"Ayetlerimizden birşeyin bilgisine ulaşınca, alaya aldı onu. İşte onlar içindir horlayıp yere batıran bir azap"},{"number":10,"text":"Arkalarından cehennem! Kazanmış oldukları da Allah dışında edindikleri veliler de onlara hiçbir yarar sağlamayacaktır. Çok büyük bir azap vardır onlar için"},{"number":11,"text":"İyiye ve güzele bir kılavuzdur bu! Rablerinin ayetlerini inkâr edenler için, korkunç bir pislik azabı öngörülmüştür"},{"number":12,"text":"Allah size denizi boyun eğdirdi ki, içinde gemiler O'nun emriyle akıp gitsin, lütfundan istekte bulunasınız ve şükredebilesiniz"},{"number":13,"text":"Göklerde ne var, yerde ne varsa tümünü, O'ndan bir lütuf olarak size boyun eğdirmiştir. Bunda, derin derin düşünen bir topluluk için elbette ibretler vardır"},{"number":14,"text":"İman edenlere söyle: \"Allah'ın günlerini ummayanları affetsinler ki, O, bir toplumu kazandıklarıyla cezalandırsın"},{"number":15,"text":"Kim hayra ve barışa yönelik bir iş yaparsa kendi lehinedir. Kötülük yapan da kendi aleyhine yapmış olur. Sonunda Rabbinize döndürülürsünüz"},{"number":16,"text":"Yemin olsun, biz, İsrailoğullarına Kitap'ı, hükmetme gücünü, peygamberliği verdik, onları temiz yiyeceklerden rızıklandırdık ve kendilerini âlemler üzerine imtiyazlı kıldık"},{"number":17,"text":"Onlara, iş ve yönetime ilişkin açık-seçik belgeler verdik. Onlar, kendilerine ilim geldikten sonra, aralarındaki azgınlık ve kıskançlık yüzünden ihtilafa düştüler. Hiç kuşkusuz, Rabbin, onlar arasında, tartışıp durdukları şeyle ilgili olarak kıyamet günü hüküm verecektir"},{"number":18,"text":"Daha sonra seni, iş ve yönetimde bir şerîat/bir yol-yöntem üzerine koyduk. Artık ona uy! Bilmeyenlerin keyifleri ardınca gitme"},{"number":19,"text":"Kuşkun olmasın ki onlar, Allah karşısında sana hiçbir yarar sağlayamazlar/Allah'tan gelecek hiçbir şeyi senden uzaklaştıramazlar. Zalimler birbirlerinin dostlarıdır; Allah ise takvaya sarılanların Velî'sidir"},{"number":20,"text":"Bu Kur'an, insanların kalp gözlerini açacak ışıklardan oluşur. Gereğince inanan bir toplum için de bir kılavuz ve bir rahmettir o"},{"number":21,"text":"Kötülüklere cesaretle dalanlar sanıyorlar mı ki, biz kendilerini, iman edip hayra ve barışa yönelik işler yapanlarla aynı tutacağız? Hayatları ve ölümleri onlarla aynı mı olacak?! Ne kötü hüküm veriyorlar bunlar"},{"number":22,"text":"Ve Allah, gökleri ve yeri hak olarak yarattı. Ta ki her benlik, kazancının karşılığıyla, hiç kimse zulme uğratılmaksızın, yüz yüze getirilsin"},{"number":23,"text":"Kendisinin ilahı olarak kendi duygu ve arzusunu almış kişiyi gördün mü? Allah onu bir ilim üzerine saptırmış, kulağı ve kalbi üzerine mühür basmış, gözünün üstüne de bir perde çekmiştir. Allah'tan sonra ona kim kılavuzluk edecektir. Hâlâ düşünüp ibret almıyor musunuz"},{"number":24,"text":"Dediler ki: \"Şu dünya hayatımızdan başkası yok. Ölüyoruz, diriliyoruz. Bizi zamandan başkası helâk etmiyor.\" Onların bu konuda hiçbir bilgisi yoktur. Sadece sanıda bulunuyorlar"},{"number":25,"text":"Ayetlerimiz, karşılarında açık-seçik mesajlar halinde okunduğunda, delilleri sadece şöyle demek olmuştur: \"Doğru sözlüler iseniz atalarımızı getirin"},{"number":26,"text":"De ki: \"Sizi Allah yaşatıyor; sonra sizi öldürecek, sonra da o hakkında hiç kuşku bulunmayan kıyamet gününde biraraya getirecek. Ama insanların çokları bilmiyorlar"},{"number":27,"text":"Göklerin ve yerin mülkü/saltanatı Allah'ındır. Kıyamet kopunca, işte o gün, gerçekleri hükümsüz kılanlar hüsrana uğrayacaklardır"},{"number":28,"text":"O gün tüm ümmetleri, toplanıp diz çökmüş görürsün. Her ümmet kendi kitabına davet edilir. Bugün, yapıp-ettiklerinizin karşılığıyla yüzyüze getirileceksiniz"},{"number":29,"text":"Bu bizim kitabımız, karşınızda gerçeği söylüyor. Çünkü biz, yapıp-ettiklerinizin kopyasını çıkarıyorduk/yaptıklarınızı kaydediyorduk"},{"number":30,"text":"İman edip hayra ve barışa yönelik işler yapanların durumu şu: Rableri onları rahmetine sokacaktır. İşte açık zafer budur"},{"number":31,"text":"İnkâr ve nankörlüğe sapmış olanlara gelince, onlara şöyle denecek: \"Ayetlerimiz karşınızda okunurdu ama siz büyüklük taslardınız, suç işleyen bir toplum oldunuz, öyle değil mi"},{"number":32,"text":"Hani, size, \"Hiç kuşkusuz, Allah'ın vaadi haktır, kıyamet saatinde de şüphe yoktur\" dendiğinde, siz şöyle demiştiniz: \"Saat nedir, bilmiyoruz. Sadece bir şeyler var sanıyoruz; kesin bir bilgimiz olmadığı için inanmıyoruz"},{"number":33,"text":"Yaptıklarının kötülükleri karşılarına dikilmiş, alay edip durdukları şey kendilerini kuşatıvermiştir"},{"number":34,"text":"Şöyle denilir: \"Unutuyoruz sizi bugün! Tıpkı sizin, bugününüze kavuşmayı unuttuğunuz gibi. İşte böyle! Sığınağınız ateştir; hiçbir yardımcınız da olmayacaktır"},{"number":35,"text":"Bunun sebebi şudur: \"Siz, Allah'ın ayetlerini eğlence aracı yaptınız, dünya hayatı sizi aldattı/gurura itti. Bugün ateşten çıkarılmayacaklar, özür dilemeleri de kabul edilmeyecek"},{"number":36,"text":"Hamt; göklerin Rabbi, yerin Rabbi, âlemlerin Rabbi olan Allah'adır"},{"number":37,"text":"Göklerde ve yerde ululuk/büyüklük O'nundur! Azîz'dir O, Hakîm'dir"}]}