{"number":52,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Yemin olsun Tûra"},{"number":2,"text":"Satır satır yazılmış Kitap'a"},{"number":3,"text":"Ki açılıp yayılmış ince deri üzerine yazılmıştır"},{"number":4,"text":"Yemin olsun düzenli bir biçimde bakılan o eve"},{"number":5,"text":"Yemin olsun yükseltilmiş tavana"},{"number":6,"text":"Yemin olsun o alevlerle kaynatılıp köpürtülmüş denize"},{"number":7,"text":"Ki hiç kuşkusuz, senin Rabbinin azabı meydana gelecektir"},{"number":8,"text":"Ona engel olacak hiçbir şey yoktur"},{"number":9,"text":"O gün gök bir çalkanışla çalkanır"},{"number":10,"text":"Ve dağlar bir yürüyüşle yürür"},{"number":11,"text":"Vay hallerine o gün, yalanlayanların"},{"number":12,"text":"Ki onlar bir batağa dalmış oynamaktadırlar"},{"number":13,"text":"O gün cehenneme bir kakılışla kakılırlar"},{"number":14,"text":"İşte budur yalanlayıp durduğunuz ateş"},{"number":15,"text":"Bu da mı büyü?! Yoksa siz mi görmüyordunuz"},{"number":16,"text":"Dalın ona! Artık ister sabredin ister sabretmeyin. Sizin için hepsi birdir. Siz ancak yapıp ettiğiniz şeylerin karşılığıyla yüzyüze geleceksiniz"},{"number":17,"text":"Korunup sakınanlar; cennetler, nimetler içindedir"},{"number":18,"text":"Rablerinin kendilerine verdikleriyle keyif çatarlar. Rableri onları cehennem azabından korumuştur"},{"number":19,"text":"Yapıp ettiklerinizin karşılığı olarak afiyetle yiyin, için"},{"number":20,"text":"Art arda dizilmiş koltuklar üzerinde yaslanmış olarak.\" Ve biz onları parlak, iri gözlü hurilerle eşleştirmişizdir"},{"number":21,"text":"İman edip zürriyetleri de imanda kendilerine uyanların, soy-soplarını da kendilerine katmışızdır. Ve kendi amellerinden kendilerinin hiçbir şeyini eksiltmemişizdir. Her kişi, kazandığı karşılığında bir rehindir"},{"number":22,"text":"Biz onlara canlarının çektiği meyveden ve etten ikram ettik"},{"number":23,"text":"Orada bir kadeh tokuştururlar ki, içinde ne bir boş laf var ne de günaha sokuş"},{"number":24,"text":"Çevrelerinde, kendilerine özgülenmiş genç uşaklar dolaşır; sanki sedeflerinde saklı inciler"},{"number":25,"text":"Birbirlerine dönüp soruşurlar. Ve derler"},{"number":26,"text":"Daha önce biz, ailemiz içinde endişe ile ürperiyorduk"},{"number":27,"text":"Allah bize lütufta bulundu ve bizi o iliklere işleyen azaptan korudu"},{"number":28,"text":"Biz önceden O'na yakarıyorduk. Çünkü O'dur Berr, cömertçe iyilik eden; O'dur rahmeti sınırsız olan"},{"number":29,"text":"Artık hatırlat, öğüt ver! Rabbinin nimetine yemin olsun ki, sen ne kâhinsin ne de cin çarpmış"},{"number":30,"text":"Yoksa şöyle mi diyorlar: \"O bir şairdir. Zamanın ölüm getiren felaketine çarpılmasını bekliyoruz"},{"number":31,"text":"De ki: \"Bekleyin! Doğrusu sizinle beraber ben de bekleyenlerdenim"},{"number":32,"text":"Acaba bunu onlara hayalleri mi emrediyor yoksa bunlar azmış bir topluluk mu"},{"number":33,"text":"Yoksa, \"Onu uydurdu\" mu diyorlar! Hayır, iman etmiyorlar"},{"number":34,"text":"Eğer doğru sözlü iseler, onun benzeri bir hadis/söz getirsinler"},{"number":35,"text":"Yoksa onlar hiçbir şeysiz mi yaratıldılar? Yoksa bizzat kendileri mi yaratıcıdır"},{"number":36,"text":"Yoksa gökleri ve yeri onlar mı yarattı? Hayır, onlar gerekli bilgiye ulaşamıyorlar"},{"number":37,"text":"Yoksa Rabbinin hazineleri onların yanında mı? Yoksa güç ve egemenlik sahibi onlar mı"},{"number":38,"text":"Yoksa onlara özgü bir merdiven var da onun üzerinde mi dinliyorlar? Eğer böyleyse, dinleyenleri açık bir kanıt getirsin"},{"number":39,"text":"Yoksa kızlar O'na, oğullar size mi"},{"number":40,"text":"Yoksa sen onlardan bir ücret istiyorsun da bir borç yüzünden onlar, yük altına mı giriyorlar"},{"number":41,"text":"Yoksa gayb yanlarında da yazıp duruyorlar mı"},{"number":42,"text":"Yoksa bir tuzak mı kurmak istiyorlar? Doğrusu şu ki, o inkâr edenlerin kendileri tuzağa yakalanmışlardır"},{"number":43,"text":"Yoksa Allah'tan başka bir ilahları mı var? Uzaktır Allah, onların ortak koştuklarından"},{"number":44,"text":"Gökten bir parçanın düştüğünü görseler şöyle derler: \"Üstüste yığılmış bulutlar"},{"number":45,"text":"Bayılıp yere serilecekleri günlerine kavuşuncaya kadar bırak onları"},{"number":46,"text":"O gün, tuzakları kendilerine bir yarar sağlamayacak; onlara yardım da edilmeyecek"},{"number":47,"text":"Zulmedenler için bundan başka bir azap da vardır. Fakat onların çokları bilmiyorlar"},{"number":48,"text":"Rabbinin hükmüne sabret! Kuşkusuz, sen bizim gözlerimizin önündesin. Kalktığında, Rabbinin hamdiyle tespih et"},{"number":49,"text":"Gecenin bir bölümünde ve yıldızların ardından da O'nu tespih et"}]}