{"number":54,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Saat yaklaştı, Ay yarıldı"},{"number":2,"text":"Bir ayet-alâmet görseler yüz çeviriyorlar ve şöyle diyorlar: \"Sürüp giden bir büyüdür bu"},{"number":3,"text":"Yalanladılar; kendi heves ve kuruntularına uydular. Oysaki her iş ve oluş karara, ölçüye ve düzene bağlanmıştır"},{"number":4,"text":"Yemin olsun ki, onlara haberlerden, içinde ihtar, sakındırma ve tehdit bulunanı gelmiştir"},{"number":5,"text":"Doruk noktaya çıkmış, isabeti tartışmasız bir hikmettir o. Ama uyarılar yarar sağlamıyor"},{"number":6,"text":"O halde yüz çevir onlardan sen de; o çağırıcının alışılmadık/ürpertirci şeye çağırdığı günde"},{"number":7,"text":"Kaymış olarak gözleri, çıkarlar kabirlerden. Sanki çekirgelerdir, çıvgın mı çıvgın"},{"number":8,"text":"Boyunları büküktür çağıranın önünde. Derler ki o küfre saplananlar: \"Çok zorlu bir gün bu"},{"number":9,"text":"Onlardan önce Nûh kavmi yalanlamıştı. Yalanladılar kulumuzu ve \"Mecnundur bu!\" dediler. Ve durduruldu kulumuz"},{"number":10,"text":"Bunun üzerine yakardı Rabbine, \"Yenilgiye uğradım işte, yardım et!\" diye"},{"number":11,"text":"Biz de açtık gök kapılarını seller gibi akan bir su ile"},{"number":12,"text":"Ve yardık/fışkırttık yeryüzünü pınar pınar. Sonunda kesin ölçülere bağlanmış bir oluş üzere birleşti sular"},{"number":13,"text":"Ve taşıdık onu levhalar ve çivilerden oluşturulan şey üstünde"},{"number":14,"text":"Akıp gidiyordu gözlerimizin önünde, bir ödül olarak nankörlüğe uğratılan kişi için"},{"number":15,"text":"Yemin olsun ki, biz onu bir ibret ve işaret olarak arkaya bıraktık. Yok mu araştırıp öğüt alacak"},{"number":16,"text":"Nasılmış benim azabım ve uyarılarım"},{"number":17,"text":"Yemin olsun ki, biz, Kur'an'ı öğüt ve ibret için kolaylaştırdık. Fakat düşünen mi var"},{"number":18,"text":"Âd da yalanlamıştı. Ama nasıl oldu azabım ve uyarılarım"},{"number":19,"text":"Biz onların üzerine uğursuzluğu kesiksiz bir günde, dondurucu/uğultulu bir kasırga gönderdik"},{"number":20,"text":"İnsanları, köklerinden sökülmüş hurma kütükleri gibi kaldırıp atıyordu"},{"number":21,"text":"Nasılmış benim azabım ve uyarılarım"},{"number":22,"text":"Yemin olsun ki, biz, Kur'an'ı öğüt ve ibret için kolaylaştırdık. Fakat düşünen mi var"},{"number":23,"text":"Semûd da uyarıları yalanlamıştı"},{"number":24,"text":"Şöyle demişlerdi: \"İçimizden bir tek insana mı uyacağız? Vallahi böyle bir durumda biz, sapıklık ve çılgınlık içine düşeriz"},{"number":25,"text":"Aramızdan öğüt ona mı verildi? Hayır, o yalancı küstahın biridir"},{"number":26,"text":"Yarın bilecekler, kimmiş yalancı küstah"},{"number":27,"text":"Bir imtihan aracı olarak kendilerine dişi deveyi göndereceğiz. Artık gözetle onları ve sabret"},{"number":28,"text":"Suyun, aralarında bölüştürüleceğini onlara bildir. Her su alış/içiş nöbetledir/içilecek her miktar hazırlanmıştır"},{"number":29,"text":"Arkadaşlarını çağırdılar, o da hançerini kapıp deveyi boğazladı"},{"number":30,"text":"Nasılmış benim azabım ve uyarılarım"},{"number":31,"text":"Biz, onlar üzerine bir tek ses gönderdik de ağılcının serptiği kuru ot gibi kırılıp ufalandılar"},{"number":32,"text":"Yemin olsun ki, biz, Kur'an'ı öğüt ve ibret için kolaylaştırdık. Fakat düşünen mi var"},{"number":33,"text":"Lût kavmi de uyarıları yalanladı"},{"number":34,"text":"Biz de üzerlerine çakıl taşları fırlatan bir rüzgâr gönderdik. Sadece Lût'un ailesini, seher vakti kurtarmıştık"},{"number":35,"text":"Katımızdan bir nimet olarak. Şükredeni işte böyle ödüllendiririz biz"},{"number":36,"text":"Yemin olsun, Lût onları bizim yakalayışımız hakkında uyarmıştı da onlar, uyarılarla ilgili olarak kuşkulanıp çekişmişlerdi"},{"number":37,"text":"Yemin olsun, Lût'un misafirlerinden nefislerini tatmin etmek istemişlerdi de onların gözlerini silme kör etmiştik. Hadi, tadın azabımı ve uyarılarımı"},{"number":38,"text":"Yemin olsun, sabahleyin erkenden, kararlı ve oturaklı bir azap yakaladı onları"},{"number":39,"text":"Hadi, tadın azabımı ve uyarılarımı"},{"number":40,"text":"Yemin olsun ki, biz, Kur'an'ı öğüt ve ibret için kolaylaştırdık. Fakat düşünen mi var"},{"number":41,"text":"Yemin olsun, Firavun hanedanına da uyarılar gelmişti"},{"number":42,"text":"Ayetlerimizin tümünü yalanladılar da biz de onları onurlu ve güçlü birine yaraşır bir yakalayışla yakaladık"},{"number":43,"text":"Sizin kâfirleriniz, ötekilerden hayırlı mı? Yoksa zübürlerinde/kutsallaştırılmış hizip kitaplarında sizin için bir beraat/dokunulmazlık mı var"},{"number":44,"text":"Yoksa, \"Biz, yardımlaşan/yenilmez bir topluluğuz\" mu diyorlar"},{"number":45,"text":"O topluluk, bozguna uğratılacak ve arkalarını dönüp kaçacaklar"},{"number":46,"text":"Hayır, buluşma zamanları kıyamet saatidir. Ne korkunç, ne acıdır o saat"},{"number":47,"text":"Kuşkusuz, suçlular, şaşkınlık ve çılgınlık içindedir"},{"number":48,"text":"O gün yüzleri üstüne ateşe sürüklenirler. \"Cehennemin dokunuşunu tadın bakalım"},{"number":49,"text":"Şu bir gerçek ki, biz herşeyi bir ölçüye göre/bir kaderle yarattık"},{"number":50,"text":"Emrimiz bir tektir, bir göz kırpma gibidir"},{"number":51,"text":"Yemin olsun, biz sizin benzerlerinizi hep yok ettik. Fakat düşünen mi var"},{"number":52,"text":"Onların yapmış oldukları her şey defterlerdedir"},{"number":53,"text":"Küçük-büyük tümü, satır satır yazılmıştır"},{"number":54,"text":"Korunup sakınanlar; bahçelerde, nehir kıyılarındadır"},{"number":55,"text":"Güçlü bir padişahın/bir Melîk'in katında, özü-sözü birlere has oturma yerlerinde"}]}