{"number":64,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Göklerdekiler ve yerdekiler Allah'ı tespih ediyor. O'nundur mülk ve yönetim; O'nun içindir tüm övgüler. Her şeye gücü yetendir O"},{"number":2,"text":"O'dur sizi yaratan! Sizin bir kısmınız küfre sapmıştır, bir kısmınız iman etmiştir. Ve Allah, işleyip ürettiklerinizi çok iyi görmektedir"},{"number":3,"text":"Gökleri ve yeri hak olarak yarattı; sizi biçimlendirdi ve görünüşlerinizi güzel yaptı. Yalnız O'nadır dönüş"},{"number":4,"text":"O bilir, göklerde ne var, yerde ne var! Ve bilir sizin gizlediklerinizi de açıkladıklarınızı da. Allah, göğüslerin özünü çok iyi bilir"},{"number":5,"text":"Sizden önce küfre sapanların haberleri gelmedi mi size? Onlar, yapıp ettiklerinin vebalini tattılar. Ve onlar için korkunç bir azap vardır"},{"number":6,"text":"Bu böyledir. Çünkü resulleri onlara apaçık deliller getirip dururken onlar: \"Bir insan mı bize kılavuzluk edecek?!\" deyip küfre saptılar ve yüz çevirdiler. Ve Allah hiçbir şeye muhtaç olmadığını gösterdi. Allah, sınırsız zenginliğin, sonsuz övgülerin sahibidir"},{"number":7,"text":"Küfre sapanlar asla diriltilmeyeceklerini sandılar. De ki: \"Rabbime yemin ederim ki, sandığınız gibi değil! Yemin olsun ki, mutlaka diriltileceksiniz; yine Yemin olsun ki, yaptıklarınız size mutlaka haber verilecektir. Ve bu, Allah için çok kolaydır"},{"number":8,"text":"Artık Allah'a, onun resulüne ve size indirdiğimiz nura inanın. Allah, yapmakta olduklarınızı iyiden iyiye haber almaktadır"},{"number":9,"text":"Toplanma günü\" için sizi bir araya getirdiği gün, karşılıklı aldatış ve aldanışların ortaya çıktığı gündür. Kim Allah'a iman eder, barışa/hayra yönelik bir iş yaparsa Allah onun çirkinliklerini örter ve kendisini altından nehirler akan cennetlere, içlerinde sürekli kalmak üzere yerleştirir. İşte büyük başarı budur"},{"number":10,"text":"Küfre sapıp ayetlerimizi yalanlayanlara gelince, işte bunlar, içinde uzun süre kalacakları ateşin dostlarıdır. Ne kötü dönüş yeridir orası"},{"number":11,"text":"Allah'ın izni olmadıkça hiçbir musibet gelip çatmaz. Kim Allah'a inanırsa Allah O'nun kalbini doğruya ve güzele kılavuzlar. Ve Allah her şeyi en iyi biçimde bilmektedir"},{"number":12,"text":"Allah'a itaat edin, resule de itaat edin. Eğer yüz çevirirseniz resulümüze düşen, apaçık bir tebliğden başkası değildir"},{"number":13,"text":"Allah! İlah yok O'ndan başka! Yalnız Allah'a güvenip dayanır iman sahipleri"},{"number":14,"text":"Ey iman edenler! Şu bir gerçek ki, eşlerinizin ve evlatlarınızın içinden size bir düşman vardır; onlara karşı dikkatli olun! Eğer affeder, ellerini tutar, hatalarını görmezden gelirseniz, kuşkusuz, Allah da affedici, merhamet edici olur"},{"number":15,"text":"Şu da bir gerçek ki, mallarınız ve çocuklarınız bir imtihan aracıdır. Allah'a gelince, onun katında büyük bir ödül vardır"},{"number":16,"text":"O halde, gücünüz ölçüsünde Allah'tan sakının, dinleyin, itaat edin. Ve benlikleriniz için bir hayır olarak infakta bulunun. Nefsinin cimrilik ve doymazlığından korunanlar, kurtuluşa erenlerin ta kendileridir"},{"number":17,"text":"Eğer Allah'a gönül hoşluğuyla bir şey borç verirseniz O, onu sizin için katlayarak artırır ve sizin hatalarınızı bağışlar. Allah Şekûr'dur, şükredenlere karşılık verir; Halîm'dir, yumuşak ve merhametli davranır"},{"number":18,"text":"Görünmeyen ve görünen âlemleri bilendir O; Azîz'dir, Hakîm'dir"}]}