{"number":67,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Mülk ve yönetim elinde bulunan o Allah ne yücedir! O, her şeye Kadîr'dir"},{"number":2,"text":"Hanginizin daha güzel iş yapacağını belirlemek için sizi imtihana çekmek üzere ölümü ve hayatı yaratan O'dur. Azîz'dir O, Gafûr'dur"},{"number":3,"text":"Birbiriyle uyum ve ahenk içinde yedi gökleri yaratan da O'dur. O Rahman'ın yaratışında/yarattıklarında herhangi bir uyuşmazlık, aykırılık, çelişme göremezsin. Bir kez daha bak! Bir çatlaklık, bir uyuşmazlık görüyor musun"},{"number":4,"text":"Sonra bakışı iki kez daha döndür! Umudunu kesmiş olarak döner sana göz. Utanmış, bitkin düşmüştür o"},{"number":5,"text":"Yemin olsun ki, biz en yakın göğü kandillerle süsledik ve onları şeytanlara ateş taneleri yaptık. O şeytanlar için çılgın ateş azabını da hazırladık"},{"number":6,"text":"Ve Rablerine karşı nankörlük edenler için cehennem azabı vardır. Ne kötü bir dönüş yeridir o"},{"number":7,"text":"Onun içine atıldıklarında, onun derinden gelen sesini işitirler. Feveran etmektedir o"},{"number":8,"text":"Öfkesinden çatlayacak hale gelir. İçine bir güruh atıldıkça, onun bekçileri bunlara sorarlar: \"Size hiçbir uyarıcı gelmedi mi"},{"number":9,"text":"Derler ki: \"Gelmedi olur mu? Bize uyarıcı geldi. Fakat biz yalanladık. Ve: 'Allah bir şey indirmemiştir, siz büyük bir sapıklık içindesiniz, başka değil!' şeklinde konuştuk"},{"number":10,"text":"Ve derler ki: \"Eğer söz dinleseydik yahut aklımızı çalıştırsaydık şu çılgın ateşin dostları arasında olmazdık"},{"number":11,"text":"Günahlarını işte böyle itiraf ettiler. Çılgın ateşin halkına böyle kahır yaraşır"},{"number":12,"text":"Görmedikleri halde Rablerinden ürperenlere gelince, onlar için bir bağışlanma ve büyük bir ödül vardır"},{"number":13,"text":"Sözünüzü ister gizleyin ister onu açıklayın; şu bir gerçek ki O, göğüslerin özünü çok iyi bilir"},{"number":14,"text":"Yaratmış olan bilmez mi/Allah, yarattığı kimseyi bilmez mi? Latîf'tir O, Habîr'dir"},{"number":15,"text":"O, yeri sizin için boyun eğer yaptı. Haydi, onun omuzlarında yürüyün ve Allah'ın rızıklarından yiyin. Dönüş O'nadır"},{"number":16,"text":"O göktekinin, sizi yere batırmayacağından emin misiniz? O zaman yer aniden çalkalanmaya başlar"},{"number":17,"text":"O göktekinin, çakıl taşları taşıyan bir rüzgârı üzerinize salmayacağından emin misiniz? O zaman bileceksiniz nasılmış uyarım"},{"number":18,"text":"Yemin olsun, onlardan öncekiler de yalanlamışlardı. Ama nasıl olmuştu benim azabım"},{"number":19,"text":"Üstlerinde, kanatlarını açıp kapayarak uçan kuşları hiç görmediler mi? Onları Rahman'dan başkası tutmuyor. Kuşkusuz O, her şeyi görmektedir"},{"number":20,"text":"Rahman'a karşı/Rahman'dan başka size yardım edecek ordunuz kimdir? İnkârcılar bir aldanış/gurur içindeler; hepsi bu"},{"number":21,"text":"Peki, O, rızkını tutarsa kim var sizi rızıklandıracak? Hayır, bir azgınlık ve nefret içinde inat etmekteler"},{"number":22,"text":"Peki, yüzüstü kapanarak yürüyen mi daha düzgün gider yoksa dosdoğru yol üzerinde dik ve düzgün yürüyen mi"},{"number":23,"text":"De ki: \"Sizi oluşturan O'dur. O size, işitme gücü, gözler ve gönüller verdi. Ne kadar da az şükrediyorsunuz"},{"number":24,"text":"De ki: \"Sizi, yeryüzünde yaratıp yayan O'dur. O'nun huzurunda haşredileceksiniz"},{"number":25,"text":"Derler ki: \"Eğer doğru sözlülerseniz, bu vaat de zaman"},{"number":26,"text":"De ki: \"Bilgi Allah'ın katındadır. Bana gelince, ben ancak açıkça uyaran biriyim"},{"number":27,"text":"Onu yakından gördüklerinde, inkâr edenlerin yüzleri kötüleşti. Şöyle denildi: \"O habire çağırıp durduğunuz şey budur"},{"number":28,"text":"Söyle onlara: \"Diyelim ki, Allah beni ve beraberimdekileri öldürdü, yahut bize acıdı. Peki, kâfirleri korkunç bir azaptan kim kurtaracak"},{"number":29,"text":"De ki: \"Rahman'dır O, O'na inandık biz ve yalnız O'na güvendik. Yakında bileceksiniz kimmiş apaçık sapıklığın içinde"},{"number":30,"text":"Şunu da söyle: \"Bir sabah suyunuz çekiliverse, kim getirecek fışkırıp akan bir su size"}]}