{"number":89,"edition":"ha.gumi","ayahs":[{"number":1,"text":"Inã rantsuwa da alfijiri"},{"number":2,"text":"Da darũruwa gõma"},{"number":3,"text":"Da (adadi na) cikã da (na) mãrã"},{"number":4,"text":"Da dare idan yana shũɗewa"},{"number":5,"text":"Ko a cikin waɗannan akwai abin rantsuwa ga mai hankali (da yake kange shi daga zunubi)"},{"number":6,"text":"Ba ka ga yadda Ubangijinka Ya aikata da Ãdãwa ba"},{"number":7,"text":"Iramawa mãsu sakon ƙĩrar jiki"},{"number":8,"text":"Waɗanda ba a halitta kwatankwacinsu ba a cikin garũruwa (na dũniya)"},{"number":9,"text":"Da samũdãwa waɗanda suka fasa duwãtsu a cikin Wadi suka yi gidãje"},{"number":10,"text":"Da Fir'auna mai turãku"},{"number":11,"text":"Waɗanda suka ƙẽtare iyãkarsu, a cikin garũruwa"},{"number":12,"text":"Sabõda haka, suka yawaita yin ɓarna a cikinsu"},{"number":13,"text":"Sabõda haka Ubangijinka Ya zuba musu bũlãlar azãba"},{"number":14,"text":"Lalle ne, Ubangijinka Yana nan a mafaka"},{"number":15,"text":"To, amma fa mutum idan Ubangijibsa Ya jarraba shi, wãto Yã girmama shi kuma Ya yi masa ni'ima, sai ya ce: \"Ubangijina Ya girmama ni"},{"number":16,"text":"Kuma idan Ya jarraba shi, wãto Ya ƙuntata masa abincinsa, sai ya ce: \"Ubangijina Ya walãkanta ni"},{"number":17,"text":"A'aha! Bari wannan, ai bã ku girmama marãya"},{"number":18,"text":"Bã ku kwaɗaitã wa jũnanku ga (tattalin) abincin matalauci"},{"number":19,"text":"Kuma kuna cin dũkiyar gãdo, ci na tãrãwa"},{"number":20,"text":"Kuma kuna son dũkiya, so mai yawa"},{"number":21,"text":"A'aha! Idan aka niƙa ƙasa niƙewa sosai"},{"number":22,"text":"Kuma Ubangijinka Ya zo, alhãli malã'iku na jẽre, safũ- safu"},{"number":23,"text":"Kuma a ranar nan aka zo da Jahannama. A ranar nan mutum zai yi tunãni. To, inã fa tunãni yake a gare shi"},{"number":24,"text":"Yana dinga cẽwa, \"Kaitona, dã na gabatar (da aikin ƙwarai) domin rãyuwata"},{"number":25,"text":"To, a rãnar nan bãbu wani mai yin azãba irin azãbar Allah"},{"number":26,"text":"Kuma bãbu wani mai ɗauri irin ɗaurinSa"},{"number":27,"text":"Yã kai rai mai natsuwa"},{"number":28,"text":"Ka koma zuwa ga Ubangijinka, alhãli kana mai yarda (da abin da Ya ƙaddara maka a dũniya) abar yardarwa (da sakamakon da zã a ba ka a Lãhira)"},{"number":29,"text":"Sabõbda haka, ka shiga cikin bãyiNa (mãsu bin umurui a dũniya)"},{"number":30,"text":"Kuma ka shiga AljannaTa (a Lãhira)"}]}