{"number":53,"edition":"tr.bulac","ayahs":[{"number":1,"text":"Battığı zaman yıldıza andolsun"},{"number":2,"text":"Sahibiniz (arkadaşınız olan peygamber) sapmadı ve azmadı"},{"number":3,"text":"O, hevadan (kendi istek, düşünce ve tutkularına göre) konuşmaz"},{"number":4,"text":"O (söyledikleri), yalnızca vahyolunmakta olan bir vahiydir"},{"number":5,"text":"Ona (bu Kur'an'ı) üstün (oldukça çetin) bir güç sahibi (Cebrail) öğretmiştir"},{"number":6,"text":"(Ki O,) Görünümüyle çarpıcı bir güzelliğe sahiptir. Hemen doğruldu"},{"number":7,"text":"O, en yüksek bir ufuktaydı"},{"number":8,"text":"Sonra yaklaştı, derken sarkıverdi"},{"number":9,"text":"Nitekim (ikisi arasındaki uzaklık) iki yay kadar (oldu) veya daha yakınlaştı"},{"number":10,"text":"Böylece O'nun kuluna vahyettiğini vahyetti"},{"number":11,"text":"Onun gördüğünü gönül yalanlamadı"},{"number":12,"text":"Yine de siz gördüğü (şey) üzerinde onunla tartışacak mısınız"},{"number":13,"text":"Andolsun, onu bir de diğer inişte görmüştü"},{"number":14,"text":"Sidretü'l-Münteha'nın yanında"},{"number":15,"text":"Ki Cennetü'l-Me'va onun yanındadır"},{"number":16,"text":"Sidreyi örten örtmekte iken"},{"number":17,"text":"Göz kayıp-şaşmadı ve (sınırı) aşmadı"},{"number":18,"text":"Andolsun, o, Rabbinin en büyük ayetlerinden olanı gördü"},{"number":19,"text":"Gördünüz mü-haber verin; Lat ve Uzza'yı"},{"number":20,"text":"Ve üçüncü (put) olan Menat'ı(n herhangi bir güçleri var mı)"},{"number":21,"text":"Erkek (evlat) sizin, dişi O'nun mu"},{"number":22,"text":"Eğer böyleyse, bu, çarpık bir paylaşma"},{"number":23,"text":"Bu (putlar ise,) sizin ve atalarınızın (kendi istek ve öngörünüze göre) isimlendirdiğiniz (keyfi) isimlerden başkası değildir. Allah, onlarla ilgili 'hiçbir delil' indirmemiştir. Onlar, yalnızca zanna ve nefislerinin (alçak) heva (istek ve tutku) olarak arzu ettiklerine uyuyorlar. Oysa andolsun, onlara Rablerinden yol gösterici gelmiştir"},{"number":24,"text":"Yoksa insana 'her arzu edip dilekte bulunduğu' şey mi var"},{"number":25,"text":"İşte son da, ilk de (ahiret ve dünya) Allah'ındır"},{"number":26,"text":"Göklerde nice melekler vardır ki, onların şefaatleri hiçbir şeyle yarar sağlamaz; ancak Allah'ın dileyip razı olduğu kimseye izin verdikten sonra başka"},{"number":27,"text":"Gerçek şu ki, ahirete iman etmeyenler, melekleri dişi isimlerle isimlendiriyorlar"},{"number":28,"text":"Oysa onların bununla ilgili hiçbir bilgileri yoktur. Onlar, yalnızca zanna uymaktadırlar. Oysa gerçekte zan, haktan yana hiçbir yarar sağlamaz"},{"number":29,"text":"Şu halde sen, Bizim zikrimize sırt çeviren ve dünya hayatından başkasını istemeyenden yüz çevir"},{"number":30,"text":"İşte onların ilimden yana ulaşabildikleri (son sınır) budur. Şüphesiz, senin Rabbin; Kendi yolundan sapanı en iyi bilen O'dur ve hidayet bulanı da en iyi bilen O'dur"},{"number":31,"text":"Göklerde ve yerde olanlar Allah'ındır; öyle ki, kötülükte bulunanları, yaptıkları dolayısıyla cezalandırır, güzel davranışta bulunanları da daha güzeliyle ödüllendirir"},{"number":32,"text":"Ki onlar, ufak tefek günahlar dışında, günahın büyük olanından ve çirkin utanmazlıklardan kaçınırlar. Şüphesiz senin Rabbin, mağfireti geniş olandır. O, sizi daha iyi bilendir; hem sizi topraktan inşa ettiği (yarattığı) ve siz daha annelerinizin karnında cenin halinde bulunduğunuz zaman da. Öyleyse kendinizi temize çıkarıp-durmayın. O, sakınanı daha iyi bilendir"},{"number":33,"text":"Şimdi, o yüz çevireni gördün mü"},{"number":34,"text":"Azıcık verdi ve gerisini kaya gibi sımsıkı elinde tuttu"},{"number":35,"text":"Gaybın ilmi onun yanında da o mu görüyor"},{"number":36,"text":"Yoksa Musa'nın sahifelerinde olan kendisine haber verilmedi mi"},{"number":37,"text":"Ve vefa eden İbrahim'in (sahifelerinde) olan"},{"number":38,"text":"Doğrusu, hiçbir günahkar, bir başkasının günah yükünü yüklenmez"},{"number":39,"text":"Şüphesiz insana kendi emeğinden başkası yoktur"},{"number":40,"text":"Şüphesiz kendi emeği (veya çabası) görülecektir"},{"number":41,"text":"Sonra ona en eksiksiz karşılık verilecektir"},{"number":42,"text":"Elbette son varış Rabbine olacaktır"},{"number":43,"text":"Doğrusu, güldüren ve ağlatan O'dur"},{"number":44,"text":"Doğrusu, öldüren ve dirilten O'dur"},{"number":45,"text":"Doğrusu, çiftleri; erkek ve dişiyi, yaratan O'dur"},{"number":46,"text":"Bir damla sudan (döl yatağına) meni döküldüğü zaman"},{"number":47,"text":"Gerçek şu ki, diğer diriltme (yeniden neş'et) de O'na aittir"},{"number":48,"text":"Doğrusu, muhtaç olmaktan O kurtardı ve sermaye verip-hoşnut kıldı"},{"number":49,"text":"Doğrusu, 'Şi'ra (yıldızı)nın' Rabbi O'dur"},{"number":50,"text":"Doğrusu, önce gelen Ad (halkın)ı O yıkıma uğrattı"},{"number":51,"text":"Semud'u da. Böylelikle (o halklardan kimseyi) bırakmadı"},{"number":52,"text":"Daha önce Nuh kavmini de. Çünkü onlar, daha zalim ve daha azgındılar"},{"number":53,"text":"Altı üstüne gelen (Lut kavminin) şehirlerini de O yerin dibine geçirdi"},{"number":54,"text":"Böylece ona (o toplumun başına) sardırdığını sardırdı"},{"number":55,"text":"Öyleyse, Rabbinin hangi nimetlerinden şüphe ediyorsun"},{"number":56,"text":"Bu önceki uyarıcılardan bir uyarıcıdır"},{"number":57,"text":"O yaklaşmakta olan yaklaştı"},{"number":58,"text":"Onu Allah'ın dışında ortaya çıkaracak başka (hiçbir güç yoktur)"},{"number":59,"text":"Şimdi siz, bu sözden mi şaşkınlığa düşüyorsunuz"},{"number":60,"text":"(Alayla) Gülüyorsunuz ve ağlamıyorsunuz"},{"number":61,"text":"Ve şuursuzca baş kaldırıyorsunuz"},{"number":62,"text":"Hemen, Allah'a secde edin ve (yalnızca O'na) kulluk edin"}]}