{"number":56,"edition":"ur.jalandhry","ayahs":[{"number":1,"text":"جب واقع ہونے والی واقع ہوجائے"},{"number":2,"text":"اس کے واقع ہونے میں کچھ جھوٹ نہیں"},{"number":3,"text":"کسی کو پست کرے کسی کو بلند"},{"number":4,"text":"جب زمین بھونچال سے لرزنے لگے"},{"number":5,"text":"اور پہاڑ ٹوٹ کر ریزہ ریزہ ہوجائیں"},{"number":6,"text":"پھر غبار ہو کر اُڑنے لگیں"},{"number":7,"text":"اور تم لوگ تین قسم ہوجاؤ"},{"number":8,"text":"تو داہنے ہاتھ والے (سبحان الله) داہنے ہاتھ والے کیا (ہی چین میں) ہیں"},{"number":9,"text":"اور بائیں ہاتھ والے (افسوس) بائیں ہاتھ والے کیا (گرفتار عذاب) ہیں"},{"number":10,"text":"اور جو آگے بڑھنے والے ہیں (ان کا کیا کہنا) وہ آگے ہی بڑھنے والے ہیں"},{"number":11,"text":"وہی (خدا کے) مقرب ہیں"},{"number":12,"text":"نعمت کے بہشتوں میں"},{"number":13,"text":"وہ بہت سے تو اگلے لوگوں میں سے ہوں گے"},{"number":14,"text":"اور تھوڑے سے پچھلوں میں سے"},{"number":15,"text":"(لعل و یاقوت وغیرہ سے) جڑے ہوئے تختوں پر"},{"number":16,"text":"آمنے سامنے تکیہ لگائے ہوئے"},{"number":17,"text":"نوجوان خدمت گزار جو ہمیشہ (ایک ہی حالت میں) رہیں گے ان کے آس پاس پھریں گے"},{"number":18,"text":"یعنی آبخورے اور آفتابے اور صاف شراب کے گلاس لے لے کر"},{"number":19,"text":"اس سے نہ تو سر میں درد ہوگا اور نہ ان کی عقلیں زائل ہوں گی"},{"number":20,"text":"اور میوے جس طرح کے ان کو پسند ہوں"},{"number":21,"text":"اور پرندوں کا گوشت جس قسم کا ان کا جی چاہے"},{"number":22,"text":"اور بڑی بڑی آنکھوں والی حوریں"},{"number":23,"text":"جیسے (حفاظت سے) تہہ کئے ہوئے (آب دار) موتی"},{"number":24,"text":"یہ ان اعمال کا بدلہ ہے جو وہ کرتے تھے"},{"number":25,"text":"وہاں نہ بیہودہ بات سنیں گے اور نہ گالی گلوچ"},{"number":26,"text":"ہاں ان کا کلام سلام سلام (ہوگا)"},{"number":27,"text":"اور داہنے ہاتھ والے (سبحان الله) داہنے ہاتھ والے کیا (ہی عیش میں) ہیں"},{"number":28,"text":"(یعنی) بےخار کی بیریوں"},{"number":29,"text":"اور تہہ بہ تہہ کیلوں"},{"number":30,"text":"اور لمبے لمبے سایوں"},{"number":31,"text":"اور پانی کے جھرنوں"},{"number":32,"text":"اور میوہ ہائے کثیرہ (کے باغوں) میں"},{"number":33,"text":"جو نہ کبھی ختم ہوں اور نہ ان سے کوئی روکے"},{"number":34,"text":"اور اونچے اونچے فرشوں میں"},{"number":35,"text":"ہم نے ان (حوروں) کو پیدا کیا"},{"number":36,"text":"تو ان کو کنواریاں بنایا"},{"number":37,"text":"(اور شوہروں کی) پیاریاں اور ہم عمر"},{"number":38,"text":"یعنی داہنے ہاتھ والوں کے لئے"},{"number":39,"text":"(یہ) بہت سے اگلے لوگوں میں سے ہیں"},{"number":40,"text":"اور بہت سے پچھلوں میں سے"},{"number":41,"text":"اور بائیں ہاتھ والے (افسوس) بائیں ہاتھ والے کیا (ہی عذاب میں) ہیں"},{"number":42,"text":"(یعنی دوزخ کی) لپٹ اور کھولتے ہوئے پانی میں"},{"number":43,"text":"اور سیاہ دھوئیں کے سائے میں"},{"number":44,"text":"(جو) نہ ٹھنڈا (ہے) نہ خوشنما"},{"number":45,"text":"یہ لوگ اس سے پہلے عیشِ نعیم میں پڑے ہوئے تھے"},{"number":46,"text":"اور گناہ عظیم پر اڑے ہوئے تھے"},{"number":47,"text":"اور کہا کرتے تھے کہ بھلا جب ہم مرگئے اور مٹی ہوگئے اور ہڈیاں (ہی ہڈیاں رہ گئے) تو کیا ہمیں پھر اُٹھنا ہوگا؟"},{"number":48,"text":"اور کیا ہمارے باپ دادا کو بھی؟"},{"number":49,"text":"کہہ دو کہ بےشک پہلے اور پچھلے"},{"number":50,"text":"(سب) ایک روز مقرر کے وقت پر جمع کئے جائیں گے"},{"number":51,"text":"پھر تم اے جھٹلانے والے گمرا ہو"},{"number":52,"text":"تھوہر کے درخت کھاؤ گے"},{"number":53,"text":"اور اسی سے پیٹ بھرو گے"},{"number":54,"text":"اور اس پر کھولتا ہوا پانی پیو گے"},{"number":55,"text":"اور پیو گے بھی تو اس طرح جیسے پیاسے اونٹ پیتے ہیں"},{"number":56,"text":"جزا کے دن یہ ان کی ضیافت ہوگی"},{"number":57,"text":"ہم نے تم کو (پہلی بار بھی تو) پیدا کیا ہے تو تم (دوبارہ اُٹھنے کو) کیوں سچ نہیں سمجھتے؟"},{"number":58,"text":"دیکھو تو کہ جس (نطفے) کو تم (عورتوں کے رحم میں) ڈالتے ہو"},{"number":59,"text":"کیا تم اس (سے انسان) کو بناتے ہو یا ہم بناتے ہیں؟"},{"number":60,"text":"ہم نے تم میں مرنا ٹھہرا دیا ہے اور ہم اس (بات) سے عاجز نہیں"},{"number":61,"text":"کہ تمہاری طرح کے اور لوگ تمہاری جگہ لے آئیں اور تم کو ایسے جہان میں جس کو تم نہیں جانتے پیدا کر دیں"},{"number":62,"text":"اور تم نے پہلی پیدائش تو جان ہی لی ہے۔ پھر تم سوچتے کیوں نہیں؟"},{"number":63,"text":"بھلا دیکھو تو کہ جو کچھ تم بوتے ہو"},{"number":64,"text":"تو کیا تم اسے اُگاتے ہو یا ہم اُگاتے ہیں؟"},{"number":65,"text":"اگر ہم چاہیں تو اسے چورا چورا کردیں اور تم باتیں بناتے رہ جاؤ"},{"number":66,"text":"(کہ ہائے) ہم تو مفت تاوان میں پھنس گئے"},{"number":67,"text":"بلکہ ہم ہیں ہی بےنصیب"},{"number":68,"text":"بھلا دیکھو تو کہ جو پانی تم پیتے ہو"},{"number":69,"text":"کیا تم نے اس کو بادل سے نازل کیا ہے یا ہم نازل کرتے ہیں؟"},{"number":70,"text":"اگر ہم چاہیں تو ہم اسے کھاری کردیں پھر تم شکر کیوں نہیں کرتے؟"},{"number":71,"text":"بھلا دیکھو تو جو آگ تم درخت سے نکالتے ہو"},{"number":72,"text":"کیا تم نے اس کے درخت کو پیدا کیا ہے یا ہم پیدا کرتے ہیں؟"},{"number":73,"text":"ہم نے اسے یاد دلانے اور مسافروں کے برتنے کو بنایا ہے"},{"number":74,"text":"تو تم اپنے پروردگار بزرگ کے نام کی تسبیح کرو"},{"number":75,"text":"ہمیں تاروں کی منزلوں کی قسم"},{"number":76,"text":"اور اگر تم سمجھو تو یہ بڑی قسم ہے"},{"number":77,"text":"کہ یہ بڑے رتبے کا قرآن ہے"},{"number":78,"text":"(جو) کتاب محفوظ میں (لکھا ہوا ہے)"},{"number":79,"text":"اس کو وہی ہاتھ لگاتے ہیں جو پاک ہیں"},{"number":80,"text":"پروردگار عالم کی طرف سے اُتارا گیا ہے"},{"number":81,"text":"کیا تم اس کلام سے انکار کرتے ہو؟"},{"number":82,"text":"اور اپنا وظیفہ یہ بناتے ہو کہ (اسے) جھٹلاتے ہو"},{"number":83,"text":"بھلا جب روح گلے میں آ پہنچتی ہے"},{"number":84,"text":"اور تم اس وقت کی (حالت کو) دیکھا کرتے ہو"},{"number":85,"text":"اور ہم اس (مرنے والے) سے تم سے بھی زیادہ نزدیک ہوتے ہیں لیکن تم کو نظر نہیں آتے"},{"number":86,"text":"پس اگر تم کسی کے بس میں نہیں ہو"},{"number":87,"text":"تو اگر سچے ہو تو روح کو پھیر کیوں نہیں لیتے؟"},{"number":88,"text":"پھر اگر وہ (خدا کے) مقربوں میں سے ہے"},{"number":89,"text":"تو (اس کے لئے) آرام اور خوشبودار پھول اور نعمت کے باغ ہیں"},{"number":90,"text":"اور اگر وہ دائیں ہاتھ والوں میں سے ہے"},{"number":91,"text":"تو (کہا جائے گا کہ) تجھ پر داہنے ہاتھ والوں کی طرف سے سلام"},{"number":92,"text":"اور اگر وہ جھٹلانے والے گمراہوں میں سے ہے"},{"number":93,"text":"تو (اس کے لئے) کھولتے پانی کی ضیافت ہے"},{"number":94,"text":"اور جہنم میں داخل کیا جانا"},{"number":95,"text":"یہ (داخل کیا جانا یقیناً صحیح یعنی) حق الیقین ہے"},{"number":96,"text":"تو تم اپنے پروردگار بزرگ کے نام کی تسبیح کرتے رہو"}]}