{"number":53,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"ستارے کی قسم ہے جب وہ ڈوبنے لگے"},{"number":2,"text":"تمہارا رفیق نہ گمراہ ہوا ہے اورنہ بہکا ہے"},{"number":3,"text":"اور نہ وہ اپنی خواہش سے کچھ کہتا ہے"},{"number":4,"text":"یہ تو وحی ہے جو اس پر آتی ہے"},{"number":5,"text":"بڑے طاقتور (جبرائیل) نے اسے سکھایا ہے"},{"number":6,"text":"جو بڑا زور آور ہے پس وہ قائم ہوا (اصلی صورت میں)"},{"number":7,"text":"اور وہ (آسمان کے) اونچے کنارے پر تھا"},{"number":8,"text":"پھر نزدیک ہوا پھر اور بھی قریب ہوا"},{"number":9,"text":"پھر فاصلہ دو کمان کے برابر تھا یا اس سے بھی کم"},{"number":10,"text":"پھر اس نے الله کےبندے کے دل میں القا کیا جو کچھ القا کیا دل نے"},{"number":11,"text":"جھوٹ نہیں کہا تھا جو دیکھا تھا"},{"number":12,"text":"پھر جو کچھ اس نے دیکھا تم اس میں جھگڑتے ہو"},{"number":13,"text":"اور اس نے اس کو ایک بار اور بھی دیکھا ہے"},{"number":14,"text":"سدرة المنتہیٰ کے پاس"},{"number":15,"text":"جس کے پاس جنت الماویٰ ہے"},{"number":16,"text":"جب کہ اس سدرة پر چھا رہا تھا جو چھا رہا تھا (یعنی نور)"},{"number":17,"text":"نہ تو نظر بہکی نہ حد سے بڑھی"},{"number":18,"text":"بے شک اس نے اپنے رب کی بڑی بڑی نشانیاں دیکھیں"},{"number":19,"text":"پھر کیا تم نے لات اور عزیٰ کو بھی دیکھاہے"},{"number":20,"text":"اور تیسرے منات گھٹیا کو (دیکھا ہے)"},{"number":21,"text":"کیا تمہارے لیے بیٹے اور اس کے لیے بیٹیاں ہیں"},{"number":22,"text":"تب تو یہ بہت ہی بری تقسیم ہے"},{"number":23,"text":"یہ تو صرف نام ہی نام ہیں جو تم نے اور تمہارے باپ دادا نے گھڑ لیے ہیں جن پر خدا نے کوئی سندبھی نہیں اتاری وہ محض وہم اور اپنی خواہش کی پیروی کرتے ہیں حالانکہ ان کے پاس ان کے رب کے ہاں سے ہدایت آ چکی ہے"},{"number":24,"text":"پھر کیا انسان کو وہی مل جاتا ہے جس کی تمنا کرتا ہے"},{"number":25,"text":"پس آخرت اور دنیا الله ہی کے اختیار میں ہے"},{"number":26,"text":"اور بہت سے فرشتے آسمان میں ہیں کہ جن کی شفاعت کسی کے کچھ بھی کام نہیں آتی مگر اس کے بعدکہ الله جس کے لیے چاہے اجازت دے اور پسند کرے"},{"number":27,"text":"بے شک جو لوگ آخرت پر ایمان نہیں لاتے وہ فرشتوں کے عورتوں کے سے نام رکھتے ہیں"},{"number":28,"text":"اور اس بات کو کچھ بھی نہیں جانتے محص وہم پر چلتے ہیں اوروہم حق بات کی جگہ کچھ بھی کام نہیں آتا"},{"number":29,"text":"پھر تم اس کی پرواہ نہ کرو جس نے ہماری یاد سے منہ پھیر لیا ہے اور صرف دنیا ہی کی زندگی چاہتا ہے"},{"number":30,"text":"ان کی سمجھ کی یہیں تک رسائی ہے بے شک آپ کا رب اس کو خوب جانتا ہے جو اس کے راستہ سے بہکا اور اس کو بھی خوب جانتا ہے جو راہ پر آیا"},{"number":31,"text":"اور الله ہی کا ہے جو کچھ آسمانوں اور زمین میں ہے تاکہ براکرنے والوں کو ان کے بدلہ دے اور نیکی کرنے والوں کو نیک بدلہ دے"},{"number":32,"text":"وہ جو بڑے گناہوں اور بے حیائی کی باتوں سے بچتے ہیں مگر صغیرہ گناہوں سے بے شک آپ کا رب بڑی وسیع بخشش والا ہے وہ تمہیں خوب جانتا ہے جب کہ تمہیں زمین سے پیدا کیا تھا اور جب کہ تم اپنی ماں کے پیٹ میں بچے تھے پس اپنے آپ کو پاک نہ سمجھو وہ پرہیزگار کو خوب جانتا ہے"},{"number":33,"text":"بھلا آپ نے اس شخص کو دیکھا جس نے منہ پھیر لیا"},{"number":34,"text":"اور تھوڑا سا دیا اور سخت دل ہو گیا"},{"number":35,"text":"کیا اس کے پاس غیب کا علم ہے کہ وہ دیکھ رہا ہے"},{"number":36,"text":"کیا اسے ان باتوں کی خبر نہیں پہنچی جو موسیٰ کے صحیفوں میں ہیں"},{"number":37,"text":"اورابراھیم کے جس نے (اپنا عہد) پورا کیا"},{"number":38,"text":"وہ یہ کہ کوئی کسی کا بوجھ نہیں اٹھائے گا"},{"number":39,"text":"اور یہ کہ انسان کو وہی ملتا ہے جو کرتا ہے"},{"number":40,"text":"اور یہ کہ اس کی کوشش جلد دیکھی جائے گی"},{"number":41,"text":"پھر اسے پورا بدلہ دیا جائے گا"},{"number":42,"text":"اوریہ کہ سب کو آپ کے رب ہی کی طرف پہنچتا ہے"},{"number":43,"text":"اور یہ کہ وہی ہنساتا ہے اوررلاتا ہے"},{"number":44,"text":"اور یہ کہ وہی مارتا ہے اور زندہ کرتا ہے"},{"number":45,"text":"اور یہ کہ اسی نے جوڑا نر اور مادہ کا پیدا کیا ہے"},{"number":46,"text":"ایک بوند سے جب کہ وہ ٹپکائی جائے"},{"number":47,"text":"اور یہ کہ دوسری بارزندہ کر کے اٹھانا اسی کے ذمہ ہے"},{"number":48,"text":"اور یہ کہ وہی غنی اور سرمایہ دار کرتا ہے"},{"number":49,"text":"اور یہ کہ وہی شعریٰ کا رب ہے"},{"number":50,"text":"اور یہ کہ اسی نے عاد اولیٰ کو ہلاک کیا تھا"},{"number":51,"text":"اور ثمود کو پس اسے باقی نہ چھوڑا"},{"number":52,"text":"اور اس سے پہلے نوح کی قوم کو بے شک وہ زیادہ ظالم اور زيادہ سرکش تھے"},{"number":53,"text":"اور الٹی بستی کو اس نے دے ٹپکا"},{"number":54,"text":"پس اس پر وہ (تباہی) چھا گئی جوچھا گئی"},{"number":55,"text":"پس اپنے رب کی کون کون سی نعمت میں تو شک کرے گا"},{"number":56,"text":"یہ بھی ایک ڈرانے والا ہے پہلے ڈرانے والوں میں سے"},{"number":57,"text":"آنے والی قریب آ پہنچی"},{"number":58,"text":"سوائے الله کے اسے کوئی ہٹانے والا نہیں"},{"number":59,"text":"پس کیا اس بات سے تم تعجب کرتے ہو"},{"number":60,"text":"اور ہنستے ہو اور روتے نہیں"},{"number":61,"text":"اور تم کھیل رہے ہو"},{"number":62,"text":"پس الله کے آگے سجدہ کرو اور اس کی عبادت کرو"}]}