{"number":70,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"ایک سوال کرنے والے نے اس عذاب کا سوال کیا جو واقع ہونے والا ہے"},{"number":2,"text":"کافرو ں کے لیے کہ اس کا کوئی ٹالنے والا نہیں"},{"number":3,"text":"جس الله کی طرف سے واقع ہو گا جو سیڑھیوں کا (یعنی آسمانوں کا) مالک ہے"},{"number":4,"text":"(جن سیڑھیوں سے) فرشتے اور اہلِ ایمان کی روحیں اس کے پاس چڑھ کر جاتی ہیں (اور وہ عذاب) اس دن ہو گا جس کی مقدار پچاس ہزار سال کی ہے"},{"number":5,"text":"آپ اچھی طرح سے صبر کیے رہیں"},{"number":6,"text":"بے شک وہ اسے دور دیکھتے ہیں"},{"number":7,"text":"اور ہم اسے قریب دیکھتے ہیں"},{"number":8,"text":"جس دن آسمان پگھلے ہوئے تانبے کی مانند ہوگا"},{"number":9,"text":"اور پہاڑ دھنی ہوئی رنگداراؤن کی طرح ہوں گے"},{"number":10,"text":"اور کوئی دوست کسی دوست کو نہیں پوچھے گا"},{"number":11,"text":"وہ انہیں کھائیں جائیں گے مجرم چاہے گا کہ کاش اس دن کے عذاب کے بدلے میں اپنے بیٹوں کو دے دے"},{"number":12,"text":"اوراپنی بیوی اور اپنے بھائی کو"},{"number":13,"text":"اور اپنے اس کنبہ کو جو اسے پناہ دیتا تھا"},{"number":14,"text":"اوران سب کو جو زمین میں ہیں پھر اپنے آپ کو بچا لے"},{"number":15,"text":"ہرگز نہیں بے شک وہ تو ایک آگ ہے"},{"number":16,"text":"کھالوں کو اتارنے والی"},{"number":17,"text":"اس کو بلائے گی جس نے پیٹھ پھیری اورمنہ موڑا"},{"number":18,"text":"اور مال جمع کیا اورگن گن کر رکھا"},{"number":19,"text":"بے شک انسان کم ہمت پیدا ہوا ہے"},{"number":20,"text":"جب اسے تکلیف پہنچتی ہے تو چلا اٹھتا ہے"},{"number":21,"text":"اور جب اسے مال ملتا ہے تو بڑا بخیل ہے"},{"number":22,"text":"مگر وہ نمازی"},{"number":23,"text":"جو اپنی نماز پر ہمیشہ سے قائم ہیں"},{"number":24,"text":"اوروہ جن کے مالو ں میں حصہ معین ہے"},{"number":25,"text":"سائل اور غیر سائل کے لیے"},{"number":26,"text":"اوروہ جو قیامت کے دن کا یقین رکھتے ہیں"},{"number":27,"text":"اور وہ جو اپنے رب کے عذاب سے ڈرنے والے ہیں"},{"number":28,"text":"بے شک ان کے رب کے عذاب کا خطرہ لگا ہوا ہے"},{"number":29,"text":"اوروہ جو اپنی شرم گاہوں کی حفاظت کرتے ہیں"},{"number":30,"text":"مگر اپنی بیویوں یا اپنی لونڈیوں سے سو بے شک انہیں کوئی ملامت نہیں"},{"number":31,"text":"پس جو کوئی اس کے سوا چاہے سو وہی لوگ حد سے بڑھنے والے ہیں"},{"number":32,"text":"اور وہ جواپنی امانتوں اور عہدوں کی رعایت رکھتے ہیں"},{"number":33,"text":"اور وہ جو اپنی گواہیوں پر قائم رہتے ہیں"},{"number":34,"text":"اور وہ جو اپنی نمازوں کی حفاظت کرتے ہیں"},{"number":35,"text":"وہی لوگ باغوں میں عزت سے رہیں گے"},{"number":36,"text":"پس کافروں کو کیا ہوگیا کہ آپ کی طرف دوڑے آ رہے ہیں"},{"number":37,"text":"دائیں اور بائیں سے ٹولیاں بنا کر"},{"number":38,"text":"کیا ہر ایک ان میں سے طمع رکھتا ہے کہ وہ نعمت کے باغ میں داخل کیا جاوے گا"},{"number":39,"text":"ہرگز نہیں بے شک ہم نے انہیں اس چیز سے پیدا کیا ہے جسے وہ بھی جانتے ہیں"},{"number":40,"text":"پس میں مشرقوں اور مغربوں کے پروردگار کی قسم کھاتا ہوں (یعنی اپنی ذات کی) کہ ہم ضرور قادر ہیں"},{"number":41,"text":"اس بات پر کہ ہم ان سے بہتر لوگ بدل کر لا سکتے ہیں اور ہم عاجز بھی نہیں ہیں"},{"number":42,"text":"پھر انہیں چھوڑ دو کہ وہ بیہودہ باتوں اور کھیل میں لگے رہیں یہاں تک کہ وہ دن دیکھ لیں جس کا ان سے وعدہ کیا جاتا ہے"},{"number":43,"text":"جس دن وہ دوڑتے ہوئے قبروں سے نکل پڑیں گے گویا کہ وہ ایک نشان کی طرف دوڑے چلے جارہے ہیں"},{"number":44,"text":"ان کی نگاہیں جھکی ہوں گی ان پر ذلت چھا رہی ہو گی یہی وہ دن ہے جس کا ان سے وعدہ کیا جاتا تھا"}]}