{"number":74,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"اے کپڑے میں لپٹنے والے"},{"number":2,"text":"اٹھو پھر (کافروں کو) ڈراؤ"},{"number":3,"text":"اور اپنے رب کی بڑائی بیان کرو"},{"number":4,"text":"اور اپنے کپڑے پاک رکھو"},{"number":5,"text":"اورمیل کچیل دور کرو"},{"number":6,"text":"اوربدلہ پانے کی غرض سے احسان نہ کرو"},{"number":7,"text":"اوراپنے رب کے لیے صبر کرو"},{"number":8,"text":"پھر جب صور میں پھونکا جائے گا"},{"number":9,"text":"پس وہ اس دن بڑا کٹھن دن ہو گا"},{"number":10,"text":"کافروں پر وہ آسان نہ ہو گا"},{"number":11,"text":"مجھے اور اس کو چھوڑ دو کہ جس کو میں نے اکیلا پیدا کیا"},{"number":12,"text":"اوراس کوبڑھنے والا مال دیا"},{"number":13,"text":"اور حاضر رہنے والے بیٹے دیئے"},{"number":14,"text":"اور اس کے لیے ہر طرح کا سامان تیار کر دیا"},{"number":15,"text":"پھر وہ طمع کرتا ہے کہ میں اور بڑھا دوں"},{"number":16,"text":"ہرگز نہیں بےشک وہ ہماری آیات کا سخت مخالف ہے"},{"number":17,"text":"عنقریب میں اسے اونچی گھاٹی پر چڑھاؤں گا"},{"number":18,"text":"بے شک اس نے سوچا اور اندازہ لگایا"},{"number":19,"text":"پھر اسے الله کی مار اس نے کیسا اندازہ لگایا"},{"number":20,"text":"پھر اسے الله کی مار اس نے کیسا اندازہ لگایا"},{"number":21,"text":"پھر اس نے دیکھا"},{"number":22,"text":"پھر اس نے تیوری چڑھائی اور منہ بنایا"},{"number":23,"text":"پھر پیٹھ پھیر لی اور تکبر کیا"},{"number":24,"text":"پھر کہا یہ تو ایک جادو ہے جو چلا آتا ہے"},{"number":25,"text":"یہ تو ہو نہ ہو آدمی کا کلام ہے"},{"number":26,"text":"عنقریب اس کو دوزخ میں ڈالوں گا"},{"number":27,"text":"اور آپ کو کیا خبر کہ دوزخ کیا ہے"},{"number":28,"text":"نہ باقی رکھے اور نہ چھوڑے"},{"number":29,"text":"آدمی کو جھلس دے"},{"number":30,"text":"اس پر انیس (فرشتے) مقرر ہیں"},{"number":31,"text":"اور ہم نے دوزخ پر فرشتے ہی رکھے ہیں اور ان کی تعداد کافروں کے لیے آزمائش بنائی ہے تاکہ جن کو کتاب دی گئی ہے وہ یقین کر لیں اور ایمان داروں کا ایمان بڑھے اورتاکہ اہلِ کتاب اور ایمان دار شک نہ کریں اور تاکہ جن کے دلوں میں (نفاق کی) بیماری ہے اورکافر یہ کہیں کہ الله کی اس بیان سے کیاغرض ہے اور الله اس طرح سے جسے چاہتاہے گمراہ کر تا ہے اور جسے چاہتا ہے ہدایت کرتا ہے اور آپ کے رب کے لشکروں کو اس کے سوا اور کوئی نہیں جانتا اور دوزخ (کا حال بیان کرنا) صرف آدمیوں کی نصیحت کے لیے ہے"},{"number":32,"text":"نہیں نہیں قسم ہے چاند کی"},{"number":33,"text":"اور رات کی جب وہ ڈھلے"},{"number":34,"text":"اور صبح کی جب وہ روشن ہوجائے"},{"number":35,"text":"کہ وہ (دوزخ) بڑی بڑی مصیبتوں میں سے ایک ہے"},{"number":36,"text":"انسان کو ڈرانے والی ہے"},{"number":37,"text":"تم میں سے ہر ایک کے لیے خواہ کوئی اس کے آگے آئے یا پیچھے ہٹے"},{"number":38,"text":"ہر شخص اپنے اعمال کے سبب گروی ہے"},{"number":39,"text":"مگر داہنے والے"},{"number":40,"text":"باغوں میں ہو ں گے ایک دوسرے سے پوچھیں گے"},{"number":41,"text":"گناہگارو ں کی نسبت"},{"number":42,"text":"کس چیز نے تمہیں دوزخ میں ڈالا"},{"number":43,"text":"وہ کہیں گے کہ ہم نمازی نہ تھے"},{"number":44,"text":"اور نہ ہم مسکینوں کو کھانا کھلاتے تھے"},{"number":45,"text":"اور ہم بکواس کرنے والوں کے ساتھ بکواس کیاکرتے تھے"},{"number":46,"text":"اور ہم انصاف کے دن کو جھٹلایا کرتے تھے"},{"number":47,"text":"یہاں تک کہ ہمیں موت آ پہنچی"},{"number":48,"text":"پس ان کو سفارش کرنے والوں کی سفارش نفع نہ دے گی"},{"number":49,"text":"پسانہیں کیا ہو گیا کہ وہ نصیحت سے منہ موڑرہے ہیں"},{"number":50,"text":"گویا کہ وہ بدکنے والے گدھے ہیں"},{"number":51,"text":"جو شیر سے بھاگے ہیں"},{"number":52,"text":"بلکہ ہر ایک آدمی ان میں سے چاہتا ہے کہ اسے کھلے ہوئے صحیفے دیئے جائیں"},{"number":53,"text":"ہرگز نہیں بلکہ وہ آخرت سے نہیں ڈرتے"},{"number":54,"text":"ہرگز نہیں بے شک یہ (قرآن) ایک نصیحت ہے"},{"number":55,"text":"پس جو چاہے اس کو یاد کر لے"},{"number":56,"text":"اور کوئی بھی یاد نہیں کر سکتا مگر جبکہ الله ہی چاہے وہی جس سے ڈرنا چاہیے اوروہی بخشنے والا ہے"}]}