{"number":83,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"کم تولنے والوں کے لیے تباہی ہے"},{"number":2,"text":"وہ لوگ کہ جب لوگوں سے ماپ کر لیں تو پورا کریں"},{"number":3,"text":"اور جب ان کو ماپ کر یا تول کردیں توگھٹا کر دیں"},{"number":4,"text":"کیا وہ خیال نہیں کرتے کہ وہ اٹھائے جائیں گے"},{"number":5,"text":"اس بڑے دن کے لیے"},{"number":6,"text":"جس دن سب لوگ رب العالمین کے سامنے کھڑے ہو ں گے"},{"number":7,"text":"ہر گز ایسا نہیں چاہیے بے شک نافرمانوں کے اعمال نامے سجین میں ہیں"},{"number":8,"text":"اور آپ کو کیا خبر کہ سجین کیا ہے"},{"number":9,"text":"ایک دفتر ہے جس میں لکھا جاتا ہے"},{"number":10,"text":"اس دن جھٹلانے والوں کے لئے تباہی ہے"},{"number":11,"text":"وہ جو انصاف کے دن کو جھٹلاتے ہیں"},{"number":12,"text":"اور اس کو وہی جھٹلاتا ہے جو حد سے بڑھا ہوا گناہگار ہے"},{"number":13,"text":"جب اس پر ہماری آیتیں پڑھی جاتی ہیں تو کہتا ہے پہلوں کی کہانیاں ہیں"},{"number":14,"text":"ہر گز نہیں بلکہ ان کے (بڑے) کاموں سے ان کے دلو ں پر زنگ لگ گیا ہے"},{"number":15,"text":"ہر گز نہیں بے شک وہ اپنے رب سے اس دن روک دیئے جائیں گے"},{"number":16,"text":"پھر بے شک وہ دوزخ میں گرنے والے ہیں"},{"number":17,"text":"پھر کہا جائے گا کہ یہی ہے وہ جسے تم جھٹلاتے تھے"},{"number":18,"text":"ہر گز نہیں بےشک نیکوں کے اعمال نامے علییں میں ہیں"},{"number":19,"text":"اور آپ کو کیا خبر کہ علیّین کیا ہے"},{"number":20,"text":"ایک دفتر ہے جس میں لکھا جاتا ہے"},{"number":21,"text":"اسے مقرب فرشتے دیکھتے ہیں"},{"number":22,"text":"بے شک نیکو کار جنت میں ہوں گے"},{"number":23,"text":"تختوں پر بیٹھے دیکھ رہے ہوں گے"},{"number":24,"text":"آپ ان کے چہروں میں نعمت کی تازگی معلوم کریں گے"},{"number":25,"text":"ان کو خالص شراب مہر لگی ہوئی پلائی جائے گی"},{"number":26,"text":"اس کی مہر مشک کی ہو گی اور رغبت کرنے والوں کو اس کی رغبت کرنی چاہیئے"},{"number":27,"text":"اور اس میں تسنیم ملی ہو گی"},{"number":28,"text":"وہ ایک چشمہ ہے اس میں سےمقرب پئیں گے"},{"number":29,"text":"بے شک نافرمان (دنیا میں) ایمان داروں سے ہنسی کیا کرتے تھے"},{"number":30,"text":"اور جب ان کے پاس سے گزرتے تو آپس میں آنکھ سے اشارے کرتے تھے"},{"number":31,"text":"اور جب اپنے گھر والوں کے پاس لوٹ کر جاتے تو ہنستے ہوئے جاتے تھے"},{"number":32,"text":"اور جب ان کو دیکھتے تو کہتے بے شک یہی گمراہ ہیں"},{"number":33,"text":"حالانکہ وہ ان پر نگہبان بنا کر نہیں بھیجے گئے تھے"},{"number":34,"text":"پس آج وہ لوگ جو ایمان لائے کفار سے ہنس رہے ہوں گے"},{"number":35,"text":"تختوں پر بیٹھے دیکھ رہے ہوں گے"},{"number":36,"text":"آیا کافروں کو بدلہ دیا گیا ہے ان اعمال کا جو وہ کیا کرتے تھے"}]}