{"number":54,"edition":"fr.hamidullah","ayahs":[{"number":1,"text":"L'Heure approche et la Lune s'est fendue"},{"number":2,"text":"Et s'ils voient un prodige, ils s'en détournent et disent: «Une magie persistante»"},{"number":3,"text":"Et ils [le] traitent de mensonge et suivent leurs propres impulsions, or chaque chose arrivera à son terme [et son but]"},{"number":4,"text":"Ils ont pourtant reçu comme nouvelles de quoi les empêcher (du mal)"},{"number":5,"text":"[Cela est] une sagesse parfaite. Mais les avertissements ne [leur] servent à rien"},{"number":6,"text":"Détourne-toi d'eux. Le jour où l'appeleur appellera vers une chose affreuse"},{"number":7,"text":"les regards baissés, ils sortiront des tombes comme des sauterelles éparpillées"},{"number":8,"text":"courant, le cou tendu, vers l'appeleur. Les mécréants diront: «Voilà un jour difficile»"},{"number":9,"text":"Avant eux, le peuple de Noé avait crié au mensonge. Ils traitèrent Notre serviteur de menteur et dirent: «C'est un possédé!» et il fut repoussé"},{"number":10,"text":"Il invoqua donc son Seigneur: «Moi, je suis vaincu. Fais triompher (Ta cause)»"},{"number":11,"text":"Nous ouvrîmes alors les portes du ciel à une eau torrentielle"},{"number":12,"text":"et fîmes jaillir la terre en sources. Les eaux se rencontrèrent d'après un ordre qui était déjà décrété dans une chose [faite]"},{"number":13,"text":"Et Nous le portâmes sur un objet [fait] de planches et de clous [l'arche]"},{"number":14,"text":"voguant sous Nos yeux: récompense pour celui qu'on avait renié [Noé]"},{"number":15,"text":"Et Nous la laissâmes, comme un signe [d'avertissement]. Y a-t-il quelqu'un pour réfléchir"},{"number":16,"text":"Comment furent Mon châtiment et Mes avertissements"},{"number":17,"text":"En effet, Nous avons rendu le Coran facile pour la méditation. Y a-t-il quelqu'un pour réfléchir"},{"number":18,"text":"Les 'Aad ont traité de menteur (leur Messager). Comment furent Mon châtiment et Mes avertissements"},{"number":19,"text":"Nous avons envoyé contre eux un vent violent et glacial, en un jour néfaste et interminable"},{"number":20,"text":"il arrachait les gens comme des souches de palmiers déracinés"},{"number":21,"text":"Comment furent Mon châtiment et Mes avertissements"},{"number":22,"text":"En effet, Nous avons rendu le Coran facile pour la méditation. Y a-t-il quelqu'un pour réfléchir"},{"number":23,"text":"Les Thamûd ont traité de mensonges les avertissements"},{"number":24,"text":"Ils dirent: «Allons-nous suivre un seul homme (Sâlih) d'entre nous-mêmes? Nous serions alors dans l'égarement et la folie"},{"number":25,"text":"Est-ce que le message a été envoyé à Lui à l'exception de nous tous? C'est plutôt un grand menteur, plein de prétention et d'orgueil»"},{"number":26,"text":"Demain, ils sauront qui est le grand menteur plein de prétention et d'orgueil"},{"number":27,"text":"Nous leur enverrons la chamelle, comme épreuve. Surveille-les donc et sois patient"},{"number":28,"text":"Et informe-les que l'eau sera en partage entre eux [et la chamelle]; chacun boira à son tour"},{"number":29,"text":"Puis ils appelèrent leur camarade qui prit [son épée] et [la] tua"},{"number":30,"text":"Comment furent donc Mon châtiment et Mes avertissements"},{"number":31,"text":"Nous lachâmes sur eux un seul Cri, et voilà qu'ils furent réduits à l'état de paille d'étable"},{"number":32,"text":"Et vraiment, Nous avons rendu le Coran facile pour la méditation. Y a-t-il quelqu'un pour réfléchir"},{"number":33,"text":"Le peuple de Lot traita de mensonges les avertissements"},{"number":34,"text":"Nous lachâmes sur eux un ouragan, excepté la famille de Lot que Nous sauvâmes avant l'aube"},{"number":35,"text":"à titre de bienfait de Notre part: ainsi récompensons-Nous celui qui est reconnaissant"},{"number":36,"text":"Il les avait pourtant avertis de Nos représailles. Mais ils mirent les avertissements en doute"},{"number":37,"text":"En effet, ils voulaient séduire ses hôtes. Nous aveuglâmes leurs yeux «Goûtez donc Mon châtiment et Mes avertissements»"},{"number":38,"text":"En effet, au petit matin, un châtiment persistant les surprit"},{"number":39,"text":"Goûtez donc Mon châtiment et Mes avertissements"},{"number":40,"text":"Et vraiment, Nous avons rendu le Coran facile pour la méditation. Y a-t-il quelqu'un pour réfléchir"},{"number":41,"text":"Les avertissements vinrent certes, aux gens de Pharaon"},{"number":42,"text":"Ils traitèrent de mensonges tous Nos prodiges. Nous les saisîmes donc, de la saisie d'un Puissant Omnipotent"},{"number":43,"text":"Vos mécréants sont-ils meilleurs que ceux-là? Ou bien y a-t-il dans les Ecritures une immunité pour vous"},{"number":44,"text":"Ou bien ils disent: «Nous formons un groupe [fort] et nous vaincrons»"},{"number":45,"text":"Leur rassemblement sera bientôt mis en déroute, et ils fuiront"},{"number":46,"text":"L'Heure, plutôt, sera leur rendez-vous, et l'Heure sera plus terrible et plus amère"},{"number":47,"text":"Les criminels sont certes, dans l'égarement et la folie"},{"number":48,"text":"Le jour où on les traînera dans le Feu sur leurs visages, (on leur dira): «Goûtez au contact de Saqar [la chaleur brûlante de l'Enfer]»"},{"number":49,"text":"Nous avons créé toute chose avec mesure"},{"number":50,"text":"et Notre ordre est une seule [parole]; [il est prompt] comme un clin d'œil"},{"number":51,"text":"En effet, nous avons fait périr des peuples semblables à vous. Y a-t-il quelqu'un pour s'en souvenir"},{"number":52,"text":"Et tout ce qu'ils ont fait est mentionné dans les registres"},{"number":53,"text":"et tout fait, petit et grand, est consigné"},{"number":54,"text":"Les pieux seront dans des Jardins et parmi des ruisseaux"},{"number":55,"text":"dans un séjour de vérité, auprès d'un Souverain Omnipotent"}]}