{"number":37,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"By the angels ranged in ranks"},{"number":2,"text":"By the angels driving away"},{"number":3,"text":"By the angels reciting the praise"},{"number":4,"text":"Verily your God is One"},{"number":5,"text":"Lord of the heavens and the earth and whatsoever is in- between the twain, and Lord of the easts"},{"number":6,"text":"Verily We! We have adorned the nearest heaven with an adornment: the stars"},{"number":7,"text":"And have placed therein a guard against any Satan froward"},{"number":8,"text":"They cannot listen to the exalted assembly, and they are darted at from every side"},{"number":9,"text":"With a driving fusillade, and theirs shall be a torment perpetual"},{"number":10,"text":"Except him who snatcheth away a word by stealth, and him then pursueth a glowing flame"},{"number":11,"text":"Ask them thou: are they stronger in structure or those others whom We have created? Verily We! We have created them of a sticky clay"},{"number":12,"text":"Aye! thou marvellest, and they scoff"},{"number":13,"text":"And when they are admonished, they receive not admcnition"},{"number":14,"text":"And when they behold a sign, they turn to scoffing"},{"number":15,"text":"And they say: this Qur'an is naught but magic manifest"},{"number":16,"text":"When we have become dead and have become dust and bones, shall we then verily be raised"},{"number":17,"text":"And also our forefathers"},{"number":18,"text":"Say thou: and verily ye; shall then be despicable"},{"number":19,"text":"It shall be but one shout, lo! they shall be staring"},{"number":20,"text":"And they will say: Ah! woe be Unto us! this is the Day of Requital"},{"number":21,"text":"This is the Day of Judgment which ye were wont to belie"},{"number":22,"text":"Gather together those who did wrong and their comrades and that which they were wont to worship"},{"number":23,"text":"Beside Allah, and lead them on to the path of the Flaming Fire"},{"number":24,"text":"And stop them; verily they are to be questioned"},{"number":25,"text":"What aileth you that ye succour not one another"},{"number":26,"text":"Nay! on that Day they will be entirely submissive"},{"number":27,"text":"And they will advance toward each other mutually questioning"},{"number":28,"text":"They will say: verily ye! ye were wont to come Unto us Imposing"},{"number":29,"text":"They will say: nay! ye yourselves were not believers"},{"number":30,"text":"And we had over you no authority, but ye were a people exorbitant"},{"number":31,"text":"So on us hath been justified the sentence of our Lord: verily we are to taste"},{"number":32,"text":"We seduced you astray; verily we were ourselves the seduced ones"},{"number":33,"text":"So verily on that Day they all in the torment will be sharers"},{"number":34,"text":"Verily We! in this wise We deal with the culprits"},{"number":35,"text":"Verily when it was said Unto them: there is no god but Allah, they ever grew stiff-necked"},{"number":36,"text":"And they said: are we going to abandon our gods on account of a Poet distracted"},{"number":37,"text":"Aye! he hath come with the truth, and he confesseth to the sent ones"},{"number":38,"text":"Verily ye are going to taste a torment afflictive"},{"number":39,"text":"And ye shall be required not except for that which ye have been doing"},{"number":40,"text":"But the bondmen of Allah, the sincere ones"},{"number":41,"text":"Those! theirs shall be a provision known"},{"number":42,"text":"Fruits! And they shall be honoured"},{"number":43,"text":"In Gardens of Delight"},{"number":44,"text":"On couches, facing one another"},{"number":45,"text":"Round shall be passed a cup Unto them filled with limpid drink"},{"number":46,"text":"White, a pleasure Unto the drinkers"},{"number":47,"text":"No headiness there shall be therein, nor shall they be therewith Inebriated"},{"number":48,"text":"And with them shall be damsels of refraining looks, large- eyed"},{"number":49,"text":"As though they were eggs hidden"},{"number":50,"text":"Then they will advance Unto each other, mutually questioning"},{"number":51,"text":"And a speaker from among them will say: verily there was Unto me a mate"},{"number":52,"text":"Who said: art thou of those who confess to the doctrine of Resurrection"},{"number":53,"text":"When we are dead and have become dust and bones, are we indeed going to be requited"},{"number":54,"text":"Allah will say: will ye look down"},{"number":55,"text":"Then he will look down and see him in the midst of the Flaming Fire"},{"number":56,"text":"And he will say: by Allah, thou hadst wellnigh causedest me to perish"},{"number":57,"text":"And but for the favourcf my lord, I should have been of those brought forward"},{"number":58,"text":"Are we not then to die"},{"number":59,"text":"Save our first death, and are we not to be tormented"},{"number":60,"text":"Verily this! that is the supreme achievement"},{"number":61,"text":"For the like of this, then, let the workers work"},{"number":62,"text":"Is this better as an entertainment or the tree of Zaqqum"},{"number":63,"text":"Verily We! We have made it a temptation for the wrong- doers"},{"number":64,"text":"Verily it is a tree that springeth forth in the bottom of Flaming Fire"},{"number":65,"text":"The fruit thereof is as though the hoods of the serpents"},{"number":66,"text":"And verily they must eat thereof and fill their bellies therewith"},{"number":67,"text":"And thereafter verily they shall have thereon a draught of balling water"},{"number":68,"text":"And thereafter verily their return is Unto the Flaming Fire"},{"number":69,"text":"Verily they found their fathers gone astray"},{"number":70,"text":"So they in their footsteps are rushing"},{"number":71,"text":"And assuredly there went stray before them many of the ancients"},{"number":72,"text":"And assuredly We sent among them warners"},{"number":73,"text":"So behold what wise hath been the end of those who were warned"},{"number":74,"text":"Save the bondmen of Allah sincere"},{"number":75,"text":"And assuredly Nuh cried Unto us; and We are the Best of answerers"},{"number":76,"text":"And We delivered him and his people from the great affliction"},{"number":77,"text":"And his offspring! them We made the survivors"},{"number":78,"text":"And We left for him among the posterity"},{"number":79,"text":"Peace be on Nuh among the worlds"},{"number":80,"text":"Verily We! thus We recompense the well-doers"},{"number":81,"text":"Verily he was of Our bondmen believing"},{"number":82,"text":"Then We drowned the others"},{"number":83,"text":"And verily of his sect was Ibrahim"},{"number":84,"text":"Recall what time he came Unto his lord with a heart whole"},{"number":85,"text":"Recall what time he said Unto his father and his people: What is it that ye worship"},{"number":86,"text":"Is it a falsehood-god beside Allah - that ye desire"},{"number":87,"text":"what, then, is your opinion of the Lord of the worlds"},{"number":88,"text":"Then he glanced a glance on the stars"},{"number":89,"text":"And he said: verily I am about to be sick"},{"number":90,"text":"So they departed from him turning their backs"},{"number":91,"text":"Then he slipped Unto their gods and said: eat ye not"},{"number":92,"text":"What aileth ye that ye speak not"},{"number":93,"text":"Then he slipped Unto them striking them with the right hand"},{"number":94,"text":"Then they advanced toward him, hastening"},{"number":95,"text":"He said: worship ye that which carve"},{"number":96,"text":"Whereas Allah hath created you and that which ye make"},{"number":97,"text":"They said. build for him a building and cast him into the flaming fire"},{"number":98,"text":"And they devised a plot for him, but We made them the humble"},{"number":99,"text":"And he said: verily I am going to my Lord who will guide me"},{"number":100,"text":"My Lord! Bestow on me a son who will be of the righteous"},{"number":101,"text":"Wherefore We gave him the glad tidings of a boy gentle"},{"number":102,"text":"And when he attained the age of, running with him, he said: O my son! verily I have seen in a dream that I am slaughtering thee; so look, what considerest thou? He said: O my father! do that which thou art commanded; thou shalt find me, Allah willing, of the patients"},{"number":103,"text":"Then when the twain had submitted themselves and he had prostrated him upon his temple"},{"number":104,"text":"We cried Unto him: O Ibrahim"},{"number":105,"text":"Of a surety thou hast fulfilled the vision. Verily We! thus We recompense the well-doers"},{"number":106,"text":"Verily that! that was a trial manifest"},{"number":107,"text":"And We ransomed him with a mighty victim"},{"number":108,"text":"And We left for him among the posterity"},{"number":109,"text":"Peace be Unto Ibrahim"},{"number":110,"text":"Verily We! thus We compense the well-doers"},{"number":111,"text":"Verily he was one of Our believing bondmen"},{"number":112,"text":"And We gave him the glad tidings of Is-haq, a prophet, and of the righteous"},{"number":113,"text":"And We blessed him and Is-haq; and of their offspring are some well-doers and some who wrong themselves manifestly"},{"number":114,"text":"And assuredly We gave grace Unto Musa and Harun"},{"number":115,"text":"And delivered them and their people from the great affliction"},{"number":116,"text":"And We succoured them so that they became overcomers"},{"number":117,"text":"And We vouchsafed Unto the twain a Book luminous"},{"number":118,"text":"And We led the twain on Unto the straight path"},{"number":119,"text":"And We left for the twain among the posterity"},{"number":120,"text":"Peace be Unto Musa and Harun"},{"number":121,"text":"Verily We! thus We recompense the well-doers"},{"number":122,"text":"Verily the twain were of Our bondmen believing"},{"number":123,"text":"And verily, llyas was one of the sent ones"},{"number":124,"text":"Recall what time he said Unto his people: fear ye not"},{"number":125,"text":"Call ye upon Bal and forsake the Best of creators"},{"number":126,"text":"Allah, your Lord and Lord of your forefathers"},{"number":127,"text":"Then they belied him, so verily they are to be brought up"},{"number":128,"text":"Except the bondmen of Allah sincere"},{"number":129,"text":"And We left for him among the posterity"},{"number":130,"text":"Peace be Unto Elyasin"},{"number":131,"text":"Verily We! thus We recompense the well-doers"},{"number":132,"text":"Verily he was one of Our bondmen believing"},{"number":133,"text":"And verily Lut was of the sent ones"},{"number":134,"text":"Recall what time We delivered him and his household, all"},{"number":135,"text":"Save an old woman among the lingerers"},{"number":136,"text":"Then We annihilated the others"},{"number":137,"text":"And surely ye pass by them in the morning"},{"number":138,"text":"And at night. Will ye not therefore reflect"},{"number":139,"text":"And verily Yunus was Of the sent ones"},{"number":140,"text":"Recall what time he ran away Unto a laden ship"},{"number":141,"text":"Then he joined the lots, and was of the condemned"},{"number":142,"text":"And a fish swallowed him, and he was reproaching himself"},{"number":143,"text":"And had he not been of those who hallow Him"},{"number":144,"text":"He would have tarried in the belly thereof till the Day when they are raised"},{"number":145,"text":"Then We cast him on a bare desert whilst he was sick"},{"number":146,"text":"And We caused to grow over him a tree, a gourd"},{"number":147,"text":"And We had sent him to a hundred thousand: rather they exceeded"},{"number":148,"text":"And they believed, whrefore We let them enjoy life for a season"},{"number":149,"text":"Now ask thou them: there for thy Lord daughters and for them sons"},{"number":150,"text":"Or created We the angels females while they were witnesses"},{"number":151,"text":"Lo! verily it is of their falsehood that they say"},{"number":152,"text":"God hath begotten. Verily they are the liars"},{"number":153,"text":"Hath He chosen daughters above sons"},{"number":154,"text":"What aileth you? How judge ye"},{"number":155,"text":"Will ye not then be admonished"},{"number":156,"text":"Or, is there for you a clear warranty"},{"number":157,"text":"Then bring your book, if ye say sooth"},{"number":158,"text":"And they have made a kinship between Him and the jinn a kinship whereas the jinn assuredly know that they are to be brought up"},{"number":159,"text":"Hallowed be Allah from that which they ascribe to Him"},{"number":160,"text":"Except the bondmen of Allah sincere"},{"number":161,"text":"Wherefore verily neither ye nor that which ye worship"},{"number":162,"text":"Can tempt anyone to rebel against Him"},{"number":163,"text":"Save him Who is to roast in the Flaming Fire"},{"number":164,"text":"Of us there is none but hath a station assigned"},{"number":165,"text":"And verily we! we are ranged in ranks"},{"number":166,"text":"And verily we! we halloW"},{"number":167,"text":"And they surely were wont to say"},{"number":168,"text":"Had we but an admonition as had the ancients"},{"number":169,"text":"Surefy we would have been the bondmen of God sincere"},{"number":170,"text":"Yet they disbelieve therein. Presently they shall come to know"},{"number":171,"text":"And assuredly Our word hath already gone forth Our bondmen, the sent ones"},{"number":172,"text":"That verily they! they shall be made triumphant"},{"number":173,"text":"And verily Our host! they are to be overcome"},{"number":174,"text":"So turn thou aside from them for a season"},{"number":175,"text":"And see them thou; they themselves shall presently see"},{"number":176,"text":"Our torment seek they to hasten on"},{"number":177,"text":"Then when it descendeth Unto them face to, face, a hapless morn that shall be for those who were Warned"},{"number":178,"text":"And turn thou aside from them for a season"},{"number":179,"text":"And see thou: they themselves shall presently see"},{"number":180,"text":"Hallowed be thine Lord, the Lord of Majesty, from that which they ascribe"},{"number":181,"text":"And peace be Unto the sent ones"},{"number":182,"text":"And all praise Unto Allah the Lord of the worlds"}]}