{"number":44,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"Ha. Mim"},{"number":2,"text":"By the luminious Book"},{"number":3,"text":"Verily We have sent it down on a blessed night, verily We were to become warners"},{"number":4,"text":"Therein is decreed every affair of wisdom"},{"number":5,"text":"As a command from before Us. Verily We were to become senders"},{"number":6,"text":"A mercy from thy Lord. Verily He! He is the Hearer, the Knower"},{"number":7,"text":"Lord of the heavens and the earth and whatsoever is in- between the twain, if only ye would be convinced"},{"number":8,"text":"There is no god but He. He quickeneth and causeth to die: your Lord and Lord of your forefathers"},{"number":9,"text":"Aye! they're in doubt sporting"},{"number":10,"text":"So wait thou day whereon the heaven will bring forth a manifest smoke"},{"number":11,"text":"Covering the people's this shall be a torment afflictive"},{"number":12,"text":"Our Lord! remove from us the torment, verily we shall become believers"},{"number":13,"text":"How can there be an admonition Unto them, when surely there came Unto them an apostle manifest"},{"number":14,"text":"Yet they turned away from him and said: one tutored, one distraced"},{"number":15,"text":"Verily We shall remove the torment for a while; but verily ye shall revert"},{"number":16,"text":"On the Day whereon We assault them with the greatest assault, verily We shall take vengeance"},{"number":17,"text":"And assuredly afore them We proved Fir'awn's people, and there came Unto them an apostle honoured"},{"number":18,"text":"Saying: restore to me the bondmen of Allah, verily I am Unto you an apostle trusted"},{"number":19,"text":"And saying exalt not yourselves against Allah; verily I have come Unto you with an authority manifest"},{"number":20,"text":"And verily I have sought refuge in my Lord and your Lord lest ye stone me"},{"number":21,"text":"And if ye will not believe in me, then let me alone"},{"number":22,"text":"Then he called upon his Lord. these are a people guilty"},{"number":23,"text":"So depart thou with My bondmen by night; verily ye shall be pursued"},{"number":24,"text":"And leave thou the sea divided: verily they are a host to be drowned"},{"number":25,"text":"They left - how many! - of gardens and springs"},{"number":26,"text":"And cornfields and goodly positions"},{"number":27,"text":"And the delights which they had been enjoying"},{"number":28,"text":"Even so And We caused to inherit them another people"},{"number":29,"text":"And the heavens and the earth wept not over them, nor were they respited"},{"number":30,"text":"And assuredly We delivered the Children of Isra'il from an ignominous torment"},{"number":31,"text":"From Fir'awn; verily he was haughty and of the extravagant"},{"number":32,"text":"And assuredly We elected them with knowledge above the worlds"},{"number":33,"text":"And We vouchsafed Unto them signs wherein was a manifest favour"},{"number":34,"text":"Verily these! they say"},{"number":35,"text":"There is naught but our first death, and we shall not be raised again"},{"number":36,"text":"Bring then our fathers if ye say so"},{"number":37,"text":"Are they better Or the people of Tubba and those afore them? We destroyed them; verily they were culprits"},{"number":38,"text":"And We created not the heavens and the earth and all that is in-between the twain sporting"},{"number":39,"text":"We created them not save with a purpose but most of them know not"},{"number":40,"text":"Verily the Day of Distinction is the term appointed for all of them"},{"number":41,"text":"A Day whereon a friend shall not avail a friend at all, nor shall they be helped"},{"number":42,"text":"Save those on whom Allah will have mercy. Verily He! He is the Mighty, the Merciful"},{"number":43,"text":"Verily the tree of Zaqqum"},{"number":44,"text":"Food of the sinner"},{"number":45,"text":"Like the dregs of all! It shall seethe in the bellies"},{"number":46,"text":"As the seething of boiling water"},{"number":47,"text":"Lay hold of him, and drag him Unto the midst of the Flaming Fire"},{"number":48,"text":"Then pour upon his head the torment of balling water"},{"number":49,"text":"Taste thou! thou art indeed mighty, honoured"},{"number":50,"text":"Verily this is that whereof ye were wont to doubt"},{"number":51,"text":"Verily the God-fearing will be in a place secure"},{"number":52,"text":"Amidst gardens and springs"},{"number":53,"text":"Attired in fine silk and brocade, facing each other"},{"number":54,"text":"Even so. And We shall pair them with fair damsels large- eyed"},{"number":55,"text":"They will call therein for every kind of fruit in security"},{"number":56,"text":"They will not taste death therein, except the first death; and He will preserve them from the torment of the Flaming Fire"},{"number":57,"text":"A bounty from thy Lord. That! that is the supreme achievement"},{"number":58,"text":"And We have made it easy in thy language; they might haply be admonished"},{"number":59,"text":"Wait thou then; verily they also are waiting"}]}