{"number":75,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"I swear by the Day of Resurrection"},{"number":2,"text":"And I swear by the self-reproaching soul"},{"number":3,"text":"Deemest man that We shall not assemble his bones"},{"number":4,"text":"Yea! WE are Able to put together evenly his finger-tips"},{"number":5,"text":"Aye! man desireth that he may sin before him"},{"number":6,"text":"He asketh: when will the Day of Resurrection be"},{"number":7,"text":"When, then, the sight shall be confounded"},{"number":8,"text":"And the moon shall be ecliped"},{"number":9,"text":"And the sun and the moon shall be joined"},{"number":10,"text":"On that Day shall man say: whither is the fleeing"},{"number":11,"text":"By no means! NO refuge"},{"number":12,"text":"Unto thy Lord that Day is the recourse"},{"number":13,"text":"To man will be declared on that Day that which he hath sent on and left behind"},{"number":14,"text":"Aye! man against himself shall be an enlightenment"},{"number":15,"text":"Although he may put forth his pleas"},{"number":16,"text":"Move not thy tongue therewith that thou mayest hasten therewith"},{"number":17,"text":"Verily upon us is the collecting thereof and the reciting thereof"},{"number":18,"text":"Wherefore when We reciteit, follow thou the reciting thereof"},{"number":19,"text":"And thereafter verily upon us is is the expounding thereof"},{"number":20,"text":"By no means! Verily ye love the Herein"},{"number":21,"text":"And leave the Hereafter"},{"number":22,"text":"Countenances on that Day shall be resplendent"},{"number":23,"text":"Looking toward their Lord"},{"number":24,"text":"And countenances on that Day shall be scowling"},{"number":25,"text":"Imagining that there will befall them a waiste-breaking calomity"},{"number":26,"text":"By no means! When it cometh up to he collar-bone"},{"number":27,"text":"And it is cried. who can charm"},{"number":28,"text":"And he bethinketh that it is the time of parting"},{"number":29,"text":"And one shank is entangled with the other shank"},{"number":30,"text":"Unto thy Lord that Day is the drive"},{"number":31,"text":"He neither believed nor prayed"},{"number":32,"text":"But he belied and turned away"},{"number":33,"text":"Then he departed Unto his house hold conceitedly"},{"number":34,"text":"Woe Unto thee; woe"},{"number":35,"text":"Again, woe Unto thee, woe"},{"number":36,"text":"Deemest man that he is to be left uncontrolled"},{"number":37,"text":"Was he not a sperm of emission emitted"},{"number":38,"text":"Then he became a clot; then He created him and formed him"},{"number":39,"text":"And made of him the two sexes, male and female"},{"number":40,"text":"Is not That One then Able to quicken the dead"}]}