{"number":76,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"Surely there hath come upon man a space of time when he was not a thing worth mentioning"},{"number":2,"text":"Verily We! We created man from a sperm of mixtures, that We might prove him, wherefore We made him hearing, seeing"},{"number":3,"text":"Verily We! We shewed him the way; then he becometh either thankful or ingrate"},{"number":4,"text":"Verily We! We have gotten ready for the infidels chains and collars and a Blaze"},{"number":5,"text":"Verily the pious shall drink of a cup whereof the admixture is like Unto camphor"},{"number":6,"text":"From a fountain whence the bondmen of Allah will drink, causing it to gush abundantly"},{"number":7,"text":"They fulfill their vow and dread a Day the evil whereof shall be widespreading"},{"number":8,"text":"And they feed with food, for love of Him, the needy, and the orphan and the captive"},{"number":9,"text":"Saying: we feed you only for the sake of Allah; we desire not from you any recompense or thanks"},{"number":10,"text":"Verily we dread from our Lord a Day grim and distressful"},{"number":11,"text":"Wherefore Allah shall preserve them from the evil of that Day, and shall cause them to meet brightness and joy"},{"number":12,"text":"And shall recompense them for that which they patiently bare with a Garden and silken garment"},{"number":13,"text":"Reclining therein upon couches, they shall behold therein neither sun nor hurting cold"},{"number":14,"text":"And close upon them will be the shades thereof, and low will hang the clusters thereof greatly"},{"number":15,"text":"And brought round amongst them will be vessels of silver and also goblets of glass"},{"number":16,"text":"Godblets of silver, they shall have filled them to exact measure"},{"number":17,"text":"And therein they shall be given to drink of a cup whereof the admixture will be ginger"},{"number":18,"text":"From a fountain therein, named Salsabil"},{"number":19,"text":"And there shall go round Unto them youths ever-young. When thou seest them thou wouldst deem them pearls unstrung"},{"number":20,"text":"And when thou lookest them thou shalt behold delight and a dominion magnificent"},{"number":21,"text":"Upon them shall be garments of fine green silk and of brocades. And adorned they shall be with bracelets of silver: and their Lord shall give them drink a beverage pure"},{"number":22,"text":"Verily this is for you by way of recompense, and your endeavour hath been accepted"},{"number":23,"text":"Verily We! it is We Who have revealed Unto thee the Qur'an, a gradual revelation"},{"number":24,"text":"Wherefore persevere thou with the commandment of thy Lord, and obey not thou of them, any sinner or ingrate"},{"number":25,"text":"And remember thou the name of thy Lord in the morning and in the evening"},{"number":26,"text":"And during the night - worship Him; and hallow Him the livelong night"},{"number":27,"text":"Verily those love the Herein, and leave in front of them a heavy day"},{"number":28,"text":"It it We Who creared them and made them firm of make. And whenever We list, We can replace them with others like Unto them"},{"number":29,"text":"Verily this is an admonition; then whosoever Will, may choose a way Unto his Lord"},{"number":30,"text":"And ye will not, unless Allah willeth. Verily Allah is ever Knowing, Wise"},{"number":31,"text":"He maketh whomsoever He listeth to enter His mercy. And the wrong-doers! for them He hath gotten ready a torment afflective"}]}