{"number":79,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"By the angels who drag forth vehemently"},{"number":2,"text":"By the angels who release with gentle release"},{"number":3,"text":"By the angels who glide swimmingiy"},{"number":4,"text":"And then they speed with foremost speed"},{"number":5,"text":"And then they manage the affair"},{"number":6,"text":"A Day shall come whereon the quaking will quake"},{"number":7,"text":"And there will follow it the next blast"},{"number":8,"text":"Hearts on that Day will be throbbing"},{"number":9,"text":"Their looks will be downcast"},{"number":10,"text":"They say: shall we indeed be restored to the first state"},{"number":11,"text":"When we have become bones decayed"},{"number":12,"text":"They say: that then shall be a losing return"},{"number":13,"text":"It will be only one scaring shout"},{"number":14,"text":"And lo! they all shall appear on the surface"},{"number":15,"text":"Hath there come Unto thee the story of Musa"},{"number":16,"text":"Recall what time his Lord called Unto him in the holy vale of Tuwa"},{"number":17,"text":"Saying:'go thou Unto Fir'awn; verily he hath waxen exorbitant"},{"number":18,"text":"Then say thou: 'wouldst thou to be purified"},{"number":19,"text":"Then shall guide thee Unto thy Lord so that thou shalt fear"},{"number":20,"text":"Then he shewed him the great sign"},{"number":21,"text":"Yet he belied and disobeyed"},{"number":22,"text":"Then he turned back striving"},{"number":23,"text":"Then he gathered and cried aloud"},{"number":24,"text":"And he said: I am Your Lord, most high"},{"number":25,"text":"Wherefore Allah laid hold of him with the punishment of the Hereafter and of the present"},{"number":26,"text":"Verily herein is lesson for him who feareth"},{"number":27,"text":"Are ye harder to create or the heaven which He hath builded"},{"number":28,"text":"He hath raised the height thereof and perfected it"},{"number":29,"text":"And He made dark its night, and brought forth its sunshine"},{"number":30,"text":"And the earth!- thereafter He stretched it out"},{"number":31,"text":"And he brought forth therefrom its water, and its pasture"},{"number":32,"text":"And the mountains! - He established them firm"},{"number":33,"text":"A provision for you and your cattle"},{"number":34,"text":"Then when the Grand Calamity shall come"},{"number":35,"text":"The Day whereon man shall rember whatsoever he had striven for"},{"number":36,"text":"And the Scorch will be made apparent to any one who beholdeth"},{"number":37,"text":"Then as for him who waxed exorbitant"},{"number":38,"text":"And who chose the life of the world"},{"number":39,"text":"Verily the Scorch! that shall be his resort"},{"number":40,"text":"And as for him who dreaded standing before his Lord, and restrained his soul from lust"},{"number":41,"text":"Verily the Garden! -that shall be his resort"},{"number":42,"text":"They question thee of the Hour:'when will its arrival be"},{"number":43,"text":"Wherein art thou concerred with the declaration thereof"},{"number":44,"text":"Unto thy Lord is the Knowledge of the limit fixed therefor"},{"number":45,"text":"Thou art but a warner Unto him who feareth"},{"number":46,"text":"On the Day whereon they behold it, it will appear to them as though they had not tarried save an evening or the morn thereof"}]}