{"number":83,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"Woe Unto the scrimpers"},{"number":2,"text":"Those who, when they take by measure from mankind, exact the full"},{"number":3,"text":"And who, when they measure Unto them or weigh for them, diminish"},{"number":4,"text":"Imagine such men not that they shall be raised up"},{"number":5,"text":"On a mighty Day"},{"number":6,"text":"A Day whereon mankind shall stand before the Lord of the worlds"},{"number":7,"text":"By no means! Verily the record of the ungodly is in Sijjin"},{"number":8,"text":"And what will make thee know whatsoever the record in Sijjin is"},{"number":9,"text":"A record of misdeeds written"},{"number":10,"text":"Woe on that Day unto the belviers"},{"number":11,"text":"Those who belie the Day of Requital"},{"number":12,"text":"And none belieth it save each trespasser, sinner"},{"number":13,"text":"And when Our revelations are rehearsed Unto him, she saith:'fables of the ancients"},{"number":14,"text":"By no means!' Aye! encrusted upon their hearts is that which they have been earning"},{"number":15,"text":"By no means! Verily on that Day from their Lord they will be shut Out"},{"number":16,"text":"Then verily they will be roasted into the Scorch"},{"number":17,"text":"Then it will be said: 'this is that which ye were wont to belie"},{"number":18,"text":"By no means! Verily the record of the virtuous shall be in 'Illiyun"},{"number":19,"text":"And what will make thee know whatsoever the record in Illiyun is"},{"number":20,"text":"A record of good deeds written"},{"number":21,"text":"To which bear witness those brought nigh"},{"number":22,"text":"Verily the virtuous shall be in Delight"},{"number":23,"text":"Reclining on couches, looking on"},{"number":24,"text":"Thou wilt recognize in their faces the brightness of delight"},{"number":25,"text":"They will be given to drink of pure wine, sealed"},{"number":26,"text":"The seal thereof will be of musk and to this end let the aspirers aspire"},{"number":27,"text":"And admixture thereof will be Water of Tasnim"},{"number":28,"text":"A fountain whereof will drink those brought nigh"},{"number":29,"text":"Veriiy those who have sinned were wont at those who had believed to laugh"},{"number":30,"text":"And, when they passed them, to wink at each other"},{"number":31,"text":"And when they returned to their household they returned jesting"},{"number":32,"text":"And when they saw them, they said: verily these are the strayed ones"},{"number":33,"text":"Whereas they were not sent over them as watchers"},{"number":34,"text":"Wherefore Today, those who believed at the infidels are laughing"},{"number":35,"text":"Reclining on couches, looking on"},{"number":36,"text":"The infidels have indeed been rewarded for that which they had been doing"}]}