{"number":89,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"By the dawn"},{"number":2,"text":"And by ten nights"},{"number":3,"text":"And by the even and the odd"},{"number":4,"text":"And by the night when it departeth"},{"number":5,"text":"Indeed in that there is an oath for a man of sense"},{"number":6,"text":"Bethinkest thou not in what wise thy Lord did with the 'A'ad"},{"number":7,"text":"The people of many-columned lram"},{"number":8,"text":"The like of which was not built in the cities"},{"number":9,"text":"And With Thamud who hewed out rocks in the vale"},{"number":10,"text":"And with Fir'awn, owner of the stakes"},{"number":11,"text":"Who all waxed exorbitant in the cities"},{"number":12,"text":"And multiplied therein corruption"},{"number":13,"text":"Wherefore thy Lord poured on them the scourge of His torment"},{"number":14,"text":"Verily thy Lord is in an ambuscade"},{"number":15,"text":"As for man - when his Lord proveth him and so honoureth him and is bounteous Unto him, then he saith: 'my Lord hath honoured me"},{"number":16,"text":"And when He proveth him, and so stinteth Unto him his provision, he saith: 'my Lord hath despised me"},{"number":17,"text":"By no means! But ye honour not the orphan"},{"number":18,"text":"Nor urge upon each other the feeding of the poor"},{"number":19,"text":"And devour the inheritance devouring greedily"},{"number":20,"text":"And ye love riches with exceeding love"},{"number":21,"text":"By no means! when the earth shall be ground with grinding, grinding"},{"number":22,"text":"And thy Lord shall come and the angels, rank on rank"},{"number":23,"text":"And the Hell on that Day shall be brought nigh. On that Day man shall remember, but how will remembrance avail him"},{"number":24,"text":"He will say. 'would that I had sent before for this life of mine"},{"number":25,"text":"Wherefore on that Day none shall torment with His torment"},{"number":26,"text":"Nor shall any bind with His bond"},{"number":27,"text":"O thou peaceful soul"},{"number":28,"text":"Return Unto thine Lord well pleased and well-pleasing"},{"number":29,"text":"Enter thou among My righteous bondmen"},{"number":30,"text":"And enter thou My Garden"}]}