{"id":73,"ayahs":[{"number":1,"text":"And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Nay, I swear by this city): '(Nay, I swear by this city) He says: I swear by the city of Mecca"},{"number":10,"text":"(And guide him to the parting of the mountain ways?) And We showed him the way of goodness and the way of evil; and it is also that this means: the way to the two breasts."},{"number":11,"text":"(But he hath not attempted the Ascent) He says: but did he go beyond that hurdle which is the Bridge over hell?"},{"number":12,"text":"(Ah, what will convey unto thee) O Muhammad (what the Ascent is!) it is a smooth hurdle between Paradise and hell. Allah said this to arouse the Prophet's astonishment."},{"number":13,"text":"((It is) to free a slave) He says: its crossing requires the freeing of a slave; and it is also said this means: none will cross it save he who has freed a slave,"},{"number":14,"text":"(And to feed in the day of hunger) and hardship"},{"number":15,"text":"(An orphan near of kin,"},{"number":16,"text":"Or some poor wretch in misery) and who has nothing,"},{"number":17,"text":"(And to be) in addition to this (of those who believe) in private between themselves and their Lord, in Muhammad (pbuh) and the Qur'an (and exhort one another to perseverance) in fulfilling the obligations (and export one another to pity) towards the poor and needy."},{"number":18,"text":"(Their place will be on the right hand) those who are given their register in their right hands are the inhabitants of the Garden."},{"number":19,"text":"(But those who disbelieve Our revelations) in Muhammad (pbuh) and the Qur'an, i.e. Kildah and his host, (their place will be on the left hand) those who are given their register in their left hand are the inhabitants of the Fire."},{"number":2,"text":"(And thou art an indweller of this city) and it is also said that this means: Allah has made lawful for you in this city that which he did not make lawful to anyone before or after you; and it is also said that this means: you are excused regarding that which you do in this city."},{"number":20,"text":"(Fire will be an awning over them) the Fire will fall on them'."},{"number":3,"text":"(And the begetter and that which he begat) the begetter is Adam and that which his sons begat; and it is also said this means: the begetter refers to the person who can have children, whether this person is a man or a woman, while that which he begat refers to the men or women who cannot have children; Allah swore by all these,"},{"number":4,"text":"(We verily have created man) i.e. Kildah Ibn Usayd (in an atmosphere) in an erect form; it is also said that this means: in strife with the matter of the life of this world and of the Hereafter; and it is also said this means: with strength and force:"},{"number":5,"text":"(Thinketh he) does the disbelieving man think (that) because of his strength and force (none hath power over him?) i.e. Allah cannot seize and punish him."},{"number":6,"text":"(And he) Kildah Ibn Usayd; and it is also said: al-Walid Ibn al-Mughirah (saith: I have destroyed vast wealth) I have spent abundant wealth in enmity towards Muhammad, Allah bless him, and this did not benefit me:"},{"number":7,"text":"(Thinketh he) does the disbelieving man deem (that none beholdeth him) that Allah does not see his deeds whether he spends money or not?"},{"number":8,"text":"Allah then mentioned the blessings He bestowed upon him, saying: (Did We not assign unto him two eyes) with which he sees"},{"number":9,"text":"(And a tongue) with which he speaks (and two lips) which he can join together or separate,"}]}