{"number":56,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"جب واقع ہونے والی واقع ہو گی"},{"number":2,"text":"جس کے واقع ہونے میں کچھ بھی جھوٹ نہیں"},{"number":3,"text":"پست کرنے والی اور بلند کرنے والی"},{"number":4,"text":"جب کہ زمین بڑے زور سے ہلائی جائے گی"},{"number":5,"text":"اور پہاڑ ٹکڑے ٹکڑے ہو کر چورا ہو جائیں گے"},{"number":6,"text":"سو و ہ غبار ہو کر اڑتے پھریں گے"},{"number":7,"text":"اور (اس وقت) تمہاری تین جماعتیں ہو جائیں گی"},{"number":8,"text":"پھر داہنے والے کیا خوب ہی ہیں داہنے والے"},{"number":9,"text":"اوربائیں والے کیسے برے ہیں بائیں والے"},{"number":10,"text":"اور سب سے اول ایمان لانے والے سب سے اول داخل ہونے والے ہیں"},{"number":11,"text":"وہ الله کے ساتھ خاص قرب رکھنے والے ہیں"},{"number":12,"text":"نعمت کے باغات ہوں گے"},{"number":13,"text":"پہلوں میں سے بہت سے"},{"number":14,"text":"اور پچھلوں میں سے تھوڑے سے"},{"number":15,"text":"تختوں پر جو جڑاؤ ہوں گے"},{"number":16,"text":"آمنے سامنے تکیہ لگائے ہوئےبیٹھے ہوں گے"},{"number":17,"text":"ان کے پاس ایسے لڑکے جو ہمیشہ لڑکے ہی رہیں گے آمد و رفت کیا کریں گے"},{"number":18,"text":"آبخورے اور آفتابے اور ایسا جام شراب لے کر جو بہتی ہوئی شراب سے بھرا جائے گا"},{"number":19,"text":"نہ اس سے ان کو دردِ سر ہوگا اور نہ اس سے عقل میں فتور آئے گا"},{"number":20,"text":"اور میوے جنہیں وہ پسند کریں گے"},{"number":21,"text":"اور پرندوں کا گوشت جو ان کو مرغوب ہو گا"},{"number":22,"text":"اوربڑی بڑی آنکھوں والی حوریں"},{"number":23,"text":"جیسے موتی کئی تہو ں میں رکھےہوئے ہوں"},{"number":24,"text":"بدلے اس کے جو وہ کیا کرتے تھے"},{"number":25,"text":"وہ وہاں کوئی لغو اور گناہ کی بات نہیں سنیں گے"},{"number":26,"text":"مگر سلام سلام کہنا"},{"number":27,"text":"اور داہنے والے کیسے اچھے ہوں گے داہنے والے"},{"number":28,"text":"وہ بے کانٹوں کی بیریوں میں ہوں گے"},{"number":29,"text":"اور گتھے ہوئے کیلو ں میں"},{"number":30,"text":"اورلمبے سایوں میں"},{"number":31,"text":"اور پانی کی آبشاروں میں"},{"number":32,"text":"اور باافراط میوں میں"},{"number":33,"text":"جونہ کبھی منقطع ہوں گے اور نہ ان میں روک ٹوک ہو گی"},{"number":34,"text":"اور اونچے فرشتوں میں"},{"number":35,"text":"بے شک ہم نے انہیں (حوروں کو) ایک عجیب انداز سے پیدا کیا ہے"},{"number":36,"text":"پس ہم نے انہیں کنواریاں بنا دیا ہے"},{"number":37,"text":"دل لبھانے والی ہم عمر بنایا ہے"},{"number":38,"text":"داہنے والوں کے لیے"},{"number":39,"text":"بہت سے پہلوں میں سے ہوں گے"},{"number":40,"text":"اور بہت سے پچھلوں میں سے"},{"number":41,"text":"اوربائیں والے کیسے برے ہیں بائیں والے"},{"number":42,"text":"وہ لووں اور کھولتے ہوئے پانی میں ہوں گے"},{"number":43,"text":"اور سیاہ دھوئیں کے سائے میں"},{"number":44,"text":"جو نہ ٹھنڈا ہوگا اور نہ راحت بخش"},{"number":45,"text":"بے شک وہ اس سے پہلے خوش حال تھے"},{"number":46,"text":"اور بڑے گناہ (شرک) پر اصرار کیا کرتے تھے"},{"number":47,"text":"اور کہا کرتے تھے کیا جب ہم مر جائیں گے اور مٹی اور ہڈیاں ہو جائیں گے تو کیا ہم پھر اٹھاے جائیں گے"},{"number":48,"text":"اور کیا ہمارے اگلے باپ دادا بھی"},{"number":49,"text":"کہہ دو بے شک پہلے بھی اور پچھلے بھی"},{"number":50,"text":"ایک معین تاریخ کے وقت پر جمع کیے جاویں گے"},{"number":51,"text":"پھر بے شک تمہیں اے گمراہو جھٹلانے والو"},{"number":52,"text":"البتہ تھوہر کا درخت کھانا ہوگا"},{"number":53,"text":"پھر اس سے پیٹ بھرنے ہوں گے"},{"number":54,"text":"پھر اس پر کھولتا ہوا پانی پینا ہوگا"},{"number":55,"text":"پھر پینا ہو گا پیاسے اونٹوں کا سا پینا"},{"number":56,"text":"قیامت کے دن یہ ان کی مہمانی ہو گی"},{"number":57,"text":"ہم نے ہی تمہیں پیدا کیا ہے پس کیوں تم تصدیق نہیں کرتے"},{"number":58,"text":"بھلا دیکھو (تو) (منی) جو تم ٹپکاتے ہو"},{"number":59,"text":"کیا تم اسے پیدا کرتے ہو یا ہم ہی پیدا کرنے والے ہیں"},{"number":60,"text":"ہم نے ہی تمہارے درمیان موت مقرر کر دی ہے اور ہم عاجز نہیں ہیں"},{"number":61,"text":"اس بات سے کہ ہم تم جیسے لوگ بدل لائیں اور تمہیں ایسی صورت میں بنا کھڑا کریں جو تم نہیں جانتے"},{"number":62,"text":"اور تم پہلی پیدائش کو جان چکے ہو پھر کیوں تم غور نہیں کرتے"},{"number":63,"text":"بھلا دیکھو جو کچھ تم بولتے ہو"},{"number":64,"text":"کیا تم اسے اگاتے ہو یا ہم اگانے والے ہیں"},{"number":65,"text":"اگر ہم چاہیں تو اسے چورا چورا کر دیں پھر تم تعجب کرتے رہ جاؤ"},{"number":66,"text":"کہ بے شک ہم پر تو تاوان پڑ گیا"},{"number":67,"text":"بلکہ ہم بے نصیب ہو گئے"},{"number":68,"text":"بھلا دیکھو تو سہی وہ پانی جو تم پیتے ہو"},{"number":69,"text":"کیا تم نے اسے بادل سے اتارا ہے یا ہم اتارنے والے ہیں"},{"number":70,"text":"اگر ہم چاہیں تو اسے کھاری کر دیں پس کیوں تم شکر نہیں کرتے"},{"number":71,"text":"بھلا دیکھو تو سہی وہ آگ جو تم سلگاتے ہو"},{"number":72,"text":"کیا تم نے اس کا درخت پیدا کیا ہے یا ہم پیدا کرنے والے ہیں"},{"number":73,"text":"ہم نے اسے یادگار اور مسافروں کے لیے فائدہ کی چیز بنا دیا ہے"},{"number":74,"text":"پس اپنے رب کے نام کی تسبیح کر جو بڑا عظمت والا ہے"},{"number":75,"text":"پھر میں تاروں کے ڈوبنے کی قسم کھاتا ہوں"},{"number":76,"text":"اور بے شک اگر سمجھو تو یہ بڑی قسم ہے"},{"number":77,"text":"کہ بے شک یہ قرآن بڑی شان والا ہے"},{"number":78,"text":"ایک پوشیدہ کتاب میں لکھا ہوا ہے"},{"number":79,"text":"جسے بغیر پاکو ں کے اور کوئی نہیں چھوتا"},{"number":80,"text":"پروردگار عالم کی طرف سے نازل ہوا ہے"},{"number":81,"text":"سو کیا تم اس کلام کو سرسری بات سمجھتے ہو"},{"number":82,"text":"اور اپنا حصہ تم یہی لیتے ہو کہ اسے جھٹلاتے ہو"},{"number":83,"text":"پھر کس لیے روح کو روک نہیں لیتے جب کہ وہ گلے تک آ جاتی ہے"},{"number":84,"text":"اورتم اس وقت دیکھا کرتے ہو"},{"number":85,"text":"اور تم سے زیادہ ہم اس کے قرب ہوتے ہیں لیکن تم نہیں دیکھتے"},{"number":86,"text":"پس اگر تمہارا حساب کتاب ہونے والا نہیں ہے"},{"number":87,"text":"تو تم اس روح کو کیوں نہیں لوٹا دیتے اگر تم سچے ہو"},{"number":88,"text":"پھر (جب قیامت آئے گی) اگر وہ مقربین میں سے ہے"},{"number":89,"text":"تو (اس کے لیے) راحت اور خوشبو میں اور عیش کی باغ ہیں"},{"number":90,"text":"اور اگر وہ داہنے والوں میں سے ہے"},{"number":91,"text":"تو اے شخص تو جو داہنے والوں میں سے ہے تجھ پر سلام ہو"},{"number":92,"text":"اور اگر وہ جھٹلانے والے گمراہوں میں سے ہے"},{"number":93,"text":"تو کھولتا ہوا پانی مہمانی ہے"},{"number":94,"text":"اور دوزخ میں داخل ہونا ہے"},{"number":95,"text":"بے شک یہ تحقیقی یقینی بات ہے"},{"number":96,"text":"پس اپنے رب کی نام تسبیح کر جو بڑا عظمت والا ہے"}]}