{"number":75,"edition":"ur.ahmedali","ayahs":[{"number":1,"text":"قیامت کے دن کی قسم ہے"},{"number":2,"text":"اور پشیمان ہونے والے شخص کی قسم ہے"},{"number":3,"text":"کیا انسان سمجھتا ہے کہ ہم اس کی ہڈیاں جمع نہ کریں گے"},{"number":4,"text":"ہاں ہم تو اس پر قادر ہیں کہ اس کی پور پور درست کر دیں"},{"number":5,"text":"بلکہ انسان تو چاہتا ہے کہ آئندہ بھی نافرمانی کرتا رہے"},{"number":6,"text":"پوچھتا ہےکہ قیامت کا دن کب ہو گا"},{"number":7,"text":"پس جب آنکھیں چندھیا جائیں گی"},{"number":8,"text":"اور چاند بے نور ہو جائے گا"},{"number":9,"text":"اور سورج اور چاند اکھٹے کیے جائیں گے"},{"number":10,"text":"اس دن انسان کہے گا کہ بھاگنے کی جگہ کہاں ہے"},{"number":11,"text":"ہر گز نہیں کہیں پناہ نہیں"},{"number":12,"text":"اس دن آپ کے رب ہی کی طرف ٹھکانہ ہے"},{"number":13,"text":"اس دن انسان کو بتا دیا جائے گا کہ وہ کیا لایا اور کیا چھوڑ آیا"},{"number":14,"text":"بلکہ انسان اپنے اوپر خود شاہد ہے"},{"number":15,"text":"گو وہ کتنے ہی بہانے پیش کرے"},{"number":16,"text":"آپ (وحی ختم ہونے سے پہلے) قرآن پراپنی زبان نہ ہلایا کیجیئے تاکہ آپ اسے جلدی جلدی لیں"},{"number":17,"text":"بے شک اس کا جمع کرنا اور پڑھا دینا ہمارے ذمہ ہے"},{"number":18,"text":"پھر جب ہم ا سکی قرأت کر چکیں تو اس کی قرأت کا اتباع کیجیئے"},{"number":19,"text":"پھر بے شک اس کا کھول کر بیان کرنا ہمارے ذمہ ہے"},{"number":20,"text":"ہر گز نہیں بلکہ تم تو دنیا کو چاہتے ہو"},{"number":21,"text":"اور آخرت کو چھوڑتے ہو"},{"number":22,"text":"کئی چہرے اس دن تر و تازہ ہو ں گے"},{"number":23,"text":"اپنے رب کی طرف دیکھتے ہوں گے"},{"number":24,"text":"اور کتنے چہرے اس دن اداس ہو ں گے"},{"number":25,"text":"خیال کر رہے ہوں گے کہ ان کے ساتھ کمر توڑ دینے والی سختی کی جائے گی"},{"number":26,"text":"نہیں نہیں جب کہ جان گلے تک پہنچ جائے گی"},{"number":27,"text":"اورلوگ کہیں گے کوئی جھاڑنے والا ہے"},{"number":28,"text":"اور وہ خیال کرے گا کہ یہ وقت جدائی کا ہے"},{"number":29,"text":"اور ایک پنڈلی دوسری پنڈلی سے لپٹ جائے گی"},{"number":30,"text":"تیرے رب کی طرف اس دن چلنا ہوگا"},{"number":31,"text":"پھر نہ تو اس نے تصدیق کی اور نہ نماز پڑھی"},{"number":32,"text":"بلکہ جھٹلایا اورمنہ موڑا"},{"number":33,"text":"پھر اپنے گھر والوں کی طرف اکڑتا ہوا چلا گیا"},{"number":34,"text":"(اے انسان) تیرے لیے افسوس پرافسوس ہے"},{"number":35,"text":"پھر تیرے لیے افسوس پر افسوس ہے"},{"number":36,"text":"کیاانسان یہ سمجھ رہا ہے کہ وہ یونہی چھوڑ دیا جائے گا"},{"number":37,"text":"کیا وہ ٹپکتی منی کی ایک بوند نہ تھا"},{"number":38,"text":"پھر وہ لوتھڑا بنا پھر الله نے اسے بنا کر ٹھیک کیا"},{"number":39,"text":"پھر اس نے مرد و عورت کا جوڑا بنایا"},{"number":40,"text":"پھر کیا وہ الله مردے زندہ کردینے پر قادر نہیں"}]}