{"number":51,"edition":"pl.bielawskiego","ayahs":[{"number":1,"text":"Na gwałtownie rozpraszające"},{"number":2,"text":"I na niosące brzemię"},{"number":3,"text":"I na płynące z lekkością"},{"number":4,"text":"I na rozdzielające rozkazy"},{"number":5,"text":"Zaprawdę, to, co wam zostało obiecane, jest prawdziwe"},{"number":6,"text":"Zaprawdę, Sąd z pewnością nadejdzie"},{"number":7,"text":"I na niebo posiadające szlaki gwiezdne"},{"number":8,"text":"Zaprawdę, różnicie się w mowie"},{"number":9,"text":"Odwrócony został od tego ten, kto dał się odwrócić"},{"number":10,"text":"Niech zginą kłamcy"},{"number":11,"text":"Którzy w swoim zamęcie są beztroscy"},{"number":12,"text":"Oni pytają: \"Kiedyż nadejdzie Dzień Sądu"},{"number":13,"text":"W Dniu, kiedy oni będą wystawieni na ogień"},{"number":14,"text":"Zakosztujcie waszego doświadczenia! To jest to, co staraliście się przyśpieszyć"},{"number":15,"text":"Zaprawdę, bogobojni będą przebywać wśród ogrodów i źródeł"},{"number":16,"text":"Przyjmując to, co dał im Pan. Oni byli przedtem wśród czyniących dobro"},{"number":17,"text":"Oni mało sypiali nocą"},{"number":18,"text":"I o świcie prosili Boga o przebaczenie"},{"number":19,"text":"W ich majątku mieli odpowiedni udział żebrak i nędzarz"},{"number":20,"text":"Na ziemi są znaki dla tych, którzy są przekonani o prawdzie"},{"number":21,"text":"I są w waszych duszach. Czy wy nie widzicie"},{"number":22,"text":"W niebie jest wasze zaopatrzenie i to, co wam zostało obiecane"},{"number":23,"text":"Na Pana nieba i ziemi! Zaprawdę, to jest tak prawdziwe, jak to, że mówicie"},{"number":24,"text":"Czy doszło do ciebie opowiadanie o gościach Abrahama, uszanowanych"},{"number":25,"text":"Kiedy oni weszli do niego i powiedzieli: \"Pokój!\", on odparł: \"Pokój, nieznani ludzie"},{"number":26,"text":"I poszedł do swojej rodziny, i przyniósł tłustego cielaka"},{"number":27,"text":"I podał im go, mówiąc: \"Czyż nie będziecie jedli"},{"number":28,"text":"I odczuł przed nimi pewną obawę. Oni powiedzieli: \"Nie obawiaj się!\" - i obwieścili mu radosną wieść o mądrym chłopcu"},{"number":29,"text":"Wtedy przyszła jego żona z krzykiem, biła się po twarzy i mówiła \"Stara kobieta, bezpłodna"},{"number":30,"text":"I rzekli: \"Tak powiedział twój Pan. Zaprawdę, On jest Mądry, Wszechwiedzący"},{"number":31,"text":"Abraham powiedział: \"Jaka jest wasza sprawa, o wysłannicy"},{"number":32,"text":"Odparli: \"Zostaliśmy wysłani do ludu grzeszników"},{"number":33,"text":"Aby rzucić na nich kamienie z gliny"},{"number":34,"text":"Oznakowane u twego Pana dla ludzi występnych"},{"number":35,"text":"Przeto wyprowadziliśmy tych spośród wiernych, którzy się w tym mieście znajdowali"},{"number":36,"text":"Lecz znaleźliśmy tam tylko jeden dom takich, którzy się poddali całkowicie"},{"number":37,"text":"I zostawiliśmy w tym mieście znak dla tych, którzy się obawiają kary bolesnej"},{"number":38,"text":"i o Mojżeszu? Oto wysłaliśmy go do Faraona, dając mu władzę jasną"},{"number":39,"text":"Lecz on odwrócił się, pewny swojej potęgi, i powiedział: Czarownik albo opętany"},{"number":40,"text":"Wtedy pochwyciliśmy go wraz z jego wojskami i wrzuciliśmy ich w otchłań morza, bo był on godny nagany"},{"number":41,"text":"i o ludzie Ad? oto posłaliśmy przeciw nim niszczycielski wiatr"},{"number":42,"text":"Który wszystko, nad czym przeszedł, zamienił w pył"},{"number":43,"text":"i o ludzie Samud? Oto powiedzieliśmy im: \"Używajcie jeszcze przez pewien czas"},{"number":44,"text":"Lecz oni byli dumni wobec rozkazu swego Pana i poraził ich piorun, kiedy mieli otwarte oczy"},{"number":45,"text":"I nie mogli ani wstać, ani uzyskać żadnej pomocy"},{"number":46,"text":"a jeszcze wcześniej o Noem? Zaprawdę, oni byli ludem występnym"},{"number":47,"text":"A niebo?! Zbudowaliśmy je solidnie - My przecież tworzymy rozległe przestrzenie"},{"number":48,"text":"A ziemia?! Rozpostarliśmy ją. I jakże wspaniale wszystko porządkujemy"},{"number":49,"text":"Z każdej rzeczy stworzyliśmy parę. Może sobie przypomnicie"},{"number":50,"text":"Przeto, uciekajcie się do Boga! Zaprawdę, ja jestem dla was, od Niego, jawnie ostrzegającym"},{"number":51,"text":"I nie umieszczajcie razem z Bogiem żadnego innego boga! Zaprawdę, ja jestem dla was od Niego jawnie ostrzegającym"},{"number":52,"text":"Podobnie do każdego posłańca przychodzącego do tych ludzi, którzy byli przed nimi, oni mówili: \"Czarownik albo opętany"},{"number":53,"text":"Czy oni to sobie kolejno przekazywali? Przeciwnie! To lud buntowniczy"},{"number":54,"text":"Odwróć się więc od nich, a nie będziesz ganiony"},{"number":55,"text":"I napominaj! bo, zaprawdę, napominanie przynosi korzyść wiernym"},{"number":56,"text":"I stworzyłem dżiny i ludzi tylko po to, żeby Mnie czcili"},{"number":57,"text":"I nie chcę od nich żadnego zaopatrzenia, i nie chcę, aby Mnie żywili"},{"number":58,"text":"Zaprawdę, Bóg jest Dawcą Zaopatrzenia, Posiadającym Siłę, Niewzruszonym"},{"number":59,"text":"I, zaprawdę, tym, którzy byli niesprawiedliwi - przypadnie pewien udział, podobny do udziału ich towarzyszy. Niech więc oni nie próbują skłaniać Mnie do pośpiechu"},{"number":60,"text":"Biada tym, którzy nie uwierzyli, z powodu Dnia, który im został obiecany"}]}