{"number":25,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Blagoslovljen neka je Onaj koji objavljuje furkan robu Svom, da bude svjetovima opominjač"},{"number":2,"text":"Onaj čija je vlast nebesa i Zemlje; a nije uzeo djete, niti On ima druga u vlasti. A stvorio je svaku stvar, te joj odmjerio mjeru"},{"number":3,"text":"I uzimaju mimo Njega bogove, ne stvaraju ništa, a oni bivaju stvarani, i ne vladaju za duše svoje štetom niti korišću, i ne vladaju smrću niti životom, a ni proživljenjem"},{"number":4,"text":"I govore oni koji ne vjeruju: \"Ovo je samo laž koju je izmislio, a pomogli su mu u tome drugi ljudi.\" Pa doista donose zulm i potvoru"},{"number":5,"text":"I kažu: \"Priče ranijih, zapisao ih je pa mu se diktiraju jutrom i navečer"},{"number":6,"text":"Reci: \"Objavio ga je Onaj koji zna tajnu na nebesima i Zemlji. Uistinu, On je Oprosnik, Milosrdni"},{"number":7,"text":"I govore: \"Šta je ovom Poslaniku? Jede hranu i hoda po trgovima. Što mu se ne spusti melek, pa da bude s njim opominjač"},{"number":8,"text":"Ili spusti njemu riznica, ili imadne on bašču (da) jede iz nje?\" I govore zalimi: \"Slijedite samo čovjeka opčinjenog"},{"number":9,"text":"Pogledaj kako navode za tebe primjere pa lutaju, te ne mogu (da nađu) put"},{"number":10,"text":"Blagoslovljen neka je Onaj koji će, ako hoće, načiniti tebi bolje od tog: bašče ispod kojih teku rijeke, i načiniti ti palače"},{"number":11,"text":"Naprotiv, poriču Čas, a onom ko poriče Čas, pripremili smo seir"},{"number":12,"text":"Kad ih ugleda iz mjesta dalekog, čuće ga pobješnjelog i pucketavog"},{"number":13,"text":"A kad budu bačeni u tijesno mjesto njegovo povezani, prizivaće tamo propast"},{"number":14,"text":"Ne prizivajte Danas propast jednu, nego prizivajte propast mnogu"},{"number":15,"text":"Reci: \"Da li je to bolje ili Džennet vječnosti koji je obećan bogobojaznima? Bit će za njih plaćom i (konačnim) dolazištem"},{"number":16,"text":"Imaće oni u njemu šta htjednu, vječito.\" Do Gospodara tvog je obećanje traženo"},{"number":17,"text":"A na Dan kad skupi njih i ono šta su obožavali mimo Allaha, pa rekne: \"Jeste li vi zaveli robove Moje ove, ili su oni zalutali s puta"},{"number":18,"text":"Reći će: \"Slavljen neka si Ti! Nije nam priličilo da mimo Tebe uzimamo ikakve zaštitnike, međutim, dao si da uživaju oni i očevi njihovi, dok nisu zaboravili Opomenu i bili narod propalih"},{"number":19,"text":"Tad će vas doista poreći u onom šta ćete govoriti, zato nećete moći (postići) otklon, niti pomoć. A ko od vas učini zulm, daćemo da on iskusi kaznu veliku"},{"number":20,"text":"I nismo poslali prije tebe nijednog od izaslanika, a da nisu uistinu oni jeli hranu i hodali po trgovima. A učinili smo vas jedne drugima iskušenjem. Izdržavate li? A Gospodar tvoj je Onaj koji vidi"},{"number":21,"text":"I govore oni koji se ne nadaju susretu Našem: \"Zašto se ne spuste na nas meleci, ili (ne) vidimo Gospodara svog?\" Doista se uznose u dušama svojim i ohole ohološću velikom"},{"number":22,"text":"Na Dan kad vide meleke, neće Tog dana biti radosne vijesti za prestupnike, a govoriće (meleci): \"Barijera zabranjena"},{"number":23,"text":"I pristupićemo onom šta su uradili od posla pa ga učiniti prašinom raspršenom"},{"number":24,"text":"Stanovnici Dženneta će Tog dana biti boljeg boravišta i ljepšeg odmorišta"},{"number":25,"text":"Na Dan kad se rascijepi nebo oblacima, i meleci spuste (velikim) spuštanjem"},{"number":26,"text":"Vlast će Tog dana istinski biti Milostivog i biće Dan nevjernicima težak"},{"number":27,"text":"I na Dan kad zalim bude grizao ruke svoje, govoriće: \"O da sam ja uzeo s Poslanikom put"},{"number":28,"text":"O teško meni! Da ja nisam uzeo tog i tog prijateljem"},{"number":29,"text":"Doista me je zaveo od Opomene, nakon što mi je došla.\" A šejtan je prema čovjeku dezerter"},{"number":30,"text":"I reći će Poslanik: \"O Gospodaru moj! Uistinu, moj narod je držao ovaj Kur'an napuštenim"},{"number":31,"text":"A tako smo svakom vjerovjesniku načinili neprijatelja između prestupnika. A dovoljan je Gospodar tvoj Vodič i Pomagač"},{"number":32,"text":"A oni koji ne vjeruju, govore: \"Zašto mu se ne objavi cio Kur'an odjednom?\" Tako, da bismo njime osnažili srce tvoje, a učimo ga tertilom"},{"number":33,"text":"I neće ti donijeti primjer, a da ti ne donesemo Istinu i bolje tumačenje"},{"number":34,"text":"Oni koji će biti sabrani na licima svojim Džehennemu: takvi će biti goreg položaja i najodlutaliji s puta"},{"number":35,"text":"I doista smo dali Musau Knjigu i učinili mu uz njega brata njegovog Haruna pomoćnikom"},{"number":36,"text":"Pa rekli: \"Idite narodu onih koji poriču ajete Naše.\" Pa smo ih uništili (potpunim) uništenjem"},{"number":37,"text":"I narod Nuhov - pošto su porekli poslanike - potopili smo ih i učinili ih ljudima znakom. A pripremili smo za zalime kaznu bolnu"},{"number":38,"text":"I Ada i Semuda i stanovnike Ressa i pokoljenja mnoga između toga"},{"number":39,"text":"I svakom tom smo navodili primjere, i svakojeg potpuno razbili"},{"number":40,"text":"A doista prolaze pored grada na koji je izlivena kiša kobna. Pa zar ga ne vide? Naprotiv! Ne nadaju se proživljenju"},{"number":41,"text":"A kad vide te, samo te uzimaju ruglom. \"Je li ovo onaj kojeg je Allah podigao poslanikom"},{"number":42,"text":"Skoro bi nas zaveo od bogova naših da nismo s njima ustrajali.\" A saznaće kad vide kaznu, ko je odlutaliji s puta"},{"number":43,"text":"Jesi li vidio ko je uzeo bogom svojim, strast svoju? Pa zar ti da budeš nad njim čuvar"},{"number":44,"text":"Ili računaš da većina njih čuje ili shvata? Oni su jedino kao stoka - naprotiv, oni su odlutaliji s puta"},{"number":45,"text":"Zar ne vidiš - Gospodar tvoj, kako izdužuje sjenu? A da hoće, sigurno bi je učinio nepomičnom; potom činimo nad njom Sunce pokazivačem"},{"number":46,"text":"Zatim je privlačimo Sebi privlačenjem lagahnim"},{"number":47,"text":"I On je Taj koji čini za vas noć pokrivkom, a san odmorom, i čini dan proživljenjem"},{"number":48,"text":"I On je Taj koji šalje vjetrove radosnom viješću ispred milosti Svoje, i spuštamo s neba vodu čistu"},{"number":49,"text":"Da oživimo njome zamrlu zemlju i napojimo njome onog koga smo stvorili: životinje i ljude mnoge"},{"number":50,"text":"I doista smo to raspodijelili među njima, da bi se poučili, pa odbija većina ljudi - izuzev nevjerstvo"},{"number":51,"text":"A da smo htjeli, sigurno bismo u svakom gradu podigli opominjača"},{"number":52,"text":"Zato ne slušaj nevjernike, i bori se protiv njih njime - džihadom velikim"},{"number":53,"text":"I On je Taj koji je pustio dva mora: ovo pitko, slatko, a ovo slano, gorko; i načinio je između njih dvoje berzeh i prepreku nesavladivu"},{"number":54,"text":"I On je Taj koji je od vode stvorio čovjeka, te mu načinio srodstvo i tazbinstvo. A Gospodar tvoj je Moćni"},{"number":55,"text":"I obožavaju mimo Allaha ono šta im ne koristi, niti im šteti. A nevjernik je protiv Gospodara svog pomagač"},{"number":56,"text":"I poslali smo tebe samo kao donosioca radosnih vijesti i opominjača"},{"number":57,"text":"Reci: \"Ne tražim od vas za njega nikakvu nagradu, izuzev ko hoće da uzme ka Gospodaru svome put"},{"number":58,"text":"I pouzdaj se u Živog, Onog koji ne umire, i slavi sa hvalom Njegovom - a dovoljno je (što je) On o grijesima robova Svojih Obaviješten"},{"number":59,"text":"Onaj koji je stvorio nebesa i Zemlju i šta je između njih, u šest dana, zatim se postavio na Arš. Milostivi! Pa pitaj o Njemu obaviještenog"},{"number":60,"text":"I kad im se kaže: \"Padnite na sedždu Milostivom!\" - govore: \"A šta je Milostivi? Zar da na sedždu padamo što nam naređuješ?\" - i povećava im izbjegavanje"},{"number":61,"text":"Blagoslovljen neka je Onaj koji je načinio u nebu galaksije, i načinio u njemu svjetiljku i Mjesec osvjetljavajućim"},{"number":62,"text":"I On je Taj koji je učinio dan i noć uzastopnim, za onog ko želi da se pouči ili želi zahvalnost"},{"number":63,"text":"A robovi Milostivog, oni koji hodaju po Zemlji ponizno, i kad im se obrate neznalice, kažu: \"Selam"},{"number":64,"text":"I oni koji provode noć pred Gospodarom svojim, čineći sedždu i stojeći"},{"number":65,"text":"I oni koji govore: \"Gospodaru naš! Okreni od nas kaznu Džehennema; uistinu, kazna njegova je stalna"},{"number":66,"text":"Uistinu, on je loše boravište i stanište"},{"number":67,"text":"I oni koji, kad troše, ne rasipaju niti škrtare, i budu između ta (dva) stava"},{"number":68,"text":"I oni koji ne prizivaju uz Allaha boga drugog, niti ubijaju dušu koju je zabranio Allah - izuzev po pravdi - niti bludniče - a ko to čini, srest će kaznu"},{"number":69,"text":"Udvostručiće mu se kazna na Dan kijameta i boravit će u njoj prezren"},{"number":70,"text":"Izuzev ko se pokaje i vjeruje i bude činio djelo dobro; pa takvima će Allah zamijeniti loša djela njihova, dobrim djelima; a Allah je Oprosnik, Milosrdni"},{"number":71,"text":"A ko se pokaje i čini dobro, pa uistinu on se obratio Allahu obraćenjem"},{"number":72,"text":"I oni koji ne svjedoče neistinu, i kad prođu pored besmislice, prođu dostojanstveno"},{"number":73,"text":"I oni koji - kad budu opomenuti znakovima Gospodara svog - ne padaju pred njima gluhi i slijepi"},{"number":74,"text":"I oni koji govore: \"Gospodaru naš! Podari nam od žena naših i potomstva našeg radost očiju, i učini nas za bogobojazne imamima"},{"number":75,"text":"Takvi će biti nagrađeni visokom odajom, što su bili strpljivi, i biće susretani u njoj pozdravom i selamom"},{"number":76,"text":"Vječno će biti u njoj. Divno je boravište i stanište"},{"number":77,"text":"Reci: \"Ne bi na vas obratio pažnju Gospodar moj, da nije dowe vaše.\" Pa doista, porekli ste, zato će biti nužna (kazna)"}]}