{"number":23,"edition":"ug.saleh","ayahs":[{"number":1,"text":"مۆمىنلەر ھەقىقەتەن بەختكە ئېرىشتى"},{"number":2,"text":"(شۇنداق مۆمىنلەركى) ئۇلار نامازلىرىدا (اﷲ نىڭ ئۇلۇغلۇقىدىن سۈر بېسىپ كەتكەنلىكتىن) ئەيمىنىپ تۇرغۇچىلاردۇر"},{"number":3,"text":"ئۇلار بىھۇدە سۆز، بىھۇدە ئىشتىن يىراق بولغۇچىلاردۇر"},{"number":4,"text":"ئۇلار زاكات بەرگۈچىلەردۇر"},{"number":5,"text":"ئۇلار ئەۋرەتلىرىنى (ھارامدىن) ساقلىغۇچىلاردۇر"},{"number":6,"text":"(يەنى ئەۋرەتلىرىنى) پەقەت خوتۇنلىرىدىن، چۆرىلىرىدىن باشقىلاردىن ساقلىغۇچىلاردۇر (بۇلار بىلەن يېقىنچىلىق قىلغۇچىلار مالامەت قىلىنمايدۇ)"},{"number":7,"text":"بۇنىڭ سىرتىدىن (جىنسىي تەلەپنى قاندۇرۇشنى) تەلەپ قىلغۇچىلار ھەددىدىن ئاشقۇچىلاردۇر"},{"number":8,"text":"ئۇلار (يەنى مۆمىنلەر) ئۆزلىرىگە تاپشۇرۇلغان ئامانەتلەرگە ۋە بەرگەن ئەھدىگە رىئايە قىلغۇچىلاردۇر"},{"number":9,"text":"ئۇلار نامازلىرىنى (ۋاقتىدا تەئدىل ئەركان بىلەن) ئادا قىلغۇچىلاردۇر"},{"number":10,"text":"ئەنە شۇلار (يەنى يۇقىرى سۈپەتلەرگە ئىگە مۆمىنلەر نازۇنېمەتلىك جەننەتنىڭ) ۋارىسلىرىدۇر"},{"number":11,"text":"ئۇلار (يۇقىرى دەرىجىلىك جەننەت) فىردەۋسكە ۋارىسلىق قىلىدۇ، فىردەۋستە مەڭگۈ قالىدۇ"},{"number":12,"text":"بىز ئىنساننى ھەقىقەتەن لاينىڭ جەۋھىرىدىن ياراتتۇق"},{"number":13,"text":"ئاندىن ئۇنى بىر پۇختا قارارگاھ (يەنى بەچچىدان) دا (جايلاشقان) ئابىمەنىي قىلدۇق"},{"number":14,"text":"ئاندىن ئابىمەنىينى لەختە قانغا ئايلاندۇردۇق، ئاندىن لەختە قاننى پارچە گۆشكە ئايلاندۇردۇق، ئاندىن پارچە گۆشنى سۆڭەككە ئايلاندۇردۇق، ئاندىن سۆڭەككە گۆش قوندۇردۇق، ئاندىن ئۇنى (جان كىرگۈزۈپ) باشقا مەخلۇققا ئايلاندۇردۇق، ئاڭ ماھىر ياراتقۇچى اﷲ (ھېكمەت ۋە قۇدرەت جەھەتتىن) ئۇلۇغدۇر"},{"number":15,"text":"ئاندىن سىلەر چوقۇم ئۆلۈسىلەر"},{"number":16,"text":"ئاندىن سىلەر ھەقىقەتەن قىيامەت كۈنى (قەبرەڭلاردىن) تۇرغۇزۇلىسىلەر"},{"number":17,"text":"بىز ھەقىقەتەن سىلەرنىڭ ئۈستۈڭلاردا يەتتە قەۋەت ئاسماننى ياراتتۇق، بىز مەخلۇقاتتىن غاپىل ئەمەسمىز"},{"number":18,"text":"بىز بۇلۇتتىن ھاجەتكە قاراپ يامغۇر ياغدۇردۇق، ئۇنى زېمىندا توختاتتۇق، ئۇنى قۇرۇتۇۋېتىشقا ئەلۋەتتە قادىرمىز"},{"number":19,"text":"شۇ يامغۇر بىلەن سىلەرگە خورما باغچىلىرى ۋە ئۈزۈم باغچىلىرىنى يېتىشتۈرۈپ بەردۇق، سىلەر ئۈچۈن ئۇ باغلاردا نۇرغۇن مېۋىلەر بار، ئۇلاردىن يەيسىلەر"},{"number":20,"text":"شۇ يامغۇر بىلەن تۇرسىنادىن چىقىدىغان (زەيتۇن) دەرىخىنى (ئۆستۈرۈپ بەردۇق)، ئۇنىڭدىن ماي چىقىدۇ، يېگۈچىلەر (نانلىرىنى شۇ ماي بىلەن) مايلايدۇ"},{"number":21,"text":"چارۋىلاردا ھەقىقەتەن سىلەرگە ئىبرەت بار، ئۇلارنىڭ قورسىقىدىكى نەرسىلەر (يەنى سۈتلەر) بىلەن سىلەرنى سۇغىرىمىز، ئۇلاردا سىلەر ئۈچۈن نۇرغۇن مەنپەئەتلەر بار، ئۇلارنىڭ گۆشىنى يەيسىلەر"},{"number":22,"text":"ئۇلار (يەنى تۆگە ۋە ئۆكۈزلەر) بىلەن (قۇرۇقلۇقتا)، كېمە بىلەن (دېڭىزدا) يۈك توشۇيسىلەر"},{"number":23,"text":"بىز ھەقىقەتەن نۇھنى قەۋمىگە پەيغەمبەر قىلىپ ئەۋەتتۇق، نۇھ ئېيتتى: «ئى قەۋمىم! (يالغۇز اﷲ قا ئىبادەت قىلىڭلار، سىلەرگە ئۇنىڭدىن باشقا ھېچ مەبۇد (بەرھەق) يوق، اﷲ نىڭ ئازابىدىن) قورقمامسىلەر؟»"},{"number":24,"text":"ئۇنىڭ قەۋمىدىكى ئىمانسىز كاتتىلار ئېيتتى: «بۇ پەقەت سىلەرگە ئوخشاش بىر ئىنساندۇر، ئۇ سىلەردىن ئۈستۈن بولۇۋالماقچى، ئەگەر اﷲ (پەيغەمبەر ئەۋەتىشنى) خالىسا ئىدى، ئەلۋەتتە، پەرىشتىلەرنى ئەۋەتتى، بۇنداق سۆزنى بۇرۇنقى ئاتا - بوۋىلىرىمىزدىن ئاڭلىغان ئەمەسمىز"},{"number":25,"text":"ئۇ پەقەت بىر مەجنۇندۇر، سىلەر ئۇنى بىر مەزگىل كۈتۈڭلار»"},{"number":26,"text":"نۇھ (ئۇلارنىڭ ئىمان ئېيتىشىدىن ئۈمىدىنى ئۈزگەندىن كېيىن): «پەرۋەردىگارىم! ئۇلار مېنى يالغانغا چىقارغانلىقلىرى ئۈچۈن ماڭا ياردەم بەرگىن» دېدى"},{"number":27,"text":"بىز نۇھقا: «بىزنىڭ كۆز ئالدىمىزدا ۋەھيىمىز بويىچە كېمە ياسىغىن، بىزنىڭ بۇيرۇقىمىز يېتىپ كەلگەن ۋە تونۇردىن سۇ ئېتىلىپ چىققان چاغدا، ھايۋانلاردىن (ئەركەك - چىشى بولۇپ) بىر جۈپتىن ئېلىۋالغىن، ئائىلەڭدىكىلەرنىمۇ ئېلىۋالغىن، ئۇلارنىڭ ئىچىدىكى ھالاك بولۇشقا ھۆكۈم قىلىنغانلار بۇنىڭدىن مۇستەسنا. (ئۆزلىرىگە) زۇلۇم قىلغانلار توغرىسىدا ماڭا سۆز ئاچمىغىن (يەنى ئۇلارغا شاپائەت قىلمىغىن)، ئۇلار چوقۇم (توپان بالاسىدا) غەرق قىلىنىدۇ» دەپ ۋەھيى قىلدۇق"},{"number":28,"text":"سەن بىلەن بىللە بولغان مۆمىنلەر بىلەن كېمىگە چىققان چېغىڭدا: «جىمى ھەمدۇسانا بىزنى زالىم قەۋمدىن قۇتقۇزغان اﷲ قا خاستۇر» دېگىن"},{"number":29,"text":"ھەمدە: «ئى پەرۋەردىگارىم! مېنى مۇبارەك مەنزىلگە چۈشۈرگىن، سەن (دوستلىرىڭنى) ئەڭ ياخشى ئورۇنلاشتۇرغۇچىسەن» دېگىن"},{"number":30,"text":"ھەقىقەتەن بۇنىڭدا (يەنى نۇھنىڭ ئۈممىتىنىڭ ئىشلىرىدا ئەقىل ئىگىلىرى ئۈچۈن) نۇرغۇن ئىبرەتلەر بار، بىز بەندىلەرنى (پەيغەمبەرلەرنى ئەۋەتىش بىلەن) ئەلۋەتتە سىنايمىز"},{"number":31,"text":"ئۇلارنى ھالاك قىلغاندىن كېيىن باشقا بىر قەۋم پەيدا قىلدۇق"},{"number":32,"text":"بىز ئۇلارغا ئۆزلىرىنىڭ ئىچىدىن بىر پەيغەمبەرنى (يەنى ھۇدنى) ئەۋەتتۇق. (ئۇ ئېيتتى) اﷲ غىلا ئىبادەت قىلىڭلار، سىلەرگە ئۇنىڭدىن باشقا ھېچ مەبۇد (بەرھەق) يوقتۇر ئاللانىڭ (ئازابىدىن) قورقمامسىلەر؟"},{"number":33,"text":"ئۇنىڭ قەۋمىنىڭ كاپىر بولغان، ئاخىرەت مۇكاپاتىنى يالغان چىقارغان ۋە بۇ دۇنيادا بىز تەرەپتىن باياشات تۇرمۇشقا ئىگە قىلىنغان كاتتىلىرى ئېيتتى: «بۇ پەقەت سىلەرگە ئوخشاش بىر ئىنساندۇر، ئۇ سىلەر يېگەننى يەيدۇ، سىلەر ئىچكەننى ئىچىدۇ"},{"number":34,"text":"ئەگەر سىلەر ئۆزۈڭلارغا ئوخشاش بىر ئىنسانغا ئىتائەت قىلساڭلار، شۈبھىسىزكى، ئۇ چاغدا سىلەر چوقۇم زىيان تارتقۇچىلارسىلەر"},{"number":35,"text":"ئۇ سىلەرنى سىلەر ئۆلۈپ توپىغا ۋە قۇرۇق ئۇستىخانغا ئايلانغاندىن كېيىن تىرىلىسىلەر دەپ ئاگاھلاندۇرامدۇ؟"},{"number":36,"text":"سىلەرگە ئاگاھلاندۇرۇلغان ئىش تولىمۇ يىراقتۇر"},{"number":37,"text":"بىزنىڭ مۇشۇ دۇنيادىكى ھاياتىمىزدىن باشقا ھايات يوقتۇر، بىز ئۆلىمىز ۋە تىرىلىمىز (يەنى بىر تەرەپتىن ئۆلۈپ تۇرىمىز ۋە بىر تەرەپتىن تۇغۇلۇپ تۇرىمىز)، بىز قايتا تىرىلمەيمىز"},{"number":38,"text":"ئۇ پەقەت اﷲ نامىدىن يالغاننى توقۇغان ئادەملەردۇر، بىز ئۇنىڭغا ئىشەنمەيمىز»"},{"number":39,"text":"ھۇد ئېيتتى: «پەرۋەردىگارىم! ئۇلار مېنى يالغانغا چىقارغانلىقلىرى ئۈچۈن ماڭا ياردەم بەرگىن»"},{"number":40,"text":"اﷲ ئېيتتى: «ئۇلار ئۇزۇنغا قالماي (كاپىر بولغانلىقلىرىغا) نادامەت چېكىدۇ»"},{"number":41,"text":"(ئۇلار ھەقلىق رەۋىشتە قاتتىق ئاۋاز بىلەن ھالاك بولدى. ئۇلارنى بىز لۆجە قىلىۋەتتۇق، زالىم قەۋم اﷲ نىڭ رەھمىتىدىن) يىراق بولسۇن"},{"number":42,"text":"ئۇلارنى ھالاك قىلغاندىن كېيىن، باشقا بىر قەۋملەرنى پەيدا قىلدۇق"},{"number":43,"text":"ھەر قانداق ئۈممەت ھالاك بولۇش ۋاقتى كەلمەي تۇرۇپ ھالاك بولمايدۇ، ھالاك بولۇش ۋاقتىدىن ئۆتۈپمۇ كەتمەيدۇ"},{"number":44,"text":"ئاندىن بىزنىڭ پەيغەمبەرلىرىمىزنى ئارقىمۇ ئارقا ئەۋەتتۇق، ھەر ئۈممەتكە ئۇنىڭ پەيغەمبىرى كەلگەن چاغدا، ئۇلار ئۇنى ئىنكار قىلغانلىقتىن، ئۇلارنى ئارقىمۇ ئارقا ھالاك قىلدۇق، ئۇلارنى (كىشىلەرگە) ھېكايە قىلىپ قالدۇردۇق، ئىمان ئېيتمايدىغان قەۋم اﷲ نىڭ رەھمىتىدىن) يىراق بولسۇن"},{"number":45,"text":"ئاندىن مۇسا ۋە ئۇنىڭ قېرىندىشى ھارۇننى بىزنىڭ ئايەتلىرىمىز بىلەن ۋە روشەن پاكىت بىلەن پىرئەۋنگە ۋە ئۇنىڭ قەۋمىنىڭ چوڭلىرىغا (پەيغەمبەر قىلىپ) ئەۋەتتۇق، ئۇلار ھاكاۋۇرلۇق قىلىپ (ئىماندىن) باش تارتتى، ئۇلارمۇ تەكەببۇر قەۋم ئىدى"},{"number":46,"text":"ئاندىن مۇسا ۋە ئۇنىڭ قېرىندىشى ھارۇننى بىزنىڭ ئايەتلىرىمىز بىلەن ۋە روشەن پاكىت بىلەن پىرئەۋنگە ۋە ئۇنىڭ قەۋمىنىڭ چوڭلىرىغا (پەيغەمبەر قىلىپ) ئەۋەتتۇق، ئۇلار ھاكاۋۇرلۇق قىلىپ (ئىماندىن) باش تارتتى، ئۇلارمۇ تەكەببۇر قەۋم ئىدى"},{"number":47,"text":"ئۇلار: «بىزگە ئوخشاش ئىككى ئاددى ئىنسانغا ئىمان ئېيتامدۇق، ھالبۇكى، ئۇلارنىڭ قەۋمى بىزنىڭ (قۇلغا ئوخشاش) خىزمەتچىلىرىمىزدۇر» دېيىشتى"},{"number":48,"text":"ئۇلار بۇ ئىككىسىنى (يەنى مۇسا بىلەن ھارۇننى) ئىنكار قىلىشتى. شۇنىڭ بىلەن ئۇلار ھالاك بولدى"},{"number":49,"text":"ئۇلار (يەنى بەنى ئىسرائىل) نى ھىدايەت تاپسۇن دەپ، بىز ھەقىقەتەن مۇساغا كىتاب (يەنى تەۋراتنى) ئاتا قىلدۇق"},{"number":50,"text":"بىز مەريەمنىڭ ئوغلىنى (يەنى ئىسانى) ۋە ئۇنىڭ ئانىسىنى (يەنى مەريەمنى) (كامال قۇدرىتىمىزنىڭ) دەلىلى قىلدۇق، ئۇلارنى تۈپتۈز، ئېقىن سۇلۇق بىر ئېگىز جايغا ئورۇنلاشتۇردۇق"},{"number":51,"text":"ئى پەيغەمبەرلەر! ھالال نەرسىلەرنى يەڭلار، ياخشى ئەمەللەرنى قىلىڭلار، مەن ھەقىقەتەن سىلەرنىڭ قىلغان ئەمەللىرىڭلارنى ئوبدان بىلىمەن"},{"number":52,"text":"(ئى پەيغەمبەرلەر جامائەسى!) سىلەرنىڭ دىنىڭلار ھەقىقەتەن بىر دىندۇر، مەن سىلەرنىڭ پەرۋەردىگارىڭلاردۇرمەن، (مېنىڭ ئازابىمدىن) قورقۇڭلار"},{"number":53,"text":"ئۇلار (يەنى ئۈممەتلەر) دىنىي جەھەتتە نۇرغۇن پىرقىلەرگە بۆلۈندى، ھەر پىرقە ئۆز دىنى بىلەن خۇشالدۇر"},{"number":54,"text":"ئۇلارنى ئۆلگەنلىرىگە قەدەر گۇمراھلىقتا تەرك ئەتكىن"},{"number":55,"text":"(ئۇلار) بىزنىڭ ئۇلارغا مال - مۈلۈك ۋە ئەۋلادلارنى بەرگەنلىكىمىزنى ئۆزلىرىگە تېز ياخشىلىق قىلغانلىق دەپ ئويلامدۇ؟ ھەرگىز ئۇنداق ئەمەس، ئۇلار ئۇقمايدۇ"},{"number":56,"text":"(ئۇلار) بىزنىڭ ئۇلارغا مال - مۈلۈك ۋە ئەۋلادلارنى بەرگەنلىكىمىزنى ئۆزلىرىگە تېز ياخشىلىق قىلغانلىق دەپ ئويلامدۇ؟ ھەرگىز ئۇنداق ئەمەس، ئۇلار ئۇقمايدۇ"},{"number":57,"text":"ھەقىقەتەن پەرۋەردىگارىنىڭ ھەيۋىسىدىن قورققۇچى كىشىلەر،"},{"number":58,"text":"پەرۋەردىگارىنىڭ ئايەتلىرىگە ئىشەنگۈچى كىشىلەر،"},{"number":59,"text":"پەرۋەردىگارىغا شېرىك كەلتۈرمەيدىغان كىشىلەر،"},{"number":60,"text":"سەدىقە بېرىدىغان ئەمما پەرۋەردىگارىنىڭ دەرگاھىغا (ھېساب بېرىش ئۈچۈن) قايتىپ بارىدىغانلىقىدىن دىللىرى قورقۇپ تۇرىدىغان كىشىلەر"},{"number":61,"text":"ئەنە شۇلار ياخشى ئىشلارنى (باشقىلارنىڭ) ئالدىدا قىلىشقا تىرىشقۇچىلاردۇر"},{"number":62,"text":"بىز ئىنساننى پەقەت تاقىتى يېتىدىغان (ئىش) قىلا تەكلىپ قىلىمىز، بىزنىڭ دەرگاھىمىزدا ھەقنى سۆزلەيدىغان كىتاب (يەنى بەندىلەرنىڭ ياخشى - يامان ئىشلىرى خاتىرىلەنگەن نامە - ئەمال بار، ئۇلارغا (ساۋابىنى كېمەيتىۋېتىش ياكى ئازابنى ئاشۇرۇۋېتىش بىلەن) قىلچە زۇلۇم قىلىنمايدۇ"},{"number":63,"text":"ئۇلار (يەنى گۇناھكار كۇففارلار) نىڭ دىللىرى بۇنىڭدىن (يەنى قۇرئاندىن) غەپلەتتىدۇر، ئۇنىڭدىن يەنى كۇفرىدىن) باشقا ئۇلار كېلەچەكتە نۇرغۇن (يامان) ئىشلارنى قىلىدۇ"},{"number":64,"text":"ئۇلارنىڭ بايلىرىنى ئازاب بىلەن جازالىغان ۋاقتىمىزدا ناگاھ ئۇلار پەرياد قىلىدۇ"},{"number":65,"text":"(ئۇلارغا ئېيتىلىدۇ) «بۈگۈن پەرياد قىلماڭلار، ھەقىقەتەن سىلەر بىزنىڭ ياردىمىمىزگە ئېرىشەلمەيسىلەر»"},{"number":66,"text":"مېنىڭ ئايەتلىرىم سىلەرگە ئوقۇپ بېرىلەتتى، (ئۇنى ئاڭلاشتىن يۈز ئۆرۈپ) ئارقاڭلارغا چېكىنىۋالاتتىڭلار"},{"number":67,"text":"ئۇلار ھەرەم ئەھلى بولغانلىقى بىلەن پەخىرلىنىپ ئىماندىن يۈز ئۆرۈيدۇ، كەچلىك پاراڭلىرىدا يامان سۆزلەرنى قىلىدۇ، (يەنى قۇرئانغا تەنە قىلىدۇ، پەيغەمبەر ئەلەيھىسسالامنى سۆكىدۇ)"},{"number":68,"text":"ئۇلار (ھەق) كالام (يەنى ئۇلۇغ قۇرئان) ئۈستىدە چوڭقۇر پىكىر قىلمىدىمۇ؟ ياكى ئۇلارغا (اﷲ تەرىپىدىن) ئاتا - بوۋىلىرىغا كەلمىگەن (يېڭى) نەرسە كەلدىمۇ؟"},{"number":69,"text":"ياكى ئۇلار ئۆزلىرىگە كەلگەن ئەلچىنى تونۇماي ئۇنى ئىنكار قىلىۋاتامدۇ"},{"number":70,"text":"ياكى ئۇلار ئۇنى مەجنۇن دېيىشەمدۇ؟ ھەرگىز ئۇنداق ئەمەس، ئۇلارغا ئۇ ھەقىقەتنى ئېلىپ كەلدى. ئۇلارنىڭ تولىسى ھەقىقەتنى يامان كۆرىدۇ"},{"number":71,"text":"ئەگەر ھەقىقەت (يەنى قۇرئان) ئۇلارنىڭ نەپسى خاھىشلىرىغا بويسۇنىدىغان بولسا، ئەلۋەتتە ئاسمانلار، زېمىن ۋە ئۇلاردىكى مەخلۇقاتلار خاراب بولغان بولاتتى، ئۇنداق بولغىنى يوق، ئۇلارغا (ۋەز - نەسىھەتنى ئۆز ئىچىگە ئالغان) قۇرئاننى ئاتا قىلدۇق، ئۇلار ئۆزلىرىگە (ۋەز - نەسىھەت بولغان) قۇرئاندىن يۈز ئۆرۈيدۇ"},{"number":72,"text":"ياكى سەن ئۇلاردىن (ئەلچىلىكنى يەتكۈزگەنلىكىڭگە) ھەق تەلەپ قىلامسەن؟ (يەنى ئۇلار شۇنداق گۇمان قىلامدۇ؟) پەرۋەردىگارىڭنىڭ (ساڭا بەرگەن) ئەجرى ياخشىدۇر، اﷲ رىزىق بەرگۈچىلەرنىڭ ياخشىسىدۇر"},{"number":73,"text":"سەن ئەلۋەتتە ئۇلارنى توغرا يولغا دەۋەت قىلىسەن"},{"number":74,"text":"ئاخىرەتكە ئىشەنمەيدىغانلار ھەقىقەتەن توغرا يولدىن چەتنىگۈچىلەردۇر"},{"number":75,"text":"ئەگەر ئۇلار (يەنى مۇشرىكلار) غا رەھىم قىلساق، ئۇلارغا كەلگەن كۈلپەتنى كۆتۈرۈۋەتسەك، چوقۇم گۇمراھلىقلىرىدا داۋاملىق تېڭىرقاپ يۈرۈشەتتى"},{"number":76,"text":"ئۇلارنى بىز ھەقىقەتەن ئازاب (يەنى قەھەتچىلىك) بىلەن جازالىدۇق، ئۇلار پەرۋەردىگارىغا بويسۇنمىدى، ئىلتىجا قىلىپ دۇئامۇ قىلمىدى"},{"number":77,"text":"تاكى ئۇلارغا قاتتىق ئازابنىڭ دەرۋازىسىنى ئاچقان چېغىمىزدا ناگاھان ئۇلار ئۈمىدسىزلىنىپ كېتىدۇ"},{"number":78,"text":"اﷲ سىلەر ئۈچۈن قۇلاقلارنى، كۆزلەرنى ۋە دىللارنى ياراتتى، سىلەر ناھايىتى ئاز شۈكۈر قىلىسىلەر"},{"number":79,"text":"اﷲ سىلەرنى زېمىندا (نەسىللەندۈرۈش يولى بىلەن) ياراتتى، (ھېساب بېرىش ئۈچۈن) ئۇنىڭ دەرگاھىغا يىغىلىسىلەر"},{"number":80,"text":"اﷲ (ئۆلۈكنى) تىرىلدۈرىدۇ، (تىرىكنىڭ) جېنىنى ئالىدۇ، كېچە - كۈندۈزنىڭ ئۆزگىرىپ تۇرۇشى اﷲ نىڭ باشقۇرۇشىدىدۇر، چۈشەنمەمسىلەر؟"},{"number":81,"text":"(ئۇلار اﷲ نىڭ قۇدرىتىنى ئويلاپ كۆرمىدى) بەلكى ئۇلار بۇرۇنقىلار نېمىدېگەن بولسا شۇنى دېدى"},{"number":82,"text":"ئۇلار ئېيتتى: «بىز ئۆلۈپ توپىغا ۋە (ئۇۋۇلۇپ كەتكەن) سۆڭەككە ئايلانغاندىن كېيىن، چوقۇم قايتا تىرىلەمدۇق؟"},{"number":83,"text":"ھەقىقەتەن بىز ۋە بىزنىڭ ئاتا - بوۋىلىرىمىز ئىلگىرى مۇشۇنداق ئاگاھلاندۇرۇلغان ئىدۇق، بۇ پەقەت قەدىمكىلەردىن قالغان ئەپسانىلاردۇر»"},{"number":84,"text":"ئېيىتقىنكى، «زېمىن ۋە ئۇنىڭدىكى مەخلۇقاتلار كىمنىڭ؟ ئەگەر سىلەر بىلسەڭلار (ماڭا بۇنى ئېيتىپ بېرىڭلار)»"},{"number":85,"text":"ئۇلار: «اﷲ نىڭ» دەيدۇ. (بۇنىڭدىن) پەند - نەسىھەت ئالمامسىلەر؟"},{"number":86,"text":"ئېيىتقىنكى، «يەتتە ئاسماننىڭ ۋە ئۇلۇغ ئەرشنىڭ پەرۋەردىگارى كىم؟»"},{"number":87,"text":"ئۇلار «اﷲ» دەيدۇ. ئېيىتقىنكى، «ئۇنىڭ (ئازابىدىن) قورقمامسىلەر؟»"},{"number":88,"text":"ئېيىتقىنكى، «ھەممە شەيئىنىڭ پادىشاھلىقى كىمنىڭ قولىدا؟ (ئىلتىجا قىلغانلارغا) پاناھ بولالايدىغان ۋە ئۇنىڭغا قارشى ھېچ نەرسە پاناھ بولالمايدىغان كىم؟ ئەگەر سىلەر بىلسەڭلار (ماڭا بۇنى ئېيتىپ بېرىڭلار)»"},{"number":89,"text":"ئۇلار: «اﷲ» دەيدۇ. ئېيىتقىنكى، «سىلەر قانداقمۇ قايمۇقتۇرۇلىسىلەر؟»"},{"number":90,"text":"ئۇنداق ئەمەس، ئۇلارغا بىز ھەق سۆزنى ئېلىپ كەلدۇق، ئۇلار چوقۇم يالغانچىلاردۇر"},{"number":91,"text":"اﷲ نىڭ بالىسى يوق، ئۇنىڭغا باراۋەر باشقا بىر ئىلاھمۇ يوق، ئەگەر بۇنداق بولسا ئىدى، ئۇ چاغدا ھەر ئىلاھ ئۆزى ياراتقان مەخلۇقنى يالغۇز ئىگىلەيتتى، بەزىسى بەزىسىدىن غالىب كېلەتتى، اﷲ ئۇلارنىڭ اﷲ قا نىسبەت بەرگەن نەرسىلىرىدىن پاكتۇر"},{"number":92,"text":"اﷲ غەيبنى ۋە ئاشكارىنى بىلگۈچىدۇر، مۇشرىكلارنىڭ شېرىك كەلتۈرگەن نەرسىلىرىدىن ئۈستۈندۇر"},{"number":93,"text":"ئېيتقىنكى، «پەرۋەردىگارىم! ئەگەر ماڭا ئۇلارغا (دۇنيادا) ۋەدە قىلغان ئازابنى كۆرسىتىدىغان بولساڭ"},{"number":94,"text":"ئېيتقىنكى: «پەرۋەردىگارىم! مېنى زالىم قەۋملەر ئىچىدە قىلمىغىن»"},{"number":95,"text":"بىز ئۇلارغا ۋەدە قىلغان ئازابنى ساڭا كۆرسىتىشكە ئەلۋەتتە قادىرمىز"},{"number":96,"text":"(ئۇلارنىڭ قىلغان) يامانلىقىغا (ئەپۇ قىلىش بىلەن) ياخشىلىق قىلغىن، ئۇلارنىڭ (سېنى) سۈپەتلەشلىرىنى (يەنى ئۇلارنىڭ ساڭا قىلغان مەسخىرىسىنى) بىز ئوبدان بىلىمىز"},{"number":97,"text":"ئېيتقىنكى، «پەرۋەردىگارىم! ساڭا سېغىنىپ شەيتانلارنىڭ ۋەسۋەسىلىرىدىن پاناھ تىلەيمەن"},{"number":98,"text":"پەرۋەردىگارىم! ساڭا سېغىنىپ شەيتانلارنىڭ ماڭا ھەمراھ بولۇشىدىن پاناھ تىلەيمەن»"},{"number":99,"text":"ئۇلارنىڭ (يەنى كاپىرلارنىڭ) بىرىگە ئۆلۈم كەلسە ئېيتىدۇركى، «پەرۋەردىگارىم! مېنى (دۇنياغا) قايتۇرغىن"},{"number":100,"text":"مەن قويۇپ كەلگەن مال - مۈلكۈم بىلەن ياخشىلىق قىلىشىم مۇمكىن». (ئۇنىڭ دۇنياغا قايتىشى) مۇمكىن ئەمەس، ئۇ چوقۇم شۇ سۆزنى قىلغۇچىدۇر، ئۇلار قەبرىلىرىدىن تۇرغۇزۇلغان كۈنگە قەدەر ئۇلارنىڭ ئالدىدا (ئۇلارنى دۇنياغا قايتىشتىن توسىدىغان) بىر توسما بولىدۇ"},{"number":101,"text":"سۇر چېلىنغان كۈندە ئۇلارنىڭ ئارىسىدىكى تۇغقانچىلىق مەۋجۇت بولماي قالىدۇ. بىر - بىرىنىڭ (ئەھۋالىنىمۇ) سوراشمايدۇ"},{"number":102,"text":"تارازىسى ئېغىر كەلگەنلەر (يەنى ياخشىلىقلىرى يامانلىقلىرىنى بېسىپ كەتكەنلەر) بەختكە ئېرىشكۈچىلەردۇر"},{"number":103,"text":"تارازىسى يېنىك كەلگەنلەر (يەنى يامانلىقلىرى ياخشىلىقلىرىنى بېسىپ كەتكەنلەر) زىيان تارتقۇچىلاردۇر، جەھەننەمدە مەڭگۈ قالغۇچىلاردۇر"},{"number":104,"text":"ئۇلارنىڭ يۈزلىرىنى ئوت كۆيدۈرىدۇ، كالپۇكلىرى قورۇلۇپ، چىشلىرى ئېچىلىپ (بەت چىراي) بولۇپ قالىدۇ"},{"number":105,"text":"(ئۇلارغا) «سىلەرگە (دۇنيادا) مېنىڭ ئايەتلىرىم ئوقۇپ بېرىلگەن، سىلەر ئۇنى (شۇنچە روشەن تۇرۇقلۇق) ئىنكار قىلغان ئەمەسمىدىڭلار» دېيىلىدۇ"},{"number":106,"text":"ئۇلار ئېيتىدۇ: «پەرۋەردىگارىمىز! بەتبەختلىكىمىز ئۈستىمىزدىن غالىب كېلىپ گۇمراھ قەۋم بولۇپ قالغان ئىدۇق"},{"number":107,"text":"پەرۋەردىگارىمىز! بىزنى دوزاختىن چىقارغىن (ئاندىن دۇنياغا قايتۇرغىن)، ئەگەر بىز (شۇنىڭدىن كېيىن) يەنە گۇناھ قىلساق، بىز ھەقىقەتەن زالىم بولۇپ قالىمىز»"},{"number":108,"text":"اﷲ ئېيتىدۇ: «جەھەننەمدە خار ھالدا قىلىڭلار، (ئۈستۈڭلاردىن ئازابنىڭ كۆتۈرۈلۈپ كېتىشى ھەققىدە) ماڭا سۆز ئاچماڭلار»"},{"number":109,"text":"شۈبھىسىزكى، بەندىلىرىمدىن بىر تۈركۈم كىشىلەر: «پەرۋەردىگارىمىز! بىز ئىمان ئېيتتۇق، بىزگە مەغپىرەت قىلغىن، بىزگە رەھىم قىلغىن، سەن بولساڭ ئەڭ رەھىم قىلغۇچىسەن» دەيتتى"},{"number":110,"text":"ئۇلارنى مەسخىرە قىلدىڭلار، ھەتتا ئۇلار سىلەرگە مېنىڭ زىكرىمنى ئۇنتۇلدۇردى (يەنى ئۇلارنى مەسخىرە قىلىش بىلەن بولۇپ كېتىپ ماڭا ئىتائەت قىلىشنى ئۇنتۇدۇڭلار)، سىلەر ئۇلاردىن كۈلەتتىڭلار"},{"number":111,"text":"(سىلەردىن يەتكەن ئەرزىيەتلەرگە) سەۋر قىلغانلىقلىرى ئۈچۈن، مەن ئۇلارنى بۈگۈن مۇكاپاتلىدىم، ئۇلار ھەقىقەتەن مەقسەتكە ئېرىشكۇچىلەردۇر"},{"number":112,"text":"اﷲ (ئۇلارغا): «زېمىندا قانچىلىك تۇردۇڭلار؟» دەيدۇ"},{"number":113,"text":"ئۇلار: «بىر كۈن ياكى بىر كۈندىنمۇ ئاز تۇردۇق، (ئاي - كۈنلەرنى) ھېسابلىغۇچى (پەرىشتە) دىن سورىغىن» دەيدۇ (ئۇلار دوزاختا چېكىۋاتقان ئازاب تۈپەيلىدىن، زېمىندا قانچىلىك تۇرغانلىقىنى ئۇنتۇيدۇ)"},{"number":114,"text":"اﷲ: «ئەگەر سىلەر بىلسەڭلار (دۇنيادا) پەقەت ئازغىنا تۇردۇڭلار» دەيدۇ"},{"number":115,"text":"ئى ئىنسانلار! بىزنى سىلەر ئۆزۈڭلارنى بىكار ياراتتى (يەنى سىلەر بىزنى ھايۋاناتلارنى ياراتقىنىمىزدەك ھېچقانداق ساۋابمۇ بەرمەيدىغان، جازامۇ بەرمەيدىغان قىلىپ ياراتتى). ئۆزۈڭلارنى بىزنىڭ دەرگاھىمىزغا قايتۇرۇلمايدۇ دەپ ئويلامسىلەر؟"},{"number":116,"text":"ھەق - پادىشاھ اﷲ ئۈستۈندۇر، ئۇنىڭدىن باشقا ھېچ ئىلاھ يوقتۇر، اﷲ ئۇلۇغ ئەرشنىڭ پەرۋەردىگارىدۇر"},{"number":117,"text":"كىمكى ھېچقانداق دەلىلى بولمىغان ھالدا اﷲ قا قوشۇپ يەنە بىر مەبۇدقا ئىبادەت قىلىدىكەن، پەرۋەردىگارىنىڭ دەرگاھىدا ھېساب بېرىدۇ، كاپىرلار ھەقىقەتەن نىجات تاپمايدۇ"},{"number":118,"text":"«پەرۋەردىگارىم! مەغپىرەت قىلغىن، رەھىم قىلغىن، سەن رەھىم قىلغۇچىلارنىڭ ياخشىسىسەن» دېگىن"}]}