{"number":26,"edition":"ug.saleh","ayahs":[{"number":1,"text":"طا، سىم، مىم"},{"number":2,"text":"بۇ، روشەن كىتاب (يەنى قۇرئان) ئايەتلىرىدۇر"},{"number":3,"text":"(ئى مۇھەممەد!) ئۇلارنىڭ ئىمان ئېيتمىغانلىقىدىن ئۆزۈڭنى ھالاك قىلىۋېتىشىڭ مۇمكىن"},{"number":4,"text":"ئەگەر بىز ئۇلارنىڭ (ئىمان ئېيتىشىنى) خالايدىغان بولساق، ئۇلارغا ئاسماندىن (ئۇلارنى ئىمانغا مەجبۇرلايدىغان) بىر ئايەتنى (ئالامەتنى) نازىل قىلاتتۇقتە، ئۇنىڭغا ئۇلار باش ئەگكەن بولاتتى"},{"number":5,"text":"ئۇلارغا مەرھەمەتلىك اﷲ تەرىپىدىن قۇرئاندىن يېڭىدىن بىرنەرسە نازىل بولسىلا، ئۇلار ئۇنىڭدىن يۈز ئۆرۈيدۇ"},{"number":6,"text":"ئۇلار راستلا (قۇرئاننى) ئىنكار قىلدى، مەسخىرە قىلغان نەرسىنىڭ خەۋەرلىرى (يەنى ئاقىۋىتى) ئۇلارغا كېلىدۇ"},{"number":7,"text":"ئۇلار زېمىننى (يەنى زېمىننىڭ ئاجايىباتلىرىنى) كۈزەتمىدىمۇ؟ زېمىندا تۈرلۈك پايدىلىق ئۆسۈملۈكلەرنى ئۆستۈردۇق"},{"number":8,"text":"بۇنىڭدا ئەلۋەتتە (اﷲ نىڭ قۇدرىتىنى كۆرسىتىدىغان) ئالامەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":9,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":10,"text":"ئۆز ۋاقتىدا پەرۋەردىگارىڭ مۇساغا نىدا قىلدى: «سەن زالىم قەۋمگە بارغىن"},{"number":11,"text":"(ئۇلار) پىرئەۋننىڭ قەۋمىدۇر، ئۇلار (اﷲ نىڭ جازالىشىدىن) قورقمامدۇ؟»"},{"number":12,"text":"مۇسا ئېيتتى: «پەرۋەردىگارىم! مەن ھەقىقەتەن ئۇلارنىڭ مېنى ئىنكار قىلىشىدىن قورقىمەن"},{"number":13,"text":"(ئۇلارنىڭ مېنى ئىنكار قىلىشىدىن) يۈرىكىم سىقىلىدۇ، تىلىم كېكەچ، شۇڭا (ماڭا ياردەمدە بولۇش ئۈچۈن) ھارۇننى (پەيغەمبەر) قىلىپ ئەۋەتكىن"},{"number":14,"text":"(ئۇلارنىڭ دەۋاسىچە) ئۇلارنىڭ ئالدىدا مېنىڭ گۇناھىم بار، ئۇلارنىڭ مېنى ئۆلتۈرۈشىدىن قورقىمەن»"},{"number":15,"text":"اﷲ ئېيتتى: «ھەرگىز ئۇنداق ئەمەس (يەنى سېنى ئۇلار ھەرگىز ئۆلتۈرەلمەيدۇ)، سىلەر مېنىڭ مۆجىزىلىرىمنى ئېلىپ بېرىڭلار، بىز ھەقىقەتەن سىلەر بىلەن بىللە (مۇنازىرەڭلارنى) ئاڭلاپ تۇرىمىز"},{"number":16,"text":"سىلەر پىرئەۋنگە بېرىپ: بىز ھەقىقەتەن ئالەملەرنىڭ پەرۋەردىگارىنىڭ ئەلچىسىمىز"},{"number":17,"text":"ئىسرائىل ئەۋلادىنى (قۇللۇقۇڭدىن) بوشاتقىن، ئۇلار بىز بىلەن (شامغا) كەتسۇن دەڭلار»"},{"number":18,"text":"(ئۇلار پىرئەۋنگە كېلىپ ئەلچىلىكنى يەتكۈزدى) پىرئەۋن (مۇساغا) ئېيتتى: «سېنى بىز ئۆيىمىزدە كىچىكىڭدىن تەربىيلەپ چوڭ قىلمىدۇقمۇ؟ ئارىمىزدا كۆپ يىللار تۇرمىدىڭمۇ؟"},{"number":19,"text":"سەن ھېلىقى قىلغان ئىشىڭنى قىلمىدىڭمۇ؟ (يەنى قىبتىنى ئۆلتۈرمىدىڭمۇ؟) سەن تۇزكورلاردىنسەن»"},{"number":20,"text":"مۇسا ئېيتتى: «مەن ئۇ ئىشنى قىلغان چېغىمدا نادانلاردىن ئىدىم"},{"number":21,"text":"سىلەردىن قورقۇپ، سىلەردىن قاچتىم، پەرۋەردىگارىم ماڭا ھېكمەت ئاتا قىلدى، مېنى پەيغەمبەر قىلدى"},{"number":22,"text":"سەن ئىسرائىل ئەۋلادىنى قۇل قىلدىڭ، سېنىڭ ماڭا مىننەت قىلغان نېمىتىڭ ئەنە شۇدۇر»"},{"number":23,"text":"پىرئەۋن ئېيتتى: «ئالەملەرنىڭ پەرۋەردىگارى دېگەن نېمە؟»"},{"number":24,"text":"مۇسا ئېيتتى: «ئۇ ئاسمانلارنىڭ، زېمىننىڭ ۋە ئۇلارنىڭ ئارىسىدىكى پۈتۈن مەخلۇقاتلارنىڭ پەرۋەردىگارىدۇر. ئەگەر سىلەر ھەقىقىي ئىشىنىدىغان بولساڭلار»"},{"number":25,"text":"پىرئەۋن چۆرىسىدىكىلەرگە: «(ئۇنىڭ جاۋابىنى) ئاڭلاۋاتامسىلەر؟» دېدى"},{"number":26,"text":"مۇسا ئيتتى: «(ئۇ) سىلەرنىڭ پەرۋەردىگارىڭلاردۇر ۋە سىلەرنىڭ ئاتا - بوۋاڭلارنىڭ پەرۋەردىگارىدۇر»"},{"number":27,"text":"پىرئەۋن ئېيتتى: «سىلەرگە ئەۋەتىلگەن (بۇ) ئەلچى ئەلۋەتتە مەجنۇندۇر»"},{"number":28,"text":"مۇسا ئېيتتى: «(ئۇ) مەشرىقنىڭ، مەغرىبنىڭ ۋە ئۇلارنىڭ ئارىسىدىكى مەخلۇقاتنىڭ پەرۋەردىگارىدۇر. ئەگەر سىلەر چۈشىنىدىغان بولساڭلار»"},{"number":29,"text":"پىرئەۋن ئېيتتى: «ئەگەر مەندىن غەيرىنى ئىلاھ قىلىۋالىدىغان بولساڭ، سېنى چوقۇم زىندانغا تاشلايمەن»"},{"number":30,"text":"مۇسا ئېيتتى: «(مېنىڭ راست پەيغەمبەر ئىكەنلىكىمنى ئىسپاتلايدىغان) روشەن دەلىل كەلتۈرسەممۇ (زىندانغا تاشلامسەن؟)»"},{"number":31,"text":"پىرئەۋن ئېيتتى: «ئەگەر سۆزۈڭ راست بولسا روشەن دەلىلىڭنى كەلتۈرگىن»"},{"number":32,"text":"مۇسا ھاسىسىنى تاشلىۋىدى، ناگاھان ئوپئوچۇق ئەجدىھاغا ئايلاندى"},{"number":33,"text":"مۇسا (قوينىدىن) قولىنى چىقىرىۋىدى، ناگاھان ئۇ قارىغۇچىلارغا (نۇر چاقناپ تۇرىدىغان) ئاپئاق بولۇپ كۆرۈندى"},{"number":34,"text":"پىرئەۋن چۆرىسىدىكى (قەۋمنىڭ) چوڭلىرىغا ئېيتتى: «بۇ ھەقىقەتەن ئۇستا سېھىرگەر ئىكەن، ئۇ سېھىر ئارقىلىق سىلەرنى زېمىنىڭلاردىن ھەيدەپ چىقارماقچى، (بۇ ھەقتە) نېمە مەسلىھەت بېرىسىلەر؟»"},{"number":35,"text":"پىرئەۋن چۆرىسىدىكى (قەۋمنىڭ) چوڭلىرىغا ئېيتتى: «بۇ ھەقىقەتەن ئۇستا سېھىرگەر ئىكەن، ئۇ سېھىر ئارقىلىق سىلەرنى زېمىنىڭلاردىن ھەيدەپ چىقارماقچى، (بۇ ھەقتە) نېمە مەسلىھەت بېرىسىلەر؟»"},{"number":36,"text":"ئۇلار ئېيتتى: «(ئۇلارنىڭ ئىشىنى) تەخىر قىلغىن، شەھەرلەرگە (سېھىرگەرلەرنى) يىققۇچى كىشىلەرنى ئەۋەتكىن"},{"number":37,"text":"ئۇلار سېنىڭ ھوزۇرۇڭغا ناھايىتى ئۇستا سېھىرگەرلەرنىڭ ھەممىسىنى ئېلىپ كەلسۇن»"},{"number":38,"text":"مۇئەييەن كۈندىكى بەلگىلەنگەن ۋاقىتتا سېھىرگەرلەر توپلاندى"},{"number":39,"text":"كىشىلەرگە: «سىلەر يىغىلىپ بولدۇڭلارمۇ؟ ئەگەر سېھىرگەرلەر غالىب چىقسا ئۇلارغا بويسۇنۇشىمىز مۇمكىن» دېيىلدى"},{"number":40,"text":"كىشىلەرگە: «سىلەر يىغىلىپ بولدۇڭلارمۇ؟ ئەگەر سېھىرگەرلەر غالىب چىقسا ئۇلارغا بويسۇنۇشىمىز مۇمكىن» دېيىلدى"},{"number":41,"text":"سېھىرگەرلەر پىرئەۋننىڭ قېشىغا يېتىپ كەلگەندە، ئۇلار پىرئەۋنگە: «ئەگەر غەلىبە قىلساق بىزگە چوقۇم مۇكاپات بېرىلەمدۇ؟» دېدى"},{"number":42,"text":"پىرئەۋن: «ھەئە، ئۇ چاغدا (سىلەرگە مۇكاپات بېرىلىدۇ، ئۇنىڭ ئۈستىگە) سىلەر چوقۇم مېنىڭ يېقىن ئادەملىرىمدىن بولۇپ قالىسىلەر» دېدى"},{"number":43,"text":"مۇسا ئۇلارغا: «تاشلايدىغان نەرسەڭلارنى تاشلاڭلار!» دېدى"},{"number":44,"text":"ئۇلار ئارغامچىلىرىنى، ھاسسىلىرىنى تاشلىدى. ئۇلار: «پىرئەۋننىڭ كاتتىلىقى بىلەن قەسەمكى، بىز شەك شۈبھىسىز غەلىبە قىلىمىز» دېدى"},{"number":45,"text":"مۇسا ھاسىسىنى تاشلىدى، (ئۇ ئەجدىھاغا ئايلىىنىپ) ئۇلارنىڭ ئويدۇرما نەرسىلىرىنى يۈتۈۋەتتى"},{"number":46,"text":"سىھىرگەرلەر سەجدىگە باردى"},{"number":47,"text":"ئۇلار: «ئالەملەرنىڭ پەرۋەردىگارىغا - مۇسا ۋە ھارۇننىڭ پەرۋەردىگارىغا - ئىمان ئېيتتۇق» دېدى"},{"number":48,"text":"ئۇلار: «ئالەملەرنىڭ پەرۋەردىگارىغا - مۇسا ۋە ھارۇننىڭ پەرۋەردىگارىغا - ئىمان ئېيتتۇق» دېدى"},{"number":49,"text":"پىرئەۋن: «مەن رۇخسەت قىلماي تۇرۇپ سىلەر مۇساغا ئىمان ئېيتتىڭلار، ئۇ چوقۇم سىلەرگە سېھىرنى ئۈگەتكەن باشلىقىڭلار ئىكەن، (سىلەرنى قانداق جازالايدىغانلىقىمنى) ئۇزۇنغا قالماي بىلىسىلەر، قولۇڭلارنى، پۇتۇڭلارنى چوقۇم ئوڭ - چەپ قىلىپ (يەنى ئوڭ قولۇڭلار بىلەن سول پۇتۇڭلارنى ياكى سول قولۇڭلار بىلەن ئوڭ پۇتۇڭلارنى) كېسىمەن، ھەممىڭلارنى چوقۇم دارغا ئاسىمەن» دېدى"},{"number":50,"text":"سېھىرگەرلەر: «(بۇنىڭدىمۇ بىزگە) ھېچ زىيان يوق، بىز ئەلۋەتتە پەرۋەردىگارىمىزنىڭ دەرگاھىغا قايتقۇچىلارمىز، بىز مۇساغا ھەممىدىن بۇرۇن ئىمان ئېيتقۇچىلار بولغانلىقىمىز ئۈچۈن، پەرۋەردىگارىمىزنىڭ خاتالىقلىرىمىزنى مەغپىرەت قىلىشىنى ئەلۋەتتە ئۈمىد قىلىمىز» دېدى"},{"number":51,"text":"سېھىرگەرلەر: «(بۇنىڭدىمۇ بىزگە) ھېچ زىيان يوق، بىز ئەلۋەتتە پەرۋەردىگارىمىزنىڭ دەرگاھىغا قايتقۇچىلارمىز، بىز مۇساغا ھەممىدىن بۇرۇن ئىمان ئېيتقۇچىلار بولغانلىقىمىز ئۈچۈن، پەرۋەردىگارىمىزنىڭ خاتالىقلىرىمىزنى مەغپىرەت قىلىشىنى ئەلۋەتتە ئۈمىد قىلىمىز» دېدى"},{"number":52,"text":"بىز مۇساغا: «كېچىدە بەندىلىرىمنى (يەنى بەنى ئىسرائىلنى) ئېلىپ ئاتلانغىن. سىلەر ئەلۋەتتە قوغلىنىسىلەر، (يەنى پىرئەۋن ئۆز قەۋمى بىلەن سىلەرنى قوغلاپ چىقىدۇ)» دەپ ۋەھيى قىلدۇق"},{"number":53,"text":"پىرئەۋن شەھەرلەرگە (ئەسكەر) توپلىغۇچىلارنى ئەۋەتتى"},{"number":54,"text":"(پىرئەۋن ئېيتتىكى) «بۇ كىشىلەر ھەقىقەتەن بىر ئوچۇم ئادەملەردۇر"},{"number":55,"text":"ئۇلار ھەقىقەتەن بىزنىڭ ئاچچىقىمىزنى كەلتۈرۈپ قويدى"},{"number":56,"text":"بىز ھەقىقەتەن ئېھتىياتچان جامائەمىز»"},{"number":57,"text":"بىز ئولارنى (يەنى پىرئەۋن بىلەن ئۇنىڭ قەۋمىنى) باغلاردىن، بۇلاقلاردىن، خەزىنىلەردىن ۋە ئېسىل تۇرالغۇدىن ئايرىۋەتتۇق"},{"number":58,"text":"بىز ئولارنى (يەنى پىرئەۋن بىلەن ئۇنىڭ قەۋمىنى) باغلاردىن، بۇلاقلاردىن، خەزىنىلەردىن ۋە ئېسىل تۇرالغۇدىن ئايرىۋەتتۇق"},{"number":59,"text":"شۇنداق قىلىپ ئۇلارنى بەنى ئىسرائىلغا مىراس قىلىپ بەردۇق"},{"number":60,"text":"ئۇلار (يەنى پىرئەۋن بىلەن ئۇنىڭ قوشۇنى) ئۇلارنى كۈن چىققان چاغدا قوغلاپ چىقتى"},{"number":61,"text":"ئىككى توپ (يەنى پىرئەۋن توپى بىلەن مۇسا ئەلەيھىسسالامنىڭ توپى) بىر - بىرىنى كۆرۈپ تۇرۇشقان چاغدا، مۇسانىڭ ئادەملىرى: «ئۇلار: (يەنى پىرئەۋن بىلەن قوشۇنى) بىزگە چوقۇم يېتىشىۋالىدىغان بولدى» دېدى"},{"number":62,"text":"مۇسا ئېيتتى: «ئۇنداق بولمايدۇ (يەنى ھەرگىز يېتىشەلمەيدۇ) پەرۋەردىگارىم ھەقىقەتەن مەن بىلەن بىللە، مېنى (قۇتۇلۇش يولىغا) باشلايدۇ»"},{"number":63,"text":"بىز مۇساغا: «ھاساڭ بىلەن دەرياغا ئۇرغىن» دەپ ۋەھيى قىلدۇق، (مۇسا ھاسىسى بىلەن ئۇرۇۋېدى) دەريا يېرىلدى، (ھەر بىر يېرىلغان) قىسمى چوڭ تاغدەك بولۇپ قالدى"},{"number":64,"text":"ئىككىنچى بىر گۇرۇھنى بۇ يەرگە يېقىنلاشتۇردۇق (يەنى پىرئەۋن بىلەن قوشۇنىنى بەنى ئىسرائىلنىڭ ئارقىسىدىن دەرياغا كىرگۈزدۇق)"},{"number":65,"text":"مۇسا بىلەن ئۇنىڭ ھەمراھلىرىنى پۈتۈنلەي قۇتقۇزدۇق"},{"number":66,"text":"ئاندىن ئىككىنچى گۇرۇھنى (يەنى پىرئەۋن بىلەن قەۋمىنى) غەرق قىلدۇق"},{"number":67,"text":"بۇنىڭدا (يەنى پىرئەۋن بىلەن ئۇنىڭ قەۋمىنىڭ غەرق بولۇشىدا) ئەلۋەتتە (چوڭ) ئىبرەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":68,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":69,"text":"ئۇلارغا ئىبراھىمنىڭ قىسسىسىنى ئوقۇپ بەرگىن"},{"number":70,"text":"ئۆز ۋاقتىدا ئۇ ئاتىسىغا ۋە قەۋمىگە: «نېمىگە ئىبادەت قىلىسىلەر؟» دېدى"},{"number":71,"text":"ئۇلار: «بۇتلارغا ئىبادەت قىلىمىز، بۇ ئىبادەتنى داۋالاشتۇرىمىز» دېيىشتى"},{"number":72,"text":"ئىبراھىم ئېيتتى: «دۇئا قىلغان چېغىڭلاردا ئۇلار (دۇئايىڭلارنى ئاڭلامدۇ؟)"},{"number":73,"text":"يا سىلەرگە پايدا يەتكۈزەلەمدۇ؟ يا زىيان يەتكۈزەلەمدۇ؟»"},{"number":74,"text":"ئۇلار ئېيتتى: «ئۇنداق ئەمەس، ئاتا - بوۋىلىرىمىزنىڭ شۇنداق قىلغانلىقىنى بايقىدۇق»"},{"number":75,"text":"ئىبراھىم ئېيتتى: «ئېيتىپ بېقىڭلارچۇ! سىلەرنىڭ ئىبادەت قىلغىنىڭلار نېمە؟"},{"number":76,"text":"سىلەرنىڭ ئەڭ قەدىمكى ئەجدادلىرىڭلارنىڭ ئىبادەت قىلغىنى نېمە؟"},{"number":77,"text":"ئۇلار (يەنى بۇتلار) مېنىڭ دۈشمىنىمدۇر، پەقەت ئالەملەرنىڭ پەرۋەردىگارى (مېنىڭ پەرۋەردىگارىمدۇر)"},{"number":78,"text":"ئۇ مېنى ياراتقان، ئۇ مېنى ھىدايەت قىلىدۇ"},{"number":79,"text":"ئۇ مېنى تاماق بىلەن تەمىنلەيدۇ، ئۇسسۇلۇق بىلەن تەمىنلەيدۇ"},{"number":80,"text":"ئاغرىپ قالسام ئۇ مېنى ساقايتىدۇ"},{"number":81,"text":"ئۇ مېنى قەبزى روھ قىلىدۇ، كېيىن يەنە تىرىلدۈرىدۇ"},{"number":82,"text":"قىيامەت كۈنى ئۇنىڭ مېنىڭ خاتالىقلىرىمنى مەغپىرەت قىلىشىنى ئۈمىد قىلىمەن"},{"number":83,"text":"پەرۋەردىگارىم! ماڭا ئىلىم ھېكمەت ئاتا قىلغىن، مېنى ياخشىلارغا قوشقىن"},{"number":84,"text":"كېيىنكىلەر ئارىسىدا ياخشى نامىمنى قالدۇرغىن"},{"number":85,"text":"مېنى نازۇنېمەتلىك جەننەتنىڭ ۋارىسلىرىدىن قىلغىن"},{"number":86,"text":"ئاتامغا مەغپىرەت قىلغىن، ئۇ ھەقىقەتەن گۇمراھلاردىن بولدى"},{"number":87,"text":"ئۇلار (يەنى خالايىقلار) (ھېساب بېرىش ئۈچۈن) تىرىلدۈرىلىدىغان كۈندە مېنى رەسۋا قىلمىغىن"},{"number":88,"text":"ئۇ كۈنى (ھېچ كىشىگە) مال ۋە ئوغۇللار پايدا يەتكۈزەلمەيدۇ"},{"number":89,"text":"پەقەت (اﷲ نىڭ دەرگاھى) غا پاك قەلب بىلەن كەلگەن ئادەمگىلا پايدا يەتكۈزۈلىدۇ»"},{"number":90,"text":"جەننەت تەقۋادارلارغا يېقىنلاشتۇرىلىدۇ"},{"number":91,"text":"دوزاخ گۇمراھلارغا ئوچۇق كۆرسىتىلىدۇ"},{"number":92,"text":"ئۇلارغا: «سىلەر ئىلگىرى اﷲ نى قويۇپ چوقۇنغان نەرسەڭلار قەيەردە؟ ئۇلار سىلەرگە ياردەم بېرەلەمدۇ؟ يا ئۆزلىرىگە ياردەم بېرەلەمدۇ؟» دېيىلىدۇ"},{"number":93,"text":"ئۇلارغا: «سىلەر ئىلگىرى اﷲ نى قويۇپ چوقۇنغان نەرسەڭلار قەيەردە؟ ئۇلار سىلەرگە ياردەم بېرەلەمدۇ؟ يا ئۆزلىرىگە ياردەم بېرەلەمدۇ؟» دېيىلىدۇ"},{"number":94,"text":"بۇتلار، گۇمراھلار ۋە ئىبلىسنىڭ قوشۇنلىرىنىڭ ھەممىسى دوزاخقا ئۈستى - ئۈستىلەپ تاشلىنىدۇ"},{"number":95,"text":"بۇتلار، گۇمراھلار ۋە ئىبلىسنىڭ قوشۇنلىرىنىڭ ھەممىسى دوزاخقا ئۈستى - ئۈستىلەپ تاشلىنىدۇ"},{"number":96,"text":"ئۇلار دوزاختا جېدەللىشىپ ئېيتىدۇ: «اﷲ بىلەن قەسەمكى، بىز ئوپئوچۇق گۇمراھلىقتا ئىدۇق"},{"number":97,"text":"ئۇلار دوزاختا جېدەللىشىپ ئېيتىدۇ: «اﷲ بىلەن قەسەمكى، بىز ئوپئوچۇق گۇمراھلىقتا ئىدۇق"},{"number":98,"text":"ئۆز ۋاقتىدا بىز سىلەرنى (ئىبادەتتە) ئالەملەرنىڭ پەرۋەردىگارى بىلەن ئوخشاش ئورۇندا قوياتتۇق"},{"number":99,"text":"بىزنى پەقەت گۇناھكارلارلا ئازدۇردى"},{"number":100,"text":"شۇنىڭ ئۈچۈن بىزگە شاپائەت قىلغۇچىلار يوق"},{"number":101,"text":"ۋە يېقىن دوستىمۇ يوق"},{"number":102,"text":"ئەگەر بىزگە (دۇنياغا) قايتىشقا بولسا ئىدى، بىز مۆمىنلەردىن بولاتتۇق»"},{"number":103,"text":"شۈبھىسىزكى، بۇنىڭدا (يەنى ئىبراھىم ۋە ئۇنىڭ قەۋمىنىڭ قىسسىسىدە) (ئەقىل ئىگىلىرى ئۈچۈن) ئەلۋەتتە (چوڭ) ئىبرەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":104,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن ناھايىتى غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":105,"text":"نۇھنىڭ قەۋمى پەيغەمبەرلەرنى ئىنكار قىلدى"},{"number":106,"text":"ئۆز ۋاقتىدا ئۇلارغا قېرىندىشى نۇھ ئېيتتى: «سىلەر (اﷲ تىن) قورقمامسىلەر؟"},{"number":107,"text":"مەن ھەقىقەتەن سىلەرگە سادىق بىر پەيغەمبەرمەن"},{"number":108,"text":"سىلەر اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":109,"text":"تەبلىغ قىلغانلىقىمغا سىلەردىن ھېچقانداق ھەق تەلەپ قىلمايمەن، ئۇنى پەقەت ئالەملەرنىڭ پەرۋەردىگارىدىن تىلەيمەن"},{"number":110,"text":"اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار»"},{"number":111,"text":"ئۇلار: «(ئى نۇھ!) ساڭا تۆۋەن تەبىقىدىكى ئادەملەر ئەگەشكەن تۇرسا، ساڭا بىز ئىمان ئېيتامدۇق؟» دېدى"},{"number":112,"text":"نۇھ ئېيتتى: «مەن ئۇلارنىڭ نېمە قىلغانلىقىنى ئۇقمايمەن"},{"number":113,"text":"ئەگەر بىلسەڭلار ئۇلاردىن ھېساب ئېلىشنى پەقەت پەرۋەردىگارىم ئۈستىگە ئالغان"},{"number":114,"text":"مەن مۆمىنلەرنى قوغلىۋەتمەيمەن"},{"number":115,"text":"مەن پەقەت ئوچۇق - ئاشكارا ئاگاھلاندۇرغۇچىمەن»"},{"number":116,"text":"ئۇلار ئېيتتى: «ئى نۇھ! ئەگەر سەن (پەيغەمبەرلىك دەۋەتىڭدىن) يانمىساڭ، سەن چوقۇم تاش - كېسەك قىلىنىپ ئۆلتۈرۈلگۈچىلەردىن بولىسەن»"},{"number":117,"text":"نۇھ ئېيتتى: «پەرۋەردىگارىم! قەۋمىم مېنى ھەقىقەتەن ئىنكار قىلدى"},{"number":118,"text":"مەن بىلەن ئۇلارنىڭ ئارىسىدا ھۆكۈم چىقارغىن، مېنى ۋە مەن بىلەن بىللە بولغان مۆمىنلەرنى قۇتقۇزغىن»"},{"number":119,"text":"بىز ئۇنى ۋە (ئادەملەر، ھايۋانلار بىلەن) لىق تولغان كېمىدە ئۇنىڭ بىلەن بىللە بولغانلارنى قۇتقۇزدۇق"},{"number":120,"text":"(ئۇلارنى قۇتقۇزغاندىن) كېيىن ئاندىن قالغانلارنى غەرق قىلدۇق"},{"number":121,"text":"بۇنىڭدا (تەپەككۇر قىلغۇچىلار ئۈچۈن) ئەلۋەتتە (چوڭ) ئىبرەت بار، ئۇلار (يەنى كىشىلەر) نىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":122,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن ناھايىتى غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":123,"text":"ئاد (خەلقى) پەيغەمبەرلەرنى ئىنكار قىلدى"},{"number":124,"text":"ئۆز ۋاقتىدا ئۇلارغا قېرىندىشى ھۇد ئېيتتى: «سىلەر (اﷲ تىن) قورقمامسىلەر؟"},{"number":125,"text":"مەن ھەقىقەتەن سىلەرگە سادىق پەيغەمبەرمەن"},{"number":126,"text":"سىلەر اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":127,"text":"تەبلىغ قىلغانلىقىمغا سىلەردىن ھېچقانداق ھەق تەلەپ قىلمايمەن، ئۇنى پەقەت ئالەملەرنىڭ پەرۋەردىگارىدىن تىلەيمەن"},{"number":128,"text":"سىلەر ھەر بىر ئېگىز جايغا ئويۇن - كۈلكە ئۈچۈن بىر ئالامەت (يەنى ئېگىز بىنا) سالامسىلەر"},{"number":129,"text":"(گويا سىلەر ئۆلمەيدىغاندەك) دۇنيادا مەڭگۈ قېلىشنى ئۈمىد قىلىپ پۇختا سارايلارنى سالامسىلەر"},{"number":130,"text":"ئەگەر (بىراۋنى) جازالىساڭلار، زالىملاردەك جازالايسىلەر"},{"number":131,"text":"سىلەر اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":132,"text":"سىلەرگە سىلەر بىلىدىغان نېمەتلەرنى ئاتا قىلغان اﷲ تىن قورقۇڭلار"},{"number":133,"text":"ئۇ سىلەرگە چارۋىلارنى، ئوغۇللارنى، باغلارنى، بۇلاقلارنى ئاتا قىلدى"},{"number":134,"text":"ئۇ سىلەرگە چارۋىلارنى، ئوغۇللارنى، باغلارنى، بۇلاقلارنى ئاتا قىلدى"},{"number":135,"text":"مەن ھەقىقەتەن سىلەرنىڭ بۈيۈك كۈننىڭ ئازابىغا قېلىشىڭلاردىن قورقىمەن»"},{"number":136,"text":"ئۇلار ئېيتتى: «نەسىھەت قىلامسەن، قىلمامسەن، بەرىبىر بىزگە ئوخشاش"},{"number":137,"text":"بۇ (يەنى بۇتلارغا چوقۇنۇش) پەقەت بۇرۇنقىلاردىن قالغان ئادەت"},{"number":138,"text":"بىز ھەرگىز جازالانمايمىز»"},{"number":139,"text":"ئۇلار ئۇنى (يەنى ھۇدنى) ئىنكار قىلدى، ئۇلارنى بىز ھالاك قىلدۇق، بۇنىڭدا ئەلۋەتتە (چوڭ) ئىبرەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":140,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن ناھايىتى غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":141,"text":"سەمۇد (خەلقى) پەيغەمبەرلەرنى ئىنكار قىلدى"},{"number":142,"text":"ئۆز ۋاقتىدا ئۇلارغا قېرىندىشى سالىھ ئېيتتى: «(اﷲ تىن) قورقمامسىلەر؟"},{"number":143,"text":"مەن ھەقىقەتەن سىلەرگە سادىق پەيغەمبەرمەن"},{"number":144,"text":"سىلەر اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":145,"text":"تەبلىغ قىلغانلىقىمغا سىلەردىن ھېچقانداق ھەق تەلەپ قىلمايمەن، ئۇنى پەقەت ئالەملەرنىڭ پەرۋەردىگارىدىن تىلەيمەن"},{"number":146,"text":"سىلەر بۇ يەرلەردە، باغچىلاردىن، بۇلاقلاردىن، زىرائەتلەردىن، يۇمشاق پىشقان خورمىلاردىن بەھرىمەن بولۇپ خاتىرجەم ھالدا داۋاملىق قالىمىز (دەپ ئويلامسىلەر)"},{"number":147,"text":"سىلەر بۇ يەرلەردە، باغچىلاردىن، بۇلاقلاردىن، زىرائەتلەردىن، يۇمشاق پىشقان خورمىلاردىن بەھرىمەن بولۇپ خاتىرجەم ھالدا داۋاملىق قالىمىز (دەپ ئويلامسىلەر)"},{"number":148,"text":"سىلەر بۇ يەرلەردە، باغچىلاردىن، بۇلاقلاردىن، زىرائەتلەردىن، يۇمشاق پىشقان خورمىلاردىن بەھرىمەن بولۇپ خاتىرجەم ھالدا داۋاملىق قالىمىز (دەپ ئويلامسىلەر)"},{"number":149,"text":"خۇشال ھالدا تاغلارنى تېشىپ ئۆي ياسامسىلەر"},{"number":150,"text":"اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":151,"text":"زېمىندا بۇزغۇنچىلىق قىلىدىغان، ئىسلاھ قىلمايدىغان ھەددىدىن ئاشقۇچىلارنىڭ ئەمرىگە ئىتائەت قىلماڭلار»"},{"number":152,"text":"زېمىندا بۇزغۇنچىلىق قىلىدىغان، ئىسلاھ قىلمايدىغان ھەددىدىن ئاشقۇچىلارنىڭ ئەمرىگە ئىتائەت قىلماڭلار»"},{"number":153,"text":"ئۇلار ئېيتتى: «سەن ھەقىقەتەن سېھىر قىلىنغانلاردىنسەن"},{"number":154,"text":"سەن پەقەت بىزگە ئوخشاش بىر ئىنسانسەن، ئەگەر سەن راستچىللاردىن بولساڭ، بىرەر مۆجىزە كەلتۈرۈپ باققىن»"},{"number":155,"text":"سالىھ ئېيتتى: «بۇ چىشى تۆگە (سۈيۈڭلاردىن بىر كۈن) ئىچىدۇ، سىلەرمۇ مۇئەييەن بىر كۈن ئىچىسىلەر"},{"number":156,"text":"ئۇنىڭغا يامانلىق قىلماڭلار، بولمىسا سىلەر بۈيۈك كۈننىڭ ئازابىغا دۇچار بولۇسىلەر»"},{"number":157,"text":"ئۇلار چىشى تۆگىنى بوغۇزلىدى، شۇنىڭ بىلەن ئۇلار نادامەتكە قالدى"},{"number":158,"text":"ئۇلارغا ئازاب چۈشتى، بۇنىڭدا ئەلۋەتتە (چوڭ) ئىبرەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":159,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن ناھايىتى غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":160,"text":"لۇتنىڭ قەۋمى پەيغەمبەرلەرنى ئىنكار قىلدى"},{"number":161,"text":"ئۆز ۋاقتىدا ئۇلارغا قېرىندىشى لۇت ئېيتتى: «سىلەر (اﷲ تىن) قورقمامسىلەر؟"},{"number":162,"text":"مەن ھەقىقەتەن سىلەرگە سادىق پەيغەمبەرمەن"},{"number":163,"text":"سىلەر اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":164,"text":"تەبلىغ قىلغانلىقىمغا سىلەردىن ھېچقانداق ھەق تەلەپ قىلمايمەن، ئۇنى پەقەت ئالەملەرنىڭ پەرۋەردىگارىدىن تىلەيمەن"},{"number":165,"text":"سىلەر ئەھلى جاھان ئىچىدىن لىۋاتە قىلىپ، پەرۋەردىگارىڭلار سىلەر ئۈچۈن ياراتقان ئاياللىرىڭلارنى تاشلاپ قويامسىلەر؟ سىلەر ھەقىقەتەن (بۇزۇقچىلىقتا) ھەددىدىن ئاشقۇچى قەۋمسىلەر»"},{"number":166,"text":"سىلەر ئەھلى جاھان ئىچىدىن لىۋاتە قىلىپ، پەرۋەردىگارىڭلار سىلەر ئۈچۈن ياراتقان ئاياللىرىڭلارنى تاشلاپ قويامسىلەر؟ سىلەر ھەقىقەتەن (بۇزۇقچىلىقتا) ھەددىدىن ئاشقۇچى قەۋمسىلەر»"},{"number":167,"text":"ئۇلار ئېيتتى: «ئى لۇت! ئەگەر (دەۋىتىڭدىن) قايتمىساڭ، چوقۇم سۈرگۈن قىلىنىسەن»"},{"number":168,"text":"لۇت ئېيتتى: «مەن سىلەرنىڭ قىلىقىڭلاردىن قاتتىق يىرگىنىمەن"},{"number":169,"text":"پەرۋەردىگارىم! قىلمىشلىرى تۈپەيلىدىن (ئۇلارغا كېلىدىغان ئازابتىن) مېنى ۋە تەۋەلىرىمنى قۇتقۇزغىن»"},{"number":170,"text":"ئۇنى ۋە ئۇنىڭ تەۋەلىرىنىڭ ھەممىسىنى قۇتقۇزدۇق"},{"number":171,"text":"پەقەت موماينى (يەنى لۇتنىڭ ئايالىنى قالدۇرۇپ قويۇپ) ھالاك قىلدۇق"},{"number":172,"text":"ئاندىن قالغانلارنى ھالاك قىلدۇق"},{"number":173,"text":"ئۇلارنىڭ ئۈستىگە بىز يامغۇر (يەنى تاش) ياغدۇردۇق، ئاگاھلاندۇرۇلغۇچىلارغا ياغدۇرۇلغان يامغۇر نېمىدېگەن يامان"},{"number":174,"text":"بۇنىڭدا ئەلۋەتتە (چوڭ) بىر ئىبرەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچى بولمىدى"},{"number":175,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن ناھايىتى غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":176,"text":"ئەيكىلىقلار پەيغەمبەرلىرىنى ئىنكار قىلدى"},{"number":177,"text":"ئۆز ۋاقتىدا شۇئەيب ئۇلارغا ئېيتتى: «سىلەر (اﷲ تىن) قورقمامسىلەر؟"},{"number":178,"text":"مەن ھەقىقەتەن سىلەرگە سادىق پەيغەمبەرمەن"},{"number":179,"text":"اﷲ تىن قورقۇڭلار، ماڭا ئىتائەت قىلىڭلار"},{"number":180,"text":"تەبلىغ قىلغانلىقىمغا سىلەردىن ھېچقانداق ھەق تەلەپ قىلمايمەن، ئۇنى پەقەت ئالەملەرنىڭ پەرۋەردىگارىدىن تىلەيمەن"},{"number":181,"text":"ئۆلچەمنى تولدۇرۇپ بېرىڭلار، كەم بەرگۈچىلەردىن بولماڭلار"},{"number":182,"text":"(نەرسىلەرنى) توغرا تارازىدا تارتىڭلار"},{"number":183,"text":"كىشىلەرگە نەرسىلىرىنى (يەنى قايسى يول بىلەن بولمىسۇن، كىشىلەرنىڭ ھەقلىرىنى) كەم بەرمەڭلار، يەر يۈزىدە بۇزغۇنچىلىق قىلىپ پىتنە - پاسات تېرىماڭلار"},{"number":184,"text":"سىلەرنى ۋە ئىلگىرىكى ئۈممەتلەرنى ياراتقان اﷲ تىن قورقۇڭلار»"},{"number":185,"text":"ئۇلار ئېيتتى: «سەن سېھىر قىلىنغۇچىلاردىنسەن"},{"number":186,"text":"سەن پەقەت بىزگە ئوخشاش (ئاددى) ئادەمسەن، سېنى بىز ھەقىقەتەن يالغانچى دەپ گۇمان قىلىمىز"},{"number":187,"text":"ئەگەر (سۆزۈڭدە) راستچىللاردىن بولساڭ، بىزگە ئاسماندىن ئازاب چۈشۈرگىن»"},{"number":188,"text":"شۇئەيب ئېيتتى: «پەرۋەردىگارىم! سىلەرنىڭ قىلمىشىڭلارنى ئوبدان بىلىدۇ»"},{"number":189,"text":"ئۇلار شۇئەيبنى ئىنكار قىلدى، ئۇلارنى سايە كۈنىنىڭ ئازابى ھالاك قىلدى. ئۇ ھەقىقەتەن بۈيۈك كۈننىڭ ئازابى ئىدى"},{"number":190,"text":"بۇنىڭدا ئەلۋەتتە (چوڭ) ئىبرەت بار، ئۇلارنىڭ تولىسى ئىمان ئېيتقۇچىلاردىن بولمىدى"},{"number":191,"text":"سېنىڭ پەرۋەردىگارىڭ ھەقىقەتەن ناھايىتى غالىبتۇر، ناھايىتى مېھرىباندۇر"},{"number":192,"text":"شۈبھىسىزكى، قۇرئان ئالەملەرنىڭ پەرۋەردىگارى تەرىپىدىن نازىل قىلىنغاندۇر"},{"number":193,"text":"ئاگاھلاندۇرغۇچىلاردىن بولۇشۇڭ ئۈچۈن، ئىشەنچلىك جىبرىئىل ئۇنى سېنىڭ قەلبىڭگە ئېلىپ چۈشتى"},{"number":194,"text":"ئاگاھلاندۇرغۇچىلاردىن بولۇشۇڭ ئۈچۈن، ئىشەنچلىك جىبرىئىل ئۇنى سېنىڭ قەلبىڭگە ئېلىپ چۈشتى"},{"number":195,"text":"(قۇرئان) ئوچۇق ئەرەبى تىلىدا (نازىل بولدى)"},{"number":196,"text":"ھەقىقەتەن قۇرئان ئىلگىرىكى (پەيغەمبەرلەرنىڭ) كىتابلىرىدا تىلغا ئېلىنغان"},{"number":197,"text":"(ئابدۇللا ئىبن سالام ۋە ئۇنىڭ ئىمان ئېيتقان ھەمراھلىرىغا ئوخشاش) بەنى ئىسرائىل ئۆلىمالىرىنىڭ قۇرئاننى بىلىشى مۇشرىكلارغا (قۇرئاننىڭ توغرىلىقىنى كۆرسىتىدىغان) دەلىل بولمامدۇ؟"},{"number":198,"text":"ئەگەر بىز قۇرئاننى ئەرەب تىلىدا بولمىغان بىر ئادەمگە نازىل قىلغان بولساق، ئۇ قۇرئاننى ئۇلارغا ئوقۇپ بەرسە، ئۇلار ئۇنىڭغا ئىشەنمەيتتى"},{"number":199,"text":"ئەگەر بىز قۇرئاننى ئەرەب تىلىدا بولمىغان بىر ئادەمگە نازىل قىلغان بولساق، ئۇ قۇرئاننى ئۇلارغا ئوقۇپ بەرسە، ئۇلار ئۇنىڭغا ئىشەنمەيتتى"},{"number":200,"text":"شۇنىڭدەك گۇناھكارلارنىڭ دىللىرىغا قۇرئاننى سالدۇق (ئۇلار قۇرئاننى چۈشىنىپ، ئۇنىڭ پاساھەت - بالاغىتىنى ۋە مۆجىزە ئىكەنلىكىنى بىلىپ تۇرۇپ ئىمان ئېيتمىدى)"},{"number":201,"text":"ئۇلار (اﷲ نىڭ) قاتتىق ئازابىنى كۆرمىگىچە قۇرئانغا ئىشەنمەيدۇ"},{"number":202,"text":"ئۇ ئازاب ئۇلارغا ئۇشتۇمتۇت كېلىدۇ، ئۇلار ئۇنىڭ (كەلگەنلىكىنى) تۇيماي قالىدۇ"},{"number":203,"text":"(ئۇلارغا تۇيۇقسىز ئازاب كەلگەندە) ئۇلار: «بىزگە (ئىمان ئېيتىۋېلىش ئۈچۈن) مۆھلەت بېرىلەمدۇ؟» دەيدۇ"},{"number":204,"text":"ئۇلار بىزنىڭ ئازابىمىزنىڭ بۇرۇنراق كېلىشىنى تىلەمدۇ؟"},{"number":205,"text":"ئېيتىپ باققىنا! ئەگەر ئۇلارنى (نۇرغۇن) يىللار (نېمەتلىرىمىزدىن) بەھرىمەن قىلساق، ئاندىن ئۇلارغا ئاگاھلاندۇرۇلغان ئازاب كەلسە، ئۇلارنىڭ بەھرىمەن بولغان نېمەتلىرى (ئۇلاردىن ئازابنى دەپئى قىلىشتا) ھېچ نەرسىگە ئەسقاتمايدۇ"},{"number":206,"text":"ئېيتىپ باققىنا! ئەگەر ئۇلارنى (نۇرغۇن) يىللار (نېمەتلىرىمىزدىن) بەھرىمەن قىلساق، ئاندىن ئۇلارغا ئاگاھلاندۇرۇلغان ئازاب كەلسە، ئۇلارنىڭ بەھرىمەن بولغان نېمەتلىرى (ئۇلاردىن ئازابنى دەپئى قىلىشتا) ھېچ نەرسىگە ئەسقاتمايدۇ"},{"number":207,"text":"ئېيتىپ باققىنا! ئەگەر ئۇلارنى (نۇرغۇن) يىللار (نېمەتلىرىمىزدىن) بەھرىمەن قىلساق، ئاندىن ئۇلارغا ئاگاھلاندۇرۇلغان ئازاب كەلسە، ئۇلارنىڭ بەھرىمەن بولغان نېمەتلىرى (ئۇلاردىن ئازابنى دەپئى قىلىشتا) ھېچ نەرسىگە ئەسقاتمايدۇ"},{"number":208,"text":"قانداقلىكى شەھەر بولمىسۇن، ۋەز - نەسىھەت قىلىش ئۈچۈن پەيغەمبەرلەرنى ئەۋەتمىگىچە، ئۇنى ھالاك قىلمىدۇق، (ئۇلارنى جازالاشتا) بىز زالىم بولمىدۇق"},{"number":209,"text":"قانداقلىكى شەھەر بولمىسۇن، ۋەز - نەسىھەت قىلىش ئۈچۈن پەيغەمبەرلەرنى ئەۋەتمىگىچە، ئۇنى ھالاك قىلمىدۇق، (ئۇلارنى جازالاشتا) بىز زالىم بولمىدۇق"},{"number":210,"text":"قۇرئاننى شەيتانلار ئېلىپ چۈشكىنى يوق"},{"number":211,"text":"بۇ ئۇلارغا لايىق ئەمەس. ئۇلارمۇ (ئۇنىڭغا) قادىر بولالمايدۇ"},{"number":212,"text":"شۈبھىسىزكى، ئۇلار (يەنى شەيتانلار) (ئوغرىلىقچە) تىڭشاشتىن مەنئى قىلىنغاندۇر"},{"number":213,"text":"اﷲ تىن باشقا ھېچ ئىلاھقا ئىبادەت قىلمىغىن، ئۇنداق قىلساڭ، ئازاب قىلىنغۇچىلاردىن بولۇپ قالىسەن"},{"number":214,"text":"يېقىن خىش – ئەقرىبالىرىڭنى ئاگاھلاندۇغىن"},{"number":215,"text":"ساڭا ئەگەشكەن مۆمىنلەرگە مۇلايىم بولغىن"},{"number":216,"text":"ئەگەر خىش - ئەقرىبالىرىڭ ساڭا ئاسىيلىق قىلسا: «مەن سىلەرنىڭ قىلمىشلىرىڭلاردىن ھەقىقەتەن ئادا - جۇدا مەن» دېگىن"},{"number":217,"text":"ناھايىتى غالىب، مېھرىبان اﷲ قا يۆلەنگىن"},{"number":218,"text":"اﷲ سېنى (نامازغا) قوپقىنىڭدا كۆرۈپ تۇرىدۇ"},{"number":219,"text":"ناماز ئوقۇغۇچىلار ئارىسىدىكى (سەجدىگە بارغانلىق، رۇكۇغا تۇرغانلىق ۋە قىيامدا تۇرغانلىق) ھەرىكىتىڭنى كۆرۈپ تۇرىدۇ"},{"number":220,"text":"شۈبھىسىزكى، اﷲ ھەممىنى ئاڭلاپ تۇرغۇچىدۇر، ھەممىنى بىلىپ تۇرغۇچىدۇر"},{"number":221,"text":"(ئى مۇھەممەد! مەككە كۇففارلىرىغا ئېيتقىنكى) سىلەرگە مەن شەيتانلارنىڭ كىمگە چۈشىدىغانلىقىنى ئېيتىپ بېرەيمۇ؟"},{"number":222,"text":"ئۇلار ھەربىر ئىغۋا توقۇغۇچى، گۇناھكارغا چۈشىدۇ"},{"number":223,"text":"ئۇلار (پەرىشتىلەرنىڭ سۆزلىرىنى ئوغرىلىقچە) ئاڭلايدۇ، ئۇلار (يەنى شەيتانلار) نىڭ تولىسى يالغانچىلاردۇر"},{"number":224,"text":"شائىرلارغا گۇمراھلار ئەگىشىدۇ"},{"number":225,"text":"ئۇلارنىڭ (سۆز) ۋادىلىرىدا تېڭىرقاپ يۈرگەنلىكىنى كۆرمەمسەن؟"},{"number":226,"text":"ئۇلار قىلمايدىغان نەرسىلىرىنى قىلدۇق دەپ سۆزلەيدۇ"},{"number":227,"text":"پەقەت ئىمان ئېيتقان ۋە ياخشى ئەمەللەرنى قىلغان، اﷲ نى كۆپ زىكرى قىلغان، زۇلۇمغا ئۇچرىغاندىن كېيىن ئۆزىنى قوغدىغان شائىرلار بۇنىڭدىن مۇستەسنا، زۇلۇم قىلغۇچىلار ئۇزاققا قالماي قايسى جايغا قايتىدىغانلىقىنى بىلىدۇ"}]}