{"number":31,"edition":"ug.saleh","ayahs":[{"number":1,"text":"ئەلىف، لام، مىم"},{"number":2,"text":"بۇ، ھېكمەتلىك كىتابنىڭ ئايەتلىرىدۇر"},{"number":3,"text":"(ئۇ) (تەئدىل ئەركان بىلەن) ناماز ئوقۇيدىغان، (اﷲ نىڭ رەزاسىنى تىلەش يۈزىسىدىن كۆڭۈل ئازادىلىكى بىلەن) زاكات بېرىدىغان ۋە ئاخىرەتكە جەزمەن ئىشىنىدىغان ياخشى ئىش قىلغۇچى كىشىلەرگە ھىدايەتتۇر ۋە رەھمەتتۇر"},{"number":4,"text":"(ئۇ) (تەئدىل ئەركان بىلەن) ناماز ئوقۇيدىغان، (اﷲ نىڭ رەزاسىنى تىلەش يۈزىسىدىن كۆڭۈل ئازادىلىكى بىلەن) زاكات بېرىدىغان ۋە ئاخىرەتكە جەزمەن ئىشىنىدىغان ياخشى ئىش قىلغۇچى كىشىلەرگە ھىدايەتتۇر ۋە رەھمەتتۇر"},{"number":5,"text":"ئاشۇلار (يەنى يۇقىرىقى سۈپەتلەرگە ئىگە كىشىلەر) پەرۋەردىگارىنىڭ توغرا يولىدا بولغۇچىلاردۇر، ئەنە شۇلار مەقسەتكە ئېرىشكۈچىلەردۇر"},{"number":6,"text":"بەزى كىشىلەر بىلىمسىزلىكتىن، (كىشىلەرنى) اﷲ نىڭ يولىدىن ئازدۇرۇش ئۈچۈن بىھۇدە گەپلەرنى سېتىۋالىدۇ ۋە اﷲ نىڭ يولىنى مەسخىرە قىلىدۇ، ئەنە شۇلار خور قىلغۇچى ئازابقا دۇچار بولىدۇ"},{"number":7,"text":"ئەگەر ئۇنىڭغا بىزنىڭ ئايەتلىرىمىز (يەنى قۇرئان ئايەتلىرى) ئوقۇپ بېرىلسە، گويا ئۇنى ئاڭلىمىغاندەك، ئىككى قۇلىقى ئېغىرلىشىپ قالغاندەك (اﷲ نىڭ ئايەتلىرىگە قۇلاق سېلىشتىن) تەكەببۇرلۇق بىلەن يۈز ئۆرۈيدۇ، (ئى مۇھەممەد!) ئۇنىڭغا قاتتىق ئازاب بىلەن خۇش خەۋەر بەرگىن"},{"number":8,"text":"شۈبھىسىزكى، ئىمان ئېيتقانلار ۋە ياخشى ئەمەللەرنى قىلغانلار نازۇنېمەتلىك جەننەتلەرگە كىرىدۇ"},{"number":9,"text":"ئۇ جەننەتلەردە ئۇلار مەڭگۈ قالىدۇ. بۇ اﷲ نىڭ راست ۋەدىسىدۇر (اﷲ ۋەدىسىگە خىلاپلىق قىلمايدۇ)، اﷲ غالىبتۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر"},{"number":10,"text":"اﷲ ئاسمانلارنى تۈۋرۈكسىز ياراتتىكى، سىلەر ئۇنى كۆرۈپ تۇرۇۋاتىسىلەر، يەر تەۋرەپ سىلەرنى خاتىرجەمسىز قىلمىسۇن دەپ، يەردە تاغلارنى ئورناتتى، زېمىندا تۈرلۈك جاندارلارنى تاراتتى، بۇلۇتتىن يامغۇر سۈيىنى چۈشۈرۈپ، ئۇنىڭ بىلەن زېمىندا تۈرلۈك پايدىلىق ئۆسۈملۈكلەرنى ئۆستۈردۇق"},{"number":11,"text":"مانا بۇلار اﷲ نىڭ (ياراتقان) مەخلۇقاتلىرىدۇر، ماڭا كۆرسىتىپ بېرىڭلاركى، اﷲ تىن باشقا مەبۇدلىرىڭلار زادى نېمىلەرنى ياراتتى؟ بەلكى زالىملار ئوپئوچۇق گۇمراھلىقتىدۇر"},{"number":12,"text":"بىز لوقمانغا ھەقىقەتەن ھېكمەت ئاتا قىلدۇق، (ئۇنىڭغا ئېيتتۇقكى) «اﷲ قا شۈكۈر قىلغىن، كىمكى شۈكۈر قىلىدىكەن، ئۆزى ئۈچۈن قىلغان بولىدۇ، كىمكى كۇفرىلىق قىلىدىكەن، شۈبھىسىزكى، اﷲ (بەندىلەردىن) بىھاجەتتۇر، مەدھىيىگە لايىقتۇر»"},{"number":13,"text":"ئۆز ۋاقتىدا لوقمان (ھەكىم) ئوغلىغا نەسىھەت قىلىپ: «ئى ئوغۇلچىقىم، اﷲ قا شېرىك كەلتۈرمىگىن، شېرىك كەلتۈرۈش ھەقىقەتەن زور گۇناھتۇر» دېدى"},{"number":14,"text":"ئىنساننى ئاتا - ئانىسىغا ياخشىلىق قىلىشقا بۇيرۇدۇق. ئانىسى ئۇنى (قورسىقىدا) ئۈستى - ئۈستىگە ئاجىزلىق بىلەن كۆتۈردى. ئىككى يىلدا ئۇنى ئەمچەكتىن ئايرىدى. (ئى ئىنسان!) ماڭا ۋە ئاتا - ئاناڭغا شۈكۈر قىلغىن، ئاخىر قايتىدىغان جاي مېنىڭ دەرگاھىمدۇر"},{"number":15,"text":"ئەگەر ئاتا - ئاناڭ سېنى سەن بىلمەيدىغان نەرسىنى ماڭا شېرىك كەلتۈرۈشكە زورلىسا، ئۇلارغا ئىتائەت قىلمىغىن، ئۇلارغا دۇنيادا ياخشى مۇئامىلىدە بولغىن (يەنى دىنىڭغا زىيان يەتمەيدىغان ئاساستا ياخشىلىق قىلغىن)، ماڭا تائەت بىلەن قايتقان ئادەمنىڭ يولىغا ئەگەشكىن، ئاندىن مېنىڭ دەرگاھىمغا قايتىسىلەر، سىلەرگە قىلمىشىڭلارنى ئېيتىپ بېرىمەن"},{"number":16,"text":"(لوقمان ئېيتتى) «ئى ئوغۇلچىقىم! قىلمىشىڭ قىچا چاغلىق نەرسە بولۇپ، ئۇ ئۇيۇل تاشنىڭ ئىچىدە (يەنى ئەڭ مەخپىي جايدا) يا ئاسمانلارنىڭ قېتىدا ياكى زېمىننىڭ ئاستىدا بولسىمۇ، اﷲ ئۇنى ھازىر قىلىدۇ (ئۇنىڭ ھېسابىنى ئالىدۇ). اﷲ ھەقىقەتەن ئىنچىكە كۈزەتكۈچىدۇر، ھەممىدىن خەۋەرداردۇر"},{"number":17,"text":"ئى ئوغۇلچىقىم! نامازنى (ۋاقتىدا تەئدىل ئەركان بىلەن) ئوقۇغىن، (كىشىلەرنى) ياخشىلىققا بۇيرۇغىن، يامانلىقتىن توسقىن، ساڭا يەتكەن كۈلپەتلەرگە سەۋر قىلغىن (چۈنكى ھەقىقەتكە دەۋەت قىلغۇچى ئەزىيەتلەرگە ئۇچرايدۇ)، بۇ ھەقىقەتەن قىلىشقا ئىرادە تىكلەشكە تېگىشلىك ئىشلاردىندۇر"},{"number":18,"text":"كىشىلەردىن مەنسىتمەسلىك بىلەن يۈز ئۆرۈمىگىن، زېمىندا غادىيىپ ماڭمىغىن، اﷲ ھەقىقەتەن ھاكاۋۇر، ئۆزىنى چوڭ تۇتقۇچىلارنى دوست تۇتمايدۇ"},{"number":19,"text":"ئوتتۇراھال ماڭغىن، ئاۋازىڭنى پەسلەتكىن، ئاۋازلارنىڭ ئەڭ زېرىكەرلىكى ھەقىقەتەن ئېشەكلەرنىڭ ئاۋازىدۇر»"},{"number":20,"text":"بىلمەمسىلەركى، اﷲ ئاسمانلاردىكى ۋە زېمىندىكى ھەممىنى سىلەرگە بويسۇندۇرۇپ بەردى (يەنى سىلەرنىڭ پايدىلىنىشىڭلارغا مۇۋاپىقلاشتۇرۇپ بەردى). سىلەرگە ئاشكارا ۋە يوشۇرۇن (يەنى ماددىي ۋە مەنىۋى) نېمەتلەرنى كامالەتكە يەتكۈزۈپ بەردى. بەزى كىشىلەر ھېچقانداق ئىلىمسىز، ھىدايەتسىز ۋە نۇرلۇق كىتابسىز ھالدا اﷲ بارىسىدا جېدەللىشىدۇ"},{"number":21,"text":"ئەگەر ئۇلارغا: «اﷲ نازىل قىلغان نەرسە (يەنى قۇرئان) غا ئەگىشىڭلار» دېيىلسە، ئۇلار: «ياق، بىز ئاتا - بوۋىلىرىمىزنىڭ دىنىغا ئەگىشىمىز» دەيدۇ، شەيتان ئۇلارنى دوزاخ ئازابىغا چاقىرغان تۇرسا (ئۇلار يەنىلا ئاتا - بوۋىلىرىنىڭ دىنىغا ئەگىشەمدۇ؟)"},{"number":22,"text":"ياخشى ئىش قىلغۇچى بولغان ھالدا ئىخلاس بىلەن اﷲ قا بويسۇنغان ئادەم مەھكەم تۇتقىغا ئېسىلغان بولىدۇ، ئىشلارنىڭ ئاقىۋىتى اﷲ قا مەنسۇپتۇر"},{"number":23,"text":"كىمكى كاپىر بولىدىكەن، ئۇنىڭ كۇفرى سېنى قايغۇغا سالمىسۇن، ئۇلار بىزنىڭ دەرگاھىمىزغا قايتىدۇ، ئۇلارغا (دۇنيادىكى) قىلمىشلىرىنى ئېيتىپ بېرىمىز، اﷲ ھەقىقەتەن ئۇلارنىڭ دىللىرىدىكىنى بىلىپ تۇرغۇچىدۇر"},{"number":24,"text":"ئۇلارنى (دۇنيادىن) ئازغىنا (مۇددەت) بەھرىمەن قىلىمىز، ئاندىن ئۇلارنى قاتتىق ئازابنى (تېتىشقا) مەجبۇرلايمىز"},{"number":25,"text":"ئەگەر سەن ئۇلاردىن: «ئاسمانلارنى ۋە زېمىننى كىم خەلق ئەتتى؟» دەپ سورىساڭ، ئۇلار چوقۇم «اﷲ» دەپ جاۋاپ بېرىدۇ، ئېيتقىنكى، «جىمى ھەمدۇسانا اﷲ قا خاستۇر!» بەلكى ئۇلارنىڭ تولىسى ئۇقمايدۇ"},{"number":26,"text":"ئاسمانلاردىكى ۋە زېمىندىكى نەرسىلەر اﷲ نىڭ مۈلكىدۇر، اﷲ ھەقىقەتەن (مەخلۇقاتىدىن ۋە ئۇلارنىڭ ئىبادىتىدىن) بىھاجەتتۇر، مەدھىيىگە لايىقتۇر"},{"number":27,"text":"ئەگەر يەر يۈزىدىكى دەرەخلەرنىڭ ھەممىسى قەلەم بولغان، دېڭىز (سىيا) بولغان، ئۇنىڭغا يەنە يەتتە دېڭىز (نىڭ سىياسى) قوشۇلغان تەقدىردىمۇ اﷲ نىڭ سۆزلىرىنى (يېزىپ) تۈگەتكىلى بولمايدۇ، اﷲ ھەقىقەتەن غالىبتۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر"},{"number":28,"text":"(ئى ئىنسانلار!) سىلەرنىڭ (دەسلەپتە) يارىتىلىشىڭلار، (ئۆلگەندىن كېيىن) تىرىلدۈرۈلۈشىڭلار پەقەت بىر ئادەمنىڭ يارىتىلىشى، بىر ئادەمنىڭ تىرىلدۈرۈلۈشىگە ئوخشاشتۇر. اﷲ ھەقىقەتەن (بەندىلىرىنىڭ سۆزلىرىنى) ئاڭلاپ تۇرغۇچىدۇر، (ئەمەللىرىنى) كۆرۈپ تۇرغۇچىدۇر"},{"number":29,"text":"اﷲ نىڭ كېچىنى كۈندۈزگە ۋە كۈندۈزنى كېچىگە كىرگۈزىلىدىغانلىقىنى، كۈن بىلەن ئاينى بويسۇندۇرىدىغانلىقىنى كۆرمەمسەن؟ (كۈن بىلەن ئاينىڭ) ھەر بىرى مۇئەييەن مۇددەت (يەنى قىيامەت) كىچە (ئۆز پەلىكىدە) سەير قىلىدۇ. اﷲ سىلەرنىڭ قىلمىشىڭلاردىن تولۇق خەۋەرداردۇر"},{"number":30,"text":"بۇ شۇنىڭ ئۈچۈنكى، اﷲ ھەق (ئىلاھ) دۇر، ئۇلارنىڭ اﷲ نى قويۇپ ئىبادەت قىلغانلىرى (يەنى بۇتلىرى) باتىلدۇر، اﷲ ئالىيدۇر، بۈيۈكتۇر"},{"number":31,"text":"كۆرمەمسەنكى، كېمىلەرنىڭ اﷲ نىڭ مەرھەمىتى بىلەن دېڭىزدا يۈرۈشى اﷲ نىڭ سىلەرگە (ئۆز قۇدرىتىنىڭ) بىر قىسىم دەلىللىرىنى كۆرسىتىشى ئۈچۈندۇر. بۇنىڭدا ھەر بىر سەۋر قىلغۇچى، شۈكۈر قىلغۇچى (بەندە ئۈچۈن ھەقىقەتەن) (چوڭ) ئىبرەت بار"},{"number":32,"text":"(دېڭىزدا) ئۇلارنى تاغلاردەك دولقۇنلار ئورىۋالغان چاغدا، ئۇلار كامالى ئىخلاس بىلەن اﷲ قا ئىلتىجا قىلىدۇ، اﷲ ئۇلارنى (دېڭىز خەتەرلىرىدىن) قۇتۇلدۇرۇپ قۇرۇقلۇققا چىقارغان چاغدا، ئۇلارنىڭ بەزىسى توغرا يولدا بولىدۇ. بىزنىڭ ئايەتلىرىمىزنى پەقەت خىيانەتكار (اﷲ نىڭ نېمەتلىرىدىن تانغان) ئادەملا ئىنكار قىلىدۇ"},{"number":33,"text":"ئى ئىنسانلار! پەرۋەردىگارىڭلارغا (بۇيرۇقلىرىنى ئورۇنلاش، مەنئى قىلغان ئىشلاردىن چەكلىنىش بىلەن) تەقۋادارلىق قىلىڭلار، شۇنداق بىر كۈندىن قورقۇڭلاركى، (ئۇ كۈندە) ئاتا بالىسىغا ئەسقاتمايدۇ، بالىمۇ ئاتىسىغا ئەسقاتمايدۇ، اﷲ نىڭ ۋەدىسى ھەقىقەتەن ھەقتۇر، سىلەرنى ھەرگىز دۇنيا تىرىكچىلىكى مەغرۇر قىلمىسۇن، شەيتاننىڭ سىلەرنى اﷲ نىڭ ئەپۇسىنىڭ كەڭلىكى بىلەن مەغرۇر قىلىشىغا يول قويماڭلار"},{"number":34,"text":"قىيامەت (نىڭ بولىدىغان ۋاقتى) توغرىسىدىكى بىلىم ھەقىقەتەن اﷲ نىڭ دەرگاھىدىدۇر. اﷲ يامغۇرنى (ئۆزى بەلگىلىگەن ۋاقىتتا ۋە ئۆزى بەلگىلىگەن جايغا) ياغدۇرىدۇ، بەچچىداندىكىلەرنىڭ نېمە ئىكەنلىكىنى (يەنى ئوغۇلمۇ، قىزمۇ، بېجىرىممۇ، كەمتۈكمۇ، بەختلىكمۇ، بەختسىزمۇ) اﷲ بىلىدۇ، ھېچ ئادەم ئەتە نېمىلەرنى قىلىدىغانلىقىنى (يەنى ئۇنىڭغا نېمە ئىش بولىدىغانلىقىنى، ياخشى - يامان ئىشلاردىن نېمىلەرنى قىلىدىغانلىقىنى) بىلمەيدۇ، ھېچ ئادەم ئۆزىنىڭ قەيەردە ئۆلىدىغانلىقىنى بىلمەيدۇ، اﷲ ھەقىقەتەن (پۈتۈن ئىشلارنى) بىلىپ تۇرغۇچىدۇر، (شەيئىلەرنىڭ ئىچكى ۋە تاشقى تەرەپلىرىدىن) تولۇق خەۋەرداردۇر"}]}