{"number":23,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Bereits sind die Mumin erfolgreich"},{"number":2,"text":"Diejenigen, die in ihrem rituellen Gebet voller Ehrfurcht sind"},{"number":3,"text":"Und diejenigen, die dem unnützen Gerede abgeneigt sind"},{"number":4,"text":"Und diejenigen, welche die Zakat entrichten"},{"number":5,"text":"Und diejenigen, die ihre Intimbereiche behüten"},{"number":6,"text":"außer ihren Ehefrauen und denen gegenüber, die ihnen gehören. Denn dann sind sie gewiß nicht zu tadeln"},{"number":7,"text":"Wer dann anderes als dies erstrebt, diese sind die wirklichen Übertretenden"},{"number":8,"text":"Und diejenigen, welche das ihnen Anvertraute und ihre Abmachungen wahren"},{"number":9,"text":"Und diejenigen, die ihre rituellen Gebete beachten"},{"number":10,"text":"Diese sind die Erben"},{"number":11,"text":"die Al-firdaus erben. Darin bleiben sie ewig"},{"number":12,"text":"Und gewiß, bereits erschufen WIR den Menschen aus einem Auszug aus Lehm"},{"number":13,"text":"Dann machten WIR ihn als Nutfa in einem gefestigten Aufenthaltsort"},{"number":14,"text":"Dann ließen WIR die Nutfa zu einer 'Alaqa werden. So ließen WIR die 'Alaqa zu einer Mudgha werden, und WIR ließen die Mudgha zu Knochen werden, und die Knochen bedeckten WIR mit Fleisch, dann ließen WIR ihn als eine andere Schöpfung entstehen. Also immer allerhabener ist ALLAH, Der Beste aller Schöpfer"},{"number":15,"text":"Dann gewiß ihr werdet danach zweifelsohne sterben"},{"number":16,"text":"Dann gewiß ihr werdet am Tag der Auferstehung erweckt werden"},{"number":17,"text":"Und gewiß, bereits erschufen WIR über euch sieben übereinander Lagernde. Und WIR waren nie der Schöpfung gegenüber achtlos"},{"number":18,"text":"Und WIR ließen vom Himmel Wasser in Abgewogenheit fallen, dann ließen WIR es in der Erde unterbringen. Und WIR sind, um es vergehen zu lassen, doch allmächtig"},{"number":19,"text":"Dann ließen WIR für euch mit ihm Dschannat von Dattelpalmen und Rebstöcken entstehen, darin habt ihr vieles an Obst und davon esst ihr"},{"number":20,"text":"Und (WIR ließen damit entstehen) einen Baum, der am Tur-Berg von Sainaa heraussprießt, er bringt das Öl und Soße für die Essenden hervor"},{"number":21,"text":"Und gewiß, für euch gibt es in den An'am zweifelsohne eine Lehre. WIR geben euch zu trinken von dem, was in ihren Bäuchen ist. Und für euch gibt es in ihnen noch andere Nützlichkeiten, und von ihnen esst ihr"},{"number":22,"text":"Und auf ihnen und auf den Schiffen werdet ihr getragen"},{"number":23,"text":"Und gewiß, bereits entsandten WIR Nuh zu seinen Leuten, er sagte: \"Meine Leute! Dient ALLAH! Denn für euch gibt es keinen anderen als Gott. Wollt ihr denn nicht Taqwa gemäß handeln"},{"number":24,"text":"Dann sagten die Entscheidungsträger von seinen Leuten, die Kufr betrieben: \"Dieser ist nichts anderes als ein Mensch genau wie ihr, der sich nur über euch erheben will. Und sollte ALLAH wollen, hätte ER gewiß Engel herabgesandt. WIR hörten nichts darüber in den (Überlieferungen) unserer Vorfahren"},{"number":25,"text":"Er ist nur ein Mann, der geistesgestört ist, also wartet mit ihm bis zu einer Frist ab"},{"number":26,"text":"Er sagte: \"Mein HERR! Stehe mir bei wegen dem, wie sie mich der Lüge bezichtigten"},{"number":27,"text":"Sogleich ließen WIR ihm Wahy zuteil werden: \"Baue das Schiff unter Unserer Aufsicht und nach Unserem Wahy! Und wenn dann Unsere Bestimmung eintrifft und die Erdoberfläche sprudelt, nimm darauf mit von allen (Dingen) genau Zweiheiten und deine Familie außer denjenigen von ihnen, über sie die Bestimmung (zum Ertrinken) bereits ergangen ist. Und sprich Mich nicht an wegen denjenigen, die Unrecht begingen, denn sie werden gewiß ertrinken"},{"number":28,"text":"Sogleich du mit denjenigen mit dir auf dem Schiff stehst, sag: \"Alhamdulillah: Alles Lob gebührt ALLAH, Der uns von den unrechtbegehenden Leuten errettete"},{"number":29,"text":"Und sag: \"Mein HERR! Bringe mich in einer Unterbringung voller Baraka unter. Und DU bist Der Beste der Unterbringenden"},{"number":30,"text":"Gewiß, darin gibt sind zweifelsohne Ayat, und WIR waren doch Prüfende"},{"number":31,"text":"Dann ließen WIR nach ihnen eine andere Generation entstehen"},{"number":32,"text":"Sogleich entsandten WIR zu ihnen einen Gesandten von ihnen: \"Dient ALLAH! Denn für euch gibt es keinen anderen als Gott. Wollt ihr denn nicht Taqwa gemäß handeln"},{"number":33,"text":"Dann sagten die Entscheidungsträger von seinen Leuten, die Kufr betrieben und das Treffen im Jenseits ableugnet haben, und denen WIR Luxus im diesseitigen Leben gewährten: \"Dieser ist nichts anderes als ein Mensch genau wie ihr, er ißt von dem, was ihr esst, und trinkt von dem, was ihr trinkt"},{"number":34,"text":"Und wenn ihr einem Menschen wie ihr (selbst) gehorcht, gewiß seid ihr dann doch Verlierer"},{"number":35,"text":"Verspricht er euch etwa, daß wenn ihr sterbt und zu Erde und Knochen werdet, daß ihr doch dann hervorgebracht werdet"},{"number":36,"text":"Unglaubwürdig, ziemlich unglaubwürdig ist das, was euch versprochen wird"},{"number":37,"text":"Es gibt nur unser diesseitiges Leben, wir sterben und leben und wir werden nie erweckt"},{"number":38,"text":"Er ist nur ein Mann, der im Namen ALLAHs Lügen erfindet, und wir werden an ihn den Iman nicht verinnerlichen"},{"number":39,"text":"Er sagte: \"Mein HERR! Stehe mir bei wegen dem, wie sie mich der Lüge bezichtigten"},{"number":40,"text":"ER sagte: \"In Kürze werden sie es doch noch bereuen"},{"number":41,"text":"Dann richtete der Schrei sie in gerechter Weise zugrunde. Dann machten WIR sie als Überrest. Also nieder mit den unrecht-begehenden Leuten"},{"number":42,"text":"Dann ließen WIR nach ihnen andere Generationen entstehen"},{"number":43,"text":"Weder verlegt eine Umma ihre Frist vor, noch zögern sie diese hinaus"},{"number":44,"text":"Dann entsandten WIR Unsere Gesandten einen nach dem anderen. Immer wieder, wenn zu einer Umma ihr Gesandter kam, bezichtigten sie ihn der Lüge. Sogleich ließen WIR die einen den anderen (in der Vernichtung) folgen, und machten sie zum Objekt von Erzählungen. Also nieder mit Leuten, die den Iman nicht verinnerlichen"},{"number":45,"text":"Dann entsandten WIR Musa und seinen Bruder Harun mit Unseren Ayat und einem eindeutigen Beweis"},{"number":46,"text":"zu Pharao und seinen Entscheidungsträgern. Dann erhoben sie sich in Arroganz, und sie waren hochmütige Leute"},{"number":47,"text":"Sie sagten dann: \"Sollen wir etwa den Iman an zwei Menschen wie wir verinnerlichen, deren Leute für uns Diener sind"},{"number":48,"text":"Sie bezichtigten dann sie der Lüge, dann waren sie von den Zugrunde-Gerichteten"},{"number":49,"text":"Und gewiß, bereits ließen WIR Musa die Schrift zuteil werden, damit sie Rechtleitung finden"},{"number":50,"text":"Und WIR machten Ibnu- Maryam und seine Mutter zu einer Aya und gewährten ihnen Unterkunft bei einem Hügel mit Aufenthaltsmöglichkeit und fließendem Wasser"},{"number":51,"text":"Ihr Gesandte! Esst von den Tay-yibat und tut gottgefällig Gutes! ICH bin gegenüber dem, was ihr tut, allwissend"},{"number":52,"text":"Und gewiß diese eure Umma, ist eine einheitliche Umma, und ICH bin euer HERR, so handelt Taqwa gemäß Mir gegenüber"},{"number":53,"text":"Dann zerteilten sie sich ihre Angelegenheit untereinander in Gruppen. Jede Partei findet Gefallen an dem, worüber sie verfügt"},{"number":54,"text":"So laß sie in ihrer Achtlosigkeit bis zu einer Frist"},{"number":55,"text":"Denken sie etwa, daß das, womit WIR ihnen Nachschub gewähren an Vermögen und Kindern"},{"number":56,"text":"daß WIR ihnen damit die guten Dinge schnell zukommen lassen?! Nein, sondern sie merken es nicht"},{"number":57,"text":"Gewiß, diejenigen, die vor Ehrfurcht ihrem HERRN gegenüber ergeben sind"},{"number":58,"text":"und diejenigen, die den Iman an die Ayat ihres HERRN verinnerlichen"},{"number":59,"text":"und diejenigen, die ihrem HERRN gegenüber keinen Schirk betreiben"},{"number":60,"text":"und diejenigen, die das geben, was sie gaben, während ihre Herzen ehrfurcht-erfüllt sind, da sie zu ihrem HERRN zurückkehren werden"},{"number":61,"text":"diese eilen initiativ zum (gottgefällig) Guten, und sind daran die ersten voran"},{"number":62,"text":"Und WIR erlegen keinem Menschen auf außer dem, was er vermag. Und WIR haben ein Register, das die Wahrheit artikuliert. Und ihnen wird kein Unrecht zugefügt"},{"number":63,"text":"Nein, sondern ihre Herzen sind in Achtlosigkeit demgegenüber. Und sie haben andere Taten als diese, die sie immer wieder tun"},{"number":64,"text":"Wenn WIR dann ihre Luxurierenden mit der Peinigung zugrunde richten, dann schreien sie um Hilfe"},{"number":65,"text":"Schreit heute nicht um Hilfe! Gewiß, ihr werdet von Uns nicht unterstützt"},{"number":66,"text":"Bereits wurden euch Meine Ayat stets vorgetragen, dann pflegtet ihr auf euren Fersen (zum Kufr) umzukehren"},{"number":67,"text":"in äußerster Arroganz ihm gegenüber, und ihr habt nachts dagegen gelästert"},{"number":68,"text":"Haben sie etwa über das Vorgetragene nicht nachgedacht?! Oder kam etwa zu ihnen das, was zu ihren ersten Ahnen nicht kam"},{"number":69,"text":"Oder kannten sie etwa ihren Gesandten nicht, so daß sie ihm gegenüber ableugnend waren"},{"number":70,"text":"Oder sagen sie etwa: \"Er ist geistesgestört\"?! Nein, sondern er kam zu ihnen mit der Wahrheit! Und die meisten von ihnen sind der Wahrheit gegenüber abgeneigt"},{"number":71,"text":"Und würde die Wahrheit ihren Neigungen folgen, gewiß würden die Himmel und die Erde und alle, die in ihnen sind, ins Verderben fallen. Nein, sondern WIR ließen ihnen das von ihnen Erwähnte zuteil werden, dann waren sie dem von ihnen Erwähnten gegenüber abwendend"},{"number":72,"text":"Oder bittest du sie etwa um Löhnung?! So ist die Löhnung deines HERRN besser. Und ER ist Der Beste der Rizq-Gewährenden"},{"number":73,"text":"Und gewiß, du machst für sie doch Da'wa zu einem geradlinigen Weg"},{"number":74,"text":"Doch diejenigen, die keinen Iman an das Jenseits verinnerlichen, sind vom Weg zweifelsohne abweichend"},{"number":75,"text":"Und würden WIR ihnen Gnade erweisen und ihnen das wegnehmen, was sie an Schädigendem traf, gewiß würden sie noch mehr in ihrer Maßlosigkeit verharren und abirren"},{"number":76,"text":"Und gewiß, bereits richteten WIR sie mit der Peinigung zugrunde, dann weder gaben sie sich ihrem HERRN hin, noch baten sie unterwürfig um Hilfe"},{"number":77,"text":"Als WIR dann für sie eine Tür mit harter Peinigung öffneten, da waren sie darüber verzweifelt"},{"number":78,"text":"Und ER ist Derjenige, Der für euch das Hören, das Sehen und den Verstand entstehen ließ. Doch ihr seid selten dankbar"},{"number":79,"text":"Und ER ist Derjenige, Der euch auf der Erde vermehren ließ, und vor Ihm werdet ihr versammelt"},{"number":80,"text":"Und ER ist Derjenige, Der lebendig macht und sterben läßt. Und Ihm unterliegt die Aufeinanderfolge von Nacht und Tag. Besinnt ihr euch etwa nicht"},{"number":81,"text":"Nein, sondern sie sagten das Gleiche, was die Früheren sagten"},{"number":82,"text":"Sie sagten: \"Wenn wir starben und zu Erde und Knochen wurden, würden wir etwa doch erweckt werden"},{"number":83,"text":"Gewiß, bereits wurde uns und unseren Vorfahren dieses vorher angedroht. Dies sind nichts anderes als die Legenden der Vorfahren"},{"number":84,"text":"Sag: \"Wem gehört die Erde und das, was auf ihr ist, solltet ihr wissen"},{"number":85,"text":"Sie werden sagen: \"ALLAH!\" Sag: \"Entsinnt ihr euch nicht"},{"number":86,"text":"Sag: \"Wer ist Der HERR der sieben Himmeln und Der HERR vom gewaltigen Al'ahrsch"},{"number":87,"text":"Sie werden sagen: \"ALLAH!\" Sag: \"Handelt ihr etwa nicht Taqwa gemäß"},{"number":88,"text":"Sag: \"Wem unterliegt die Herrschaft des Allerlei, und wer gewährt Schutz, während ihm kein Schutz gewährt wird, solltet ihr wissen"},{"number":89,"text":"Sie werden sagen: \"ALLAH!\" Sag: \"Wie werdet ihr denn verblendet"},{"number":90,"text":"Nein, sondern WIR ließen ihnen die Wahrheit zuteil werden! Doch sie sind zweifellos Lügner"},{"number":91,"text":"ALLAH nahm sich nie ein Kind, und mit Ihm war nie eine (andere) Gottheit, sonst nähme sich doch jede Gottheit, was sie erschuf, und es würden sich die einen von ihnen über die anderen erheben. Subhanallah über das, was sie erdichten"},{"number":92,"text":"ER ist Der Allwissende über das Verborgene und das Sichtbare. Also erhaben ist ER über das, was sie an Schirk betreiben"},{"number":93,"text":"Sag: \"Mein HERR! Wenn DU mich doch noch erleben läßt, was ihnen angedroht wurde"},{"number":94,"text":"mein HERR!  lasse mich nicht unter den unrecht-begehenden Leuten sein"},{"number":95,"text":"Und gewiß, WIR sind doch allmächtig, dich noch erleben zu lassen, was WIR ihnen androhen"},{"number":96,"text":"Wehre mit dem ab, was besser ist, die Verfehlung! WIR wissen besser Bescheid über das, was sie erdichten"},{"number":97,"text":"Und sag: \"Mein HERR! Ich suche bei Dir Schutz vor den Einflüsterungen der Satane"},{"number":98,"text":"Und ich suche bei Dir Schutz, HERR! - daß sie anwesend werden"},{"number":99,"text":"Wenn dann der Tod einen von ihnen ereilt, sagt er: \"Mein HERR! Schicke mich zurück"},{"number":100,"text":"Damit ich gottgefällig Gutes tue von dem, was ich vernachlässigt habe.\" Nein! Gewiß, dies ist nur eine Floskel, die er sagen wird. Und vor ihnen ist ein Barsakh bis zu dem Tag, an dem sie erweckt werden"},{"number":101,"text":"Und wenn in As-sur geblasen wird, dann gelten an diesem Tag keine Abstammungen mehr zwischen ihnen und sie fragen einander nicht"},{"number":102,"text":"Also jeder, dessen Abgewogenes schwer wiegt, so sind diese die wirklichen Erfolgreichen"},{"number":103,"text":"Und jeder, dessen Abgewogenes leicht wiegt, so sind diese diejenigen, die sich selbst verloren haben, in Dschahannam bleiben sie ewig"},{"number":104,"text":"Das Feuer wird ihre Gesichter grillen. Und sie sind darin fletschend"},{"number":105,"text":"Wurden euch Meine Ayat etwa nicht stets vorgetragen, und ihr pflegtet sie als Lüge abzutun"},{"number":106,"text":"Sie sagten: \"Unser HERR! Unser Unglück hat uns überwältigt, und wir waren zweifelsohne abirrende Leute"},{"number":107,"text":"Unser HERR! Laß uns aus ihr (Dschahannam) herausbringen, und wenn wir es wiederholen, dann sind wir wirklich Unrecht-Begehende"},{"number":108,"text":"ER sagte: \"Bleibt darin erniedrigt und sprecht Mich nicht an"},{"number":109,"text":"Gewiß, es war eine Gruppe von Meinen Dienern, die sagten: \"Unser HERR! Wir verinnerlichten den Iman, so vergib uns und erweise uns Gnade, denn DU bist Der Allgnädigste der Gnädigen"},{"number":110,"text":"So habt ihr sie zum Spott gemacht, bis sie euch das Gedenken an Mich vergessen ließen, und ihr pflegtet, euch über sie lächerlich zu machen"},{"number":111,"text":"Gewiß, ICH vergalt ihnen heute das, was sie an Geduld aufbrachten: Sie sind die Erfolgreichen"},{"number":112,"text":"ER sagte: \"Wie lange habt ihr auf der Erde an Anzahl von Jahren verweilt"},{"number":113,"text":"Sie sagten: \"Wir verweilten einen Tag oder einen Teil eines Tages, so frage doch die Rechnenden"},{"number":114,"text":"Sag: \"Ihr habt nur ein wenig verweilt. Würdet ihr doch nur zu wissen gepflegt haben"},{"number":115,"text":"Habt ihr etwa gedacht, daß WIR euch aus sinnlosem Treiben erschufen, und daß ihr zu Uns nicht zurückgebracht würdet"},{"number":116,"text":"Also erhaben ist ALLAH, Der Wahre Herrscher! Es gibt keine Gottheit außer Ihm, Der HERR vom ehrwürdigen Al'ahrsch"},{"number":117,"text":"Und wer mit ALLAH einen anderen Gott anruft, für den er keinen Nachweis hat, dessen Abrechnung ist nur bei seinem HERRN. Gewiß, die Kafir werden nie erfolgreich sein"},{"number":118,"text":"Und sag: \"Mein HERR! Vergib und erweise Gnade! Und DU bist Der Beste der Gnade-Erweisenden"}]}