{"number":70,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Ein Bittender bat um eine sich ereignende Peinigung"},{"number":2,"text":"für die Kafir, für die es keinen Zurückhaltenden gibt"},{"number":3,"text":"von ALLAH, Dem mit den Aufstiegen himmelswärts"},{"number":4,"text":"Die Engel und der Ruhh steigen auf zu Ihm an einem Yaum, dessen Länge fünfzigtausend Jahre ist"},{"number":5,"text":"So übe dich in schöner Geduld"},{"number":6,"text":"Gewiß, sie sehen sie weit entfernt"},{"number":7,"text":"und WIR sehen sie nahe"},{"number":8,"text":"am Tag, wenn der Himmel wie das Verschmolzene wird"},{"number":9,"text":"und die Berge wie die Wolle werden"},{"number":10,"text":"und kein enger Freund einen engen Freund fragt"},{"number":11,"text":"Und sie werden ihnen gezeigt. Der schwer Verfehlende wünscht sich, er könnte sich von der Peinigung an diesem Tag freikaufen mit seinen Söhnen"},{"number":12,"text":"mit seiner Gefährtin, mit seinem Bruder"},{"number":13,"text":"mit seiner Großfamilie, die ihn aufnimmt"},{"number":14,"text":"und mit allen auf der Erde, allesamt, dann daß dies ihn errettet"},{"number":15,"text":"Nein! Es ist eine Feuerflamme"},{"number":16,"text":"Abziehende der Kopfhäute"},{"number":17,"text":"die denjenigen ruft, der den Rücken kehrte und sich abwandte"},{"number":18,"text":"und anhäufte, dann (nur für sich) behielt"},{"number":19,"text":"Gewiß, der Mensch wurde als ein ängstlich Ungeduldiger erschaffen"},{"number":20,"text":"Wenn ihn das Böse trifft, so ist er äußerst ungeduldig"},{"number":21,"text":"und wenn ihn das Gute trifft, ist er äußerst geizig"},{"number":22,"text":"außer den Betenden"},{"number":23,"text":"die ihr rituelles Gebet stets einhalten"},{"number":24,"text":"sowie denjenigen, in deren Vermögensgütern ein festgesetztes Recht ist"},{"number":25,"text":"für den Bittenden und den Ausgeschlossenen"},{"number":26,"text":"sowie denjenigen, die den Tag des Din für wahrhaftig halten"},{"number":27,"text":"sowie denjenigen, die vor der Peinigung ihres HERRN ehrfurcht-erfüllt sind"},{"number":28,"text":"gewiß die Peinigung ihres HERRN ist nicht absicherbar"},{"number":29,"text":"sowie denjenigen, die ihre Keuschheit Bewahrende sind"},{"number":30,"text":"außer vor ihren Ehepartnern oder vor denen, die ihnen gehören, denn dann gewiß sind sie nicht zu tadeln"},{"number":31,"text":"und wer darüber hinaus etwas anstrebt, so sind diese die wirklichen Übertretenden"},{"number":32,"text":"sowie denjenigen, die sich um das ihnen Anvertraute und ihre Verträge kümmern"},{"number":33,"text":"sowie denjenigen, die ihre Zeugnisse standesgemäß ablegen"},{"number":34,"text":"sowie denjenigen, die ihre rituellen Gebete zu ihrer Zeit verrichten"},{"number":35,"text":"diese sind in Dschannat gewürdigt"},{"number":36,"text":"Also was ist mit denjenigen, die Kufr betrieben haben, sie kommen zu dir eilend"},{"number":37,"text":"von der Rechten und von der Linken in Gruppen"},{"number":38,"text":"Hofft etwa jeder Mann von ihnen, daß er in eine Dschanna des Wohlergehens hineingelassen wird"},{"number":39,"text":"Nein! Gewiß, WIR erschufen sie doch von dem, was sie wissen"},{"number":40,"text":"Also schwöre ICH bei dem HERRN der Osten und der Westen, gewiß, WIR sind mit Sicherheit dazu imstande"},{"number":41,"text":"sie mit Besseren als sie eintauschen, und Uns wird nicht zuvorgekommen"},{"number":42,"text":"So laß sie sich unterhalten und Unfug treiben, bis sie ihren Tag treffen, der ihnen angedroht wird"},{"number":43,"text":"An dem Tag, wenn sie von den Gräbern eilend herauskommen, als würden sie zu Aufgestellten (Zeichen) spurten"},{"number":44,"text":"Ihre Blicke sind (vor Ehrfurcht) gesenkt, und Demütigung überkommt sie. Dies ist der Tag, der ihnen immer angedroht wurde"}]}