{"number":83,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Niedergang sei den beim Abmessen Betrügenden"},{"number":2,"text":"diejenigen, wenn sie sich von den Menschen zumessen lassen, über das Maß Hinausgehendes nehmen"},{"number":3,"text":"und wenn sie ihnen zumessen oder abwiegen, vermindern"},{"number":4,"text":"Denken diese etwa nicht, daß sie erweckt werden"},{"number":5,"text":"zu einem gewaltigen Tag"},{"number":6,"text":"wenn dieMenschen für den HERRN aller Schöpfung aufstehen"},{"number":7,"text":"Gewiß, nein! Gewiß, das Register der öffentlich die Verfehlung Begehenden ist doch in Sidsch-dschin"},{"number":8,"text":"Und was weißt du, was Sidsch-dschin ist"},{"number":9,"text":"Es ist ein versiegeltes/gekennzeichnetes Register"},{"number":10,"text":"Niedergang ist an diesem Tag für die Ableugner bestimmt"},{"number":11,"text":"diejenigen, die den Tag des Din ableugnen"},{"number":12,"text":"Und ihn leugnet nur jeder verfehlende Grenzüberschreitende ab"},{"number":13,"text":"Als ihm Unsere Ayat vorgetragen wurden, sagte er: \"Dies sind die Legenden der Früheren"},{"number":14,"text":"Gewiß, nein! Sondern es überkam ihre Herzen, was sie zu erwerben pflegten"},{"number":15,"text":"Gewiß, nein! Gewiß, sie sind an diesem Tag von ihrem HERRN doch abgeschirmt"},{"number":16,"text":"Dann gewiß, sie werden doch in Dschahannam hineingeworfen"},{"number":17,"text":"Dann wird ihnen gesagt: \"Dies ist das, was ihr abzuleugnen pflegtet"},{"number":18,"text":"Gewiß, nein! Gewiß, das Register der Gütig-Gehorsamen ist doch in 'Illiyin"},{"number":19,"text":"und was weißt du, was 'Illiyin ist"},{"number":20,"text":"Es ist ein versiegeltes/gekennzeichnetes Register"},{"number":21,"text":"welches die Nahestehenden bezeugen"},{"number":22,"text":"Gewiß, die Gütig-Gehorsamen sind im Wohlergehen"},{"number":23,"text":"Sie sind auf Liegen, sie schauen"},{"number":24,"text":"Du erkennst in ihren Gesichtern das Strahlen des Wohlergehens"},{"number":25,"text":"Ihnen wird von einem puren mit Aroma versehenen Getränk zu trinken gegeben"},{"number":26,"text":"dessen Aroma aus Moschus ist. Und darin sollen die Konkurrierenden konkurrieren"},{"number":27,"text":"Und dessen Mischung ist aus Tasniem"},{"number":28,"text":"eine Quelle, aus der die Nahestehenden trinken"},{"number":29,"text":"Gewiß, diejenigen, die schwere Verfehlungen begingen, pflegten sich über diejenigen, die den Iman verinnerlichten, lustig zu machen"},{"number":30,"text":"Und als sie an ihnen vorbeigingen, zwinkerten sie einander (vielsagend) zu"},{"number":31,"text":"Und als sie zu ihren Familien zurückkehrten, kehrten sie freudenerregt zurück"},{"number":32,"text":"Und als sie sie sahen, sagten sie: \"Gewiß, diese sind doch Abirrende"},{"number":33,"text":"Und über ihnen wurden keine Bewahrende entsandt"},{"number":34,"text":"An diesem Tag also machen sich diejenigen, die den Iman verinnerlichten, über die Kafir lustig"},{"number":35,"text":"Sie sind auf Liegen, sie schauen zu"},{"number":36,"text":"Wurde den Kafir vergolten, was sie zu machen pflegten"}]}