{"number":36,"edition":"bg.theophanov","ayahs":[{"number":1,"text":"Йа. Син"},{"number":2,"text":"Кълна се в мъдрия Коран"},{"number":3,"text":"[О, Мухаммад] ти наистина си от пратениците"},{"number":4,"text":"по правия път"},{"number":5,"text":"низпослан от Всемогъщия, Милосърдния"},{"number":6,"text":"за да предупредиш хора, чиито бащи не бяха предупредени, затова са нехайни"},{"number":7,"text":"Сбъдна се словото за повечето от тях - те не са вярващи"},{"number":8,"text":"и сложихме на врата им окови до брадата, и са държани с вдигната глава"},{"number":9,"text":"И сложихме пред тях ограда, и зад тях - ограда, и ги затулихме, та не виждат"},{"number":10,"text":"И е все едно дали ги предупреждаваш или не ги предупреждаваш, те не вярват"},{"number":11,"text":"Ти убеждаваш само онзи, който следва Напомнянето и в уединение се страхува от Всемилостивия. Благовествай го за опрощение и щедра награда"},{"number":12,"text":"Ние съживяваме мъртвите. И записваме какво са направили отнапред, и следите им подир тях, и отбелязваме всичко в ясна книга"},{"number":13,"text":"И им дай пример с жителите на селището, при което дойдоха пратениците"},{"number":14,"text":"Изпратихме им двама, а те ги взеха за лъжци. Тогава ги подкрепихме с трети и рекоха: “Наистина сме изпратени при вас.”"},{"number":15,"text":"Рекоха: “Вие сте само хора като нас. Всемилостивия не е низпослал нищо. Вие само лъжете.”"},{"number":16,"text":"Рекоха [пратениците]: “Нашият Господ знае, че наистина сме изпратени при вас"},{"number":17,"text":"Наш дълг е само ясното послание.”"},{"number":18,"text":"Рекоха: “Предчувстваме злочестие от вас. Ако не престанете, ще ви пребием с камъни и ще ви сполети от нас болезнено мъчение.”"},{"number":19,"text":"Рекоха: “Злочестието ви е от самите вас. Нима да ви се напомня [е злочестие]? Вие сте престъпващи хора.”"},{"number":20,"text":"И дойде мъж от другия край на града - устремен. Рече: “О, народе мой, последвайте пратениците"},{"number":21,"text":"Последвайте онези, които не търсят отплата от вас и са на правия път"},{"number":22,"text":"И защо да не служа на Онзи, Който ме е сътворил и при Когото ще бъдете върнати"},{"number":23,"text":"Нима ще приема други богове, а не Него? Ако Всемилостивия поиска да ме сполети беда, тяхното застъпничество не ще ме избави от нищо и не ще ме спасят"},{"number":24,"text":"Тогава ще съм в явна заблуда"},{"number":25,"text":"Аз повярвах във вашия Господ [о, пратеници], чуйте ме!”"},{"number":26,"text":"Речено му бе: “Влез в Рая!” Рече: “Ах, да знаеше моят народ"},{"number":27,"text":"как ме опрости моят Господ и ме стори от удостоените!”"},{"number":28,"text":"И не изпратихме срещу народа му след него войнство от небето. Нямаше [нужда] да изпратим"},{"number":29,"text":"Бе само един Вик и ето ги - изпепелени"},{"number":30,"text":"О, горко на рабите! Не идва при тях пратеник, без да се подиграят с него"},{"number":31,"text":"Не виждат ли колко поколения преди тях погубихме? Те не ще се завърнат при тях"},{"number":32,"text":"А всички при Нас ще бъдат доведени"},{"number":33,"text":"И мъртвата земя е знамение за тях. Ние я съживяваме и изваждаме от нея зърно, от което ядат"},{"number":34,"text":"И създаваме там градини с палми и грозде, и сторваме там да бликнат извори"},{"number":35,"text":"за да ядат от техните плодове и от онова, което със своите ръце придобиват. Не ще ли бъдат признателни"},{"number":36,"text":"Пречист е Онзи, Който сътвори по двойки всичко от онова, което земята ражда, и от тях самите, и от онова, което не знаят"},{"number":37,"text":"И нощта е знамение за тях. Ние отделяме от нея деня и ето ги - в мрак"},{"number":38,"text":"И слънцето е устремено към своето местопребивание. Така е отредил Всемогъщия, Всезнаещия"},{"number":39,"text":"И на луната отредихме фази, докато заприлича на изсъхнала палмова клонка"},{"number":40,"text":"Нито слънцето може да настигне луната, нито нощта да изпревари деня. Всички по своя орбита плават"},{"number":41,"text":"И знамение за тях е, че пренесохме бащите им [с Нух] в натоварения Ковчег"},{"number":42,"text":"И създадохме за тях негови подобия, на които се возят"},{"number":43,"text":"И ако пожелаем, ще ги издавим и нито ще имат избавител, нито ще бъдат спасени"},{"number":44,"text":"освен по милост от Нас и за временна наслада"},{"number":45,"text":"И когато им се рече: “Бойте се от онова, което е било преди вас и от онова, което ще бъде след вас [в Съдния ден], за да бъдете помилвани!”"},{"number":46,"text":"и всякога, щом дойде при тях знамение от знаменията на техния Господ, те се отдръпват"},{"number":47,"text":"И когато им се рече: “Раздавайте от онова, което Аллах ви е дал!”, неверниците казват на вярващите: “Нима да храним онзи, когото, ако Аллах пожелае, би го нахранил? Вие сте в явна заблуда.”"},{"number":48,"text":"И казват: “Кога [ще се сбъдне] това обещание, ако говорите истината?”"},{"number":49,"text":"Очаква ги само един Вик, който ще ги сграбчи, както спорят"},{"number":50,"text":"И не ще съумеят нито да се разпоредят, нито при семействата си да се завърнат"},{"number":51,"text":"И ще се протръби с Рога, и ето ги - от гробовете към своя Господ се втурват"},{"number":52,"text":"Ще рекат: “О, горко ни! Кой ни възкреси от нашите гробове?” [Ще им се каже:] “Това е, което Всемилостивия обеща, и пратениците говореха истината.”"},{"number":53,"text":"Ще е само един Вик и ето ги - всички при Нас доведени"},{"number":54,"text":"Днес никой не ще бъде угнетен с нищо и ще ви се въздаде само за онова, което сте вършили"},{"number":55,"text":"Обитателите на Рая Днес ще са заети с наслади"},{"number":56,"text":"Те и съпругите им ще са на сянка, облегнати на престоли"},{"number":57,"text":"Там ще имат плодове и ще имат, каквото пожелаят"},{"number":58,"text":"[И ще им се каже:] “Мир!” - Слово от милосърдния Господ"},{"number":59,"text":"Отделете се Днес, о, престъпници"},{"number":60,"text":"Не ви ли повелих, о, синове на Адам, да не служите на сатаната? Той е ваш явен враг"},{"number":61,"text":"А на Мен да служите! Това е правият път"},{"number":62,"text":"Заблуди той много народи сред вас. Не сте ли проумели"},{"number":63,"text":"Това е Адът, който ви бе обещан"},{"number":64,"text":"Горете Днес в него, защото бяхте неверници"},{"number":65,"text":"Днес ще запечатаме устата им и ще Ни говорят ръцете им, и ще свидетелстват краката им какво са придобили"},{"number":66,"text":"И ако пожелаехме, щяхме да ги ослепим и щяха да се блъскат по пътя. Как тогава биха виждали"},{"number":67,"text":"И ако пожелаехме, на място щяхме да променим вида им и нямаше да могат нито да вървят напред, нито да се връщат"},{"number":68,"text":"И на когото дадем дълголетие, преобръщаме неговата природа. Нима не проумяват"},{"number":69,"text":"[Мухаммад] нито го научихме на поезия, нито му подобава. Това [на което го научихме] е само напомняне и ясен Коран"},{"number":70,"text":"за да предупреди онзи, който е жив, и да се сбъдне Словото спрямо неверниците"},{"number":71,"text":"Нима не виждат, че измежду онова, което Ние сътворихме за тях, създадохме добитък, а те го владеят"},{"number":72,"text":"И им го подчинихме - от него са ездитните им животни и от него ядат"},{"number":73,"text":"И от него имат други облаги, и за пиене. Не ще ли бъдат признателни"},{"number":74,"text":"И вместо Аллах приеха други богове, за да им се помогне"},{"number":75,"text":"Не могат те да им помогнат и срещу тях ще бъдат войнство, което ще бъде доведено [в Съдния ден]"},{"number":76,"text":"И да не те наскърбяват словата им! Ние най-добре знаем какво спотайват и какво разкриват"},{"number":77,"text":"Не вижда ли човекът, че Ние го сътворихме от частица сперма? А ето го - явен противник"},{"number":78,"text":"И дава той пример на Нас, а своето сътворяване забравя. И казва: “Кой ще съживи костите, след като станат на пръст?”"},{"number":79,"text":"Кажи: “Ще ги съживи Онзи, Който ги сътвори първия път. Той знае всичко как се сътворява"},{"number":80,"text":"Онзи, Който стори за вас огън от зеленото дърво и ето ви - от него палите!”"},{"number":81,"text":"А нима Онзи, Който сътвори небесата и земята, не е способен да сътвори подобни [хора]? Да! Той е Всетворящия, Всезнаещия"},{"number":82,"text":"Повелята Му, когато желае нещо, е само да му каже: “Бъди!” И то става"},{"number":83,"text":"Пречист е Онзи, в Чиито Ръце е владението на всяко нещо и при Когото ще бъдете върнати"}]}