{"number":51,"edition":"bg.theophanov","ayahs":[{"number":1,"text":"Кълна се в отвяващите с веене [ветрове]"},{"number":2,"text":"и в носещите товар [облаци]"},{"number":3,"text":"и в плаващите с лекота [кораби]"},{"number":4,"text":"и в разпределящите по повеля [ангели]"},{"number":5,"text":"че е истина това, което ви е обещано"},{"number":6,"text":"И че възмездието ще настъпи"},{"number":7,"text":"Кълна се в небето, осеяно с пътища"},{"number":8,"text":"Объркани са вашите слова [о, неверници]"},{"number":9,"text":"Отклонява се от него онзи, който е бил отклонен"},{"number":10,"text":"Проклети да са лъжците"},{"number":11,"text":"които в бездната [на неверието] нехаят"},{"number":12,"text":"Питат: “Кога ще е Съдният ден?”"},{"number":13,"text":"В този Ден върху Огъня ще бъдат измъчвани"},{"number":14,"text":"“Вкусете своето мъчение! Това е, за което бързахте.”"},{"number":15,"text":"Богобоязливите ще бъдат сред градини и извори"},{"number":16,"text":"ще взимат онова, което им дарява техният Господ. Преди това те вършеха добро"},{"number":17,"text":"малко спяха през нощта"},{"number":18,"text":"и на развиделяване молеха за опрощение"},{"number":19,"text":"и в техните имоти имаше дял за просяка и нуждаещия се"},{"number":20,"text":"За убедените на земята има знамения"},{"number":21,"text":"и в самите вас. Нима не съзирате"},{"number":22,"text":"На небето има препитание за вас и там е онова, което ви е обещано"},{"number":23,"text":"А то, кълна се в Господа на небето и на земята, е истина, както това, че говорите"},{"number":24,"text":"Стигна ли до теб разказът за почетните гости на Ибрахим"},{"number":25,"text":"Влязоха при него и рекоха: “Мир!” Каза: “Мир!” И си рече: “Непознати хора!”"},{"number":26,"text":"И без да го видят, свърна към своето семейство и дойде с тлъсто [печено] теле"},{"number":27,"text":"и им го поднесе. Рече: “Ще похапнете ли?”"},{"number":28,"text":"И спотаи страх от тях. Рекоха: “Не се страхувай!” И го благовестиха за знаещ син"},{"number":29,"text":"И пристъпи жена му с вик, удряйки лицето си, и рече: “Но аз съм бездeтна старица!”"},{"number":30,"text":"Рекоха: “Тъй каза твоят Господ. Той е Премъдрия, Всезнаещия.”"},{"number":31,"text":"Рече: “А какво ви е намерението, о, пратеници?”"},{"number":32,"text":"Рекоха: “Изпратени сме при хора-престъпници"},{"number":33,"text":"за да изсипем върху тях камъни от глина"},{"number":34,"text":"белязани при твоя Господ за прекаляващите.”"},{"number":35,"text":"И изведохме Ние само вярващите, които бяха там"},{"number":36,"text":"И намерихме там отдадени [на Аллах] само в един дом"},{"number":37,"text":"И оставихме там знамение за онези, които се страхуват от болезненото мъчение"},{"number":38,"text":"И за Муса, когато го изпратихме при Фараона с явен довод"},{"number":39,"text":"И се отвърна той със своята опора, и каза: “Магьосник или луд.”"},{"number":40,"text":"И сграбчихме него и войските му, и ги хвърлихме в морето. Вината бе негова"},{"number":41,"text":"И за адитите, срещу които изпратихме опустошителния вятър"},{"number":42,"text":"И не остави той нищо, над което премина, без да го превърне в прах"},{"number":43,"text":"И за самудяните, когато им бе казано: “Наслаждавайте се до време!”"},{"number":44,"text":"И се възгордяха пред повелята на техния Господ, [затова] мълнията ги порази, както си гледаха"},{"number":45,"text":"И не можаха да се изправят, и не им се помогна"},{"number":46,"text":"И народа на Нух [погубихме] преди. Те бяха нечестиви хора"},{"number":47,"text":"И небето изградихме с [Нашата] сила. Ние даваме простор"},{"number":48,"text":"И земята Ние разстлахме. Колко прекрасно разстиламе"},{"number":49,"text":"И от всяко нещо сътворихме двойки, за да се поучите"},{"number":50,"text":"Затова към Аллах се устремете! Аз съм Негов явен предупредител за вас"},{"number":51,"text":"И не приемайте друг Бог заедно с Аллах! Аз съм Негов явен предупредител за вас"},{"number":52,"text":"Така и онези преди тях, щом дойдеше пратеник, казваха: “Магьосник или луд.”"},{"number":53,"text":"Нима си завещаваха това един другиму? Не, ала те са престъпващи хора"},{"number":54,"text":"Отвърни се от тях и не ще бъдеш упрекван"},{"number":55,"text":"И поучавай! Наистина поучението носи полза на вярващите"},{"number":56,"text":"Сътворих Аз джиновете и хората единствено за да Ми служат"},{"number":57,"text":"Не искам от тях препитание и не искам да Ме хранят"},{"number":58,"text":"Аллах! Той е Даващия препитанието, Владетеля на силата, Всемогъщия"},{"number":59,"text":"Угнетителите имат участ като участта на техните другари. Затова да не избързват"},{"number":60,"text":"Горко на неверниците в техния Ден, който им е обещан"}]}