{"number":15,"edition":"de.khoury","ayahs":[{"number":1,"text":"Auf Lam Ra. Dies sind die Zeichen des Buches und eines deutlichen Korans"},{"number":2,"text":"Vielleicht werden diejenigen, die ungläubig sind, wünschen, sie wären Muslime gewesen"},{"number":3,"text":"Laß sie nur essen und genießen und sich durch die Hoffnung ablenken lassen. Sie werden es noch zu wissen bekommen"},{"number":4,"text":"Und Wir haben keine Stadt verderben lassen, ohne daß sie eine festgelegte Vorherbestimmung gehabt hätte"},{"number":5,"text":"Keine Gemeinschaft kann ihrer Frist vorausgehen, noch kann sie hinter ihr zurückbleiben"},{"number":6,"text":"Und sie sagen: «O du, auf den die Ermahnung herabgesandt worden sein soll, du bist ja besessen"},{"number":7,"text":"Würdest du uns doch die Engel bringen, so du zu denen gehörst, die die Wahrheit sagen!»"},{"number":8,"text":"Wir senden die Engel nur mit der Wahrheit hinab. Dann wird ihnen kein Aufschub gewährt"},{"number":9,"text":"Wir, ja Wir haben die Ermahnung hinabgesandt, und Wir werden sie gewiß bewahren"},{"number":10,"text":"Wir haben vor dir zu den Parteien der Früheren entsandt"},{"number":11,"text":"Und kein Gesandter kam zu ihnen, ohne daß sie ihn verspottet hätten"},{"number":12,"text":"So lassen Wir ihn in die Herzen der Übeltäter eingehen"},{"number":13,"text":"Sie glauben nicht daran, und es wird (an ihnen) nach dem Beispiel der Früheren verfahren"},{"number":14,"text":"Auch wenn Wir ihnen ein Tor vom Himmel öffneten und sie ständig dadurch emporstiegen"},{"number":15,"text":"Würden sie sagen: «Unsere Blicke sind ja verschlossen. Nein, wir sind Leute, die einem Zauber verfallen sind.»"},{"number":16,"text":"Und Wir haben im Himmel Sternzeichen gesetzt und ihn für die Zuschauer geschmückt"},{"number":17,"text":"Und Wir haben ihn vor jedem gesteinigten Satan bewahrt"},{"number":18,"text":"Außer dem, der wie ein Dieb horcht, worauf ihn eine deutlich erkennbare Sternschnuppe verfolgt"},{"number":19,"text":"Auch die Erde haben Wir ausgebreitet und auf ihr festgegründete Berge angebracht. Und Wir haben auf ihr allerlei Dinge im rechten Maß wachsen lassen"},{"number":20,"text":"Und Wir haben auf ihr für euch Unterhaltsmöglichkeiten bereitet, und (auch) für diejenigen, die ihr nicht versorgt"},{"number":21,"text":"Und es gibt nichts, von dem Wir nicht einen Vorrat angelegt hätten. Und Wir senden es nur in festgelegtem Maß hinab"},{"number":22,"text":"Und Wir haben die befruchtenden Winde gesandt. Und Wir haben dann vom Himmel Wasser hinabkommen lassen und es euch zu trinken gegeben. Ihr aber hättet davon keinen Vorrat anlegen können"},{"number":23,"text":"Und Wir sind es, die lebendig machen und sterben lassen, und Wir sind es, die (alles) erben"},{"number":24,"text":"Und Wir kennen diejenigen unter euch, die vorausgehen, und Wir kennen die, die zurückbleiben"},{"number":25,"text":"Und siehe, dein Herr wird sie versammeln. Er ist weise und weiß Bescheid"},{"number":26,"text":"Und Wir haben den Menschen aus einer Trockenmasse, aus einem gestaltbaren schwarzen Schlamm erschaffen"},{"number":27,"text":"Und die Djinn haben Wir vorher aus dem Feuer des glühenden Windes erschaffen"},{"number":28,"text":"Und als dein Herr zu den Engeln sprach: «Ich. werde einen Menschen aus einer Trockenmasse, aus einem gestaltbaren schwarzen Schlamm erschaffen"},{"number":29,"text":"Wenn Ich ihn geformt und ihm von meinem Geist eingeblasen habe, dann fallt und werft euch vor ihm nieder.»"},{"number":30,"text":"Da warfen sich die Engel alle zusammen nieder"},{"number":31,"text":"Außer Iblis; er weigerte sich, zu denen zu gehören, die sich niederwarfen"},{"number":32,"text":"Er sprach: «O Iblis, was ist mit dir, daß du nicht zu denen gehörst, die sich niederwarfen?»"},{"number":33,"text":"Er sagte: «Ich kann mich unmöglich vor einem Menschen niederwerfen, den Du aus einer Trockenmasse, aus einem gestaltbaren schwarzen Schlamm erschaffen hast.»"},{"number":34,"text":"Er sprach: «Dann geh aus ihm hinaus. Du bist ja der Steinigung würdig"},{"number":35,"text":"Und auf dir liegt der Fluch bis zum Tag des Gerichtes.»"},{"number":36,"text":"Er sagte: «Mein Herr, gewähre mir Aufschub bis zu dem Tag, da sie auferweckt werden.»"},{"number":37,"text":"Er sprach: «Siehe, du gehörst zu denen, denen Aufschub gewährt wird"},{"number":38,"text":"Bis zu dem Tag der festgelegten Zeit.»"},{"number":39,"text":"Er sagte: «Mein Herr, weil Du mich irregeführt hast, werde ich, ich schwöre es, ihnen auf der Erde Verlockungen bereiten und sie allesamt abirren lassen"},{"number":40,"text":"Außer deinen auserwählten Dienern unter ihnen.»"},{"number":41,"text":"Er sprach: «Das ist ein gerader Weg, der mir obliegt"},{"number":42,"text":"Was meine Diener betrifft, so hast du über sie keine Macht, außer denen unter den Abgeirrten, die dir folgen.»"},{"number":43,"text":"Und die Hölle ist der Verabredungsort für sie alle"},{"number":44,"text":"Sie hat sieben Tore, und jedem Tor wird ein Teil von ihnen zugewiesen"},{"number":45,"text":"Die Gottesfürchtigen aber werden in Gärten und an Quellen sein"},{"number":46,"text":"«Geht hinein in Frieden und Sicherheit.»"},{"number":47,"text":"Und Wir nehmen weg, was in ihrer Brust an Groll dasein mag, so daß sie wie Brüder auf Liegen ruhen, einander gegenüber"},{"number":48,"text":"Darin erfaßt sie keine Mühsal, und sie werden nicht daraus vertrieben"},{"number":49,"text":"Tu meinen Dienern kund, daß Ich der bin, der voller Vergebung und barmherzig ist"},{"number":50,"text":"Und daß meine Pein die schmerzhafte Pein ist"},{"number":51,"text":"Und berichte ihnen von den Gästen Abrahams"},{"number":52,"text":"Als sie bei ihm eintraten und sagten: «Frieden!» Er sagte: «Wir haben Angst vor euch.»"},{"number":53,"text":"Sie sagten: «Hab keine Angst. Wir verkünden dir einen klugen Knaben.»"},{"number":54,"text":"Er sagte: «Ihr verkündet (es) mir, obwohl mich das Alter erfaßt hat! Was verkündet ihr mir denn?»"},{"number":55,"text":"Sie sagten: «Wir verkünden (es) dir in Wahrheit. So sei nicht einer von denen, die die Hoffnung aufgeben.»"},{"number":56,"text":"Er sagte: «Nur die Abgeirrten geben die Hoffnung auf die Barmherzigkeit ihres Herrn auf.»"},{"number":57,"text":"Er sagte: «Was ist euer Anliegen, ihr Boten?»"},{"number":58,"text":"Sie sagten: «Wir sind zu Leuten gesandt, die Übeltäter sind"},{"number":59,"text":"Ausgenommen die Sippe Lots. Diese werden Wir sicher alle erretten"},{"number":60,"text":"Außer seiner Frau. Wir haben (es so) bestimmt, sie gehört zu denen, die zurückbleiben und dem Verderben anheimfallen.»"},{"number":61,"text":"Als nun die Boten zu der Sippe Lots kamen"},{"number":62,"text":"Sagte er: «Ihr seid unbekannte Leute.»"},{"number":63,"text":"Sie sagten: «Nein, wir kommen zu dir mit dem, was sie immer wieder bezweifelt haben"},{"number":64,"text":"Und wir kommen zu dir mit der Wahrheit. Und wir sagen, was wahr ist"},{"number":65,"text":"So zieh mit deinen Angehörigen in einem Teil der Nacht fort, und folge du hinterdrein. Und keiner von euch soll sich umdrehen. Und geht, wohin euch befohlen wird.»"},{"number":66,"text":"Und Wir haben ihm diesen Befehl mitgeteilt, daß der letzte Rest dieser Leute am Morgen ausgemerzt werde"},{"number":67,"text":"Und die Bewohner der Stadt kamen frohlockend"},{"number":68,"text":"Er sagte: «Diese sind meine Gäste, so stellt mich nicht bloß"},{"number":69,"text":"Und fürchtet Gott und bringt keine Schande über mich.»"},{"number":70,"text":"Sie sagten: «Haben wir dir nicht verboten, mit den Weltenbewohnern Umgang zu pflegen?»"},{"number":71,"text":"Er sagte: «Da sind meine Töchter, so ihr etwas tun wollt.»"},{"number":72,"text":"Bei deinem Leben, sie irrten in ihrer Trunkenheit umher"},{"number":73,"text":"So ergriff sie der Schrei bei Sonnenaufgang"},{"number":74,"text":"Und Wir kehrten in ihrer Stadt das Oberste zuunterst und ließen auf sie Steine aus Ton herabregnen"},{"number":75,"text":"Darin sind wahrlich Zeichen für die Betrachtenden"},{"number":76,"text":"Und sie liegt an einem noch bestehenden Weg"},{"number":77,"text":"Darin ist wahrlich ein Zeichen für die Gläubigen"},{"number":78,"text":"Und die Gefährten des Waldes taten Unrecht"},{"number":79,"text":"So rächten Wir uns an ihnen. Beide liegen an einem offenkundigen Wegweiser"},{"number":80,"text":"Und die Gefährten von al-Hidjr ziehen die Gesandten der Lüge"},{"number":81,"text":"Wir ließen ihnen unsere Zeichen zukommen, aber sie wandten sich von ihnen ab"},{"number":82,"text":"Und sie hauten aus den Bergen Häuser aus, um in Sicherheit zu leben"},{"number":83,"text":"Da ergriff sie der Schrei am Morgen"},{"number":84,"text":"Und so nützte ihnen, was sie zu erwerben pflegten, nicht"},{"number":85,"text":"Siehe, Wir haben die Himmel und die Erde, und was dazwischen ist, in Wahrheit erschaffen. Und die Stunde wird sicher eintreffen. So übe schöne Nachsicht"},{"number":86,"text":"Dein Herr ist es, der alles erschafft und Bescheid weiß"},{"number":87,"text":"Und Wir haben dir sieben aus den sich wiederholenden Versen zukommen lassen, und auch den gewaltigen Koran"},{"number":88,"text":"Richte nicht gierig deine Augen auf das, was Wir einigen von ihnen zur Nutznießung verliehen haben. Und sei nicht betrübt über sie. Und senke deinen Flügel für die Gläubigen"},{"number":89,"text":"Und sprich: Ich bin ja der deutliche Warner"},{"number":90,"text":"Wie Wir auf die hinabgesandt haben, die aufteilen"},{"number":91,"text":"Die den Koran zergliedert haben"},{"number":92,"text":"Bei deinem Herrn! Wir werden sie alle zur Verantwortung ziehen"},{"number":93,"text":"über das, was sie taten"},{"number":94,"text":"Und verkünde laut, was dir befohlen wird, und wende dich von den Polytheisten ab"},{"number":95,"text":"Wir schützen dich vor den Spöttern"},{"number":96,"text":"Die Gott einen anderen Gott zur Seite stellen. Sie werden es noch zu wissen bekommen"},{"number":97,"text":"Wir wissen ja, daß deine Brust beklommen ist wegen dessen, was sie sagen"},{"number":98,"text":"Aber sing das Lob deines Herrn und sei einer von denen, die sich niederwerfen"},{"number":99,"text":"Und diene deinem Herrn, bis das sichere Los dich ereilt"}]}