{"number":21,"edition":"de.khoury","ayahs":[{"number":1,"text":"Nahegerückt ist den Menschen ihre Abrechnung, während sie sich in Achtlosigkeit abwenden"},{"number":2,"text":"Keine neue Ermahnung kommt von ihrem Herrn zu ihnen, ohne daß sie sie hören, während sie sich dem Spiel hingeben"},{"number":3,"text":"Und ihre Herzen zerstreut sind. Und sie äußern insgeheim im vertraulichen Gespräch - sie, die Unrecht tun: «Ist dieser etwas anderes als ein Mensch wie ihr? Wollt ihr euch denn sehenden Auges der Zauberei hingeben?»"},{"number":4,"text":"Sprich: Mein Herr weiß, was im Himmel und auf der Erde gesagt wird. Er ist der, der alles hört und weiß"},{"number":5,"text":"Aber nein, sie sagen: «Wirres Bündel von Träumen. Nein, er hat ihn erdichtet. Nein, er ist ja ein Dichter. Er soll uns ein Zeichen bringen, sowie die Früheren gesandt worden sind.»"},{"number":6,"text":"Nie hat vor ihnen eine Stadt, die Wir verderben ließen, geglaubt. Werden gerade sie nun glauben"},{"number":7,"text":"Und Wir haben vor dir nur Männer gesandt, denen Wir Offenbarungen eingegeben haben. So fragt die Besitzer der Ermahnung, wenn ihr nicht Bescheid wißt"},{"number":8,"text":"Wir haben die nicht zu Körpern gemacht, die keine Speise essen, und sie waren nicht ewig"},{"number":9,"text":"Dann haben Wir ihnen das Versprechen wahr gemacht. So haben Wir sie und die, die Wir wollen, gerettet und die Maßlosen vernichtet"},{"number":10,"text":"Wir haben ein Buch zu euch hinabgesandt, in dem eure Ermahnung steht. Habt ihr denn keinen Verstand"},{"number":11,"text":"Wie manche Stadt, die Unrecht tat, haben Wir zerstört und haben nach ihr ein anderes Volk entstehen lassen"},{"number":12,"text":"Und als sie unsere Schlagkraft spürten, da fingen sie an, davor wegzulaufen"},{"number":13,"text":"«Lauft nicht weg und kehrt zu dem euch verliehenen üppigen Leben und zu euren Wohnungen zurück. Vielleicht werdet ihr zur Verantwortung gezogen.»"},{"number":14,"text":"Sie sagten: «Wehe uns! Wir haben ja Unrecht getan.»"},{"number":15,"text":"Das war ständig ihr Ruf, bis Wir sie zum abgemähten Land machten und sie ausgelöscht dalagen"},{"number":16,"text":"Und Wir haben den Himmel und die Erde, und was zwischen ihnen ist, nicht zum Spiel erschaffen"},{"number":17,"text":"Hätten Wir uns eine Zerstreuung nehmen wollen, dann hätten Wir sie von Uns aus genommen - wenn Wir das überhaupt hätten tun wollen"},{"number":18,"text":"Nein, Wir schleudern die Wahrheit gegen das Falsche, und sie zerschmettert ihm das Haupt, und siehe da, es schwindet dahin. Und wehe euch wegen dessen, was ihr da schildert"},{"number":19,"text":"Ihm gehört, wer in den Himmeln und auf der Erde ist. Diejenigen, die bei Ihm sind, weigern sich nicht hochmütig, Ihm zu dienen, und werden darin nicht müde"},{"number":20,"text":"Sie preisen (Ihn) Nacht und Tag, und sie lassen nicht nach"},{"number":21,"text":"Oder haben sie sich Götter aus der Erde genommen, die auferstehen lassen können"},{"number":22,"text":"Gäbe es in ihnen beiden andere Götter als Gott, würden sie (beide) verderben. Preis sei Gott, dem Herrn des Thrones! (Er ist erhaben) über das, was sie schildern"},{"number":23,"text":"Er wird nicht zur Verantwortung gezogen für das, was Er tut; sie aber werden zur Verantwortung gezogen"},{"number":24,"text":"Oder haben sie sich außer Ihm Götter genommen? Sprich: Bringt her euren Beweis. Das ist die Ermahnung derer, die mit mir sind, und die Ermahnung derer, die vor mir lebten. Aber die meisten von ihnen kennen die Wahrheit nicht, so wenden sie sich ab"},{"number":25,"text":"Und Wir haben keinen Gesandten vor dir geschickt, dem Wir nicht offenbart hätten: «Es gibt keinen Gott außer Mir, so dienet Mir.»"},{"number":26,"text":"Und sie sagen: «Der Erbarmer hat sich ein Kind genommen.» Preis sei Ihm! Nein, es sind nur Diener, denen Ehre erwiesen worden ist"},{"number":27,"text":"Sie kommen Ihm im Sprechen nicht zuvor, und nach seinem Befehl handeln sie"},{"number":28,"text":"Er weiß, was vor ihnen und was hinter ihnen liegt, und sie legen Fürsprache nur für den ein, der Ihm genehm ist. Und sie erschrecken aus Furcht vor Ihm"},{"number":29,"text":"Und wer von ihnen sagen sollte: «Ich bin Gott neben Ihm», dem vergelten Wir mit der Hölle. So vergelten Wir denen, die Unrecht tun"},{"number":30,"text":"Haben denn diejenigen, die ungläubig sind, nicht gesehen, daß die Himmel und die Erde eine einzige Masse waren? Da haben Wir sie getrennt und alles Lebendige aus dem Wasser gemacht. Wollen sie denn nicht glauben"},{"number":31,"text":"Und Wir haben auf der Erde festgegründete Berge gemacht, daß sie nicht mit ihnen schwanke. Und Wir haben auf ihr breite Durchgänge als Wege gemacht, auf daß sie der Rechtleitung folgen"},{"number":32,"text":"Und Wir haben den Himmel zu einer wohlbehüteten Decke gemacht. Aber sie wenden sich von seinen Zeichen ab"},{"number":33,"text":"Und Er ist es, der die Nacht und den Tag, die Sonne und den Mond erschaffen hat; jedes Gestirn nimmt seinen Lauf in einer (eigenen) Sphäre"},{"number":34,"text":"Und Wir haben für keinen Menschen vor dir bestimmt, ewig zu leben. Wenn du nun stirbst, sollten sie dann ewig leben"},{"number":35,"text":"Jeder wird den Tod erleiden. Und Wir prüfen euch mit Bösem und Gutem und setzen euch damit der Versuchung aus. Und zu Uns werdet ihr zurückgebracht"},{"number":36,"text":"Und wenn diejenigen, die ungläubig sind, dich sehen, nehmen sie dich nur zum Gegenstand des Spottes: «Ist das der, der über eure Götter spricht?» Und sie, sie glauben nicht an die Ermahnung des Erbarmers"},{"number":37,"text":"Der Mensch ist aus Eilfertigkeit erschaffen worden. Ich werde euch schon meine Zeichen sehen lassen; so wünscht nicht von Mir, es zu beschleunigen"},{"number":38,"text":"Und sie sagen: «Wann wird diese Androhung eintreten, so ihr die Wahrheit sagt?»"},{"number":39,"text":"Wenn diejenigen, die ungläubig sind, es nur wüßten, wenn sie das Feuer weder von ihren Gesichtern noch von ihren Rücken abhalten können und auch keine Unterstützung erfahren"},{"number":40,"text":"Nein, es wird sie plötzlich überkommen und sie überraschen. Sie werden es nicht abwehren können, und es wird ihnen kein Aufschub gewährt"},{"number":41,"text":"Gespottet wurde schon vor dir über Gesandte. Da umschloß diejenigen, die sie verhöhnt hatten, das, worüber sie spotteten"},{"number":42,"text":"Sprich: Wer behütet euch bei Nacht und bei Tag vor dem Erbarmer? Aber nein, sie wenden sich von der Ermahnung ihres Herrn ab"},{"number":43,"text":"Oder haben sie etwa Götter, die sie vor Uns schützen können? Sie können doch sich selbst nicht helfen, und sie werden keinen Beistand gegen Uns erhalten"},{"number":44,"text":"Nein, Wir haben diese da und ihre Väter genießen lassen, bis sie ein hohes Alter erreicht haben. Haben sie denn nicht gesehen, daß Wir über das Land kommen und es an seinen Enden kürzen? Werden nun sie die Sieger sein"},{"number":45,"text":"Sprich: Ich warne euch nur mit der Offenbarung. Aber Taube hören nicht den Ruf, wenn sie gewarnt werden"},{"number":46,"text":"Und wenn ein Hauch von der Pein deines Herrn sie berührt, sagen sie gewiß: «O wehe uns! Wir haben ja Unrecht getan.»"},{"number":47,"text":"Und Wir stellen die gerechten Waagen für den Tag der Auferstehung auf. So wird keiner Seele in irgend etwas Unrecht getan. Und wäre es auch das Gewicht eines Senfkornes, Wir bringen es bei. Und Wir genügen für die Abrechnung"},{"number":48,"text":"Und Wir haben Mose und Aaron die Unterscheidungsnorm zukommen lassen, und ein Licht und eine Ermahnung für die Gottesfürchtigen"},{"number":49,"text":"Die ihren Herrn im Verborgenen fürchten und vor der Stunde erschrecken"},{"number":50,"text":"Und dies ist eine gesegnete Ermahnung, die Wir hinabgesandt haben. Wollt ihr sie denn verwerfen"},{"number":51,"text":"Und Wir haben zuvor Abraham zu seinem rechten Verhalten geleitet. Und Wir wußten über ihn Bescheid"},{"number":52,"text":"Als er zu seinem Vater und seinem Volk sagte: «Was sind das für Bildwerke, die ihr verehrt?»"},{"number":53,"text":"Sie sagten: «Wir fanden, daß bereits unsere Väter ihnen dienten.»"},{"number":54,"text":"Er sagte: «Ihr und eure Väter befindet euch in einem offenkundigen Irrtum.»"},{"number":55,"text":"Sie sagten: «Bringst du uns die Wahrheit, oder gehörst du zu denen, die ihr Spiel treiben?»"},{"number":56,"text":"Er sagte: «Nein, euer Herr ist der Herr der Himmel und der Erde, der sie erschaffen hat. Und ich bin einer von denen, die euch das bezeugen"},{"number":57,"text":"Und bei Gott, ich werde gegen eure Götter mit einer List vorgehen, nachdem ihr den Rücken gekehrt habt.»"},{"number":58,"text":"Da schlug er sie in Stücke, außer einem großen unter ihnen, auf daß sie sich zu ihm wandten"},{"number":59,"text":"Sie sagten: «Wer hat dies mit unseren Göttern getan? Wahrlich, er gehört zu denen, die Unrecht tun.»"},{"number":60,"text":"Sie sagten: «Wir hörten einen Jüngling von ihnen sprechen; man nennt ihn Abraham.»"},{"number":61,"text":"Sie sagten: «Bringt ihn her vor den Augen der Menschen. Vielleicht bezeugen sie es.»"},{"number":62,"text":"Sie sagten: «Hast du dies mit unseren Göttern getan, o Abraham?»"},{"number":63,"text":"Er sagte: «Nein, getan hat das dieser da, der Größte unter ihnen. Fragt sie, so sie reden können.»"},{"number":64,"text":"Sie kamen wieder zu sich und sagten: «Ihr seid ja die, die Unrecht tun.»"},{"number":65,"text":"Dann machten sie eine Kehrtwende: «Du weißt doch, daß diese nicht reden können.»"},{"number":66,"text":"Er sagte: «Wie könnt ihr anstelle Gottes das verehren, was euch nichts nützen und nichts schaden kann"},{"number":67,"text":"Pfui über euch und über das, was ihr anstelle Gottes verehrt! Habt ihr denn keinen Verstand?»"},{"number":68,"text":"Sie sagten: «Verbrennt ihn und helft euren Göttern, so ihr etwas tun wollt.»"},{"number":69,"text":"Wir sprachen: «O Feuer, sei kühl und harmlos für Abraham.»"},{"number":70,"text":"Sie wollten mit einer List gegen ihn vorgehen. Da machten Wir, daß sie die waren, die den größten Verlust hatten"},{"number":71,"text":"Und Wir erretteten ihn und Lot in das Land, das Wir für die Weltenbewohner gesegnet haben"},{"number":72,"text":"Und Wir schenkten ihm Isaak und Jakob dazu. Und jeden machten Wir rechtschaffen"},{"number":73,"text":"Und Wir machten sie zu Vorbildern, die (die Menschen) nach unserem Befehl leiteten. Und Wir offenbarten ihnen, die guten Werke zu tun, das Gebet zu verrichten und die Abgabe zu entrichten. Und Uns haben sie gedient"},{"number":74,"text":"Und dem Lot ließen Wir Urteilskraft und Wissen zukommen. Und Wir erretteten ihn aus der Stadt, die die schlechten Taten zu begehen pflegte. Sie waren ja böse Leute und Frevler"},{"number":75,"text":"Und Wir ließen ihn in unsere Barmherzigkeit eingehen. Wahrlich, er gehört zu den Rechtschaffenen"},{"number":76,"text":"Und (erwähne) Noach, als er zuvor rief. Da erhörten Wir ihn und erretteten ihn und seine Angehörigen aus der großen Drangsal"},{"number":77,"text":"Und Wir unterstützten ihn gegen die Leute, die unsere Zeichen für Lüge erklärten. Sie waren ja böse Leute. So ließen Wir sie allesamt ertrinken"},{"number":78,"text":"Und (erwähne) David und Salomo, als sie über das Saatfeld urteilten. Darin waren die Schafe der Leute nachts eingebrochen und hatten sich ausgebreitet. Und Wir waren bei ihrem Urteil zugegen"},{"number":79,"text":"Und Wir ließen Salomo die Sache begreifen. Und jedem ließen Wir Urteilskraft und Wissen zukommen. Und Wir machten dem David die Berge dienstbar, daß sie (Uns) preisen, und (auch) die Vögel. Ja, Wir haben es getan"},{"number":80,"text":"Und Wir lehrten ihn die Herstellung von Panzerkleidung für euch, damit sie euch vor eurer (gegenseitigen) Schlagkraft schütze. Wollt ihr denn nicht dankbar sein"},{"number":81,"text":"Und dem Salomo (machten Wir dienstbar) den Wind als Sturm, daß er nach seinem Befehl zum Land eile, das Wir gesegnet haben - und Wir wußten über alle Dinge Bescheid"},{"number":82,"text":"Und auch unter den Satanen welche, die für ihn tauchten und noch andere Arbeiten verrichteten; und Wir überwachten sie"},{"number":83,"text":"Und (erwähne) Ijob, als er zu seinem Herrn rief: «Mich hat Schaden getroffen, und Du bist der Barmherzigste der Barmherzigen.»"},{"number":84,"text":"Da erhörten Wir ihn und behoben den Schaden, den er erlitten hatte. Und Wir gaben ihm seine Angehörigen (wieder) und noch einmal die gleiche Zahl dazu, aus Barmherzigkeit von Uns und als Ermahnung für die, die (Uns) dienen"},{"number":85,"text":"Und (erwähne) Ismael und Idris und Dhul-Kifl. Jeder (von ihnen) gehörte zu den Geduldigen"},{"number":86,"text":"Und Wir ließen sie in unsere Barmherzigkeit eingehen. Wahrlich, sie gehören zu den Rechtschaffenen"},{"number":87,"text":"Und (erwähne) den Mann mit dem Fisch. Als er erzürnt wegging und meinte, Wir könnten ihn nicht überwältigen. Und er rief in den Finsternissen: «Es gibt keinen Gott außer Dir. Preis sei Dir! Ich war einer von denen, die Unrecht tun.»"},{"number":88,"text":"Da erhörten Wir ihn und erretteten ihn aus der Trübsal. So retten Wir die Gläubigen"},{"number":89,"text":"Und (erwähne) Zakaria, als er zu seinem Herrn rief: «Mein Herr, laß mich nicht kinderlos bleiben. Und Du bist der beste der Erben.»"},{"number":90,"text":"Da erhörten Wir ihn und schenkten ihm Yahyaa und machten ihm seine Gattin wieder fruchtbar. Sie eilten zu den guten Dingen um die Wette und riefen zu Uns in Verlangen und Ehrfurcht, und sie waren vor Uns demütig"},{"number":91,"text":"Und (erwähne) die, die ihre Scham unter Schutz stellte. Da bliesen Wir in sie von unserem Geist, und Wir machten sie und ihren Sohn zu einem Zeichen für die Weltenbewohner"},{"number":92,"text":"«Diese eure Gemeinschaft ist eine einzige Gemeinschaft. Und ich bin euer Herr, so dienet Mir.»"},{"number":93,"text":"Aber sie spalteten sich in ihrer Angelegenheit untereinander. Doch sie werden alle zu Uns zurückkehren"},{"number":94,"text":"Wer etwas von den guten Werken tut und dabei gläubig ist, der wird für sein Mühen nicht Undank ernten; Wir schreiben es ihm gut"},{"number":95,"text":"Und ein Verbot liegt über einer Stadt, die Wir verderben ließen: Sie kehren nicht zurück"},{"number":96,"text":"Bis der (Damm von) Gog und Magog eröffnet wird, sie von allen Anhöhen herbeieilen"},{"number":97,"text":"Und die wahrhaftige Drohung naherückt. Dann werden die Blicke derer, die ungläubig sind, starr werden: «O wehe uns! Wir ließen es unbeachtet. Ja, wir haben Unrecht getan.»"},{"number":98,"text":"«Ihr und das, was ihr anstelle Gottes verehrt, seid Brennstoff der Hölle. Ihr werdet dahin wie zur Tränke gehen"},{"number":99,"text":"Wären diese da Götter, wären sie nicht darin wie zur Tränke gegangen.» Und alle werden darin ewig weilen"},{"number":100,"text":"Sie werden darin seufzen, aber selbst darin nichts hören"},{"number":101,"text":"Diejenigen, für die das Beste von Uns her vorausbestimmt ist, werden von ihr ferngehalten"},{"number":102,"text":"Sie hören nicht (einmal) ihr leisestes Geräusch. Und sie werden in dem, was ihre Seelen begehrt haben, ewig weilen"},{"number":103,"text":"Der große Schrecken macht sie nicht traurig, und die Engel empfangen sie: «Das ist euer Tag, der euch versprochen wurde.»"},{"number":104,"text":"Am Tag, an dem Wir den Himmel zusammenfalten, wie das Urkundenbuch die Schriftstücke zusammenfaltet. Wie Wir eine erste Schöpfung am Anfang gemacht haben, wiederholen Wir sie. Das ist ein Uns obliegendes Versprechen. Ja, Wir werden es tun"},{"number":105,"text":"Und Wir haben in der Schrift nach der Ermahnung geschrieben, daß meine rechtschaffenen Diener das Land erben werden"},{"number":106,"text":"In diesem ist eine Botschaft an Leute, die (Uns) dienen"},{"number":107,"text":"Und Wir haben dich nur als eine Barmherzigkeit für die Weltenbewohner gesandt"},{"number":108,"text":"Sprich: Mir wird wahrlich offenbart, daß euer Gott ein einziger Gott ist. Wollt ihr denn nicht gottergeben sein"},{"number":109,"text":"Wenn sie sich abkehren, dann sprich: Ich habe es euch so angekündigt, daß zwischen uns Gleichheit besteht. Und ich weiß nicht, ob das, was euch angedroht wird, nahe ist oder fernliegt"},{"number":110,"text":"Er weiß, was an Worten laut geäußert wird, und Er weiß, was ihr verschweigt"},{"number":111,"text":"Und ich weiß nicht, ob es vielleicht nur eine Versuchung für euch ist und eine Nutznießung für eine Weile"},{"number":112,"text":"Er sprach: Mein Herr, urteile nach der Wahrheit. Und unser Herr ist der Erbarmer, der um Hilfe gebeten wird gegen das, was ihr schildert"}]}