{"number":51,"edition":"de.khoury","ayahs":[{"number":1,"text":"Bei denen, die heftig aufwirbeln"},{"number":2,"text":"Bei denen, die eine Last tragen"},{"number":3,"text":"Bei denen, die leicht dahinziehen"},{"number":4,"text":"Bei denen, die verschiedene Befehle ausführen"},{"number":5,"text":"Siehe, was euch angedroht ist, ist wahr"},{"number":6,"text":"Und das Gericht wird eintreffen"},{"number":7,"text":"Beim Himmel voller Adern"},{"number":8,"text":"Ihr haltet unterschiedliche Reden"},{"number":9,"text":"Der wird davon abwendig gemacht, wer sich abwenden läßt"},{"number":10,"text":"Dem Tod geweiht seien die, die nur Schätzungen anstellen"},{"number":11,"text":"Die sich in abgründiger Achtlosigkeit befinden"},{"number":12,"text":"Sie fragen: «Wann wird denn der Tag des Gerichtes sein?»"},{"number":13,"text":"«Am Tag, da sie im Feuer geprüft werden"},{"number":14,"text":"Kostet nun eure Prüfung. Das ist es, was ihr zu beschleunigen wünschtet.»"},{"number":15,"text":"Die Gottesfürchtigen aber werden in Gärten und an Quellen sein"},{"number":16,"text":"Sie nehmen, was ihr Herr ihnen zukommen läßt. Sie waren ja vordem rechtschaffen"},{"number":17,"text":"Nur ein wenig schliefen sie in der Nacht"},{"number":18,"text":"Und in der Morgendämmerung baten sie um Vergebung"},{"number":19,"text":"Und sie räumten dem Bettler und dem Unbemittelten ein Recht auf ihr Vermögen ein"},{"number":20,"text":"Und auf der Erde gibt es Zeichen für die, die Gewißheit hegen"},{"number":21,"text":"Und auch in euch selbst. Wollt ihr denn nicht sehen"},{"number":22,"text":"Und im Himmel ist euer Lebensunterhalt und das, was euch versprochen wird"},{"number":23,"text":"Beim Herrn des Himmels und der Erde, das ist so wahr, wie ihr reden könnt"},{"number":24,"text":"Ist denn die Geschichte von den geehrten Gästen Abrahams zu dir gelangt"},{"number":25,"text":"Als sie bei ihm eintraten und sagten: «Friede!» Er sagte: «Friede! Lauter unbekannte Leute.»"},{"number":26,"text":"Er schlich sich zu seinen Angehörigen. Er brachte ein (gebratenes) Mastkalb herbei"},{"number":27,"text":"Und setzte es ihnen vor. Er sagte: «Wollt ihr nicht essen?»"},{"number":28,"text":"Er empfand Angst vor ihnen. Sie sagten: «Hab keine Angst.» Und sie verkündeten ihm einen klugen Knaben"},{"number":29,"text":"Da kam seine Frau schreiend herbei. Sie schlug sich ins Gesicht und sagte: «Eine unfruchtbare alte Frau!»"},{"number":30,"text":"Sie sagten: «So hat dein Herr gesprochen. Er ist der, der weise ist und Bescheid weiß.»"},{"number":31,"text":"Er sagte: «Was ist euer Anliegen, ihr Boten?»"},{"number":32,"text":"Sie sagten: «Wir sind gesandt zu Leuten, die Übeltäter sind"},{"number":33,"text":"Um über sie Steine aus Ton niederkommen zu lassen"},{"number":34,"text":"Die bei deinem Herrn gekennzeichnet sind für die Maßlosen.»"},{"number":35,"text":"Und Wir brachten die, die in ihr gläubig waren, hinaus"},{"number":36,"text":"Aber Wir fanden in ihr nur ein (einziges) Haus von Gottergebenen"},{"number":37,"text":"Und Wir hinterließen in ihr ein Zeichen für diejenigen, die die schmerzhafte Pein fürchten"},{"number":38,"text":"(Ein Zeichen ist) auch in Mose, als Wir ihn mit einer offenkundigen Ermächtigung zu Pharao sandten"},{"number":39,"text":"Der kehrte sich ab samt seiner Streitmacht und sagte: «Ein Zauberer oder ein Besessener.»"},{"number":40,"text":"Da ergriffen Wir ihn und seine Truppen und warfen sie ins Meer. Er hatte sich Tadel zugezogen"},{"number":41,"text":"Und auch in den Aad, als Wir über sie den lebensfeindlichen Wind sandten"},{"number":42,"text":"Der nichts von allem, worüber er kam, übrigließ, ohne es werden zu lassen wie etwas, was auseinanderfällt"},{"number":43,"text":"Und auch in den Thamud, als zu ihnen gesprochen wurde: «Genießt für eine Weile.»"},{"number":44,"text":"Sie rebellierten gegen den Befehl ihres Herrn. Da ergriff sie der Donnerschlag, während sie hinschauten"},{"number":45,"text":"Und sie konnten sich nicht mehr aufrichten und erfuhren keine Unterstützung mehr"},{"number":46,"text":"(Verderben ließen Wir) früher auch das Volk Noachs. Das waren frevlerische Leute"},{"number":47,"text":"Und den Himmel haben Wir mit Kraft aufgebaut. Und Wir verfügen über breite Möglichkeiten"},{"number":48,"text":"Und die Erde haben Wir ausgebreitet. Wie trefflich haben Wir sie geebnet"},{"number":49,"text":"Und von allem haben Wir ein Paar erschaffen, auf daß ihr es bedenket"},{"number":50,"text":"Flüchtet nun zu Gott. Ich bin euch von Ihm ein deutlicher Warner"},{"number":51,"text":"Und setzt nicht Gott einen anderen Gott zur Seite. Ich bin euch von Ihm ein deutlicher Warner"},{"number":52,"text":"So ist auch zu denen, die vor ihnen lebten, kein Gesandter gekommen, ohne daß sie gesagt hätten: «Ein Zauberer oder ein Besessener.»"},{"number":53,"text":"Haben sie es denn einander (als Vermächtnis) aufgetragen? Nein, sie sind Leute, die ein Übermaß an Frevel zeigen"},{"number":54,"text":"So kehre dich von ihnen ab. Du ziehst dir damit keinen Tadel zu"},{"number":55,"text":"Und ermahne, denn die Ermahnung nützt den Gläubigen"},{"number":56,"text":"Und Ich habe die Djinn und die Menschen nur dazu erschaffen, daß sie Mir dienen"},{"number":57,"text":"Ich will von ihnen keinen Unterhalt, und Ich will nicht, daß sie Mir zu essen geben"},{"number":58,"text":"Gott ist es, der Unterhalt beschert und Kraft und Festigkeit besitzt"},{"number":59,"text":"Für diejenigen, die Unrecht tun, ist ein Los bestimmt wie das Los ihrer Gefährten. So sollen sie Mich nicht um Beschleunigung bitten"},{"number":60,"text":"Wehe denen, die ungläubig sind, vor ihrem Tag, der ihnen angedroht ist"}]}