{"number":53,"edition":"de.khoury","ayahs":[{"number":1,"text":"Beim Stern, wenn er fällt"},{"number":2,"text":"Euer Gefährte geht nicht irre und ist nicht einem Irrtum erlegen"},{"number":3,"text":"Und er redet nicht aus eigener Neigung"},{"number":4,"text":"Es ist nichts anderes als eine Offenbarung, die offenbart wird"},{"number":5,"text":"Belehrt hat ihn einer, der starke Kräfte hat"},{"number":6,"text":"Der Macht besitzt. Er stand aufrecht da"},{"number":7,"text":"Am obersten Horizont"},{"number":8,"text":"Dann kam er näher und stieg nach unten"},{"number":9,"text":"So daß er (nur) zwei Bogenlängen entfernt war oder noch näher"},{"number":10,"text":"Da offenbarte Er seinem Diener, was Er offenbarte"},{"number":11,"text":"Sein Herz hat nicht gelogen, was er sah"},{"number":12,"text":"Wollt ihr denn mit ihm streiten über das, was er sieht"},{"number":13,"text":"Und er sah ihn ein anderes Mal herabkommen"},{"number":14,"text":"Beim Zizyphusbaum am Ende des Weges"},{"number":15,"text":"Bei dem der Garten der Heimstätte ist"},{"number":16,"text":"Als den Zizyphusbaum bedeckte, was (ihn) bedeckte"},{"number":17,"text":"Da wich der Blick nicht ab, und er überschritt das Maß nicht"},{"number":18,"text":"Wahrlich, er sah etwas von den größten Zeichen seines Herrn"},{"number":19,"text":"Habt ihr Laat und, Uzzaa gesehen"},{"number":20,"text":"Und auch Manaat, diese andere, die dritte"},{"number":21,"text":"Ist denn für euch das, was männlich ist, und für Ihn das, was weiblich ist, bestimmt"},{"number":22,"text":"Das wäre dann eine ungerechte Verteilung"},{"number":23,"text":"Das sind nur Namen, die ihr genannt habt, ihr und eure Väter, für die Gott aber keine Ermächtigung herabgesandt hat. Sie folgen nur Vermutungen und dem, wozu ihre Seelen neigen, wo doch die Rechtleitung von ihrem Herrn zu ihnen gekommen ist"},{"number":24,"text":"Oder kann denn der Mensch haben, was er wünscht"},{"number":25,"text":"Ja, Gott gehört das Jenseits und das Diesseits"},{"number":26,"text":"Und wie manche Engel gibt es in den Himmeln, deren Fürsprache nichts nützt, außer nachdem Gott es einem erlaubt hat, den Er will und der sein Gefallen hat"},{"number":27,"text":"Diejenigen, die an das Jenseits nicht glauben, geben den Engeln Namen, wie man sie weiblichen Wesen gibt"},{"number":28,"text":"Sie haben jedoch kein Wissen darüber. Sie folgen nur Vermutungen. Aber die Vermutungen nützen in bezug auf die Wahrheit nichts"},{"number":29,"text":"Wende dich nun ab von dem, der sich von unserer Ermahnung abkehrt und nur das diesseitige Leben will"},{"number":30,"text":"Das ist, was sie vom Wissen erreicht haben. Dein Herr weiß besser, wer von seinem Weg abirrt, und Er weiß besser, wer der Rechtleitung folgt"},{"number":31,"text":"Gott gehört, was in den Himmeln und was auf der Erde ist, auf daß Er denen, die Böses tun, vergelte für das, was sie tun, und daß Er denen, die Gutes tun, mit dem Allerbesten vergelte"},{"number":32,"text":"Diejenigen, die die schweren Sünden und die schändlichen Taten meiden, abgesehen von leichten Verfehlungen... Wahrlich, dein Herr hat eine umfassende Vergebung. Er weiß besser über euch Bescheid, als Er euch aus der Erde entstehen ließ und als ihr Embryos im Leib eurer Mütter waret. So erklärt nicht euch selbst für rein. Er weiß besser, wer gottesfürchtig ist"},{"number":33,"text":"Hast du den gesehen, der sich abkehrt"},{"number":34,"text":"Und nur wenig gibt und dann (auch) aufhört"},{"number":35,"text":"Hat er etwa Wissen über das Unsichtbare, daß er (es) sehen könnte"},{"number":36,"text":"Oder wurde ihm nicht verkündet, was da steht in den Blättern des Mose"},{"number":37,"text":"Und des Abraham, der (seine Pflichten) erfüllte"},{"number":38,"text":"(Nämlich), daß keine lasttragende (Seele) die Last einer anderen tragen wird"},{"number":39,"text":"Daß für den Menschen nur das bestimmt ist, wonach er strebt"},{"number":40,"text":"Daß sein Streben sichtbar werden wird"},{"number":41,"text":"Und daß ihm hierauf voll dafür vergolten wird"},{"number":42,"text":"Daß das Ende des Weges zu Gott führt"},{"number":43,"text":"Daß Er lachen und weinen läßt"},{"number":44,"text":"Und daß Er sterben läßt und wieder lebendig macht"},{"number":45,"text":"Daß Er beide Geschlechter, das männliche und das weibliche, erschafft"},{"number":46,"text":"Aus einem Samentropfen, wenn er sich ergießt"},{"number":47,"text":"Und daß Ihm die zweite Schöpfung obliegt"},{"number":48,"text":"Daß Er reich macht und Besitz schenkt"},{"number":49,"text":"Und daß Er der Herr des Sirius ist"},{"number":50,"text":"Und daß Er die Aad, die damals lebten, verderben ließ"},{"number":51,"text":"Und auch die Thamud, wobei Er nichts übrigließ"},{"number":52,"text":"Und vorher das Volk Noachs - sie waren ja Leute, die noch mehr Unrecht taten und das Übermaß ihres Frevels noch steigerten"},{"number":53,"text":"Und daß Er die verschwundene Stadt stürzen ließ"},{"number":54,"text":"So daß sie bedeckte, was (sie dann) bedeckte"},{"number":55,"text":"Welche der Wohltaten deines Herrn willst du nun bestreiten"},{"number":56,"text":"Das ist ein Warner nach Art der früheren Warner"},{"number":57,"text":"Die nahende Stunde steht bevor"},{"number":58,"text":"Niemand außer Gott kann sie beheben"},{"number":59,"text":"Wundert ihr euch denn über diese Botschaft"},{"number":60,"text":"Und lacht, statt zu weinen"},{"number":61,"text":"Während ihr euch mit etwas anderem beschäftigt"},{"number":62,"text":"Werft euch doch vor Gott nieder und dienet (Ihm)"}]}