{"number":54,"edition":"de.khoury","ayahs":[{"number":1,"text":"Nahegerückt ist die Stunde, und gespalten hat sich der Mond"},{"number":2,"text":"Und wenn sie ein Zeichen sehen, wenden sie sich ab und sagen: «Eine ständige Zauberei.»"},{"number":3,"text":"Und sie erklären (es) für Lüge und folgen ihren Neigungen. Doch jede Angelegenheit wird bestätigt"},{"number":4,"text":"Zu ihnen ist doch von den Berichten gekommen, was eine Zurechtweisung enthält"},{"number":5,"text":"Eine triftige Weisheit. Aber da nützen die Warnungen nicht"},{"number":6,"text":"So kehre dich von ihnen ab. Am Tag, da der Rufer zu etwas Unangenehmem ruft"},{"number":7,"text":"Und sie aus den Gräbern wie ausschwärmende Heuschrecken herauskommen, mit gesenkten Blicken"},{"number":8,"text":"Den Hals nach dem Rufer gereckt, da sagen die Ungläubigen: «Das ist ein schwerer Tag.»"},{"number":9,"text":"Schon vor ihnen hat das Volk Noachs (ihren Gesandten) der Lüge geziehen. Sie ziehen unseren Diener der Lüge und sagten: «Ein Besessener.» Und er wurde (von ihnen) zurechtgewiesen"},{"number":10,"text":"Da rief er zu seinem Herrn: «Ich bin unterlegen, so unterstütze Du (mich).»"},{"number":11,"text":"Da öffneten Wir die Tore des Himmels durch ein niederströmendes Wasser"},{"number":12,"text":"Und ließen aus der Erde Quellen hervorbrechen. Und das Wasser traf zusammen nach testgelegtem Befehl"},{"number":13,"text":"Und Wir trugen ihn auf einem Schiff mit Planken und Nägeln"},{"number":14,"text":"Das vor unseren Augen dahinfuhr. Dies als Lohn für den, der Verleugnung erfahren hatte"},{"number":15,"text":"Und Wir ließen es als Zeichen zurück. Aber gibt es denn jemanden, der es bedenkt"},{"number":16,"text":"Und wie waren dann meine Pein und meine Warnungen"},{"number":17,"text":"Und Wir haben den Koran leicht zu bedenken gemacht. Aber gibt es denn jemanden, der es bedenkt"},{"number":18,"text":"Die Aad haben (ihren Gesandten) der Lüge geziehen. Und wie waren dann meine Pein und meine Warnungen"},{"number":19,"text":"Wir sandten gegen sie an einem langwährenden unheilvollen Tag einen eiskalten Wind"},{"number":20,"text":"Der die Menschen fortriß, als wären sie Stämme entwurzelter Palmen"},{"number":21,"text":"Wie waren dann meine Pein und meine Warnungen"},{"number":22,"text":"Und Wir haben den Koran leicht zu bedenken gemacht. Aber gibt es denn jemanden, der es bedenkt"},{"number":23,"text":"Die Thamud haben die Warner der Lüge geziehen"},{"number":24,"text":"Sie sagten: «Sollen wir denn einem Menschen aus unseren Reihen, der allein dasteht, folgen? Dann befänden wir uns im Irrtum und litten an Wahnsinn"},{"number":25,"text":"Ist die Ermahnung wirklich gerade ihm aus unserer Mitte überbracht worden? Nein, vielmehr ist er ein überheblicher Lügner.»"},{"number":26,"text":"Morgen werden sie zu wissen bekommen, wer der überhebliche Lügner ist"},{"number":27,"text":"Wir werden die Kamelstute schicken als Versuchung für sie. So beobachte sie und sei geduldig"},{"number":28,"text":"Und gib ihnen kund, daß das Wasser zwischen ihnen zu teilen ist. Jede Trinkzeit soll (dann abwechselnd) wahrgenommen werden"},{"number":29,"text":"Sie aber riefen ihren Gefährten her. Er griff zu und schnitt (der Kamelstute) die Flechsen durch und stach sie"},{"number":30,"text":"Wie waren dann meine Pein und meine Warnungen"},{"number":31,"text":"Wir sandten über sie einen einzigen Schrei, da waren sie plötzlich wie das dürre Zeug dessen, der Tiergehege baut"},{"number":32,"text":"Und Wir haben den Koran leicht zu bedenken gemacht. Aber gibt es denn jemanden, der es bedenkt"},{"number":33,"text":"Das Volk Lots hat die Warner der Lüge geziehen"},{"number":34,"text":"Wir sandten einen Steinregen über sie, ausgenommen die Angehörigen Lots. Wir erretteten sie im Morgengrauen"},{"number":35,"text":"Aus Gnade von Uns. So entlohnen Wir den, der dankbar ist"},{"number":36,"text":"Er hatte sie vor unserem gewaltigen Zugriff gewarnt. Aber sie bestritten die Warnungen"},{"number":37,"text":"Sie versuchten ihn in bezug auf seine Gäste zu überreden. Da wischten Wir ihre Augen aus. «Kostet nun meine Pein und meine Warnungen.»"},{"number":38,"text":"Und am Morgen ereilte sie eine beständige Pein"},{"number":39,"text":"«Kostet nun meine Pein und meine Warnungen.»"},{"number":40,"text":"Und Wir haben den Koran leicht zu bedenken gemacht. Aber gibt es denn jemanden, der es bedenkt"},{"number":41,"text":"Und (auch) zu den Leuten Pharaos kamen die Warnungen"},{"number":42,"text":"Aber sie erklärten alle unsere Zeichen für Lüge. Da ergriffen Wir sie, wie ein Starker und Mächtiger ergreift"},{"number":43,"text":"Sind etwa eure Ungläubigen besser als jene? Oder habt ihr einen Freispruch in den Schriften"},{"number":44,"text":"Oder sagen sie: «Wir sind eine Schar, die siegen wird»"},{"number":45,"text":"Die Schar wird in die Flucht geschlagen werden, und sie werden den Rücken kehren"},{"number":46,"text":"Nein, die Stunde ist ihre Verabredungszeit. Und die Stunde ist noch unheilvoller und bitterer"},{"number":47,"text":"Die Übeltäter befinden sich im Irrtum und leiden an Wahnsinn"},{"number":48,"text":"Am Tag, da sie auf ihren Gesichtern ins Feuer hineingezerrt werden: «Kostet die Berührung des Höllenbrandes.»"},{"number":49,"text":"Wir haben alle Dinge nach Maß erschaffen"},{"number":50,"text":"Und unser Befehl ist ein einziges Wort, gleich einem schnellen Blick"},{"number":51,"text":"Und Wir haben doch (früher) euresgleichen verderben lassen. Gibt es denn jemanden, der es bedenkt"},{"number":52,"text":"Alles, was sie getan haben, steht in den Schriften"},{"number":53,"text":"Alles, ob klein oder groß, ist zeilenweise niedergeschrieben"},{"number":54,"text":"Die Gottesfürchtigen werden in Gärten und an Bächen sein"},{"number":55,"text":"Auf einem wahrhaftigen Sitzplatz, bei einem mächtigen König"}]}