{"number":68,"edition":"de.khoury","ayahs":[{"number":1,"text":"Nun. Bei dem Schreibrohr und (bei) dem, was sie zeilenweise niederschreiben"},{"number":2,"text":"Du bist dank der Gnade deines Herrn kein Besessener"},{"number":3,"text":"Bestimmt ist für dich ein Lohn, der nicht aufhört"},{"number":4,"text":"Und du besitzt großartige Charakterzüge"},{"number":5,"text":"Du wirst schauen, und auch sie werden schauen"},{"number":6,"text":"Wer von euch der Versuchung ausgesetzt ist"},{"number":7,"text":"Dein Herr weiß besser, wer von seinem Weg abirrt, und Er weiß besser, wer die sind, die der Rechtleitung folgen"},{"number":8,"text":"So gehorche nicht denen, die (die Botschaft) für Lüge erklären"},{"number":9,"text":"Sie möchten gern, daß du nur schöne Worte machst, so daß auch sie schöne Worte machen können"},{"number":10,"text":"Und gehorche niemandem, der dauernd schwört und verächtlich dasteht"},{"number":11,"text":"Der ständig stichelt und Verleumdungen verbreitet"},{"number":12,"text":"Der das Gute verweigert, Übertretungen begeht und Schuld auf sich lädt"},{"number":13,"text":"Der außerdem grobes Benehmen zeigt und ein Eindringling ist"},{"number":14,"text":"Auch wenn er Vermögen und Söhne hat"},{"number":15,"text":"Wenn ihm unsere Zeichen verlesen werden, sagt er: «Die Fabeln der Früheren.»"},{"number":16,"text":"Wir werden ihn auf der Nase mit einem Merkmal brandmarken"},{"number":17,"text":"Wir haben sie Prüfungen unterworfen, wie Wir die Besitzer des Gartens Prüfungen unterworfen haben, als sie schworen, sie würden ihn am Morgen abernten"},{"number":18,"text":"Ohne einen Vorbehalt zu machen"},{"number":19,"text":"Da machte darin eine verheerende Erscheinung von deinem Herrn die Runde, während sie schliefen"},{"number":20,"text":"Und er war am Morgen wie abgeerntet"},{"number":21,"text":"Da riefen sie am Morgen einander zu"},{"number":22,"text":"«Geht in der Frühe zu eurem Saatfeld, wenn ihr ernten wollt.»"},{"number":23,"text":"Sie machten sich auf den Weg und flüsterten dabei einander zu"},{"number":24,"text":"«Heute darf kein Bedürftiger zu euch hereinkommen.»"},{"number":25,"text":"Und sie gingen hin in der Frühe in der Meinung, sie könnten (den Armen ihren Anteil) verwehren"},{"number":26,"text":"Als sie ihn aber sahen, sagten sie: «Wir befinden uns im Irrtum"},{"number":27,"text":"Nein, wir entbehren vielmehr alles.»"},{"number":28,"text":"Derjenige von ihnen, der in der Mitte stand, sagte: «Habe ich nicht zu euch gesagt: Würdet ihr doch Gott preisen!»"},{"number":29,"text":"Sie sagten: «Preis sei unserem Herrn! Wir haben gewiß Unrecht getan.»"},{"number":30,"text":"Da gingen sie aufeinander zu und machten sich gegenseitig Vorwürfe"},{"number":31,"text":"Sie sagten: «O wehe uns! Wir haben ein Übermaß an Frevel gezeigt"},{"number":32,"text":"Möge unser Herr uns zum Tausch dafür einen besseren (Garten) als ihn geben! Auf Gott richten wir unsere Wünsche.»"},{"number":33,"text":"So ist die Pein. Doch die Pein des Jenseits ist größer, wenn sie es nur wüßten"},{"number":34,"text":"Für die Gottesfürchtigen sind bei ihrem Herrn Gärten der Wonne bestimmt"},{"number":35,"text":"Sollen Wir etwa die Gottergebenen den Übeltätern gleichsetzen"},{"number":36,"text":"Was ist mit euch? Wie urteilt ihr nur"},{"number":37,"text":"Oder habt ihr ein Buch, in dem ihr nachforschen (und finden) könnt"},{"number":38,"text":"Daß euch bestimmt ist, was ihr euch auswählt"},{"number":39,"text":"Oder haben Wir uns euch gegenüber eidlich verpflichtet bis zum Tag der Auferstehung, daß ihr bekommt, was ihr entscheidet"},{"number":40,"text":"Frage sie, wer von ihnen dafür bürgt"},{"number":41,"text":"Oder haben sie etwa Teilhaber? Sie sollen doch ihre Teilhaber herbeibringen, so sie die Wahrheit sagen"},{"number":42,"text":"Am Tag, da die Angelegenheit ernst wird und sie aufgerufen werden, sich in Anbetung niederzuwerfen, sie aber es nicht vermögen"},{"number":43,"text":"Während ihre Blicke gesenkt sind und Erniedrigung auf ihnen schwer lastet. Dabei wurden sie doch aufgefordert, sich in Anbetung niederzuwerfen, als sie gesund waren"},{"number":44,"text":"Laß Mich in Ruhe mit denen, die diese Botschaft für Lüge erklären. Wir werden sie nach und nach kommen lassen, von wo sie es nicht wissen"},{"number":45,"text":"Und Ich gewähre ihnen Aufschub. Meine List ist fest"},{"number":46,"text":"Oder verlangst du etwa einen Lohn von ihnen, so daß sie mit Schulden belastet würden"},{"number":47,"text":"Oder liegt ihnen das Unsichtbare vor, so daß sie (es) aufschreiben"},{"number":48,"text":"So sei geduldig, bis das Urteil deines Herrn eintrifft. Und sei nicht wie der mit dem Fisch, als er voller Gram (zu Gott) rief"},{"number":49,"text":"Und hätte ihn nicht eine Gnade von seinem Herrn rechtzeitig erreicht, wäre er auf das kahle Land geworfen worden und hätte sich Tadel zugezogen"},{"number":50,"text":"Da erwählte ihn sein Herr und machte ihn zu einem der Rechtschaffenen"},{"number":51,"text":"Diejenigen, die ungläubig sind, würden dich, wenn sie die Ermahnung hören, mit ihren Blicken beinahe ins Straucheln bringen. Und sie sagen: «Er ist ja ein Besessener.»"},{"number":52,"text":"Doch es ist nichts als eine Ermahnung für die Weltenbewohner"}]}