{"number":70,"edition":"de.khoury","ayahs":[{"number":1,"text":"Ein Fragesteller fragt nach einer Pein, die eintreffen wird"},{"number":2,"text":"Für die Ungläubigen, die niemand abwehren kann"},{"number":3,"text":"Von Gott her, dem Herrn der Himmelsleiter"},{"number":4,"text":"Die Engel und der Geist steigen zu Ihm empor an einem Tag, dessen Ausmaß fünfzigtausend Jahre sind"},{"number":5,"text":"Übe darum schöne Geduld"},{"number":6,"text":"Sie sehen sie weit entfernt"},{"number":7,"text":"Wir aber sehen sie nahe"},{"number":8,"text":"Am Tag, da der Himmel wie geschmolzenes Erz"},{"number":9,"text":"Und die Berge wie Wolleflocken sein werden"},{"number":10,"text":"Und kein warmherziger Freund seinen Freund (nach seinem Befinden) fragt"},{"number":11,"text":"Sie werden sie gewiß zu sehen bekommen. Der Übeltäter möchte sich gern von der Pein jenes Tages loskaufen mit seinen Söhnen"},{"number":12,"text":"Und seiner Gefährtin und seinem Bruder"},{"number":13,"text":"Und seiner Sippe, die ihm eine Heimstätte bietet"},{"number":14,"text":"Und allen, die auf der Erde sind. Er wünscht, dies möge ihn dann retten"},{"number":15,"text":"Aber nein, es ist ein loderndes Feuer"},{"number":16,"text":"Das die Gliedmaßen wegnimmt"},{"number":17,"text":"Das den ruft, der den Rücken kehrt und fortgeht"},{"number":18,"text":"(Vermögen) zusammenträgt und in Behältern hortet"},{"number":19,"text":"Der Mensch ist als kleinmütig erschaffen"},{"number":20,"text":"Wenn das Böse ihn trifft, ist er sehr mutlos"},{"number":21,"text":"Und wenn ihm Gutes widerfährt, verweigert er es anderen"},{"number":22,"text":"Ausgenommen sind die, die beten"},{"number":23,"text":"Und in ihrem Gebet beharrlich sind"},{"number":24,"text":"Und die ein bestimmtes Recht auf ihr Vermögen einräumen"},{"number":25,"text":"Dem Bettler und dem Unbemittelten"},{"number":26,"text":"Und die den Tag des Gerichtes für wahr halten"},{"number":27,"text":"Und die vor der Pein ihres Herrn erschrocken sind"},{"number":28,"text":"vor der Pein ihres Herrn befindet sich niemand in Sicherheit"},{"number":29,"text":"Und die ihre Scham bewahren"},{"number":30,"text":"Außer gegenüber ihren Gattinnen, oder was ihre Rechte (an Sklavinnen) besitzt - dann sind sie nicht zu tadeln"},{"number":31,"text":"Diejenigen aber, die darüber hinaus (andere) begehren, das sind die, die Übertretungen begehen"},{"number":32,"text":"Und die auf das ihnen Anvertraute und ihre Verpflichtung achtgeben"},{"number":33,"text":"Und die ihr Zeugnis ablegen"},{"number":34,"text":"Und die ihr Gebet einhalten"},{"number":35,"text":"Diese befinden sich in Gärten und werden (darin) ehrenvoll behandelt"},{"number":36,"text":"Was ist mit denen, die ungläubig sind, daß sie den Hals nach dir recken"},{"number":37,"text":"Von rechts und von links, in Gruppen aufgeteilt"},{"number":38,"text":"Erhofft (wirklich) jeder von ihnen, in einen Garten der Wonne eingehen zu können"},{"number":39,"text":"Aber nein, Wir haben sie doch aus dem erschaffen, was sie wissen"},{"number":40,"text":"Nein, Ich schwöre beim Herrn der östlichen und der westlichen Gegenden, Wir haben dazu die Macht"},{"number":41,"text":"Sie durch andere zu ersetzen, die besser sind als sie. Und niemand kann Uns voraus sein"},{"number":42,"text":"So laß sie ausschweifende Reden halten und ihr Spiel treiben, bis sie ihrem Tag begegnen, der ihnen angedroht ist"},{"number":43,"text":"Dem Tag, da sie aus den Gräbern hastig herauskommen, als würden sie zu den Opfersteinen eilen"},{"number":44,"text":"Während ihre Blicke gesenkt sind und Erniedrigung auf ihnen schwer lastet. Das ist der Tag, der ihnen immer wieder angedroht wurde"}]}