{"number":52,"edition":"de.khoury","ayahs":[{"number":1,"text":"Beim Berg"},{"number":2,"text":"Bei einem Buch, das zeilenweise niedergeschrieben ist"},{"number":3,"text":"Auf ausgebreitetem Pergament"},{"number":4,"text":"Bei dem (zur Pilgerzeit) besuchten Haus"},{"number":5,"text":"Und bei der hochgezogenen Decke"},{"number":6,"text":"Und beim angefüllten Meer"},{"number":7,"text":"Die Pein deines Herrn wird eintreffen"},{"number":8,"text":"Es gibt niemanden, der sie abwehren könnte"},{"number":9,"text":"Am Tag, da der Himmel in heftiges Schwanken gerät"},{"number":10,"text":"Und die Berge sich fortbewegen"},{"number":11,"text":"Wehe an jenem Tag denen, die (die Botschaft) für Lüge erklären"},{"number":12,"text":"Die in ausschweifenden Reden ihr Spiel treiben"},{"number":13,"text":"Am Tag, da sie unerbittlich ins Feuer der Hölle gestoßen werden"},{"number":14,"text":"«Das ist das Feuer, das ihr immer wieder für Lüge erklärt habt"},{"number":15,"text":"Ist dies nun Zauberei, oder könnt ihr nicht sehen"},{"number":16,"text":"Ihr sollt darin brennen. Es ist für euch gleich, ob ihr es geduldig ertragt oder nicht. Euch wird das vergolten, was ihr zu tun pflegtet.»"},{"number":17,"text":"Die Gottesfürchtigen befinden sich in Gärten und Wonne"},{"number":18,"text":"Sie empfinden Wohlbehagen an dem, was ihnen ihr Herr zukommen läßt. Und ihr Herr bewahrt sie vor der Pein der Hölle"},{"number":19,"text":"«Eßt und trinkt zu eurem Wohl für das, was ihr zu tun pflegtet.»"},{"number":20,"text":"Sie lehnen sich auf gereihten Betten. Und Wir vermählen sie mit großäugigen Huri"},{"number":21,"text":"Und zu denen, die glauben und denen ihre Nachkommenschaft im Glauben folgt, lassen Wir ihre Nachkommenschaft stoßen. Und Wir verringern ihnen nichts von ihren Werken. Ein jeder haftet für das, was er erworben hat"},{"number":22,"text":"Und Wir versorgen sie mit Früchten und Fleisch von dem, was sie begehren"},{"number":23,"text":"Darin greifen sie untereinander nach einem Becher, der nicht zu unbedachter Rede verleitet und in dem nichts Sündhaftes steckt"},{"number":24,"text":"Und unter ihnen machen die Runde Jünglinge, die zu ihnen gehören, als wären sie wohlverwahrte Perlen"},{"number":25,"text":"Und sie treten aneinander heran und fragen sich gegenseitig"},{"number":26,"text":"Sie sagen: «Früher waren wir inmitten unserer Angehörigen erschrocken"},{"number":27,"text":"Da erwies Gott uns eine Wohltat und bewahrte uns vor der Pein des glühenden Windes"},{"number":28,"text":"Früher pflegten wir Ihn anzurufen. Er ist der, der gütig und barmherzig ist.»"},{"number":29,"text":"Ermahne nun; du bist dank der Gnade deines Herrn weder ein Wahrsager noch ein Besessener"},{"number":30,"text":"Oder sagen sie etwa: «Ein Dichter. Wir warten ab, was für ein Unheil das Schicksal ihm bringen wird»"},{"number":31,"text":"Sprich: Wartet ab, ich gehöre mit euch zu denen, die abwarten"},{"number":32,"text":"Oder befiehlt ihnen etwa ihr Verstand dies, oder sind sie vielmehr Leute, die ein Übermaß an Frevel zeigen"},{"number":33,"text":"Oder sagen sie: «Er hat ihn sich selbst in den Mund gelegt»? Nein, vielmehr glauben sie nicht"},{"number":34,"text":"Sie sollen doch eine Botschaft gleicher Art beibringen, so sie die Wahrheit sagen"},{"number":35,"text":"Oder sind sie aus etwas anderem erschaffen worden, oder sind sie gar selbst die Schöpfer"},{"number":36,"text":"Oder haben sie etwa die Himmel und die Erde erschaffen? Nein, vielmehr hegen sie keine Gewißheit"},{"number":37,"text":"Oder besitzen sie etwa die Vorratskammern deines Herrn, oder sind sie es, die alles fest in der Hand haben"},{"number":38,"text":"Oder haben sie eine Leiter, auf der sie (emporsteigen und) lauschen können? Dann soll doch ihr Lauscher eine offenkundige Ermächtigung beibringen"},{"number":39,"text":"Oder sind für Ihn die Töchter und für euch die Söhne bestimmt"},{"number":40,"text":"Oder verlangst du etwa einen Lohn von ihnen, so daß sie mit Schulden belastet wären"},{"number":41,"text":"Oder liegt ihnen das Unsichtbare vor, so daß sie (es) aufschreiben"},{"number":42,"text":"Oder wollen sie arglistig handeln? Diejenigen, die ungläubig sind, sind es, die der List erliegen"},{"number":43,"text":"Oder haben sie einen anderen Gott als Gott? Preis sei Gott! (Erhaben ist Er) über das, was sie (Ihm) beigesellen"},{"number":44,"text":"Und sähen sie ein Stück vom Himmel herabfallen, sie würden sagen: «Eine aufgeschichtete Wolke.»"},{"number":45,"text":"Laß sie nur, bis sie ihrem Tag begegnen, an dem sie vom Donnerschlag getroffen werden"},{"number":46,"text":"Dem Tag, da ihre List ihnen nichts nützt und sie keine Unterstützung erfahren"},{"number":47,"text":"Für diejenigen, die Unrecht tun, ist eine Pein außer dieser bestimmt, aber die meisten von ihnen wissen nicht Bescheid"},{"number":48,"text":"Sei geduldig, bis dein Herr sein Urteil fällt. Du stehst vor unseren Augen. Und sing das Lob deines Herrn, wenn du dich hinstellst"},{"number":49,"text":"Und preise Ihn in der Nacht und beim Schwinden der Sterne"}]}