{"number":74,"edition":"en.shakir","ayahs":[{"number":1,"text":"O you who are clothed"},{"number":2,"text":"Arise and warn"},{"number":3,"text":"And your Lord do magnify"},{"number":4,"text":"And your garments do purify"},{"number":5,"text":"And uncleanness do shun"},{"number":6,"text":"And bestow not favors that you may receive again with increase"},{"number":7,"text":"And for the sake of your Lord, be patient"},{"number":8,"text":"For when the trumpet is sounded"},{"number":9,"text":"That, at that time, shall be a difficult day"},{"number":10,"text":"For the unbelievers, anything but easy"},{"number":11,"text":"Leave Me and him whom I created alone"},{"number":12,"text":"And give him vast riches"},{"number":13,"text":"And sons dwelling in his presence"},{"number":14,"text":"And I adjusted affairs for him adjustably"},{"number":15,"text":"And yet he desires that I should add more"},{"number":16,"text":"By no means! surely he offers opposition to Our communications"},{"number":17,"text":"I will make a distressing punishment overtake him"},{"number":18,"text":"Surely he reflected and guessed"},{"number":19,"text":"But may he be cursed how he plotted"},{"number":20,"text":"Again, may he be cursed how he plotted"},{"number":21,"text":"Then he looked"},{"number":22,"text":"Then he frowned and scowled"},{"number":23,"text":"Then he turned back and was big with pride"},{"number":24,"text":"Then he said: This is naught but enchantment, narrated (from others)"},{"number":25,"text":"This is naught but the word of a mortal"},{"number":26,"text":"I will cast him into hell"},{"number":27,"text":"And what will make you realize what hell is"},{"number":28,"text":"It leaves naught nor does it spare aught"},{"number":29,"text":"It scorches the mortal"},{"number":30,"text":"Over it are nineteen"},{"number":31,"text":"And We have not made the wardens of the fire others than angels, and We have not made their number but as a trial for those who disbelieve, that those who have been given the book may be certain and those who believe may increase in faith, and those who have been given the book and the believers may not doubt, and that those in whose hearts is a disease and the unbelievers may say: What does Allah mean by this parable? Thus does Allah make err whom He pleases, and He guides whom He pleases, and none knows the hosts of your Lord but He Himself; and this is naught but a reminder to the mortals"},{"number":32,"text":"Nay; I swear by the moon"},{"number":33,"text":"And the night when it departs"},{"number":34,"text":"And the daybreak when it shines"},{"number":35,"text":"Surely it (hell) is one of the gravest (misfortunes)"},{"number":36,"text":"A warning to mortals"},{"number":37,"text":"To him among you who wishes to go forward or remain behind"},{"number":38,"text":"Every soul is held in pledge for what it earns"},{"number":39,"text":"Except the people of the right hand"},{"number":40,"text":"In gardens, they shall ask each other"},{"number":41,"text":"About the guilty"},{"number":42,"text":"What has brought you into hell"},{"number":43,"text":"They shall say: We were not of those who prayed"},{"number":44,"text":"And we used not to feed the poor"},{"number":45,"text":"And we used to enter into vain discourse with those who entered into vain discourses"},{"number":46,"text":"And we used to call the day of judgment a lie"},{"number":47,"text":"Till death overtook us"},{"number":48,"text":"So the intercession of intercessors shall not avail them"},{"number":49,"text":"What is then the matter with them, that they turn away from the admonition"},{"number":50,"text":"As if they were asses taking fright"},{"number":51,"text":"That had fled from a lion"},{"number":52,"text":"Nay; every one of them desires that he may be given pages spread out"},{"number":53,"text":"Nay! but they do not fear the hereafter"},{"number":54,"text":"Nay! it is surely an admonition"},{"number":55,"text":"So whoever pleases may mind it"},{"number":56,"text":"And they will not mind unless Allah please. He is worthy to be feared and worthy to forgive"}]}