{"number":64,"edition":"tr.bulac","ayahs":[{"number":1,"text":"Göklerde ve yerde olanların tümü Allah'ı tesbih eder. Mülk O'nundur, hamd (övgü) de O'nundur. O, herşeye güç yetirendir"},{"number":2,"text":"Sizi yaratan O'dur; buna rağmen sizden kiminiz kafirdir, kiminiz mü'min, Allah, yaptıklarınızı görendir"},{"number":3,"text":"Gökleri ve yeri hak olmak üzere yarattı ve size düzenli bir biçim (suret) verdi; suretlerinizi de güzel yaptı. Dönüş O'nadır"},{"number":4,"text":"Göklerde ve yerde olanların tümünü bilir; sizin saklı tuttuklarınızı da, açığa vurduklarınızı da bilir. Allah, sinelerin özünde saklı duranı bilendir"},{"number":5,"text":"Bundan önce inkar edenlerin haberi size gelmedi mi? İşte onlar, işlerinin vebalini taddılar. Onlara acı bir azap vardır"},{"number":6,"text":"Bu, kendilerine apaçık belgelerle elçiler geldiği halde \"bizi bir beşer mi hidayete ulaştıracak?\" demeleri ve bu yüzden inkar edip saparak yüz çevirmeleri nedeniyledir. Allah da (onlara karşı) müstağni olduğunu (hiçbir şeye ihtiyacı olmadığını) gösterdi. Allah Ğani'dir, Hamid'dir"},{"number":7,"text":"İnkar edenler kesin olarak diriltilmeyeceklerini öne sürdüler. De ki: \"Hayır, Rabbim adına andolsun, siz, muhakkak diriltileceksiniz; sonra mutlaka yaptıklarınız size haber verilecektir. Bu da Allah'a göre oldukça kolaydır"},{"number":8,"text":"Şu halde Allah'a, O'nun Resûlü’ne ve indirdiğimiz nur (Kur'an)a iman edin. Allah yaptıklarınızdan haberdardır"},{"number":9,"text":"Sizi toplanma günü için birarada toplayacağı gün; işte bu aldanma (teğabün) günüdür. Kim Allah'a iman edip salih bir amelde bulunursa (Allah) onun kötülüklerini örter ve içinde ebedi kalıcılar olmak üzere altından ırmaklar akan cennetlere sokar. İşte büyük 'mutluluk ve kurtuluş (fevz)' budur"},{"number":10,"text":"İnkar edip ayetlerimizi yalanlayanlara gelince; onlar da içinde sürekli kalıcılar olmak üzere, ateşin halkıdırlar. Ne kötü bir dönüş yeridir O"},{"number":11,"text":"Allah'ın izni olmaksızın hiçbir musibet (hiç kimseye) isabet etmez. Kim Allah'a iman ederse, onun kalbini hidayete yöneltir. Allah, herşeyi bilendir"},{"number":12,"text":"Allah'a itaat edin ve Resûle de itaat edin. Şayet yüz çevirecek olursanız, artık elçimiz üzerine düşen (yalnızca) apaçık bir tebliğ (gerçeği en yalın biçimde size iletme)dir"},{"number":13,"text":"Allah; O'ndan başka İlah yoktur. Öyleyse mü'minler (yalnızca) Allah'a tevekkül etsinler"},{"number":14,"text":"Ey iman edenler, gerçek şu ki, sizin eşlerinizden ve çocuklarınızdan bir kısmı sizler için (birer) düşmandırlar. Şu halde onlardan sakının. Yine de affeder, hoş görür (kusurlarını yüzlerine vurmaz) ve bağışlarsanız, artık elbette Allah, bağışlayandır, esirgeyendir"},{"number":15,"text":"Mallarınız ve çocuklarınız sizin için ancak bir fitne (bir deneme)dir. Allah ise, büyük ecir (en güzel karşılık) O'nun Katında olandır"},{"number":16,"text":"Öyleyse güç yetirebildiğiniz kadar Allah'tan korkup-sakının, dinleyin ve itaat edin. Kendi nefsinize hayır (en büyük yarar) olmak üzere infakta bulunun. Kim nefsinin bencil-tutkularından (ya da cimri tutumundan) korunursa; işte onlar, felah (kurtuluş) bulanlardır"},{"number":17,"text":"Eğer Allah'a güzel bir borç verecek olursanız, onu sizin için kat kat arttırır ve sizi bağışlar. Allah Şekûr'dur (şükrü kabul edip çok ihsan eden), Halim'dir (cezayı vermekte acele etmeyendir)"},{"number":18,"text":"Gaybı da, müşahede edilebileni de bilen, Aziz (üstün ve güçlü), Hakim (hüküm ve hikmet sahibi)dir"}]}