{"number":36,"edition":"cs.nykl","ayahs":[{"number":1,"text":"JÁ. SÍN"},{"number":2,"text":"Při Koránu moudrém"},{"number":3,"text":"tyť zajisté s jedním z poslaných"},{"number":4,"text":"na stezce přímé"},{"number":5,"text":"Seslání jest to Mocného, Slitovného"},{"number":6,"text":"abys varoval lid, jichž otcové nebyli varováni i žijí v lhostejnosti"},{"number":7,"text":"A pronesen byl již rozsudek, nad většinou jich: proto neuvěří"},{"number":8,"text":"Obtěžkali jsme šíje jejich řetězy, sáhajícími jim až k bradám, takže dozadu sražené jsou hlavy jejich"},{"number":9,"text":"A učinili jsme před nimi přehradu i za nimi přehradu; a clonou pokryli jsme oči jejich, takže nelze jim viděti"},{"number":10,"text":"A jedno jest jim, varuješ-li je, či ne: neuvěří"},{"number":11,"text":"Pouze ty varovati budeš, kdož následují Napomenutí a bojí se Milosrdného v skrytosti: těm zvěstuj odpuštění a odměnu hojnou"},{"number":12,"text":"Myť zajisté křísíme mrtvé a zapisujeme skutky jejich a stopy jejich: a všechny věci zanášíme v Knize prvotní zjevné"},{"number":13,"text":"A čiň jim podobenství v obyvatelích města, když přišli k nim poslové"},{"number":14,"text":"když poslali jsme k nim poslů dvé a lháři nazvali je: i na posilu třetího poslali jsme, a řekli: „Myť zajisté posláni jsme k vám!“"},{"number":15,"text":"Řekli: „Vy pouze jste lidé jako my a Milosrdný neseslal ničeho. Vy pouze lháři jste.“"},{"number":16,"text":"Řekli (poslové): „Pán náš ví, že my k vám posláni jsme"},{"number":17,"text":"a na nás jest pouze hlásání zjevné.“"},{"number":18,"text":"Řekli: „Poradili jsme se ptakověštbou ohledně vás: a nepřestanete-li, dojista ukamenujeme vás a dojista stihne vás od nás trest bolestný.“"},{"number":19,"text":"Řekli (poslové): „Vaše (zlá) věštba, zůstane s vámi, i když jste byli napomenuti. Ale vy jste lidem výstřednickým!“"},{"number":20,"text":"I přiběhl z druhého konce města muž ve spěchu, volaje: „Ó lide můj, následujte poslané"},{"number":21,"text":"následujte ty, kdož nežádají si od vás odměny a jsou vedeni cestou (pravou)"},{"number":22,"text":"Proč neměl bych uctívati toho, jenž stvořil mne a k němuž navráceni budete"},{"number":23,"text":"Zdaž vezmu si vedle něho božstva (jiná)? Chtěl-li pak by Milosrdný přičiniti mi protivenství, neprospěla by mi přímluva jejich pranic, aniž spasiti by mne mohli"},{"number":24,"text":"Tehdy pak zajisté byl bych v bloudění zjevném"},{"number":25,"text":"Zajisté uvěřil jsem v Pána našeho: pročež slyšte mne!“"},{"number":26,"text":"Bylo řečeno mu: „Vejdi v ráj!“ I řekl: „Kéž by jen lid můj věděl"},{"number":27,"text":"jak odpustil mi Pán můj a jak učinil mne jedním z poctěných!“"},{"number":28,"text":"A neseslali jsme na lid jeho poté vojska s nebe, aniž co jiného seslali jsme"},{"number":29,"text":"Pouze jedno vzkřiknutí zaznělo a hle, byli zhubeni"},{"number":30,"text":"Běda služebníkům mým! Žádný nepřišel jim prorok, aniž by si nebyli smích z něho tropili"},{"number":31,"text":"Což neviděli, kolik zahladili jsme pokolení před nimi a že zajisté k nim se nenavrátí"},{"number":32,"text":"Nýbrž že všichni dohromady nám budou předvedeni"},{"number":33,"text":"Znamením jim jest země zmrtvělá, již křísíme a dáváme vycházeti z ní zrnům (obilným), z nichž pojídají"},{"number":34,"text":"A učinili jsme na ní zahrady datlovníků a révy vinné, a dali vyvříti na ní pramenům"},{"number":35,"text":"aby pojídati mohli z plodů (všeho) toho, ač nevytvořily jich ruce jejich. Což nebudou vděčni"},{"number":36,"text":"Chválen budiž ten, jenž stvořil druhy všechny, ve všem, co vydává země, v nich samých, a v tom, o čem nevědí"},{"number":37,"text":"Znamením jim jest noc: svlékneme s ní den a hle, v temnotách jsou"},{"number":38,"text":"A slunce, běžící k sídlu svému: takové jest určení Mocného, Vševědoucího"},{"number":39,"text":"A měsíc: určili jsme mu období, dokud nezmění se v podobu starého listu palmového"},{"number":40,"text":"A slunci není dovoleno, aby dostihlo měsíce; aniž noc předstihne den; však oba svou drahou po obloze jdou"},{"number":41,"text":"A znamením jest jim, že nesli jsme potomstvo jejich v arše přeplněné"},{"number":42,"text":"a stvořili jsme pro ně (lodi) jí podobné, na nichž plují"},{"number":43,"text":"a chceme-li, utápíme je, a není vysvoboditele jim, aniž jsou spaseni"},{"number":44,"text":"leda z milosrdenství našeho, pro těšení se (světu) dočasné"},{"number":45,"text":"A když řečeno jest jim: „Bojte se toho, co před vámi jest i toho, co jest za vámi, abyste slitování dosáhli,“ (nedbají)"},{"number":46,"text":"A nepřijde jim znamení ze znamení Pána jejich, aniž by se od něho neodvraceli"},{"number":47,"text":"A když řečeno jest jim: „Rozdávejte (almužnu) z toho, čímž obdařil vás Bůh,“ říkají ti, kdož neuvěřili, k těm, kteří uvěřili: „Zdaž krmiti budeme ty, jež nakrmil by Bůh, kdyby chtěl? Vyť pouze jste v bludu zjevném.“"},{"number":48,"text":"A říkají: „Kdy naplní se onen slib, jste-li pravdomluvnými?“"},{"number":49,"text":"Co čekají jiného, než vzkřiknutí jediné, jež přikvačí na ně, mezitím, co hašteří se"},{"number":50,"text":"A nebudou s to, aby učinili závěť, aniž k rodině své se navrátí"},{"number":51,"text":"A zatroubeno bude na roh, a hle, z hrobů svých k Pánu svému vylézati budou"},{"number":52,"text":"Řeknou: „Běda nám! Kdo vzbudil nás z našeho místa spánku? Totoť jest, co slíbil nám Milosrdný a pravdu měli poslové.“"},{"number":53,"text":"Pouze jedno vzkřiknutí bude a hle, všichni budou nám předvedeni"},{"number":54,"text":"A v onen den nebude ukřivděno žádné duši a odměněni budete jen dle toho, co činili jste"},{"number":55,"text":"V den onen obyvatelé zahrady (rajské) budou zaměstnáni radováním se"},{"number":56,"text":"Oni a manželky jejich, ve stinném (loubí) na pohovkách odpočívati budou"},{"number":57,"text":"Tam ovoce budou míti a vše, oč požádají"},{"number":58,"text":"„Pokoj vám!“ bude pozdrav jim od Pána jejich slitovného"},{"number":59,"text":"Buďte pak odděleni dnes, ó provinilci"},{"number":60,"text":"Neučinil jsem s vámi úmluvu, synové Adamovi: „Neuctívejte Satana, neb nepřítelem jest vám zjevným"},{"number":61,"text":"Nýbrž uctívejte mne: totoť jest stezka přímá"},{"number":62,"text":"Však on již zavedl v blud vás počet velký: což nepochopili jste toho"},{"number":63,"text":"Totoť jest peklo, jež slíbeno bylo vám"},{"number":64,"text":"pecte se v něm dnes za to, že nevěřili jste!“"},{"number":65,"text":"V den onen zapečetíme ústa jejich: a mluviti budou k nám ruce jejich a dosvědčí nohy jejich to, co konali"},{"number":66,"text":"A kdybychom chtěli, zaclonili bychom oči jejich; pak o překot pádili by po stezce, však jak viděli by ji"},{"number":67,"text":"A kdybychom chtěli, dali bychom ztrnouti jim na místech jejich, takže by nebylo lze jim jíti vpřed, aniž vrátiti se"},{"number":68,"text":"A tomu, jemuž prodloužíme věk, ohneme tělo stářím: což toho nepochopí"},{"number":69,"text":"A nenaučili jsme jej básnění, aniž jest mu ho třeba. Neb toto jest pouze Napomenutí a Čtení zjevné"},{"number":70,"text":"aby varován byl jím, kdožkoli živ jest, a aby pronesen jím byl rozsudek nad nevěřícími"},{"number":71,"text":"Což neviděli, ze stvořili jsme pro ně mezi věcmi, jež urobily ruce naše, dobytčata, nad nimiž vládci jsou"},{"number":72,"text":"A podrobili jsme jim je: na nich pak jezdí a z nich požívají"},{"number":73,"text":"a z nich mají užitek (mnohý) a nápoje — což nebudou, nám vděčni"},{"number":74,"text":"Nicméně vzali si vedle Boha božstva (jiná), aby snad měli pomocníky"},{"number":75,"text":"(Tato) nejsou s to, aby pomohla jim: a oni jsou jen vojem (pro ně) pohotovým"},{"number":76,"text":"Nermutiž tě nijak řeč jejich: myť zajisté víme, co tají, i co veřejně přiznávají"},{"number":77,"text":"Což neviděl člověk, že stvořili jsme jej z kapky (semene): a hle, on protivníkem jest (nám) zjevným"},{"number":78,"text":"A činí nám podobenství, zapomenuv stvoření své, řka: „Kdo vzkřísí kosti zetlelé?“"},{"number":79,"text":"Rci: „Vzkřísí je ten, jenž stvořil je po prvé, neb on v tvoření veškerém jest učený"},{"number":80,"text":"ten, jenž učinil vám ze stromu zeleného oheň: a hle, z něho zapalujete si!“"},{"number":81,"text":"Což nemá ten, jenž stvořil nebe i zemi, moci, aby stvořil jim podobné? Věru, že ano: onť Stvořitelem jest učeným"},{"number":82,"text":"Rozkaz jeho, když chce, aby co bylo, jest jen: „Staň se!“ a stane se"},{"number":83,"text":"Chválen budiž (tedy) ten, v jehož ruce jest vláda nad věcmi všemi a k němuž navráceni budete"}]}