{"number":68,"edition":"cs.nykl","ayahs":[{"number":1,"text":"Nún. Při PÉRU a tom, co spisují"},{"number":2,"text":"Nejsi, z milosti Pána svého posedlý"},{"number":3,"text":"a zajisté schystána jest ti odměna bezvýhradná"},{"number":4,"text":"Tyt zajisté‘s povahy vznešené"},{"number":5,"text":"i spatříš, spatří oni (též)"},{"number":6,"text":"kdo z vás (vskutku) jest šílený"},{"number":7,"text":"Zajisté Pán tvůj ví nejlépe, kdo zbloudil se stezky jeho a ví nejlépe, kdož (dobře) jsou vedeni"},{"number":8,"text":"Pročež nebuď poslušen těch, kdož lhářem zvou (tě)"},{"number":9,"text":"Rádi by, kdybys hladce jednal s nimi, aby i oni hladce s tebou jednali"},{"number":10,"text":"A nebuď poslušen žádného z těch, kdož (slavnostně) zaklínají se, hanebných"},{"number":11,"text":"pomlouvačů, s klepy jen obcházejících"},{"number":12,"text":"(velkých) zabraňovatelů dobra. přestupníků, zločinných"},{"number":13,"text":"hrubých, mimo to rodem špatných"},{"number":14,"text":"i kdyby mnoho statků měl a potomstva"},{"number":15,"text":"jenž, kdež čtena jsou mu znamení naše říká: „Báchorky jsou to starých.“"},{"number":16,"text":"Poznamenáme jej na rypáku"},{"number":17,"text":"Postavili jsme je na zkoušku, jakož postavili jsme na zkoušku majitele zahrady. když přisáhli, že dojista sčesají datle její za jitra"},{"number":18,"text":"bez připojení výminky"},{"number":19,"text":"A obešlo ji zničení od Pána tvého mezitím, co spali"},{"number":20,"text":"a za jitra vypadala jak očesaná"},{"number":21,"text":"A zvolali na sebe časně za jitra"},{"number":22,"text":"„Vyjděte časně na pole své, česat chcete-li!“"},{"number":23,"text":"A vpřed se brali, šeptajíce si navzájem"},{"number":24,"text":"„Dojista dnes v zahradu nevejde k vám ani jeden nuzný.“"},{"number":25,"text":"Tak z jitra vyšli rozhodnuti"},{"number":26,"text":"A když spatřili (zahradu), řekli: „Zajisté v bludu byli jsme"},{"number":27,"text":"Naopak, (úrody její) jsme zbaveni.“"},{"number":28,"text":"A nejsprávnější řekl nich: „Což neděl jsem vám: Nebudete-li chvály pěti Bohu?“"},{"number":29,"text":"Řekli: ,,Chválen budiž Pán náš: myť zajisté nepravostni byli jsme.“"},{"number":30,"text":"A počali si klásti vinu navzájem"},{"number":31,"text":"řkouce: ,,Běda nám, zajisté svévolni byli jsme"},{"number":32,"text":"Snad Pán náš nahradí nám ji lepší (zahradou): tak Pána svého prosíme.“"},{"number":33,"text":"Takový byl trest náš: však trest života budoucího jistě větší bude. kdyby si toho jen byli vědomi"},{"number":34,"text":"Bohabojným pak zajisté schystány jsou u Pána jejich zahrady rozkoše"},{"number":35,"text":"Či učiníme stejnými ty, kdož do vůle boží jsou odevzdáni a provinilce"},{"number":36,"text":"Jak to přijde, že tak soudíte"},{"number":37,"text":"Aneb Knihu máte, z níž se učíte"},{"number":38,"text":"že dle ní dostanete cokoli si vybéřete"},{"number":39,"text":"Aneb dána vám, byla přísaha, pro nás závazná, sáhající až do dne zmrtvýchvstání, že dostanete, co sami usoudíte"},{"number":40,"text":"Taž se jich, kdo z nich jest toho ručitelem"},{"number":41,"text":"Anebo společníky mají? Nechť tedy předvedou společníky své, jsou-li pravdomluvnými"},{"number":42,"text":"V den, kdy obnaženy budou holeně a vyzváni budou k padnutí na tváře své - tu nebudou s to, (tak učiniti)"},{"number":43,"text":"Sklopeni budou zrakové jejich a potupa je pokryje, neb vyzváni byli k padnutí na tváře své, když byli bezpečni"},{"number":44,"text":"I ponech mne a ty, kdož vylhaným nazývají toto vyprávění: postupně přivedeme na ně (zkázu), zkad jí netuší"},{"number":45,"text":"A dlouho poshovím jim, neb lest má jest jistá"},{"number":46,"text":"Či žádáš od nich odměnu, když přece dluhy přetíženi jsou"},{"number":47,"text":"Či znají věci skryté, jež (snad) spisují"},{"number":48,"text":"Pročež trpělivě vyčkávej rozsudek Pána svého a nebudiž jako onen v rybě, když volal k Bohu v tísni dusivé"},{"number":49,"text":"Nebýti toho, že dostihlo jej dobrodiní od Pána jeho, byl by býval vyvržen na (břeh) pustý, pohaněn"},{"number":50,"text":"Ale vyvolil si jej Pán jeho a učinil jej jedním ze spravedlivých"},{"number":51,"text":"Málem pak srážejí tě k zemi ti, kdož neuvěřili, pohledy svými, když slyší Napomenutí - a říkají: „On věru jest Džinny posedlý.“"},{"number":52,"text":"Však jest to jen Napomenutí veškerenstvu"}]}