{"number":23,"edition":"en.sarwar","ayahs":[{"number":1,"text":"Triumphant indeed are the believers"},{"number":2,"text":"who are submissive to God in their prayers"},{"number":3,"text":"who avoid impious talks"},{"number":4,"text":"pay their religious tax"},{"number":5,"text":"and restrain their carnal desires"},{"number":6,"text":"except with their spouses and slave-girls. The practice of carnal relations is lawful with them"},{"number":7,"text":"Those who desire to go beyond such limits they commit transgression"},{"number":8,"text":"those who are true to their trust"},{"number":9,"text":"to their promise"},{"number":10,"text":"and who are steadfast in their prayer"},{"number":11,"text":"These are the heirs of Paradise wherein they will live forever"},{"number":12,"text":"We have created the human being from an extract of clay"},{"number":13,"text":"which was then turned into a living germ and placed in safe depository"},{"number":14,"text":"The living germ, then, was turned into a shapeless lump of flesh from which bones were formed. The bones, then, were covered with flesh. At this stage, We caused it to become another creature. All blessings belong to God, the best Creator"},{"number":15,"text":"Thereafter you will certainly die"},{"number":16,"text":"and you will be brought back to life again on the Day of Resurrection"},{"number":17,"text":"We have created seven heavens above you and have never been neglectful to Our Creation"},{"number":18,"text":"We have sent a measure of water from the sky to stay on earth and We have the power to take it away"},{"number":19,"text":"We have established for you gardens of palm trees and vineyards with this water with many fruits for you to consume"},{"number":20,"text":"We have also created for you the tree that grows on Mount Sinai which produces oil and relish for those who use it"},{"number":21,"text":"There is a lesson for you concerning cattle. We provide you with drink from their bellies and many other benefits. You can consume them as meat"},{"number":22,"text":"You are carried by the animals on land and by the ships in the sea"},{"number":23,"text":"We sent Noah to his people who said, \"My people, worship God for He is your only Lord. Will you then not have fear of Him"},{"number":24,"text":"The chiefs of the unbelievers said to the others, \"He is a mere mortal like you. He wants only to be superior to you. Had God wanted He would have sent the angels (instead of him). We have never heard from our fathers anything like what he says"},{"number":25,"text":"He is only an insane person. Wait for some time. Perhaps he will come to his senses"},{"number":26,"text":"Noah prayed, \"Lord, help me; they have called me a liar"},{"number":27,"text":"We inspired him, saying, \"Build the Ark before Our eyes and by the instruction of Our revelation. When our decree comes to pass and water comes forth from the Oven, embark in the Ark with a pair of every kind of animals and your family except those already doomed (to perish). Do not plead with Me for the unjust; they will be drowned"},{"number":28,"text":"When all of you settle in the Ark, say, \"Only God Who has saved us from the unjust people deserves all praise"},{"number":29,"text":"Say, \"Lord, grant us a blessed landing from the Ark; You are the One who provides the safest landing"},{"number":30,"text":"In this story there is enough evidence (of the Truth); thus do We try (mankind)"},{"number":31,"text":"We brought another generation into existence after the people of Noah"},{"number":32,"text":"We sent to them a Messenger from among their own people who told them, \"Worship God; He is your only Lord. Will you then not have fear of Him"},{"number":33,"text":"A group of his people who disbelieved him and had called the Day of Judgment a lie and whom We had made prosperous in this life, said, \"He is a mere mortal like you. He eats and drinks as you do"},{"number":34,"text":"If you follow a mortal like yourselves you will certainly be lost"},{"number":35,"text":"Does he promise you that after you die and become dust and bones you will be brought back to life again"},{"number":36,"text":"Such a promise will never come true"},{"number":37,"text":"This is our only life. We live and will die but we will never be brought back to life again"},{"number":38,"text":"He is only a man who invents lies against God, so have no faith in him"},{"number":39,"text":"The Messenger prayed, \"Lord, help me; they have called me a liar"},{"number":40,"text":"God replied, \"After a very short time they will certainly regret for their deeds"},{"number":41,"text":"A blast struck them for a just cause, and We made them look like withered leaves. God keeps the unjust people away from His mercy"},{"number":42,"text":"After them We brought another generation into existence"},{"number":43,"text":"Every nation has an appointed life span"},{"number":44,"text":"We sent Our messengers one after the other but whenever a Messenger would come to a nation, its people would call him a liar and We would destroy one nation after the other, thus, only their stories were left behind them. God keeps the unbelievers far away from His Mercy"},{"number":45,"text":"Then We sent Moses and his brother Aaron with Our miracles and clear authority"},{"number":46,"text":"to the Pharaoh and his nobles. But they behaved proudly and thought themselves superior people"},{"number":47,"text":"They said, \"Should we believe in two mere mortals who are like ourselves and whose people are our slaves"},{"number":48,"text":"They called them liars and consequently were destroyed"},{"number":49,"text":"We gave the Book to Moses so that perhaps they may have guidance"},{"number":50,"text":"We made the son of Mary and his mother a miracle and settled them on a high land, quite secure and watered by a spring"},{"number":51,"text":"I told them, \"Messengers, eat from the pure things and act righteously; I know all that you do"},{"number":52,"text":"Your religion is one and I am your Lord. Have fear of Me"},{"number":53,"text":"The people divided themselves into many sects, each with their own book and each happy with whatever they had"},{"number":54,"text":"(Muhammad), leave them alone in their dark ignorance for an appointed time"},{"number":55,"text":"Do they think that We are helping them by giving them children and property"},{"number":56,"text":"We provide them with the means of competing with each other in virtuous deeds, but they do not realize this"},{"number":57,"text":"Only those who are, out of fear of Him, humble before their Lord"},{"number":58,"text":"who believe in the revelations of their Lord"},{"number":59,"text":"who consider nothing equal to their Lord"},{"number":60,"text":"who spend their property for the cause of God, and whose hearts are afraid of their return"},{"number":61,"text":"to God, these are the ones who really compete with each other in virtuous deeds and are the foremost ones in the task"},{"number":62,"text":"We do not impose on any soul what is beyond its capacity. We have the Book which speaks the truth and no injustice will be done to it"},{"number":63,"text":"In fact, the hearts of the unbelievers are in the dark because of their ignorance of real virtue; they act against it"},{"number":64,"text":"But when We will strike with torment those (unbelievers) who are rich, they will start to cry for help"},{"number":65,"text":"We shall tell them, \"Do not cry for help on this day; you will receive none from Us"},{"number":66,"text":"Our revelations had certainly been recited to you, but you turned your backs to them"},{"number":67,"text":"and arrogantly mocked and reviled them"},{"number":68,"text":"Was it that you did not give any thought to it (the Quran)? Was it different from what was revealed to your fathers"},{"number":69,"text":"Or did you not recognize your Messenger and, thus, denied him (Muhammad)"},{"number":70,"text":"or you said that he is possessed by satan? In fact, he has brought you the truth, but most of you dislike it"},{"number":71,"text":"Had the truth followed their desires, the heavens and the earth and all that is in them would have been destroyed. We sent them the Quran but they ignored it"},{"number":72,"text":"(Do they disbelieve because) you asked them for payment? The reward that you will receive from your Lord is the best. He is the best Provider"},{"number":73,"text":"(Muhammad), you certainly have called them to the right path"},{"number":74,"text":"but those who disbelieve the life hereafter deviate from the right path"},{"number":75,"text":"Even if We were to grant them mercy and rescue them from hardship, they would still blindly persist in their rebellion"},{"number":76,"text":"We struck them with torment, but they did not submit themselves to their Lord, nor did they make themselves humble"},{"number":77,"text":"until We opened the gate of greater torment (death) and they suddenly found themselves in despair"},{"number":78,"text":"It is God who has created ears, eyes, and hearts for you. Little are the thanks that you give"},{"number":79,"text":"It is God who has settled you on the earth and before Him you will all be assembled"},{"number":80,"text":"It is He who gives life and causes death and it is He who alternates night and day. Will you not then understand"},{"number":81,"text":"They say exactly the same thing as the people who lived before"},{"number":82,"text":"They say, \"When we die and become dust and bones, shall we then be raised up again"},{"number":83,"text":"Our fathers and we have been given such promises before. These are no more than ancient legends"},{"number":84,"text":"(Muhammad), say to them, \"Tell me, if you know, to whom does the earth and its contents belong"},{"number":85,"text":"They will quickly reply, \"It belongs to God.\" Say, \"Will you not, then, take heed"},{"number":86,"text":"Ask them, \"Who is the Lord of the seven heavens and the Great Throne"},{"number":87,"text":"They will quickly say, \"It is God.\" Say, \"Will you not then have fear of Him"},{"number":88,"text":"Ask them, \"If you have any knowledge, in whose hands is the ownership of all things? Who is the one who gives protection and yet He Himself is never protected"},{"number":89,"text":"They will reply spontaneously, \"It is God.\" Ask them, \"Why has falsehood bewitched you"},{"number":90,"text":"We have sent them the truth and they, certainly, are liars"},{"number":91,"text":"God has never given birth to a son and there is no other god besides Him. If there were, each god would have taken away his creatures and claimed superiority over the others. God is too exalted to be as they believe Him to be"},{"number":92,"text":"He has the knowledge of all seen and unseen things. He is too exalted to be considered equal to anything else"},{"number":93,"text":"Say, \"Lord, if you will afflict them with punishment"},{"number":94,"text":"exclude me from the unjust people"},{"number":95,"text":"We have the Power to strike them with torment before your very eyes"},{"number":96,"text":"Respond to the injustice (done to you) with the better deed. We know best what they attribute to God"},{"number":97,"text":"Say, \"Lord, I seek your protection against the strong temptations of the devils"},{"number":98,"text":"I seek your protection should they approach me"},{"number":99,"text":"When death approaches one of the unbelievers, he says, \"Lord, send me back again"},{"number":100,"text":"so that perhaps I shall act righteously for the rest of my life.\" Although he will say so but his wish will never come true. After death they will be behind a barrier until the day of their resurrection"},{"number":101,"text":"There will be no kindred relations nor any opportunity to ask about others or seek their assistance after the trumpet has sounded"},{"number":102,"text":"If the side of ones good deeds weighs heavier on a scale, he will have everlasting happiness"},{"number":103,"text":"but if it weighs less, one will be lost forever in hell"},{"number":104,"text":"The fire will scorch their faces and they will be groaning therein in pain"},{"number":105,"text":"(They will be told), \"Were Our revelations not recited to you and did you not call them lies"},{"number":106,"text":"They will reply, \"Lord, our hard-heartedness overcame us and we went astray"},{"number":107,"text":"Lord, take us out of this and if we sin again, we shall certainly be unjust"},{"number":108,"text":"He will say, \"Be quiet and say nothing"},{"number":109,"text":"There was a group of my servants among you who always prayed: Lord, forgive us and grant us mercy; You are the best of those who show mercy"},{"number":110,"text":"You mocked and laughed at them until you forgot all about Me"},{"number":111,"text":"On this day I have given them their reward for their exercising patience and it is they who have triumphed"},{"number":112,"text":"God will ask them, \"How many years did you live in your graves"},{"number":113,"text":"They will reply. \"We remained for about a day or part of it, but ask those who have kept count"},{"number":114,"text":"God will say, \"You have indeed remained there for a short time. Would that you knew it during your life time"},{"number":115,"text":"Did you think that We had created you for a playful purpose and that you were not to return to Us"},{"number":116,"text":"God is the most exalted King and the Supreme Truth. He is the only God and the Lord of the Gracious Throne"},{"number":117,"text":"One who worships things besides God has no proof of the authority of such things. God is certainly keeping the record of his deeds. The unbelievers will not have everlasting happiness"},{"number":118,"text":"(Muhammad), say, \"Lord, forgive me and grant me mercy; You are the best of the Merciful Ones"}]}