{"number":71,"edition":"en.sarwar","ayahs":[{"number":1,"text":"We sent Noah to his people telling him, \"Warn your people before a painful torment approaches them"},{"number":2,"text":"Noah said, \"My people, I am warning you plainly"},{"number":3,"text":"Worship God, have fear of Him and obey me"},{"number":4,"text":"He will forgive your sins and give you a respite for an appointed time. When the time which God has appointed arrives, none will be able to postpone it. Would that you knew this"},{"number":5,"text":"Noah said, \"My Lord, I have been preaching to my people, night and day"},{"number":6,"text":"but it has had no effect on them except to make them run away"},{"number":7,"text":"Evert time I invite them to Your (guidance) so that You can forgive them, they put their fingers into their ears, cover their heads with their clothes, persist in their disbelief and display extreme arrogance"},{"number":8,"text":"I preached to them aloud, in public"},{"number":9,"text":"Then I conveyed the message to them, again, both in public and in private"},{"number":10,"text":"and told them, \"Ask forgiveness from your Lord; He is All-forgiving"},{"number":11,"text":"He will send you abundant"},{"number":12,"text":"rain from the sky"},{"number":13,"text":"strengthen you by (providing) you wealth and children, and make gardens and streams for you. What is the matter with you that you are not afraid of the greatness of God"},{"number":14,"text":"who has created you in several stages"},{"number":15,"text":"Have you not seen that God has created the seven heavens one above the other"},{"number":16,"text":"and placed therein the moon as a light"},{"number":17,"text":"and the sun as a torch"},{"number":18,"text":"God made you grow from the earth. He will make you return to it and then take you out of it again"},{"number":19,"text":"God has spread out the earth"},{"number":20,"text":"for you, so that you may walk along its wide roads"},{"number":21,"text":"Noah said, \"Lord, they have disobeyed me and followed those whose wealth and children will only bring about destruction for them"},{"number":22,"text":"They have arrogantly plotted evil plans against me"},{"number":23,"text":"and have said to each other, 'Do not give-up your idols. Do not renounce Wadd, Suwa`, Yaghuth, Ya`uq and Nasr (names of certain idols)"},{"number":24,"text":"They have misled many and the unjust will achieve nothing but more error"},{"number":25,"text":"Because of their sins, they were drowned and made to enter hell. They could find no one to help them besides God"},{"number":26,"text":"Noah said, \"Lord, do not leave a single disbeliever on earth"},{"number":27,"text":"if You do, they will mislead Your servants and will only give birth to ungrateful sinners"},{"number":28,"text":"Lord, forgive me, my parents, the believers who have entered my home and all believing men and women. Give nothing to the unjust but destruction"}]}