{"number":26,"edition":"no.berg","ayahs":[{"number":1,"text":"Ta Sin Mim"},{"number":2,"text":"Dette er den klare skriftens ord"},{"number":3,"text":"Kanskje gremmer du deg til døde over at de ikke vil anta troen"},{"number":4,"text":"Om Vi vil, kan Vi sende ned over dem et tegn fra oven, som deres nakker vil forbli bøyet under"},{"number":5,"text":"Ingen ny formaning kommer til dem fra den Barmhjertige uten at de snur seg bort fra den"},{"number":6,"text":"De forkaster, men snart vil nyheter nå dem om det de drev ap med"},{"number":7,"text":"Legger de ikke merke til jorden, hvor mange herlige sorter Vi har latt vokse frem på den"},{"number":8,"text":"I dette er sannelig et jærtegn, men folk flest tror ikke"},{"number":9,"text":"Herren er i sannhet den Mektige, den Nåderike"},{"number":10,"text":"En gang kalte Herren på Moses: «Gå til det urettferdige folk"},{"number":11,"text":"Faraos folk! Vil de da ikke frykte Gud?»"},{"number":12,"text":"Han svarte: «Herre, jeg frykter at de vil kalle meg løgner"},{"number":13,"text":"og mitt bryst vil snøre seg sammen og mitt tungebånd ikke løses. Så henvend Deg til Aron"},{"number":14,"text":"De har også en skyldanklage mot meg, og jeg frykter at de vil drepe meg.»"},{"number":15,"text":"Han sa: «Å neida, men gå begge to med Vårt ord, og Vi skal være med dere og lytte til"},{"number":16,"text":"Gå til Farao, og si: ’Vi er sendebud for all verdens Herre"},{"number":17,"text":"Send med oss Israels barn!’»"},{"number":18,"text":"Farao svarte: «Har vi ikke oppdratt deg blant oss som barn? Var ikke du hos oss mange år av ditt liv"},{"number":19,"text":"Og du gjorde den gjerning du gjorde, og var utakknemlig!»"},{"number":20,"text":"Moses sa: «Jeg gjorde det den gang, da jeg var av dem som fór vill"},{"number":21,"text":"og så flyktet jeg, da jeg fryktet dere. Men Herren gav meg visdom, og gjorde meg til sendebud"},{"number":22,"text":"Er denne godhet du har vist meg en unnskyldning for å trellbinde Israels barn?»"},{"number":23,"text":"Farao svarte: «Hva er da all verdens Herre?»"},{"number":24,"text":"Han sa: «Herren over himlene og jorden og alt som mellom dem er, om dere hadde visshet.»"},{"number":25,"text":"Da sa Farao til dem rundt seg: «Har dere hørt på maken!»"},{"number":26,"text":"Moses sa: «Deres og deres henfarne fedres Herre.»"},{"number":27,"text":"Da sa Farao: «Det sendebud som er sendt til dere, er visselig forrykt.»"},{"number":28,"text":"Moses fortsatte: «Herren over øst og vest og alt som derimellom er, om dere forstår.»"},{"number":29,"text":"Da sa Farao: «Hvis du antar en annen gud enn meg, vil jeg kaste deg rett i fengsel!»"},{"number":30,"text":"Moses svarte: «Enn om jeg brakte deg noe som klargjør?»"},{"number":31,"text":"Farao sa: «Så bring det, hvis du snakker sant.»"},{"number":32,"text":"Så kastet Moses staven sin, og se, den ble en slange, tydelig og klart"},{"number":33,"text":"Og han trakk frem sin hånd, og se, den syntes hvit for dem som så på"},{"number":34,"text":"Da sa Farao til rådet rundt ham: «Dette er sannelig en habil trollmann"},{"number":35,"text":"Han vil fordrive dere fra deres land med trolldomskunstene sine. Hva foreslår dere?»"},{"number":36,"text":"De svarte: «La det bero med ham og hans bror, og send oppbud til alle byer"},{"number":37,"text":"så de bringer deg alle dyktige trollmenn.»"},{"number":38,"text":"Trollmennene ble samlet til fastsatt tid og dag"},{"number":39,"text":"Folket ble spurt: «Vil dere komme sammen"},{"number":40,"text":"Kanskje vi vil følge trollmennene om de blir vinnere.»"},{"number":41,"text":"Da trollmennene hadde innfunnet seg, sa de til Farao: «Får vi en belønning om vi vinner?»"},{"number":42,"text":"Og han svarte: «Ja, da blir dere av min nærmeste krets.»"},{"number":43,"text":"Moses sa til dem: «Kast det dere vil kaste!»"},{"number":44,"text":"Så kastet de sine tau og staver, og sa: «Ved Faraos makt, vi skal sannelig vinne!»"},{"number":45,"text":"Så kastet Moses sin stav, og se, den slukte det de hadde svindlet i hop"},{"number":46,"text":"Og trollmennene måtte kaste seg ned i ærefrykt, og sa"},{"number":47,"text":"«Vi tror på all verdens Herre"},{"number":48,"text":"– Mose og Arons Herre!»"},{"number":49,"text":"Da sa Farao: «Tror dere denne mannen før jeg har gitt dere tillatelse? Han er vel deres læremester som har lært dere trolldom. Nå skal dere får å vite! Jeg skal sannelig hugge av deres hender og føtter i kryss, og så korsfeste dere alle sammen.»"},{"number":50,"text":"De svarte: «Det gjør ingenting! Vi vender tilbake til vår Herre"},{"number":51,"text":"Vi ønsker inderlig at vår Herre må tilgi oss våre feiltrinn, siden vi er de første troende.»"},{"number":52,"text":"Så gav Vi Moses denne inspirasjon: «Dra av gårde med Mine tjenere nattestid! Dere blir nok forfulgt.»"},{"number":53,"text":"Så sendte Farao opprop til byene"},{"number":54,"text":"«Disse er bare en liten flokk"},{"number":55,"text":"men de har forarget oss"},{"number":56,"text":"skjønt vi er tallrike og på vakt.»"},{"number":57,"text":"Så Vi fordrev dem fra haver og kilder"},{"number":58,"text":"og skatter og et fint bosted"},{"number":59,"text":"Slik var det. Og Vi lot Israels barn arve det"},{"number":60,"text":"Men egypterne forfulgte dem på vei østover, og"},{"number":61,"text":"da de to hærskarer fikk øye på hverandre, sa folket til Moses: «Vi blir innhentet!»"},{"number":62,"text":"Moses sa: «Å nei, Herren er med meg! Han vil lede meg.»"},{"number":63,"text":"Og Vi gav Moses denne inspirasjon. «Slå havet med din stav!» Og det delte seg, og hver side var som et stort fjell"},{"number":64,"text":"Vi lot de andre komme derhen"},{"number":65,"text":"Og Vi reddet Moses og dem som var med ham, alle sammen"},{"number":66,"text":"og så druknet Vi de andre"},{"number":67,"text":"I dette er visselig et tegn! Men folk flest tror ikke"},{"number":68,"text":"Sannelig, Herren er den Mektige, den Nåderike"},{"number":69,"text":"Les frem for dem historien om Abraham"},{"number":70,"text":"En gang sa han til sin far og sitt folk: «Hva er det dere tilber?»"},{"number":71,"text":"De svarte: «Vi tilber avguder, og fortsetter å holde oss til dem.»"},{"number":72,"text":"Da sa han: «Hører de dere, når dere ber"},{"number":73,"text":"Eller gir de dere gagn eller skade?»"},{"number":74,"text":"De svarte: «Nei, men vi fant at våre fedre gjorde dette.»"},{"number":75,"text":"Han sa: «Hva mener dere om dem dere har tilbedt"},{"number":76,"text":"dere og deres henfarne fedre"},{"number":77,"text":"De er en fiende for meg. Ikke så med all verdens Herre"},{"number":78,"text":"Som har skapt meg, og gir meg ledelse"},{"number":79,"text":"som gir meg mat og drikke"},{"number":80,"text":"som helbreder meg når jeg er syk"},{"number":81,"text":"som lar meg dø og så gir meg liv"},{"number":82,"text":"som jeg inderlig håper vil tilgi meg mine feiltrinn på dommens dag"},{"number":83,"text":"Herre, gi meg visdom, og foren meg med de rettferdige"},{"number":84,"text":"og gi meg et godt ettermæle blant kommende slekter"},{"number":85,"text":"Gjør meg til arving av lykksalighetens have"},{"number":86,"text":"Tilgi min far! Han var av de villfarende"},{"number":87,"text":"Gjør meg ikke til skamme på den dag da alle gjenoppvekkes"},{"number":88,"text":"den dag da verken rikdom eller barn gagner"},{"number":89,"text":"kun den som kommer til Gud med et rent hjerte.»"},{"number":90,"text":"Og paradiset bringes nær de gudfryktige"},{"number":91,"text":"Og helvete bringes for øynene på de villfarende"},{"number":92,"text":"Det sies til dem: «Hvor er nå det som dere tilbad"},{"number":93,"text":"utenom Gud? Kan de hjelpe dere, eller seg selv?»"},{"number":94,"text":"Så kastes de inn i det, både de og forførerne"},{"number":95,"text":"og Satans skarer, alle sammen"},{"number":96,"text":"Og de sier, mens de krangler"},{"number":97,"text":"«Ved Gud, vi var sannelig i klar villfarelse"},{"number":98,"text":"da vi satte dere på linje med all verdens Herre"},{"number":99,"text":"Det var synderne som villedet oss"},{"number":100,"text":"Og nå har vi ingen til å tale vår sak"},{"number":101,"text":"ingen god venn"},{"number":102,"text":"Kunne vi bare gjøre det hele om igjen, og bli troende!»"},{"number":103,"text":"I dette er visselig et jærtegn! Men folk flest tror ikke"},{"number":104,"text":"Herren er den Mektige, den Nåderike"},{"number":105,"text":"Noas folk kalte sendebudene for løgnere"},{"number":106,"text":"da deres bror Noa sa til dem: «Vil dere ikke være gudfryktige"},{"number":107,"text":"Jeg er et pålitelig sendebud til dere"},{"number":108,"text":"så frykt Gud, og adlyd meg"},{"number":109,"text":"Jeg ber dere ikke om noen lønn for dette, min lønn er en sak for all verdens Herre"},{"number":110,"text":"Så frykt Gud, og adlyd meg.»"},{"number":111,"text":"De svarte: «Skal vi ha tiltro til deg, som bare de laveste lag slutter seg til?»"},{"number":112,"text":"Han sa: «Jeg kjenner ikke til hva de har gjort"},{"number":113,"text":"Deres regnskap er Herrens sak, om dere bare ante"},{"number":114,"text":"Jeg driver ikke de troende bort"},{"number":115,"text":"Jeg er bare en klar advarer.»"},{"number":116,"text":"De sa de: «Hvis du ikke holder opp, Noa, vil du bli steinjaget.»"},{"number":117,"text":"Han sa: «Herre, mitt folk kaller meg løgner"},{"number":118,"text":"Finn Du en ordning mellom meg og dem, og redd meg og de troende som er med meg.»"},{"number":119,"text":"Så reddet Vi ham og dem som var med ham i det fullastede skip"},{"number":120,"text":"Derpå druknet Vi dem som var igjen"},{"number":121,"text":"Heri er visselig et tegn! Men folk flest tror ikke"},{"number":122,"text":"Herren er den Mektige, den Nåderike"},{"number":123,"text":"Folket Ad kalte sendebudene for løgnere"},{"number":124,"text":"da deres bror Hod sa til dem: «Vil dere ikke være gudfryktige"},{"number":125,"text":"Jeg er et pålitelig sendebud til dere"},{"number":126,"text":"så frykt Gud, og adlyd meg"},{"number":127,"text":"Jeg ber dere ikke om noen lønn for dette. Min lønn er en sak for all verdens Herre"},{"number":128,"text":"Bygger dere på hver høyde et symbolsk tegn til ingen nytte"},{"number":129,"text":"og legger dere til borger, kanskje dere skal leve evig"},{"number":130,"text":"Og når dere går til angrep, angriper dere som voldsmenn"},{"number":131,"text":"Så frykt Gud, og adlyd meg"},{"number":132,"text":"frykt Ham som har hjulpet dere til alt dere vet"},{"number":133,"text":"hjulpet dere til fe og sønner"},{"number":134,"text":"haver og kilder"},{"number":135,"text":"Jeg frykter for at dere vil rammes av en svær dags straff.»"},{"number":136,"text":"De svarte: «Det er det samme for oss om du formaner eller ikke formaner"},{"number":137,"text":"Dette er bare tradisjoner fra de henfarne"},{"number":138,"text":"Vi rammes ikke av straff!»"},{"number":139,"text":"De kalte ham løgner, og Vi tilintetgjorde dem. Heri er visselig et tegn! Men folk flest tror ikke"},{"number":140,"text":"Herren er den Mektige, den Nåderike"},{"number":141,"text":"Folket Thamod kalte sendebudene for løgnere"},{"number":142,"text":"da deres bror Salih sa til dem: «Vil dere ikke være gudfryktige"},{"number":143,"text":"Jeg er et pålitelig sendebud til dere"},{"number":144,"text":"så frykt Gud, og adlyd meg"},{"number":145,"text":"Jeg ber dere ikke om noen lønn for dette. Min lønn er en sak for all verdens Herre"},{"number":146,"text":"Vil dere bli latt i fred med alt som her er"},{"number":147,"text":"haver og kilder"},{"number":148,"text":"åkerland og palmer med fine fruktkolber"},{"number":149,"text":"Og glade og fornøyde å hugge dere ut boliger i fjellsidene"},{"number":150,"text":"Så frykt Gud, og adlyd meg"},{"number":151,"text":"Hør ikke etter de lettsindiges påbud"},{"number":152,"text":"de som anstifter fordervelse på jorden og ikke setter tingene på rett plass.»"},{"number":153,"text":"De svarte: «Du er bare en forhekset mann"},{"number":154,"text":"du er bare et vanlig menneske som oss! Kom med et jærtegn, om du snakker sant.»"},{"number":155,"text":"Han sa: «Dette er en kamelhoppe. Hun skal ha drikke, og dere skal ha drikke på bestemte dager"},{"number":156,"text":"Gjør henne ikke noe ondt, så ikke en svær dags straff tar dere.»"},{"number":157,"text":"Men de mishandlet henne, og det kom de til å angre"},{"number":158,"text":"For straffen tok dem. Heri er visselig et tegn! Men folk flest tror ikke"},{"number":159,"text":"Herren er den Mektige, den Nåderike"},{"number":160,"text":"Lots folk kalte sendebudene for løgnere"},{"number":161,"text":"da deres bror Lot sa til dem: «Vil dere ikke være gudfryktige"},{"number":162,"text":"Jeg er et pålitelig sendebud til dere"},{"number":163,"text":"så frykt Gud, og adlyd meg"},{"number":164,"text":"Jeg ber dere ikke om noen lønn for dette. Min lønn er en sak for all verdens Herre"},{"number":165,"text":"Er det slik at dere holder dere til menn fortrinnsvis"},{"number":166,"text":"og forsømmer deres hustruer som Herren har skapt for dere? Nei, dere er et folk som går over grensen.»"},{"number":167,"text":"De svarte: «Hvis du ikke holder opp, Lot, vil du bli jaget bort.»"},{"number":168,"text":"Da sa han: «Jeg avskyr i sannhet det dere gjør"},{"number":169,"text":"Herre, redd meg og mine fra det de bedriver.»"},{"number":170,"text":"Så reddet Vi ham og hans, alle sammen"},{"number":171,"text":"unntatt en gammel kone blant de gjenværende"},{"number":172,"text":"Så ødela Vi de andre"},{"number":173,"text":"Vi lot et regn regne over dem. Ondt er regnet til dem som er advart"},{"number":174,"text":"Heri er visselig et tegn! Men folk flest tror ikke"},{"number":175,"text":"Herren er den Mektige, den Nåderike"},{"number":176,"text":"Skogfolket kalte sendebudene for løgnere"},{"number":177,"text":"da Shoaib sa til dem: «Vil dere ikke være gudfryktige"},{"number":178,"text":"Jeg er et pålitelig sendebud til dere"},{"number":179,"text":"så frykt Gud, og adlyd meg"},{"number":180,"text":"Jeg ber dere ikke om noen lønn for dette. Min lønn er en sak for all verdens Herre"},{"number":181,"text":"Gi fullt mål, og vær ikke av dem som snyter"},{"number":182,"text":"Vei med riktig vekt"},{"number":183,"text":"og snyt ikke folk på det som er deres. Stift ikke urett og fordervelse i landet"},{"number":184,"text":"Frykt Ham som har skapt dere og de henfarne slekter.»"},{"number":185,"text":"De svarte: «Du er bare en forhekset mann"},{"number":186,"text":"du er bare et vanlig menneske som oss! Vi holder deg for å være en løgner"},{"number":187,"text":"La falle over oss stykker av himmelen, om du snakker sant.»"},{"number":188,"text":"Han sa: «Herren kjenner vel til hva dere bedriver.»"},{"number":189,"text":"De kalte ham løgner, men så tok skyggens dags straff dem. Det var i sannhet en svær dags straff"},{"number":190,"text":"Heri er visselig et tegn! Men folk flest tror ikke"},{"number":191,"text":"Herren er den Mektige, den Nåderike"},{"number":192,"text":"Dette er en åpenbaring fra all verdens Herre"},{"number":193,"text":"den betrodde Ånd steg ned med den"},{"number":194,"text":"til ditt hjerte, så du kunne bli en advarer"},{"number":195,"text":"på klart, arabisk språk"},{"number":196,"text":"Den finnes i de gamles skrifter"},{"number":197,"text":"Er det da ikke et tegn for dem at Israels skriftlærde kjenner til den"},{"number":198,"text":"Hadde Vi sendt den til noen blant de fremmede folk"},{"number":199,"text":"og han hadde fremlest den for dem, så ville de ikke ha trodd på den"},{"number":200,"text":"Slik bringer Vi den inn i syndernes hjerter"},{"number":201,"text":"Men de tror ikke på den, før de ser den smertefulle straff"},{"number":202,"text":"så den vil komme over dem plutselig, uten at de aner noe"},{"number":203,"text":"Og de vil si: «Kan vi få utsettelse?»"},{"number":204,"text":"Skulle de be om å få Vår straff påskyndet"},{"number":205,"text":"Hva synes du? Vi har latt dem nyte livet i årevis"},{"number":206,"text":"og så kommer det over dem som er stilt dem i utsikt"},{"number":207,"text":"De gode dager de fikk nyte hjelper dem ikke"},{"number":208,"text":"Ingen by har Vi ødelagt uten at den hadde fått advarere"},{"number":209,"text":"til påminnelse. Vi var ikke urettferdige"},{"number":210,"text":"Satanene har ikke brakt Koranen ned"},{"number":211,"text":"Det passer seg ikke for dem, og de kan det heller ikke"},{"number":212,"text":"De er avskåret fra å snappe opp noe"},{"number":213,"text":"Så påkall ingen gud ved Guds side, så du havner blant dem som lider straff"},{"number":214,"text":"Advar din familie og dine nærmeste"},{"number":215,"text":"Brus ikke med vingene, men senk din vinge overfor de troende som følger deg"},{"number":216,"text":"Om de ikke lyder deg, så si: «Jeg er ansvarsfri for det dere gjør.»"},{"number":217,"text":"Forlat deg på den Mektige, den Nåderike"},{"number":218,"text":"som ser deg der du står"},{"number":219,"text":"og når du ferdes blant de bedende"},{"number":220,"text":"Han er den Hørende, den Allvitende"},{"number":221,"text":"Skal Jeg fortelle dere hvem satanene slår seg ned på"},{"number":222,"text":"De slår seg ned på enhver som er syndbelastet og falsk"},{"number":223,"text":"og forteller ham hva de har hørt. Men de fleste av dem er løgnere"},{"number":224,"text":"Likeledes skaldene, de forførte følger dem"},{"number":225,"text":"Har du ikke sett at de streifer om i alle daler"},{"number":226,"text":"og uttaler det de ikke selv praktiserer"},{"number":227,"text":"Unntatt er de som tror og lever rettskaffent og ideligen kommer Gud i hu, som finner hjelp når de har lidt urett. De som gjør urett skal få vite hvilken skjebne de vender seg mot"}]}