{"number":30,"edition":"no.berg","ayahs":[{"number":1,"text":"Alif Lam Mim"},{"number":2,"text":"Østromerne har lidd nederlag"},{"number":3,"text":"i nabolandet, men etter sitt nederlag vil de seire"},{"number":4,"text":"om få år, – saken er i Guds hånd, før og etter, og på den dag vil de troende glede seg –"},{"number":5,"text":"seire ved Guds hjelp. Han gir hjelp til den Han vil. Han er den Mektige, den Nåderike"},{"number":6,"text":"Guds løfte! Gud bryter ikke sitt løfte. Men folk flest vet ikke"},{"number":7,"text":"De kjenner bare de ytre sider av jordelivet, men overser det hinsidige"},{"number":8,"text":"Reflekterer de ikke i sitt indre? Gud har skapt himlene og jorden og alt som mellom dem er, på alvor og for en fastsatt frist. Men mange mennesker fornekter møtet med sin Herre"},{"number":9,"text":"Har de ikke reist rundt på jorden og sett hva enden ble for dem som levde før? De var mektigere, og dyrket og bebygget jorden bedre enn de selv. Deres sendebud kom til dem med klar beskjed! Gud var ikke den som gjorde dem urett, mens deres egen urett vendte seg mot dem selv"},{"number":10,"text":"De som gjorde ondt, fikk en ond ende, for de kalte Guds ord for løgn og drev ap med det"},{"number":11,"text":"Gud frembringer all skapningen, og Han gjør det på nytt. Så vil dere bringes tilbake til Ham"},{"number":12,"text":"Den dag timen kommer, vil synderne fortvile"},{"number":13,"text":"De har ingen av sine medguder til å legge inn ord for seg, og de vil forkaste sine medguder"},{"number":14,"text":"Den dag timen kommer, blir menneskene delt"},{"number":15,"text":"De som trodde og handlet rett, vandrer i glede i paradisets enger"},{"number":16,"text":"Men de som var vantro og fornektet Vårt ord, og møtet i det kommende liv, de må møte til straffen"},{"number":17,"text":"Gud være lovet, når dere går inn i kvelden, og når dere møter morgenen"},{"number":18,"text":"Ham tilhører lovprisningen i himlene og på jord, i kveldingen og i middagstimen"},{"number":19,"text":"Han frembringer det levende av det døde og dødt av liv, og Han gir jorden liv etter dens dvale. På samme måte skal dere bli brakt frem"},{"number":20,"text":"Blant Hans tegn er at Han skapte dere av støv, og se, dere ble mennesker, spredt omkring"},{"number":21,"text":"Blant Hans tegn er også at Han skapte for dere hustruer av deres egen sort, for at dere kan finne ro hos dem. Og Han har lagt kjærlighet og godhet mellom dere. I dette er jærtegn for mennesker som tenker etter"},{"number":22,"text":"Blant Hans tegn er skapelsen av himlene og jorden, og forskjellen i tungemål og farge. I dette er jærtegn for dem som vet"},{"number":23,"text":"Til Hans tegn hører søvnen, om natten og om dagen, og deres bestrebelser for å oppnå noe av Hans goder. I dette er jærtegn for dem som hører"},{"number":24,"text":"Blant Hans tegn er lynet, med redsel og med håp, og at Han sender vann fra oven og gir jorden liv etter dens dvale. I dette er jærtegn for folk som forstår"},{"number":25,"text":"Blant Hans tegn er at himmel og jord består på Hans bud. I sin tid, når Hans røst kaller dere ut av jorden, se, dere vil komme frem"},{"number":26,"text":"Ham tilhører alle i himlene og på jord, alle er Ham underdanig"},{"number":27,"text":"Gud frembringer all skapningen, og Han gjør det på nytt. Dette er lett for Ham. Han er det høyeste som tenkes kan, i himlene og på jord. Han er den Mektige, den Vise"},{"number":28,"text":"Han fremsetter en lignelse for dere fra deres egne forhold. Er det vel så at dere slaver er kompanjonger i det Vi lar dere få? Så dere er likestilte i så henseende? Og respekterer dem som dere respekterer hverandre? Således forklarer Vi ordet for folk som forstår"},{"number":29,"text":"Nei, de urettferdige følger sine egne ideer, uten kunnskap. Hvem kan vel lede dem som Gud lar seile sin egen sjø? De har ingen hjelpere"},{"number":30,"text":"Vend deg mot religionen som Gud-søker, ved den Guds intuisjon som Han har utstyrt menneskene med. Det er ingen avvik i det Gud har skapt. Dette er rett religion, men folk flest vet det ikke"},{"number":31,"text":"Vend dere til Ham, frykt Ham, overhold bønnen, og vær ikke av dem som setter medguder ved Hans side"},{"number":32,"text":"av dem som splitter sin religion og blir sekter, hvor hver gruppe fryder seg over sitt"},{"number":33,"text":"Hvis nød rammer menneskene, påkaller de Herren i omvendelse, men så når Han lar dem smake sin barmhjertighet, vil noen av dem gi Ham medguder"},{"number":34,"text":"i utakknemlighet for det Vi har gitt dem: «Lev deres glade dager. Dere skal få å vite!»"},{"number":35,"text":"Eller har Vi sendt dem autorisasjon som omtaler det de setter ved Hans side"},{"number":36,"text":"Viser Vi menneskene godhet, så fryder de seg over det. Men hvis ondt rammer dem for det de selv har stelt i stand, så er de fortvilede"},{"number":37,"text":"Har de ikke sett at Gud gir sine gaver, rikelig eller tilmålt, til den Han vil? I dette er jærtegn for folk som tror"},{"number":38,"text":"Så gi din slektning det som tilkommer ham, og den fattige og den veifarende. Dette er best for dem som vil oppnå Guds bevåkenhet. Dem vil det gå godt"},{"number":39,"text":"Det dere gir ut av utbyttingslån for forøkelse på folks bekostning, det gir ingen forøkelse hos Gud. Men det dere gir i gaver for å oppnå Guds bevåkenhet, gir mangedoblet verdi for giverne"},{"number":40,"text":"Gud er det som har skapt dere og underholder dere. Så vil Han la dere dø, og derpå gi dere nytt liv. Er det noen av dere medguder som kan gjøre slike ting"},{"number":41,"text":"Fordervelse og ødeleggelse er å se på land og hav, ved det menneskene ved sine henders verk har oppnådd, så Han kan gi dem å smake litt av det de har stelt i stand, så de må vende om"},{"number":42,"text":"Si: «Reis omkring på jorden og se hva enden ble for dem som levde før!» De fleste av dem var avgudsdyrkere"},{"number":43,"text":"Vend ditt ansikt mot den rette religion før det kommer en dag fra Gud som ikke kan avverges. Denne dag vil menneskeheten bli delt"},{"number":44,"text":"Den som ikke tror, blir belastet sin vantro. Den som handler rett, legger til rette for seg selv"},{"number":45,"text":"så Han kan belønne dem som tror og handler rett av sin overflod. Han liker ikke vantro"},{"number":46,"text":"Blant Hans jærtegn er vindene, som Han sender med godt budskap, så Han vil la dere smake av Sin nåde, så skipene kan seile ved Hans bud, så dere kan strebe etter Hans gode, så dere må bli takknemlige"},{"number":47,"text":"Vi har sendt sendebud til deres folk før deg. De kom til dem med klar beskjed. Vi tok hevn over dem som syndet. Det påligger Oss å hjelpe de troende"},{"number":48,"text":"Gud sender vindene som driver opp skyer. Så sprer Han dem på himmelen, slik Han vil. Så lar Han dem tetne, og du ser regnet strømme fra dem. Han lar regnet falle på hvem Han vil av Sine tjenere"},{"number":49,"text":"og de fryder seg, skjønt før det ble sendt ned til dem, var de i fortvilelse"},{"number":50,"text":"Se Guds nådes spor, hvordan Han gir jorden liv etter dens dvale. Han er også de dødes livgiver. Han har makt over alle ting"},{"number":51,"text":"Men om Vi sendte en vind, og de så alt gulne? Etter det ville de forbli vantro"},{"number":52,"text":"Du kan ikke få døde til å høre! Du kan heller ikke få døve til å høre kallet, når de snur ryggen til og går"},{"number":53,"text":"Du kan ikke lede blinde ut av deres villfarelse! Du kan ikke få noen til å høre, unntatt de som tror på Vårt ord, og gir seg inn under Guds vilje"},{"number":54,"text":"Gud er den som skaper dere i svakhet. Så, etter svakheten, gir Han styrke, og så, etter styrke, gir Han svakhet og hvite hår. Han skaper det Han vil. Han er den Allvitende, den Allmektige"},{"number":55,"text":"Den dag, når timen kommer, vil synderne sverge at de ikke hadde mer enn en times tid på seg. Således var de på avveie"},{"number":56,"text":"Men de som ble gitt kunnskap og tro, vil si: «Dere har hatt tid på dere, etter Guds bok, til oppstandelsens dag. Og dette er oppstandelsens dag, men dette visste dere ikke.»"},{"number":57,"text":"Denne dag vil deres utflukter ikke tjene dem som gjør urett, og de gis ingen anledning til å forbedre seg"},{"number":58,"text":"Vi har gitt all slags lignelser for menneskene i denne Koran. Men kommer du til dem med et ord, så vil de vantro si: «Dere står for intet annet enn det verdiløse.»"},{"number":59,"text":"Slik forsegler Gud hjertene hos dem som intet forstår"},{"number":60,"text":"Vær standhaftig. Guds løfter er sannhet! La ikke dem som ikke har troens visshet, få deg til å vakle"}]}