{"number":53,"edition":"no.berg","ayahs":[{"number":1,"text":"Ved stjernen når den går ned"},{"number":2,"text":"Deres bysbarn farer ikke vill, og han tar ikke feil"},{"number":3,"text":"Ei heller taler han av eget påfunn"},{"number":4,"text":"Dette er intet annet enn en åpenbaring som er åpenbart"},{"number":5,"text":"En som er veldig i makt, har undervist ham"},{"number":6,"text":"Begavet med innsikt. Han stod der majestetisk"},{"number":7,"text":"i den høyeste horisont"},{"number":8,"text":"Så nærmet han seg og svevet"},{"number":9,"text":"på to buelengders avstand eller nærmere"},{"number":10,"text":"Så åpenbarte han for sin tjener det han åpenbarte"},{"number":11,"text":"Ikke har fantasien oppdiktet det han så"},{"number":12,"text":"Hvordan kan dere tviste med ham om det han selv har sett"},{"number":13,"text":"Han så ham også stige ned en annen gang"},{"number":14,"text":"ved det borteste lotustreet"},{"number":15,"text":"ved Ma’wa-haven"},{"number":16,"text":"da lotustreet var overdekket"},{"number":17,"text":"Blikket var fast, og vandret ikke"},{"number":18,"text":"Han så i sannhet ett av sin Herres største tegn"},{"number":19,"text":"Hva mener dere om al-Lat og al-Ussa"},{"number":20,"text":"og dertil den tredje gudinne, Manat"},{"number":21,"text":"Skal dere ha sønner, og Han døtre"},{"number":22,"text":"Det var en urettferdig fordeling"},{"number":23,"text":"Nei, de er bare navn, som dere og deres fedre har funnet på. Gud har ikke sendt noen autorisasjon for dem. De følger bare formodninger og det de selv ønsker, mens ledelsen faktisk er kommet til dem fra deres Herre"},{"number":24,"text":"Skal vel mennesket få alt det ønsker seg"},{"number":25,"text":"Gud tilhører det siste og det første"},{"number":26,"text":"Hvor mange engler er det ikke i himlene hvis forbønn ikke hjelper? Med mindre Gud har gitt samtykke for den Han vil og som finner Hans behag"},{"number":27,"text":"De som ikke tror på det kommende liv, gir englene kvinnenavn"},{"number":28,"text":"Men dette vet de ingenting om, de følger bare formodninger. Og formodninger hjelper ingenting mot sannhet"},{"number":29,"text":"Så vend deg bort fra den som vender Vår formaning ryggen, og ikke ønsker annet enn livet på jorden"},{"number":30,"text":"Dette er summen av deres kunnskap. Gud vet godt hvem som forvillet seg bort fra Hans vei, og Han vet godt hvem som lar seg lede"},{"number":31,"text":"Gud tilhører alt som er i himlene og på jord, så Han kan lønne dem som gjør ondt for deres gjerninger, og belønne dem som handler vel med det aller beste"},{"number":32,"text":"For dem som unngår grov synd og umoral, unntatt mindre feiltrinn, se, Gud er raus med tilgivelse. Han kjenner dere godt, da Han laget dere av jord og da dere var fostre i mors liv. Så rettferdiggjør ikke dere selv. Gud vet best hvem som er gudfryktige"},{"number":33,"text":"Hva mener du om den som vender ryggen til"},{"number":34,"text":"og gir lite, og bare motvillig"},{"number":35,"text":"Kjenner han vel det skjulte, så han kan se"},{"number":36,"text":"Er han ikke underrettet om hva som står på Mose skriftblader"},{"number":37,"text":"Eller Abrahams, han som"},{"number":38,"text":"fullt ut oppfylte sin plikt? At ingen kan bære en annens byrde"},{"number":39,"text":"at intet tilkommer et menneske uten det han selv har strevet for, og"},{"number":40,"text":"at hans strev skal komme for dagen"},{"number":41,"text":"Så vil han få sin lønn fullt ut"},{"number":42,"text":"At hos din Herre er slutten"},{"number":43,"text":"At Han er Den som fremkaller latter og gråt"},{"number":44,"text":"At Han er Den som fremkaller død og liv"},{"number":45,"text":"At Han skaper de to kjønn, hankjønn og hunkjønn"},{"number":46,"text":"av en dråpe som utstøtes"},{"number":47,"text":"At Han står for den annen skapelse"},{"number":48,"text":"At Han gir rikdom og velstand"},{"number":49,"text":"At Han er Sirius’ Herre"},{"number":50,"text":"At Han tilintetgjorde det gamle folket Ad"},{"number":51,"text":"og av Thamod sparte Han ingen"},{"number":52,"text":"Og Noas folk tidligere, de var særlig onde og oppsetsige"},{"number":53,"text":"Den sammenstyrtede by har Han latt falle over ende"},{"number":54,"text":"og det som dekker den, dekker den"},{"number":55,"text":"Hvilke av Guds velgjerninger vil du bestride"},{"number":56,"text":"Dette er en advarsel i tråd med tidligere advarsler"},{"number":57,"text":"Det overhengende er overhengende"},{"number":58,"text":"Bare Gud kan bringe det frem"},{"number":59,"text":"Er dere forundret over dette budskap"},{"number":60,"text":"Ler dere, og gråter ikke"},{"number":61,"text":"I ubekymret lek"},{"number":62,"text":"Fall ned for Gud, og tilbe Ham"}]}