{"number":53,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"By the star when it setteth"},{"number":2,"text":"Your companion hath not gone astray, nor hath he erred"},{"number":3,"text":"And he speaketh not of his own desire"},{"number":4,"text":"It is but a revelation revealed"},{"number":5,"text":"One of mighty powers hath taught it him"},{"number":6,"text":"One strong of make. Then he stood straight"},{"number":7,"text":"While he was on the uppermost horizon"},{"number":8,"text":"Thereafter he drew nigh, then he let himself down"},{"number":9,"text":"Till he was two bows length off or yet nearer"},{"number":10,"text":"Thus He revealed Unto His bondman whatsoever He revealed"},{"number":11,"text":"The heart lied not in that which he saw"},{"number":12,"text":"Will ye therefore dispute with him concerning that which he hath Seen"},{"number":13,"text":"And assuredly he saw him at another descent"},{"number":14,"text":"Nigh Unto the lote-tree at the boundary"},{"number":15,"text":"Nigh thereto is the Garden of Abode"},{"number":16,"text":"When that covered the lote-tree which covered it"},{"number":17,"text":"The sight turned not aside, nor it exceeded"},{"number":18,"text":"Assuredly he beheld of the sign of his Lord, the greatest"},{"number":19,"text":"Have ye then considered Al-Lat and AL-'uzza"},{"number":20,"text":"And Manat the other third"},{"number":21,"text":"What!-Unto YOu the males and Unto Him the females"},{"number":22,"text":"That indeed is a division unfair"},{"number":23,"text":"They are but names which ye have named, ye and your fathers, for which Allah hath sent down no authority. They follow but their fancy, and that which pleaseth their souls; whereas assuredly there hath come Unto them from their Lord the guidance"},{"number":24,"text":"Shall man have whatsoever he wisheth for"},{"number":25,"text":"Allah's is the last and the first"},{"number":26,"text":"And many soever are angels in the heavens whose intercession shall not avail at all save after Allah hath given leave for whomsoever He listeth and pleaseth"},{"number":27,"text":"Verily those who believe not in the Hereafter name the angels with the names of females"},{"number":28,"text":"And they have no knowledge thereof; they follow but a vain opinion, and verily a vain opinion attaineth not aught of the truth"},{"number":29,"text":"Wherefore withdraw thou from him who turneth away from Our admonition and seeketh not but the life of the world"},{"number":30,"text":"That is their highest point of knowledge. Verily thine Lord! it is He Who is the Best Knower of him who strayeth from His way, and He is the Best Knower of him who letteth himself be guided"},{"number":31,"text":"And Allah's is whatsoever is in the heavens and whatsoever is in the earth, that He may recompense those who do evil for that which they worked and reward those who do good with good"},{"number":32,"text":"They are those who avoid enormities of sin and abominations save the minor offences. Verily thy Lord is of vast for giveness: He is Best Knower of you when He produced you out Of the earth, and when ye were embryos in the bellies of your mothers. So justify not yourselves; He is the Best Knower of him who feareth Him"},{"number":33,"text":"Observedest thou him who turned away"},{"number":34,"text":"And gave little, and then stopped"},{"number":35,"text":"Is with him knowledge of the unseen so that he seeth"},{"number":36,"text":"Hath he not been told of that which is in the writs of Musa"},{"number":37,"text":"And of Ibrahim who faithfully fulfilled"},{"number":38,"text":"To wit, that a burthened soul shall not bear the burthen of another"},{"number":39,"text":"And that for man shall be naught save that wherefor he endeavoureth"},{"number":40,"text":"And that his endeavour shall be presently observed"},{"number":41,"text":"Thereafter he shall be recompensed therefor with the fullest recompense"},{"number":42,"text":"And that Unto thy Lord is the goal"},{"number":43,"text":"And that it is He Who causeth to laugh and causeth to weep"},{"number":44,"text":"And that it is He Who causeth to die and causeth to live"},{"number":45,"text":"And that He createth the pair, the male and the female"},{"number":46,"text":"From seed when it is emitted"},{"number":47,"text":"And that upon Him is another bringing forth"},{"number":48,"text":"And that it is He Who enricheth and preserveth property"},{"number":49,"text":"And that it is He Who is the Lord of Sirius"},{"number":50,"text":"And that He destroyed the former 'A-ad"},{"number":51,"text":"And that Thamud! He left not"},{"number":52,"text":"And also the people of Nuh aforetime. Verily they were even greater wrong-doers and more contumacious"},{"number":53,"text":"And the subverted cities He overthrew"},{"number":54,"text":"Then covered them with that which covered them"},{"number":55,"text":"Which then of thy Lord's benefits wilt thou doubt"},{"number":56,"text":"This is a warner of the warners of old"},{"number":57,"text":"There hath approached the approaching Hour"},{"number":58,"text":"None, except Allah, can avert it"},{"number":59,"text":"At this discourse then marvel ye"},{"number":60,"text":"And laugh and not weep"},{"number":61,"text":"And ye are behaving proudly"},{"number":62,"text":"So prostrate yourselves before Allah and worship"}]}