{"number":68,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"Nun By the pen and by that which they inscribe"},{"number":2,"text":"Thou art nor, through the grace of thy Lord, mad"},{"number":3,"text":"And verily thine shall be a hire unending"},{"number":4,"text":"And verily thou art of a high and noble disposition"},{"number":5,"text":"Anon thou wilt see and they will see"},{"number":6,"text":"Which of you is afflicted with madness"},{"number":7,"text":"Verily thy Lord! He is the best Knower of him who strayeth from His path, and He is the best Knower of the guided one"},{"number":8,"text":"Wherefore obey not thou the beliers"},{"number":9,"text":"Fain would they that thou shouldst be pliant, so that they will be pliant"},{"number":10,"text":"And obey not: thou any swearer ignominous"},{"number":11,"text":"A defamer, spreader abroad of slander"},{"number":12,"text":"Hinderer of the good, trespasser; sinner"},{"number":13,"text":"Gross, and therewithal ignoble"},{"number":14,"text":"Because he is owner of riches and children"},{"number":15,"text":"When Our revelations are rehearsed Unto him, he saith: fables of the ancients"},{"number":16,"text":"Anon We shall brand him on snout"},{"number":17,"text":"Verily We! We have proved them even as We proved the fellows of a garden when they swarethat they would surely reap it in the morning"},{"number":18,"text":"And they made not the exception"},{"number":19,"text":"Wherefore an encircling visitation visited it even as they slept on"},{"number":20,"text":"Then in the morning it became as though it had been reaped"},{"number":21,"text":"Then they cried out Unto each other in the morning"},{"number":22,"text":"Saying: go out betimes to your tilth if ye would reap"},{"number":23,"text":"So they went off speaking to each other in a low voice"},{"number":24,"text":"Let there not enter upon you today any needy man"},{"number":25,"text":"And they went out betimes determined in purpose"},{"number":26,"text":"Then when they beheld it, they said: verily we have strayed"},{"number":27,"text":"Aye! it is we who are deprived"},{"number":28,"text":"The most moderate of them said: said I not Unto you, wherefore hallow him ye not"},{"number":29,"text":"They said: hallowed be Our Lord! verily we have been wrong- doers"},{"number":30,"text":"Then they turned to each other reproaching"},{"number":31,"text":"They said: woe Unto us! verily we! we have been arrogant"},{"number":32,"text":"Belike our Lord may exchange for us better garden than this; verily we are Unto our Lord beseechers"},{"number":33,"text":"Such is the torment. And the torment of the Hereafter is far greater; if they but knew"},{"number":34,"text":"Verily for the God-fearing, are with their Lord Gardens of Delight"},{"number":35,"text":"Shall We then make the Muslims like the culprits"},{"number":36,"text":"What aileth you? How ill ye judge"},{"number":37,"text":"Is there with you a Book wherein ye study"},{"number":38,"text":"That therein is yours that which. ye may choose"},{"number":39,"text":"Or have ye oaths from us reaching to the Day of Resurrection, that you shall be that which ye judge"},{"number":40,"text":"Ask then, which of them will stand thereof a surety"},{"number":41,"text":"Have they associate gods? Then let them produce their associate gods if they say sooth"},{"number":42,"text":"Remember the Day whereon the shank shall be bared and they shall be called upon to Prostrate themselves, but they shall not be able"},{"number":43,"text":"Downcast will be their looks; abjectness will overspread them. Surely they had been called upon to Prostrate themselves while yet they were whole"},{"number":44,"text":"Let Me alone with him who belieth this discourse; step by step We lead them on when they perceive not"},{"number":45,"text":"And I bear with them; verily My contrivance is sure"},{"number":46,"text":"Askest thou a hire from them so that they are laden with debt"},{"number":47,"text":"Is with them the unseen, so that they write down"},{"number":48,"text":"Be patient thou, then, with thy Lord's judgment, and be thou not like him of the fish, when he cried out while he was in anguish"},{"number":49,"text":"Had not grace from his Lord reached him, he had surely been cast into the wilderness in a plight"},{"number":50,"text":"Then his Lord chose him and made him of the righteous"},{"number":51,"text":"And those who disbelieve well-nigh cause thee to stumble with their looks when they hear the Admonition, and they say: verily he is mad"},{"number":52,"text":"While it is naught but an admonition Unto the worlds"}]}