{"number":70,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"There hath asked an asker for the torment about to befall"},{"number":2,"text":"The infidels, of which there is no averter"},{"number":3,"text":"From Allah, Owner of the ascending steps"},{"number":4,"text":"Whereby the angels ascend Unto Him and also the spirit, On a Day whereof the measure is fifty thousand years"},{"number":5,"text":"Wherefore be thou patient with a becoming patience"},{"number":6,"text":"Verily they behold it afar off"},{"number":7,"text":"And We behold it nigh"},{"number":8,"text":"It shall befall on a Day whereon the heaven shall become like Unto dregs of oil"},{"number":9,"text":"And then the mountains shall become like Unto wool dyed"},{"number":10,"text":"And not a friend shall ask a friend"},{"number":11,"text":"Though they shall be made to see one another. Fain would the guilty ransom himself from the torment of that Day by his children"},{"number":12,"text":"And his spouse and his brother"},{"number":13,"text":"And his kin that sheltered him"},{"number":14,"text":"And all who are on the earth; so that this might deliver him"},{"number":15,"text":"By no means! Verily it is a Flame"},{"number":16,"text":"Flaying off the scalp-skin"},{"number":17,"text":"It shall calll him who turneth back and backslideth"},{"number":18,"text":"And masseth and then hoardeth"},{"number":19,"text":"Verily man is formed impatient"},{"number":20,"text":"When evil toucheth him, he is bewailing"},{"number":21,"text":"And when good toucheth him he is begrudging"},{"number":22,"text":"Not so are the prayerful"},{"number":23,"text":"Who are at their prayer constant"},{"number":24,"text":"And those in whose riches is a known right"},{"number":25,"text":"For the beggar and the destitute"},{"number":26,"text":"And those who testify to the Day of Requital"},{"number":27,"text":"And those who are fearful of their Lord's torment"},{"number":28,"text":"Verily the torment of their Lord is not a thing to feel secure from"},{"number":29,"text":"And those who of their private parts are guards"},{"number":30,"text":"Save in regard to their spouses or those whom their right hands own; so verily they are not blameworthy"},{"number":31,"text":"And whosoever seeketh beyond that, then it is those who are the trespassers"},{"number":32,"text":"And those who of their trusts and their covenant are keepers"},{"number":33,"text":"And those who stand firm in their testimonies"},{"number":34,"text":"And those who of their prayer are observant"},{"number":35,"text":"Those shall dwell in Gardens, honoured"},{"number":36,"text":"What aileth those who disbelieve, toward thee hastening"},{"number":37,"text":"On the right and on the left, in companies"},{"number":38,"text":"Coveteth every man of them, that he shall enter the Garden of Delight"},{"number":39,"text":"By no means! veriiy We! We have created them from that which they know"},{"number":40,"text":"I swear by the Lord of the easts and the wests, that, vierly We are Able"},{"number":41,"text":"To replace them by others better than they; and We are not to be outrun"},{"number":42,"text":"Wherefore let thou them alone plunging in vanity and sporting until they meet their Day which they are promised"},{"number":43,"text":"The Day whereon they shall come forth from the sepulchres hastily, as though they were to an altar hurrying"},{"number":44,"text":"Downcast shall be their looks; abjectness shall overspread them. Such is the Day which they are promised"}]}