{"number":74,"edition":"en.daryabadi","ayahs":[{"number":1,"text":"O thou enveloped"},{"number":2,"text":"Arise, and warn"},{"number":3,"text":"And thine Lord magnify"},{"number":4,"text":"And thine raiment purify"},{"number":5,"text":"And pollution shun"},{"number":6,"text":"And bestow not favour that thou mayest receive more"},{"number":7,"text":"And for the good-will of thy Lord be thou patient"},{"number":8,"text":"Then when the horn shall be blown"},{"number":9,"text":"That shall be - that Day-a day hard"},{"number":10,"text":"For the infidels, not easy"},{"number":11,"text":"Let Me alone with him whom I created lonely"},{"number":12,"text":"And for whom I appointed wealth extended"},{"number":13,"text":"And sons present by his side"},{"number":14,"text":"And for whom I smoothed everything"},{"number":15,"text":"And who yet coveteth that shall increase"},{"number":16,"text":"By no means! Verily he hath been Unto Our signs a foe"},{"number":17,"text":"Anon I shall afflict him with a fearful woe"},{"number":18,"text":"Verily he considered, and devised"},{"number":19,"text":"Perish he! How moliciously he devised"},{"number":20,"text":"And again perish he! How maliciously he devised"},{"number":21,"text":"Then looked he"},{"number":22,"text":"Then frowned he and scowled"},{"number":23,"text":"Then turned he back, and grew stiff-necked"},{"number":24,"text":"Then he said: naught is this but magic from of old"},{"number":25,"text":"Naught is this but the word of Man"},{"number":26,"text":"Anon shall I roast him into the Scorching Fire"},{"number":27,"text":"And what knoweth thou that which the Scorching Fire"},{"number":28,"text":"It shall not spare, nor leave"},{"number":29,"text":"Scorching the skin"},{"number":30,"text":"Over it are appointed nineteen"},{"number":31,"text":"And We have appointed none but the angels to be wardens of the Fire. And their number we have made only a trial for those who disbelieve, so that those who are vouchsafed the Book may be convinced, and that those who believe may increase in faith, and that those who are vouchsafed the Book and the believers may not doubt, and that those in whose hearts is a disease and the infidels may say: what meaneth Allah by this description! In this wise Allah sendeth astray whomsoever He will, and guideth whomsoever He will. And none knoweth the hosts of thy Lord but He. And it is naught but an admonition Unto man"},{"number":32,"text":"By no means! By the moon"},{"number":33,"text":"By the night when it with draweth"},{"number":34,"text":"By the morning when it brighteneth"},{"number":35,"text":"Verily it is one of the greatest woes"},{"number":36,"text":"A warning Unto humankind"},{"number":37,"text":"A warning Unto him of you who shall go forward or who chooseth to lag behind"},{"number":38,"text":"Every soul will be a pledge for that which it hath earned"},{"number":39,"text":"Save the fellows of the right"},{"number":40,"text":"In Gardens; they shall be asking"},{"number":41,"text":"Concerning the culprits"},{"number":42,"text":"What led you into the Scorching Fire"},{"number":43,"text":"They will say. 'we have not been of those who prayed"},{"number":44,"text":"And we have not been feeding the poor"},{"number":45,"text":"And we have been wading with the waders"},{"number":46,"text":"And we have been belying the Day of Requital"},{"number":47,"text":"until there came to us the certainty"},{"number":48,"text":"Then there will not Profit them intercision of the interceders"},{"number":49,"text":"What aileth them, therefore, that they are from the Admonition turning away"},{"number":50,"text":"As though they were asses startled"},{"number":51,"text":"Fleeing away from a lion"},{"number":52,"text":"Aye! every one of them desireth that: he should be vouchsafed scrolls expanded"},{"number":53,"text":"By no means! Aye, they fear not the Hereafter"},{"number":54,"text":"By no means! Verily this Qur'an is an Admonition"},{"number":55,"text":"So whosoever willeth may heed it"},{"number":56,"text":"And they shall not heed unless Allah Willeth. He is the Lord of piety. and the Lord of forgiveness"}]}