{"number":50,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Qaf. Pe Coranul cel slăvit"},{"number":2,"text":"Ba nu! Ei se miră că a venit la ei un predicator dintre ei. Cei tăgăduitori spun: “Este un lucru de mirare ca atunci"},{"number":3,"text":"când vom muri şi vom fi ţărână, va mai fi o întoarcere de departe?”"},{"number":4,"text":"Noi ştim ceea ce pământul înghite din ei, căci avem o Carte păstrătoare"},{"number":5,"text":"Ba nu! Ei socotesc Adevărul minciună când vine la ei şi sunt în încurcătură"},{"number":6,"text":"Oare nu văd deasupra lor cerul cum l-am zidit şi l-am împodobit şi nici o crăpătură nu are"},{"number":7,"text":"Pământul! Noi l-am întins şi am aruncat pe el munţii, am făcut să crească pe el fiece soi de bucurie aducător"},{"number":8,"text":"ca prevedere şi amintire pentru fiece rob care se căieşte"},{"number":9,"text":"Noi facem să cadă din cer o apă binecuvântată cu care facem să crească grădini şi grâne de secerat"},{"number":10,"text":"precum şi curmalii falnici cu ciorchini bine rânduiţi"},{"number":11,"text":"ca înzestrare a robilor noştri. Noi dăm astfel viaţă unui ţinut mort. Şi aşa va fi şi Ieşirea"},{"number":12,"text":"Şi alţii înaintea lor au hulit: poporul lui Noe, oamenii din Ar-Rass, tamudiţii"},{"number":13,"text":"adiţii, Faraon, fraţii lui Lot"},{"number":14,"text":"oamenii din Al-Aika, poporul lui Tubba’. Toţi i-au hulit pe trimişi şi atunci ameninţarea Mea s-a împlinit"},{"number":15,"text":"Oare Noi am obosit la creaţia dintâi? Ba nu! Ei stau însă la îndoială asupra unei noi creaţii"},{"number":16,"text":"Noi am creat omul şi ştim ispitele la care-l împinge sufletul său, căci Noi suntem mai aproape de el decât vena gâtului său"},{"number":17,"text":"Când cei doi trimişi la întâlnire se aşează de-a dreapta şi de-a stânga Sa"},{"number":18,"text":"el nu va rosti nici un cuvânt fără ca un păzitor să nu fie gata"},{"number":19,"text":"Beţia morţii aduce Adevărul de la care tu te-ai îndepărtat"},{"number":20,"text":"Când se va sufla în trâmbiţă, aceasta va fi Ziua Ameninţării"},{"number":21,"text":"Fiece suflet va veni cu un îmbolditor şi cu un martor"},{"number":22,"text":"Tu ai fost în nepăsare faţă de aceasta, însă Noi ţi-am dat la o parte vălul şi privirea ta este pătrunzătoare astăzi"},{"number":23,"text":"Însoţitorul său va zice: “Ceea ce am este gata!”"},{"number":24,"text":"Aruncaţi-l, amândoi, în Gheenă pe fiece tăgăduitor încăpăţânat"},{"number":25,"text":"potrivnic al binelui, călcător de lege şi neîncrezător"},{"number":26,"text":"Aruncaţi-l în osânda cea înfricoşătoare pe cel care-I alătură lui Dumnezeu un alt dumnezeu"},{"number":27,"text":"Însoţitorul său va spune: “Domnul nostru! Nu eu l-am ticăloşit, ci el era deja într-o rătăcire adâncă.”"},{"number":28,"text":"Dumnezeu va spune: “Nu vă certaţi înaintea Mea! Eu v-am trimis înainte ameninţarea"},{"number":29,"text":"La Mine, cuvântul nu se schimbă. Eu nu sunt nedrept cu robii Mei.”"},{"number":30,"text":"În Ziua când vom spune Gheenei: “Te-ai umplut?”, ea va spune: “Mai sunt încă?”"},{"number":31,"text":"Grădina va fi adusă nu departe de cei temători"},{"number":32,"text":"“Aceasta este ceea ce vi s-a făgăduit, vouă, fiecăruia ce se întoarce (către Dumnezeu) şi Îi păzeşte (poruncile)"},{"number":33,"text":"şi se teme de Milostivul în Taina Sa şi vine cu inima plecată"},{"number":34,"text":"Intraţi în pace: “Aceasta este Ziua veşniciei.”"},{"number":35,"text":"Ei vor avea acolo ceea ce vor şi la Noi vor avea mai mult"},{"number":36,"text":"Câte leaturi am nimicit înaintea lor? Şi erau mult mai de temut decât ei. Străbateţi ţinuturile! Este oare vreun adăpost"},{"number":37,"text":"Întru aceasta este o amintire pentru cel care are o inimă, pentru cel care îşi apleacă urechea, pentru cel care mărturiseşte"},{"number":38,"text":"Noi am creat în şase zile cerurile, pământul şi ceea ce se află între ele, iar osteneala nu Ne-a ajuns"},{"number":39,"text":"Rabdă ceea ce spun! Preamăreşte lauda Domnului tău înainte de ivirea soarelui şi înainte de asfinţit"},{"number":40,"text":"Preamăreşte lauda Sa în noapte şi după rugăciuni"},{"number":41,"text":"Ascultă!... În Ziua când Chemătorul va chema dintr-un loc apropiat"},{"number":42,"text":"în Ziua când vor auzi Strigătul întru Adevăr, aceea va fi Ziua Ieşirii"},{"number":43,"text":"Noi suntem Cei care dăruim viaţa şi Cei care dăruim moartea. Întru Noi este devenirea"},{"number":44,"text":"În Ziua când pământul se va despica deasupra lor, vom face lesne adunarea"},{"number":45,"text":"Noi ştim mai bine ceea ce spun. Tu nu eşti asupra lor un despot. Adu-i aminte de Coran celui ce se teme de ameninţarea Mea"}]}