{"number":37,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"And olsun (Rəbbinə ibadət üçün səmada) səf-səf duranlara (mələklərə)"},{"number":2,"text":"(Buludları) qovduqca qovanlara (yaxud şeytanların pis əməllərinə mane olanlara, insanlara günah işlər görməyi qadağan edənlərə)"},{"number":3,"text":"Və Qur’an oxuyanlara"},{"number":4,"text":"Həqiqətən, sizin Allahınız birdir"},{"number":5,"text":"O, göylərin, yerin və onların arasında olanların (bütün məxluqatın) Rəbbidir. Məşriqlərin (şərqin və qərbin – günəşin, ayın və ulduzların doğub batdığı yerlərin) də Rəbbi Odur"},{"number":6,"text":"Biz (sizə) ən yaxın olan göy üzünü (dünya səmasını) ulduzlarla bəzədik. (Günəş, ay və ulduzlar başqa-başqa göylərdə olduqları halda, siz onların hamısını özünüzlə müqayisədə ən yaxın bir yerdə, sanki başınızın üstündə görürsünüz)"},{"number":7,"text":"(Biz həm də göyü) itaətdən çıxmış hər bir şeytandan qoruduq"},{"number":8,"text":"Onlar ali bəzmə (yuxarı aləmə, mələklər aləminin söhbətlərinə) qulaq asa bilməz və hər tərəfdən (axan ulduzlar vasitəsilə) qovulub atılar"},{"number":9,"text":"(Səmadan) kənar edilərlər. Onları daimi bir əzab göyləyir"},{"number":10,"text":"Ancaq (şeytanlar içərisində mələklərin söhbətlərindən bir sözü, bir xəbəri) çırpışdıran (oğrun-oğrun öyrənən) olsa, onu da dərhal yandırıb-yaxan bir ulduz (hər şeyi dəlib keçən bir mə’şəl) tə’qib edər"},{"number":11,"text":"İndi (ya Peyğəmbər, bu müşriklərdən) soruş: onları yaratmaq çətindir, yoxsa Bizim (başqa) yaratdıqlarımızı? [Və ya: xilqətcə onlar güclüdürlər, yoxsa Bizim (başqa) yaratdıqlarımız?] Axı Biz onları (insanların babası Adəmi) yapışqan (kimi) bir palçıqdan yaratdıq"},{"number":12,"text":"Bəli, sən onlara (müşriklərin Allahın qüdrət əlamətlərini gördükləri halda qiyamətə inanmamalarına) təəcüblənirsən, onlar isə (sənin bu inamına) istehza edirlər"},{"number":13,"text":"Onlara (Qur’anla Allahın dəlilləri ilə) öyüd-nəsihət verildikdə düşünüb ibrət almazlar"},{"number":14,"text":"Bir mö’cüzə gördükdə isə ona istehza edərlər"},{"number":15,"text":"Və belə deyərlər: “Bu ancaq açıq-aşkar bir sehrdir"},{"number":16,"text":"Məgər biz öldükdən, torpaq və sürsümük olduqdan sonra dirildiləcəyikmi"},{"number":17,"text":"Eləcə də (bizdən) əvvəlki atalarımız (dirildiləcəklərmi)?!”"},{"number":18,"text":"(Ya Peyğəmbər!) De: “Bəli, özü də zəlil (xar) olaraq (dirildiləcəksiniz)"},{"number":19,"text":"O yalnız dəhşətli bir səsdən (İsrafilin suru ikinci dəfə üfürməsindən) ibarətdir. Onlar dərhal (dirilib başlarına gətirilən müsibətlərə) baxacaqlar"},{"number":20,"text":"Və deyəcəklər: “Vay halımıza! Bu, haqq-hesab (cəza) günüdür!”"},{"number":21,"text":"(Mələklər isə onlara belə deyəcəklər): “Bu (dünyada) yalan hesab etdiyiniz (haqq ilə batili, mö’minlə kafiri) ayırd etmə günüdür!”"},{"number":22,"text":"(Allah mələklərə belə buyuracaqdır:) “Yığın bir yerə zülm (küfr) edənləri, onların həmtaylarını və ibadət etdiklərini"},{"number":23,"text":"Allahdan qeyri! Onlara Cəhənnəm yolunu göstərin"},{"number":24,"text":"Onları tutub saxlayın, çünki sorğu-sual olunacaqlar!”"},{"number":25,"text":"(Mələklər istehza ilə onlara deyəcəklər:) “Sizə nə olub ki, (bu gün dünyadakı kimi) bir-birinizə kömək edə bilmirsiniz?”"},{"number":26,"text":"Bəli, onlar bu gün (Allahın əmrinə) təslim olmuşlar"},{"number":27,"text":"Onların bir qismi (tabe olanlar) digəri (öz başçıları) ilə çənə-boğaz olmağa başlayacaq"},{"number":28,"text":"(Tabe olanlar öz başçılarına) deyəcəklər: “Siz bizim yanımıza (özünüzün haqlı olduğunuz barədə) and-amanla (bizim bərəkətli və uğurlu saydığımız sağ tərəfdən) gəlirdiniz. (Əslində isə bizi haqq yoldan azdırmısınız)”"},{"number":29,"text":"(Başçıları) deyəcəklər: “Xeyr, siz (Allahın vəhdaniyyətinə) inanmırdınız"},{"number":30,"text":"Və bizim sizin üzərinizdə heç bir hökmümüz də yox idi. Xeyr, siz (özünüz) azğın (günah etməkdə həddi aşmış) bir qövm idiniz"},{"number":31,"text":"Buna görə də Rəbbimizin sözü (əzab və’dəsi) bizim barəmizdə gerçəkləşdi. Biz mütləq (əzabı) dadacağıq"},{"number":32,"text":"Biz sizi yoldan çıxartdıq, çünki biz özümüz yoldan çıxmış kimsələr idik!”"},{"number":33,"text":"O gün hamısı əzaba (cəhənnəm oduna yanmağa) şərik olacaqlar"},{"number":34,"text":"Həqiqətən, Biz günahkarlarla belə rəftar edirik"},{"number":35,"text":"Onlara: “Allahdan başqa heç bir tanrı yoxdur!” – deyildiyi zaman təkəbbür göstərirdilər"},{"number":36,"text":"Və: Biz heç divanə bir şairdən ötrü tanrılarımızı tərk edərikmi?!” – deyirdilər"},{"number":37,"text":"Xeyr, o, haqla (Qur’anla) gəldi və (özündən əvvəlki) peyğəmbərləri təsdiq etdi"},{"number":38,"text":"Siz (müşriklər) şiddətli əzabı mütləq dadacaqsınız"},{"number":39,"text":"Siz ancaq etdiyiniz əməllərin cəzasını alacaqsınız"},{"number":40,"text":"Allahın müxlis bəndələri isə müstəsnadırlar (onlara cəza verilməyəcəkdir)"},{"number":41,"text":"Məhz onlar üçün mə’lum bir ruzi vardır"},{"number":42,"text":"(Onlar üçün) növbənöv meyvələr vardır. Onlar hörmətə (şərəfə) nail olacaqlar –"},{"number":43,"text":"Nəim cənnətlərində"},{"number":44,"text":"Onlar taxtlar üstündə bir-biri ilə üzbəüz əyləşəcəklər"},{"number":45,"text":"Onlar üçün (cənnət saqiləri tərəfindən adamı kefləndirməyən, behiştdə çay kimi axan) məin (şərab) dolu piyalələr dolandırılacaqdır"},{"number":46,"text":"Ağappaq, özü də içənlərə ləzzət verən (bir məin)"},{"number":47,"text":"Onun içində (dünyadakı şərabdan fərqli olaraq) ağlı başdan çıxaran (başağrısı, süstlük verən) heç bir şey yoxdur. Onlar ondan məst də olmazlar"},{"number":48,"text":"Onların yanında gözəl (irigözlü), baxışları (yalnız ərlərinə) dikilmiş zövcələr olacaqdır"},{"number":49,"text":"Onlar, sanki örtülü (bağlı, heç bir əl dəyməmiş, qabığı içində təzə-təzə qalmış, ağappaq) yumurtadırlar (yaxud sədəf içində gizlənmiş incidirlər)"},{"number":50,"text":"Onlar bir-biri ilə (dünyada gördükləri barədə) sorğu-suala (söz-söhbətə) başlayacaqlar"},{"number":51,"text":"Onlardan biri belə deyəcək: “Mənim bir yoldaşım var idi"},{"number":52,"text":"O deyirdi: “Sən, doğrudan da, inanmırsan ki"},{"number":53,"text":"Biz öldükdən, torpaq və sür-sümük olduqdan sonra (dirildilib) sorğu-sual olunacağıq (və əməllərimizə görə cəzalandırılacağıq)?”"},{"number":54,"text":"(Sonra həmin şəxs Cənnətdəki yoldaşlarına) deyəcək: “Siz (indi onun nə halda olduğunu) bilirsinizmi?” (Onlar: “Xeyr”, - deyə cavab verəcəklər)"},{"number":55,"text":"O özü baxıb onu (yoldaşını) Cəhənnəmin ortasında görəcək"},{"number":56,"text":"Və (ona üz tutub) deyəcəkdir: “Allaha and olsun ki, sən az qala məni (yoldan çıxardıb) məhv edəcəkdin"},{"number":57,"text":"Əgər Rəbbimin lütfü olmasaydı, mən də (Cəhənnəmə) gətirilənlərdən olardım"},{"number":58,"text":"Biz artıq ölməyəcəyik, elə deyilmi"},{"number":59,"text":"(Dünyadakı) ilk ölümümüz istisna olmaqla! Biz, əzad da görməyəcəyik!”"},{"number":60,"text":"Həqiqətən, bu, böyük qurtuluşdur (uğurdur)"},{"number":61,"text":"Qoy (dünyada) çalışanlar bunun üçün (belə bir əbədi səadət uğrunda) çalışsınlar"},{"number":62,"text":"(Ey insanlar!) Qonaq olmağa (ziyafət üçün) bu (Cənnət) yaxşıdır, yoxsa (Cəhənnəmdəki pis qorxulu, meyvəsi zəhər kimi acı) zəqqum ağacı"},{"number":63,"text":"Biz onu zalımlar (cəhənnəm istisində heç bir ağac bitməz deyən kafirlər) üçün bir bəla (dərd) etdik"},{"number":64,"text":"O elə bir ağacdır ki, Cəhənnəmin lap dibindən (cəhənnəm odunun içindən) çıxar"},{"number":65,"text":"Onun meyvəsi şeytanların başı kimidir (olduqca çirkin və əcaibdir)"},{"number":66,"text":"Onlar (cəhənnəm əhli) ondan yeyəcək və qarınlarını onunla dolduracaqlar"},{"number":67,"text":"Sonra onlar üçün (içməyə) qaynar su ilə qatışmış irin vardır"},{"number":68,"text":"Daha sonra onların qayıdacaqları yer mütləq yenə Cəhənnəmdir"},{"number":69,"text":"Çünki onlar atalarını (dünyada haqq yoldan) azmış gördülər"},{"number":70,"text":"Bununla belə yüyürə-yüyürə onların ardınca düşüb getdilər"},{"number":71,"text":"Həqiqətən, onlardan (Məkkə müşriklərindən) əvvəlkilərin (keçmiş ümmətlərin) əksəriyyəti (haqq yoldan) azmışdı"},{"number":72,"text":"And olsun ki, Biz onlara (Allahın əzabı ilə) qorxudan peyğəmbərlər göndərmişdik"},{"number":73,"text":"(Ya Rəsulum!) Bir gör o qorxudulanların (lakin düz yola gəlməyənlərin) axırı necə oldu"},{"number":74,"text":"Yalnız Allahın sadiq bəndələrindən başqa! (Onlara heç bir əzab verilmədi)"},{"number":75,"text":"Həqiqətən, Nuh (öz tayfasının məhv edilməsi barədə) Bizə dua etmiş, onun duası necə də gözəl qəbul olunmuşdu"},{"number":76,"text":"Biz (Nuh qövmünü suda boğub) onu və ailəsini böyük fəlakətdən qurtardıq"},{"number":77,"text":"Məhz onun nəslini (qiyamətə qədər yer üzündə) baqi etdik"},{"number":78,"text":"Sonralar gələnlər içərisində onun üçün (yaxşı ad, gözəl xatirə) qoyduq"},{"number":79,"text":"(Onu belə yad edirlər:) “Bütün aləmlər (bəşər əhli) içərisində Nuha salam olsun!”"},{"number":80,"text":"Həqiqətən, Biz yaxşı əməl sahiblərini belə mükafatlandırırıq"},{"number":81,"text":"Şübhəsiz ki, o Bizim mö’min bəndələrimizdən idi"},{"number":82,"text":"Sonra başqalarını (Nuha iman gətirməyənləri) suda boğduq"},{"number":83,"text":"Həqiqətən, İbrahim də onun yolu ilə gedənlərdən (Nuhun firqəsindən) idi"},{"number":84,"text":"O zaman o öz Rəbbinin hüzuruna tərtəmiz bir qəlblə gəlmişdi"},{"number":85,"text":"Həmin vaxt o, atasına və tayfasına belə demişdi: “Siz nəyə ibadət edirsiniz"},{"number":86,"text":"Allahı qoyub yalançı tanrılarımı istəyirsiniz"},{"number":87,"text":"Aləmlərin Rəbbi barəsində zənniniz nədir?” (Onun ruzisini yeyib bütlərə tapınırsınız? Məgər bunun cəzasını çəkməyəcəksiniz)"},{"number":88,"text":"(İbrahim) ulduzlara bir nəzər saldı"},{"number":89,"text":"Və (ətrafındakıları özündən uzaqlaşdıqmaq məqsədilə) dedi: “Mən xəstəyəm!”"},{"number":90,"text":"(İbrahimin yanındakılar xəstəliyin onlara yoluxmasından qorxaraq, həm də o gün qeyd edəcəkləri bayrama tələsərək) ondan üz çevirib getdilər"},{"number":91,"text":"(İbrahim) xəlvətcə onların tanrılarının yanına gedib (istehza ilə) dedi: “Məgər (yanınızda olan bu təamları) yeməyəcəksiniz"},{"number":92,"text":"Sizə nə olub ki, danışmırsınız?”"},{"number":93,"text":"Sonra bütlərin üstünə yüyürüb sağ əli ilə onlara möhkəm bir zərbə endirdi"},{"number":94,"text":"(Bundan xəbər tutan tayfası) yüyürə-yüyürə onun yanına gəldi"},{"number":95,"text":"(İbrahim onlara) dedi: “Siz özünüz yonub düzəltdiyiniz şeylərəmi ibadət edirsiniz"},{"number":96,"text":"Halbuki sizə də, sizin düzəltdiklərinizi də Allah yaratmışdır!”"},{"number":97,"text":"Onlar dedilər: “Bunun (İbrahim) üçün bir bina tikin, (içərisini odunla doldurub) özünü də oda atın!”"},{"number":98,"text":"Onlar onun üçün belə bir hiyə qurmaq istədilər, Biz isə onları çox səfil (zəlil) bir vəziyyətə saldıq. (Hiylələri baş tutmadı, İbrahimə heç bir şey edə bilmədilər)"},{"number":99,"text":"(İbrahim oddan xilas olduqdan sonra) dedi: “Mən Rəbbimə doğru (Allahın mənə buyurduğu yerə - Şama tərəf) gedirəm. O mənə doğru yolu mütləq göstərəcəkdir!”"},{"number":100,"text":"(İbrahim müqəddəs torpağa yetişdikdən sonra dua edib) dedi: “Ey Rəbbim! Mənə salehlərdən olan (bir övlad) bəxş et!”"},{"number":101,"text":"Biz də ona həlim xasiyyətli bir oğlan uşağı (İsmail) ilə müjdə verdik"},{"number":102,"text":"O, yüyürüb qaçmaq (atasına kömək edə bilmək) çağına (on üç yaşına) çatdıqda (İbrahim) dedi: “Oğlum! Yuxuda gördüm ki, səni qurban kəsirəm. Bax gör (bu barədə) nə fikirləşirsən!” O dedi: “Atacan! Sənə nə əmr olunursa, onu da et. İnşallah, mənim səbirlilərdən olduğumu görəcəksən!”"},{"number":103,"text":"Onların hər ikisi (Allahın əmrinə) təslim olduğu və (İbrahim İsmaili qurban kəsmək üçün) üzüstə yerə yıxdığı zaman"},{"number":104,"text":"Biz ona belə xitab etdik: “Ya İbrahim"},{"number":105,"text":"Artıq sən rö’yanın düzgünlüyünü (Allah tərəfindən olduğunu) təsdiq etdin!” (Sənə yuxuda nə əmr olunmuşdusa, onu yerinə yetirdin. Allah sənə lütf edərək oğlunun yerinə bir qoç kəsməyi buyurur). Biz yaxşı iş görənləri belə mükafatlandırırıq"},{"number":106,"text":"Şübhəsiz ki, bu, açıq-aydın bir imtahan idi"},{"number":107,"text":"Biz ona böyük bir qurbanlıq (Habilin qurbanlıq qoçunu) əvəz verdik"},{"number":108,"text":"Sonradan gələnlər arasında onun üçün (yaxşı ad, gözəl xatirə) qoyduq"},{"number":109,"text":"(Onu belə yad edirlər:) “İbrahimə salam olsun!”"},{"number":110,"text":"Həqiqətən, Biz yaxşı əməl sahiblərini belə mükafatlandırırıq"},{"number":111,"text":"Şübhəsiz ki, o Bizim mö’min bəndələrimizdən idi"},{"number":112,"text":"Ona salehlərdən olan İshaqın peyğəmbər olacağı ilə müjdə verdik"},{"number":113,"text":"Biz ona İshaqa (peyğəmbərliklə, övlad çoxluğu ilə) bərəkət verdik. Onların hər ikisinin nəslindən yaxşı işlər görən də var, açıq-aşkar özünə zülm edən də"},{"number":114,"text":"Biz Musa və Haruna da ne’mət (peyğəmbərlik) bəxş etdik"},{"number":115,"text":"Onların hər ikisini böyük fəlakətdən (Fir’onun əsarətindən, yaxud suda boğulmaqdan) qurtardıq"},{"number":116,"text":"Onlara yardım etdik və onlar (düşmənə) qalib gəldilər"},{"number":117,"text":"Onların hər ikisinə (hökmləri) açıq-aydın o kitabı (Tövratı) verdik"},{"number":118,"text":"Onların hər ikisini doğru yola müvəffəq etdik"},{"number":119,"text":"Sonradan gələnlər içərisində onların hər ikisi üçün (yaxşı ad, gözəl xatirə) qoyduq"},{"number":120,"text":"(Onları belə yad edirlər:) “Musaya və Haruna salam olsun!”"},{"number":121,"text":"Həqiqətən, Biz yaxşı əməl sahiblərini belə mükafatlandırırıq"},{"number":122,"text":"Şübhəsiz ki, onların hər ikisi Bizim mö’min bəndələrimizdən idi"},{"number":123,"text":"Həqiqətən, İlyas da (Bizim tərəfimizdən göndərilmiş) peyğəmbərlərdəndir"},{"number":124,"text":"Bir zaman o öz tayfasına belə demişdi: “Məgər (bütlərə ibadət etməklə) Allahdan qorxmursunuz"},{"number":125,"text":"Məgər siz yaradanların ən yaxşısını (Allahı) qoyub Bə’lə (Bə’l adlı bütə) ibadət edirsiniz"},{"number":126,"text":"Həm sizin Rəbbiniz, həm də (sizdən) əvvəlki atalarınızın (babalarınızın) Rəbbi olan Allahımı (tərk edirsiniz)?”"},{"number":127,"text":"Lakin onlar onu təkzib etdilər, buna görə də (qiyamət günü Cəhənnəmə) gətiriləcəklər"},{"number":128,"text":"Yalnız Allahın müxlis bəndələrindən başqa"},{"number":129,"text":"Sonradan gələnlər arasında onun üçün (yaxşı ad, gözəl xatirə) qoyduq"},{"number":130,"text":"(Onu belə yad edirlər:) “İlyasinə (İlyasa) salam olsun!”"},{"number":131,"text":"Həqiqətən, Biz yaxşı əməl sahiblərini belə mükafatlandırırıq"},{"number":132,"text":"Şübhəsiz ki, o Bizim mö’min bəndələrimizdən idi"},{"number":133,"text":"Həqiqətən, Lut da peyğəmbərlərdəndir"},{"number":134,"text":"(Ya Rəsulum!) Yadına sal ki, Biz o vaxt (Lut tayfasına müsibət üz verdiyi zaman) onu və bütün ailəsini xilas etdik"},{"number":135,"text":"Yalnız əzab içində qalanlar arasında olan qoca qarıdan (Lutun övrətindən) başqa"},{"number":136,"text":"Sonra isə başqalarını (iman gətirməyənləri) yox etdik"},{"number":137,"text":"Siz (Şama getdiyiniz zaman) səhər vaxtı onların yurdundan keçirsiniz"},{"number":138,"text":"Eləcə də axşam vaxtı. Məgər bir düşünüb-daşınmırsınız"},{"number":139,"text":"Həqiqətən, Yunis də (Bizim təfəfimizdən göndərilmiş) peyğəmbərlərdəndir"},{"number":140,"text":"(Ya Peyğəmbər!) Yadına sal ki, bir zaman o, (qövmünün küfrü üzündən yük və adamla) dolu bir gəmiyə qaçmışdı"},{"number":141,"text":"(Gəmidə olanlar) püşk atmış və (püşk ona düşdüyü üçün) məğlub edilənlərdən olmuşdu. (Yunis gəmiyə mindiyi zaman gəmi yerindən tərpənməmiş, buna görə də sərnişinlər: “Yəqin ki, içərimizdə ağasından qaçmış kölə vardır”, - demişdilər. Kölənin kim olduğunu bilmək üçün püşk atılmış və o, Yunisə düşmüşdü. Yunis özünü dənizə atmağa məcbur olmuşdu)"},{"number":142,"text":"(Yunis Allahın izni olmadan qövmünü tərk edib getdiyinə görə) özünü qınayarkən (dənizə atılarkən) balıq onu udmuşdu"},{"number":143,"text":"Əgər o, (Allahı) çox təqdis edənlərdən (namaz qılanlardan) olmasaydı"},{"number":144,"text":"Yəqin ki, balığın qarnında qiyamət gününə qədər qalardı"},{"number":145,"text":"Nəhayət, o, xəstə olduğu halda onu boş bir yerə (sahilə) atdıq"},{"number":146,"text":"Və (başı) üstündə (ona kölgə salmaq üçün) iri yarpaqlı bir ağac (yaxud qabaq tağı) bitirdik"},{"number":147,"text":"Biz onu yüz min nəfərə və daha çox kimsəyə peyğəmbər göndərdik"},{"number":148,"text":"Nəhayət, onlar ona (Yunisə) iman gətirdilər və Biz də onlara müəyyən vaxtadək (ömürlərinin axırına kimi) gün-güzəran verdik"},{"number":149,"text":"(Ya Peyğəmbər! İndi o müşriklərdən) soruş: “Deməli, qızlar sənin Rəbbinin, oğlanlar isə onların özlərinindir, eləmi?”"},{"number":150,"text":"Yoxsa Biz mələkləri dişi yaratmışıq və onlar da (buna) şahid olublar"},{"number":151,"text":"Xəbərin olsun ki, onlar öz yalanları üzündən mütləq belə deyəcəklər"},{"number":152,"text":"“Allah övlad törətmişdir (mələklər Onun qızlarıdır)”. Onlar, həqiqətən, yalançıdırlar"},{"number":153,"text":"Məgər Allah (mələkləri özünə övlad götürməklə) qızları oğlanlardan üstünmü tutmuşdur"},{"number":154,"text":"Sizə nə olmuşdur, necə mühakimə yürüdürsünüz"},{"number":155,"text":"Heç düşünürsünüz"},{"number":156,"text":"Yoxsa sizin açıq-aşkar bir dəliliniz vardır"},{"number":157,"text":"Əgər doğru danışırsınızsa, kitabınızı gətirin"},{"number":158,"text":"(Müşriklərə həm də özlərindən) Onunla (Allahla) cinlər (pərilər, yaxud mələklər) arasında bir qohumluq əlaqəsi icad etdilər. Həqiqətən, cinlər onların (bu sözü deyənlərin qiyamət günü Cəhənnəmə) gətiriləcəyini bilirlər"},{"number":159,"text":"Allah (müşriklərin) Ona aid etdikləri sifətlərdən təmamilə uzaqdır"},{"number":160,"text":"Allahın müslis (mö’min) bəndələri isə istisnadır"},{"number":161,"text":"(Ey Müşriklər!) Nə siz, nə də ibadət etdikləriniz"},{"number":162,"text":"Heç kəsi tovlayıb yoldan çıxara bilməzsiniz"},{"number":163,"text":"Yalnız Cəhənnəmə girəcək kimsədən başqa"},{"number":164,"text":"(Cəbrail Peyğəmbər əleyhissəlama belə dedi:) “Bizdən (mələklərdən) elə birisi yoxdur ki, onun (səmada Allaha ibadət üçün) müəyyən bir yeri olmasın"},{"number":165,"text":"Həqiqətən, biz səf-səf dururuq"},{"number":166,"text":"Və (Allahı) təqdis edib şə’ninə tə’riflər deyirik"},{"number":167,"text":"(Məkkə müşrikləri) tə’kidlə belə deyirdilər"},{"number":168,"text":"“Əgər bizdə əvvəlkilərin kitablarından biri olsa idi"},{"number":169,"text":"Biz də mütləq Allahın müxlis bəndələri olardıq!”"},{"number":170,"text":"Amma onu (Qur’anı) inkar etdilər. Onlar (küfrlərinin aqibətini) mütləq biləcəklər"},{"number":171,"text":"And olsun ki, peyğəmbər bəndələrimiz haqqında əvvəlcədən (lövhi-məhfuzda) bu sözümüz deyilmişdi"},{"number":172,"text":"“Onlar mütləq qalib gələcəklər"},{"number":173,"text":"Bizim əsgərlərimiz (mö’minlər) labüd olaraq (kafirlərə) zəfər çalacaqlar!”"},{"number":174,"text":"(Ya Peyğəmbər!) Sən bir müddət (Bədr vuruşuna, yaxud Məkkənin fəthinədək) onlardan üz çevir"},{"number":175,"text":"Və (kənardan) onlara bax! Onlar mütləq (küfrlərinin aqibətini) görəcəklər"},{"number":176,"text":"Onlar əzabımızın tezliklə gəlməsini istəyirlər"},{"number":177,"text":"(O əzab) onlara yetişdikdə (evlərində ikən başlarının üstünü aldıqda) qorxudulanların (lakin yola gəlməyənlərin) sabahı necə də pis olacaq"},{"number":178,"text":"(Ya Peyğəmbər!) Sən onlardan bir müddət üz çevir"},{"number":179,"text":"Və (kənardan) onlara bax! Onlar mütləq (küfrlərinin aqibətini) görəcəklər"},{"number":180,"text":"Sənin Rəbbin – yenilməz qüvvət sahibi (mülkündə hər şeyə qalib) olan Rəbbin (müşriklərin) Ona aid etdikləri sifətlərdən tamamilə uzaqdır"},{"number":181,"text":"Peyğəmbərlərə salam olsun"},{"number":182,"text":"Aləmlərin Rəbbi olan Allaha həmd olsun"}]}