{"number":55,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"Rəhman! (Mərhəmətli olan Allah)"},{"number":2,"text":"(Öz peyğəmbərinə) Qur’anı öyrətdi"},{"number":3,"text":"İnsanı yaratdı"},{"number":4,"text":"Ona danışmağı (fikrini və duyğularını bəyan etməyi) öyrətdi"},{"number":5,"text":"Günəş və ay müəyyən bir ölçü ilə (hərəkət edər)"},{"number":6,"text":"Otlar da, ağaclar da (Allaha) səcdə edər"},{"number":7,"text":"Göyü. O ucaltdı, tərəzini (ədalət tərəzisini) O qoydu"},{"number":8,"text":"Ona görə ki, çəkidə hədi aşmayasınız (insafı əldən verməyəsiniz)"},{"number":9,"text":"Tərəzini düz tutun, çəkini əskiltməyin! (Çəkidə insaflı olun, tərəzini korlamayın)"},{"number":10,"text":"Yeri də (bütün) məxluqat üçün O döşədi"},{"number":11,"text":"Orada növbənöv meyvələr və tumurcuqlu (salxımlı) xurma ağacları"},{"number":12,"text":"(Yaşıl ikən yarpar, quruluğunda saman olan) saçaqlı dənli bitkilər və xoş ətirli çiçəklər (reyhan, qızılgül, yasəmən, bənövşə, qərənfil və s.) vardır"},{"number":13,"text":"(Ey cinlər, ey insanlar!) Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":14,"text":"İnsanı (Adəmi) saxsı kimi (toxunduqda səs çıxardan) quru palçıqdan O yaratdı"},{"number":15,"text":"(Cinlərin əcdadı) cannı da tüstüsüz (təmiz) oddan O xəlq etdi"},{"number":16,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":17,"text":"İki məşriqin və iki məğribin Rəbbi (günəşin və ayın yazda və qışda çıxıb batdığı yerlərin sahibi) Odur"},{"number":18,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":19,"text":"(Suları şirin və acı olan) iki dənizi O qovuşdurdu (bir-birinə qovuşmaq üçün açıb buraxdı)"},{"number":20,"text":"Amma onların arasında maneə vardır, bir-birinə qatışmazlar (özləri üçün müəyyən edilmiş həddi aşmazlar)"},{"number":21,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":22,"text":"Onlardan (o iki dənizdən) inci və mərcan çıxar"},{"number":23,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":24,"text":"Dənizdə uca dağlar kimi üzən gəmilər də Onundur"},{"number":25,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":26,"text":"(Yer) üzündə olan hər kəs fanidir (ölümə məhkumdur)"},{"number":27,"text":"Ancaq əzəmət və kərəm sahibi olan Rəbbinin zatı baqidir"},{"number":28,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":29,"text":"Göylərdə və yerdə kim varsa, (hamısı) Ondan (ruzi, mərhəmət və mədəd) diləyər. O hər gün (hər an) bir işdədir (birini öldürər, birini dirildər; acizə kömək, zalıməa zülm edər; birinin duasını qəbul edər; birinə mərhəmət əta edib digərinə cəza verər. Bir işlə məşğul olmaq Onu digərindən yayındırmaz)"},{"number":30,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":31,"text":"Ey ağır yük (mükəlləfiyyət) altında olanlar (yaxud yerə ağırlıq verən cinlər və insanlar)! Sizinlə də (layiqincə) məşğul olacağıq (əməllərinizin haqq-hesabını mütləq çəkəcəyik)"},{"number":32,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":33,"text":"Ey cin və insan tayfası! Əgər göylərin və yerin ətrafından (çevrəsindən) kənara çıxa bilərsinizsə, çıxın. Siz (oradan) ancaq (qüdrət və) qüvvətlə (Allahın sizə bəxş etdiyi elmin qüdrətilə) çıxa bilərsiniz! (Yaxud siz oradan qüdrət və qüvvət vasitəsilə çıxa bilərsiniz ki, bu da sizdə yoxdur)"},{"number":34,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":35,"text":"(Qiyamət günü) sizin üstünüzə tüstüsüz alov və alovsuz tüstü göndəriləcək (başınıza ərimiş mis, od və duman töküləcək) və siz bir-birinizə kömək də edə bilməyəcəksiniz"},{"number":36,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":37,"text":"(Qiyamət günü) göy ayrılıb (dağ basılmış) dəri (yaxud dağ edilmiş yağ) kimi qıpqırmızı olduğu zaman (halınız necə olacaq)"},{"number":38,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":39,"text":"O gün nə bir insan, nə də bir cin günahı barəsində sorğu-sual olunmayacaqdır! (Yol ancaq Cəhənnəmdir)"},{"number":40,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":41,"text":"Günahkarlar üzlərindən (sifətlərinin qaralığından, gözlərinin göylüyündən) tanınacaq, kəkillərindən və ayaqlarından tutulub yaxalanacaqlar (başları öndən, yaxud arxadan ayaqlarına bənd ediləcəkdir)"},{"number":42,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":43,"text":"(Onlara belə deyiləcəkdir:) “Bu, günahkarların yalan hesab etdikləri Cəhənnəmdir!”"},{"number":44,"text":"Onlar onunla (cəhənnəm odu ilə) qaynar su arasında dolanıb duracaqlar"},{"number":45,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":46,"text":"Şübhəsiz ki, Rəbbinin məqamından (hüzurunda haqq-hesab üçün durmaqdan) qorxanları iki cənnət (Ədn nə Nəim cənnətləri) gözləyir"},{"number":47,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":48,"text":"(O iki cənnətin ağacları) qollu-budaqlıdır (merli-meyvəlidir)"},{"number":49,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":50,"text":"Orada (o cənnətlərdə) iki axar bulaq vardır"},{"number":51,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":52,"text":"Orada (o iki cənnətdə) hər meyvədən (quru və təzətər olmaqla) iki növ vardır (mö’minlər onların birini dünyada görmüş, digərini isə görməmişlər)"},{"number":53,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":54,"text":"Onlar (mö’minlər) orada astarları qalın ipəkdən olan döşəklərə söykənmiş olacaqlar. O iki cənnətin meyvələrini dərmək də asan olacaqdır (mö’minlər harada olsalar, ağaclar onlara yaxın gələcək, onlar həmin meyvələri ayaq üstə olanda da, oturanda da, uzananda da dərib yeyə biləcəklər)"},{"number":55,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":56,"text":"Orada (o cənnətlərdə) gözlərini (yalnız ərlərinə) dikmiş, bundan əvvəl özlərinə heç bir ins-cins (insan və cin) toxunmamış qadınlar vardır"},{"number":57,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":58,"text":"Onlar (o qadınlar rəng və gözəllikcə), sanki yaqut və mərcandırlar"},{"number":59,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":60,"text":"Yaxşılıq əvəzi ancaq yaxşılıqdır"},{"number":61,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":62,"text":"Onlardan (o iki cənnətdən) başqa (mö’minlər üçün) daha iki cənnət (Firdovs və Mə’va cənnətləri) vardır"},{"number":63,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":64,"text":"(O iki cənnət) yamyaşıldır (o qədər yaşıldır ki, qaraya çalır)"},{"number":65,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":66,"text":"Orada (o iki cənnətdə) fəvvarə verib qaynayan iki bulaq vardır"},{"number":67,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":68,"text":"Orada (o iki cənnətdə) növbənöv meyvələr, xurma və nar vardır"},{"number":69,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":70,"text":"Orada (o cənnətlərin hamısında, dördündə də) xoş xasiyyətli, gözəl üzlü qadınlar vardır"},{"number":71,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":72,"text":"Çadırlarda gözlərini (yalnız öz ərlərinə) dikmiş hurilər vardır"},{"number":73,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":74,"text":"Onlara (ərlərindən) əvvəl heç bir ins-cins toxunmamışdır"},{"number":75,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":76,"text":"Onlar (mö’minlər) yaşıl balışlara və gözəl naxışlı (inci ilməli, xovlu) xalılara (yaxud yumşaq qalın döşəklərə) söykənmiş olacaqlar"},{"number":77,"text":"Belə olduqda Rəbbinizin hansı ne’mətlərini yalan saya bilərsiniz"},{"number":78,"text":"(Ya Peyğəmbər!) Sənin əzəmət və kərəm sahibi olan Rəbbinin adı nə qədər ucadır (nə qədər uludur)"}]}