{"number":20,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"H"},{"number":2,"text":"My ne odhalit Quran ty zpusobit ty kadý útrapa"},{"number":3,"text":"Jen s upomenout a ctihodný"},{"number":4,"text":"Zjevení podle Tvurce zahrabat výška nebe"},{"number":5,"text":"Nejvetší Blahosklonný; On prijmout úplne moc"},{"number":6,"text":"S Jemu patrit všechno nebe zahrabat všechno ti všechno park"},{"number":7,"text":"(Ty prohlásit svuj usvedcení ne) On módní ochrana prezidenta co pravidelný ukrýt"},{"number":8,"text":"BUH v tom NE jsem JINAK BUH JEMU. S Jemu patrit nejvetší krásný uvést"},{"number":9,"text":"Ty proslulý dejiny Moses"},{"number":10,"text":"When on prijmout zapálit on ríct podle svém rodinný Zastávka sem. Já prijmout zapálit. Moná já privést ty trochu o ono zjistit trochu rízení zapálit"},{"number":11,"text":"When on podlehnout to on jsem prijít O Moses"},{"number":12,"text":"Já jsem svuj Magnát; odstranující svuj opasek! Ty jsem církevní údolí Tuwaa"},{"number":13,"text":"Já chtít ty e naslouchat podle co odhalit"},{"number":14,"text":"Já jsem BUH; v tom ne jsem jinak buh Mne. Ty zbonovat Mne jen slavit Spojení Prosba (Salat) vzpomínat si Mne"},{"number":15,"text":"Doba (znicit z spolecnost) prece podlehnout; já zadret to témer skrytý kadý duše byl platil nebo svuj spravovat"},{"number":16,"text":"Ne odvrátit proto na ty ne domnívat se za to! - Ty pokracovat jejich uznat mínení - lest ty dostat"},{"number":17,"text":"Co byl tento za svuj vzprímit písmo Moses"},{"number":18,"text":"On odríkávat Tento jsem muj tyc. Já sklonit to skupina muj nesmelý clovek ono já jednat ono jinak smysl"},{"number":19,"text":"On odríkávat Házet to srazit Moses"},{"number":20,"text":"On házet to srazit whereupon to povaha v pohybující had"},{"number":21,"text":"On odríkávat Sebrat to ne jsem v obavách! My zvolení to svuj puvodní okolnosti"},{"number":22,"text":"A zastavit svuj písmo svuj rychlý; to delat se bílý pokazit; jiný pevný"},{"number":23,"text":"My tím beet ty trochu o náš prima zlé znamení"},{"number":24,"text":"Odjezd Pharaoh on zhrešit"},{"number":25,"text":"On odríkávat Muj Magnát ochladit muj mírnit"},{"number":26,"text":"zpusobit tento látka lehký mne"},{"number":27,"text":"A rozvázat proplést muj špice"},{"number":28,"text":"Aby oni porozumení muj jazyk"},{"number":29,"text":"A sjednat zástupce mne muj druh"},{"number":30,"text":"Muj kamarád Aaron"},{"number":31,"text":"Upevnit mne jemu"},{"number":32,"text":"Pripustit jemu byl muj spojit za tohleto látka"},{"number":33,"text":"Onen my oslavovat Ty frequently"},{"number":34,"text":"A slavit Ty frequently"},{"number":35,"text":"Ty jsem Veštec z nás"},{"number":36,"text":"On odríkávat Svuj ádat pripustit O Moses"},{"number":37,"text":"My štestí ty znovu"},{"number":38,"text":"When my odhalit svuj ujmout se jako matka který my odhalit"},{"number":39,"text":"Odríkávat ‘Házet jemu pouzdro pak házet jemu do proud! Proud házet jemu podpera zahrocený neprítel z Podkopat neprítel svém. ' já lít ty ke nula Mne já mel ty útocit Muj bdelý otvor"},{"number":40,"text":"Svuj sestra dráha ti odríkávat ‘já zjistit ty pestovat ujmout se jako matka pokládat poslušný pecovat z jemu. ' My tím navrácení ty svuj ujmout se jako matka onen ena jsem nejšastnejší konec plný úzkosti A when ty znemonit osoba my uchovat ty prudký dusledek; vskutku my zkoušet ty dukladne. Ty utišit roky lidé Midyan okamite ty delat se proto presný postup"},{"number":41,"text":"Já zpusobit ty pred Mne"},{"number":42,"text":"Odchod svuj kamarád podpora na Muj známka ne waver za pamatovat Mne"},{"number":43,"text":"Odjezd Pharaoh on zhrešit"},{"number":44,"text":"Mluven podle jemu pekne; on pokládat pozornost slušet ctihodný"},{"number":45,"text":"Oni odríkávat Náš Magnát my bát se lest on napadnout nás zhrešit"},{"number":46,"text":"On odríkávat byl v obavách já jsem ty naslouchat dávat pozor"},{"number":47,"text":"Odchod jemu odríkávat ‘My byl 2 hlasatel podle svuj Magnát! Pripustit Detský Izrael odchod! Ty upustit podle pronásledovat ti! My privést známka svuj Magnát pokoj jsem moc z ty pozornost rízení"},{"number":48,"text":"‘My dýchat odškodnení inevitably souit ty pochybovat obeh"},{"number":49,"text":"On odríkávat Kterí jsem svuj Magnát O Moses"},{"number":50,"text":"On odríkávat Náš Magnát byl 1 který pripustit všechno svuj trvání svuj rízení"},{"number":51,"text":"On odríkávat Který u po výroba"},{"number":52,"text":"On odríkávat vedomí o tom jsem muj Magnát zápis. Muj Magnát nikdy chybit nor ucinil On nepamatovat si"},{"number":53,"text":"On byl Jednotka zpusobit zahrabat obytný ty razit za to cesta ty. On odeslat srazit lye rozvodnit který my vytáhnout mnoho rozdílný druh opustit"},{"number":54,"text":"Strávit sbírat svuj ivý inventár! Tyto ar sufficient zkouška ty mít porozumení"},{"number":55,"text":"Od Toho my tvorit ty to my zvolení ty od toho my privést ty out znovu"},{"number":56,"text":"My beet jemu úplne náš zkouška on pochybovat odmítnout"},{"number":57,"text":"On odríkávat ty podlehnout sem absorbovat nás náš získat svuj kouzelný O Moses"},{"number":58,"text":"My prece beet ty podobný kouzelný. Proto urcit úrad onen vubec my nor ty rozrušit; bezpohlavní zaúctovat"},{"number":59,"text":"On odríkávat Svuj sjednat cas jsem cas program. all vyrovnat forenoon"},{"number":60,"text":"Pharaoh predvolat svém armáda pak podlehnout"},{"number":61,"text":"Moses ríct podle ti Hore s ty. Ty vymýšlet svetský boj BUH zpusobit tím privodit si Svém odškodnení? Stejný fabricators prece selhání"},{"number":62,"text":"Oni debatovat sebe protoe oni propujcit privately"},{"number":63,"text":"Oni odríkávat Tyto 2 byl nikoliv jinam than kouzelník ádat absorbovat ty svuj získat jejich kouzelný s zkosit svuj ideový ráz o ivost"},{"number":64,"text":"dohodnout se na 1 navrhovat celo ti spojený prední! Vítez dnes mel vrchní písmo"},{"number":65,"text":"Oni odríkávat O Moses kadý ty házet my jsem dríve házet"},{"number":66,"text":"On odríkávat Ty házet. Whereupon jejich lano násada vystoupit jemu jejich kouzelný protoe oni plout"},{"number":67,"text":"Moses harbored neco pramen strachu"},{"number":68,"text":"My odríkávat ne Mel pramen strachu! Ty bený"},{"number":69,"text":"Házet co ty zastavit od svuj vzprímit pomoct to odvolat co oni vymýšlet! co oni vymýšlet jsem nikoliv jinam than úklad kouzelník. Kouzelník spravovat ne mít úspech"},{"number":70,"text":"Kouzelník kue premoct rcení My domnívat se za Magnát z Aaron Moses"},{"number":71,"text":"On odríkávat Vyloucit co z ceho ty domnívat se za jemu muj povolení? On jsem svuj prední; jednotka ucit ty kouzelný. Já prece roztrhnout svuj písmo krok strídavý stránka. Já ukriovat ty podmazat trup. Ty ucinil to najít out který z nás vnucovat špatne odškodnení který preckat koho"},{"number":72,"text":"Oni odríkávat My ne povýšit ty vyrovnat zkouška onen podlehnout nás a Jednotka tvorit nás! Proto vydávat kadý soud ty ádat vydávat! Ty jen predpis za tohleto pokorný doivotní"},{"number":73,"text":"My mel domnívat se za náš Lord onen On omluvit nás náš hrích kouzelný onen ty vnutit nás zastávat! BUH jsem DRUHÝ ZCELA Nekonecný"},{"number":74,"text":"Kadý podlehnout svém Magnát vinný prosit privodit si Peklo wherein on nikdy poslední nor zastávka ijící"},{"number":75,"text":"Ohledne Ceho ty podlehnout Jemu verící primet spravedlivý doivotní oni dosáhnout výška usporádat"},{"number":76,"text":"Zahradní Ráj který proud príliv jsem jejich príbytek stále. recený byl odmenit ty cistit"},{"number":77,"text":"My dýchat Moses Primet Muj sluha out postihnout ti utrít cesta more. Ty ne pramen strachu ty upoutat nor jsem povinen ty trápit"},{"number":78,"text":"Pharaoh pokracovat ti na svém houf more zaplavit ti ackoliv ono jsem urcit zaplavit ti"},{"number":79,"text":"Tím Pharaoh zavést svém lidé; on ne usmernovat ti"},{"number":80,"text":"O Detský Izrael my vynést ty svuj neprítel predvolat ty Zasadit Sinai my odeslat shodit s ty manna umdlévat"},{"number":81,"text":"Strávit poslušný potreby my postarat se nebo ty ne zhrešit lest ty privodit si Muj zloba. Whoever privodit si Muj zloba dostat"},{"number":82,"text":"Já prece Omluvit ty litovat, verit vést spravedlivý doivotní steadfastly trvat usmernovat"},{"number":83,"text":"Why ty beh stranou svuj lidé O Moses"},{"number":84,"text":"On odríkávat Oni byl blízko mne! Já beh Ty muj Lord onen Ty spokojený"},{"number":85,"text":"On odríkávat My pripojit svuj lidé vyzkoušet ty odkázat Samarian zavést ti"},{"number":86,"text":"Moses vrátit svém lidé rozhnevaný zklamat rcení O muj lidé svuj Magnát ne slibný ty poslušný slib? Ty ne cekat? Ty chtít zpusobit privodit si zloba podle svuj Magnát? Tento why ty byl rozbil svuj souhlas mne"},{"number":87,"text":"Oni odríkávat My ne prerušit náš souhlas ty ochoten zámer. My zavádet klenoty rozhodný házet náš vkládat od! Tento jsem který Samarian podotknout"},{"number":88,"text":"On vytáhnout ti sculpted lýtko vyplnit lýtko zkoumat! Oni odríkávat Tento jsem svuj buh buh Moses Tím on nepamatovat si"},{"number":89,"text":"Oni ne prijmout to vubec vyhovovat ti nor majetný kadý schopnost poškození ti beneficní ti"},{"number":90,"text":"Aaron zjistit ti O muj lidé tento jsem vyzkoušet ty. Svuj ale Magnát byl nejvetší Blahosklonný aby následující mi uposlechnout muj ovládání"},{"number":91,"text":"Oni odríkávat My zustat zbonovat to Moses delat se"},{"number":92,"text":"Moses odríkávat O Aaron co byl to prekazit ty when ty prijmout ti odchod z cesty"},{"number":93,"text":"Podle následující muj narídit? Ty vzbourit se mne"},{"number":94,"text":"On odríkávat O syn muj ujmout se jako matka znicit ne náraz mne muj vousy muj pristrihnout. Já jsem v obavách onen ty odríkávat ‘Ty oddelovat Detský Izrael neuposlechnout muj narídit"},{"number":95,"text":"On odríkávat Co jsem a záleitost ty O Samarian"},{"number":96,"text":"On odríkávat já prijmout co oni ne prijmout. Já popadnout fistful (z oprášit) zaúctovat kde? hlasatel kozlík uívaný to mísit zlatý lýtko). Tento jsem co muj hledet nadchnout se mne ucinil"},{"number":97,"text":"(On odríkávat Pak odchod svuj doivotní vyloucit co z ceho ne práve podlehnout blízko! Ty mel sjednat cas svuj rozhodný soud) ty nikdy obejít. Pohled svuj buh ty jednat zbonovat; my svítit to házet to do more s zastávka shodit v tom stále"},{"number":98,"text":"Svuj ale buh jsem BUH; 1 beside koho v tom ne jsem jiný buh. Svém vedomí zvládnout úplne potreby"},{"number":99,"text":"My tím lícit ty neco zpráva po výroba. My odhalit ty poslání podle nás"},{"number":100,"text":"Ty nedbat to loisko vkládat (z hrích) Cas Zmrtvýchvstání"},{"number":101,"text":"Eternally oni zustávat therein; který bídný vkládat Cas Zmrtvýchvstání"},{"number":102,"text":"Onen byl cas when roh kvet my predvolat vinný onen cas sklícený"},{"number":103,"text":"(Šeptat sebe oni odríkávat Ty utišit 1 doivotní) nikoliv jinam than 10 cas"},{"number":104,"text":"My jsem celkem vedomý si o jejich projev. Nejvetší správný among ti odríkávat Ty utišit nikoliv jinam than cas"},{"number":105,"text":"Oni poadovat ty hora. Odríkávat Muj Magnát otírat ti out"},{"number":106,"text":"On odkázat ti mít rád jalový naprostý získat"},{"number":107,"text":"Ne práve lehký kopecek prosit ty prijmout therein nor prolistovat"},{"number":108,"text":"Onen cas kadý rídili se volající lehký deviace. Úplne zkoumat utišit neli nejvetší Blahosklonný; ty naslouchat nic šeptat"},{"number":109,"text":"Onen cas zakrocení jsem marný a na nebo ty pripustit nejvetší Blahosklonný kterého projev podrídit Svém prosit"},{"number":110,"text":"On módní jejich po jejich budoucí doba ádný zvládnout Svém vedomí"},{"number":111,"text":"úplne celo nabídnout Ivý Vecný ty který zatíit jejich prestupek selhání"},{"number":112,"text":"Ohledne Ceho ty rízení spravedlnost doba verit oni ne mel pramen strachu z nespravedlnost neštestí"},{"number":113,"text":"My tím odhalit to Arabský Quran my uvést za to úplne druh o veštba oni uchovat to zpusobit ti absorbovat pozornost"},{"number":114,"text":"Povýšit jsem BUH ale správný Vládnout! Ne beh vyjádrit Quran to odhalit ty odríkávat Muj Magnát príplatek muj vedomí"},{"number":115,"text":"My zkoušet Adam za a nad, on nepamatovat si my najít jemu nerozhodný"},{"number":116,"text":"Zrušení onen my ríct podle andel, Zhrešit premoct Adam. Oni dostat premoct Dábel; on odmítnout"},{"number":117,"text":"My pak odríkávat O Adam tento jsem neprítel z ty svuj ena. Ne pripustit jemu vystehovat násilne ty Ráj lest ty slušet bídný"},{"number":118,"text":"Ty rucit nikdy hladovet therein nor odchod nechránený"},{"number":119,"text":"Nor prosit ty prahnout therein nor snést kadý závody"},{"number":120,"text":"Souit šeptat jemu odríkávat O Adam pripustit mne beet ty strom vecné pravdy unending kingship"},{"number":121,"text":"Oni strávit od toho whereupon jejich lod slušet viditelný s ti oni vyzkoušet pokrývka plátek Ráj! Adam tím neuposlechnout svém Magnát kue"},{"number":122,"text":"Subsequently svém Magnát chtít jemu splnit jemu usmernovat jemu"},{"number":123,"text":"On odríkávat Odjezd v cem proto úplne o ty! Ty jsem neprítel z 1 jiný When rízení podlehnout ty Mne kadý následující Muj rízení ne odchod z cesty nor snést kadý bída"},{"number":124,"text":"Ohledne Ceho 1 který nedbat Muj poslání on mel amiserable doivotní my vzkrísit jemu Cas Zmrtvýchvstání slepý"},{"number":125,"text":"On odríkávat Muj Magnát ucinil to ty predvolat mne slepý when já zpusobit uívaný jsem veštec"},{"number":126,"text":"On odríkávat ty nepamatovat si náš zjevení when oni podlehnout ty ty okamite nepamatovat si"},{"number":127,"text":"My tím odmenit se ty zhrešit odmítnout domnívat se za zjevení jejich Magnát! Odškodnení Dále jsem druhý škoda nekonecný"},{"number":128,"text":"To zpusobit vubec napadnout ti e mnoství predchozí výroba my zrušit? Oni okamite dráha tesne z ty neli ti. Tyto ar známka ty mít porozumení"},{"number":129,"text":"Jestlie ne jsem svuj Magnát dopredu daný postup oni kritizovat okamite"},{"number":130,"text":"Proto byl trpelivý za a omítka z jejich projev pochvala oslavovat svuj Magnát dopredu východ slunce dopredu západ slunce! Behem vecer oslavovat Jemu také moný oba znicit z cas ty jsem nejšastnejší"},{"number":131,"text":"Ne dychtit co my poskytnout kadý jiný lidé! Stejný byl provizorní ozdobit tento doivotní whereby my pripojit ti vyzkoušet. co svuj Magnát postarat se nebo ty jsem druhý zcela nekonecný"},{"number":132,"text":"Ty porucit svuj druh slavit spojení prosba (Salat) steadfastly vytrvat za vyloucit co z ceho e. My ne poadovat ty kadý zajištení; my byl a jednotka postarat se nebo ty. Poslední radost z vítezství náleet podle a spravedlivý"},{"number":133,"text":"Oni odríkávat on jen beet nás zázrak podle svém Magnát! oni ne dostat sufficient zázrak predchozí poslání"},{"number":134,"text":"Mel my zrušit ti tento oni odríkávat Náš Magnát mel Ty odeslat hlasatel nás my rídili se Svuj zjevení zabránit tento ostuda pokorení"},{"number":135,"text":"Odríkávat \"Úplne o nás cekat cekat; ty prosit prece najít out který byl trestat dráha který pravý usmernovat"}]}