{"number":38,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"(Saad) Quran zdret zkouška"},{"number":2,"text":"Ty pochybovat ponorit do arogance výzva"},{"number":3,"text":"Mnoho výroba ti my zrušit. Oni prijít nebo prispet za zbytecný"},{"number":4,"text":"Oni údiv onen warner podlehnout ti ti. disbelievers odríkávat kouzelník lhárka"},{"number":5,"text":"On útocit buh do 1 buh? Tento jsem skutecne zvláštní"},{"number":6,"text":"Vedoucí ohlásit Odchod steadfastly vytrvat dustojnost svuj buh! Tento jsem co poadovaný"},{"number":7,"text":"My nikdy slyšení tento náboenství náš predek. Tento jsem prostírat se"},{"number":8,"text":"Ucinil zkouška delat se jemu nás? Vskutku oni jsem nerozhodný z Muj zkouška! Vskutku oni ne však chutnat Muj odškodnení"},{"number":9,"text":"Znicit oni uznat povaovat za cenné soucit svuj Magnát Všemohoucí, Grantor"},{"number":10,"text":"Oni mít svrchovanost z nebe zahrabat všechno ti? Pripustit ti prispet"},{"number":11,"text":"Skoro kadý armáda oni sebrat - Práve jestlie úplne jejich úcastník shromádit dohromady - Porazit"},{"number":12,"text":"Pochybovat ti jsem lidé Noe ‘Aad mohutný Pharaoh"},{"number":13,"text":"(Také Thamoud lidé Moc obyvatel Les Midyan;) ty jsem protilehlý"},{"number":14,"text":"Kadý o ti pochybovat hlasatel tím Muj odškodnení jsem nevyhnutelný"},{"number":15,"text":"Tyto lidé myslit vybrat rána podle který oni nikdy objevit"},{"number":16,"text":"Oni upírat Náš Magnát ucinil ty ne beh odškodnení nás Cas Pocítání"},{"number":17,"text":"Byl trpelivý za a omítka z jejich projev vzpomínat si náš sluha David vynalézavý; on jsem poslušný"},{"number":18,"text":"My predloit hora svém doprava oslavovat jemu vecer cas"},{"number":19,"text":"Také osoba predloit poslouit jemu; úplne jsem poslušný s jemu"},{"number":20,"text":"My upevnit svém kingship obdarit jemu ke moudrost poslušný logika"},{"number":21,"text":"Ty dostat zpráva z krevní msta mu dret plazivý svém útocište"},{"number":22,"text":"When oni napsat svém vule on polekat. Oni odríkávat ne Mel pramen strachu! My krevní msta 1 jiný my ádat svuj dobrý soud. Ne špatne nás usmernovat nás vzprímit dráha"},{"number":23,"text":"Tento kamarád z dul uznat 90 9 nesmelý clovek i kdy já uznat jednotka nesmelý clovek. On chtít mísit muj nesmelý clovek svém zustat nouze mne"},{"number":24,"text":"On odríkávat On jsem nespravedlivý s ty na poadovat spojit svuj nesmelý clovek svém! Mnoho lidé spojit jejich divadelní rekvizity nakládat kadý jinam unfairly ty domnívat se rízení spravedlnost tyto jsem málo. Pozdeji David údiv jestlie on útocit vzprímit soud! On myšlen my zkoušet jemu. On pak vzývat svém Magnát odpuštení sklánet srazit litovat"},{"number":25,"text":"My omluvit jemu za tohleto záleitost My pripustit jemu místo honor nás krásný príbytek"},{"number":26,"text":"O David my útocit ty vladar zahrabat. Proto ty kritizovat among a národ equitably ne rídili se svuj vlastní mínení lest to odvrátit ty ráz BUH! Prece ty náhodný ráz BUH privodit si drsný odškodnení nepamatovat si Cas Pocítání"},{"number":27,"text":"My ne tvorit nebe zahrabat všechno ti za zbytecný recený byl a premýšlivý o ty pochybovat! Proto hore s ty pochybovat; oni snést Peklo"},{"number":28,"text":"My nakládat ty domnívat se primet spravedlivý doivotní moný my nakládat ty predloit odporný zahrabat? My nakládat spravedlivý moný my nakládat a prostopášný"},{"number":29,"text":"Tento jsem bible my odeslat shodit ty jsem církevní - Asi oni zrcadlit svuj zveršovat. Ty mít porozumení pokládat pozornost"},{"number":30,"text":"S David my pripustit Solomon; plný poslušný sluha"},{"number":31,"text":"cas on slušet zaujmout napred krásný jízdní vecer kue"},{"number":32,"text":"On pak odríkávat já trávit materiální potreby jinam than já trávit zbonovat muj Magnát slunit se jsem odjezd"},{"number":33,"text":"Privést ti operadlo. narízený rozchod on drhnout jejich noha krkovicka"},{"number":34,"text":"My tím pripojit Solomon vyzkoušet; my štestí jemu obrovský materiální boháci on steadfastly nabídnout"},{"number":35,"text":"On odríkávat Muj Lord omluvit mne pripustit mne kingship nikdy dosáhnout na kadý jinam! Ty jsem Grantor"},{"number":36,"text":"My (vyhovovat svém prosba predloit ovinout svém príkaz proudit déš wherever on chtít)"},{"number":37,"text":"Souit stavba vniknout hluboko"},{"number":38,"text":"Others umístení svém príkaz"},{"number":39,"text":"Tento jsem náš zajištení ty; ty odevzdat generously odmítnout vrchol"},{"number":40,"text":"On zaslouilý honorable místo nás výtecný príbytek"},{"number":41,"text":"Pamatovat náš sluha Príleitostný on prijít svém Magnát souit souit mne útrapa bolest"},{"number":42,"text":"Postihnout park svuj krok! skákal prosit odevzdat ty lécit pít"},{"number":43,"text":"My uzdravit svém rodinný pro jemu; dvakrát ackoliv mnoho. recený byl náš soucit; pripomínka ty mít porozumení"},{"number":44,"text":"Okamite ty cestovat získat kázat poslání fulfill svuj slib. My rozhodnutí jemu pevný. Který poslušný sluha! On jsem submitter"},{"number":45,"text":"vzpomínat si také náš sluha Abraham Isaac Ebrík. Oni jsem vynalézavý majetný zjevení"},{"number":46,"text":"My poskytnout ti prima štestí povedomí ceho Dále"},{"number":47,"text":"Oni chtít oni jsem among nejvetší spravedlivý"},{"number":48,"text":"Pamatovat Ismail Elisha Zal-Kifl; among nejvetší spravedlivý"},{"number":49,"text":"Tento jsem pripomínka spravedlivý zaslouilý výtecný urcení"},{"number":50,"text":"Zahradní Ráj prosit zrejmý vy- jejich vstup ti"},{"number":51,"text":"Uvolnit therein oni odevzdat mnoho druh z ovoce pít"},{"number":52,"text":"Oni mel výtecný snoubenec"},{"number":53,"text":"Tento jsem co ty zaslouilý Cas Pocítání"},{"number":54,"text":"Náš zajištení jsem nevycerpatelný"},{"number":55,"text":"Ohledne Ceho prestupník oni privodit si bídný urcení"},{"number":56,"text":"Peklo jsem kde? oni svítit; který bídný príbytek"},{"number":57,"text":"co oni chutnat therein jsem pekelný pít ostrý jídlo"},{"number":58,"text":"mnoho ceho jinam z stejne druh"},{"number":59,"text":"(Tento jsem seskupit házet Peklo ty. Oni ne prijetí obyvatel Peklo). Oni zaslouilý svítit hellfire"},{"number":60,"text":"Zacátecník vyhovovat Nor ty prijetí. Ty byl a jednotka predcházet nás zavést nás! Proto snést tento bídný skoncit"},{"number":61,"text":"Oni také odríkávat Náš Magnát tyto byl a jednotka primet nás do tento; zdvojit odškodnení hellfire ti"},{"number":62,"text":"(Oni odríkávat \"E delat se my ne prijmout Peklo) lidé my ucinil to uívaný pocet among a prostopášný"},{"number":63,"text":"My jednat zesmešnit ti; my jednat obeh náš otvor podle ti"},{"number":64,"text":"Tento dopredu daný pravda lidé Peklo krevní msta 1 jiný"},{"number":65,"text":"ríct já vypovedet ty; v tom ne jsem jinak buh BUH 1 Svrchovaný"},{"number":66,"text":"Magnát z nebe zahrabat všechno ti; Všemohoucí a Ochotný Odpustit"},{"number":67,"text":"ríct Sem jsem desivý zpráva"},{"number":68,"text":"Onen ty jsem zcela zapomnevší s"},{"number":69,"text":"Já ne mel vedomí dríve svár Výška Spolecnost"},{"number":70,"text":"Já dýchat muj prostý poslání byl vynést výstraný ty"},{"number":71,"text":"Svuj Magnát ríct podle andel já tvorit lidská bytost jsem jíl"},{"number":72,"text":"Dríve já model jemu kvet jemu podle Muj povzbudit ty dostat premoct neli jemu"},{"number":73,"text":"andel zhrešit premoct úplne o ti"},{"number":74,"text":"Dábel; on odmítnout jsem príliš nadutý unappreciative"},{"number":75,"text":"On odríkávat O Dábel co prekazit ty podle premoct dríve který já tvorit Muj písmo? Byl ty príliš nadutý? Ty vzbourit se"},{"number":76,"text":"On odríkávat já byl zcela than on; Ty tvorit mne podle palebný tvorit jemu podle jíl"},{"number":77,"text":"On odríkávat Proto ty vyhnat ty vypovedet"},{"number":78,"text":"Ty privodit si Muj zabavení Cas Soud"},{"number":79,"text":"On odríkávat Muj Lord odrocit mne Cas Zmrtvýchvstání"},{"number":80,"text":"On odríkávat Ty odrocit"},{"number":81,"text":"Ne sjednat cas"},{"number":82,"text":"On odríkávat já prísahat Svuj velicenstvo já odeslat ti úplne z cesty"},{"number":83,"text":"Svuj worshipers který oddaný úplne Ty jen"},{"number":84,"text":"On odríkávat Tento jsem vernost vernost jsem úplne já vyjádrit"},{"number":85,"text":"Já vyrídit Peklo ty úplne ty následující ty"},{"number":86,"text":"ríct já ne poadovat ty kadý vést já ne jsem podvodník"},{"number":87,"text":"Tento jsem pripomínka spolecnost"},{"number":88,"text":"Ty prosit prosím najít out od chvilku"}]}