{"number":41,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"M"},{"number":2,"text":"Zjevení podle nejvetší Blahosklonný Milosrdný"},{"number":3,"text":"Bible zveršovat stanovit kompletovat detail Arabský Quran lidé módní"},{"number":4,"text":"Dritel z poslušný zpráva také jako warner. mnoství z ti obeh oni ne naslouchat"},{"number":5,"text":"Oni odríkávat Náš dbát byl zpusobit vy- náš záves jsem hluchý s svuj poslání ohrada rozloucit nás podle ty! Zpusobit co ty chtít a e prosit my"},{"number":6,"text":"ríct já jsem nikoliv jinam than lidská bytost jsem ty dýchat onen svuj buh jsem 1 buh. Ty byl odsouzený ke zkáze podle Jemu poadovat Svém odpuštení! Hore s obraz worshipers"},{"number":7,"text":"Který ne odevzdat povinný milodar (Zakat) pohled Dále oni jsem disbelievers"},{"number":8,"text":"Ohledne Ceho ty domnívat se primet spravedlivý doivotní oni prijal zdroj zaslouilý odmenit"},{"number":9,"text":"Odríkávat Ty pochybovat Jednotka tvorit zahrabat 2 cas ty spolecnost obraz stupen Jemu On byl Magnát vesmír"},{"number":10,"text":"On umístení to stabilizers (hora) zpusobit to tvurcí On vypocítávat svuj zajištení 4 cas spokojený muset z úplne svuj obyvatel"},{"number":11,"text":"Pak On zapnout lye when to byl utišit napadnout plynem ríct podle to zahrabat Podlehnout trvání s radostí unwillingly. Oni odríkávat My podlehnout s radostí"},{"number":12,"text":"Tím On naprostý 7 vesmír 2 cas spolecnost predpis naprostý vesmír! My zdobit spodní vesmír lampa umístení krýt to! recený jsem nacrtnout Všemohoucí Vševedoucí"},{"number":13,"text":"Oni obeh pak odríkávat já vypovedet ty z neštestí neštestí zrušit ‘Aad Thamoud"},{"number":14,"text":"Jejich hlasatel odchod ti také ackoliv zpredu ti pozdeji ti odríkávat Ty ne zbonovat BUH. Oni odríkávat Mel náš Magnát willed On odeslat andel! My jsem disbelievers co ty odríkávat"},{"number":15,"text":"Ohledne Ceho ‘Aad oni povaha nadutý zahrabat postavit se proti vernost odríkávat Kterí výkonný than my? byl oni ne nahromadit onen BUH tvorit ti jsem výkonný than oni? Oni jsem unappreciative z náš zjevení"},{"number":16,"text":"Proto my odeslat ti prudký ovinout a málokterí bídný cas. My tím souit ti poníit odškodnení za tohleto doivotní odškodnení Dále jsem poníit oni nikdy získat"},{"number":17,"text":"Ohledne Ceho Thamoud my stanovit ti rízení oni povýšit slepota rízení. Proto katastrofální hanebný odškodnení zrušit ti co oni získat"},{"number":18,"text":"My stále uchovat ty domnívat se primet spravedlivý doivotní"},{"number":19,"text":"Cas podlehnout when neprítel z BUH prosit predvolat hellfire forcibly"},{"number":20,"text":"Dríve oni dosáhnout tam jejich uznat slyšení otvor okrást loisko svedcit všechno oni ucinil"},{"number":21,"text":"Oni ríct podle jejich okrást ucinil ty loisko svedcit nás? Oni vyhovovat BUH zpusobit nás mluvit On jsem Jednotka zpusobit všechno mluvit! On byl Jednotka tvorit ty dríve cas, okamite ty navrácení Jemu"},{"number":22,"text":"v tom ne jsem ráz ty ukrýt podle tvuj uznat slyšení svuj otvor svuj okrást! Skutecne ty myšlen BUH jsem neuvedomující si z skoro z co ty ucinil"},{"number":23,"text":"Tento druh o pamatovat svuj Magnát prosit zpusobit ty dostat i kdy nekdy tedy ty slušet kdo neco ztratí"},{"number":24,"text":"Oni zustat ráz oni jsem Peklo jsem jejich urcení a oni zpusobit vy- ospravedlnit oni ne odpustit"},{"number":25,"text":"My pridelit ti druhý zdobit všechno oni vyloucit co z ceho za jejich otvor. Tím oni skoncit privodit si stejne smrt predchozí spolecnost z jinns lidský jsem také kdo neco ztratí"},{"number":26,"text":"Ty pochybovat odríkávat ne naslouchat podle tento Quran zkrivit to onen ty získat"},{"number":27,"text":"My prosím souit tyto disbelievers drsný odškodnení. My prosím oplatit ti jejich odporný spravovat"},{"number":28,"text":"recený byl náhrada awaits buh neprítel. Peklo jsem jejich vecný príbytek; proste náhrada pro znehodnotit náš zjevení"},{"number":29,"text":"Ty pochybovat odríkávat Náš Lord beet nás ty 2 druh! - jinns lidský - Který zavést nás my šlapat ti náš krok preloit ti lowliest"},{"number":30,"text":"Ty vyhlásit Náš Magnát jsem BUH pak primet spravedlivý doivotní andel prejít ti Ty ne mel pramen strachu nor jsem povinen ty rmoutit! Potešit poslušný zpráva Ráj mel zachovat ty"},{"number":31,"text":"My jsem svuj spojenec za tohleto doivotní Dále. Ty mel to všechno ty prát si ty mel všechno ty chtít"},{"number":32,"text":"(Recený jsem svuj) poslední príbytek podle Forgiver Milosrdný"},{"number":33,"text":"Který vyjádrit zcela slovo than jednotka lákat BUH rízení spravedlnost odríkávat já jsem 1 z submitters"},{"number":34,"text":"Ne stejný jsem poslušný odezva špatný odezva. Ty prícina choulostivý vhodný odezva. Tím jednotka jednat jsem svuj neprátelský kveten slušet svuj zcela stoupenec"},{"number":35,"text":"Ádný dosáhnout tento ty steadfastly vytrvat. Ádný dosáhnout tento ty jsem velmi fortunate"},{"number":36,"text":"When souit šeptat plán ty ty ádat útocište BUH. On jsem Posluchac Vševedoucí"},{"number":37,"text":"Among Svém zkouška jsem vecer cas slunit se mesíc. Ne premoct slunit se nor mesíc; ty dostat premoct BUH tvorit ti ty pravý zbonovat Jemu jen"},{"number":38,"text":"Oni byl príliš nadutý vyloucit co z ceho tento pak ty svuj Lord oslavovat Jemu vecer cas mimo vubec unavený"},{"number":39,"text":"Among Svém zkouška jsem onen ty prijmout získat presto pak ackoliv brzo ackoliv my lít to rozvodnit ono otrásat doivotní! Prece Jednotka obnovit to obnovit naprosto. On jsem Všemohoucí"},{"number":40,"text":"Prece ty zkrivit náš zjevení ne ukrýt nás. Jednotka dosáhnout házet Peklo zcela jednotka delat se uzavrít Cas Zmrtvýchvstání? Ucinil cokoliv ty ádat; On jsem Veštec z všechno ty ucinil"},{"number":41,"text":"Ty vyradit Quran's pevný when to podlehnout ti také vyradit Honorable kniha"},{"number":42,"text":"Nikoliv prolhanost napsat ono za a nad z zjevení podle Odborný Chvalitebný"},{"number":43,"text":"Co jsem ríct podle ty byl presne který jsem ríct podle predchozí hlasatel! Svuj Magnát mít odpuštení On také mít trapný odškodnení"},{"number":44,"text":"My útocit to non-Arabic Quran oni odríkávat ucinil to delat se za kdy rec? Whether jsem Arabský non-Arabic ríct ty domnívat se to jsem ovlivnovat lécit Ohledne Ceho ty pochybovat oni jsem hluchý slepý to protoe oni addressed podle faraway"},{"number":45,"text":"My odevzdat Moses bible ono také debatovat! Jestlie ne jsem svuj Magnát dopredu daný rozhodnutí oni kritizovat okamite. Vskutku oni harbor také mnoství pochybovat"},{"number":46,"text":"Whoever rízení spravedlnost vyloucit co z ceho pro svých uznat poslušný whoever rízení odporný vyloucit co z ceho e svých uznat škoda! Svuj Magnát jsem nikdy nespravedlivý towards lidé"},{"number":47,"text":"Na Jemu byl vedomí Doba (znicit z spolecnost). nikoliv ovoce vyplynout jejich pochva nor ucinil kadý enská predstavit si odevzdat pocátek Svém vedomí! Cas podlehnout when On poadovat ti jsem ty obraz ty spolecnost Mne Oni odríkávat My vyhlásit Ty onen ádný o nás dopravit svedcit onen"},{"number":48,"text":"Obraz oni zbonovat koho poprít ti oni nahromadit v tom ne jsem unikat"},{"number":49,"text":"lidská bytost jsem nikdy unavený z vzývat nebo plný potreby! A when neštestí postihnout jemu on zapnout melancholický hrozný"},{"number":50,"text":"A when my štestí jemu utrpení trochu neštestí on odríkávat Tento náleet podle mne. Já ne verit Doba vubec podlehnout proplout! Práve jestlie já vrátit muj Magnát já rozhodnutí Jemu zcela potreby. Mnoství prosím my informovat disbelievers z úplne jejich spravovat predloit ti drsný odškodnení"},{"number":51,"text":"When my štestí lidská bytost jsem on obeh nános druhý druhý stranou when on snést kadý souení on vzývat loudly"},{"number":52,"text":"Vyhlásit Co tento byl pravý podle BUH pak ty rozhodný vyradit to? Který jsem druhý z cesty than ty ucinit rozhodnutí odpírat tento"},{"number":53,"text":"My beet ti náš zkouška obzor v dome ne oni nahromadit onen tento jsem vernost. jsem svuj Magnát ne sufficient svedcit úplne potreby"},{"number":54,"text":"Vskutku oni jsem nerozhodný u vhodný jejich Magnát! On jsem celkem vedomý si o úplne potreby"}]}