{"number":43,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"M"},{"number":2,"text":"A informovat bible"},{"number":3,"text":"My prevod to Arabský Quran ty porozumení"},{"number":4,"text":"To uchovat nás od puvodní ovládat honorable vrchol z moudrost"},{"number":5,"text":"My presne neznat ty zhrešit vrchol"},{"number":6,"text":"My odeslat mnoho prorok predchozí výroba"},{"number":7,"text":"Všechen cas prorok odchod ti oni zesmešnit jemu"},{"number":8,"text":"Proto my zrušit lidé byl ješte výkonný than tyto. My tím urcit príklad podle predchozí spolecnost"},{"number":9,"text":"Ty poadovat ti Kterí tvorit nebe zahrabat oni odríkávat Všemohoucí Vševedoucí tvorit ti"},{"number":10,"text":"On byl Jednotka zpusobit zahrabat obytný ty tvorit pro ty cesta therein onen ty následující porádne"},{"number":11,"text":"On byl Jednotka odeslat shodit lye rozvodnit vynucovat loisko obnovit naprostý získat vtom! Similarly ty vzkrísit"},{"number":12,"text":"On jsem Jednotka tvorit úplne druh od párit (muský enská) a On tvorit ty nakládání ivý inventár jízdní"},{"number":13,"text":"Protoe ty být ti ty uznat tak štestí svuj Magnát odríkávat Vrchol Dokonalosti jsem Jednotka zmírnit tento nás! My ne rízený ti se"},{"number":14,"text":"My konecne vrátit náš Magnát"},{"number":15,"text":"Oni pravidelný pripisovat pro Jemu rozdelit podle Svých uznat stvorení! Prece lidská bytost jsem jsem hluboce unappreciative"},{"number":16,"text":"On chtít podle Svém stvorení dcera Sobe doba štestí ty syn"},{"number":17,"text":"When jednotka z ti odevzdat zpráva (z dcera) protoe oni právo nejvetší Blahosklonný svém celo poplést bída hnev"},{"number":18,"text":"(Oni odríkávat) Který poslušný potomek byl nosit jsem krásný porce od ne bojovat"},{"number":19,"text":"Oni právo onen andel jsem sluha nejvetší Blahosklonný ar enská! Oni svedcit jejich stvorení? Jejich poadovat zaznamenat oni poadovat"},{"number":20,"text":"Oni pravidelný odríkávat nejvetší Blahosklonný willed my ne zbonovat ti. Oni ne mel základny tak poadovat; oni jen navrhnout"},{"number":21,"text":"My odevzdat ti kniha tento oni udrovat ono"},{"number":22,"text":"Pravda jsem onen oni odríkávat My rozhodnutí náš zdroj prodávat nejaký postup my následující za jejich krok"},{"number":23,"text":"Invariably when my odeslat warner kadý spolecnost vedoucí onen spolecnost odríkávat My rozhodnutí náš zdroj následující nejaký postup my zustat za jejich krok"},{"number":24,"text":"(Hlasatel) odríkávat Co já privést ty lepší rízení than co ty dedit po svuj zdroj? Oni odríkávat My jsem disbelievers poslání ty privést"},{"number":25,"text":"Proto my oplatit ti. Proslulý dusledek rejectors"},{"number":26,"text":"Abraham ríct podle svém predek svém lidé já poprít co ty zbonovat"},{"number":27,"text":"Jen Jednotka znalec mne usmernovat mne"},{"number":28,"text":"Tento príklad (z Abraham) prevod vecný lekce následující výroba; asi oni splnit jejich duše"},{"number":29,"text":"Vskutku já odevzdat tyto lidé jejich predek sufficient príleitostný pak vernost podlehnout ti procistit hlasatel"},{"number":30,"text":"When vernost podlehnout ti oni odríkávat Tento jsem kouzelný my jsem disbelievers therein"},{"number":31,"text":"Oni odríkávat jen tento Quran odeslat urcený jiný mu 2 spolecnost (Mecca Yathrib) jsem prední"},{"number":32,"text":"Oni jednotka byl pridelit svuj Magnát soucit? My pridelit jejich rozdelit za tohleto doivotní sbírat trochu o ti výše others od stupen za rozkazovat pripustit ti dorucit 1 jiný Soucit podle svuj Magnát jsem druhý zcela than kadý materiál oni zásoba"},{"number":33,"text":"Jestlie ne jsem úplne lidé slušet 1 (pochybovat) sbor my pripustit kadý pochybovat nejvetší Blahosklonný príbytek postríbrit strecha schod který oni lézt"},{"number":34,"text":"Jejich príbytek mel strhující vstup bujný domovní vybavení"},{"number":35,"text":"Také mnoho ozdobit. úplne tyto jsem provizorní materiál tento pokorný doivotní. Dále - Na svuj Magnát - Byl druhý zcela pro a spravedlivý"},{"number":36,"text":"Kadý nedbat poslání z nejvetší Blahosklonný my sjednat souit jsem svém pevný druhý"},{"number":37,"text":"Stejný druhý odvrátit ti dráha útocit ti verit oni usmernovat"},{"number":38,"text":"When on podlehnout zpredu nás on odríkávat Ohio Já prát si ty jsem ackoliv druhý mne protoe 2 východ. Který bídný druhý"},{"number":39,"text":"To ne ovládací panel ty onen cas prestupník onen oba ty delit odškodnení"},{"number":40,"text":"Ty útocit hluchý naslouchat; ty útocit slepý provést ty jsem druhý z cesty"},{"number":41,"text":"My pripustit ty poslední to ne my prece oplatit ti"},{"number":42,"text":"My beet ty (odškodnení) my slibný ti. My jsem vrchol rízení ti"},{"number":43,"text":"Ty steadfastly kázat co odhalit ty; ty jsem vzprímit dráha"},{"number":44,"text":"Tento jsem poslání ty svuj lidé; úplne o ty pochybovat"},{"number":45,"text":"Známka hlasatel my odeslat zpredu ty Mel my vubec sjednat kadý jiný buh! - beside nejvetší Blahosklonný - S zbonovat"},{"number":46,"text":"Nebo príklad, my odeslat Moses náš zkouška Pharaoh on starší vyhlásit já jsem hlasatel Magnát vesmír"},{"number":47,"text":"When on beet ti náš zkouška oni smích ti"},{"number":48,"text":"Naprostý známka my beet ti jsem porádne than 1 neli to. My souit ti souit asi oni litovat"},{"number":49,"text":"(Oni odríkávat O ty kouzelník vzývat svuj Magnát náš pro pomoct tento souit) protoe ty mel souhlas Jemu; my pak usmernovat"},{"number":50,"text":"Jen ackoliv brzo ackoliv my pomoct jejich souení oni odvrátit"},{"number":51,"text":"Pharaoh ohlásit s svém lidé O muj lidé já ne mít kingship Egypt tyto splývat proud náleet podle mne? Ty ne prijmout"},{"number":52,"text":"Který jednotka byl zcela; mi kdy 1 pokorný mohl byl sotva mluvit"},{"number":53,"text":"E delat se on ne mít povaovat za cenné zlatý; e delat se andel ne jít s jemu"},{"number":54,"text":"On tím bláznit svém lidé oni poslouchat jemu; oni jsem prostopášný lidé"},{"number":55,"text":"When oni setrvat od postavit se proti nás my potrestat ti potopit ti úplne"},{"number":56,"text":"My prevod ti predchozí príklad others"},{"number":57,"text":"When syn Marie uvést príklad svuj lidé nevšímat si to"},{"number":58,"text":"Oni odríkávat Byl to lepší zbonovat náš buh zbonovat jemu? Oni odríkávat tento jen diskutovat ty! Vskutku oni byl lidé který svázat odpor"},{"number":59,"text":"On byl nikoliv jinam than sluha my štestí my odeslat jemu protoe príklad Detský Izrael"},{"number":60,"text":"My willed my útocit ty andel osídlit rozmnoit zahrabat"},{"number":61,"text":"On jsem obsluhovat ukazovatel pro módní skoncit spolecnost e ty ješte harbor kadý pochybovat to! Ty následující Mne; tento byl vzprímit dráha"},{"number":62,"text":"rušit ne souit zahnat ty; on jsem svuj havý neprítel"},{"number":63,"text":"When Jeíš odchod zkouška on odríkávat já privést ty moudrost procistit trochu o duvod od který ty debatovat. Ty váit si BUH poslouchat mne"},{"number":64,"text":"BUH jsem MUJ MAGNÁT SVUJ LORD TY ZBONOVAT JEMU JEN! Tento byl vzprímit dráha"},{"number":65,"text":"Protilehlý debatovat sebe. Hore s ty zhrešit odškodnení trapný cas"},{"number":66,"text":"Oni cekat Doba (Cas Soud) podlehnout ti náraz when oni menší myslit to"},{"number":67,"text":"Konec stoupenec onen cas slušet neprítel z 1 jiný a na nebo a spravedlivý"},{"number":68,"text":"O Muj sluha ty ne mel pramen strachu cas nor prosit ty rmoutit"},{"number":69,"text":"Oni jsem jednotka domnívat se za náš zjevení jsem submitters"},{"number":70,"text":"Napsat Ráj dohromady svuj snoubenec tešit se"},{"number":71,"text":"Prednést ti jsem zlatý tác šálek oni najít všechno jádro poadovaný otvor ádat pro! Ty ivý therein stále"},{"number":72,"text":"recený byl Ráj onen ty dedit po operadlo svuj spravovat"},{"number":73,"text":"Ty mel to úplne druh o ovoce podle který ty strávit"},{"number":74,"text":"Prece vinný prosit zustávat odškodnení Gehenna stále"},{"number":75,"text":"Nikdy prosit odškodnení zamenit ti; oni omezit therein"},{"number":76,"text":"Ne jsem nás špatne ti; jsem oni špatne jejich uznat duše"},{"number":77,"text":"Oni vzývat O Maalek rušit svuj Lord dobít nás On odríkávat Ty utišit stále"},{"number":78,"text":"My odevzdat ty vernost mnoství z ty protivit si vernost"},{"number":79,"text":"Oni navrhovat trochu navrhovat? My príliš navrhovat"},{"number":80,"text":"Oni myšlen my ne naslouchat jejich ochrana prezidenta spiknutí? Yes vskutku; náš hlasatel jsem ti zaznamenat"},{"number":81,"text":"Vyhlásit nejvetší Blahosklonný ucinil mel syn já utišit jsem první worshiper"},{"number":82,"text":"On oslavovat; On jsem Magnát z nebe zahrabat Magnát veliciny navláda druhý výše jejich poadovat"},{"number":83,"text":"Pripustit ti chyba hraní ne oni vhodný jejich cas awaiting ti"},{"number":84,"text":"On jsem ale Jednotka jsem boství nebe boství zahrabat. On jsem nejvetší Odborný Vševedoucí"},{"number":85,"text":"Povýšit byl Jednotka mít úplne svrchovanost z nebe zahrabat všechno ti! Na Jemu byl vedomí Doba (znicit z spolecnost) Jemu ty vrátit"},{"number":86,"text":"Ádný o ty oni zbonovat koho Jemu mít kadý schopnost prostredkovat jejich zakrocení shodovat se ke vernost oni celkem módní"},{"number":87,"text":"Ty poadovat ti tvorit ti oni odríkávat BUH. would pak oni zmenit smer ceho"},{"number":88,"text":"To vyhlásit O muj Magnát tyto lidé ne verit"},{"number":89,"text":"Ty nedbat ti odríkávat Pokoj; oni ucinil to prece najít out"}]}