{"number":54,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"Doba podlehnout konec mesíc rozdelení"},{"number":2,"text":"Pak oni prijmout zázrak; oni povaha odríkávat Starší kouzelný"},{"number":3,"text":"Oni pochybovat rídili se jejich mínení být verný podle jejich starší tradice"},{"number":4,"text":"Sufficient výstraný vynést vylekat ti"},{"number":5,"text":"Prima moudrost; úplne výstraný jsem za zbytecný"},{"number":6,"text":"nevšímat si ti; cas podlehnout when volající ohlásit strašný neštestí"},{"number":7,"text":"Na jejich otvor poníit oni podlehnout váný mít rád rozloení kobylka"},{"number":8,"text":"Moný oni vyhovovat volající disbelievers odríkávat Tento jsem teký cas"},{"number":9,"text":"Lidé Noe pochybovat ti. Oni pochybovat náš sluha odríkávat Senzacní! On pronásledovat"},{"number":10,"text":"On vzývat svém Magnát já deprimovat; pripustit mne vítezství"},{"number":11,"text":"My pak otevrít vstup lye proudit rozvodnit"},{"number":12,"text":"My zpusobit trhat proud zahrabat! Rozvodnit vhodný smysl dopredu daný rozhodnutí"},{"number":13,"text":"My prodávat jemu watercraft zpusobit zaznamenat lano"},{"number":14,"text":"To vrazit náš bdelý otvor; odmenit 1 který vyradit"},{"number":15,"text":"My spolecnost to lekce. ádný o ty ádat zjistit"},{"number":16,"text":"Jak strašný jsem Muj odškodnení výstraný"},{"number":17,"text":"My útocit Quran lehký zjistit! ádný o ty ádat zjistit"},{"number":18,"text":"‘Aad pochybovat. Proto jak strašný jsem Muj odškodnení výstraný"},{"number":19,"text":"My odeslat ti prudký ovinout cas souvislý bída"},{"number":20,"text":"To los lidé pribline moný oni rozkládat podmazat krov trup"},{"number":21,"text":"Jak strašný jsem Muj odškodnení výstraný"},{"number":22,"text":"My útocit Quran lehký zjistit! ádný o ty ádat zjistit"},{"number":23,"text":"Thamoud vyradit výstraný"},{"number":24,"text":"Oni odríkávat my následující jednotka z nás; lidská bytost jsem My pak odchod z cesty pak skoncit Peklo"},{"number":25,"text":"Poslání delat se jemu nás? On jsem do ocí bijící lhárka"},{"number":26,"text":"Oni ucinil to najít out zítra který do ocí bijící lhárka jsem"},{"number":27,"text":"My odeslat velbloud vyzkoušet ti. stát na strái ti jsem trpelivý"},{"number":28,"text":"Informovat ti rozvodnit oddelovat ti; (velbloud) poskytnout nápoj jí vyznacit cas"},{"number":29,"text":"Oni presvedcit jejich stoupenec znemonit (velbloud) on ochotný"},{"number":30,"text":"Proto jak strašný jsem Muj odškodnení! Oni vypovedet"},{"number":31,"text":"My odeslat ti 1 rána whereupon oni slušet moný sklízet seno"},{"number":32,"text":"My útocit Quran lehký zjistit! ádný o ty ádat zjistit"},{"number":33,"text":"Lidé Moc vyradit výstraný"},{"number":34,"text":"My lít ti otrást. Jen Moc druh uchovat o záblesk"},{"number":35,"text":"My štestí jemu svém druh; my tím odmenit uznalý"},{"number":36,"text":"On vypovedet ti náš náhrada oni zesmešnit výstraný"},{"number":37,"text":"Oni sjednat jemu svém host; my slepý ti. Snést Muj odškodnení; ty vypovedet"},{"number":38,"text":"Dríve a následující dopoledne zpustošit odškodnení praštit ti"},{"number":39,"text":"Snést Muj odškodnení; ty vypovedet"},{"number":40,"text":"My útocit Quran lehký zjistit! ádný o ty ádat zjistit"},{"number":41,"text":"Pharaoh's lidé vypovedet"},{"number":42,"text":"Oni vyradit úplne náš známka. Proto my oplatit ti Všemohoucí Všemohoucí mel bys"},{"number":43,"text":"jsem svuj disbelievers zcela than ty disbelievers? Ty zprostit bible"},{"number":44,"text":"Asi oni pamatovat My jsem vítez"},{"number":45,"text":"Úplne o ti porazit; oni obeh pribline prchal"},{"number":46,"text":"Doba awaiting ti Doba jsem druhý škoda trapný"},{"number":47,"text":"Prosím vinný ar z cesty skoncit za Peklo"},{"number":48,"text":"Oni vlácet hellfire forcibly. Snést zápas odškodnení"},{"number":49,"text":"Všechno my tvorit práve tak tanec"},{"number":50,"text":"Náš ovládání ucinil mrknout otvor"},{"number":51,"text":"My zrušit svuj protejšek. ádný o ty ádat zjistit"},{"number":52,"text":"Všechno oni ucinil zaznamenat bible"},{"number":53,"text":"Všechno slabý velký spis"},{"number":54,"text":"Prece spravedlivý zaslouilý zahradní proud"},{"number":55,"text":"Za a výhodné místo z honor Všemohoucí Vládnout"}]}