{"number":43,"edition":"es.cortes","ayahs":[{"number":1,"text":"hm"},{"number":2,"text":"¡Por la Escritura clara"},{"number":3,"text":"Hemos hecho de ella un Corán árabe. Quizás, así, razonéis"},{"number":4,"text":"Está en la Escritura Matriz que Nosotros tenemos, sublime, sabio"},{"number":5,"text":"¿Es que, porque seáis gente inmoderada, vamos a privaros de la Amonestación"},{"number":6,"text":"¡Cuántos profetas hemos enviado a los antiguos"},{"number":7,"text":"No vino a ellos profeta que no se burlaran de él"},{"number":8,"text":"Por eso, hemos hecho perecer a otros más temibles que ellos. Ya ha precedido el ejemplo de los antiguos"},{"number":9,"text":"Si les preguntas: «¿Quién ha creado los cielos y la tierra?», seguro que dicen: «¡Los ha creado el Poderoso, el Omnisciente!»"},{"number":10,"text":"Quien os ha puesto la tierra como cuna y os ha puesto en ella caminos. Quizás, así, seáis bien dirigidos"},{"number":11,"text":"Quien ha hecho bajar agua del cielo con mesura para resucitar un país muerto. Del mismo modo se os sacará"},{"number":12,"text":"Quien ha creado todas las parejas y os ha dado las naves y los rebaños en que montáis"},{"number":13,"text":"para que os instaléis en ellos y, luego, cuando lo hayáis hecho, recordéis la gracia de vuestro Señor y digáis: «¡Gloria a Quien ha sujetado esto a nuestro servicio! ¡Nosotros no lo hubiéramos logrado!»"},{"number":14,"text":"¡Sí, volveremos a nuestro Señor"},{"number":15,"text":"Han equiparado a algunos de Sus siervos con Él. Sí. el hombre es manifiestamente desagradecido"},{"number":16,"text":"¿Iba Alá a tomar hijas de entre Sus criaturas, y a vosotros concederos hijos"},{"number":17,"text":"Cuando se anuncia a uno de ellos lo que él asimila al Compasivo, se queda hosco y se angustia"},{"number":18,"text":"«¡Cómo! Un ser que crece entre perifollos, incapaz de discutir claramente...»"},{"number":19,"text":"Han considerado a los ángeles que son siervos del Compasivo, de sexo femenino. ¿Es que han sido testigos de la creación de éstos? Se hará constar su testimonio y tendrán que responder del mismo"},{"number":20,"text":"Dicen: «Si el Compasivo hubiera querido, no les habríamos servido». No tienen ningún conocimiento de eso, no hacen sino conjeturar"},{"number":21,"text":"¿Es que les trajimos otra Escritura a la que atenerse antes de ésta"},{"number":22,"text":"¡Nada de eso! Dicen: «Encontramos a nuestros padres en una religión y, siguiendo sus huellas, estamos bien dirigidos»"},{"number":23,"text":"Y así, no enviamos ningún monitor antes de ti a una ciudad que no dijeran los ricos: «Encontramos a nuestros padres en una religión e imitamos su ejemplo»"},{"number":24,"text":"Dijo: «¿Y si os trajera una dirección más recta que la que vuestros padres seguían?» Dijeron: «¡No creemos en vuestro mensaje!»"},{"number":25,"text":"Nos vengamos de ellos. ¡Y mira cómo terminaron los desmentidores"},{"number":26,"text":"Y cuando Abraham dijo a su padre y a su gente: «Soy inocente de lo que servís"},{"number":27,"text":"Yo no sirvo sino a Quien me ha creado. Él me dirigirá»"},{"number":28,"text":"E hizo que esta palabra perdurara en su posteridad. Quizás, así, se convirtieran"},{"number":29,"text":"No sólo eso, sino que les permití gozar, a ellos y a sus padres, hasta que viniera a ellos la Verdad y un Enviado que hablara claro"},{"number":30,"text":"Pero, cuando la Verdad vino a ellos, dijeron: «¡Esto es magia y no creemos en ello!»"},{"number":31,"text":"Y dijeron: «¿Por qué no se ha revelado este Corán a un notable de una de las dos ciudades...»"},{"number":32,"text":"¿Son ellos los encargados de dispensar la misericordia de tu Señor? Nosotros les dispensamos las subsistencias en la vida de acá y elevamos la categoría de unos sobre otros para que éstos sirvieran a aquéllos. Pero la misericordia de tu Señor es mejor que lo que ellos amasan"},{"number":33,"text":"Si no hubiera sido por evitar que los hombres formaran una sola comunidad, habríamos puesto en las casas de los que no creen en el Compasivo terrazas de plata y gradas de acceso"},{"number":34,"text":"puertas y lechos en que reclinarse"},{"number":35,"text":"y lujo. Pero todo esto no es sino breve disfrute de la vida de acá en tanto que la otra vida, junto a tu Señor, será para los que Le temen"},{"number":36,"text":"A quien se cierre a la Amonestación del Compasivo, le asignamos un demonio que será para él compañero"},{"number":37,"text":"Les apartan, sí, del Camino, mientras creen ser bien dirigidos"},{"number":38,"text":"Hasta que, al comparecer ante Nosotros, diga: «¡Ojalá nos hubiera separado, a mí y a ti, la misma distancia que separa al Oriente del Occidente!» ¡Qué mal compañero"},{"number":39,"text":"Hoy no os aprovechará compartir el castigo por haber sido impíos"},{"number":40,"text":"¿Es que puedes tú hacer que un sordo oiga, o dirigir a un ciego y al que se encuentra evidentemente extraviado"},{"number":41,"text":"O te hacemos morir y, luego, Nos vengamos de ellos"},{"number":42,"text":"o te mostramos aquello con que les amenazamos. Pues les podemos con mucho"},{"number":43,"text":"¡Aténte a lo que se te ha revelado! Estás en una vía recta"},{"number":44,"text":"Es, ciertamente, una amonestación para ti y para tu pueblo y tendréis que responder"},{"number":45,"text":"Pregunta a los enviados que mandamos antes de ti si hemos establecido dioses a quienes servir en lugar de servir al Compasivo"},{"number":46,"text":"Ya enviamos Moisés con Nuestros signos a Faraón y a sus dignatarios. Y dijo: «Yo soy el enviado del Señor del universo»"},{"number":47,"text":"Pero cuando les presentó Nuestros signos, he aquí que se rieron de ellos"},{"number":48,"text":"a pesar de que cada signo que les mostrábamos superaba al precedente. Les sorprendimos con el castigo. Quizás, así, se convirtieran"},{"number":49,"text":"Dijeron: «¡Mago! ;Ruega a tu Señor por nosotros, en virtud de la alianza que ha concertado contigo! Nos dejaremos dirigir»"},{"number":50,"text":"Pero, cuando retiramos de ellos el castigo, he aquí que quebrantaron su promesa"},{"number":51,"text":"Faraón dirigió una proclama a su pueblo, diciendo: «¡Pueblo! ¿No es mío el dominio de Egipto, con estos ríos que fluyen a mis pies? ¿Es que no veis"},{"number":52,"text":"¿No soy yo mejor que éste, que es un vil y que apenas sabe expresarse"},{"number":53,"text":"¿Por qué no se le han puesto brazaletes de oro...? ¿Por qué no ha venido acompañado de ángeles...?»"},{"number":54,"text":"Extravió a su pueblo y éste le obedeció: era un pueblo perverso"},{"number":55,"text":"Cuando Nos hubieron irritados, Nos vengamos de ellos anegándolos a todos"},{"number":56,"text":"y sentamos con ellos un precedente, poniéndolos como ejemplo para la posteridad"},{"number":57,"text":"Y cuando el hijo de María es puesto como ejemplo, he aquí que tu pueblo se aparta de él"},{"number":58,"text":"Y dicen: ¿Son mejores nuestros dioses o él? Si te lo ponen, no es sino por afán de discutir. Son, en efecto, gente contenciosa"},{"number":59,"text":"El no es sino un siervo a quien hemos agraciado y a quien hemos puesto como ejemplo a los Hijos de Israel"},{"number":60,"text":"Si quisiéramos, haríamos de vosotros ángeles, que sucederían en la tierra"},{"number":61,"text":"Será un medio de conocer la Hora. ¡No dudéis, pues, de ella y seguidme! ¡Esto es una vía recta"},{"number":62,"text":"¡Que el Demonio no os extravíe! Es para vosotros un enemigo declarado"},{"number":63,"text":"Cuando Jesús vino con las pruebas claras, dijo: «He venido a vosotros con la Sabiduría y para aclararos algo de aquello en que discrepáis. ¡Temed, pues, a Alá y obedecedme"},{"number":64,"text":"Alá es mi Señor y Señor vuestro. ¡Servidle, pues! ¡Esto es una vía recta!»"},{"number":65,"text":"Pero los grupos discreparon unos de otros. ¡Ay de los impíos, por el castigo de un día doloroso"},{"number":66,"text":"No les queda más que esperar la Hora, que les vendrá de repente, sin presentirla"},{"number":67,"text":"Ese día. los amigos serán enemigos unos de otros, excepto los temerosos de Alá"},{"number":68,"text":"«¡Siervos míos! ¡No tenéis que temer hoy! ¡Y no estaréis tristes"},{"number":69,"text":"Los que creísteis en Nuestros signos y os sometisteis a Alá"},{"number":70,"text":"¡entrad en el Jardín junto con vuestras esposas, para ser regocijados!»"},{"number":71,"text":"Se harán circular entre ellos platos de oro y copas, que contendrán todo lo que cada uno desee, deleite de los ojos. «Estaréis allí eternamente"},{"number":72,"text":"Éste es el Jardín que habéis heredado como premio a vuestras obras"},{"number":73,"text":"Tenéis en él fruta abundante, de la que comeréis»"},{"number":74,"text":"Los pecadores, en cambio, tendrán la gehena como castigo, eternamente"},{"number":75,"text":"castigo que no se les remitirá, y serán presa de la desesperación"},{"number":76,"text":"No seremos Nosotros quienes hayan sido injustos con ellos, sino que ellos serán los que lo hayan sido"},{"number":77,"text":"Llamarán: «¡Malik! ¡Que tu Señor acabe con nosotros!» Él dirá: «¡Os quedaréis ahí!»"},{"number":78,"text":"«Os trajimos la Verdad, pero la mayoría sentisteis aversión a la Verdad»"},{"number":79,"text":"¿Han tramado algo? Pues Nosotros también"},{"number":80,"text":"¿O creen que no Nos enteramos de sus secretos y confidencias? ¡Claro que Nos enteramos! Y Nuestros enviados, junto a ellos, toman nota"},{"number":81,"text":"Di: «Si el Compasivo tuviera un hijo, yo sería el primero en servirle»"},{"number":82,"text":"¡Gloria al Señor de los cielos y de la tierra. Señor del Trono! ¡Está por encima de lo que Le atribuyen"},{"number":83,"text":"¡Déjales que parloteen y jueguen hasta que les llegue el Día con que se les ha amenazado"},{"number":84,"text":"¡El es Quien es dios en el cielo y dios en la tierra! Es el Sabio, el Omnisciente"},{"number":85,"text":"¡Bendito sea Quien posee el dominio de los cielos, de la tierra y de lo que entre ellos está! Él tiene conocimiento de la Hora y a Él seréis devueltos"},{"number":86,"text":"Los que ellos invocan en lugar de invocarle a Él no pueden interceder, salvo, aquéllos que atestiguan la Verdad y saben"},{"number":87,"text":"Si les preguntas: «¿Quién os ha creado?», seguro que dicen: «¡Ala!» ¡Cómo pueden, pues, ser tan desviados"},{"number":88,"text":"y de su dicho: «¡Señor! Ésta es gente que no cree»"},{"number":89,"text":"Aléjate, pues, de ellos y di: «¡Paz!» ¡Van a ver"}]}