{"number":53,"edition":"es.cortes","ayahs":[{"number":1,"text":"¡Por la estrella, cuando declina"},{"number":2,"text":"Vuestro paisano no se extravía, ni se descarría"},{"number":3,"text":"No habla por propio impulso"},{"number":4,"text":"No es sino una revelación que se ha hecho"},{"number":5,"text":"Se la ha enseñado el muy poderoso"},{"number":6,"text":"fuerte, majestuoso"},{"number":7,"text":"mientras él estaba en lo más alto del horizonte"},{"number":8,"text":"Luego, se acercó y quedó suspendido en el aire"},{"number":9,"text":"estaba a dos medidas de arco o menos"},{"number":10,"text":"Reveló a Su siervo lo que reveló"},{"number":11,"text":"No ha mentido el corazón en lo que vio"},{"number":12,"text":"¿Disputaréis, pues, con él sobre lo que ve"},{"number":13,"text":"Ya le había visto descender en otra ocasión"},{"number":14,"text":"junto al azufaifo del confín"},{"number":15,"text":"junto al cual se encuentra el jardín de la Morada"},{"number":16,"text":"cuando el azufaifo estaba cubierto por aquello"},{"number":17,"text":"No se desvió la mirada. Y no erró"},{"number":18,"text":"Vio, ciertamente, parte de los signos tan grandes de su Señor"},{"number":19,"text":"Y ¿qué os parecen al-Lat, al-Uzza"},{"number":20,"text":"y la otra, Manat, la tercera"},{"number":21,"text":"¿Para vosotros los varones y para Él las hembras"},{"number":22,"text":"Sería un reparto injusto"},{"number":23,"text":"No son sino nombres que habéis puesto, vosotros y vuestros padres, a los que Alá no ha conferido ninguna autoridad. No siguen sino conjeturas y la concupiscencia de sus almas, siendo así que ya les ha venido de su Señor la Dirección"},{"number":24,"text":"¿Obtendrá el hombre lo que desea"},{"number":25,"text":"Pero la otra vida y esta vida pertenecen a Alá"},{"number":26,"text":"¡Cuántos ángeles hay en los cielos, cuya intercesión no servirá de nada, a menos que antes dé Alá permiso a quien Él quiera, a quien Le plazca"},{"number":27,"text":"Quienes no creen en la otra vida ponen, sí, a los ángeles nombres femeninos"},{"number":28,"text":"No tienen ningún conocimiento de ello. No siguen más que conjeturas, y éstas, frente a la Verdad, no sirven de nada"},{"number":29,"text":"Apártate de quien vuelve la espalda a Nuestra Amonestación y no desea sino la vida de acá"},{"number":30,"text":"Ésa es toda la ciencia que pueden alcanzar. Alá conoce bien a quien se extravía de Su camino y conoce bien a quien sigue la buena dirección"},{"number":31,"text":"De Alá es lo que está en los cielos y en la tierra, para retribuir a los que obren mal por lo que hagan y retribuir a los que obren bien dándoles lo mejor"},{"number":32,"text":"Quienes evitan los pecados graves y las deshonestidades y sólo cometen pecados leves... Tu Señor es inmensamente indulgente. Os conocía bien cuando os creaba de la tierra y cuando erais un embrión en el seno de vuestra madre. ¡No os jactéis, pues, de puros! Él conoce bien a los que Le temen"},{"number":33,"text":"Y, ¿qué te parece el que vuelve la espalda"},{"number":34,"text":"Da poco, es mezquino"},{"number":35,"text":"¿Tiene la ciencia de lo oculto, que le permita ver"},{"number":36,"text":"¿No se le ha informado del contenido de las Hojas de Moisés"},{"number":37,"text":"y de Abraham, que cumplió"},{"number":38,"text":"que nadie cargará con la carga ajena"},{"number":39,"text":"que el hombre sólo será sancionado con arreglo a su propio esfuerzo"},{"number":40,"text":"que se verá el resultado de su esfuerzo"},{"number":41,"text":"que será, luego, retribuido generosamente"},{"number":42,"text":"que el fin de todo es tu Señor"},{"number":43,"text":"que es Él Quien hace reír y hace llorar"},{"number":44,"text":"que es Él Quien da la muerte y da la vida"},{"number":45,"text":"que Él crea la pareja, varón y hembra"},{"number":46,"text":"de una gota cuando es eyaculada"},{"number":47,"text":"que a Él incumbe la otra creación"},{"number":48,"text":"que es Él Quien da riquezas y posesiones"},{"number":49,"text":"que es Él el Señor de Sirio"},{"number":50,"text":"que Él hizo perecer a los antiguos aditas"},{"number":51,"text":"y a los tamudeos, sin dejar uno solo con vida"},{"number":52,"text":"y, antes, al pueblo de Noé, que fue tan impío y rebelde"},{"number":53,"text":"y aniquiló a la vuelta de arriba abajo"},{"number":54,"text":"cubriéndola como la cubrió"},{"number":55,"text":"¿Cuál, pues, de los beneficios de tu Señor pondrás en duda"},{"number":56,"text":"Ésta es una advertencia al estilo de las advertencias antiguas"},{"number":57,"text":"Amenaza la Inminente"},{"number":58,"text":"Nadie, fuera de Alá, puede quitarla"},{"number":59,"text":"¿Os asombráis, pues, de este discurso"},{"number":60,"text":"¿Y reís, en lugar de llorar"},{"number":61,"text":"permaneciendo indiferentes"},{"number":62,"text":"¡Prosternaos, pues, ante Alá y servidle"}]}