{"number":71,"edition":"es.cortes","ayahs":[{"number":1,"text":"Enviamos a Noé a su pueblo: «¡Advierte a tu pueblo antes de que le alcance un castigo doloroso!»"},{"number":2,"text":"Dijo: «¡Pueblo! Soy para vosotros un monitor que habla claro"},{"number":3,"text":"¡Servid a Alá y temedle! ¡Y obedecedme"},{"number":4,"text":"Así, os perdonará vuestros pecados y os remitirá a un plazo fijo. Pero, cuando venza el plazo fijado por Alá, no podrá ya ser retardado. Si supierais...»"},{"number":5,"text":"Dijo: «¡Señor! He llamado a mi pueblo noche y día"},{"number":6,"text":"Mi llamamiento sólo ha servido para que huyan más"},{"number":7,"text":"Siempre que les llamo para que Tú les perdones, se ponen los dedos en los oídos, se cubren con la ropa, se obstinan y se muestran en extremo altivos"},{"number":8,"text":"Además, les he llamado abiertamente"},{"number":9,"text":"y les he hablado en público y en secreto"},{"number":10,"text":"Y he dicho: '¡Pedid perdón a vuestro Señor -Que es indulgente"},{"number":11,"text":"y enviará sobre vosotros del cielo una lluvia abundante"},{"number":12,"text":"Os dará mucha hacienda e hijos varones. Pondrá a vuestra disposición jardines, pondrá a vuestra disposición arroyos"},{"number":13,"text":"¿Qué os pasa, que no esperáis de Alá magnanimidad"},{"number":14,"text":"habiéndoos creado en fases"},{"number":15,"text":"¿No habéis visto cómo ha creado Alá siete cielos superpuestos"},{"number":16,"text":"y puesto en ellos la luna como luz y el sol como lámpara"},{"number":17,"text":"Alá os ha hecho crecer de la tierra como plantas"},{"number":18,"text":"Después, os hará volver a ella, y os sacará"},{"number":19,"text":"Alá os ha puesto la tierra como alfombra"},{"number":20,"text":"para que recorráis en ella caminos, anchos pasos'»"},{"number":21,"text":"Noé dijo: «¡Señor! Me han desobedecido y han seguido a aquéllos cuya hacienda e hijos no hacen sino perderles más"},{"number":22,"text":"Han perpetrado una enorme intriga"},{"number":23,"text":"Y dicen: '¡No abandonéis a vuestros dioses! ¡No abandonéis a Wadd, ni a Suwaa, ni a Yagut, a Yauq y a Nasr"},{"number":24,"text":"Han extraviado a muchos. A los impíos ¡no hagas sino extraviarles más!»"},{"number":25,"text":"Por sus pecados, fueron anegados e introducidos en un Fuego. No encontraron quien, fuera de Alá, les auxiliara"},{"number":26,"text":"Noé dijo: «¡Señor! ¡No dejes en la tierra a ningún infiel con vida"},{"number":27,"text":"Si les dejas, extraviarán a Tus siervos y no engendrarán sino a pecadores, infieles pertinaces"},{"number":28,"text":"¡Señor! ¡Perdónanos, a mi y a mis padres, a quien entre en mi casa como creyente, a los creyentes y a las creyentes! Y a los impíos ¡no hagas sino perderles más!»"}]}