{"number":42,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"Ha, Mîm"},{"number":2,"text":"Ayn, Sîn, Kaf"},{"number":3,"text":"İşte böyle vahyeder sana ve senden öncekilere Azîz ve Hakîm olan Allah"},{"number":4,"text":"Göklerdeki ve yerdeki her şey O'nundur. Öylesine yüce, öylesine büyüktür O"},{"number":5,"text":"Gökler, üstlerinden çatlayacak gibi titreşiyor. Melekler de Rablerinin hamdiyle tespih ediyorlar ve yeryüzündekiler için af diliyorlar. Gözünüzü açıp kendinize gelin! Allah'tır ancak hep affeden, hep merhamet eden"},{"number":6,"text":"O'nun berisinden veliler edinenlere gelince, onlar üzerine gözcü de Allah'tır. Sen değilsin onlara vekil"},{"number":7,"text":"İşte böyle! Biz sana Arapça bir Kur'an vahyettik ki, ülke ve medeniyetlerin anasını ve çevresindekileri uyarasın. Ve toplama günü konusunda da uyarıda bulunasın. Hiç kuşku yok o günde. Bir bölük cennettedir, bir bölük ateşte"},{"number":8,"text":"Eğer Allah dileseydi onları bir tek ümmet elbette yapıverirdi. Fakat O, dilediği kişiyi/dileyeni rahmetine sokar. Zalimlere gelince, onlar için ne bir dost vardır ne de bir yardımcı"},{"number":9,"text":"Yoksa O'ndan başka veliler mi edindiler? Allah! O'dur gerçek dost. Ölüleri O diriltir. O her şeye güç yetirir"},{"number":10,"text":"Herhangi bir şeyde ihtilafa düştüğünüzde onun hükmü Allah'a bırakılır. İşte budur Rabbim olan Allah! Yalnız O'na güvenip dayandım; yalnız O'na yönelirim ben"},{"number":11,"text":"Gökleri ve yeri ortaya çıkarandır, Fâtır'dır O. Size, benliklerinizden eşler yapmıştır; davarlardan da çiftler. Bu tarz içinde üretiyor sizi. O'nun benzeri gibi bir şey yoktur. Gereğince işiten, gereğince görendir O"},{"number":12,"text":"Göklerin ve yerin kilitleri/anahtarları O'nundur. Rızkı, dilediğine açıp bol bol verir. Kısarak, ölçüyle de verir. Gerçek şu ki, O herşeyi en iyi biçimde bilmektedir"},{"number":13,"text":"Sizin için, dinden, Nûh'a önerdiğini, sana vahyettiğini, İbrahim'e, Mûsa'ya ve İsa'ya önerdiğimizi şöyle diyerek kanunlaştırdı: \"Dini dosdoğru tutun; onda bölünüp fırkalara ayrılmayın!\" Onları çağırdığın bu tutum, şirke bulaşanlara çok ağır gelmiştir. Allah, dilediğini kendisi için seçer ve hakka yönelenleri kendisine iletir"},{"number":14,"text":"Kendilerine ilim geldikten sonra, sadece aralarındaki kıskançlık ve azgınlık yüzünden fırkalara bölündüler. Eğer belli bir süreye kadar erteleme sözü Rabbinden gelmiş olmasaydı, aralarında iş mutlaka bitirilirdi. Onların ardından Kitap'a mirasçı olanlar da onun hakkında, işkillendiren bir kuşku içindedirler"},{"number":15,"text":"İşte bunun için sen çağrıda bulun/dua et ve emrolunduğun gibi dosdoğru yürü. Onların boş arzularına uyma ve şöyle de: \"Allah'ın Kitap'tan indirdiğine inandım. Aranızda adaleti sağlamakla emrolundum. Allah'tır, bizim de Rabbimiz, sizin de Rabbiniz. Bizim amellerimiz bize, sizin amellerinizin size. Bizimle sizin aranızda delil yok. Allah bizi biraraya toplayacaktır/aramızı bulacaktır. Dönüş O'nadır"},{"number":16,"text":"Kabul edilişinin ardından Allah hakkında tartışmaya girenlerin delilleri Rableri katında geçersizdir. Bunların üzerlerine öfke, kendilerine şiddetli bir azap vardır"},{"number":17,"text":"Gerçeğe ilişkin Kitap'ı ve adalet ölçüsünü indiren o Allah'tır. Nereden bileceksin, belki de kıyamet saati çok yakındır"},{"number":18,"text":"Ona inanmayanlar onun çabucak gelmesini isterler. İman edenlerse ondan ürperirler ve bilirler ki o haktır. Dikkat edin, kıyamet saati hakkında tartışıp duranlar, geri dönüşü olmayan bir sapıklığın tam içindedirler"},{"number":19,"text":"Allah, kullarına çok lütufkârdır; dilediğini rızıklandırır. O'dur en güçlü, O'dur en yüce"},{"number":20,"text":"Âhiret ekini isteyenin o ekinini artırırız; dünya ekini isteyene de ondan veririz. Ama böylesi için âhirette bir nasip yoktur"},{"number":21,"text":"Yoksa onların, dinden, Allah'ın izin vermediği şeyi kendileri için yasalaştıran ortakları mı var? Kesin ayrıma ilişkin söz olmasaydı, aralarında hüküm mutlaka verilirdi. O zalimler var ya, onlar için acıklı bir azap öngörülmüştür"},{"number":22,"text":"Kazandıkları, tepelerine inerken o zalimlerin korkudan titrediklerini göreceksin. İman edip hayra ve barışa yönelik işler yapanlarsa cennetlerin bahçelerindedir. Rableri katında kendileri için, diledikleri herşey vardır. İşte budur o büyük lütuf"},{"number":23,"text":"Allah'ın, iman edip hayra ve barışa yönelik iyi işler yapanlara müjdelediği, işte budur. De ki: \"Ben, buna karşılık sizden, yakın akrabamı/Ehlibeytimi sevmeniz dışında bir ücret istemiyorum.\" Kim bir iyilik/güzellik üretirse onun için, o ürettiğine bir güzellik daha ekleriz. Çünkü Allah Gafûr'dur, çok affeder; Şekûr'dur, iyiliğe karşılık verir/teşekkür eder"},{"number":24,"text":"Yoksa, \"Yalan düzüp Allah'a iftira etti\" mi diyorlar? Allah dilerse senin kalbini mühürler; bâtılı mahveder ve hakkı kendi sözleriyle gerçekleştirir. Kuşkusuz, O, göğüslerin özündekini çok iyi bilir"},{"number":25,"text":"Kullarından tövbeyi kabul eden O'dur. Çirkinlikleri/kötülükleri affeden O, yapıp ettiklerinizi bilen O"},{"number":26,"text":"İman edip barışa/hayra yönelik işler yapanların dualarını O cevaplıyor, lütfundan onlara fazlasını O veriyor. İnkârcılara da şiddetli bir azap var"},{"number":27,"text":"Eğer Allah, kulları için rızkı yayıp döşeseydi, yeryüzünde mutlaka azarlardı. Ama O, dilediğince ölçülü olarak indiriyor. Çünkü O, kullarından gereğince haberdardır, onları iyice görmektedir"},{"number":28,"text":"O odur ki, kulları umutlarını kestikten sonra yağmuru indirir ve rahmetini yayar. Velî'dir O, Hamîd'dir"},{"number":29,"text":"Gökleri ve yeri ve bu ikisi içinde yaydığı canlıları yaratması da O'nun ayetlerindendir. O, dilediği zamanda onları bir araya getirmeye kadirdir"},{"number":30,"text":"Size gelip çatan her musibet ellerinizin kazandığı yüzündendir. Allah birçoklarını da affediyor"},{"number":31,"text":"Siz yeryüzünde âciz bırakıcılar değilsiniz. Sizin, Allah'tan başka dostunuz da yoktur, yardımcısınız da"},{"number":32,"text":"Denizde o dağlar gibi akıp giden gemiler de O'nun ayetlerindendir"},{"number":33,"text":"Dilerse rüzgârı durdurur da o akıp giden gemiler denizin sırtında donmuş gibi kalırlar. Gereğince sabreden, gereğince şükreden herkes için bütün bunlarda elbette ki ibretler vardır"},{"number":34,"text":"Yahut onları, içindekilerin kazançları yüzünden mahveder. Ama birçoğunu affediyor"},{"number":35,"text":"Ki ayetlerimiz hakkında tartışıp duranlar kendileri için kaçacak bir yer olmadığını bilsinler"},{"number":36,"text":"Size verilen şeyler, şu iğreti hayatın nimetidir. İnanıp Rablerine tevekkül edenler için Allah katında bulunan ise daha hayırlı, daha kalıcıdır"},{"number":37,"text":"Onlar, günahın büyüklerinden ve tüm iğrençliklerinden uzak dururlar. Öfkelendikleri zamansa, affedenler onlar olur"},{"number":38,"text":"Rablerinin çağrısına cevap verirler, namazı/duayı yerine getirirler. İşleri/yönetimleri, aralarında bir şûra'dır. Kendilerine verdiğimiz rızıklardan infak ederler"},{"number":39,"text":"Kendilerine zulüm ve haksızlık gelip çattığında, yardımlaşırlar"},{"number":40,"text":"Bir kötülüğün cezası, tıpkısı bir kötülüktür. Fakat affdeip barışmayı esas alanın ücretini bizzat Allah verir. O, zalimleri hiç sevmez"},{"number":41,"text":"Zulme uğratılışı ardından kendini savunana gelince, böyleleri aleyhine yol aranamaz"},{"number":42,"text":"Aleyhlerine yol aranacak olan şu kişilerdir ki, insanlara zulmederler ve yeryüzünde haksız yere taşkınlıklar sergilerler/saldırılarda bulunurlar. İşte böyleleri için acıklı bir azap vardır"},{"number":43,"text":"Sabredip bağışlayan bilsin ki, bu, işlerin en zorlularındandır"},{"number":44,"text":"Allah'ın saptırdığına, O'ndan başka dost yoktur. Zalimlerin, azapla yüz yüze geldiklerinde, \"Geri dönüşe bir yol yok mu?\" diye söylendiklerini göreceksin"},{"number":45,"text":"Ve göreceksin onları, zilletten ezilip büzülmüş halde ürkek bakışlarla bakarken, ateşe salınırlar. İnananlar şöyle derler: \"Gerçek hüsrana uğrayanlar, kıyamet günü hem kendilerini hem de ailelerini perişan edenlerdir. Dikkat edin, zalimler, sürüp gidecek bir azabın içindedir"},{"number":46,"text":"Onların Allah'tan başka kendilerine yardım edecek velileri yoktur. Allah'ın saptırdığı kimse için artık hiçbir yol yoktur"},{"number":47,"text":"Ertelenmesine Allah'tan izin çıkmayacak gün gelmeden önce, Rabbinizin çağrısına uyun. O gün, sığınacak yeriniz olmayacak; yaptıklarınızı inkârınız da mümkün olmayacak"},{"number":48,"text":"Yüz çevirirlerse, biz seni onlar üzerine bekçi göndermemişiz. Sana düşen, tebliğden başka bir şey değildir. Biz insana, bizden bir rahmet tattırdığımızda, onunla sevinip şımarır. Kendi ellerinin hazırladığından bir kötülük başlarına sarılınca, bakarsın insan, alabildiğine nankörleşmiştir"},{"number":49,"text":"Göklerin ve yerin mülkü/yönetimi Allah'ındır. Dilediğini yaratır. Dilediğine kız evlat bağışlar, dilediğine erkek evlatlar armağan eder"},{"number":50,"text":"Yahut onları erkekler ve dişiler halinde çift verir. Dilediğini de kısır yapar. O'dur bilen, O'dur güç yetiren"},{"number":51,"text":"Allah, bir insanla ancak vahiy yoluyla yahut perde arkasından konuşur; yahut da bir resul gönderir de kendi izniyle dilediğini vahyeder. Yüceler yücesi O'dur; hüküm ve hikmet sahibi O'dur"},{"number":52,"text":"İşte böylece sana da emrimizden bir ruh vahyettik. Sen, kitap nedir, iman nedir bilmezdin. Fakat biz onu, kullarımızdan dilediğimizi kendisiyle kılavuzladığımız bir nur yaptık. Hiç kuşkusuz, sen, dosdoğru bir yola kılavuzluk etmektesin"},{"number":53,"text":"Göklerde ve yerdeki her şeyin sahibi olan Allah'ın yoludur o. Gözünüzü açın, bütün iş ve oluşlar Allah'a varır"}]}