{"number":76,"edition":"tr.ozturk","ayahs":[{"number":1,"text":"İnsan üzerinden, henüz anılan bir şey olmadığı bir süre geçmedi mi zamandan"},{"number":2,"text":"Doğrusu, biz insanı karışım olan bir spermden yarattık. Halden hale geçiririz onu. Sonunda onu işitici, görücü yaptık"},{"number":3,"text":"Biz onu yola kılavuzladık. Artık ya şükredici olur ya nankör"},{"number":4,"text":"Biz, nankörler için zincirler, bukağılar ve kızgın bir ateş hazırladık"},{"number":5,"text":"İyilere gelince, onlar, karışımı kâfur olan bir kadehten içerler"},{"number":6,"text":"Bir kaynak ki, Allah'ın kulları ondan içerler ve onu fışkırtarak akıtırlar"},{"number":7,"text":"Onlar verdikleri sözü tam bir biçimde yerine getirirler ve kötülüğü salgın olan bir günden korkarlar"},{"number":8,"text":"Yoksula, yetime ve esire, yemeği severek yedirirler"},{"number":9,"text":"Biz size yalnız ve yalnız Allah rızası için yediriyoruz. Sizden bir karşılık da bir teşekkür de istemiyoruz"},{"number":10,"text":"Çünkü biz, asık suratlı, sert bir gün yüzünden Rabbimizden korkarız.\" derler"},{"number":11,"text":"Allah da onları o günün şerrinden korumuş ve kendilerini bir parlaklığa, bir sevince ulaştırmıştır"},{"number":12,"text":"Sabretmelerine karşılık olarak da onları bir bahçe ve ipekle ödüllendirmiştir"},{"number":13,"text":"Koltuklar üzerine yaslanarak otururlar orada. Ne bir güneş görürler orada ne de kavurucu bir soğuk"},{"number":14,"text":"Bahçenin gölgeleri üzerlerine eğilmiştir. Ve bahçenin meyveleri iyice yaklaştırılmıştır"},{"number":15,"text":"Çevrelerinde, gümüşten ve billurdan kaplar dolaştırılır. Kupalardır onlar"},{"number":16,"text":"Gümüşten kupalar ki, tam diledikleri ölçüde belirlemişlerdir onları"},{"number":17,"text":"Orada kendilerine karışımı zencefil olan bir kadehten içirilir"},{"number":18,"text":"Bir pınar ki, orada, selsebil diye anılır"},{"number":19,"text":"Dolaşır çevrelerinde, sürekli görevlendirilmiş gençler. Görseydin onları, dizilmiş inciler sanırdın"},{"number":20,"text":"Oraya baktığında, nereye göz atsan büyük bir nimet, büyük bir mülk ve yönetim görürsün"},{"number":21,"text":"Üzerlerinde yeşil-ince ipeklerle, sırmalı, kalın ipeklerden giysiler vardır. Gümüşten bileziklerle süslenmişlerdir. Ve Rableri onlara tertemiz bir içki ikram etmiştir"},{"number":22,"text":"İşte bu size bir ödüldür. Ve sizin gayretiniz şükranla karşılanmıştır"},{"number":23,"text":"Biz indirdik o Kur'an'ı sana parça parça, biz"},{"number":24,"text":"O halde, Rabbinin hükmü karşısında sabret ve onların günahkârlarına da nankörlerine de boyun eğme"},{"number":25,"text":"Rabbinin adını sabahtan da akşamdan da an"},{"number":26,"text":"Gecenin bir kısmında da O'na secde et! Ve geceleyin O'nu uzunca tespih et/uzun bir gece boyu O'nu tespih et"},{"number":27,"text":"Bunlar, hemen gelecek olanı seviyorlar da ötelerindeki zorlu bir günü ihmal ediyorlar"},{"number":28,"text":"Biz yarattık onları ve kuvvetli yaptık bağlarını/eklemlerini. Dilediğimizde benzerleri ile değiştiririz onları"},{"number":29,"text":"İşte bu, bir hatırlatıcı ve düşündürücüdür. Dileyen, Rabbine doğru, bir yol edinir"},{"number":30,"text":"Allah dilemedikçe siz dileyemezsiniz. Allah Alîm'dir, Hakîm'dir"},{"number":31,"text":"Dilediğini/dileyeni rahmetinin içine sokar. Zalimlere gelince, onlar için korkunç bir azap hazırlamıştır"}]}