{"number":67,"edition":"fa.ayati","ayahs":[{"number":1,"text":"بزرگوار و متعالى است خداوندى كه فرمانروايى به دست اوست و او بر هر چيزى تواناست"},{"number":2,"text":"آن كه مرگ و زندگى را بيافريد، تا بيازمايدتان كه كدام يك از شما به عمل نيكوتر است و اوست پيروزمند و آمرزنده"},{"number":3,"text":"آن كه هفت آسمان طبقه طبقه را بيافريد. در آفرينش خداى رحمان هيچ خلل و بى‌نظمى نمى‌بينى. پس بار ديگر نظركن، آيا در آسمان شكافى مى‌بينى؟"},{"number":4,"text":"بار ديگر نيز چشم باز كن و بنگر. نگاه تو خسته و درمانده به نزد تو باز خواهد گشت"},{"number":5,"text":"ما آسمان فرودين را به چراغهايى بياراستيم و آن چراغها را وسيله راندن شياطين گردانيديم و برايشان شكنجه آتش سوزان آماده كرده‌ايم"},{"number":6,"text":"و براى كسانى كه به پروردگارشان كافر شده‌اند عذاب جهنم باشد و جهنم بد سرانجامى است"},{"number":7,"text":"چون در جهنم افكنده شوند، به جوش آيد و بانگ زشتش را بشنوند،"},{"number":8,"text":"نزديك است كه از خشم پاره‌پاره شود. و چون فوجى را در آن افكنند، خازنانش گويندشان: آيا شما را بيم‌دهنده‌اى نيامد؟"},{"number":9,"text":"گويند: چرا، بيم‌دهنده آمد ولى تكذيبش كرديم و گفتيم: خدا هيچ چيز نازل نكرده است؛ شما در گمراهى بزرگى هستيد"},{"number":10,"text":"و مى‌گويند: اگر ما مى‌شنيديم يا تعقل مى‌كرديم، اهل اين آتش سوزنده نمى‌بوديم"},{"number":11,"text":"پس به گناه خود اعتراف مى‌كنند. اى لعنت باد بر آنها كه اهل آتش سوزنده‌اند"},{"number":12,"text":"براى كسانى كه ناديده از پروردگارشان مى‌ترسند، آمرزش و مزد فراوان است"},{"number":13,"text":"چه به راز سخن گوييد و چه آشكارا، او به هر چه در دلها مى‌گذرد داناست"},{"number":14,"text":"آيا آن كه آفريده نمى‌داند؟ حال آنكه او باريك‌بين و آگاه است"},{"number":15,"text":"اوست كه زمين را رام شما گردانيد. پس بر روى آن سير كنيد، و از رزق خدا بخوريد. چون از قبر بيرون آييد به سوى او مى‌رويد"},{"number":16,"text":"آيا از آن كه در آسمان است ايمن نشسته‌ايد كه ناگاه زمين را به لرزش درآورد و زمين شما را در خود فرو برد؟"},{"number":17,"text":"يا از آن كه در آسمان است ايمن نشسته‌ايد كه ناگاه بادى همراه با سنگريزه بر سر شما فرستد؟ به زودى خواهيد دانست كه بيم‌دادن من چگونه است"},{"number":18,"text":"هر آينه كسانى كه پيش از آنها بودند، پيامبران را تكذيب كردند. پس عذاب من چگونه بود"},{"number":19,"text":"آيا پرندگانى را كه بال گشوده يا بال فراهم‌كشيده بر فراز سرشان در پروازند، نديده‌اند؟ آنها را جز خداى رحمان كسى در هوا نگاه نتواند داشت. اوست كه به همه چيز بيناست"},{"number":20,"text":"آيا آنان كه ياران شمايند توانند در برابر خدا ياريتان كنند؟ كافران در فريبى بيش نيستند"},{"number":21,"text":"آيا كيست آن كه به شما روزى دهد اگر او روزى خويش باز دارد؟ نه، در سركشى و دورى از حق لجاج مى‌ورزند"},{"number":22,"text":"آيا آن كس كه نگونسار بر روى افتاده راه مى‌رود، هدايت يافته‌تر است يا آن كه بر پاى ايستاده و بر راه راست مى‌رود؟"},{"number":23,"text":"بگو: اوست كه شما را آفريده است و گوش و چشم و دل داده است. چه اندك سپاس مى‌گزاريد"},{"number":24,"text":"بگو: اوست كه شما را در زمين آفريد و در قيامت نزد او گرد آورده مى‌شويد"},{"number":25,"text":"مى‌گويند: اگر راست مى‌گوييد، اين وعده چه وقت فرا مى‌رسد؟"},{"number":26,"text":"بگو: علم آن نزد خداست و من بيم‌دهنده‌اى آشكارم"},{"number":27,"text":"كافران چون نزديكش بنگرند، چهره‌شان گرفته شود. و به آنها گفته مى‌شود: اين است آنچه باطلش مى‌خوانديد"},{"number":28,"text":"بگو: گيرم كه خدا مرا و همراهانم را هلاك كند يا بر ما رحمت آورد، چه كسى كافران را از عذاب دردآور مى‌رهاند؟"},{"number":29,"text":"بگو: او خداى رحمان است. به او ايمان آورديم و بر او توكل كرديم. و زودا كه خواهيد دانست چه كسى در گمراهى آشكار است"},{"number":30,"text":"بگو: اگر آبتان در زمين فرو رود، چه كسى شما را آب روان خواهد داد؟"}]}