[{"hadith-eng":"When the Prophet (ﷺ) got up at night to offer the Tahajjud prayer, he used to say: Allahumma lakal-hamd. \nAnta qaiyyimus-samawati wal-ard wa man fihinna. Walakal-hamd, Laka mulkus-samawati wal-ard wa \nman fihinna. Walakal-hamd, anta nurus-samawati wal-ard. Wa lakal-hamd, anta-l-haq wa wa'duka-lhaq, \nwa liqa'uka Haq, wa qauluka Haq, wal-jannatu Han wan-naru Haq wannabiyuna Haq. Wa \nMuhammadun, sallal-lahu'alaihi wasallam, Haq, was-sa'atu Haq. Allahumma aslamtu Laka wabika \namantu, wa 'Alaika tawakkaltu, wa ilaika anabtu wa bika khasamtu, wa ilaika hakamtu faghfir li ma \nqaddamtu wama akh-khartu wama as-rartu wama'a lantu, anta-l-muqaddim wa anta-l-mu akh-khir, la \nilaha illa anta (or la ilaha ghairuka). (O Allah! All the praises are for you, You are the Holder of the \nHeavens and the Earth, And whatever is in them. All the praises are for You; You have the possession \nof the Heavens and the Earth And whatever is in them. All the praises are for You; You are the Light \nof the Heavens and the Earth And all the praises are for You; You are the King of the Heavens and the \nEarth; And all the praises are for You; You are the Truth and Your Promise is the truth, And to meet \nYou is true, Your Word is the truth And Paradise is true And Hell is true And all the Prophets (Peace \nbe upon them) are true; And Muhammad is true, And the Day of Resurrection is true. O Allah ! I \nsurrender (my will) to You; I believe in You and depend on You. And repent to You, And with Your \nhelp I argue (with my opponents, the non-believers) And I take You as a judge (to judge between us). \nPlease forgive me my previous And future sins; And whatever I concealed or revealed And You are \nthe One who make (some people) forward And (some) backward. There is none to be worshipped but \nyou . Sufyan said that `Abdul Karim Abu Umaiya added to the above, 'Wala haula Wala quwata illa \nbillah' (There is neither might nor power except with Allah).","reference":"Sahih al-Bukhari 1120, Book 19, Hadith 1","grade":"","question #":"question #1","question":"What are the attributes of Allah mentioned in the supplication recited during the Tahajjud prayer?","id":"bukhari-19-1"},{"hadith-eng":"In the lifetime of the Prophet (ﷺ) whosoever saw a dream would narrate it to Allah's Messenger (ﷺ). I had a wish \nof seeing a dream to narrate it to Allah's Messenger (ﷺ) (p.b.u.h) I was a grown up boy and used to sleep in \nthe Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and \ntook me to the Fire which was built all round like a built well and had two poles in it and the people in \nit were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another \nangel who told me not to be afraid. I narrated the dream to Hafsa who told it to Allah's Messenger (ﷺ). The \nProphet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's \nfather) used to sleep but a little at night.","reference":"Sahih al-Bukhari 1121, 1122, Book 19, Hadith 2","grade":"","question #":"question #1","question":"What significance do dreams hold in Islamic tradition and how were they treated during the Prophet's time?","id":"bukhari-19-2"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer eleven rak`at and that was his prayer. He used to prolong the prostration \nto such an extent that one could recite fifty verses (of the Qur'an) before he would lift his head. He \nused to pray two rak`at (Sunna) before the Fajr prayer and then used to lie down on his right side till \nthe call-maker came and informed him about the prayer.","reference":"Sahih al-Bukhari 1123, Book 19, Hadith 3","grade":"","question #":"question #1","question":"How many rak`at did the Prophet Muhammad (ﷺ) typically offer in his prayer?","id":"bukhari-19-3"},{"hadith-eng":"The Prophet (ﷺ) became sick and did not get up (for Tahajjud prayer) for a night or two.","reference":"Sahih al-Bukhari 1124, Book 19, Hadith 4","grade":"","question #":"question #1","question":"What can be inferred about the Prophet's dedication to Tahajjud prayer from his actions during illness?","id":"bukhari-19-4"},{"hadith-eng":"Gabriel did not come to the Prophet (for some time) and so one of the Quraish women said, \"His \nSatan has deserted him.\" So came the Divine Revelation: \"By the forenoon And by the night When it \nis still! Your Lord (O Muhammad) has neither Forsaken you Nor hated you.\" (93.1-3)","reference":"Sahih al-Bukhari 1125, Book 19, Hadith 5","grade":"","question #":"question #1","question":"What was the reaction of the Quraish when there was a delay in revelation to the Prophet Muhammad?","id":"bukhari-19-5"},{"hadith-eng":"One night the Prophet (ﷺ) got up and said, \"Subhan Allah! How many afflictions Allah has revealed \ntonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady \noccupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in \nthe Hereafter.\"","reference":"Sahih al-Bukhari 1126, Book 19, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of night prayers in Islam according to the teachings of the Prophet?","id":"bukhari-19-6"},{"hadith-eng":"One night Allah's Messenger (ﷺ) came to me and Fatima, the daughter of the Prophet (ﷺ) and asked, \"Won't you \npray (at night)?\" I said, \"O Allah's Messenger (ﷺ)! Our souls are in the hands of Allah and if He wants us to \nget up He will make us get up.\" When I said that, he left us without saying anything and I heard that \nhe was hitting his thigh and saying, \"But man is more quarrelsome than anything.\" (18.54)","reference":"Sahih al-Bukhari 1127, Book 19, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of night prayer in Islam and how is it encouraged by the Prophet (ﷺ)?","id":"bukhari-19-7"},{"hadith-eng":"Allah's Messenger (ﷺ) used to give up a good deed, although he loved to do it, for fear that people might act \non it and it might be made compulsory for them. The Prophet (ﷺ) never prayed the Duha prayer, but I \noffer it.","reference":"Sahih al-Bukhari 1128, Book 19, Hadith 8","grade":"","question #":"question #1","question":"Why might a leader choose to refrain from performing certain good deeds publicly?","id":"bukhari-19-8"},{"hadith-eng":"One night Allah's Messenger (ﷺ) offered the prayer in the Mosque and the people followed him. The next \nnight he also offered the prayer and too many people gathered. On the third and the fourth nights more \npeople gathered, but Allah's Messenger (ﷺ) did not come out to them. In the morning he said, \"I saw what \nyou were doing and nothing but the fear that it (i.e. the prayer) might be enjoined on you, stopped me \nfrom coming to you.\" And that happened in the month of Ramadan.","reference":"Sahih al-Bukhari 1129, Book 19, Hadith 9","grade":"","question #":"question #1","question":"What was the reason the Prophet refrained from leading the prayer on the third and fourth nights despite the gathering of people?","id":"bukhari-19-9"},{"hadith-eng":"The Prophet (ﷺ) used to stand (in the prayer) or pray till both his feet or legs swelled. He was asked why \n(he offered such an unbearable prayer) and he said, \"should I not be a thankful slave.\"","reference":"Sahih al-Bukhari 1130, Book 19, Hadith 10","grade":"","question #":"question #1","question":"What does the Prophet's dedication to prayer teach about gratitude in Islam?","id":"bukhari-19-10"},{"hadith-eng":"Allah's Messenger (ﷺ) told me, \"The most beloved prayer to Allah is that of David and the most beloved \nfasts to Allah are those of David. He used to sleep for half of the night and then pray for one third of \nthe night and again sleep for its sixth part and used to fast on alternate days.\"","reference":"Sahih al-Bukhari 1131, Book 19, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of the prayer and fasting practices of Prophet David in Islam?","id":"bukhari-19-11"},{"hadith-eng":"I asked `Aisha which deed was most loved by the Prophet. She said, \"A deed done continuously.\" I \nfurther asked, \"When did he used to get up (in the night for the prayer).\" She said, \"He used to get up \non hearing the crowing of a cock.\"","reference":"Sahih al-Bukhari 1132, Book 19, Hadith 12","grade":"","question #":"question #1","question":"What type of deeds are considered most beloved to the Prophet Muhammad (peace be upon him)?","id":"bukhari-19-12"},{"hadith-eng":"In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.","reference":"Sahih al-Bukhari 1133, Book 19, Hadith 14","grade":"","question #":"question #1","question":"What was the Prophet Muhammad's (p.b.u.h) routine during the last hours of the night?","id":"bukhari-19-13"},{"hadith-eng":"Anas bin Malik said, \"The Prophet (p.b.u.h) and Zaid bin Thabit took their Suhur together. When they \nfinished it, the Prophet (ﷺ) stood for the (Fajr) prayer and offered it.\" We asked Anas, \"What was the \ninterval between their finishing the Suhur and the starting of the morning prayer?\" Anas replied, \"It \nwas equal to the time taken by a person in reciting fifty verses of the Qur'an.\"","reference":"Sahih al-Bukhari 1134, Book 19, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of the timing between Suhur and the Fajr prayer in Islamic practice?","id":"bukhari-19-14"},{"hadith-eng":"`Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet (ﷺ) and he kept on standing till \nan ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and \nleave the Prophet (standing).\"","reference":"Sahih al-Bukhari 1135, Book 19, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of perseverance in prayer, especially during Tahajjud?","id":"bukhari-19-15"},{"hadith-eng":"Whenever the Prophet (ﷺ) got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.","reference":"Sahih al-Bukhari 1136, Book 19, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of using Siwak in Islamic practices, especially before prayers?","id":"bukhari-19-16"},{"hadith-eng":"A man said, \"O Allah's Messenger (ﷺ)! How is the prayer of the night?\" He said, \"Two rak`at followed by \ntwo rak`at and so on, and when you apprehend the approaching dawn, offer one rak`a as witr.\"","reference":"Sahih al-Bukhari 1137, Book 19, Hadith 18","grade":"","question #":"question #1","question":"How is the night prayer structured according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-19-17"},{"hadith-eng":"The prayer of the Prophet (ﷺ) used to be of thirteen rak`at, i.e. of the night prayer.","reference":"Sahih al-Bukhari 1138, Book 19, Hadith 19","grade":"","question #":"question #1","question":"How many rak'ahs did the Prophet Muhammad (ﷺ) perform during his night prayer?","id":"bukhari-19-18"},{"hadith-eng":"I asked Aisha about the night prayer of Allah's Messenger (ﷺ) and she said, \"It was seven, nine or eleven \nrak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"","reference":"Sahih al-Bukhari 1139, Book 19, Hadith 20","grade":"","question #":"question #1","question":"How many rak'ahs did the Prophet Muhammad (ﷺ) typically perform during his night prayer?","id":"bukhari-19-19"},{"hadith-eng":"The Prophet (p.b.u.h) used to offer thirteen rak`at of the night prayer and that included the witr and \ntwo rak`at (Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1140, Book 19, Hadith 21","grade":"","question #":"question #1","question":"How many rak`at did the Prophet (p.b.u.h) perform during the night prayer?","id":"bukhari-19-20"},{"hadith-eng":"Sometimes Allah's Messenger (ﷺ) would not fast (for so many days) that we thought that he would not fast \nthat month and he sometimes used to fast (for so many days) that we thought he would not leave \nfasting throughout that month and (as regards his prayer and sleep at night), if you wanted to see him \npraying at night, you could see him praying and if you wanted to see him sleeping, you could see him \nsleeping.","reference":"Sahih al-Bukhari 1141, Book 19, Hadith 22","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) balance fasting and not fasting during a month?","id":"bukhari-19-21"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Satan puts three knots at the back of the head of any of you if he is asleep. On \nevery knot he reads and exhales the following words, 'The night is long, so stay asleep.' When one \nwakes up and remembers Allah, one knot is undone; and when one performs ablution, the second knot \nis undone, and when one prays the third knot is undone and one gets up energetic with a good heart in \nthe morning; otherwise one gets up lazy and with a mischievous heart.\"","reference":"Sahih al-Bukhari 1142, Book 19, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of remembering Allah upon waking up in the morning?","id":"bukhari-19-22"},{"hadith-eng":"The Prophet (ﷺ) said in his narration of a dream that he saw, \"He whose head was being crushed with a \nstone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"","reference":"Sahih al-Bukhari 1143, Book 19, Hadith 24","grade":"","question #":"question #1","question":"What are the consequences of learning the Qur'an but not acting upon its teachings?","id":"bukhari-19-23"},{"hadith-eng":"A person was mentioned before the Prophet (p.b.u.h) and he was told that he had kept on sleeping till \nmorning and had not got up for the prayer. The Prophet (ﷺ) said, \"Satan urinated in his ears.\"","reference":"Sahih al-Bukhari 1144, Book 19, Hadith 25","grade":"","question #":"question #1","question":"What are the consequences of neglecting the Fajr prayer according to Islamic teachings?","id":"bukhari-19-24"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the \nnearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, \nso that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is \nthere anyone seeking My forgiveness, so that I may forgive him?\"","reference":"Sahih al-Bukhari 1145, Book 19, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of the last third of the night in Islamic worship and supplication?","id":"bukhari-19-25"},{"hadith-eng":"I asked `Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, \nand get up in its last part to pray, and then return to his bed. When the Mu'adh-dhin pronounced the \nAdhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform \nablution and then go out (for the prayer).\"","reference":"Sahih al-Bukhari 1146, Book 19, Hadith 27","grade":"","question #":"question #1","question":"What was the routine of the Prophet Muhammad (ﷺ) regarding night prayer and sleep?","id":"bukhari-19-26"},{"hadith-eng":"I asked `Aisha, \"How is the prayer of Allah's Messenger (ﷺ) during the month of Ramadan.\" She said, \n\"Allah's Messenger (ﷺ) never exceeded eleven rak`at in Ramadan or in other months; he used to offer four \nrak`at-- do not ask me about their beauty and length, then four rak`at, do not ask me about their beauty \nand length, and then three rak`at.\" Aisha further said, \"I said, 'O Allah's Messenger (ﷺ)! Do you sleep before \noffering the witr prayer?' He replied, 'O `Aisha! My eyes sleep but my heart remains awake'!\"","reference":"Sahih al-Bukhari 1147, Book 19, Hadith 28","grade":"","question #":"question #1","question":"How many rak`at did the Prophet Muhammad (ﷺ) typically pray during Ramadan and other months?","id":"bukhari-19-27"},{"hadith-eng":"I did not see the Prophet (ﷺ) reciting (the Qur'an) in the night prayer while sitting except when he became \nold; when he used to recite while sitting, and when thirty or forty verses remained from the Sura, he \nwould get up and recite them and then bow.","reference":"Sahih al-Bukhari 1148, Book 19, Hadith 29","grade":"","question #":"question #1","question":"How did the Prophet (ﷺ) adapt his practice of night prayer as he aged?","id":"bukhari-19-28"},{"hadith-eng":"At the time of the Fajr prayer the Prophet (ﷺ) asked Bilal, \"Tell me of the best deed you did after \nembracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do \nanything worth mentioning except that whenever I performed ablution during the day or night, I \nprayed after that ablution as much as was written for me.\"","reference":"Sahih al-Bukhari 1149, Book 19, Hadith 30","grade":"","question #":"question #1","question":"What significance does performing additional prayers after ablution hold in Islam?","id":"bukhari-19-29"},{"hadith-eng":"Narrated Anas bin MalikOnce the Prophet (p.b.u.h) entered the Mosque and saw a rope hanging \n     in between its two pillars. He said, \"What is this rope?\" The people \n     said, \"This rope is for Zainab who, when she feels tired, holds it (to\n     keep standing for the prayer.)\" The Prophet (ﷺ) said, \"Don't use it. \n     Remove the rope. You should pray as long as you feel active, and when \n     you get tired, sit down.\"","reference":"Sahih al-Bukhari 1150, Book 19, Hadith 31","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the physical limits of worship and prayer?","id":"bukhari-19-30"},{"hadith-eng":"A woman from the tribe of Bani Asad was sitting with me and Allah's \n     Apostle (p.b.u.h) came to my house and said, \"Who is this?\" I said, \n     \"(She is) So and so. She does not sleep at night because she is \n     engaged in prayer.\" The Prophet (ﷺ) said disapprovingly: Do (good) deeds \n     which is within your capacity as Allah never gets tired of giving \n     rewards till you get tired of doing good deeds.\"","reference":"Sahih al-Bukhari 1151, Book 19, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of balancing worship and personal capacity in Islam?","id":"bukhari-19-31"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then \nstopped the night prayer.\"","reference":"Sahih al-Bukhari 1152, Book 19, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of consistency in performing night prayers in Islam?","id":"bukhari-19-32"},{"hadith-eng":"Once Allah's Messenger (ﷺ) said to me, \"I have been informed that you offer Salat (prayer) all the night and observe Saum (fast) during the day.\" I said, \"(Yes) I do so.\" He said, \"If you do so, your eye sight will become weak and you will become weak. No doubt, your body has right on you, and your family has right on you, so observe Saum (for some days) and do not observe it (for some days), offer Salat (for sometime) and then sleep.\"","reference":"Sahih al-Bukhari 1153, Book 19, Hadith 34","grade":"","question #":"question #1","question":"What are the potential physical consequences of excessive worship without moderation?","id":"bukhari-19-33"},{"hadith-eng":"The Prophet (ﷺ) \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, \nwaLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha \nil-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped \nbut Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are \ndue for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none \nhas the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power \nExcept with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), \nhe will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"","reference":"Sahih al-Bukhari 1154, Book 19, Hadith 35","grade":"","question #":"question #1","question":"What are the benefits of reciting specific phrases of praise and glorification of Allah during the night?","id":"bukhari-19-34"},{"hadith-eng":"That once Allah's Messenger (ﷺ) (p.b.u.h) said, \"Your brother, i.e. `Abdullah bin Rawaha does not say \nobscene (referring to his verses): Amongst us is Allah's Messenger (ﷺ), who recites His Book when it dawns. \nHe showed us the guidance, after we were blind. We believe that whatever he says will come true. \nAnd he spends his nights in such a way as his sides do not touch his bed. While the pagans were \ndeeply asleep.\"","reference":"Sahih al-Bukhari 1155, Book 19, Hadith 36","grade":"","question #":"question #1","question":"What qualities are highlighted in the character of Abdullah bin Rawaha according to the narration?","id":"bukhari-19-35"},{"hadith-eng":"Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"","reference":"Sahih al-Bukhari 1156, 1157, 1158, Book 19, Hadith 37","grade":"","question #":"question #1","question":"What significance do dreams hold in Islamic tradition and how were they interpreted by the Prophet Muhammad (ﷺ)?","id":"bukhari-19-36"},{"hadith-eng":"Allah's Messenger (ﷺ) offered the `Isha' prayer (and then got up at the Tahajjud time) and offered eight rak`at \nand then offered two rak`at while sitting. He then offered two rak`at in between the Adhan and Iqama \n(of the Fajr prayer) and he never missed them.","reference":"Sahih al-Bukhari 1159, Book 19, Hadith 38","grade":"","question #":"question #1","question":"What is the significance of performing Tahajjud prayer in the life of a Muslim?","id":"bukhari-19-37"},{"hadith-eng":"The Prophet (ﷺ) used to lie down on his right side, after offering two rak`at (Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1160, Book 19, Hadith 39","grade":"","question #":"question #1","question":"What is the significance of lying on the right side after performing the Sunnah prayers of Fajr?","id":"bukhari-19-38"},{"hadith-eng":"After offering the Sunna of the Fajr prayer, the Prophet (ﷺ) used to talk to me, if I happen to be awake; \notherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).","reference":"Sahih al-Bukhari 1161, Book 19, Hadith 40","grade":"","question #":"question #1","question":"What was the Prophet's routine after performing the Sunna of the Fajr prayer?","id":"bukhari-19-39"},{"hadith-eng":"After offering the two rak`at (Sunna) the Prophet (p.b.u.h) used to talk to me, if I happen to be awake; \notherwise he would lie down.","reference":"Sahih al-Bukhari 1162, Book 19, Hadith 41","grade":"","question #":"question #1","question":"What was the Prophet's practice after offering the two rak'at of Sunnah prayer?","id":"bukhari-19-40"},{"hadith-eng":"The Prophet (ﷺ) was never more regular and particular in offering any Nawafil than the two rak`at \n(Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1163, Book 19, Hadith 42","grade":"","question #":"question #1","question":"What is the significance of performing the two rak'ahs of Sunnah before the Fajr prayer in Islam?","id":"bukhari-19-41"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer thirteen rak`at in the night prayer and on hearing the Adhan for the \nmorning prayer, he used to offer two light rak`at.","reference":"Sahih al-Bukhari 1164, Book 19, Hadith 43","grade":"","question #":"question #1","question":"How many rak'at did the Prophet Muhammad (ﷺ) perform during the night prayer?","id":"bukhari-19-42"},{"hadith-eng":"The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder \nwhether he recited Al-Fatiha (or not).","reference":"Sahih al-Bukhari 1165, Book 19, Hadith 44","grade":"","question #":"question #1","question":"What is the significance of performing two rak'ahs before the Fajr prayer in Islamic practice?","id":"bukhari-19-43"},{"hadith-eng":"The Prophet (p.b.u.h) used to teach us the way of doing Istikhara (Istikhara means to ask Allah to \nguide one to the right sort of action concerning any job or a deed), in all matters as he taught us the \nSuras of the Qur'an. He said, \"If anyone of you thinks of doing any job he should offer a two rak`at \nprayer other than the compulsory ones and say (after the prayer): -- 'Allahumma inni astakhiruka \nbi'ilmika, Wa astaqdiruka bi-qudratika, Wa as'alaka min fadlika Al-`azlm Fa-innaka taqdiru Wala \naqdiru, Wa ta'lamu Wala a'lamu, Wa anta 'allamu l-ghuyub. Allahumma, in kunta ta'lam anna hadha-lamra \nKhairun li fi dini wa ma'ashi wa'aqibati `Amri (or 'ajili `Amri wa'ajilihi) Faqdirhu wa yas-sirhu li \nthumma barik li Fihi, Wa in kunta ta'lamu anna hadha-lamra shar-run li fi dini wa ma'ashi wa'aqibati \n`Amri (or fi'ajili `Amri wa ajilihi) Fasrifhu anni was-rifni anhu. Waqdir li al-khaira haithu kana \nThumma ardini bihi.' (O Allah! I ask guidance from Your knowledge, And Power from Your Might \nand I ask for Your great blessings. You are capable and I am not. You know and I do not and You \nknow the unseen. O Allah! If You know that this job is good for my religion and my subsistence and \nin my Hereafter--(or said: If it is better for my present and later needs)--Then You ordain it for me and \nmake it easy for me to get, And then bless me in it, and if You know that this job is harmful to me In \nmy religion and subsistence and in the Hereafter--(or said: If it is worse for my present and later \nneeds)--Then keep it away from me and let me be away from it. And ordain for me whatever is good \nfor me, And make me satisfied with it). The Prophet (ﷺ) added that then the person should name \n(mention) his need.","reference":"Sahih al-Bukhari 1166, Book 19, Hadith 45","grade":"","question #":"question #1","question":"What is the significance of performing Istikhara prayer in decision-making according to Islamic teachings?","id":"bukhari-19-44"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you enters a Mosque, he should not sit until he has offered a tworak` \nat prayer.\"","reference":"Sahih al-Bukhari 1167, Book 19, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of performing a prayer upon entering a mosque?","id":"bukhari-19-45"},{"hadith-eng":"Allah's Messenger (ﷺ) led us and offered a two rak`at prayer and then went away.","reference":"Sahih al-Bukhari 1168, Book 19, Hadith 47","grade":"","question #":"question #1","question":"What is the significance of performing a two rak'at prayer in Islamic practice?","id":"bukhari-19-46"},{"hadith-eng":"I offered with Allah's Messenger (ﷺ) a two rak`at prayer before the Zuhr prayer and two rak`at after the Zuhr \nprayer, two rak`at after Jumua, Maghrib and `Isha' prayers.","reference":"Sahih al-Bukhari 1169, Book 19, Hadith 48","grade":"","question #":"question #1","question":"What are the recommended Sunnah prayers associated with the Zuhr prayer?","id":"bukhari-19-47"},{"hadith-eng":"While delivering a sermon, Allah's Messenger (ﷺ) said, \"If anyone of you comes while the Imam is \ndelivering the sermon or has come out for it, he should offer a two rak`at prayer.\"","reference":"Sahih al-Bukhari 1170, Book 19, Hadith 49","grade":"","question #":"question #1","question":"What should a person do upon arriving at the mosque while the Imam is delivering the sermon?","id":"bukhari-19-48"},{"hadith-eng":"Somebody came to the house of Ibn `Umar and told him that Allah's Messenger (ﷺ)s had entered the Ka`ba. \nIbn `Umar said, \"I went in front of the Ka`ba and found that Allah's Messenger (ﷺ) had come out of the \nKa`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's \nApostle (p.b.u.h) prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he \npray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two \nrak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira said, \"The Prophet (p.b.u.h) \nadvised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" \nItban (bin Malik) said, \"Allah's Messenger (ﷺ) \n(p.b.u.h) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (p.b.u.h) and \noffered two rak`at.\"","reference":"Sahih al-Bukhari 1171, Book 19, Hadith 50","grade":"","question #":"question #1","question":"What is the significance of praying inside the Ka'ba according to Islamic tradition?","id":"bukhari-19-49"},{"hadith-eng":"I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"","reference":"Sahih al-Bukhari 1172, 1173, Book 19, Hadith 51","grade":"","question #":"question #1","question":"What are the Sunnah prayers associated with the Zuhr, Maghrib, Isha, and Jumua prayers?","id":"bukhari-19-50"},{"hadith-eng":"I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"","reference":"Sahih al-Bukhari 1172, 1173, Book 19, Hadith 51","grade":"","question #":"question #1","question":"What are the Sunnah prayers associated with the Zuhr, Maghrib, Isha, and Jumu'ah prayers?","id":"bukhari-19-51"},{"hadith-eng":"I heard Abu Ash-sha'tha' Jabir saying, \"I heard Ibn `Abbas saying, 'I offered with Allah's Messenger (ﷺ) eight \nrak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) \ntogether.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; \nthe `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 \nVol. 1).","reference":"Sahih al-Bukhari 1174, Book 19, Hadith 52","grade":"","question #":"question #1","question":"What is the significance of combining prayers in Islam, and under what circumstances is it permissible?","id":"bukhari-19-52"},{"hadith-eng":"I asked Ibn `Umar \"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did \n`Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr use to \npray it?\" He replied in the negative. I again asked, \"Did the Prophet (ﷺ) use to pray it?\" Ibn `Umar replied, \n\"I don't think he did.\"","reference":"Sahih al-Bukhari 1175, Book 19, Hadith 53","grade":"","question #":"question #1","question":"What is the significance of the Duha prayer in Islamic tradition?","id":"bukhari-19-53"},{"hadith-eng":"Only Um Hani narrated to me that she had seen the Prophet (ﷺ) offering the Duha prayer. She said, \"On \nthe day of the conquest of Mecca, the Prophet (ﷺ) entered my house, took a bath and offered eight rak`at \n(of Duha prayers. I had never seen the Prophet (ﷺ) offering such a light prayer but he performed bowing \nand prostrations perfectly .","reference":"Sahih al-Bukhari 1176, Book 19, Hadith 54","grade":"","question #":"question #1","question":"What is the significance of the Duha prayer in Islam?","id":"bukhari-19-54"},{"hadith-eng":"I never saw the Prophet (ﷺ) offering the Duha prayer but I always offer it.","reference":"Sahih al-Bukhari 1177, Book 19, Hadith 55","grade":"","question #":"question #1","question":"What is the significance of the Duha prayer in Islamic practice?","id":"bukhari-19-55"},{"hadith-eng":"My friend (the Prophet) advised me to do three things and I shall not leave them till I die, these are: \nTo fast three days every month, to offer the Duha prayer, and to offer witr before sleeping.","reference":"Sahih al-Bukhari 1178, Book 19, Hadith 56","grade":"","question #":"question #1","question":"What are the recommended practices for a Muslim to maintain regularly according to the teachings of the Prophet?","id":"bukhari-19-56"},{"hadith-eng":"I heard Anas bin Malik al-Ansari saying, \"An Ansari man, who was very \n     fat, said to the Prophet, 'I am unable to present myself for the \n     prayer with you.' He prepared a meal for the Prophet (ﷺ) and invited him \n     to his house. He washed one side of a mat with water and the Prophet (ﷺ) \n     offered two Rakat on it.\" So and so, the son of so and so, the son of \n     Al-Jarud asked Anas, \"Did the Prophet (ﷺ) use to offer the Duha prayer?\" \n     Anas replied, \"I never saw him praying (the Duha prayer) except on \n     that day.\"","reference":"Sahih al-Bukhari 1179, Book 19, Hadith 57","grade":"","question #":"question #1","question":"What can be inferred about the Prophet's (ﷺ) practice of the Duha prayer from this narration?","id":"bukhari-19-57"},{"hadith-eng":"I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.Hafsa told me that the Prophet (ﷺ) used to offer two Rakat after the call maker had made the Adhan and the day had dawned.","reference":"Sahih al-Bukhari 1180, 1181, Book 19, Hadith 58","grade":"","question #":"question #1","question":"What are the recommended Nawafil prayers associated with the daily obligatory prayers?","id":"bukhari-19-58"},{"hadith-eng":"The Prophet (ﷺ) never missed four rak`at before the Zuhr prayer and two rak`at before the Fajr prayer.","reference":"Sahih al-Bukhari 1182, Book 19, Hadith 59","grade":"","question #":"question #1","question":"What is the significance of performing additional rak`at before the obligatory prayers in Islam?","id":"bukhari-19-59"},{"hadith-eng":"The Prophet (ﷺ) said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third \ntime, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to \ntake it as a tradition.","reference":"Sahih al-Bukhari 1183, Book 19, Hadith 60","grade":"","question #":"question #1","question":"What is the significance of offering voluntary prayers before the Maghrib prayer?","id":"bukhari-19-60"},{"hadith-eng":"I went to `Uqba bin 'Amir Al-Juhani and said, \"Is it not surprising that Abi Tamim offers two rak`at \nbefore the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Messenger (ﷺ).\" I asked \nhim, \"What prevents you from offering it now?\" He replied, \"Business.\"","reference":"Sahih al-Bukhari 1184, Book 19, Hadith 61","grade":"","question #":"question #1","question":"What is the significance of performing two rak'ahs before the Maghrib prayer in Islamic tradition?","id":"bukhari-19-61"},{"hadith-eng":"that he remembered Allah's Messenger (ﷺ) and he also remembered a mouthful of water which he had \nthrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard \n`Itban bin Malik, who was present with Allah's Messenger (ﷺ) in the battle of Badr saying, \"I used to lead my \npeople at Bani Salim in the prayer and there was a valley between me and those people. Whenever it \nrained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Messenger (ﷺ) and \nsaid, 'I have weak eyesight and the valley between me and my people flows during the rainy season \nand it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so \nthat I could take that place as a praying place.' Allah's Messenger (ﷺ) said, 'I will do so.' So Allah's Messenger (ﷺ) \nand Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Messenger (ﷺ) \nasked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you \nwant us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So \nAllah's Messenger (ﷺ) stood up for the prayer and started the prayer with Takbir and we aligned in rows \nbehind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim \nwith him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a \nspecial type of dish prepared from barley flour and meat soup)-- \nWhen the neighbors got the news that Allah's Messenger (ﷺ) was in my house, they poured it till there were a \ngreat number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' \nOne of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's \nApostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but \nAllah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we \nnever saw him but helping and talking with the hypocrites.' Allah's Messenger (ﷺ) replied, 'No doubt, \nwhoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of \nAllah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some \npeople, one of whom was Abu Aiyub, the companion of Allah's Messenger (ﷺ) in the battle in which he (Abu \nAiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the \nnarration and said, 'I doubt that Allah's Messenger (ﷺ) ever said what you have said.' I felt that too much, and \nI vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin \nMalik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for \nHajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin \nMalik, who was by then an old blind man, was leading his people in the prayer. When he finished the \nprayer, I greeted him and introduced myself to him and then asked him about that narration. He told \nthat narration again in the same manner as he had narrated it the first time.\"","reference":"Sahih al-Bukhari 1185, 1186, Book 19, Hadith 62","grade":"","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) visiting a companion's house to perform prayer?","id":"bukhari-19-62"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Offer some of your prayers in your houses and do not make them graves.\"","reference":"Sahih al-Bukhari 1187, Book 19, Hadith 63","grade":"","question #":"question #1","question":"Why is it important to offer some prayers at home according to Islamic teachings?","id":"bukhari-19-63"},{"hadith-eng":"When the Prophet (ﷺ) got up at night to offer the Tahajjud prayer, he used to say: Allahumma lakal-hamd. \nAnta qaiyyimus-samawati wal-ard wa man fihinna. Walakal-hamd, Laka mulkus-samawati wal-ard wa \nman fihinna. Walakal-hamd, anta nurus-samawati wal-ard. Wa lakal-hamd, anta-l-haq wa wa'duka-lhaq, \nwa liqa'uka Haq, wa qauluka Haq, wal-jannatu Han wan-naru Haq wannabiyuna Haq. Wa \nMuhammadun, sallal-lahu'alaihi wasallam, Haq, was-sa'atu Haq. Allahumma aslamtu Laka wabika \namantu, wa 'Alaika tawakkaltu, wa ilaika anabtu wa bika khasamtu, wa ilaika hakamtu faghfir li ma \nqaddamtu wama akh-khartu wama as-rartu wama'a lantu, anta-l-muqaddim wa anta-l-mu akh-khir, la \nilaha illa anta (or la ilaha ghairuka). (O Allah! All the praises are for you, You are the Holder of the \nHeavens and the Earth, And whatever is in them. All the praises are for You; You have the possession \nof the Heavens and the Earth And whatever is in them. All the praises are for You; You are the Light \nof the Heavens and the Earth And all the praises are for You; You are the King of the Heavens and the \nEarth; And all the praises are for You; You are the Truth and Your Promise is the truth, And to meet \nYou is true, Your Word is the truth And Paradise is true And Hell is true And all the Prophets (Peace \nbe upon them) are true; And Muhammad is true, And the Day of Resurrection is true. O Allah ! I \nsurrender (my will) to You; I believe in You and depend on You. And repent to You, And with Your \nhelp I argue (with my opponents, the non-believers) And I take You as a judge (to judge between us). \nPlease forgive me my previous And future sins; And whatever I concealed or revealed And You are \nthe One who make (some people) forward And (some) backward. There is none to be worshipped but \nyou . Sufyan said that `Abdul Karim Abu Umaiya added to the above, 'Wala haula Wala quwata illa \nbillah' (There is neither might nor power except with Allah).","reference":"Sahih al-Bukhari 1120, Book 19, Hadith 1","grade":"","question #":"question #2","question":"How does the supplication emphasize the truthfulness of Islamic beliefs and events?","id":"bukhari-19-64"},{"hadith-eng":"In the lifetime of the Prophet (ﷺ) whosoever saw a dream would narrate it to Allah's Messenger (ﷺ). I had a wish \nof seeing a dream to narrate it to Allah's Messenger (ﷺ) (p.b.u.h) I was a grown up boy and used to sleep in \nthe Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and \ntook me to the Fire which was built all round like a built well and had two poles in it and the people in \nit were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another \nangel who told me not to be afraid. I narrated the dream to Hafsa who told it to Allah's Messenger (ﷺ). The \nProphet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's \nfather) used to sleep but a little at night.","reference":"Sahih al-Bukhari 1121, 1122, Book 19, Hadith 2","grade":"","question #":"question #2","question":"What is the importance of Tahajjud prayer in Islam and how can it impact a person's spiritual life?","id":"bukhari-19-65"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer eleven rak`at and that was his prayer. He used to prolong the prostration \nto such an extent that one could recite fifty verses (of the Qur'an) before he would lift his head. He \nused to pray two rak`at (Sunna) before the Fajr prayer and then used to lie down on his right side till \nthe call-maker came and informed him about the prayer.","reference":"Sahih al-Bukhari 1123, Book 19, Hadith 3","grade":"","question #":"question #2","question":"What was the significance of the Prophet's prolonged prostration during his prayer?","id":"bukhari-19-66"},{"hadith-eng":"The Prophet (ﷺ) became sick and did not get up (for Tahajjud prayer) for a night or two.","reference":"Sahih al-Bukhari 1124, Book 19, Hadith 4","grade":"","question #":"question #2","question":"How does illness affect the performance of voluntary acts of worship in Islam?","id":"bukhari-19-67"},{"hadith-eng":"Gabriel did not come to the Prophet (for some time) and so one of the Quraish women said, \"His \nSatan has deserted him.\" So came the Divine Revelation: \"By the forenoon And by the night When it \nis still! Your Lord (O Muhammad) has neither Forsaken you Nor hated you.\" (93.1-3)","reference":"Sahih al-Bukhari 1125, Book 19, Hadith 5","grade":"","question #":"question #2","question":"How does the Quran address the concerns of the Prophet Muhammad regarding divine revelation?","id":"bukhari-19-68"},{"hadith-eng":"One night the Prophet (ﷺ) got up and said, \"Subhan Allah! How many afflictions Allah has revealed \ntonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady \noccupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in \nthe Hereafter.\"","reference":"Sahih al-Bukhari 1126, Book 19, Hadith 6","grade":"","question #":"question #2","question":"How does the concept of worldly attire relate to one's state in the Hereafter in Islamic teachings?","id":"bukhari-19-69"},{"hadith-eng":"One night Allah's Messenger (ﷺ) came to me and Fatima, the daughter of the Prophet (ﷺ) and asked, \"Won't you \npray (at night)?\" I said, \"O Allah's Messenger (ﷺ)! Our souls are in the hands of Allah and if He wants us to \nget up He will make us get up.\" When I said that, he left us without saying anything and I heard that \nhe was hitting his thigh and saying, \"But man is more quarrelsome than anything.\" (18.54)","reference":"Sahih al-Bukhari 1127, Book 19, Hadith 7","grade":"","question #":"question #2","question":"How does human nature relate to the concept of free will and responsibility in Islamic teachings?","id":"bukhari-19-70"},{"hadith-eng":"Allah's Messenger (ﷺ) used to give up a good deed, although he loved to do it, for fear that people might act \non it and it might be made compulsory for them. The Prophet (ﷺ) never prayed the Duha prayer, but I \noffer it.","reference":"Sahih al-Bukhari 1128, Book 19, Hadith 8","grade":"","question #":"question #2","question":"What considerations might influence the Prophet's decision to avoid making certain practices obligatory for his followers?","id":"bukhari-19-71"},{"hadith-eng":"One night Allah's Messenger (ﷺ) offered the prayer in the Mosque and the people followed him. The next \nnight he also offered the prayer and too many people gathered. On the third and the fourth nights more \npeople gathered, but Allah's Messenger (ﷺ) did not come out to them. In the morning he said, \"I saw what \nyou were doing and nothing but the fear that it (i.e. the prayer) might be enjoined on you, stopped me \nfrom coming to you.\" And that happened in the month of Ramadan.","reference":"Sahih al-Bukhari 1129, Book 19, Hadith 9","grade":"","question #":"question #2","question":"How did the Prophet's actions during Ramadan reflect his concern for the community regarding obligatory practices?","id":"bukhari-19-72"},{"hadith-eng":"The Prophet (ﷺ) used to stand (in the prayer) or pray till both his feet or legs swelled. He was asked why \n(he offered such an unbearable prayer) and he said, \"should I not be a thankful slave.\"","reference":"Sahih al-Bukhari 1130, Book 19, Hadith 10","grade":"","question #":"question #2","question":"How can physical hardship in worship be seen as an expression of thankfulness to Allah?","id":"bukhari-19-73"},{"hadith-eng":"Allah's Messenger (ﷺ) told me, \"The most beloved prayer to Allah is that of David and the most beloved \nfasts to Allah are those of David. He used to sleep for half of the night and then pray for one third of \nthe night and again sleep for its sixth part and used to fast on alternate days.\"","reference":"Sahih al-Bukhari 1131, Book 19, Hadith 11","grade":"","question #":"question #2","question":"How does the practice of alternating fasting days reflect devotion in Islamic teachings?","id":"bukhari-19-74"},{"hadith-eng":"I asked `Aisha which deed was most loved by the Prophet. She said, \"A deed done continuously.\" I \nfurther asked, \"When did he used to get up (in the night for the prayer).\" She said, \"He used to get up \non hearing the crowing of a cock.\"","reference":"Sahih al-Bukhari 1132, Book 19, Hadith 12","grade":"","question #":"question #2","question":"What was the Prophet Muhammad's (peace be upon him) routine for night prayers?","id":"bukhari-19-75"},{"hadith-eng":"In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.","reference":"Sahih al-Bukhari 1133, Book 19, Hadith 14","grade":"","question #":"question #2","question":"How did Aisha describe the Prophet's (p.b.u.h) habits in her home during the night?","id":"bukhari-19-76"},{"hadith-eng":"Anas bin Malik said, \"The Prophet (p.b.u.h) and Zaid bin Thabit took their Suhur together. When they \nfinished it, the Prophet (ﷺ) stood for the (Fajr) prayer and offered it.\" We asked Anas, \"What was the \ninterval between their finishing the Suhur and the starting of the morning prayer?\" Anas replied, \"It \nwas equal to the time taken by a person in reciting fifty verses of the Qur'an.\"","reference":"Sahih al-Bukhari 1134, Book 19, Hadith 15","grade":"","question #":"question #2","question":"How does the recitation of fifty verses of the Qur'an relate to the time management of Suhur and Fajr prayer?","id":"bukhari-19-77"},{"hadith-eng":"`Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet (ﷺ) and he kept on standing till \nan ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and \nleave the Prophet (standing).\"","reference":"Sahih al-Bukhari 1135, Book 19, Hadith 16","grade":"","question #":"question #2","question":"How can one overcome distractions or negative thoughts during prayer?","id":"bukhari-19-78"},{"hadith-eng":"Whenever the Prophet (ﷺ) got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.","reference":"Sahih al-Bukhari 1136, Book 19, Hadith 17","grade":"","question #":"question #2","question":"How does personal hygiene relate to spiritual practices in Islam?","id":"bukhari-19-79"},{"hadith-eng":"A man said, \"O Allah's Messenger (ﷺ)! How is the prayer of the night?\" He said, \"Two rak`at followed by \ntwo rak`at and so on, and when you apprehend the approaching dawn, offer one rak`a as witr.\"","reference":"Sahih al-Bukhari 1137, Book 19, Hadith 18","grade":"","question #":"question #2","question":"What is the significance of the witr prayer in the context of night prayers?","id":"bukhari-19-80"},{"hadith-eng":"The prayer of the Prophet (ﷺ) used to be of thirteen rak`at, i.e. of the night prayer.","reference":"Sahih al-Bukhari 1138, Book 19, Hadith 19","grade":"","question #":"question #2","question":"What can be learned about the Prophet's (ﷺ) practice of night prayer from this narration?","id":"bukhari-19-81"},{"hadith-eng":"I asked Aisha about the night prayer of Allah's Messenger (ﷺ) and she said, \"It was seven, nine or eleven \nrak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"","reference":"Sahih al-Bukhari 1139, Book 19, Hadith 20","grade":"","question #":"question #2","question":"What is the significance of the two rak'ahs of the Fajr prayer in relation to the night prayer?","id":"bukhari-19-82"},{"hadith-eng":"The Prophet (p.b.u.h) used to offer thirteen rak`at of the night prayer and that included the witr and \ntwo rak`at (Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1140, Book 19, Hadith 21","grade":"","question #":"question #2","question":"What is included in the Prophet's (p.b.u.h) night prayer routine according to this narration?","id":"bukhari-19-83"},{"hadith-eng":"Sometimes Allah's Messenger (ﷺ) would not fast (for so many days) that we thought that he would not fast \nthat month and he sometimes used to fast (for so many days) that we thought he would not leave \nfasting throughout that month and (as regards his prayer and sleep at night), if you wanted to see him \npraying at night, you could see him praying and if you wanted to see him sleeping, you could see him \nsleeping.","reference":"Sahih al-Bukhari 1141, Book 19, Hadith 22","grade":"","question #":"question #2","question":"What can be learned from the Prophet's (ﷺ) approach to prayer and sleep at night?","id":"bukhari-19-84"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Satan puts three knots at the back of the head of any of you if he is asleep. On \nevery knot he reads and exhales the following words, 'The night is long, so stay asleep.' When one \nwakes up and remembers Allah, one knot is undone; and when one performs ablution, the second knot \nis undone, and when one prays the third knot is undone and one gets up energetic with a good heart in \nthe morning; otherwise one gets up lazy and with a mischievous heart.\"","reference":"Sahih al-Bukhari 1142, Book 19, Hadith 23","grade":"","question #":"question #2","question":"How does performing ablution affect one's spiritual state according to Islamic teachings?","id":"bukhari-19-85"},{"hadith-eng":"The Prophet (ﷺ) said in his narration of a dream that he saw, \"He whose head was being crushed with a \nstone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"","reference":"Sahih al-Bukhari 1143, Book 19, Hadith 24","grade":"","question #":"question #2","question":"What is the significance of performing compulsory prayers in Islam?","id":"bukhari-19-86"},{"hadith-eng":"A person was mentioned before the Prophet (p.b.u.h) and he was told that he had kept on sleeping till \nmorning and had not got up for the prayer. The Prophet (ﷺ) said, \"Satan urinated in his ears.\"","reference":"Sahih al-Bukhari 1144, Book 19, Hadith 25","grade":"","question #":"question #2","question":"How does Satan influence a person's actions in relation to prayer?","id":"bukhari-19-87"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the \nnearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, \nso that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is \nthere anyone seeking My forgiveness, so that I may forgive him?\"","reference":"Sahih al-Bukhari 1145, Book 19, Hadith 26","grade":"","question #":"question #2","question":"How does the concept of Allah descending to the nearest Heaven relate to the practice of seeking forgiveness?","id":"bukhari-19-88"},{"hadith-eng":"I asked `Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, \nand get up in its last part to pray, and then return to his bed. When the Mu'adh-dhin pronounced the \nAdhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform \nablution and then go out (for the prayer).\"","reference":"Sahih al-Bukhari 1146, Book 19, Hadith 27","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prepare for the Fajr prayer after waking up?","id":"bukhari-19-89"},{"hadith-eng":"I asked `Aisha, \"How is the prayer of Allah's Messenger (ﷺ) during the month of Ramadan.\" She said, \n\"Allah's Messenger (ﷺ) never exceeded eleven rak`at in Ramadan or in other months; he used to offer four \nrak`at-- do not ask me about their beauty and length, then four rak`at, do not ask me about their beauty \nand length, and then three rak`at.\" Aisha further said, \"I said, 'O Allah's Messenger (ﷺ)! Do you sleep before \noffering the witr prayer?' He replied, 'O `Aisha! My eyes sleep but my heart remains awake'!\"","reference":"Sahih al-Bukhari 1147, Book 19, Hadith 28","grade":"","question #":"question #2","question":"What is the significance of the Prophet's statement about his eyes sleeping but his heart remaining awake?","id":"bukhari-19-90"},{"hadith-eng":"I did not see the Prophet (ﷺ) reciting (the Qur'an) in the night prayer while sitting except when he became \nold; when he used to recite while sitting, and when thirty or forty verses remained from the Sura, he \nwould get up and recite them and then bow.","reference":"Sahih al-Bukhari 1148, Book 19, Hadith 29","grade":"","question #":"question #2","question":"What is the significance of standing up to recite the remaining verses during night prayer?","id":"bukhari-19-91"},{"hadith-eng":"At the time of the Fajr prayer the Prophet (ﷺ) asked Bilal, \"Tell me of the best deed you did after \nembracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do \nanything worth mentioning except that whenever I performed ablution during the day or night, I \nprayed after that ablution as much as was written for me.\"","reference":"Sahih al-Bukhari 1149, Book 19, Hadith 30","grade":"","question #":"question #2","question":"How can consistent acts of worship impact one's spiritual status in the afterlife?","id":"bukhari-19-92"},{"hadith-eng":"Narrated Anas bin MalikOnce the Prophet (p.b.u.h) entered the Mosque and saw a rope hanging \n     in between its two pillars. He said, \"What is this rope?\" The people \n     said, \"This rope is for Zainab who, when she feels tired, holds it (to\n     keep standing for the prayer.)\" The Prophet (ﷺ) said, \"Don't use it. \n     Remove the rope. You should pray as long as you feel active, and when \n     you get tired, sit down.\"","reference":"Sahih al-Bukhari 1150, Book 19, Hadith 31","grade":"","question #":"question #2","question":"How should one balance between zeal in worship and physical well-being according to Islamic teachings?","id":"bukhari-19-93"},{"hadith-eng":"A woman from the tribe of Bani Asad was sitting with me and Allah's \n     Apostle (p.b.u.h) came to my house and said, \"Who is this?\" I said, \n     \"(She is) So and so. She does not sleep at night because she is \n     engaged in prayer.\" The Prophet (ﷺ) said disapprovingly: Do (good) deeds \n     which is within your capacity as Allah never gets tired of giving \n     rewards till you get tired of doing good deeds.\"","reference":"Sahih al-Bukhari 1151, Book 19, Hadith 32","grade":"","question #":"question #2","question":"How does Islam view the concept of moderation in performing good deeds?","id":"bukhari-19-94"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then \nstopped the night prayer.\"","reference":"Sahih al-Bukhari 1152, Book 19, Hadith 33","grade":"","question #":"question #2","question":"How does regularity in night prayers reflect on a person's spiritual discipline?","id":"bukhari-19-95"},{"hadith-eng":"Once Allah's Messenger (ﷺ) said to me, \"I have been informed that you offer Salat (prayer) all the night and observe Saum (fast) during the day.\" I said, \"(Yes) I do so.\" He said, \"If you do so, your eye sight will become weak and you will become weak. No doubt, your body has right on you, and your family has right on you, so observe Saum (for some days) and do not observe it (for some days), offer Salat (for sometime) and then sleep.\"","reference":"Sahih al-Bukhari 1153, Book 19, Hadith 34","grade":"","question #":"question #2","question":"How does Islam emphasize the balance between religious duties and personal well-being?","id":"bukhari-19-96"},{"hadith-eng":"The Prophet (ﷺ) \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, \nwaLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha \nil-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped \nbut Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are \ndue for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none \nhas the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power \nExcept with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), \nhe will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"","reference":"Sahih al-Bukhari 1154, Book 19, Hadith 35","grade":"","question #":"question #2","question":"How does invoking Allah for forgiveness at night impact the acceptance of one's prayers?","id":"bukhari-19-97"},{"hadith-eng":"That once Allah's Messenger (ﷺ) (p.b.u.h) said, \"Your brother, i.e. `Abdullah bin Rawaha does not say \nobscene (referring to his verses): Amongst us is Allah's Messenger (ﷺ), who recites His Book when it dawns. \nHe showed us the guidance, after we were blind. We believe that whatever he says will come true. \nAnd he spends his nights in such a way as his sides do not touch his bed. While the pagans were \ndeeply asleep.\"","reference":"Sahih al-Bukhari 1155, Book 19, Hadith 36","grade":"","question #":"question #2","question":"How does the behavior of the Prophet Muhammad (ﷺ) serve as a guide for the believers in this narration?","id":"bukhari-19-98"},{"hadith-eng":"Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"","reference":"Sahih al-Bukhari 1156, 1157, 1158, Book 19, Hadith 37","grade":"","question #":"question #2","question":"What is the importance of the night prayer (Tahajjud) in Islam and how did it influence the actions of the companions of the Prophet?","id":"bukhari-19-99"},{"hadith-eng":"Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"","reference":"Sahih al-Bukhari 1156, 1157, 1158, Book 19, Hadith 37","grade":"","question #":"question #2","question":"What is the importance of the night prayer (Tahajjud) in Islam and how did it influence the actions of the companions of the Prophet (ﷺ)?","id":"bukhari-19-100"},{"hadith-eng":"Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"","reference":"Sahih al-Bukhari 1156, 1157, 1158, Book 19, Hadith 37","grade":"","question #":"question #2","question":"What is the importance of the night prayer (Tahajjud) in Islam and how did it influence the companions of the Prophet (ﷺ)?","id":"bukhari-19-101"},{"hadith-eng":"Allah's Messenger (ﷺ) offered the `Isha' prayer (and then got up at the Tahajjud time) and offered eight rak`at \nand then offered two rak`at while sitting. He then offered two rak`at in between the Adhan and Iqama \n(of the Fajr prayer) and he never missed them.","reference":"Sahih al-Bukhari 1159, Book 19, Hadith 38","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate additional prayers into his nightly routine?","id":"bukhari-19-102"},{"hadith-eng":"The Prophet (ﷺ) used to lie down on his right side, after offering two rak`at (Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1160, Book 19, Hadith 39","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) spend his time after completing the Sunnah prayers of Fajr?","id":"bukhari-19-103"},{"hadith-eng":"After offering the Sunna of the Fajr prayer, the Prophet (ﷺ) used to talk to me, if I happen to be awake; \notherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).","reference":"Sahih al-Bukhari 1161, Book 19, Hadith 40","grade":"","question #":"question #2","question":"How did the Prophet interact with his family after the Sunna of the Fajr prayer?","id":"bukhari-19-104"},{"hadith-eng":"After offering the two rak`at (Sunna) the Prophet (p.b.u.h) used to talk to me, if I happen to be awake; \notherwise he would lie down.","reference":"Sahih al-Bukhari 1162, Book 19, Hadith 41","grade":"","question #":"question #2","question":"How did the Prophet interact with his family after performing the Sunnah prayers?","id":"bukhari-19-105"},{"hadith-eng":"The Prophet (ﷺ) was never more regular and particular in offering any Nawafil than the two rak`at \n(Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1163, Book 19, Hadith 42","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the importance of Nawafil prayers, particularly before Fajr?","id":"bukhari-19-106"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer thirteen rak`at in the night prayer and on hearing the Adhan for the \nmorning prayer, he used to offer two light rak`at.","reference":"Sahih al-Bukhari 1164, Book 19, Hadith 43","grade":"","question #":"question #2","question":"What is the significance of offering two light rak'at after hearing the Adhan for the morning prayer?","id":"bukhari-19-107"},{"hadith-eng":"The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder \nwhether he recited Al-Fatiha (or not).","reference":"Sahih al-Bukhari 1165, Book 19, Hadith 44","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (p.b.u.h) perform the two rak'ahs before Fajr in terms of recitation?","id":"bukhari-19-108"},{"hadith-eng":"The Prophet (p.b.u.h) used to teach us the way of doing Istikhara (Istikhara means to ask Allah to \nguide one to the right sort of action concerning any job or a deed), in all matters as he taught us the \nSuras of the Qur'an. He said, \"If anyone of you thinks of doing any job he should offer a two rak`at \nprayer other than the compulsory ones and say (after the prayer): -- 'Allahumma inni astakhiruka \nbi'ilmika, Wa astaqdiruka bi-qudratika, Wa as'alaka min fadlika Al-`azlm Fa-innaka taqdiru Wala \naqdiru, Wa ta'lamu Wala a'lamu, Wa anta 'allamu l-ghuyub. Allahumma, in kunta ta'lam anna hadha-lamra \nKhairun li fi dini wa ma'ashi wa'aqibati `Amri (or 'ajili `Amri wa'ajilihi) Faqdirhu wa yas-sirhu li \nthumma barik li Fihi, Wa in kunta ta'lamu anna hadha-lamra shar-run li fi dini wa ma'ashi wa'aqibati \n`Amri (or fi'ajili `Amri wa ajilihi) Fasrifhu anni was-rifni anhu. Waqdir li al-khaira haithu kana \nThumma ardini bihi.' (O Allah! I ask guidance from Your knowledge, And Power from Your Might \nand I ask for Your great blessings. You are capable and I am not. You know and I do not and You \nknow the unseen. O Allah! If You know that this job is good for my religion and my subsistence and \nin my Hereafter--(or said: If it is better for my present and later needs)--Then You ordain it for me and \nmake it easy for me to get, And then bless me in it, and if You know that this job is harmful to me In \nmy religion and subsistence and in the Hereafter--(or said: If it is worse for my present and later \nneeds)--Then keep it away from me and let me be away from it. And ordain for me whatever is good \nfor me, And make me satisfied with it). The Prophet (ﷺ) added that then the person should name \n(mention) his need.","reference":"Sahih al-Bukhari 1166, Book 19, Hadith 45","grade":"","question #":"question #2","question":"How does one perform the Istikhara prayer and what supplication should be recited?","id":"bukhari-19-109"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you enters a Mosque, he should not sit until he has offered a tworak` \nat prayer.\"","reference":"Sahih al-Bukhari 1167, Book 19, Hadith 46","grade":"","question #":"question #2","question":"Why is it recommended to offer two rak'ahs before sitting in a mosque?","id":"bukhari-19-110"},{"hadith-eng":"Allah's Messenger (ﷺ) led us and offered a two rak`at prayer and then went away.","reference":"Sahih al-Bukhari 1168, Book 19, Hadith 47","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) lead the prayer according to the companions?","id":"bukhari-19-111"},{"hadith-eng":"I offered with Allah's Messenger (ﷺ) a two rak`at prayer before the Zuhr prayer and two rak`at after the Zuhr \nprayer, two rak`at after Jumua, Maghrib and `Isha' prayers.","reference":"Sahih al-Bukhari 1169, Book 19, Hadith 48","grade":"","question #":"question #2","question":"How many rak'ahs are performed after the Jumu'ah prayer according to this narration?","id":"bukhari-19-112"},{"hadith-eng":"While delivering a sermon, Allah's Messenger (ﷺ) said, \"If anyone of you comes while the Imam is \ndelivering the sermon or has come out for it, he should offer a two rak`at prayer.\"","reference":"Sahih al-Bukhari 1170, Book 19, Hadith 49","grade":"","question #":"question #2","question":"What is the significance of performing two rak`at prayer when arriving during the Friday sermon?","id":"bukhari-19-113"},{"hadith-eng":"Somebody came to the house of Ibn `Umar and told him that Allah's Messenger (ﷺ)s had entered the Ka`ba. \nIbn `Umar said, \"I went in front of the Ka`ba and found that Allah's Messenger (ﷺ) had come out of the \nKa`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's \nApostle (p.b.u.h) prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he \npray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two \nrak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira said, \"The Prophet (p.b.u.h) \nadvised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" \nItban (bin Malik) said, \"Allah's Messenger (ﷺ) \n(p.b.u.h) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (p.b.u.h) and \noffered two rak`at.\"","reference":"Sahih al-Bukhari 1171, Book 19, Hadith 50","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform prayers in relation to the Ka'ba?","id":"bukhari-19-114"},{"hadith-eng":"I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"","reference":"Sahih al-Bukhari 1172, 1173, Book 19, Hadith 51","grade":"","question #":"question #2","question":"What is the significance of offering Sunnah prayers at home according to Islamic tradition?","id":"bukhari-19-115"},{"hadith-eng":"I heard Abu Ash-sha'tha' Jabir saying, \"I heard Ibn `Abbas saying, 'I offered with Allah's Messenger (ﷺ) eight \nrak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) \ntogether.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; \nthe `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 \nVol. 1).","reference":"Sahih al-Bukhari 1174, Book 19, Hadith 52","grade":"","question #":"question #2","question":"How did the companions of the Prophet Muhammad (ﷺ) interpret the practice of combining prayers?","id":"bukhari-19-116"},{"hadith-eng":"I asked Ibn `Umar \"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did \n`Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr use to \npray it?\" He replied in the negative. I again asked, \"Did the Prophet (ﷺ) use to pray it?\" Ibn `Umar replied, \n\"I don't think he did.\"","reference":"Sahih al-Bukhari 1175, Book 19, Hadith 53","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) view the practice of the Duha prayer?","id":"bukhari-19-117"},{"hadith-eng":"Only Um Hani narrated to me that she had seen the Prophet (ﷺ) offering the Duha prayer. She said, \"On \nthe day of the conquest of Mecca, the Prophet (ﷺ) entered my house, took a bath and offered eight rak`at \n(of Duha prayers. I had never seen the Prophet (ﷺ) offering such a light prayer but he performed bowing \nand prostrations perfectly .","reference":"Sahih al-Bukhari 1176, Book 19, Hadith 54","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) perform the Duha prayer during the conquest of Mecca?","id":"bukhari-19-118"},{"hadith-eng":"I never saw the Prophet (ﷺ) offering the Duha prayer but I always offer it.","reference":"Sahih al-Bukhari 1177, Book 19, Hadith 55","grade":"","question #":"question #2","question":"How did Aisha's observation of the Prophet's practices influence her own worship?","id":"bukhari-19-119"},{"hadith-eng":"My friend (the Prophet) advised me to do three things and I shall not leave them till I die, these are: \nTo fast three days every month, to offer the Duha prayer, and to offer witr before sleeping.","reference":"Sahih al-Bukhari 1178, Book 19, Hadith 56","grade":"","question #":"question #2","question":"How often should one fast as part of a regular spiritual routine?","id":"bukhari-19-120"},{"hadith-eng":"I heard Anas bin Malik al-Ansari saying, \"An Ansari man, who was very \n     fat, said to the Prophet, 'I am unable to present myself for the \n     prayer with you.' He prepared a meal for the Prophet (ﷺ) and invited him \n     to his house. He washed one side of a mat with water and the Prophet (ﷺ) \n     offered two Rakat on it.\" So and so, the son of so and so, the son of \n     Al-Jarud asked Anas, \"Did the Prophet (ﷺ) use to offer the Duha prayer?\" \n     Anas replied, \"I never saw him praying (the Duha prayer) except on \n     that day.\"","reference":"Sahih al-Bukhari 1179, Book 19, Hadith 57","grade":"","question #":"question #2","question":"How did the Prophet (ﷺ) accommodate the needs of his companions in terms of prayer?","id":"bukhari-19-121"},{"hadith-eng":"I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.Hafsa told me that the Prophet (ﷺ) used to offer two Rakat after the call maker had made the Adhan and the day had dawned.","reference":"Sahih al-Bukhari 1180, 1181, Book 19, Hadith 58","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate additional prayers into his daily routine?","id":"bukhari-19-122"},{"hadith-eng":"The Prophet (ﷺ) never missed four rak`at before the Zuhr prayer and two rak`at before the Fajr prayer.","reference":"Sahih al-Bukhari 1182, Book 19, Hadith 59","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) incorporate voluntary prayers into his daily routine?","id":"bukhari-19-123"},{"hadith-eng":"The Prophet (ﷺ) said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third \ntime, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to \ntake it as a tradition.","reference":"Sahih al-Bukhari 1183, Book 19, Hadith 60","grade":"","question #":"question #2","question":"Why might the Prophet (ﷺ) have discouraged making certain voluntary prayers a tradition?","id":"bukhari-19-124"},{"hadith-eng":"I went to `Uqba bin 'Amir Al-Juhani and said, \"Is it not surprising that Abi Tamim offers two rak`at \nbefore the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Messenger (ﷺ).\" I asked \nhim, \"What prevents you from offering it now?\" He replied, \"Business.\"","reference":"Sahih al-Bukhari 1184, Book 19, Hadith 61","grade":"","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) maintain their prayer practices during his lifetime?","id":"bukhari-19-125"},{"hadith-eng":"that he remembered Allah's Messenger (ﷺ) and he also remembered a mouthful of water which he had \nthrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard \n`Itban bin Malik, who was present with Allah's Messenger (ﷺ) in the battle of Badr saying, \"I used to lead my \npeople at Bani Salim in the prayer and there was a valley between me and those people. Whenever it \nrained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Messenger (ﷺ) and \nsaid, 'I have weak eyesight and the valley between me and my people flows during the rainy season \nand it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so \nthat I could take that place as a praying place.' Allah's Messenger (ﷺ) said, 'I will do so.' So Allah's Messenger (ﷺ) \nand Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Messenger (ﷺ) \nasked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you \nwant us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So \nAllah's Messenger (ﷺ) stood up for the prayer and started the prayer with Takbir and we aligned in rows \nbehind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim \nwith him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a \nspecial type of dish prepared from barley flour and meat soup)-- \nWhen the neighbors got the news that Allah's Messenger (ﷺ) was in my house, they poured it till there were a \ngreat number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' \nOne of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's \nApostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but \nAllah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we \nnever saw him but helping and talking with the hypocrites.' Allah's Messenger (ﷺ) replied, 'No doubt, \nwhoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of \nAllah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some \npeople, one of whom was Abu Aiyub, the companion of Allah's Messenger (ﷺ) in the battle in which he (Abu \nAiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the \nnarration and said, 'I doubt that Allah's Messenger (ﷺ) ever said what you have said.' I felt that too much, and \nI vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin \nMalik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for \nHajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin \nMalik, who was by then an old blind man, was leading his people in the prayer. When he finished the \nprayer, I greeted him and introduced myself to him and then asked him about that narration. He told \nthat narration again in the same manner as he had narrated it the first time.\"","reference":"Sahih al-Bukhari 1185, 1186, Book 19, Hadith 62","grade":"","question #":"question #2","question":"How does the hadith address the issue of judging others' faith and intentions?","id":"bukhari-19-126"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Offer some of your prayers in your houses and do not make them graves.\"","reference":"Sahih al-Bukhari 1187, Book 19, Hadith 63","grade":"","question #":"question #2","question":"What is the significance of not turning homes into graves in the context of prayer?","id":"bukhari-19-127"},{"hadith-eng":"When the Prophet (ﷺ) got up at night to offer the Tahajjud prayer, he used to say: Allahumma lakal-hamd. \nAnta qaiyyimus-samawati wal-ard wa man fihinna. Walakal-hamd, Laka mulkus-samawati wal-ard wa \nman fihinna. Walakal-hamd, anta nurus-samawati wal-ard. Wa lakal-hamd, anta-l-haq wa wa'duka-lhaq, \nwa liqa'uka Haq, wa qauluka Haq, wal-jannatu Han wan-naru Haq wannabiyuna Haq. Wa \nMuhammadun, sallal-lahu'alaihi wasallam, Haq, was-sa'atu Haq. Allahumma aslamtu Laka wabika \namantu, wa 'Alaika tawakkaltu, wa ilaika anabtu wa bika khasamtu, wa ilaika hakamtu faghfir li ma \nqaddamtu wama akh-khartu wama as-rartu wama'a lantu, anta-l-muqaddim wa anta-l-mu akh-khir, la \nilaha illa anta (or la ilaha ghairuka). (O Allah! All the praises are for you, You are the Holder of the \nHeavens and the Earth, And whatever is in them. All the praises are for You; You have the possession \nof the Heavens and the Earth And whatever is in them. All the praises are for You; You are the Light \nof the Heavens and the Earth And all the praises are for You; You are the King of the Heavens and the \nEarth; And all the praises are for You; You are the Truth and Your Promise is the truth, And to meet \nYou is true, Your Word is the truth And Paradise is true And Hell is true And all the Prophets (Peace \nbe upon them) are true; And Muhammad is true, And the Day of Resurrection is true. O Allah ! I \nsurrender (my will) to You; I believe in You and depend on You. And repent to You, And with Your \nhelp I argue (with my opponents, the non-believers) And I take You as a judge (to judge between us). \nPlease forgive me my previous And future sins; And whatever I concealed or revealed And You are \nthe One who make (some people) forward And (some) backward. There is none to be worshipped but \nyou . Sufyan said that `Abdul Karim Abu Umaiya added to the above, 'Wala haula Wala quwata illa \nbillah' (There is neither might nor power except with Allah).","reference":"Sahih al-Bukhari 1120, Book 19, Hadith 1","grade":"","question #":"question #3","question":"What is the significance of seeking forgiveness for past and future sins in the supplication?","id":"bukhari-19-128"},{"hadith-eng":"In the lifetime of the Prophet (ﷺ) whosoever saw a dream would narrate it to Allah's Messenger (ﷺ). I had a wish \nof seeing a dream to narrate it to Allah's Messenger (ﷺ) (p.b.u.h) I was a grown up boy and used to sleep in \nthe Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and \ntook me to the Fire which was built all round like a built well and had two poles in it and the people in \nit were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another \nangel who told me not to be afraid. I narrated the dream to Hafsa who told it to Allah's Messenger (ﷺ). The \nProphet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's \nfather) used to sleep but a little at night.","reference":"Sahih al-Bukhari 1121, 1122, Book 19, Hadith 2","grade":"","question #":"question #3","question":"How can seeking refuge in Allah provide comfort and protection in times of fear or distress?","id":"bukhari-19-129"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer eleven rak`at and that was his prayer. He used to prolong the prostration \nto such an extent that one could recite fifty verses (of the Qur'an) before he would lift his head. He \nused to pray two rak`at (Sunna) before the Fajr prayer and then used to lie down on his right side till \nthe call-maker came and informed him about the prayer.","reference":"Sahih al-Bukhari 1123, Book 19, Hadith 3","grade":"","question #":"question #3","question":"What was the Prophet's routine before the Fajr prayer?","id":"bukhari-19-130"},{"hadith-eng":"The Prophet (ﷺ) became sick and did not get up (for Tahajjud prayer) for a night or two.","reference":"Sahih al-Bukhari 1124, Book 19, Hadith 4","grade":"","question #":"question #3","question":"What lessons can be learned about human limitations and the practice of worship from the Prophet's experience with illness?","id":"bukhari-19-131"},{"hadith-eng":"Gabriel did not come to the Prophet (for some time) and so one of the Quraish women said, \"His \nSatan has deserted him.\" So came the Divine Revelation: \"By the forenoon And by the night When it \nis still! Your Lord (O Muhammad) has neither Forsaken you Nor hated you.\" (93.1-3)","reference":"Sahih al-Bukhari 1125, Book 19, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of the verses revealed in Surah Ad-Duha in reassuring the Prophet Muhammad?","id":"bukhari-19-132"},{"hadith-eng":"One night the Prophet (ﷺ) got up and said, \"Subhan Allah! How many afflictions Allah has revealed \ntonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady \noccupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in \nthe Hereafter.\"","reference":"Sahih al-Bukhari 1126, Book 19, Hadith 6","grade":"","question #":"question #3","question":"What actions are encouraged when facing afflictions and receiving blessings according to Islamic teachings?","id":"bukhari-19-133"},{"hadith-eng":"One night Allah's Messenger (ﷺ) came to me and Fatima, the daughter of the Prophet (ﷺ) and asked, \"Won't you \npray (at night)?\" I said, \"O Allah's Messenger (ﷺ)! Our souls are in the hands of Allah and if He wants us to \nget up He will make us get up.\" When I said that, he left us without saying anything and I heard that \nhe was hitting his thigh and saying, \"But man is more quarrelsome than anything.\" (18.54)","reference":"Sahih al-Bukhari 1127, Book 19, Hadith 7","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) approach to advising his family on religious practices?","id":"bukhari-19-134"},{"hadith-eng":"Allah's Messenger (ﷺ) used to give up a good deed, although he loved to do it, for fear that people might act \non it and it might be made compulsory for them. The Prophet (ﷺ) never prayed the Duha prayer, but I \noffer it.","reference":"Sahih al-Bukhari 1128, Book 19, Hadith 8","grade":"","question #":"question #3","question":"How did Aisha's practice of the Duha prayer differ from that of the Prophet?","id":"bukhari-19-135"},{"hadith-eng":"One night Allah's Messenger (ﷺ) offered the prayer in the Mosque and the people followed him. The next \nnight he also offered the prayer and too many people gathered. On the third and the fourth nights more \npeople gathered, but Allah's Messenger (ﷺ) did not come out to them. In the morning he said, \"I saw what \nyou were doing and nothing but the fear that it (i.e. the prayer) might be enjoined on you, stopped me \nfrom coming to you.\" And that happened in the month of Ramadan.","reference":"Sahih al-Bukhari 1129, Book 19, Hadith 9","grade":"","question #":"question #3","question":"What can be learned about the Prophet's approach to communal prayers during Ramadan from this event?","id":"bukhari-19-136"},{"hadith-eng":"The Prophet (ﷺ) used to stand (in the prayer) or pray till both his feet or legs swelled. He was asked why \n(he offered such an unbearable prayer) and he said, \"should I not be a thankful slave.\"","reference":"Sahih al-Bukhari 1130, Book 19, Hadith 10","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's commitment to prayer despite physical discomfort?","id":"bukhari-19-137"},{"hadith-eng":"Allah's Messenger (ﷺ) told me, \"The most beloved prayer to Allah is that of David and the most beloved \nfasts to Allah are those of David. He used to sleep for half of the night and then pray for one third of \nthe night and again sleep for its sixth part and used to fast on alternate days.\"","reference":"Sahih al-Bukhari 1131, Book 19, Hadith 11","grade":"","question #":"question #3","question":"What can be learned from the sleep and prayer routine of Prophet David regarding balancing worship and rest?","id":"bukhari-19-138"},{"hadith-eng":"I asked `Aisha which deed was most loved by the Prophet. She said, \"A deed done continuously.\" I \nfurther asked, \"When did he used to get up (in the night for the prayer).\" She said, \"He used to get up \non hearing the crowing of a cock.\"","reference":"Sahih al-Bukhari 1132, Book 19, Hadith 12","grade":"","question #":"question #3","question":"How does the crowing of a cock relate to the Prophet Muhammad's (peace be upon him) prayer habits?","id":"bukhari-19-139"},{"hadith-eng":"In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.","reference":"Sahih al-Bukhari 1133, Book 19, Hadith 14","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (p.b.u.h) sleep schedule from Aisha's narration?","id":"bukhari-19-140"},{"hadith-eng":"Anas bin Malik said, \"The Prophet (p.b.u.h) and Zaid bin Thabit took their Suhur together. When they \nfinished it, the Prophet (ﷺ) stood for the (Fajr) prayer and offered it.\" We asked Anas, \"What was the \ninterval between their finishing the Suhur and the starting of the morning prayer?\" Anas replied, \"It \nwas equal to the time taken by a person in reciting fifty verses of the Qur'an.\"","reference":"Sahih al-Bukhari 1134, Book 19, Hadith 15","grade":"","question #":"question #3","question":"What can be learned about the Prophet's routine during the time of Suhur and Fajr prayer?","id":"bukhari-19-141"},{"hadith-eng":"`Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet (ﷺ) and he kept on standing till \nan ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and \nleave the Prophet (standing).\"","reference":"Sahih al-Bukhari 1135, Book 19, Hadith 16","grade":"","question #":"question #3","question":"What lessons can be learned from the Prophet's dedication to standing in prayer for extended periods?","id":"bukhari-19-142"},{"hadith-eng":"Whenever the Prophet (ﷺ) got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.","reference":"Sahih al-Bukhari 1136, Book 19, Hadith 17","grade":"","question #":"question #3","question":"What are the recommended practices for preparing for Tahajjud prayer?","id":"bukhari-19-143"},{"hadith-eng":"A man said, \"O Allah's Messenger (ﷺ)! How is the prayer of the night?\" He said, \"Two rak`at followed by \ntwo rak`at and so on, and when you apprehend the approaching dawn, offer one rak`a as witr.\"","reference":"Sahih al-Bukhari 1137, Book 19, Hadith 18","grade":"","question #":"question #3","question":"How should one conclude their night prayers before the dawn according to Islamic teachings?","id":"bukhari-19-144"},{"hadith-eng":"The prayer of the Prophet (ﷺ) used to be of thirteen rak`at, i.e. of the night prayer.","reference":"Sahih al-Bukhari 1138, Book 19, Hadith 19","grade":"","question #":"question #3","question":"What is the significance of the number of rak'ahs in the Prophet's (ﷺ) night prayer?","id":"bukhari-19-145"},{"hadith-eng":"I asked Aisha about the night prayer of Allah's Messenger (ﷺ) and she said, \"It was seven, nine or eleven \nrak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"","reference":"Sahih al-Bukhari 1139, Book 19, Hadith 20","grade":"","question #":"question #3","question":"How did Aisha describe the night prayer of the Prophet Muhammad (ﷺ)?","id":"bukhari-19-146"},{"hadith-eng":"The Prophet (p.b.u.h) used to offer thirteen rak`at of the night prayer and that included the witr and \ntwo rak`at (Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1140, Book 19, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of the witr and Sunna of the Fajr prayer in the Prophet's (p.b.u.h) night prayer?","id":"bukhari-19-147"},{"hadith-eng":"Sometimes Allah's Messenger (ﷺ) would not fast (for so many days) that we thought that he would not fast \nthat month and he sometimes used to fast (for so many days) that we thought he would not leave \nfasting throughout that month and (as regards his prayer and sleep at night), if you wanted to see him \npraying at night, you could see him praying and if you wanted to see him sleeping, you could see him \nsleeping.","reference":"Sahih al-Bukhari 1141, Book 19, Hadith 22","grade":"","question #":"question #3","question":"How did the companions perceive the Prophet's (ﷺ) fasting and prayer habits?","id":"bukhari-19-148"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Satan puts three knots at the back of the head of any of you if he is asleep. On \nevery knot he reads and exhales the following words, 'The night is long, so stay asleep.' When one \nwakes up and remembers Allah, one knot is undone; and when one performs ablution, the second knot \nis undone, and when one prays the third knot is undone and one gets up energetic with a good heart in \nthe morning; otherwise one gets up lazy and with a mischievous heart.\"","reference":"Sahih al-Bukhari 1142, Book 19, Hadith 23","grade":"","question #":"question #3","question":"What are the benefits of performing prayer immediately after waking up?","id":"bukhari-19-149"},{"hadith-eng":"The Prophet (ﷺ) said in his narration of a dream that he saw, \"He whose head was being crushed with a \nstone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"","reference":"Sahih al-Bukhari 1143, Book 19, Hadith 24","grade":"","question #":"question #3","question":"How does neglecting obligatory prayers impact a person's spiritual state according to Islamic teachings?","id":"bukhari-19-150"},{"hadith-eng":"A person was mentioned before the Prophet (p.b.u.h) and he was told that he had kept on sleeping till \nmorning and had not got up for the prayer. The Prophet (ﷺ) said, \"Satan urinated in his ears.\"","reference":"Sahih al-Bukhari 1144, Book 19, Hadith 25","grade":"","question #":"question #3","question":"What is the significance of waking up for morning prayers in Islam?","id":"bukhari-19-151"},{"hadith-eng":"Allah's Messenger (ﷺ) (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the \nnearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, \nso that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is \nthere anyone seeking My forgiveness, so that I may forgive him?\"","reference":"Sahih al-Bukhari 1145, Book 19, Hadith 26","grade":"","question #":"question #3","question":"What actions are encouraged during the last third of the night according to Islamic teachings?","id":"bukhari-19-152"},{"hadith-eng":"I asked `Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, \nand get up in its last part to pray, and then return to his bed. When the Mu'adh-dhin pronounced the \nAdhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform \nablution and then go out (for the prayer).\"","reference":"Sahih al-Bukhari 1146, Book 19, Hadith 27","grade":"","question #":"question #3","question":"What actions did the Prophet Muhammad (ﷺ) take if he needed a bath before the Fajr prayer?","id":"bukhari-19-153"},{"hadith-eng":"I asked `Aisha, \"How is the prayer of Allah's Messenger (ﷺ) during the month of Ramadan.\" She said, \n\"Allah's Messenger (ﷺ) never exceeded eleven rak`at in Ramadan or in other months; he used to offer four \nrak`at-- do not ask me about their beauty and length, then four rak`at, do not ask me about their beauty \nand length, and then three rak`at.\" Aisha further said, \"I said, 'O Allah's Messenger (ﷺ)! Do you sleep before \noffering the witr prayer?' He replied, 'O `Aisha! My eyes sleep but my heart remains awake'!\"","reference":"Sahih al-Bukhari 1147, Book 19, Hadith 28","grade":"","question #":"question #3","question":"What can be inferred about the beauty and length of the Prophet's prayer from Aisha's description?","id":"bukhari-19-154"},{"hadith-eng":"I did not see the Prophet (ﷺ) reciting (the Qur'an) in the night prayer while sitting except when he became \nold; when he used to recite while sitting, and when thirty or forty verses remained from the Sura, he \nwould get up and recite them and then bow.","reference":"Sahih al-Bukhari 1148, Book 19, Hadith 29","grade":"","question #":"question #3","question":"How does the practice of reciting the Qur'an while sitting relate to physical ability in worship?","id":"bukhari-19-155"},{"hadith-eng":"At the time of the Fajr prayer the Prophet (ﷺ) asked Bilal, \"Tell me of the best deed you did after \nembracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do \nanything worth mentioning except that whenever I performed ablution during the day or night, I \nprayed after that ablution as much as was written for me.\"","reference":"Sahih al-Bukhari 1149, Book 19, Hadith 30","grade":"","question #":"question #3","question":"What can be learned about the virtues of Bilal from his actions after embracing Islam?","id":"bukhari-19-156"},{"hadith-eng":"Narrated Anas bin MalikOnce the Prophet (p.b.u.h) entered the Mosque and saw a rope hanging \n     in between its two pillars. He said, \"What is this rope?\" The people \n     said, \"This rope is for Zainab who, when she feels tired, holds it (to\n     keep standing for the prayer.)\" The Prophet (ﷺ) said, \"Don't use it. \n     Remove the rope. You should pray as long as you feel active, and when \n     you get tired, sit down.\"","reference":"Sahih al-Bukhari 1150, Book 19, Hadith 31","grade":"","question #":"question #3","question":"What is the significance of maintaining sincerity and focus during prayer in Islam?","id":"bukhari-19-157"},{"hadith-eng":"A woman from the tribe of Bani Asad was sitting with me and Allah's \n     Apostle (p.b.u.h) came to my house and said, \"Who is this?\" I said, \n     \"(She is) So and so. She does not sleep at night because she is \n     engaged in prayer.\" The Prophet (ﷺ) said disapprovingly: Do (good) deeds \n     which is within your capacity as Allah never gets tired of giving \n     rewards till you get tired of doing good deeds.\"","reference":"Sahih al-Bukhari 1151, Book 19, Hadith 32","grade":"","question #":"question #3","question":"What is the relationship between human endurance and divine reward in Islamic teachings?","id":"bukhari-19-158"},{"hadith-eng":"Allah's Messenger (ﷺ) said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then \nstopped the night prayer.\"","reference":"Sahih al-Bukhari 1152, Book 19, Hadith 33","grade":"","question #":"question #3","question":"What are the potential consequences of abandoning a good practice like night prayer after having started it?","id":"bukhari-19-159"},{"hadith-eng":"Once Allah's Messenger (ﷺ) said to me, \"I have been informed that you offer Salat (prayer) all the night and observe Saum (fast) during the day.\" I said, \"(Yes) I do so.\" He said, \"If you do so, your eye sight will become weak and you will become weak. No doubt, your body has right on you, and your family has right on you, so observe Saum (for some days) and do not observe it (for some days), offer Salat (for sometime) and then sleep.\"","reference":"Sahih al-Bukhari 1153, Book 19, Hadith 34","grade":"","question #":"question #3","question":"What rights do one's body and family have according to Islamic teachings?","id":"bukhari-19-160"},{"hadith-eng":"The Prophet (ﷺ) \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, \nwaLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha \nil-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped \nbut Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are \ndue for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none \nhas the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power \nExcept with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), \nhe will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"","reference":"Sahih al-Bukhari 1154, Book 19, Hadith 35","grade":"","question #":"question #3","question":"What is the significance of performing ablution and prayer after reciting praises to Allah in the context of seeking forgiveness?","id":"bukhari-19-161"},{"hadith-eng":"That once Allah's Messenger (ﷺ) (p.b.u.h) said, \"Your brother, i.e. `Abdullah bin Rawaha does not say \nobscene (referring to his verses): Amongst us is Allah's Messenger (ﷺ), who recites His Book when it dawns. \nHe showed us the guidance, after we were blind. We believe that whatever he says will come true. \nAnd he spends his nights in such a way as his sides do not touch his bed. While the pagans were \ndeeply asleep.\"","reference":"Sahih al-Bukhari 1155, Book 19, Hadith 36","grade":"","question #":"question #3","question":"What is the significance of spending nights in worship as mentioned in the narration?","id":"bukhari-19-162"},{"hadith-eng":"Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"","reference":"Sahih al-Bukhari 1156, 1157, 1158, Book 19, Hadith 37","grade":"","question #":"question #3","question":"How is the Night of Decree (Laila-tul-Qadr) identified and what is its significance during the month of Ramadan?","id":"bukhari-19-163"},{"hadith-eng":"Allah's Messenger (ﷺ) offered the `Isha' prayer (and then got up at the Tahajjud time) and offered eight rak`at \nand then offered two rak`at while sitting. He then offered two rak`at in between the Adhan and Iqama \n(of the Fajr prayer) and he never missed them.","reference":"Sahih al-Bukhari 1159, Book 19, Hadith 38","grade":"","question #":"question #3","question":"What is the importance of the two rak'ahs offered between the Adhan and Iqama of the Fajr prayer?","id":"bukhari-19-164"},{"hadith-eng":"The Prophet (ﷺ) used to lie down on his right side, after offering two rak`at (Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1160, Book 19, Hadith 39","grade":"","question #":"question #3","question":"What practices are recommended after the Fajr prayer according to the Prophet's (ﷺ) tradition?","id":"bukhari-19-165"},{"hadith-eng":"After offering the Sunna of the Fajr prayer, the Prophet (ﷺ) used to talk to me, if I happen to be awake; \notherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).","reference":"Sahih al-Bukhari 1161, Book 19, Hadith 40","grade":"","question #":"question #3","question":"What actions did the Prophet take if his wife was not awake after the Sunna of the Fajr prayer?","id":"bukhari-19-166"},{"hadith-eng":"After offering the two rak`at (Sunna) the Prophet (p.b.u.h) used to talk to me, if I happen to be awake; \notherwise he would lie down.","reference":"Sahih al-Bukhari 1162, Book 19, Hadith 41","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's routine in terms of rest and communication after prayer?","id":"bukhari-19-167"},{"hadith-eng":"The Prophet (ﷺ) was never more regular and particular in offering any Nawafil than the two rak`at \n(Sunna) of the Fajr prayer.","reference":"Sahih al-Bukhari 1163, Book 19, Hadith 42","grade":"","question #":"question #3","question":"Why might the two rak'ahs of Sunnah before Fajr be considered particularly important in Islamic practice?","id":"bukhari-19-168"},{"hadith-eng":"Allah's Messenger (ﷺ) used to offer thirteen rak`at in the night prayer and on hearing the Adhan for the \nmorning prayer, he used to offer two light rak`at.","reference":"Sahih al-Bukhari 1164, Book 19, Hadith 43","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) practice of night prayer from this narration?","id":"bukhari-19-169"},{"hadith-eng":"The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder \nwhether he recited Al-Fatiha (or not).","reference":"Sahih al-Bukhari 1165, Book 19, Hadith 44","grade":"","question #":"question #3","question":"What can be inferred about the length and nature of the pre-Fajr prayer from Aisha's observation?","id":"bukhari-19-170"},{"hadith-eng":"The Prophet (p.b.u.h) used to teach us the way of doing Istikhara (Istikhara means to ask Allah to \nguide one to the right sort of action concerning any job or a deed), in all matters as he taught us the \nSuras of the Qur'an. He said, \"If anyone of you thinks of doing any job he should offer a two rak`at \nprayer other than the compulsory ones and say (after the prayer): -- 'Allahumma inni astakhiruka \nbi'ilmika, Wa astaqdiruka bi-qudratika, Wa as'alaka min fadlika Al-`azlm Fa-innaka taqdiru Wala \naqdiru, Wa ta'lamu Wala a'lamu, Wa anta 'allamu l-ghuyub. Allahumma, in kunta ta'lam anna hadha-lamra \nKhairun li fi dini wa ma'ashi wa'aqibati `Amri (or 'ajili `Amri wa'ajilihi) Faqdirhu wa yas-sirhu li \nthumma barik li Fihi, Wa in kunta ta'lamu anna hadha-lamra shar-run li fi dini wa ma'ashi wa'aqibati \n`Amri (or fi'ajili `Amri wa ajilihi) Fasrifhu anni was-rifni anhu. Waqdir li al-khaira haithu kana \nThumma ardini bihi.' (O Allah! I ask guidance from Your knowledge, And Power from Your Might \nand I ask for Your great blessings. You are capable and I am not. You know and I do not and You \nknow the unseen. O Allah! If You know that this job is good for my religion and my subsistence and \nin my Hereafter--(or said: If it is better for my present and later needs)--Then You ordain it for me and \nmake it easy for me to get, And then bless me in it, and if You know that this job is harmful to me In \nmy religion and subsistence and in the Hereafter--(or said: If it is worse for my present and later \nneeds)--Then keep it away from me and let me be away from it. And ordain for me whatever is good \nfor me, And make me satisfied with it). The Prophet (ﷺ) added that then the person should name \n(mention) his need.","reference":"Sahih al-Bukhari 1166, Book 19, Hadith 45","grade":"","question #":"question #3","question":"What are the benefits of seeking Allah's guidance through Istikhara in personal and religious matters?","id":"bukhari-19-171"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you enters a Mosque, he should not sit until he has offered a tworak` \nat prayer.\"","reference":"Sahih al-Bukhari 1167, Book 19, Hadith 46","grade":"","question #":"question #3","question":"How does the practice of praying upon entering a mosque reflect on one's respect for the place of worship?","id":"bukhari-19-172"},{"hadith-eng":"Allah's Messenger (ﷺ) led us and offered a two rak`at prayer and then went away.","reference":"Sahih al-Bukhari 1168, Book 19, Hadith 47","grade":"","question #":"question #3","question":"What can be learned from the actions of the Prophet (ﷺ) after completing a prayer?","id":"bukhari-19-173"},{"hadith-eng":"I offered with Allah's Messenger (ﷺ) a two rak`at prayer before the Zuhr prayer and two rak`at after the Zuhr \nprayer, two rak`at after Jumua, Maghrib and `Isha' prayers.","reference":"Sahih al-Bukhari 1169, Book 19, Hadith 48","grade":"","question #":"question #3","question":"What is the significance of performing additional rak'ahs after obligatory prayers like Maghrib and Isha?","id":"bukhari-19-174"},{"hadith-eng":"While delivering a sermon, Allah's Messenger (ﷺ) said, \"If anyone of you comes while the Imam is \ndelivering the sermon or has come out for it, he should offer a two rak`at prayer.\"","reference":"Sahih al-Bukhari 1170, Book 19, Hadith 49","grade":"","question #":"question #3","question":"How does the timing of arrival at the mosque affect the actions a person should take during the sermon?","id":"bukhari-19-175"},{"hadith-eng":"Somebody came to the house of Ibn `Umar and told him that Allah's Messenger (ﷺ)s had entered the Ka`ba. \nIbn `Umar said, \"I went in front of the Ka`ba and found that Allah's Messenger (ﷺ) had come out of the \nKa`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's \nApostle (p.b.u.h) prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he \npray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two \nrak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira said, \"The Prophet (p.b.u.h) \nadvised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" \nItban (bin Malik) said, \"Allah's Messenger (ﷺ) \n(p.b.u.h) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (p.b.u.h) and \noffered two rak`at.\"","reference":"Sahih al-Bukhari 1171, Book 19, Hadith 50","grade":"","question #":"question #3","question":"What is the importance of the Duha prayer in Islam and when should it be performed?","id":"bukhari-19-176"},{"hadith-eng":"I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"","reference":"Sahih al-Bukhari 1172, 1173, Book 19, Hadith 51","grade":"","question #":"question #3","question":"What is the practice of offering two light rak`at after dawn in the context of Islamic prayer routines?","id":"bukhari-19-177"},{"hadith-eng":"I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"","reference":"Sahih al-Bukhari 1172, 1173, Book 19, Hadith 51","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) incorporate light rak'ahs after dawn into his prayer routine?","id":"bukhari-19-178"},{"hadith-eng":"I heard Abu Ash-sha'tha' Jabir saying, \"I heard Ibn `Abbas saying, 'I offered with Allah's Messenger (ﷺ) eight \nrak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) \ntogether.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; \nthe `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 \nVol. 1).","reference":"Sahih al-Bukhari 1174, Book 19, Hadith 52","grade":"","question #":"question #3","question":"What are the possible reasons for combining Zuhr and Asr, and Maghrib and Isha prayers according to Islamic teachings?","id":"bukhari-19-179"},{"hadith-eng":"I asked Ibn `Umar \"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did \n`Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr use to \npray it?\" He replied in the negative. I again asked, \"Did the Prophet (ﷺ) use to pray it?\" Ibn `Umar replied, \n\"I don't think he did.\"","reference":"Sahih al-Bukhari 1175, Book 19, Hadith 53","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) practice of the Duha prayer from the companions' testimonies?","id":"bukhari-19-180"},{"hadith-eng":"Only Um Hani narrated to me that she had seen the Prophet (ﷺ) offering the Duha prayer. She said, \"On \nthe day of the conquest of Mecca, the Prophet (ﷺ) entered my house, took a bath and offered eight rak`at \n(of Duha prayers. I had never seen the Prophet (ﷺ) offering such a light prayer but he performed bowing \nand prostrations perfectly .","reference":"Sahih al-Bukhari 1176, Book 19, Hadith 54","grade":"","question #":"question #3","question":"What can be learned from the Prophet's (ﷺ) manner of performing prayers in terms of bowing and prostrations?","id":"bukhari-19-181"},{"hadith-eng":"I never saw the Prophet (ﷺ) offering the Duha prayer but I always offer it.","reference":"Sahih al-Bukhari 1177, Book 19, Hadith 55","grade":"","question #":"question #3","question":"What can be learned from Aisha's personal practice of the Duha prayer despite not seeing the Prophet perform it?","id":"bukhari-19-182"},{"hadith-eng":"My friend (the Prophet) advised me to do three things and I shall not leave them till I die, these are: \nTo fast three days every month, to offer the Duha prayer, and to offer witr before sleeping.","reference":"Sahih al-Bukhari 1178, Book 19, Hadith 56","grade":"","question #":"question #3","question":"What is the significance of performing the Duha prayer and Witr prayer in daily worship?","id":"bukhari-19-183"},{"hadith-eng":"I heard Anas bin Malik al-Ansari saying, \"An Ansari man, who was very \n     fat, said to the Prophet, 'I am unable to present myself for the \n     prayer with you.' He prepared a meal for the Prophet (ﷺ) and invited him \n     to his house. He washed one side of a mat with water and the Prophet (ﷺ) \n     offered two Rakat on it.\" So and so, the son of so and so, the son of \n     Al-Jarud asked Anas, \"Did the Prophet (ﷺ) use to offer the Duha prayer?\" \n     Anas replied, \"I never saw him praying (the Duha prayer) except on \n     that day.\"","reference":"Sahih al-Bukhari 1179, Book 19, Hadith 57","grade":"","question #":"question #3","question":"What does this narration suggest about the Prophet's (ﷺ) acceptance of hospitality from his companions?","id":"bukhari-19-184"},{"hadith-eng":"I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.Hafsa told me that the Prophet (ﷺ) used to offer two Rakat after the call maker had made the Adhan and the day had dawned.","reference":"Sahih al-Bukhari 1180, 1181, Book 19, Hadith 58","grade":"","question #":"question #3","question":"What is the significance of performing Nawafil prayers at home according to the practices of the Prophet?","id":"bukhari-19-185"},{"hadith-eng":"The Prophet (ﷺ) never missed four rak`at before the Zuhr prayer and two rak`at before the Fajr prayer.","reference":"Sahih al-Bukhari 1182, Book 19, Hadith 59","grade":"","question #":"question #3","question":"What are the benefits of performing Sunnah prayers before the Fajr and Zuhr prayers?","id":"bukhari-19-186"},{"hadith-eng":"The Prophet (ﷺ) said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third \ntime, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to \ntake it as a tradition.","reference":"Sahih al-Bukhari 1183, Book 19, Hadith 60","grade":"","question #":"question #3","question":"How does the flexibility in performing voluntary prayers reflect on Islamic practices?","id":"bukhari-19-187"},{"hadith-eng":"I went to `Uqba bin 'Amir Al-Juhani and said, \"Is it not surprising that Abi Tamim offers two rak`at \nbefore the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Messenger (ﷺ).\" I asked \nhim, \"What prevents you from offering it now?\" He replied, \"Business.\"","reference":"Sahih al-Bukhari 1184, Book 19, Hadith 61","grade":"","question #":"question #3","question":"What factors might prevent someone from performing additional voluntary prayers?","id":"bukhari-19-188"},{"hadith-eng":"that he remembered Allah's Messenger (ﷺ) and he also remembered a mouthful of water which he had \nthrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard \n`Itban bin Malik, who was present with Allah's Messenger (ﷺ) in the battle of Badr saying, \"I used to lead my \npeople at Bani Salim in the prayer and there was a valley between me and those people. Whenever it \nrained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Messenger (ﷺ) and \nsaid, 'I have weak eyesight and the valley between me and my people flows during the rainy season \nand it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so \nthat I could take that place as a praying place.' Allah's Messenger (ﷺ) said, 'I will do so.' So Allah's Messenger (ﷺ) \nand Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Messenger (ﷺ) \nasked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you \nwant us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So \nAllah's Messenger (ﷺ) stood up for the prayer and started the prayer with Takbir and we aligned in rows \nbehind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim \nwith him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a \nspecial type of dish prepared from barley flour and meat soup)-- \nWhen the neighbors got the news that Allah's Messenger (ﷺ) was in my house, they poured it till there were a \ngreat number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' \nOne of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's \nApostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but \nAllah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we \nnever saw him but helping and talking with the hypocrites.' Allah's Messenger (ﷺ) replied, 'No doubt, \nwhoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of \nAllah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some \npeople, one of whom was Abu Aiyub, the companion of Allah's Messenger (ﷺ) in the battle in which he (Abu \nAiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the \nnarration and said, 'I doubt that Allah's Messenger (ﷺ) ever said what you have said.' I felt that too much, and \nI vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin \nMalik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for \nHajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin \nMalik, who was by then an old blind man, was leading his people in the prayer. When he finished the \nprayer, I greeted him and introduced myself to him and then asked him about that narration. He told \nthat narration again in the same manner as he had narrated it the first time.\"","reference":"Sahih al-Bukhari 1185, 1186, Book 19, Hadith 62","grade":"","question #":"question #3","question":"What does the hadith suggest about the importance of declaring the oneness of Allah for salvation?","id":"bukhari-19-189"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Offer some of your prayers in your houses and do not make them graves.\"","reference":"Sahih al-Bukhari 1187, Book 19, Hadith 63","grade":"","question #":"question #3","question":"How can offering prayers at home impact the spiritual atmosphere of a household?","id":"bukhari-19-190"}]