[{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten days of the month of Ramadan.","reference":"Sahih al-Bukhari 2025, Book 33, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of I'tikaf during the last ten days of Ramadan in Islamic tradition?","id":"bukhari-33-1"},{"hadith-eng":"(the wife of the Prophet) The Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan till he \ndied and then his wives used to practice I`tikaf after him.","reference":"Sahih al-Bukhari 2026, Book 33, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of I`tikaf during the last ten days of Ramadan in Islamic tradition?","id":"bukhari-33-2"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in \nI`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come \nout of his I`tikaf. The Prophet (ﷺ) said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last \nten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In \nthe dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in \nthe last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque \ndribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and \nwater on the forehead of the Prophet (i.e. in the morning of the twenty-first).","reference":"Sahih al-Bukhari 2027, Book 33, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of I`tikaf during the last ten days of Ramadan?","id":"bukhari-33-3"},{"hadith-eng":"The Prophet (ﷺ) used to (put) bend his head (out) to me while he was in I`tikaf in the mosque during my \nmonthly periods and I would comb and oil his hair.","reference":"Sahih al-Bukhari 2028, Book 33, Hadith 4","grade":"","question #":"question #1","question":"What does this narration indicate about the permissibility of physical interaction between spouses during a woman's menstrual period?","id":"bukhari-33-4"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) used to let his head in (the house) while he was in the \nmosque and I would comb and oil his hair. When in I`tikaf he used not to enter the house except for a \nneed.","reference":"Sahih al-Bukhari 2029, Book 33, Hadith 5","grade":"","question #":"question #1","question":"What activities are permissible for a person in I'tikaf while staying in the mosque?","id":"bukhari-33-5"},{"hadith-eng":"The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.","reference":"Sahih al-Bukhari 2030, 2031, Book 33, Hadith 6","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) demonstrate affection and normalcy towards his wife during her menses?","id":"bukhari-33-6"},{"hadith-eng":"`Umar asked the Prophet (ﷺ) \"I vowed in the Pre-Islamic period of ignorance to stay in I`tikaf for one \nnight in Al-Masjid al-Haram.\" The Prophet (ﷺ) said to him, \"Fulfill your vow.\"","reference":"Sahih al-Bukhari 2032, Book 33, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of fulfilling vows made before embracing Islam?","id":"bukhari-33-7"},{"hadith-eng":"Aisha said, \"the Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a \ntent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the \npermission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab \nbint Jahsh saw it, she pitched another tent. In the morning the Prophet (ﷺ) noticed the tents. He said, \n'What is this?\" He was told of the whole situation. Then the Prophet (ﷺ) said, \"Do you think that they \nintended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and \npracticed I`tikaf for ten days in the month of Shawwal.\"","reference":"Sahih al-Bukhari 2033, Book 33, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of I`tikaf during the last ten days of Ramadan in Islamic tradition?","id":"bukhari-33-8"},{"hadith-eng":"The Prophet (ﷺ) intended to practice I`tikaf and when he reached the place where he intended to perform \nI`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that \nthey intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf \n(in Ramadan) but performed it in the month of Shawwal for ten days.","reference":"Sahih al-Bukhari 2034, Book 33, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of performing I`tikaf in Islam and how does it relate to righteousness?","id":"bukhari-33-9"},{"hadith-eng":"Safiya, the wife of the Prophet (ﷺ) told me that she went to Allah's Messenger (ﷺ) to visit him in the mosque \nwhile he was in I`tikaf in the last ten days of Ramadan. She had a talk with him for a while, then she \ngot up in order to return home. The Prophet (ﷺ) accompanied her. When they reached the gate of the \nmosque, opposite the door of Um-Salama, two Ansari men were passing by and they greeted Allah's \nApostle . He told them: Do not run away! And said, \"She is (my wife) Safiya bint Huyai.\" Both of \nthem said, \"Subhan Allah, (How dare we think of any evil) O Allah's Messenger (ﷺ)!\" And they felt it. The \nProphet said (to them), \"Satan reaches everywhere in the human body as blood reaches in it, \n(everywhere in one's body). I was afraid lest Satan might insert an evil thought in your minds.\"","reference":"Sahih al-Bukhari 2035, Book 33, Hadith 10","grade":"","question #":"question #1","question":"What measures can be taken to prevent misunderstandings or suspicions in social interactions?","id":"bukhari-33-10"},{"hadith-eng":"I asked Abu Sa`id Al-Khudri, \"Did you hear Allah's Messenger (ﷺ) talking about the Night of Qadr?\" He \nreplied in the affirmative and said, \"Once we were in I`tikaf with Allah's Messenger (ﷺ) in the middle ten \ndays of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger (ﷺ)delivered \na sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of \nQadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the \nmonth of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of \nQadr). So, whoever had been in I`tikaf with Allah's Messenger (ﷺ) should return for it.' The people returned \nto the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came \nand it rained. Then the prayer was established (they stood for the prayer) and Allah's Messenger (ﷺ) \nprostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.","reference":"Sahih al-Bukhari 2036, Book 33, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of the Night of Qadr in the month of Ramadan?","id":"bukhari-33-11"},{"hadith-eng":"One of the wives of Allah's Messenger (ﷺ) practiced I`tikaf with him while she ad bleeding in between her \nperiods and she would see red (blood) or yellowish traces, and sometimes we put a tray beneath her \nwhen she offered the prayer.","reference":"Sahih al-Bukhari 2037, Book 33, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of practicing I'tikaf during menstruation or irregular bleeding?","id":"bukhari-33-12"},{"hadith-eng":"The wives of the Prophet (ﷺ) were with him in the mosque (while he was in I`tikaf) and then they \ndeparted and the Prophet (ﷺ) said to Safiya bint Huyai, \"Don't hurry up, for I shall accompany you,\" (and \nher dwelling was in the house of Usama). The Prophet (ﷺ) went out and in the meantime two Ansari men \nmet him and they looked at the Prophet (ﷺ) and passed by. The Prophet (ﷺ) said to them, \"Come here. She is \n(my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's \nApostle! (we never expect anything bad from you).\" The Prophet (ﷺ) replied, \"Satan circulates in the \nhuman being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in \nyour minds.\"","reference":"Sahih al-Bukhari 2038, Book 33, Hadith 13","grade":"","question #":"question #1","question":"What measures can be taken to prevent misunderstandings or suspicions among people?","id":"bukhari-33-13"},{"hadith-eng":"Safiya went to the Prophet (ﷺ) while he was in I`tikaf. When she returned, the Prophet (ﷺ) accompanied her \nwalking. An Ansari man saw him. When the Prophet (ﷺ) noticed him, he called him and said, \"Come \nhere. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet (ﷺ) had said, \"This is Safiya\"). \nAnd Satan circulates in the body of Adam's offspring as his blood circulates in it.\" \n(A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")","reference":"Sahih al-Bukhari 2039, Book 33, Hadith 14","grade":"","question #":"question #1","question":"What measures did the Prophet Muhammad (ﷺ) take to prevent misunderstandings or suspicions among his followers?","id":"bukhari-33-14"},{"hadith-eng":"We practiced I`tikaf with Allah's Messenger (ﷺ) in the middle ten days (of Ramadan). In the morning of the \ntwentieth (of Ramadan) we shifted our baggage, but Allah's Messenger (ﷺ) came to us and said, \"Whoever \nwas m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this \nNight (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky \nwas overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was \ncovered with clouds from the end of that day, and the mosque which was roofed with leafstalks of \ndate palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet (ﷺ) \nand its tip.","reference":"Sahih al-Bukhari 2040, Book 33, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of I`tikaf during the last ten days of Ramadan?","id":"bukhari-33-15"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf every year in the month of Ramadan. And after offering the \nmorning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice \nI`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also \npitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the \nmorning, Allah's Messenger (ﷺ) had finished the morning prayer, he saw four tents and asked, \"What is \nthis?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove \nthe tents, for I do not want to see them.\" So, the tents were removed. The Prophet (ﷺ) did not perform \nI`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.","reference":"Sahih al-Bukhari 2041, Book 33, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of I`tikaf during Ramadan in Islamic tradition?","id":"bukhari-33-16"},{"hadith-eng":"`Umar bin Al-Khattab said, \"O Allah's Messenger (ﷺ)! I vowed in the Pre-Islamic period to perform I`tikaf in \nAl-Masjid-al-Haram for one night.\" The Prophet (ﷺ) said, \"Fulfill your vow.\" So, he performed I`tikaf for \none night.","reference":"Sahih al-Bukhari 2042, Book 33, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of fulfilling vows made before embracing Islam?","id":"bukhari-33-17"},{"hadith-eng":"that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator \nthinks that `Umar vowed to perform I`tikaf for one night.) Allah's Messenger (ﷺ) said to `Umar, \n\"Fulfill your vow.\"","reference":"Sahih al-Bukhari 2043, Book 33, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of fulfilling vows made before embracing Islam?","id":"bukhari-33-18"},{"hadith-eng":"The Prophet (ﷺ) used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was \nthe year of his death, he stayed in I`tikaf for twenty days.","reference":"Sahih al-Bukhari 2044, Book 33, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of performing I`tikaf during the month of Ramadan?","id":"bukhari-33-19"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Messenger (ﷺ) used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal.","reference":"Sahih al-Bukhari 2045, Book 33, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of I`tikaf during the last ten days of Ramadan in Islamic tradition?","id":"bukhari-33-20"},{"hadith-eng":"Aisha during her menses used to comb and oil the hair of the Prophet (ﷺ) while he used to be in I`tikaf in \nthe mosque. He would stretch out his head towards her while she was in her chamber.","reference":"Sahih al-Bukhari 2046, Book 33, Hadith 21","grade":"","question #":"question #1","question":"What activities are permissible for a person in I'tikaf according to Islamic teachings?","id":"bukhari-33-21"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten days of the month of Ramadan.","reference":"Sahih al-Bukhari 2025, Book 33, Hadith 1","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) observe the practice of I'tikaf?","id":"bukhari-33-22"},{"hadith-eng":"(the wife of the Prophet) The Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan till he \ndied and then his wives used to practice I`tikaf after him.","reference":"Sahih al-Bukhari 2026, Book 33, Hadith 2","grade":"","question #":"question #2","question":"How did the practice of I`tikaf continue after the Prophet's passing?","id":"bukhari-33-23"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in \nI`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come \nout of his I`tikaf. The Prophet (ﷺ) said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last \nten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In \nthe dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in \nthe last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque \ndribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and \nwater on the forehead of the Prophet (i.e. in the morning of the twenty-first).","reference":"Sahih al-Bukhari 2027, Book 33, Hadith 3","grade":"","question #":"question #2","question":"How can one identify the Night of Qadr according to the Prophet's guidance?","id":"bukhari-33-24"},{"hadith-eng":"The Prophet (ﷺ) used to (put) bend his head (out) to me while he was in I`tikaf in the mosque during my \nmonthly periods and I would comb and oil his hair.","reference":"Sahih al-Bukhari 2028, Book 33, Hadith 4","grade":"","question #":"question #2","question":"How does this narration reflect the personal and domestic life of the Prophet Muhammad (ﷺ) during I`tikaf?","id":"bukhari-33-25"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) used to let his head in (the house) while he was in the \nmosque and I would comb and oil his hair. When in I`tikaf he used not to enter the house except for a \nneed.","reference":"Sahih al-Bukhari 2029, Book 33, Hadith 5","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain personal grooming during I'tikaf?","id":"bukhari-33-26"},{"hadith-eng":"The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.","reference":"Sahih al-Bukhari 2030, 2031, Book 33, Hadith 6","grade":"","question #":"question #2","question":"What actions did the Prophet (ﷺ) take while in I`tikaf that involved interaction with his wife?","id":"bukhari-33-27"},{"hadith-eng":"The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.","reference":"Sahih al-Bukhari 2030, 2031, Book 33, Hadith 6","grade":"","question #":"question #2","question":"What actions did the Prophet (ﷺ) permit or engage in with his wife while she was menstruating?","id":"bukhari-33-28"},{"hadith-eng":"`Umar asked the Prophet (ﷺ) \"I vowed in the Pre-Islamic period of ignorance to stay in I`tikaf for one \nnight in Al-Masjid al-Haram.\" The Prophet (ﷺ) said to him, \"Fulfill your vow.\"","reference":"Sahih al-Bukhari 2032, Book 33, Hadith 7","grade":"","question #":"question #2","question":"How does Islam view vows made during the pre-Islamic period of ignorance?","id":"bukhari-33-29"},{"hadith-eng":"Aisha said, \"the Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a \ntent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the \npermission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab \nbint Jahsh saw it, she pitched another tent. In the morning the Prophet (ﷺ) noticed the tents. He said, \n'What is this?\" He was told of the whole situation. Then the Prophet (ﷺ) said, \"Do you think that they \nintended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and \npracticed I`tikaf for ten days in the month of Shawwal.\"","reference":"Sahih al-Bukhari 2033, Book 33, Hadith 8","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the actions of his wives regarding I`tikaf?","id":"bukhari-33-30"},{"hadith-eng":"The Prophet (ﷺ) intended to practice I`tikaf and when he reached the place where he intended to perform \nI`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that \nthey intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf \n(in Ramadan) but performed it in the month of Shawwal for ten days.","reference":"Sahih al-Bukhari 2034, Book 33, Hadith 9","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the actions of his wives regarding I`tikaf?","id":"bukhari-33-31"},{"hadith-eng":"Safiya, the wife of the Prophet (ﷺ) told me that she went to Allah's Messenger (ﷺ) to visit him in the mosque \nwhile he was in I`tikaf in the last ten days of Ramadan. She had a talk with him for a while, then she \ngot up in order to return home. The Prophet (ﷺ) accompanied her. When they reached the gate of the \nmosque, opposite the door of Um-Salama, two Ansari men were passing by and they greeted Allah's \nApostle . He told them: Do not run away! And said, \"She is (my wife) Safiya bint Huyai.\" Both of \nthem said, \"Subhan Allah, (How dare we think of any evil) O Allah's Messenger (ﷺ)!\" And they felt it. The \nProphet said (to them), \"Satan reaches everywhere in the human body as blood reaches in it, \n(everywhere in one's body). I was afraid lest Satan might insert an evil thought in your minds.\"","reference":"Sahih al-Bukhari 2035, Book 33, Hadith 10","grade":"","question #":"question #2","question":"How does Satan influence human thoughts and actions according to Islamic teachings?","id":"bukhari-33-32"},{"hadith-eng":"I asked Abu Sa`id Al-Khudri, \"Did you hear Allah's Messenger (ﷺ) talking about the Night of Qadr?\" He \nreplied in the affirmative and said, \"Once we were in I`tikaf with Allah's Messenger (ﷺ) in the middle ten \ndays of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger (ﷺ)delivered \na sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of \nQadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the \nmonth of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of \nQadr). So, whoever had been in I`tikaf with Allah's Messenger (ﷺ) should return for it.' The people returned \nto the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came \nand it rained. Then the prayer was established (they stood for the prayer) and Allah's Messenger (ﷺ) \nprostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.","reference":"Sahih al-Bukhari 2036, Book 33, Hadith 11","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) instruct his companions to seek the Night of Qadr?","id":"bukhari-33-33"},{"hadith-eng":"One of the wives of Allah's Messenger (ﷺ) practiced I`tikaf with him while she ad bleeding in between her \nperiods and she would see red (blood) or yellowish traces, and sometimes we put a tray beneath her \nwhen she offered the prayer.","reference":"Sahih al-Bukhari 2037, Book 33, Hadith 12","grade":"","question #":"question #2","question":"How did the wives of the Prophet (ﷺ) manage their prayers during times of bleeding?","id":"bukhari-33-34"},{"hadith-eng":"The wives of the Prophet (ﷺ) were with him in the mosque (while he was in I`tikaf) and then they \ndeparted and the Prophet (ﷺ) said to Safiya bint Huyai, \"Don't hurry up, for I shall accompany you,\" (and \nher dwelling was in the house of Usama). The Prophet (ﷺ) went out and in the meantime two Ansari men \nmet him and they looked at the Prophet (ﷺ) and passed by. The Prophet (ﷺ) said to them, \"Come here. She is \n(my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's \nApostle! (we never expect anything bad from you).\" The Prophet (ﷺ) replied, \"Satan circulates in the \nhuman being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in \nyour minds.\"","reference":"Sahih al-Bukhari 2038, Book 33, Hadith 13","grade":"","question #":"question #2","question":"How does Satan influence human thoughts and actions according to Islamic teachings?","id":"bukhari-33-35"},{"hadith-eng":"Safiya went to the Prophet (ﷺ) while he was in I`tikaf. When she returned, the Prophet (ﷺ) accompanied her \nwalking. An Ansari man saw him. When the Prophet (ﷺ) noticed him, he called him and said, \"Come \nhere. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet (ﷺ) had said, \"This is Safiya\"). \nAnd Satan circulates in the body of Adam's offspring as his blood circulates in it.\" \n(A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")","reference":"Sahih al-Bukhari 2039, Book 33, Hadith 14","grade":"","question #":"question #2","question":"How does the concept of Satan's influence relate to human behavior according to Islamic teachings?","id":"bukhari-33-36"},{"hadith-eng":"We practiced I`tikaf with Allah's Messenger (ﷺ) in the middle ten days (of Ramadan). In the morning of the \ntwentieth (of Ramadan) we shifted our baggage, but Allah's Messenger (ﷺ) came to us and said, \"Whoever \nwas m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this \nNight (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky \nwas overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was \ncovered with clouds from the end of that day, and the mosque which was roofed with leafstalks of \ndate palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet (ﷺ) \nand its tip.","reference":"Sahih al-Bukhari 2040, Book 33, Hadith 15","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his commitment to I`tikaf despite adverse weather conditions?","id":"bukhari-33-37"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf every year in the month of Ramadan. And after offering the \nmorning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice \nI`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also \npitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the \nmorning, Allah's Messenger (ﷺ) had finished the morning prayer, he saw four tents and asked, \"What is \nthis?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove \nthe tents, for I do not want to see them.\" So, the tents were removed. The Prophet (ﷺ) did not perform \nI`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.","reference":"Sahih al-Bukhari 2041, Book 33, Hadith 16","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the actions of his wives regarding I`tikaf?","id":"bukhari-33-38"},{"hadith-eng":"`Umar bin Al-Khattab said, \"O Allah's Messenger (ﷺ)! I vowed in the Pre-Islamic period to perform I`tikaf in \nAl-Masjid-al-Haram for one night.\" The Prophet (ﷺ) said, \"Fulfill your vow.\" So, he performed I`tikaf for \none night.","reference":"Sahih al-Bukhari 2042, Book 33, Hadith 17","grade":"","question #":"question #2","question":"How does Islam view the practice of I`tikaf and its importance in spiritual devotion?","id":"bukhari-33-39"},{"hadith-eng":"that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator \nthinks that `Umar vowed to perform I`tikaf for one night.) Allah's Messenger (ﷺ) said to `Umar, \n\"Fulfill your vow.\"","reference":"Sahih al-Bukhari 2043, Book 33, Hadith 18","grade":"","question #":"question #2","question":"How does Islam view the practice of I`tikaf and its importance in worship?","id":"bukhari-33-40"},{"hadith-eng":"The Prophet (ﷺ) used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was \nthe year of his death, he stayed in I`tikaf for twenty days.","reference":"Sahih al-Bukhari 2044, Book 33, Hadith 19","grade":"","question #":"question #2","question":"How did the Prophet Muhammad's practice of I`tikaf change in the year of his death?","id":"bukhari-33-41"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Messenger (ﷺ) used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal.","reference":"Sahih al-Bukhari 2045, Book 33, Hadith 20","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the actions of his wives regarding I`tikaf?","id":"bukhari-33-42"},{"hadith-eng":"Aisha during her menses used to comb and oil the hair of the Prophet (ﷺ) while he used to be in I`tikaf in \nthe mosque. He would stretch out his head towards her while she was in her chamber.","reference":"Sahih al-Bukhari 2046, Book 33, Hadith 21","grade":"","question #":"question #2","question":"How does the interaction between spouses during I'tikaf reflect on their relationship in Islam?","id":"bukhari-33-43"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten days of the month of Ramadan.","reference":"Sahih al-Bukhari 2025, Book 33, Hadith 1","grade":"","question #":"question #3","question":"What are the spiritual benefits associated with performing I'tikaf in Ramadan?","id":"bukhari-33-44"},{"hadith-eng":"(the wife of the Prophet) The Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan till he \ndied and then his wives used to practice I`tikaf after him.","reference":"Sahih al-Bukhari 2026, Book 33, Hadith 2","grade":"","question #":"question #3","question":"What role did the wives of the Prophet play in maintaining the tradition of I`tikaf?","id":"bukhari-33-45"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in \nI`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come \nout of his I`tikaf. The Prophet (ﷺ) said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last \nten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In \nthe dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in \nthe last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque \ndribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and \nwater on the forehead of the Prophet (i.e. in the morning of the twenty-first).","reference":"Sahih al-Bukhari 2027, Book 33, Hadith 3","grade":"","question #":"question #3","question":"What was the Prophet's experience during the Night of Qadr as described in this narration?","id":"bukhari-33-46"},{"hadith-eng":"The Prophet (ﷺ) used to (put) bend his head (out) to me while he was in I`tikaf in the mosque during my \nmonthly periods and I would comb and oil his hair.","reference":"Sahih al-Bukhari 2028, Book 33, Hadith 4","grade":"","question #":"question #3","question":"What can be inferred about the relationship between the Prophet Muhammad (ﷺ) and his wives from this narration?","id":"bukhari-33-47"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) used to let his head in (the house) while he was in the \nmosque and I would comb and oil his hair. When in I`tikaf he used not to enter the house except for a \nneed.","reference":"Sahih al-Bukhari 2029, Book 33, Hadith 5","grade":"","question #":"question #3","question":"What are the limitations on leaving the mosque for someone observing I'tikaf?","id":"bukhari-33-48"},{"hadith-eng":"The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.","reference":"Sahih al-Bukhari 2030, 2031, Book 33, Hadith 6","grade":"","question #":"question #3","question":"How does this narration reflect the Prophet's (ﷺ) approach to cleanliness and personal care during religious observance?","id":"bukhari-33-49"},{"hadith-eng":"The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.","reference":"Sahih al-Bukhari 2030, 2031, Book 33, Hadith 6","grade":"","question #":"question #3","question":"How did the Prophet (ﷺ) maintain personal hygiene during I`tikaf with the help of his wife?","id":"bukhari-33-50"},{"hadith-eng":"`Umar asked the Prophet (ﷺ) \"I vowed in the Pre-Islamic period of ignorance to stay in I`tikaf for one \nnight in Al-Masjid al-Haram.\" The Prophet (ﷺ) said to him, \"Fulfill your vow.\"","reference":"Sahih al-Bukhari 2032, Book 33, Hadith 7","grade":"","question #":"question #3","question":"What is the importance of I`tikaf in Islamic practice?","id":"bukhari-33-51"},{"hadith-eng":"Aisha said, \"the Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a \ntent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the \npermission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab \nbint Jahsh saw it, she pitched another tent. In the morning the Prophet (ﷺ) noticed the tents. He said, \n'What is this?\" He was told of the whole situation. Then the Prophet (ﷺ) said, \"Do you think that they \nintended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and \npracticed I`tikaf for ten days in the month of Shawwal.\"","reference":"Sahih al-Bukhari 2033, Book 33, Hadith 8","grade":"","question #":"question #3","question":"What can be learned from the Prophet's decision to postpone I`tikaf to the month of Shawwal?","id":"bukhari-33-52"},{"hadith-eng":"The Prophet (ﷺ) intended to practice I`tikaf and when he reached the place where he intended to perform \nI`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that \nthey intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf \n(in Ramadan) but performed it in the month of Shawwal for ten days.","reference":"Sahih al-Bukhari 2034, Book 33, Hadith 9","grade":"","question #":"question #3","question":"What can be learned from the Prophet's decision to delay I`tikaf to the month of Shawwal?","id":"bukhari-33-53"},{"hadith-eng":"Safiya, the wife of the Prophet (ﷺ) told me that she went to Allah's Messenger (ﷺ) to visit him in the mosque \nwhile he was in I`tikaf in the last ten days of Ramadan. She had a talk with him for a while, then she \ngot up in order to return home. The Prophet (ﷺ) accompanied her. When they reached the gate of the \nmosque, opposite the door of Um-Salama, two Ansari men were passing by and they greeted Allah's \nApostle . He told them: Do not run away! And said, \"She is (my wife) Safiya bint Huyai.\" Both of \nthem said, \"Subhan Allah, (How dare we think of any evil) O Allah's Messenger (ﷺ)!\" And they felt it. The \nProphet said (to them), \"Satan reaches everywhere in the human body as blood reaches in it, \n(everywhere in one's body). I was afraid lest Satan might insert an evil thought in your minds.\"","reference":"Sahih al-Bukhari 2035, Book 33, Hadith 10","grade":"","question #":"question #3","question":"What is the significance of transparency and clarification in maintaining trust within a community?","id":"bukhari-33-54"},{"hadith-eng":"I asked Abu Sa`id Al-Khudri, \"Did you hear Allah's Messenger (ﷺ) talking about the Night of Qadr?\" He \nreplied in the affirmative and said, \"Once we were in I`tikaf with Allah's Messenger (ﷺ) in the middle ten \ndays of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger (ﷺ)delivered \na sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of \nQadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the \nmonth of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of \nQadr). So, whoever had been in I`tikaf with Allah's Messenger (ﷺ) should return for it.' The people returned \nto the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came \nand it rained. Then the prayer was established (they stood for the prayer) and Allah's Messenger (ﷺ) \nprostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.","reference":"Sahih al-Bukhari 2036, Book 33, Hadith 11","grade":"","question #":"question #3","question":"What role does I`tikaf play in the observance of the last ten nights of Ramadan?","id":"bukhari-33-55"},{"hadith-eng":"One of the wives of Allah's Messenger (ﷺ) practiced I`tikaf with him while she ad bleeding in between her \nperiods and she would see red (blood) or yellowish traces, and sometimes we put a tray beneath her \nwhen she offered the prayer.","reference":"Sahih al-Bukhari 2037, Book 33, Hadith 12","grade":"","question #":"question #3","question":"What measures were taken to maintain cleanliness during prayer in the presence of blood traces?","id":"bukhari-33-56"},{"hadith-eng":"The wives of the Prophet (ﷺ) were with him in the mosque (while he was in I`tikaf) and then they \ndeparted and the Prophet (ﷺ) said to Safiya bint Huyai, \"Don't hurry up, for I shall accompany you,\" (and \nher dwelling was in the house of Usama). The Prophet (ﷺ) went out and in the meantime two Ansari men \nmet him and they looked at the Prophet (ﷺ) and passed by. The Prophet (ﷺ) said to them, \"Come here. She is \n(my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's \nApostle! (we never expect anything bad from you).\" The Prophet (ﷺ) replied, \"Satan circulates in the \nhuman being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in \nyour minds.\"","reference":"Sahih al-Bukhari 2038, Book 33, Hadith 13","grade":"","question #":"question #3","question":"Why is it important to clarify situations to avoid misconceptions in social interactions?","id":"bukhari-33-57"},{"hadith-eng":"Safiya went to the Prophet (ﷺ) while he was in I`tikaf. When she returned, the Prophet (ﷺ) accompanied her \nwalking. An Ansari man saw him. When the Prophet (ﷺ) noticed him, he called him and said, \"Come \nhere. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet (ﷺ) had said, \"This is Safiya\"). \nAnd Satan circulates in the body of Adam's offspring as his blood circulates in it.\" \n(A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")","reference":"Sahih al-Bukhari 2039, Book 33, Hadith 14","grade":"","question #":"question #3","question":"What is the significance of transparency and clarification in maintaining trust within a community?","id":"bukhari-33-58"},{"hadith-eng":"We practiced I`tikaf with Allah's Messenger (ﷺ) in the middle ten days (of Ramadan). In the morning of the \ntwentieth (of Ramadan) we shifted our baggage, but Allah's Messenger (ﷺ) came to us and said, \"Whoever \nwas m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this \nNight (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky \nwas overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was \ncovered with clouds from the end of that day, and the mosque which was roofed with leafstalks of \ndate palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet (ﷺ) \nand its tip.","reference":"Sahih al-Bukhari 2040, Book 33, Hadith 15","grade":"","question #":"question #3","question":"What is the importance of the Night of Qadr in Islamic tradition?","id":"bukhari-33-59"},{"hadith-eng":"Allah's Messenger (ﷺ) used to practice I`tikaf every year in the month of Ramadan. And after offering the \nmorning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice \nI`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also \npitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the \nmorning, Allah's Messenger (ﷺ) had finished the morning prayer, he saw four tents and asked, \"What is \nthis?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove \nthe tents, for I do not want to see them.\" So, the tents were removed. The Prophet (ﷺ) did not perform \nI`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.","reference":"Sahih al-Bukhari 2041, Book 33, Hadith 16","grade":"","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) approach to religious practices and intentions from this incident?","id":"bukhari-33-60"},{"hadith-eng":"`Umar bin Al-Khattab said, \"O Allah's Messenger (ﷺ)! I vowed in the Pre-Islamic period to perform I`tikaf in \nAl-Masjid-al-Haram for one night.\" The Prophet (ﷺ) said, \"Fulfill your vow.\" So, he performed I`tikaf for \none night.","reference":"Sahih al-Bukhari 2042, Book 33, Hadith 17","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the fulfillment of vows made in different circumstances?","id":"bukhari-33-61"},{"hadith-eng":"that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator \nthinks that `Umar vowed to perform I`tikaf for one night.) Allah's Messenger (ﷺ) said to `Umar, \n\"Fulfill your vow.\"","reference":"Sahih al-Bukhari 2043, Book 33, Hadith 18","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding the fulfillment of vows made in the past?","id":"bukhari-33-62"},{"hadith-eng":"The Prophet (ﷺ) used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was \nthe year of his death, he stayed in I`tikaf for twenty days.","reference":"Sahih al-Bukhari 2044, Book 33, Hadith 19","grade":"","question #":"question #3","question":"What can be learned from the Prophet's dedication to I`tikaf in terms of spiritual practice?","id":"bukhari-33-63"},{"hadith-eng":"Allah's Messenger (ﷺ) mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Messenger (ﷺ) used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal.","reference":"Sahih al-Bukhari 2045, Book 33, Hadith 20","grade":"","question #":"question #3","question":"What can be learned about the intentions behind religious practices from this incident involving the Prophet's wives?","id":"bukhari-33-64"},{"hadith-eng":"Aisha during her menses used to comb and oil the hair of the Prophet (ﷺ) while he used to be in I`tikaf in \nthe mosque. He would stretch out his head towards her while she was in her chamber.","reference":"Sahih al-Bukhari 2046, Book 33, Hadith 21","grade":"","question #":"question #3","question":"What does this narration indicate about the role of women in supporting their husbands during religious observances?","id":"bukhari-33-65"}]