[{"hadith-eng":"The Prophet (ﷺ) said, \"When a Muslim spends something on his family intending to receive Allah's \nreward it is regarded as Sadaqa for him.\"","reference":"Sahih al-Bukhari 5351, Book 69, Hadith 1","grade":"","question #":"question #1","question":"How can spending on one's family be considered an act of charity in Islam?","id":"bukhari-69-1"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah said, 'O son of Adam! Spend, and I shall spend on you.\"","reference":"Sahih al-Bukhari 5352, Book 69, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of spending in the path of Allah according to Islamic teachings?","id":"bukhari-69-2"},{"hadith-eng":"The Prophet (ﷺ) said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who \nfights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"","reference":"Sahih al-Bukhari 5353, Book 69, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of caring for widows and the poor in Islam?","id":"bukhari-69-3"},{"hadith-eng":"The Prophet (ﷺ) visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all \nmy property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of \nit?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors \nwealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for \nyou, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, \nso that some people may benefit by you and others be harmed by you.\"","reference":"Sahih al-Bukhari 5354, Book 69, Hadith 4","grade":"","question #":"question #1","question":"What is the maximum portion of one's property that can be bequeathed according to Islamic teachings?","id":"bukhari-69-4"},{"hadith-eng":"\"The Prophet (ﷺ) said, 'The best alms is that which is given when one is rich, and a giving hand is better \nthan a taking one, and you should start first to support your dependents.' A wife says, 'You should \neither provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son \nsays, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that \nfrom Allah's Messenger (ﷺ) ?\" He said, \"No, it is from my own self.\"","reference":"Sahih al-Bukhari 5355, Book 69, Hadith 5","grade":"","question #":"question #1","question":"What is considered the best form of charity in terms of timing and financial status?","id":"bukhari-69-5"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best alms is that which you give when you are rich, and you should start \nfirst to support your dependants.\"","reference":"Sahih al-Bukhari 5356, Book 69, Hadith 6","grade":"","question #":"question #1","question":"What is considered the best form of charity in terms of timing and financial status?","id":"bukhari-69-6"},{"hadith-eng":"The Prophet (ﷺ) used to sell the dates of the garden of Bani An-Nadir and store for his family so much \nfood as would cover their needs for a whole year.","reference":"Sahih al-Bukhari 5357, Book 69, Hadith 7","grade":"","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) manage the resources of the garden of Bani An-Nadir?","id":"bukhari-69-7"},{"hadith-eng":"Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, \nYarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are \nseeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, \nand sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and \n`Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. \n`Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and \nhis companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" \n`Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand \nfast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, \nbut whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The \ngroup said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both \nby Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" \n`Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of \nthis property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah \nhas bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either \ncavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to \nAllah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and \ndeprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. \nAnd out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and \nwhatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. \nAllah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you \nknow that?\" \nThey said, \"Yes.\" \nThen `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \n\"Yes.\" \n`Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of \nAllah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used \nto do, and both of you knew all about it then.\" \nThen `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! \nBut Allah knows that he was honest, sincere, pious and right (in that matter). \nThen Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' \nSo I kept this property in my possession for the first two years of my rule, and I used to do the same \nwith it as Allah's Messenger (ﷺ) and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me \nwith the same claim and the same problem. (O `Abbas!) You came to me demanding your share from \n(the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from \n(the inheritance of) her father. \nSo I said to you, 'If you wish I will hand over this property to you, on condition that you both promise \nme before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr did, and as \nI have done since the beginning of my rule; otherwise you should not speak to me about it.' So you \nboth said, 'Hand over this property to us on this condition.' And on this condition I handed it over to \nyou. \nI beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you \nboth on that condition?\" They both said, \"Yes.\" \n`Umar added, \"Do you want me now to give a decision other than that? By Him with Whose \npermission (order) both the Heaven and the Earth stand fast, I will never give any decision other than \nthat till the Hour is established! But if you are unable to manage it (that property), then return it to me \nand I will be sufficient for it on your behalf . \"","reference":"Sahih al-Bukhari 5358, Book 69, Hadith 8","grade":"","question #":"question #1","question":"What was the stance of the Prophet Muhammad (ﷺ) regarding the inheritance of property by his heirs?","id":"bukhari-69-8"},{"hadith-eng":"Hind bint `Utba came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser so is it sinful of me to feed \nour children from his property?\" Allah's Messenger (ﷺ) said, \"No except if you take for your needs what is \njust and reasonable. \"","reference":"Sahih al-Bukhari 5359, Book 69, Hadith 9","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding taking from a spouse's wealth for family needs?","id":"bukhari-69-9"},{"hadith-eng":"The Prophet (ﷺ) said, \"If the wife gives of her husband's property (something in charity) without his \npermission, he will get half the reward.\"","reference":"Sahih al-Bukhari 5360, Book 69, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of a wife's actions in giving charity from her husband's property without his permission?","id":"bukhari-69-10"},{"hadith-eng":"Fatima went to the Prophet (ﷺ) complaining about the bad effect of the stone hand-mill on her hand. She \nheard that the Prophet (ﷺ) had received a few slave girls. But (when she came there) she did not find him, \nso she mentioned her problem to `Aisha. When the Prophet (ﷺ) came, `Aisha informed him about that. \n`Ali added, \"So the Prophet (ﷺ) came to us when we had gone to bed. We wanted to get up (on his arrival) \nbut he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of \nhis feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have \nrequested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three \ntimes, and Allahu Akbar' thirty four times, for that is better for you than a servant.\"","reference":"Sahih al-Bukhari 5361, Book 69, Hadith 11","grade":"","question #":"question #1","question":"What alternative did the Prophet Muhammad (ﷺ) suggest to Fatima instead of receiving a servant?","id":"bukhari-69-11"},{"hadith-eng":"Fatima came to the Prophet (ﷺ) asking for a servant. He said, \"May I inform you of something better than \r\nthat? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three \r\ntimes, and 'Allahu Akbar' thirty four times. `Ali added, 'I have never failed to recite it ever since.\" \r\nSomebody asked, \"Even on the night of the battle of Siffin?\" He said, \"Even on the night of the battle of Siffin.\"","reference":"Sahih al-Bukhari 5362, Book 69, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of reciting specific phrases before sleeping in Islamic tradition?","id":"bukhari-69-12"},{"hadith-eng":"I asked `Aisha \"What did the Prophet (ﷺ) use to do at home?\" She said, \"He used to work for his family, \nand when he heard the Adhan (call for the prayer), he would go out.\"","reference":"Sahih al-Bukhari 5363, Book 69, Hadith 13","grade":"","question #":"question #1","question":"What activities did the Prophet engage in while at home with his family?","id":"bukhari-69-13"},{"hadith-eng":"Hind bint `Utba said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser and he does not give me what is \nsufficient for me and my children. Can I take of his property without his knowledge?\" The Prophet (ﷺ) \nsaid, \"Take what is sufficient for you and your children, and the amount should be just and reasonable.","reference":"Sahih al-Bukhari 5364, Book 69, Hadith 14","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding taking property from a spouse without their knowledge?","id":"bukhari-69-14"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best women among the camel riders, are the women of Quraish.\" (Another \nnarrator said) The Prophet (ﷺ) said, \"The righteous among the women of Quraish are those who are kind \nto their young ones and who look after their husband's property . \"","reference":"Sahih al-Bukhari 5365, Book 69, Hadith 15","grade":"","question #":"question #1","question":"What qualities are highlighted as virtuous among the women of Quraish?","id":"bukhari-69-15"},{"hadith-eng":"The Prophet (ﷺ) gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and \ndistributed it among my women-folk.","reference":"Sahih al-Bukhari 5366, Book 69, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of the Prophet's reaction to wearing silk for men in Islam?","id":"bukhari-69-16"},{"hadith-eng":"My father died and left seven or nine girls and I married a matron. Allah's Messenger (ﷺ) said to me, \"O \nJabir! Have you married?\" I said, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"A matron.\" he \nsaid, \"Why not a virgin, so that you might play with her and she with you, and you might amuse her \nand she amuse you.\" I said, \" `Abdullah (my father) died and left girls, and I dislike to marry a girl \nlike them, so I married a lady (matron) so that she may look after them.\" On that he said, \"May Allah \nbless you,\" or \"That is good.\"","reference":"Sahih al-Bukhari 5367, Book 69, Hadith 17","grade":"","question #":"question #1","question":"What considerations might influence a person's choice between marrying a virgin or a matron?","id":"bukhari-69-17"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"Why?\" He said, \"I had sexual \nintercourse with my wife while fasting (in the month of Ramadan).\" The Prophet (ﷺ) said to him, \n\"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet (ﷺ) said, \"Then fast for \ntwo successive months.\" He said, \"I cannot.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\" He \nsaid, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet (ﷺ) . \nHe said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet (ﷺ) said (to him), \"Give this \n(basket of dates) in charity (as expiation).\" He said, \"O Allah's Messenger (ﷺ)! Shall I give it to poorer \npeople than us? By Him Who sent you with the Truth, there is no family between Medina's two \nmountains poorer than us.\" The Prophet (ﷺ) smiled till his pre-molar teeth became visible. He then said, \n\"Then take it.\"","reference":"Sahih al-Bukhari 5368, Book 69, Hadith 18","grade":"","question #":"question #1","question":"What are the options for expiation if someone breaks their fast during Ramadan by having sexual intercourse?","id":"bukhari-69-18"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! Shall I get a reward (in the Hereafter) if I spend on the children of Abu \nSalama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The \nProphet said, \"Yes, you will be rewarded for that which you will spend on them.\"","reference":"Sahih al-Bukhari 5369, Book 69, Hadith 19","grade":"","question #":"question #1","question":"What is the significance of spending on stepchildren or children under one's care in Islam?","id":"bukhari-69-19"},{"hadith-eng":"Hind (bint `Utba) said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I take of his \nproperty what will cover me and my children's needs?\" The Prophet (ﷺ) said, \"Take (according to your \nneeds) in a reasonable manner.\"","reference":"Sahih al-Bukhari 5370, Book 69, Hadith 20","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding taking from a spouse's wealth for personal and family needs?","id":"bukhari-69-20"},{"hadith-eng":"A dead man in debt used to be brought to Allah's Messenger (ﷺ) who would ask, \"Has he left anything to re \npay his debts?\" If he was informed that he had left something to cover his debts the Prophet (ﷺ) would \noffer the funeral prayer for him; otherwise he would say to the Muslims present there), \"Offer the \nfuneral prayer for your friend:\"but when Allah helped the Prophet (ﷺ) to gain victory (on his expeditions), \nhe said, \"I am closer to the Believers than themselves, so. if one of the Believers dies in debt, I will \nrepay it, but if he leaves wealth, it will be for his heirs.","reference":"Sahih al-Bukhari 5371, Book 69, Hadith 21","grade":"","question #":"question #1","question":"What was the Prophet Muhammad's (ﷺ) approach to offering funeral prayers for those who died in debt?","id":"bukhari-69-21"},{"hadith-eng":"(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Will you marry my sister, the daughter of Abu \nSufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the \nperson I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \n\"O Allah's Messenger (ﷺ)! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He \nsaid, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, \nshe is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. \nSo you should not present to me your daughters and sisters.\" \nNarrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.","reference":"Sahih al-Bukhari 5372, Book 69, Hadith 22","grade":"","question #":"question #1","question":"What are the restrictions on marrying relatives in Islam as demonstrated in this narration?","id":"bukhari-69-22"},{"hadith-eng":"The Prophet (ﷺ) said, \"When a Muslim spends something on his family intending to receive Allah's \nreward it is regarded as Sadaqa for him.\"","reference":"Sahih al-Bukhari 5351, Book 69, Hadith 1","grade":"","question #":"question #2","question":"What intention should a Muslim have when providing for their family to earn Allah's reward?","id":"bukhari-69-23"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah said, 'O son of Adam! Spend, and I shall spend on you.\"","reference":"Sahih al-Bukhari 5352, Book 69, Hadith 2","grade":"","question #":"question #2","question":"How does Allah promise to reward those who spend in His cause?","id":"bukhari-69-24"},{"hadith-eng":"The Prophet (ﷺ) said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who \nfights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"","reference":"Sahih al-Bukhari 5353, Book 69, Hadith 3","grade":"","question #":"question #2","question":"How is supporting vulnerable individuals compared to acts of worship in Islam?","id":"bukhari-69-25"},{"hadith-eng":"The Prophet (ﷺ) visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all \nmy property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of \nit?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors \nwealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for \nyou, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, \nso that some people may benefit by you and others be harmed by you.\"","reference":"Sahih al-Bukhari 5354, Book 69, Hadith 4","grade":"","question #":"question #2","question":"Why is it recommended to leave one's inheritors wealthy rather than poor?","id":"bukhari-69-26"},{"hadith-eng":"\"The Prophet (ﷺ) said, 'The best alms is that which is given when one is rich, and a giving hand is better \nthan a taking one, and you should start first to support your dependents.' A wife says, 'You should \neither provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son \nsays, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that \nfrom Allah's Messenger (ﷺ) ?\" He said, \"No, it is from my own self.\"","reference":"Sahih al-Bukhari 5355, Book 69, Hadith 5","grade":"","question #":"question #2","question":"Why is a giving hand considered better than a taking one in the context of charity?","id":"bukhari-69-27"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best alms is that which you give when you are rich, and you should start \nfirst to support your dependants.\"","reference":"Sahih al-Bukhari 5356, Book 69, Hadith 6","grade":"","question #":"question #2","question":"Why is it important to prioritize supporting one's dependents when giving charity?","id":"bukhari-69-28"},{"hadith-eng":"The Prophet (ﷺ) used to sell the dates of the garden of Bani An-Nadir and store for his family so much \nfood as would cover their needs for a whole year.","reference":"Sahih al-Bukhari 5357, Book 69, Hadith 7","grade":"","question #":"question #2","question":"What practices did the Prophet (ﷺ) follow to ensure his family's sustenance for a year?","id":"bukhari-69-29"},{"hadith-eng":"Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, \nYarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are \nseeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, \nand sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and \n`Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. \n`Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and \nhis companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" \n`Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand \nfast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, \nbut whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The \ngroup said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both \nby Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" \n`Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of \nthis property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah \nhas bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either \ncavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to \nAllah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and \ndeprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. \nAnd out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and \nwhatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. \nAllah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you \nknow that?\" \nThey said, \"Yes.\" \nThen `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \n\"Yes.\" \n`Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of \nAllah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used \nto do, and both of you knew all about it then.\" \nThen `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! \nBut Allah knows that he was honest, sincere, pious and right (in that matter). \nThen Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' \nSo I kept this property in my possession for the first two years of my rule, and I used to do the same \nwith it as Allah's Messenger (ﷺ) and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me \nwith the same claim and the same problem. (O `Abbas!) You came to me demanding your share from \n(the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from \n(the inheritance of) her father. \nSo I said to you, 'If you wish I will hand over this property to you, on condition that you both promise \nme before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr did, and as \nI have done since the beginning of my rule; otherwise you should not speak to me about it.' So you \nboth said, 'Hand over this property to us on this condition.' And on this condition I handed it over to \nyou. \nI beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you \nboth on that condition?\" They both said, \"Yes.\" \n`Umar added, \"Do you want me now to give a decision other than that? By Him with Whose \npermission (order) both the Heaven and the Earth stand fast, I will never give any decision other than \nthat till the Hour is established! But if you are unable to manage it (that property), then return it to me \nand I will be sufficient for it on your behalf . \"","reference":"Sahih al-Bukhari 5358, Book 69, Hadith 8","grade":"","question #":"question #2","question":"How did Abu Bakr and Umar manage the property left by the Prophet Muhammad (ﷺ) after his passing?","id":"bukhari-69-30"},{"hadith-eng":"Hind bint `Utba came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser so is it sinful of me to feed \nour children from his property?\" Allah's Messenger (ﷺ) said, \"No except if you take for your needs what is \njust and reasonable. \"","reference":"Sahih al-Bukhari 5359, Book 69, Hadith 9","grade":"","question #":"question #2","question":"How does Islam define what is just and reasonable in the context of family financial support?","id":"bukhari-69-31"},{"hadith-eng":"The Prophet (ﷺ) said, \"If the wife gives of her husband's property (something in charity) without his \npermission, he will get half the reward.\"","reference":"Sahih al-Bukhari 5360, Book 69, Hadith 10","grade":"","question #":"question #2","question":"How is the reward for charity distributed between a husband and wife when the wife gives from the husband's property without his consent?","id":"bukhari-69-32"},{"hadith-eng":"Fatima went to the Prophet (ﷺ) complaining about the bad effect of the stone hand-mill on her hand. She \nheard that the Prophet (ﷺ) had received a few slave girls. But (when she came there) she did not find him, \nso she mentioned her problem to `Aisha. When the Prophet (ﷺ) came, `Aisha informed him about that. \n`Ali added, \"So the Prophet (ﷺ) came to us when we had gone to bed. We wanted to get up (on his arrival) \nbut he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of \nhis feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have \nrequested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three \ntimes, and Allahu Akbar' thirty four times, for that is better for you than a servant.\"","reference":"Sahih al-Bukhari 5361, Book 69, Hadith 11","grade":"","question #":"question #2","question":"How can reciting certain phrases before sleeping benefit a person according to Islamic teachings?","id":"bukhari-69-33"},{"hadith-eng":"Fatima came to the Prophet (ﷺ) asking for a servant. He said, \"May I inform you of something better than \r\nthat? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three \r\ntimes, and 'Allahu Akbar' thirty four times. `Ali added, 'I have never failed to recite it ever since.\" \r\nSomebody asked, \"Even on the night of the battle of Siffin?\" He said, \"Even on the night of the battle of Siffin.\"","reference":"Sahih al-Bukhari 5362, Book 69, Hadith 12","grade":"","question #":"question #2","question":"How can the practice of dhikr be beneficial in times of hardship or battle?","id":"bukhari-69-34"},{"hadith-eng":"I asked `Aisha \"What did the Prophet (ﷺ) use to do at home?\" She said, \"He used to work for his family, \nand when he heard the Adhan (call for the prayer), he would go out.\"","reference":"Sahih al-Bukhari 5363, Book 69, Hadith 13","grade":"","question #":"question #2","question":"How did the Prophet respond to the call for prayer when he was at home?","id":"bukhari-69-35"},{"hadith-eng":"Hind bint `Utba said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser and he does not give me what is \nsufficient for me and my children. Can I take of his property without his knowledge?\" The Prophet (ﷺ) \nsaid, \"Take what is sufficient for you and your children, and the amount should be just and reasonable.","reference":"Sahih al-Bukhari 5364, Book 69, Hadith 14","grade":"","question #":"question #2","question":"How does Islam address the issue of financial responsibility within a marriage?","id":"bukhari-69-36"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best women among the camel riders, are the women of Quraish.\" (Another \nnarrator said) The Prophet (ﷺ) said, \"The righteous among the women of Quraish are those who are kind \nto their young ones and who look after their husband's property . \"","reference":"Sahih al-Bukhari 5365, Book 69, Hadith 15","grade":"","question #":"question #2","question":"How does the hadith describe the role of women in caring for their family and property?","id":"bukhari-69-37"},{"hadith-eng":"The Prophet (ﷺ) gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and \ndistributed it among my women-folk.","reference":"Sahih al-Bukhari 5366, Book 69, Hadith 16","grade":"","question #":"question #2","question":"How should one respond to the Prophet's disapproval or anger in a situation?","id":"bukhari-69-38"},{"hadith-eng":"My father died and left seven or nine girls and I married a matron. Allah's Messenger (ﷺ) said to me, \"O \nJabir! Have you married?\" I said, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"A matron.\" he \nsaid, \"Why not a virgin, so that you might play with her and she with you, and you might amuse her \nand she amuse you.\" I said, \" `Abdullah (my father) died and left girls, and I dislike to marry a girl \nlike them, so I married a lady (matron) so that she may look after them.\" On that he said, \"May Allah \nbless you,\" or \"That is good.\"","reference":"Sahih al-Bukhari 5367, Book 69, Hadith 17","grade":"","question #":"question #2","question":"How can marriage decisions be influenced by family responsibilities and obligations?","id":"bukhari-69-39"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"Why?\" He said, \"I had sexual \nintercourse with my wife while fasting (in the month of Ramadan).\" The Prophet (ﷺ) said to him, \n\"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet (ﷺ) said, \"Then fast for \ntwo successive months.\" He said, \"I cannot.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\" He \nsaid, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet (ﷺ) . \nHe said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet (ﷺ) said (to him), \"Give this \n(basket of dates) in charity (as expiation).\" He said, \"O Allah's Messenger (ﷺ)! Shall I give it to poorer \npeople than us? By Him Who sent you with the Truth, there is no family between Medina's two \nmountains poorer than us.\" The Prophet (ﷺ) smiled till his pre-molar teeth became visible. He then said, \n\"Then take it.\"","reference":"Sahih al-Bukhari 5368, Book 69, Hadith 18","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate compassion and understanding in dealing with those who cannot afford the prescribed expiation?","id":"bukhari-69-40"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! Shall I get a reward (in the Hereafter) if I spend on the children of Abu \nSalama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The \nProphet said, \"Yes, you will be rewarded for that which you will spend on them.\"","reference":"Sahih al-Bukhari 5369, Book 69, Hadith 19","grade":"","question #":"question #2","question":"How does Islam view the act of treating stepchildren as one's own in terms of reward?","id":"bukhari-69-41"},{"hadith-eng":"Hind (bint `Utba) said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I take of his \nproperty what will cover me and my children's needs?\" The Prophet (ﷺ) said, \"Take (according to your \nneeds) in a reasonable manner.\"","reference":"Sahih al-Bukhari 5370, Book 69, Hadith 20","grade":"","question #":"question #2","question":"How does Islam address the issue of miserliness within a marriage?","id":"bukhari-69-42"},{"hadith-eng":"A dead man in debt used to be brought to Allah's Messenger (ﷺ) who would ask, \"Has he left anything to re \npay his debts?\" If he was informed that he had left something to cover his debts the Prophet (ﷺ) would \noffer the funeral prayer for him; otherwise he would say to the Muslims present there), \"Offer the \nfuneral prayer for your friend:\"but when Allah helped the Prophet (ﷺ) to gain victory (on his expeditions), \nhe said, \"I am closer to the Believers than themselves, so. if one of the Believers dies in debt, I will \nrepay it, but if he leaves wealth, it will be for his heirs.","reference":"Sahih al-Bukhari 5371, Book 69, Hadith 21","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle the debts of deceased believers after gaining victory in his expeditions?","id":"bukhari-69-43"},{"hadith-eng":"(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Will you marry my sister, the daughter of Abu \nSufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the \nperson I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \n\"O Allah's Messenger (ﷺ)! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He \nsaid, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, \nshe is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. \nSo you should not present to me your daughters and sisters.\" \nNarrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.","reference":"Sahih al-Bukhari 5372, Book 69, Hadith 22","grade":"","question #":"question #2","question":"How does the concept of foster relationships affect marriage eligibility in Islamic law?","id":"bukhari-69-44"},{"hadith-eng":"The Prophet (ﷺ) said, \"When a Muslim spends something on his family intending to receive Allah's \nreward it is regarded as Sadaqa for him.\"","reference":"Sahih al-Bukhari 5351, Book 69, Hadith 1","grade":"","question #":"question #3","question":"In what ways does Islam encourage financial responsibility towards one's family?","id":"bukhari-69-45"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Allah said, 'O son of Adam! Spend, and I shall spend on you.\"","reference":"Sahih al-Bukhari 5352, Book 69, Hadith 2","grade":"","question #":"question #3","question":"What is the relationship between human generosity and divine provision in Islam?","id":"bukhari-69-46"},{"hadith-eng":"The Prophet (ﷺ) said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who \nfights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"","reference":"Sahih al-Bukhari 5353, Book 69, Hadith 3","grade":"","question #":"question #3","question":"What are the rewards for those who assist widows and the needy according to Islamic teachings?","id":"bukhari-69-47"},{"hadith-eng":"The Prophet (ﷺ) visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all \nmy property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of \nit?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors \nwealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for \nyou, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, \nso that some people may benefit by you and others be harmed by you.\"","reference":"Sahih al-Bukhari 5354, Book 69, Hadith 4","grade":"","question #":"question #3","question":"How is spending on one's family considered in terms of charity in Islam?","id":"bukhari-69-48"},{"hadith-eng":"\"The Prophet (ﷺ) said, 'The best alms is that which is given when one is rich, and a giving hand is better \nthan a taking one, and you should start first to support your dependents.' A wife says, 'You should \neither provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son \nsays, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that \nfrom Allah's Messenger (ﷺ) ?\" He said, \"No, it is from my own self.\"","reference":"Sahih al-Bukhari 5355, Book 69, Hadith 5","grade":"","question #":"question #3","question":"What responsibilities does one have towards their dependents according to Islamic teachings?","id":"bukhari-69-49"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best alms is that which you give when you are rich, and you should start \nfirst to support your dependants.\"","reference":"Sahih al-Bukhari 5356, Book 69, Hadith 6","grade":"","question #":"question #3","question":"How does one's financial status affect the value of their charitable acts?","id":"bukhari-69-50"},{"hadith-eng":"The Prophet (ﷺ) used to sell the dates of the garden of Bani An-Nadir and store for his family so much \nfood as would cover their needs for a whole year.","reference":"Sahih al-Bukhari 5357, Book 69, Hadith 7","grade":"","question #":"question #3","question":"What can be learned about the economic practices of the Prophet (ﷺ) from his dealings with the dates of Bani An-Nadir?","id":"bukhari-69-51"},{"hadith-eng":"Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, \nYarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are \nseeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, \nand sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and \n`Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. \n`Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and \nhis companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" \n`Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand \nfast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, \nbut whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The \ngroup said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both \nby Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" \n`Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of \nthis property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah \nhas bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either \ncavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to \nAllah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and \ndeprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. \nAnd out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and \nwhatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. \nAllah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you \nknow that?\" \nThey said, \"Yes.\" \nThen `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \n\"Yes.\" \n`Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of \nAllah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used \nto do, and both of you knew all about it then.\" \nThen `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! \nBut Allah knows that he was honest, sincere, pious and right (in that matter). \nThen Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' \nSo I kept this property in my possession for the first two years of my rule, and I used to do the same \nwith it as Allah's Messenger (ﷺ) and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me \nwith the same claim and the same problem. (O `Abbas!) You came to me demanding your share from \n(the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from \n(the inheritance of) her father. \nSo I said to you, 'If you wish I will hand over this property to you, on condition that you both promise \nme before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr did, and as \nI have done since the beginning of my rule; otherwise you should not speak to me about it.' So you \nboth said, 'Hand over this property to us on this condition.' And on this condition I handed it over to \nyou. \nI beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you \nboth on that condition?\" They both said, \"Yes.\" \n`Umar added, \"Do you want me now to give a decision other than that? By Him with Whose \npermission (order) both the Heaven and the Earth stand fast, I will never give any decision other than \nthat till the Hour is established! But if you are unable to manage it (that property), then return it to me \nand I will be sufficient for it on your behalf . \"","reference":"Sahih al-Bukhari 5358, Book 69, Hadith 8","grade":"","question #":"question #3","question":"What conditions did Umar set for Ali and Abbas regarding the management of the Prophet's property?","id":"bukhari-69-52"},{"hadith-eng":"Hind bint `Utba came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser so is it sinful of me to feed \nour children from his property?\" Allah's Messenger (ﷺ) said, \"No except if you take for your needs what is \njust and reasonable. \"","reference":"Sahih al-Bukhari 5359, Book 69, Hadith 9","grade":"","question #":"question #3","question":"What are the ethical considerations in Islam when dealing with a miserly spouse?","id":"bukhari-69-53"},{"hadith-eng":"The Prophet (ﷺ) said, \"If the wife gives of her husband's property (something in charity) without his \npermission, he will get half the reward.\"","reference":"Sahih al-Bukhari 5360, Book 69, Hadith 10","grade":"","question #":"question #3","question":"What are the implications of a wife giving charity from her husband's property in terms of Islamic teachings on ownership and reward?","id":"bukhari-69-54"},{"hadith-eng":"Fatima went to the Prophet (ﷺ) complaining about the bad effect of the stone hand-mill on her hand. She \nheard that the Prophet (ﷺ) had received a few slave girls. But (when she came there) she did not find him, \nso she mentioned her problem to `Aisha. When the Prophet (ﷺ) came, `Aisha informed him about that. \n`Ali added, \"So the Prophet (ﷺ) came to us when we had gone to bed. We wanted to get up (on his arrival) \nbut he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of \nhis feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have \nrequested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three \ntimes, and Allahu Akbar' thirty four times, for that is better for you than a servant.\"","reference":"Sahih al-Bukhari 5361, Book 69, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of the specific number of times phrases are recited in Islamic practices?","id":"bukhari-69-55"},{"hadith-eng":"Fatima came to the Prophet (ﷺ) asking for a servant. He said, \"May I inform you of something better than \r\nthat? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three \r\ntimes, and 'Allahu Akbar' thirty four times. `Ali added, 'I have never failed to recite it ever since.\" \r\nSomebody asked, \"Even on the night of the battle of Siffin?\" He said, \"Even on the night of the battle of Siffin.\"","reference":"Sahih al-Bukhari 5362, Book 69, Hadith 12","grade":"","question #":"question #3","question":"What alternative did the Prophet Muhammad (ﷺ) offer instead of a servant to Fatima?","id":"bukhari-69-56"},{"hadith-eng":"I asked `Aisha \"What did the Prophet (ﷺ) use to do at home?\" She said, \"He used to work for his family, \nand when he heard the Adhan (call for the prayer), he would go out.\"","reference":"Sahih al-Bukhari 5363, Book 69, Hadith 13","grade":"","question #":"question #3","question":"What can be learned about the Prophet's balance between family life and religious duties?","id":"bukhari-69-57"},{"hadith-eng":"Hind bint `Utba said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser and he does not give me what is \nsufficient for me and my children. Can I take of his property without his knowledge?\" The Prophet (ﷺ) \nsaid, \"Take what is sufficient for you and your children, and the amount should be just and reasonable.","reference":"Sahih al-Bukhari 5364, Book 69, Hadith 14","grade":"","question #":"question #3","question":"What are the ethical considerations in Islam when dealing with a miserly spouse?","id":"bukhari-69-58"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The best women among the camel riders, are the women of Quraish.\" (Another \nnarrator said) The Prophet (ﷺ) said, \"The righteous among the women of Quraish are those who are kind \nto their young ones and who look after their husband's property . \"","reference":"Sahih al-Bukhari 5365, Book 69, Hadith 15","grade":"","question #":"question #3","question":"What significance does the hadith place on kindness towards children in the context of righteousness?","id":"bukhari-69-59"},{"hadith-eng":"The Prophet (ﷺ) gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and \ndistributed it among my women-folk.","reference":"Sahih al-Bukhari 5366, Book 69, Hadith 16","grade":"","question #":"question #3","question":"What is the Islamic ruling on men wearing silk, and how can it be addressed if it occurs?","id":"bukhari-69-60"},{"hadith-eng":"My father died and left seven or nine girls and I married a matron. Allah's Messenger (ﷺ) said to me, \"O \nJabir! Have you married?\" I said, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"A matron.\" he \nsaid, \"Why not a virgin, so that you might play with her and she with you, and you might amuse her \nand she amuse you.\" I said, \" `Abdullah (my father) died and left girls, and I dislike to marry a girl \nlike them, so I married a lady (matron) so that she may look after them.\" On that he said, \"May Allah \nbless you,\" or \"That is good.\"","reference":"Sahih al-Bukhari 5367, Book 69, Hadith 17","grade":"","question #":"question #3","question":"What blessings or approvals can be sought from Allah when making significant life decisions like marriage?","id":"bukhari-69-61"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"Why?\" He said, \"I had sexual \nintercourse with my wife while fasting (in the month of Ramadan).\" The Prophet (ﷺ) said to him, \n\"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet (ﷺ) said, \"Then fast for \ntwo successive months.\" He said, \"I cannot.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\" He \nsaid, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet (ﷺ) . \nHe said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet (ﷺ) said (to him), \"Give this \n(basket of dates) in charity (as expiation).\" He said, \"O Allah's Messenger (ﷺ)! Shall I give it to poorer \npeople than us? By Him Who sent you with the Truth, there is no family between Medina's two \nmountains poorer than us.\" The Prophet (ﷺ) smiled till his pre-molar teeth became visible. He then said, \n\"Then take it.\"","reference":"Sahih al-Bukhari 5368, Book 69, Hadith 18","grade":"","question #":"question #3","question":"What is the significance of charity in the context of expiation for breaking a fast during Ramadan?","id":"bukhari-69-62"},{"hadith-eng":"I said, \"O Allah's Messenger (ﷺ)! Shall I get a reward (in the Hereafter) if I spend on the children of Abu \nSalama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The \nProphet said, \"Yes, you will be rewarded for that which you will spend on them.\"","reference":"Sahih al-Bukhari 5369, Book 69, Hadith 19","grade":"","question #":"question #3","question":"What are the rewards associated with providing for children who are not biologically one's own?","id":"bukhari-69-63"},{"hadith-eng":"Hind (bint `Utba) said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I take of his \nproperty what will cover me and my children's needs?\" The Prophet (ﷺ) said, \"Take (according to your \nneeds) in a reasonable manner.\"","reference":"Sahih al-Bukhari 5370, Book 69, Hadith 20","grade":"","question #":"question #3","question":"What are the ethical considerations in Islam when using someone else's property to fulfill personal needs?","id":"bukhari-69-64"},{"hadith-eng":"A dead man in debt used to be brought to Allah's Messenger (ﷺ) who would ask, \"Has he left anything to re \npay his debts?\" If he was informed that he had left something to cover his debts the Prophet (ﷺ) would \noffer the funeral prayer for him; otherwise he would say to the Muslims present there), \"Offer the \nfuneral prayer for your friend:\"but when Allah helped the Prophet (ﷺ) to gain victory (on his expeditions), \nhe said, \"I am closer to the Believers than themselves, so. if one of the Believers dies in debt, I will \nrepay it, but if he leaves wealth, it will be for his heirs.","reference":"Sahih al-Bukhari 5371, Book 69, Hadith 21","grade":"","question #":"question #3","question":"What is the significance of the Prophet Muhammad (ﷺ) being closer to the believers than themselves in the context of debts and inheritance?","id":"bukhari-69-65"},{"hadith-eng":"(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Will you marry my sister, the daughter of Abu \nSufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the \nperson I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \n\"O Allah's Messenger (ﷺ)! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He \nsaid, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, \nshe is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. \nSo you should not present to me your daughters and sisters.\" \nNarrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.","reference":"Sahih al-Bukhari 5372, Book 69, Hadith 22","grade":"","question #":"question #3","question":"What role does the concept of fosterage play in determining lawful and unlawful marriages in Islam?","id":"bukhari-69-66"}]