[{"hadith-eng":"I came to the Prophet (ﷺ) and he said to me, \"Come near.\" So I went near to him and he said, \"Are your \nlice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of \nfasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting \nshould be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to \nsix poor persons.\"","reference":"Sahih al-Bukhari 6708, Book 84, Hadith 1","grade":"","question #":"question #1","question":"What are the options for expiation when someone is troubled by lice during Hajj or Umrah?","id":"bukhari-84-1"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"What is the matter with you?\" \nHe said, \"I had sexual relation with my wife (while I was fasting) in Ramadan.\" The Prophet (ﷺ) said, \n\"Have you got enough to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two \nsuccessive months?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor persons?\" The \nman said, \"No.\" Then the Prophet (ﷺ) said to him, \"Sit down,\" and he sat down. Afterwards an 'Irq, i.e., a \nbig basket containing dates was brought to the Prophet (ﷺ) and the Prophet (ﷺ) said to him, \"Take this and \ngive it in charity.\" The man said, \"To poorer people than we?\" On that, the Prophet (ﷺ) smiled till his \npremolar teeth became visible, and then told him, \"Feed your family with it.\" (See Hadith No. 157, \nVol 3)","reference":"Sahih al-Bukhari 6709, Book 84, Hadith 2","grade":"","question #":"question #1","question":"What are the expiations for breaking a fast during Ramadan through sexual relations?","id":"bukhari-84-2"},{"hadith-eng":"A man came to Allah's Messenger (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said to him, \"What is the \nmatter?\" He said, \"I have done a sexual relation with my wife (while fasting) in Ramadan.\" The \nProphet said to him?\" \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can \nyou fast for two successive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor \npersons?\" He said, \"No.\" Then an Ansari man came with an Irq (a big basket full of dates). The \nProphet said (to the man), \"Take this (basket) and give it in charity.\" That man said, \"To poorer people \nthan we, O Allah's Messenger (ﷺ)? By Him Who has sent you with the Truth! There is no house in between \nthe two mountains (of the city of Medina) poorer than we.\" So the Prophet (ﷺ) said (to him), \"Go and feed \nit to your family.\"","reference":"Sahih al-Bukhari 6710, Book 84, Hadith 3","grade":"","question #":"question #1","question":"What are the expiations for breaking a fast during Ramadan through sexual relations?","id":"bukhari-84-3"},{"hadith-eng":"A man came to the Prophets and said, \"I am ruined!\" The Prophet (ﷺ) said, \"What is the matter with you?\" \nHe said, \"I have done a sexual relation with my wife (while fasting) in Ramadan\" The Prophet (ﷺ) said to \nhim, \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two \nsuccessive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor persons?\" He said, \"I \nhave nothing.\" Later on an Irq (big basket) containing dates was given to the Prophet, and the Prophet (ﷺ) \nsaid (to him), \"Take this basket and give it in charity.\" The man said, \"To poorer people than we? \nIndeed, there is nobody between its (i.e., Medina's) two mountains who is poorer than we.\" The \nProphet then said, \"Take it and feed your family with it.\"","reference":"Sahih al-Bukhari 6711, Book 84, Hadith 4","grade":"","question #":"question #1","question":"What are the options for expiation if someone breaks their fast during Ramadan through sexual relations?","id":"bukhari-84-4"},{"hadith-eng":"As-Sa'ib bin Yazid said, \"The Sa' at the time of the Prophet (ﷺ) was equal to one Mudd plus one-third of a \nMudd of your time, and then it was increased in the time of Caliph `Umar bin `Abdul `Aziz.\"","reference":"Sahih al-Bukhari 6712, Book 84, Hadith 5","grade":"","question #":"question #1","question":"How did the measurement of the Sa' change from the time of the Prophet to the time of Caliph Umar bin Abdul Aziz?","id":"bukhari-84-5"},{"hadith-eng":"Ibn `Umar used to give the Zakat of Ramadan (Zakat-al-Fitr) according to the Mudd of the Prophet, \nthe first Mudd, and he also used to give things for expiation for oaths according to the Mudd of the \nProphet. Abu Qutaiba said, \"Malik said to us, 'Our Mudd (i.e., of Medina) is better than yours and we \ndo not see any superiority except in the Mudd of the Prophet!' Malik further said, to me, 'If a ruler \ncame to you and fixed a Mudd smaller than the one of the Prophet, by what Mudd would you measure \nwhat you give (for expiation or Zakat-al-Fitr?' I replied, 'We would give it according to the Mudd of \nthe Prophet' On that, Malik said, 'Then, don't you see that we have to revert to the Mudd of the \nProphet ultimately?'\"","reference":"Sahih al-Bukhari 6713, Book 84, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of adhering to the Mudd of the Prophet in giving Zakat-al-Fitr and expiation for oaths?","id":"bukhari-84-6"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, Sa' and Mudd (i.e., of the \npeople of Medina).","reference":"Sahih al-Bukhari 6714, Book 84, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of invoking blessings on the measures of Sa' and Mudd in Islamic tradition?","id":"bukhari-84-7"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of \nhis body for freeing the corresponding parts of the slave's body, even his private parts will be saved \nfrom the Fire) because of freeing the slave's private parts.\"","reference":"Sahih al-Bukhari 6715, Book 84, Hadith 8","grade":"","question #":"question #1","question":"What are the spiritual benefits of manumitting a Muslim slave in Islam?","id":"bukhari-84-8"},{"hadith-eng":"Jabir said: An Ansari man made his slave a Mudabbar and he had no other property than him. When \nthe Prophet (ﷺ) heard of that, he said (to his companions), \"Who wants to buy him (i.e., the slave) for \nme?\" Nu'aim bin An-Nahham bought him for eight hundred Dirhams. I heard Jabir saying, \"That was \na coptic slave who died in the same year.\"","reference":"Sahih al-Bukhari 6716, Book 84, Hadith 9","grade":"","question #":"question #1","question":"What is the concept of Mudabbar in Islamic law and how does it affect the status of a slave?","id":"bukhari-84-9"},{"hadith-eng":"that she intended to buy Barira (a slave girl) and her masters stipulated that they would have her \nWala'. When `Aisha mentioned that to the Prophet (ﷺ) ; he said, \"Buy her, for the Wala' is for the one who \nmanumits.\"","reference":"Sahih al-Bukhari 6717, Book 84, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of the concept of Wala' in Islamic law regarding the manumission of slaves?","id":"bukhari-84-10"},{"hadith-eng":"I went to Allah's Messenger (ﷺ) along with a group of people from (the tribe of) Al-Ash`ari, asking for \nmounts. The Prophet (ﷺ) said, \"By Allah, I will not give you anything to ride, and I have nothing to mount \nyou on.\" We stayed there as long as Allah wished, and after that, some camels were brought to the \nProphet and he ordered that we be given three camels. When we set out, some of us said to others, \n\"Allah will not bless us, as we all went to Allah's Messenger (ﷺ) asking him for mounts, and although he had \nsworn that he would not give us mounts, he did give us.\" So we returned to the Prophet; and \nmentioned that to him. He said, \"I have not provided you with mounts, but Allah has. By Allah, Allah \nwilling, if I ever take an oath, and then see that another is better than the first, I make expiration for \nmy (dissolved) oath, and do what is better and make expiration.\"","reference":"Sahih al-Bukhari 6718, Book 84, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of fulfilling oaths and making expiation if a better option arises?","id":"bukhari-84-11"},{"hadith-eng":"the same narration above (i.e. 709), \"I make expiation for my dissolved oath, and I do what is better, \nor do what is better and make expiation.\"","reference":"Sahih al-Bukhari 6719, Book 84, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of making expiation for a dissolved oath in Islamic teachings?","id":"bukhari-84-12"},{"hadith-eng":"(The Prophet) Solomon said, \"Tonight I will sleep with (my) ninety wives, each of whom will get a \nmale child who will fight for Allah's Cause.\" On that, his companion (Sufyan said that his companion \nwas an angel) said to him, \"Say, \"If Allah will (Allah willing).\" But Solomon forgot (to say it). He \nslept with all his wives, but none of the women gave birth to a child, except one who gave birth to a \nhalfboy. Abu Huraira added: The Prophet (ﷺ) said, \"If Solomon had said, \"If Allah will\" (Allah willing), \nhe would not have been unsuccessful in his action, and would have attained what he had desired.\" \nOnce Abu Huraira added: Allah apostle said, \"If he had accepted.\"","reference":"Sahih al-Bukhari 6720, Book 84, Hadith 13","grade":"","question #":"question #1","question":"What is the significance of saying 'If Allah wills' in Islamic teachings?","id":"bukhari-84-13"},{"hadith-eng":"We were sitting with Abu Musa Al-Ash'sari, and as there were ties of friendship and mutual favors \nbetween us and his tribe. His meal was presented before him and there was chicken meat in it. Among \nthose who were present there was a man from Bani Taimillah having a red complexion as a non-Arab \nfreed slave, and that man did not approach the meal. Abu Musa said to him, \"Come along! I have seen \nAllah's Messenger (ﷺ) eating of that (i.e., chicken).\" The man said, \"I have seen it (chickens) eating \nsomething I regarded as dirty, and so I have taken an oath that I shall not eat (its meat) chicken.\" Abu \nMusa said, \"Come along! I will inform you about it (i.e., your oath). \nOnce we went to Allah's Messenger (ﷺ) in company with a group of Ash'airiyin, asking him for mounts \nwhile he was distributing some camels from the camels of Zakat. (Aiyub said, \"I think he said that the \nProphet was in an angry mood at the time.\") The Prophet (ﷺ) said, 'By Allah! I will not give you mounts, \nand I have nothing to mount you on.' After we had left, some camels of booty were brought to Allah's \nApostle and he said, \"Where are those Ash`ariyin? Where are those Ash`ariyin?\" So we went (to him) \nand he gave us five very fat good-looking camels. We mounted them and went away, and then I said \nto my companions, 'We went to Allah's Messenger (ﷺ) to give us mounts, but he took an oath that he would \nnot give us mounts, and then later on he sent for us and gave us mounts, perhaps Allah's Messenger (ﷺ) \nforgot his oath. By Allah, we will never be successful, for we have taken advantage of the fact that \nAllah's Messenger (ﷺ) forgot to fulfill his oath. So let us return to Allah's Messenger (ﷺ) to remind him of his oath.' \nWe returned and said, 'O Allah's Messenger (ﷺ)! We came to you and asked you for mounts, but you took an \noath that you would not give us mounts) but later on you gave us mounts, and we thought or \nconsidered that you have forgotten your oath.' The Prophet (ﷺ) said, 'Depart, for Allah has given you \nMounts. By Allah, Allah willing, if I take an oath and then later find another thing better than that, I \ndo what is better, and make expiation for the oath.' \"(two other narrations through Zahdam as above)","reference":"Sahih al-Bukhari 6721, Book 84, Hadith 14","grade":"","question #":"question #1","question":"What should one do if they take an oath and later find a better course of action?","id":"bukhari-84-14"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(O `Abdur-Rahman!) Do not seek to be a ruler, for, if you are given the \nauthority of ruling without your asking for it, then Allah will help you; but if you are given it by your \nasking, then you will be held responsible for it (i.e. Allah will not help you ) . And if you take an oath \nto do something and later on find another thing, better than that, then do what is better and make \nexpiation for (the dissolution of) your oath.\"","reference":"Sahih al-Bukhari 6722, Book 84, Hadith 15","grade":"","question #":"question #1","question":"What guidance is provided regarding seeking positions of authority and leadership?","id":"bukhari-84-15"},{"hadith-eng":"I came to the Prophet (ﷺ) and he said to me, \"Come near.\" So I went near to him and he said, \"Are your \nlice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of \nfasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting \nshould be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to \nsix poor persons.\"","reference":"Sahih al-Bukhari 6708, Book 84, Hadith 1","grade":"","question #":"question #2","question":"How does Islamic teaching address personal discomfort and cleanliness during religious rituals?","id":"bukhari-84-16"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"What is the matter with you?\" \nHe said, \"I had sexual relation with my wife (while I was fasting) in Ramadan.\" The Prophet (ﷺ) said, \n\"Have you got enough to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two \nsuccessive months?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor persons?\" The \nman said, \"No.\" Then the Prophet (ﷺ) said to him, \"Sit down,\" and he sat down. Afterwards an 'Irq, i.e., a \nbig basket containing dates was brought to the Prophet (ﷺ) and the Prophet (ﷺ) said to him, \"Take this and \ngive it in charity.\" The man said, \"To poorer people than we?\" On that, the Prophet (ﷺ) smiled till his \npremolar teeth became visible, and then told him, \"Feed your family with it.\" (See Hadith No. 157, \nVol 3)","reference":"Sahih al-Bukhari 6709, Book 84, Hadith 2","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate compassion and understanding in addressing the man's situation?","id":"bukhari-84-17"},{"hadith-eng":"A man came to Allah's Messenger (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said to him, \"What is the \nmatter?\" He said, \"I have done a sexual relation with my wife (while fasting) in Ramadan.\" The \nProphet said to him?\" \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can \nyou fast for two successive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor \npersons?\" He said, \"No.\" Then an Ansari man came with an Irq (a big basket full of dates). The \nProphet said (to the man), \"Take this (basket) and give it in charity.\" That man said, \"To poorer people \nthan we, O Allah's Messenger (ﷺ)? By Him Who has sent you with the Truth! There is no house in between \nthe two mountains (of the city of Medina) poorer than we.\" So the Prophet (ﷺ) said (to him), \"Go and feed \nit to your family.\"","reference":"Sahih al-Bukhari 6710, Book 84, Hadith 3","grade":"","question #":"question #2","question":"How does Islamic teaching address the situation of someone unable to fulfill the prescribed expiations for a sin?","id":"bukhari-84-18"},{"hadith-eng":"A man came to the Prophets and said, \"I am ruined!\" The Prophet (ﷺ) said, \"What is the matter with you?\" \nHe said, \"I have done a sexual relation with my wife (while fasting) in Ramadan\" The Prophet (ﷺ) said to \nhim, \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two \nsuccessive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor persons?\" He said, \"I \nhave nothing.\" Later on an Irq (big basket) containing dates was given to the Prophet, and the Prophet (ﷺ) \nsaid (to him), \"Take this basket and give it in charity.\" The man said, \"To poorer people than we? \nIndeed, there is nobody between its (i.e., Medina's) two mountains who is poorer than we.\" The \nProphet then said, \"Take it and feed your family with it.\"","reference":"Sahih al-Bukhari 6711, Book 84, Hadith 4","grade":"","question #":"question #2","question":"How does the concept of charity play a role in seeking forgiveness for breaking a fast in Ramadan?","id":"bukhari-84-19"},{"hadith-eng":"As-Sa'ib bin Yazid said, \"The Sa' at the time of the Prophet (ﷺ) was equal to one Mudd plus one-third of a \nMudd of your time, and then it was increased in the time of Caliph `Umar bin `Abdul `Aziz.\"","reference":"Sahih al-Bukhari 6712, Book 84, Hadith 5","grade":"","question #":"question #2","question":"What is the significance of the Sa' in Islamic tradition and how was it measured during the Prophet's time?","id":"bukhari-84-20"},{"hadith-eng":"Ibn `Umar used to give the Zakat of Ramadan (Zakat-al-Fitr) according to the Mudd of the Prophet, \nthe first Mudd, and he also used to give things for expiation for oaths according to the Mudd of the \nProphet. Abu Qutaiba said, \"Malik said to us, 'Our Mudd (i.e., of Medina) is better than yours and we \ndo not see any superiority except in the Mudd of the Prophet!' Malik further said, to me, 'If a ruler \ncame to you and fixed a Mudd smaller than the one of the Prophet, by what Mudd would you measure \nwhat you give (for expiation or Zakat-al-Fitr?' I replied, 'We would give it according to the Mudd of \nthe Prophet' On that, Malik said, 'Then, don't you see that we have to revert to the Mudd of the \nProphet ultimately?'\"","reference":"Sahih al-Bukhari 6713, Book 84, Hadith 6","grade":"","question #":"question #2","question":"How does the concept of measuring with the Mudd of the Prophet reflect on the authenticity and consistency in Islamic practices?","id":"bukhari-84-21"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, Sa' and Mudd (i.e., of the \npeople of Medina).","reference":"Sahih al-Bukhari 6714, Book 84, Hadith 7","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate care for the people of Medina through his supplications?","id":"bukhari-84-22"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of \nhis body for freeing the corresponding parts of the slave's body, even his private parts will be saved \nfrom the Fire) because of freeing the slave's private parts.\"","reference":"Sahih al-Bukhari 6715, Book 84, Hadith 8","grade":"","question #":"question #2","question":"How does freeing a slave impact one's salvation from the Fire according to Islamic teachings?","id":"bukhari-84-23"},{"hadith-eng":"Jabir said: An Ansari man made his slave a Mudabbar and he had no other property than him. When \nthe Prophet (ﷺ) heard of that, he said (to his companions), \"Who wants to buy him (i.e., the slave) for \nme?\" Nu'aim bin An-Nahham bought him for eight hundred Dirhams. I heard Jabir saying, \"That was \na coptic slave who died in the same year.\"","reference":"Sahih al-Bukhari 6716, Book 84, Hadith 9","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations involving the sale of slaves in his time?","id":"bukhari-84-24"},{"hadith-eng":"that she intended to buy Barira (a slave girl) and her masters stipulated that they would have her \nWala'. When `Aisha mentioned that to the Prophet (ﷺ) ; he said, \"Buy her, for the Wala' is for the one who \nmanumits.\"","reference":"Sahih al-Bukhari 6717, Book 84, Hadith 10","grade":"","question #":"question #2","question":"How does the principle of Wala' affect the rights and responsibilities of the person who frees a slave?","id":"bukhari-84-25"},{"hadith-eng":"I went to Allah's Messenger (ﷺ) along with a group of people from (the tribe of) Al-Ash`ari, asking for \nmounts. The Prophet (ﷺ) said, \"By Allah, I will not give you anything to ride, and I have nothing to mount \nyou on.\" We stayed there as long as Allah wished, and after that, some camels were brought to the \nProphet and he ordered that we be given three camels. When we set out, some of us said to others, \n\"Allah will not bless us, as we all went to Allah's Messenger (ﷺ) asking him for mounts, and although he had \nsworn that he would not give us mounts, he did give us.\" So we returned to the Prophet; and \nmentioned that to him. He said, \"I have not provided you with mounts, but Allah has. By Allah, Allah \nwilling, if I ever take an oath, and then see that another is better than the first, I make expiration for \nmy (dissolved) oath, and do what is better and make expiration.\"","reference":"Sahih al-Bukhari 6718, Book 84, Hadith 11","grade":"","question #":"question #2","question":"How does the concept of divine provision manifest in the actions of the Prophet (ﷺ)?","id":"bukhari-84-26"},{"hadith-eng":"the same narration above (i.e. 709), \"I make expiation for my dissolved oath, and I do what is better, \nor do what is better and make expiation.\"","reference":"Sahih al-Bukhari 6719, Book 84, Hadith 12","grade":"","question #":"question #2","question":"How does one determine what is better when faced with a decision involving an oath?","id":"bukhari-84-27"},{"hadith-eng":"(The Prophet) Solomon said, \"Tonight I will sleep with (my) ninety wives, each of whom will get a \nmale child who will fight for Allah's Cause.\" On that, his companion (Sufyan said that his companion \nwas an angel) said to him, \"Say, \"If Allah will (Allah willing).\" But Solomon forgot (to say it). He \nslept with all his wives, but none of the women gave birth to a child, except one who gave birth to a \nhalfboy. Abu Huraira added: The Prophet (ﷺ) said, \"If Solomon had said, \"If Allah will\" (Allah willing), \nhe would not have been unsuccessful in his action, and would have attained what he had desired.\" \nOnce Abu Huraira added: Allah apostle said, \"If he had accepted.\"","reference":"Sahih al-Bukhari 6720, Book 84, Hadith 13","grade":"","question #":"question #2","question":"How does the concept of divine will affect the outcomes of human intentions and actions?","id":"bukhari-84-28"},{"hadith-eng":"We were sitting with Abu Musa Al-Ash'sari, and as there were ties of friendship and mutual favors \nbetween us and his tribe. His meal was presented before him and there was chicken meat in it. Among \nthose who were present there was a man from Bani Taimillah having a red complexion as a non-Arab \nfreed slave, and that man did not approach the meal. Abu Musa said to him, \"Come along! I have seen \nAllah's Messenger (ﷺ) eating of that (i.e., chicken).\" The man said, \"I have seen it (chickens) eating \nsomething I regarded as dirty, and so I have taken an oath that I shall not eat (its meat) chicken.\" Abu \nMusa said, \"Come along! I will inform you about it (i.e., your oath). \nOnce we went to Allah's Messenger (ﷺ) in company with a group of Ash'airiyin, asking him for mounts \nwhile he was distributing some camels from the camels of Zakat. (Aiyub said, \"I think he said that the \nProphet was in an angry mood at the time.\") The Prophet (ﷺ) said, 'By Allah! I will not give you mounts, \nand I have nothing to mount you on.' After we had left, some camels of booty were brought to Allah's \nApostle and he said, \"Where are those Ash`ariyin? Where are those Ash`ariyin?\" So we went (to him) \nand he gave us five very fat good-looking camels. We mounted them and went away, and then I said \nto my companions, 'We went to Allah's Messenger (ﷺ) to give us mounts, but he took an oath that he would \nnot give us mounts, and then later on he sent for us and gave us mounts, perhaps Allah's Messenger (ﷺ) \nforgot his oath. By Allah, we will never be successful, for we have taken advantage of the fact that \nAllah's Messenger (ﷺ) forgot to fulfill his oath. So let us return to Allah's Messenger (ﷺ) to remind him of his oath.' \nWe returned and said, 'O Allah's Messenger (ﷺ)! We came to you and asked you for mounts, but you took an \noath that you would not give us mounts) but later on you gave us mounts, and we thought or \nconsidered that you have forgotten your oath.' The Prophet (ﷺ) said, 'Depart, for Allah has given you \nMounts. By Allah, Allah willing, if I take an oath and then later find another thing better than that, I \ndo what is better, and make expiation for the oath.' \"(two other narrations through Zahdam as above)","reference":"Sahih al-Bukhari 6721, Book 84, Hadith 14","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle situations where he initially refused a request but later fulfilled it?","id":"bukhari-84-29"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(O `Abdur-Rahman!) Do not seek to be a ruler, for, if you are given the \nauthority of ruling without your asking for it, then Allah will help you; but if you are given it by your \nasking, then you will be held responsible for it (i.e. Allah will not help you ) . And if you take an oath \nto do something and later on find another thing, better than that, then do what is better and make \nexpiation for (the dissolution of) your oath.\"","reference":"Sahih al-Bukhari 6722, Book 84, Hadith 15","grade":"","question #":"question #2","question":"What is the consequence of taking an oath and later finding a better course of action?","id":"bukhari-84-30"},{"hadith-eng":"I came to the Prophet (ﷺ) and he said to me, \"Come near.\" So I went near to him and he said, \"Are your \nlice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of \nfasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting \nshould be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to \nsix poor persons.\"","reference":"Sahih al-Bukhari 6708, Book 84, Hadith 1","grade":"","question #":"question #3","question":"What are the prescribed forms of expiation mentioned in the hadith for dealing with lice?","id":"bukhari-84-31"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"What is the matter with you?\" \nHe said, \"I had sexual relation with my wife (while I was fasting) in Ramadan.\" The Prophet (ﷺ) said, \n\"Have you got enough to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two \nsuccessive months?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor persons?\" The \nman said, \"No.\" Then the Prophet (ﷺ) said to him, \"Sit down,\" and he sat down. Afterwards an 'Irq, i.e., a \nbig basket containing dates was brought to the Prophet (ﷺ) and the Prophet (ﷺ) said to him, \"Take this and \ngive it in charity.\" The man said, \"To poorer people than we?\" On that, the Prophet (ﷺ) smiled till his \npremolar teeth became visible, and then told him, \"Feed your family with it.\" (See Hadith No. 157, \nVol 3)","reference":"Sahih al-Bukhari 6709, Book 84, Hadith 2","grade":"","question #":"question #3","question":"What is the significance of charity in Islam, especially in the context of atonement for sins?","id":"bukhari-84-32"},{"hadith-eng":"A man came to Allah's Messenger (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said to him, \"What is the \nmatter?\" He said, \"I have done a sexual relation with my wife (while fasting) in Ramadan.\" The \nProphet said to him?\" \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can \nyou fast for two successive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor \npersons?\" He said, \"No.\" Then an Ansari man came with an Irq (a big basket full of dates). The \nProphet said (to the man), \"Take this (basket) and give it in charity.\" That man said, \"To poorer people \nthan we, O Allah's Messenger (ﷺ)? By Him Who has sent you with the Truth! There is no house in between \nthe two mountains (of the city of Medina) poorer than we.\" So the Prophet (ﷺ) said (to him), \"Go and feed \nit to your family.\"","reference":"Sahih al-Bukhari 6710, Book 84, Hadith 3","grade":"","question #":"question #3","question":"What role does charity play in seeking forgiveness and rectifying a mistake in Islam?","id":"bukhari-84-33"},{"hadith-eng":"A man came to the Prophets and said, \"I am ruined!\" The Prophet (ﷺ) said, \"What is the matter with you?\" \nHe said, \"I have done a sexual relation with my wife (while fasting) in Ramadan\" The Prophet (ﷺ) said to \nhim, \"Can you afford to manumit a slave?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two \nsuccessive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Can you feed sixty poor persons?\" He said, \"I \nhave nothing.\" Later on an Irq (big basket) containing dates was given to the Prophet, and the Prophet (ﷺ) \nsaid (to him), \"Take this basket and give it in charity.\" The man said, \"To poorer people than we? \nIndeed, there is nobody between its (i.e., Medina's) two mountains who is poorer than we.\" The \nProphet then said, \"Take it and feed your family with it.\"","reference":"Sahih al-Bukhari 6711, Book 84, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of the Prophet's (ﷺ) response to the man's inability to fulfill the expiation requirements?","id":"bukhari-84-34"},{"hadith-eng":"As-Sa'ib bin Yazid said, \"The Sa' at the time of the Prophet (ﷺ) was equal to one Mudd plus one-third of a \nMudd of your time, and then it was increased in the time of Caliph `Umar bin `Abdul `Aziz.\"","reference":"Sahih al-Bukhari 6712, Book 84, Hadith 5","grade":"","question #":"question #3","question":"Who was responsible for changing the measurement of the Sa' after the Prophet's time?","id":"bukhari-84-35"},{"hadith-eng":"Ibn `Umar used to give the Zakat of Ramadan (Zakat-al-Fitr) according to the Mudd of the Prophet, \nthe first Mudd, and he also used to give things for expiation for oaths according to the Mudd of the \nProphet. Abu Qutaiba said, \"Malik said to us, 'Our Mudd (i.e., of Medina) is better than yours and we \ndo not see any superiority except in the Mudd of the Prophet!' Malik further said, to me, 'If a ruler \ncame to you and fixed a Mudd smaller than the one of the Prophet, by what Mudd would you measure \nwhat you give (for expiation or Zakat-al-Fitr?' I replied, 'We would give it according to the Mudd of \nthe Prophet' On that, Malik said, 'Then, don't you see that we have to revert to the Mudd of the \nProphet ultimately?'\"","reference":"Sahih al-Bukhari 6713, Book 84, Hadith 6","grade":"","question #":"question #3","question":"Why might a ruler's decision to alter the Mudd be considered less authoritative than the Mudd of the Prophet in Islamic tradition?","id":"bukhari-84-36"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, Sa' and Mudd (i.e., of the \npeople of Medina).","reference":"Sahih al-Bukhari 6714, Book 84, Hadith 7","grade":"","question #":"question #3","question":"What role do specific supplications play in the well-being and prosperity of a community in Islam?","id":"bukhari-84-37"},{"hadith-eng":"The Prophet (ﷺ) said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of \nhis body for freeing the corresponding parts of the slave's body, even his private parts will be saved \nfrom the Fire) because of freeing the slave's private parts.\"","reference":"Sahih al-Bukhari 6715, Book 84, Hadith 8","grade":"","question #":"question #3","question":"What is the significance of each body part being saved from the Fire when a slave is freed?","id":"bukhari-84-38"},{"hadith-eng":"Jabir said: An Ansari man made his slave a Mudabbar and he had no other property than him. When \nthe Prophet (ﷺ) heard of that, he said (to his companions), \"Who wants to buy him (i.e., the slave) for \nme?\" Nu'aim bin An-Nahham bought him for eight hundred Dirhams. I heard Jabir saying, \"That was \na coptic slave who died in the same year.\"","reference":"Sahih al-Bukhari 6716, Book 84, Hadith 9","grade":"","question #":"question #3","question":"What can be inferred about the economic transactions involving slaves during the time of the Prophet (ﷺ)?","id":"bukhari-84-39"},{"hadith-eng":"that she intended to buy Barira (a slave girl) and her masters stipulated that they would have her \nWala'. When `Aisha mentioned that to the Prophet (ﷺ) ; he said, \"Buy her, for the Wala' is for the one who \nmanumits.\"","reference":"Sahih al-Bukhari 6717, Book 84, Hadith 10","grade":"","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the conditions set by slave owners during the sale of a slave?","id":"bukhari-84-40"},{"hadith-eng":"I went to Allah's Messenger (ﷺ) along with a group of people from (the tribe of) Al-Ash`ari, asking for \nmounts. The Prophet (ﷺ) said, \"By Allah, I will not give you anything to ride, and I have nothing to mount \nyou on.\" We stayed there as long as Allah wished, and after that, some camels were brought to the \nProphet and he ordered that we be given three camels. When we set out, some of us said to others, \n\"Allah will not bless us, as we all went to Allah's Messenger (ﷺ) asking him for mounts, and although he had \nsworn that he would not give us mounts, he did give us.\" So we returned to the Prophet; and \nmentioned that to him. He said, \"I have not provided you with mounts, but Allah has. By Allah, Allah \nwilling, if I ever take an oath, and then see that another is better than the first, I make expiration for \nmy (dissolved) oath, and do what is better and make expiration.\"","reference":"Sahih al-Bukhari 6718, Book 84, Hadith 11","grade":"","question #":"question #3","question":"What lessons can be learned about reliance on Allah's will in the context of receiving provisions?","id":"bukhari-84-41"},{"hadith-eng":"the same narration above (i.e. 709), \"I make expiation for my dissolved oath, and I do what is better, \nor do what is better and make expiation.\"","reference":"Sahih al-Bukhari 6719, Book 84, Hadith 12","grade":"","question #":"question #3","question":"What are the steps involved in making expiation for a broken oath according to Islamic law?","id":"bukhari-84-42"},{"hadith-eng":"(The Prophet) Solomon said, \"Tonight I will sleep with (my) ninety wives, each of whom will get a \nmale child who will fight for Allah's Cause.\" On that, his companion (Sufyan said that his companion \nwas an angel) said to him, \"Say, \"If Allah will (Allah willing).\" But Solomon forgot (to say it). He \nslept with all his wives, but none of the women gave birth to a child, except one who gave birth to a \nhalfboy. Abu Huraira added: The Prophet (ﷺ) said, \"If Solomon had said, \"If Allah will\" (Allah willing), \nhe would not have been unsuccessful in his action, and would have attained what he had desired.\" \nOnce Abu Huraira added: Allah apostle said, \"If he had accepted.\"","reference":"Sahih al-Bukhari 6720, Book 84, Hadith 13","grade":"","question #":"question #3","question":"What lessons can be learned from the story of Prophet Solomon regarding reliance on Allah's will?","id":"bukhari-84-43"},{"hadith-eng":"We were sitting with Abu Musa Al-Ash'sari, and as there were ties of friendship and mutual favors \nbetween us and his tribe. His meal was presented before him and there was chicken meat in it. Among \nthose who were present there was a man from Bani Taimillah having a red complexion as a non-Arab \nfreed slave, and that man did not approach the meal. Abu Musa said to him, \"Come along! I have seen \nAllah's Messenger (ﷺ) eating of that (i.e., chicken).\" The man said, \"I have seen it (chickens) eating \nsomething I regarded as dirty, and so I have taken an oath that I shall not eat (its meat) chicken.\" Abu \nMusa said, \"Come along! I will inform you about it (i.e., your oath). \nOnce we went to Allah's Messenger (ﷺ) in company with a group of Ash'airiyin, asking him for mounts \nwhile he was distributing some camels from the camels of Zakat. (Aiyub said, \"I think he said that the \nProphet was in an angry mood at the time.\") The Prophet (ﷺ) said, 'By Allah! I will not give you mounts, \nand I have nothing to mount you on.' After we had left, some camels of booty were brought to Allah's \nApostle and he said, \"Where are those Ash`ariyin? Where are those Ash`ariyin?\" So we went (to him) \nand he gave us five very fat good-looking camels. We mounted them and went away, and then I said \nto my companions, 'We went to Allah's Messenger (ﷺ) to give us mounts, but he took an oath that he would \nnot give us mounts, and then later on he sent for us and gave us mounts, perhaps Allah's Messenger (ﷺ) \nforgot his oath. By Allah, we will never be successful, for we have taken advantage of the fact that \nAllah's Messenger (ﷺ) forgot to fulfill his oath. So let us return to Allah's Messenger (ﷺ) to remind him of his oath.' \nWe returned and said, 'O Allah's Messenger (ﷺ)! We came to you and asked you for mounts, but you took an \noath that you would not give us mounts) but later on you gave us mounts, and we thought or \nconsidered that you have forgotten your oath.' The Prophet (ﷺ) said, 'Depart, for Allah has given you \nMounts. By Allah, Allah willing, if I take an oath and then later find another thing better than that, I \ndo what is better, and make expiation for the oath.' \"(two other narrations through Zahdam as above)","reference":"Sahih al-Bukhari 6721, Book 84, Hadith 14","grade":"","question #":"question #3","question":"What is the significance of expiation in Islam when breaking an oath?","id":"bukhari-84-44"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"(O `Abdur-Rahman!) Do not seek to be a ruler, for, if you are given the \nauthority of ruling without your asking for it, then Allah will help you; but if you are given it by your \nasking, then you will be held responsible for it (i.e. Allah will not help you ) . And if you take an oath \nto do something and later on find another thing, better than that, then do what is better and make \nexpiation for (the dissolution of) your oath.\"","reference":"Sahih al-Bukhari 6722, Book 84, Hadith 15","grade":"","question #":"question #3","question":"How does divine assistance relate to being appointed to a position of authority without seeking it?","id":"bukhari-84-45"}]