[{"hadith-eng":"The Prophet (ﷺ) said, 'O people! The reward of deeds depends upon the intentions, and every person will \nget the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, \nthen his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or \nfor a woman to marry, then his emigration was for what he emigrated for.\"","reference":"Sahih al-Bukhari 6953, Book 90, Hadith 1","grade":"","question #":"question #1","question":"How does intention influence the reward of one's actions in Islam?","id":"bukhari-90-1"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah does not accept prayer of anyone of you if he does Hadath (passes wind) till \nhe performs the ablution (anew).","reference":"Sahih al-Bukhari 6954, Book 90, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of ablution in the acceptance of prayer in Islam?","id":"bukhari-90-2"},{"hadith-eng":"That Abu Bakr wrote for him, Zakat regulations which Allah's Messenger (ﷺ) had made compulsory, and \nwrote that one should neither collect various portions (of the property) nor divide the property into \nvarious portions in order to avoid paying Zakat.","reference":"Sahih al-Bukhari 6955, Book 90, Hadith 3","grade":"","question #":"question #1","question":"What are the regulations regarding the collection and division of property for Zakat purposes?","id":"bukhari-90-3"},{"hadith-eng":"A bedouin with unkempt hair came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Tell me what \nAllah has enjoined on me as regards prayers.\" The Prophet (ﷺ) said, \"You have to offer perfectly the five \n(compulsory) prayers in a day and a night (24 hrs.), except if you want to perform some extra optional \nprayers.\" The bedouin said, \"Tell me what Allah has enjoined on me as regards fasting.\" The Prophet (ﷺ) \nsaid, \"You have to observe fast during the month of Ramadan except if you fast some extra optional \nfast.\" The bedouin said, \"Tell me what Allah has enjoined on me as regard Zakat.\" The Prophet (ﷺ) then \ntold him the Islamic laws and regulations whereupon the bedouin said, \"By Him Who has honored \nyou, I will not perform any optional deeds of worship and I will not leave anything of what Allah has \nenjoined on me.\" Allah's Messenger (ﷺ) said, \"He will be successful if he has told the truth (or he will enter \nParadise if he said the truth).\" And some people said, \"The Zakat for one-hundred and twenty camels \nis two Hiqqas, and if the Zakat payer slaughters the camels intentionally or gives them as a present or \nplays some other trick in order to avoid the Zakat, then there is no harm (in it) for him.","reference":"Sahih al-Bukhari 6956, Book 90, Hadith 4","grade":"","question #":"question #1","question":"What are the basic religious obligations that a Muslim must fulfill according to Islamic teachings?","id":"bukhari-90-4"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has \nnot been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake \nand its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet (ﷺ) \nadded, \"By Allah, that snake will keep on following him until he stretches out his hand and let the \nsnake swallow it.\" Allah's Messenger (ﷺ) added, \"If the owner of camels does not pay their Zakat, then, on \nthe Day of Resurrection those camels will come to him and will strike his face with their hooves.\" \nSome people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells \nthose camels for similar camels or for sheep or cows or money one day before Zakat becomes due in \norder to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \n\"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which \nZakat becomes due), his Zakat will be valid.\"","reference":"Sahih al-Bukhari 6957, 6958, Book 90, Hadith 5","grade":"","question #":"question #1","question":"What are the consequences of not paying Zakat on one's wealth according to Islamic teachings?","id":"bukhari-90-5"},{"hadith-eng":"Sa'd bin 'Ubada Al-Ansari sought the verdict of Allah's Messenger (ﷺ) \n     regarding a vow made by his mother who had died before fulfilling it. \n     Allah's Messenger (ﷺ) said, \"Fulfill it on her behalf.\" Some people said, \n     \"If the number of camels reaches twenty, then their owner has to pay \n     four sheep as Zakat; and if their owner gives them as a gift or sells \n     them in order to escape the payment of Zakat cunningly before the \n     completion of a year, then he is not to pay anything, and if he \n     slaughters them and then dies, then no Zakat is to be taken from his \n     property.\"","reference":"Sahih al-Bukhari 6959, Book 90, Hadith 6","grade":"","question #":"question #1","question":"What is the ruling on fulfilling vows made by deceased relatives in Islam?","id":"bukhari-90-6"},{"hadith-eng":"Nafi narrated to me that 'Abdullah said that Allah's Messenger (ﷺ) forbade \n     the Shighar. I asked Nafi', \"What is the Shighar?\" He said, \"It is to \n     marry the daughter of a man and marry one's daughter to that man (at \n     the same time) without Mahr (in both cases); or to marry the sister of\n     a man and marry one's own sister to that man without Mahr.\" Some \n     people said, \"If one, by a trick, marries on the basis of Shighar, the\n     marriage is valid but its condition is illegal.\" The same scholar said\n     regarding Al-Mut'a, \"The marriage is invalid and its condition is \n     illegal.\" Some others said, \"The Mut'a and the Shighar are permissible\n     but the condition is illegal.\"","reference":"Sahih al-Bukhari 6960, Book 90, Hadith 7","grade":"","question #":"question #1","question":"What is the concept of Shighar in Islamic marriage, and why is it forbidden?","id":"bukhari-90-7"},{"hadith-eng":"`Ali was told that Ibn `Abbas did not see any harm in the Mut'a marriage. `Ali said, \"Allah's Messenger (ﷺ) \nforbade the Mut'a marriage on the Day of the battle of Khaibar and he forbade the eating of donkey's \nmeat.\" Some people said, \"If one, by a tricky way, marries temporarily, his marriage is illegal.\" Others \nsaid, \"The marriage is valid but its condition is illegal.\"","reference":"Sahih al-Bukhari 6961, Book 90, Hadith 8","grade":"","question #":"question #1","question":"What was the stance of Ali regarding the practice of Mut'a marriage?","id":"bukhari-90-8"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"One should not prevent others from watering their animals with the surplus of \nhis water in order to prevent them from benefiting by the surplus of grass.\"","reference":"Sahih al-Bukhari 6962, Book 90, Hadith 9","grade":"","question #":"question #1","question":"What is the significance of sharing resources like water and grass in Islam?","id":"bukhari-90-9"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the practice of An-Najsh.","reference":"Sahih al-Bukhari 6963, Book 90, Hadith 10","grade":"","question #":"question #1","question":"What is the practice of An-Najsh and why is it prohibited in Islam?","id":"bukhari-90-10"},{"hadith-eng":"A man mentioned to the Prophet (ﷺ) that he had always been cheated in bargains. The Prophet (ﷺ) said, \n\"Whenever you do bargain, say, 'No cheating.'\"","reference":"Sahih al-Bukhari 6964, Book 90, Hadith 11","grade":"","question #":"question #1","question":"What guidance does Islam provide to protect oneself from being cheated in business transactions?","id":"bukhari-90-11"},{"hadith-eng":"That he asked `Aisha regarding the Verse: 'If you fear that you shall not be able to deal justly with the \norphan girls, marry (other) women of your choice.' (4.3) `Aisha said, \"It is about an orphan girl under \nthe custody of her guardian who being attracted by her wealth and beauty wants to marry her with \nMahr less than other women of her status. So such guardians were forbidden to marry them unless \nthey treat them justly by giving them their full Mahr. Then the people sought the verdict of Allah's \nApostle for such cases, whereupon Allah revealed: 'They ask your instruction concerning women..' \n(4.127) (The sub-narrator then mentioned the Hadith.)","reference":"Sahih al-Bukhari 6965, Book 90, Hadith 12","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding the treatment of orphan girls in marriage?","id":"bukhari-90-12"},{"hadith-eng":"The Prophet (ﷺ) said, \"For every betrayer there will be a flag by which he will be recognized on the Day \nof Resurrection. \"","reference":"Sahih al-Bukhari 6966, Book 90, Hadith 13","grade":"","question #":"question #1","question":"What are the consequences of betrayal according to Islamic teachings?","id":"bukhari-90-13"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am only a human being, and you people have disputes. May be some one \namongst you can present his case in a more eloquent and convincing manner than the other, and I give \nmy judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody \nsomething of his brother's right then he should not take it as I have only, given him a piece of Fire.\" \n(See Hadith No. 638. Vol. 3)","reference":"Sahih al-Bukhari 6967, Book 90, Hadith 14","grade":"","question #":"question #1","question":"What does this narration teach about the limitations of human judgment in resolving disputes?","id":"bukhari-90-14"},{"hadith-eng":"The Prophet (ﷺ) said, \"A virgin should not be married till she is asked for her consent; and the matron \nshould not be married till she is asked whether she agrees to marry or not.\" It was asked, \"O Allah's \nApostle! How will she (the virgin) express her consent?\" He said, \"By keeping silent.\" Some people \nsaid that if a virgin is not asked for her consent and she is not married, and then a man, by playing a trick \npresents two false witnesses that he has married her with her consent and the judge confirms his \nmarriage as a true one, and the husband knows that the witnesses were false ones, then there is no \nharm for him to consummate his marriage with her and the marriage is regarded as valid.","reference":"Sahih al-Bukhari 6968, Book 90, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of seeking a woman's consent in marriage according to Islamic teachings?","id":"bukhari-90-15"},{"hadith-eng":"A woman from the offspring of Ja`far was afraid lest her guardian marry her (to somebody) against \nher will. So she sent for two elderly men from the Ansar, `AbdurRahman and Mujammi', the two sons \nof Jariya, and they said to her, \"Don't be afraid, for Khansa' bint Khidam was given by her father in \nmarriage against her will, then the Prophet (ﷺ) cancelled that marriage.\" (See Hadith No. 78)","reference":"Sahih al-Bukhari 6969, Book 90, Hadith 16","grade":"","question #":"question #1","question":"What is the Islamic perspective on a woman's consent in marriage?","id":"bukhari-90-16"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A lady slave should not be given in marriage until she is consulted, and a virgin \nshould not be given in marriage until her permission is granted.\" The people said, \"How will she \nexpress her permission?\" The Prophet (ﷺ) said, \"By keeping silent (when asked her consent).\" Some \npeople said, \"If a man, by playing a trick, presents two false witnesses before the judge to testify that \nhe has married a matron with her consent and the judge confirms his marriage, and the husband is sure \nthat he has never married her (before), then such a marriage will be considered as a legal one and he \nmay live with her as husband.\"","reference":"Sahih al-Bukhari 6970, Book 90, Hadith 17","grade":"","question #":"question #1","question":"What is the significance of seeking a woman's consent in marriage according to Islamic teachings?","id":"bukhari-90-17"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is essential to have the consent of a virgin (for the marriage). I said, \"A virgin \nfeels shy.\" The Prophet; said, \"Her silence means her consent.\" Some people said, \"If a man falls in \nlove with an orphan slave girl or a virgin and she refuses (him) and then he makes a trick by bringing \ntwo false witnesses to testify that he has married her, and then she attains the age of puberty and \nagrees to marry him and the judge accepts the false witness and the husband knows that the witnesses \nwere false ones, he may consummate his marriage.\"","reference":"Sahih al-Bukhari 6971, Book 90, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of obtaining a virgin's consent in marriage according to Islamic teachings?","id":"bukhari-90-18"},{"hadith-eng":"Allah's Messenger (ﷺ) used to like sweets and also used to like honey, and whenever he finished the `Asr \nprayer, he used to visit his wives and stay with them. Once he visited Hafsa and remained with her \nlonger than the period he used to stay, so I enquired about it. It was said to me, \"A woman from her \ntribe gave her a leather skin containing honey as a present, and she gave some of it to Allah's Messenger (ﷺ) \nto drink.\" I said, \"By Allah, we will play a trick on him.\" So I mentioned the story to Sauda (the wife \nof the Prophet) and said to her, \"When he enters upon you, he will come near to you whereupon you \nshould say to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He will say, 'No.' Then you say to \nhim, 'What is this bad smell? ' And it would be very hard on Allah's Messenger (ﷺ) that a bad smell should be \nfound on his body. He will say, 'Hafsa has given me a drink of honey.' Then you should say to him, \n'Its bees must have sucked from the Al-`Urfut (a foul smelling flower).' I too, will tell him the same. \nAnd you, O Saifya, say the same.\" \nSo when the Prophet (ﷺ) entered upon Sauda (the following happened). Sauda said, \"By Him except \nWhom none has the right to be worshipped, I was about to say to him what you had told me to say \nwhile he was still at the gate because of fear from you. But when Allah 's Apostle came near to me, I \nsaid to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He replied, 'No.' I said, 'What about this \nsmell?' He said, 'Hafsa has given me a drink of honey.' I said, 'Its bees must have sucked Al-`Urfut.' \" \nWhen he entered upon me, I told him the same as that, and when he entered upon Safiya, she too told \nhim the same. So when he visited Hafsa again, she said to him, \"O Allah's Messenger (ﷺ)! Shall I give you a \ndrink of it (honey)?\" He said, \"I have no desire for it.\" Sauda said, Subhan Allah! We have deprived \nhim of it (honey).\" I said to her, \"Be quiet!\"","reference":"Sahih al-Bukhari 6972, Book 90, Hadith 19","grade":"","question #":"question #1","question":"What does this narration reveal about the Prophet's preferences and daily routine?","id":"bukhari-90-19"},{"hadith-eng":"`Umar bin Al-Khattab left for Sham, and when he reached a placed called Sargh, he came to know \nthat there was an outbreak of an epidemic (of plague) in Sham. Then `AbdurRahman bin `Auf told \nhim that Allah's Messenger (ﷺ) said, \"If you hear the news of an outbreak of an epidemic (plague) in a \ncertain place, do not enter that place: and if the epidemic falls in a place while you are present in it, do \nnot leave that place to escape from the epidemic.\" So `Umar returned from Sargh.","reference":"Sahih al-Bukhari 6973, Book 90, Hadith 20","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding travel during an epidemic outbreak?","id":"bukhari-90-20"},{"hadith-eng":"That he heard Usama bin Zaid speaking to Sa`d, saying, \"Allah's Messenger (ﷺ) mentioned the plague and \nsaid, 'It is a means of punishment with which some nations were punished and some of it has \nremained, and it appears now and then. So whoever hears that there is an outbreak of plague in some \nland, he should not go to that land, and if the plague breaks out in the land where one is already \npresent, one should not run away from that land, escaping from the plague.\"","reference":"Sahih al-Bukhari 6974, Book 90, Hadith 21","grade":"","question #":"question #1","question":"What guidance does Islam provide regarding travel during an outbreak of a contagious disease?","id":"bukhari-90-21"},{"hadith-eng":"The Prophet (ﷺ) said, \"The one who takes back his gift is like a dog swallowing its own vomit, and we \n(believers) should not act according to this bad example.\"","reference":"Sahih al-Bukhari 6975, Book 90, Hadith 22","grade":"","question #":"question #1","question":"What is the moral implication of taking back a gift once it has been given?","id":"bukhari-90-22"},{"hadith-eng":"The Prophet (ﷺ) has decreed that preemption is valid in all cases where the real estate concerned has not \nbeen divided, but if the boundaries are established and the ways are made, then there is no preemption. \nA man said, \"Preemption is only for the neighbor,\" and then he makes invalid what he has confirmed. \nHe said, \"If someone wants to buy a house and being afraid that the neighbor (of the house) may buy \nit through preemption, he buys one share out of one hundred shares of the house and then buys the rest \nof the house, then the neighbor can only have the right of preemption for the first share but not for the \nrest of the house; and the buyer may play such a trick in this case.\"","reference":"Sahih al-Bukhari 6976, Book 90, Hadith 23","grade":"","question #":"question #1","question":"What is the concept of preemption in Islamic law regarding real estate transactions?","id":"bukhari-90-23"},{"hadith-eng":"Al-Miswar bin Makhrama came and put his hand on my shoulder and I \n     accompanied him to Sa'd. Abu Rafi' said to Al-Miswar, \"Won't you order\n     this (i.e. Sa'd) to buy my house which is in my yard?\" Sa'd said, \"I \n     will not offer more than four hundred in installments over a fixed \n     period.\" Abu Rafi said, \"I was offered five hundred cash but I \n     refused. Had I not heard the Prophet (ﷺ) saying, 'A neighbor is more \n     entitled to receive the care of his neighbor,' I would not have sold \n     it to you.\" The narrator said, to Sufyan: Ma'mar did not say so. \n     Sufyan said, \"But he did say so to me.\" Some people said, \"If someone \n     wants to sell a house and deprived somebody of the right of \n     preemption, he has the right to play a trick to render the preemption \n     invalid. And that is by giving the house to the buyer as a present and\n     marking its boundaries and giving it to him. The buyer then gives the \n     seller one-thousand Dirham as compensation in which case the preemptor\n     loses his right of preemption.\"","reference":"Sahih al-Bukhari 6977, Book 90, Hadith 24","grade":"","question #":"question #1","question":"What is the significance of a neighbor's right in property transactions in Islam?","id":"bukhari-90-24"},{"hadith-eng":"Abu Rafi' said that Sa'd offered him \n     four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had \n     not heard Allah's Messenger (ﷺ) saying, 'A neighbor has more right to be \n     taken care of by his neighbor,' then I would not have given it to \n     you.\" Some people said, \"If one has bought a portion of a house and \n     wants to cancel the right of preemption, he may give it as a present \n     to his little son and he will not be obliged to take an oath.\"","reference":"Sahih al-Bukhari 6978, Book 90, Hadith 25","grade":"","question #":"question #1","question":"What rights does a neighbor have in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-90-25"},{"hadith-eng":"Allah's Messenger (ﷺ) appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's \ntribe. When he returned, the Prophet (ﷺ) called him to account. He said (to the Prophet, 'This is your \nmoney, and this has been given to me as a gift.\" On that, Allah's Messenger (ﷺ) said, \"Why didn't you stay in \nyour father's and mother's house to see whether you will be given gifts or not if you are telling the \ntruth?\" Then the Prophet (ﷺ) addressed us, and after praising and glorifying Allah, he said: \"Amma \nBa'du\", I employ a man from among you to manage some affair of what Allah has put under my \ncustody, and then he comes to me and says, 'This is your money and this has been given to me as a \ngift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? \nBy Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of \nResurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a \nmooing cow or a bleating sheep on meeting Allah.\" Then the Prophet (ﷺ) raised both his hands till the \nwhiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your \nMessage)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).","reference":"Sahih al-Bukhari 6979, Book 90, Hadith 26","grade":"","question #":"question #1","question":"What is the significance of accountability and integrity in handling public funds in Islam?","id":"bukhari-90-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"The neighbor has more right to be taken care of by his neighbor (than anyone \nelse).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play \na trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but \npaying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in \ncash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the \nhouse, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the \nhouse proves to belong to somebody else other than the seller, the buyer should take back from the \nseller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to \nsomebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it \ndoes not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams \n(instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man \nallows (some people) the playing of tricks amongst the Muslims (although) the Prophet (ﷺ) said, 'In \ndealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"","reference":"Sahih al-Bukhari 6980, Book 90, Hadith 27","grade":"","question #":"question #1","question":"What rights does a neighbor have according to Islamic teachings?","id":"bukhari-90-27"},{"hadith-eng":"Abu Rafi` sold a house to Sa`d bin Malik for four-hundred Mithqal of gold, and said, \"If I had not \nheard the Prophet (ﷺ) saying, 'The neighbor has more right to be taken care of by his neighbor (than \nanyone else),' then I would not have sold it to you.\"","reference":"Sahih al-Bukhari 6981, Book 90, Hadith 28","grade":"","question #":"question #1","question":"What is the significance of prioritizing a neighbor's rights in Islam?","id":"bukhari-90-28"},{"hadith-eng":"The Prophet (ﷺ) said, 'O people! The reward of deeds depends upon the intentions, and every person will \nget the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, \nthen his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or \nfor a woman to marry, then his emigration was for what he emigrated for.\"","reference":"Sahih al-Bukhari 6953, Book 90, Hadith 1","grade":"","question #":"question #2","question":"What are the implications of having different intentions for the same action in terms of spiritual reward?","id":"bukhari-90-29"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah does not accept prayer of anyone of you if he does Hadath (passes wind) till \nhe performs the ablution (anew).","reference":"Sahih al-Bukhari 6954, Book 90, Hadith 2","grade":"","question #":"question #2","question":"How does passing wind affect the validity of one's prayer according to Islamic teachings?","id":"bukhari-90-30"},{"hadith-eng":"That Abu Bakr wrote for him, Zakat regulations which Allah's Messenger (ﷺ) had made compulsory, and \nwrote that one should neither collect various portions (of the property) nor divide the property into \nvarious portions in order to avoid paying Zakat.","reference":"Sahih al-Bukhari 6955, Book 90, Hadith 3","grade":"","question #":"question #2","question":"Why is it important not to manipulate property portions to avoid paying Zakat?","id":"bukhari-90-31"},{"hadith-eng":"A bedouin with unkempt hair came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Tell me what \nAllah has enjoined on me as regards prayers.\" The Prophet (ﷺ) said, \"You have to offer perfectly the five \n(compulsory) prayers in a day and a night (24 hrs.), except if you want to perform some extra optional \nprayers.\" The bedouin said, \"Tell me what Allah has enjoined on me as regards fasting.\" The Prophet (ﷺ) \nsaid, \"You have to observe fast during the month of Ramadan except if you fast some extra optional \nfast.\" The bedouin said, \"Tell me what Allah has enjoined on me as regard Zakat.\" The Prophet (ﷺ) then \ntold him the Islamic laws and regulations whereupon the bedouin said, \"By Him Who has honored \nyou, I will not perform any optional deeds of worship and I will not leave anything of what Allah has \nenjoined on me.\" Allah's Messenger (ﷺ) said, \"He will be successful if he has told the truth (or he will enter \nParadise if he said the truth).\" And some people said, \"The Zakat for one-hundred and twenty camels \nis two Hiqqas, and if the Zakat payer slaughters the camels intentionally or gives them as a present or \nplays some other trick in order to avoid the Zakat, then there is no harm (in it) for him.","reference":"Sahih al-Bukhari 6956, Book 90, Hadith 4","grade":"","question #":"question #2","question":"How does the intention to perform only obligatory acts of worship affect one's spiritual success in Islam?","id":"bukhari-90-32"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has \nnot been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake \nand its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet (ﷺ) \nadded, \"By Allah, that snake will keep on following him until he stretches out his hand and let the \nsnake swallow it.\" Allah's Messenger (ﷺ) added, \"If the owner of camels does not pay their Zakat, then, on \nthe Day of Resurrection those camels will come to him and will strike his face with their hooves.\" \nSome people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells \nthose camels for similar camels or for sheep or cows or money one day before Zakat becomes due in \norder to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \n\"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which \nZakat becomes due), his Zakat will be valid.\"","reference":"Sahih al-Bukhari 6957, 6958, Book 90, Hadith 5","grade":"","question #":"question #2","question":"How does the concept of Zakat relate to the accountability of wealth on the Day of Resurrection?","id":"bukhari-90-33"},{"hadith-eng":"Sa'd bin 'Ubada Al-Ansari sought the verdict of Allah's Messenger (ﷺ) \n     regarding a vow made by his mother who had died before fulfilling it. \n     Allah's Messenger (ﷺ) said, \"Fulfill it on her behalf.\" Some people said, \n     \"If the number of camels reaches twenty, then their owner has to pay \n     four sheep as Zakat; and if their owner gives them as a gift or sells \n     them in order to escape the payment of Zakat cunningly before the \n     completion of a year, then he is not to pay anything, and if he \n     slaughters them and then dies, then no Zakat is to be taken from his \n     property.\"","reference":"Sahih al-Bukhari 6959, Book 90, Hadith 6","grade":"","question #":"question #2","question":"How does the concept of Zakat apply to livestock, specifically camels, in Islamic teachings?","id":"bukhari-90-34"},{"hadith-eng":"Nafi narrated to me that 'Abdullah said that Allah's Messenger (ﷺ) forbade \n     the Shighar. I asked Nafi', \"What is the Shighar?\" He said, \"It is to \n     marry the daughter of a man and marry one's daughter to that man (at \n     the same time) without Mahr (in both cases); or to marry the sister of\n     a man and marry one's own sister to that man without Mahr.\" Some \n     people said, \"If one, by a trick, marries on the basis of Shighar, the\n     marriage is valid but its condition is illegal.\" The same scholar said\n     regarding Al-Mut'a, \"The marriage is invalid and its condition is \n     illegal.\" Some others said, \"The Mut'a and the Shighar are permissible\n     but the condition is illegal.\"","reference":"Sahih al-Bukhari 6960, Book 90, Hadith 7","grade":"","question #":"question #2","question":"What are the differing scholarly opinions on the validity and conditions of Shighar and Mut'a marriages?","id":"bukhari-90-35"},{"hadith-eng":"`Ali was told that Ibn `Abbas did not see any harm in the Mut'a marriage. `Ali said, \"Allah's Messenger (ﷺ) \nforbade the Mut'a marriage on the Day of the battle of Khaibar and he forbade the eating of donkey's \nmeat.\" Some people said, \"If one, by a tricky way, marries temporarily, his marriage is illegal.\" Others \nsaid, \"The marriage is valid but its condition is illegal.\"","reference":"Sahih al-Bukhari 6961, Book 90, Hadith 8","grade":"","question #":"question #2","question":"What are the implications of a marriage being considered illegal or its conditions being deemed illegal in Islamic jurisprudence?","id":"bukhari-90-36"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"One should not prevent others from watering their animals with the surplus of \nhis water in order to prevent them from benefiting by the surplus of grass.\"","reference":"Sahih al-Bukhari 6962, Book 90, Hadith 9","grade":"","question #":"question #2","question":"How does Islam view the act of preventing others from accessing natural resources?","id":"bukhari-90-37"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the practice of An-Najsh.","reference":"Sahih al-Bukhari 6963, Book 90, Hadith 10","grade":"","question #":"question #2","question":"How does the prohibition of An-Najsh reflect on ethical business practices in Islam?","id":"bukhari-90-38"},{"hadith-eng":"A man mentioned to the Prophet (ﷺ) that he had always been cheated in bargains. The Prophet (ﷺ) said, \n\"Whenever you do bargain, say, 'No cheating.'\"","reference":"Sahih al-Bukhari 6964, Book 90, Hadith 11","grade":"","question #":"question #2","question":"How can verbal declarations be used as a preventive measure against deceit in trade?","id":"bukhari-90-39"},{"hadith-eng":"That he asked `Aisha regarding the Verse: 'If you fear that you shall not be able to deal justly with the \norphan girls, marry (other) women of your choice.' (4.3) `Aisha said, \"It is about an orphan girl under \nthe custody of her guardian who being attracted by her wealth and beauty wants to marry her with \nMahr less than other women of her status. So such guardians were forbidden to marry them unless \nthey treat them justly by giving them their full Mahr. Then the people sought the verdict of Allah's \nApostle for such cases, whereupon Allah revealed: 'They ask your instruction concerning women..' \n(4.127) (The sub-narrator then mentioned the Hadith.)","reference":"Sahih al-Bukhari 6965, Book 90, Hadith 12","grade":"","question #":"question #2","question":"How does the Quran address the issue of fairness and justice in marriage proposals involving orphan girls?","id":"bukhari-90-40"},{"hadith-eng":"The Prophet (ﷺ) said, \"For every betrayer there will be a flag by which he will be recognized on the Day \nof Resurrection. \"","reference":"Sahih al-Bukhari 6966, Book 90, Hadith 13","grade":"","question #":"question #2","question":"How will betrayers be identified on the Day of Resurrection?","id":"bukhari-90-41"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am only a human being, and you people have disputes. May be some one \namongst you can present his case in a more eloquent and convincing manner than the other, and I give \nmy judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody \nsomething of his brother's right then he should not take it as I have only, given him a piece of Fire.\" \n(See Hadith No. 638. Vol. 3)","reference":"Sahih al-Bukhari 6967, Book 90, Hadith 14","grade":"","question #":"question #2","question":"How does this narration emphasize the importance of honesty and integrity in legal matters?","id":"bukhari-90-42"},{"hadith-eng":"The Prophet (ﷺ) said, \"A virgin should not be married till she is asked for her consent; and the matron \nshould not be married till she is asked whether she agrees to marry or not.\" It was asked, \"O Allah's \nApostle! How will she (the virgin) express her consent?\" He said, \"By keeping silent.\" Some people \nsaid that if a virgin is not asked for her consent and she is not married, and then a man, by playing a trick \npresents two false witnesses that he has married her with her consent and the judge confirms his \nmarriage as a true one, and the husband knows that the witnesses were false ones, then there is no \nharm for him to consummate his marriage with her and the marriage is regarded as valid.","reference":"Sahih al-Bukhari 6968, Book 90, Hadith 15","grade":"","question #":"question #2","question":"How is a virgin's consent traditionally expressed in the context of marriage in Islam?","id":"bukhari-90-43"},{"hadith-eng":"A woman from the offspring of Ja`far was afraid lest her guardian marry her (to somebody) against \nher will. So she sent for two elderly men from the Ansar, `AbdurRahman and Mujammi', the two sons \nof Jariya, and they said to her, \"Don't be afraid, for Khansa' bint Khidam was given by her father in \nmarriage against her will, then the Prophet (ﷺ) cancelled that marriage.\" (See Hadith No. 78)","reference":"Sahih al-Bukhari 6969, Book 90, Hadith 16","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address situations where a woman was married against her will?","id":"bukhari-90-44"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A lady slave should not be given in marriage until she is consulted, and a virgin \nshould not be given in marriage until her permission is granted.\" The people said, \"How will she \nexpress her permission?\" The Prophet (ﷺ) said, \"By keeping silent (when asked her consent).\" Some \npeople said, \"If a man, by playing a trick, presents two false witnesses before the judge to testify that \nhe has married a matron with her consent and the judge confirms his marriage, and the husband is sure \nthat he has never married her (before), then such a marriage will be considered as a legal one and he \nmay live with her as husband.\"","reference":"Sahih al-Bukhari 6970, Book 90, Hadith 17","grade":"","question #":"question #2","question":"How is a virgin's consent for marriage traditionally expressed in Islamic jurisprudence?","id":"bukhari-90-45"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is essential to have the consent of a virgin (for the marriage). I said, \"A virgin \nfeels shy.\" The Prophet; said, \"Her silence means her consent.\" Some people said, \"If a man falls in \nlove with an orphan slave girl or a virgin and she refuses (him) and then he makes a trick by bringing \ntwo false witnesses to testify that he has married her, and then she attains the age of puberty and \nagrees to marry him and the judge accepts the false witness and the husband knows that the witnesses \nwere false ones, he may consummate his marriage.\"","reference":"Sahih al-Bukhari 6971, Book 90, Hadith 18","grade":"","question #":"question #2","question":"How is a virgin's silence interpreted in the context of marriage consent in Islam?","id":"bukhari-90-46"},{"hadith-eng":"Allah's Messenger (ﷺ) used to like sweets and also used to like honey, and whenever he finished the `Asr \nprayer, he used to visit his wives and stay with them. Once he visited Hafsa and remained with her \nlonger than the period he used to stay, so I enquired about it. It was said to me, \"A woman from her \ntribe gave her a leather skin containing honey as a present, and she gave some of it to Allah's Messenger (ﷺ) \nto drink.\" I said, \"By Allah, we will play a trick on him.\" So I mentioned the story to Sauda (the wife \nof the Prophet) and said to her, \"When he enters upon you, he will come near to you whereupon you \nshould say to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He will say, 'No.' Then you say to \nhim, 'What is this bad smell? ' And it would be very hard on Allah's Messenger (ﷺ) that a bad smell should be \nfound on his body. He will say, 'Hafsa has given me a drink of honey.' Then you should say to him, \n'Its bees must have sucked from the Al-`Urfut (a foul smelling flower).' I too, will tell him the same. \nAnd you, O Saifya, say the same.\" \nSo when the Prophet (ﷺ) entered upon Sauda (the following happened). Sauda said, \"By Him except \nWhom none has the right to be worshipped, I was about to say to him what you had told me to say \nwhile he was still at the gate because of fear from you. But when Allah 's Apostle came near to me, I \nsaid to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He replied, 'No.' I said, 'What about this \nsmell?' He said, 'Hafsa has given me a drink of honey.' I said, 'Its bees must have sucked Al-`Urfut.' \" \nWhen he entered upon me, I told him the same as that, and when he entered upon Safiya, she too told \nhim the same. So when he visited Hafsa again, she said to him, \"O Allah's Messenger (ﷺ)! Shall I give you a \ndrink of it (honey)?\" He said, \"I have no desire for it.\" Sauda said, Subhan Allah! We have deprived \nhim of it (honey).\" I said to her, \"Be quiet!\"","reference":"Sahih al-Bukhari 6972, Book 90, Hadith 19","grade":"","question #":"question #2","question":"How did the wives of the Prophet (ﷺ) interact with him and each other in this account?","id":"bukhari-90-47"},{"hadith-eng":"`Umar bin Al-Khattab left for Sham, and when he reached a placed called Sargh, he came to know \nthat there was an outbreak of an epidemic (of plague) in Sham. Then `AbdurRahman bin `Auf told \nhim that Allah's Messenger (ﷺ) said, \"If you hear the news of an outbreak of an epidemic (plague) in a \ncertain place, do not enter that place: and if the epidemic falls in a place while you are present in it, do \nnot leave that place to escape from the epidemic.\" So `Umar returned from Sargh.","reference":"Sahih al-Bukhari 6973, Book 90, Hadith 20","grade":"","question #":"question #2","question":"How should one respond if an epidemic occurs in a place where they are currently residing?","id":"bukhari-90-48"},{"hadith-eng":"That he heard Usama bin Zaid speaking to Sa`d, saying, \"Allah's Messenger (ﷺ) mentioned the plague and \nsaid, 'It is a means of punishment with which some nations were punished and some of it has \nremained, and it appears now and then. So whoever hears that there is an outbreak of plague in some \nland, he should not go to that land, and if the plague breaks out in the land where one is already \npresent, one should not run away from that land, escaping from the plague.\"","reference":"Sahih al-Bukhari 6974, Book 90, Hadith 21","grade":"","question #":"question #2","question":"How does the concept of divine punishment relate to natural disasters or diseases in Islamic teachings?","id":"bukhari-90-49"},{"hadith-eng":"The Prophet (ﷺ) said, \"The one who takes back his gift is like a dog swallowing its own vomit, and we \n(believers) should not act according to this bad example.\"","reference":"Sahih al-Bukhari 6975, Book 90, Hadith 22","grade":"","question #":"question #2","question":"How does the analogy of a dog swallowing its own vomit relate to the act of reclaiming a gift?","id":"bukhari-90-50"},{"hadith-eng":"The Prophet (ﷺ) has decreed that preemption is valid in all cases where the real estate concerned has not \nbeen divided, but if the boundaries are established and the ways are made, then there is no preemption. \nA man said, \"Preemption is only for the neighbor,\" and then he makes invalid what he has confirmed. \nHe said, \"If someone wants to buy a house and being afraid that the neighbor (of the house) may buy \nit through preemption, he buys one share out of one hundred shares of the house and then buys the rest \nof the house, then the neighbor can only have the right of preemption for the first share but not for the \nrest of the house; and the buyer may play such a trick in this case.\"","reference":"Sahih al-Bukhari 6976, Book 90, Hadith 23","grade":"","question #":"question #2","question":"How does the establishment of boundaries affect the right of preemption in property dealings?","id":"bukhari-90-51"},{"hadith-eng":"Al-Miswar bin Makhrama came and put his hand on my shoulder and I \n     accompanied him to Sa'd. Abu Rafi' said to Al-Miswar, \"Won't you order\n     this (i.e. Sa'd) to buy my house which is in my yard?\" Sa'd said, \"I \n     will not offer more than four hundred in installments over a fixed \n     period.\" Abu Rafi said, \"I was offered five hundred cash but I \n     refused. Had I not heard the Prophet (ﷺ) saying, 'A neighbor is more \n     entitled to receive the care of his neighbor,' I would not have sold \n     it to you.\" The narrator said, to Sufyan: Ma'mar did not say so. \n     Sufyan said, \"But he did say so to me.\" Some people said, \"If someone \n     wants to sell a house and deprived somebody of the right of \n     preemption, he has the right to play a trick to render the preemption \n     invalid. And that is by giving the house to the buyer as a present and\n     marking its boundaries and giving it to him. The buyer then gives the \n     seller one-thousand Dirham as compensation in which case the preemptor\n     loses his right of preemption.\"","reference":"Sahih al-Bukhari 6977, Book 90, Hadith 24","grade":"","question #":"question #2","question":"How does Islamic teaching address the issue of preemption in property sales?","id":"bukhari-90-52"},{"hadith-eng":"Abu Rafi' said that Sa'd offered him \n     four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had \n     not heard Allah's Messenger (ﷺ) saying, 'A neighbor has more right to be \n     taken care of by his neighbor,' then I would not have given it to \n     you.\" Some people said, \"If one has bought a portion of a house and \n     wants to cancel the right of preemption, he may give it as a present \n     to his little son and he will not be obliged to take an oath.\"","reference":"Sahih al-Bukhari 6978, Book 90, Hadith 25","grade":"","question #":"question #2","question":"How does the concept of preemption apply in Islamic property transactions?","id":"bukhari-90-53"},{"hadith-eng":"Allah's Messenger (ﷺ) appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's \ntribe. When he returned, the Prophet (ﷺ) called him to account. He said (to the Prophet, 'This is your \nmoney, and this has been given to me as a gift.\" On that, Allah's Messenger (ﷺ) said, \"Why didn't you stay in \nyour father's and mother's house to see whether you will be given gifts or not if you are telling the \ntruth?\" Then the Prophet (ﷺ) addressed us, and after praising and glorifying Allah, he said: \"Amma \nBa'du\", I employ a man from among you to manage some affair of what Allah has put under my \ncustody, and then he comes to me and says, 'This is your money and this has been given to me as a \ngift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? \nBy Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of \nResurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a \nmooing cow or a bleating sheep on meeting Allah.\" Then the Prophet (ﷺ) raised both his hands till the \nwhiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your \nMessage)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).","reference":"Sahih al-Bukhari 6979, Book 90, Hadith 26","grade":"","question #":"question #2","question":"How does Islam view the acceptance of gifts by public officials in the context of their duties?","id":"bukhari-90-54"},{"hadith-eng":"The Prophet (ﷺ) said, \"The neighbor has more right to be taken care of by his neighbor (than anyone \nelse).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play \na trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but \npaying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in \ncash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the \nhouse, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the \nhouse proves to belong to somebody else other than the seller, the buyer should take back from the \nseller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to \nsomebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it \ndoes not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams \n(instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man \nallows (some people) the playing of tricks amongst the Muslims (although) the Prophet (ﷺ) said, 'In \ndealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"","reference":"Sahih al-Bukhari 6980, Book 90, Hadith 27","grade":"","question #":"question #2","question":"How does Islam view the use of deceitful practices in business transactions?","id":"bukhari-90-55"},{"hadith-eng":"Abu Rafi` sold a house to Sa`d bin Malik for four-hundred Mithqal of gold, and said, \"If I had not \nheard the Prophet (ﷺ) saying, 'The neighbor has more right to be taken care of by his neighbor (than \nanyone else),' then I would not have sold it to you.\"","reference":"Sahih al-Bukhari 6981, Book 90, Hadith 28","grade":"","question #":"question #2","question":"How does the concept of neighborly rights influence property transactions in Islamic teachings?","id":"bukhari-90-56"},{"hadith-eng":"The Prophet (ﷺ) said, 'O people! The reward of deeds depends upon the intentions, and every person will \nget the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, \nthen his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or \nfor a woman to marry, then his emigration was for what he emigrated for.\"","reference":"Sahih al-Bukhari 6953, Book 90, Hadith 1","grade":"","question #":"question #3","question":"How does the concept of intention affect the validity and reward of religious acts such as emigration?","id":"bukhari-90-57"},{"hadith-eng":"The Prophet (ﷺ) said, \"Allah does not accept prayer of anyone of you if he does Hadath (passes wind) till \nhe performs the ablution (anew).","reference":"Sahih al-Bukhari 6954, Book 90, Hadith 2","grade":"","question #":"question #3","question":"What steps should a Muslim take to ensure their prayer is accepted after experiencing Hadath?","id":"bukhari-90-58"},{"hadith-eng":"That Abu Bakr wrote for him, Zakat regulations which Allah's Messenger (ﷺ) had made compulsory, and \nwrote that one should neither collect various portions (of the property) nor divide the property into \nvarious portions in order to avoid paying Zakat.","reference":"Sahih al-Bukhari 6955, Book 90, Hadith 3","grade":"","question #":"question #3","question":"What role did Abu Bakr play in documenting the Zakat regulations established by the Prophet Muhammad (ﷺ)?","id":"bukhari-90-59"},{"hadith-eng":"A bedouin with unkempt hair came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Tell me what \nAllah has enjoined on me as regards prayers.\" The Prophet (ﷺ) said, \"You have to offer perfectly the five \n(compulsory) prayers in a day and a night (24 hrs.), except if you want to perform some extra optional \nprayers.\" The bedouin said, \"Tell me what Allah has enjoined on me as regards fasting.\" The Prophet (ﷺ) \nsaid, \"You have to observe fast during the month of Ramadan except if you fast some extra optional \nfast.\" The bedouin said, \"Tell me what Allah has enjoined on me as regard Zakat.\" The Prophet (ﷺ) then \ntold him the Islamic laws and regulations whereupon the bedouin said, \"By Him Who has honored \nyou, I will not perform any optional deeds of worship and I will not leave anything of what Allah has \nenjoined on me.\" Allah's Messenger (ﷺ) said, \"He will be successful if he has told the truth (or he will enter \nParadise if he said the truth).\" And some people said, \"The Zakat for one-hundred and twenty camels \nis two Hiqqas, and if the Zakat payer slaughters the camels intentionally or gives them as a present or \nplays some other trick in order to avoid the Zakat, then there is no harm (in it) for him.","reference":"Sahih al-Bukhari 6956, Book 90, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of truthfulness in fulfilling religious duties in Islam?","id":"bukhari-90-60"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has \nnot been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake \nand its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet (ﷺ) \nadded, \"By Allah, that snake will keep on following him until he stretches out his hand and let the \nsnake swallow it.\" Allah's Messenger (ﷺ) added, \"If the owner of camels does not pay their Zakat, then, on \nthe Day of Resurrection those camels will come to him and will strike his face with their hooves.\" \nSome people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells \nthose camels for similar camels or for sheep or cows or money one day before Zakat becomes due in \norder to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \n\"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which \nZakat becomes due), his Zakat will be valid.\"","reference":"Sahih al-Bukhari 6957, 6958, Book 90, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of paying Zakat in advance, and how is it viewed in Islamic jurisprudence?","id":"bukhari-90-61"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has \nnot been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake \nand its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet (ﷺ) \nadded, \"By Allah, that snake will keep on following him until he stretches out his hand and let the \nsnake swallow it.\" Allah's Messenger (ﷺ) added, \"If the owner of camels does not pay their Zakat, then, on \nthe Day of Resurrection those camels will come to him and will strike his face with their hooves.\" \nSome people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells \nthose camels for similar camels or for sheep or cows or money one day before Zakat becomes due in \norder to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \n\"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which \nZakat becomes due), his Zakat will be valid.\"","reference":"Sahih al-Bukhari 6957, 6958, Book 90, Hadith 5","grade":"","question #":"question #3","question":"What is the ruling on paying Zakat in advance, and how does it affect its validity?","id":"bukhari-90-62"},{"hadith-eng":"Sa'd bin 'Ubada Al-Ansari sought the verdict of Allah's Messenger (ﷺ) \n     regarding a vow made by his mother who had died before fulfilling it. \n     Allah's Messenger (ﷺ) said, \"Fulfill it on her behalf.\" Some people said, \n     \"If the number of camels reaches twenty, then their owner has to pay \n     four sheep as Zakat; and if their owner gives them as a gift or sells \n     them in order to escape the payment of Zakat cunningly before the \n     completion of a year, then he is not to pay anything, and if he \n     slaughters them and then dies, then no Zakat is to be taken from his \n     property.\"","reference":"Sahih al-Bukhari 6959, Book 90, Hadith 6","grade":"","question #":"question #3","question":"What are the implications of attempting to avoid Zakat through gifting or selling livestock before the completion of a year?","id":"bukhari-90-63"},{"hadith-eng":"Nafi narrated to me that 'Abdullah said that Allah's Messenger (ﷺ) forbade \n     the Shighar. I asked Nafi', \"What is the Shighar?\" He said, \"It is to \n     marry the daughter of a man and marry one's daughter to that man (at \n     the same time) without Mahr (in both cases); or to marry the sister of\n     a man and marry one's own sister to that man without Mahr.\" Some \n     people said, \"If one, by a trick, marries on the basis of Shighar, the\n     marriage is valid but its condition is illegal.\" The same scholar said\n     regarding Al-Mut'a, \"The marriage is invalid and its condition is \n     illegal.\" Some others said, \"The Mut'a and the Shighar are permissible\n     but the condition is illegal.\"","reference":"Sahih al-Bukhari 6960, Book 90, Hadith 7","grade":"","question #":"question #3","question":"How does the absence of Mahr affect the legality of certain marriage practices in Islam?","id":"bukhari-90-64"},{"hadith-eng":"`Ali was told that Ibn `Abbas did not see any harm in the Mut'a marriage. `Ali said, \"Allah's Messenger (ﷺ) \nforbade the Mut'a marriage on the Day of the battle of Khaibar and he forbade the eating of donkey's \nmeat.\" Some people said, \"If one, by a tricky way, marries temporarily, his marriage is illegal.\" Others \nsaid, \"The marriage is valid but its condition is illegal.\"","reference":"Sahih al-Bukhari 6961, Book 90, Hadith 8","grade":"","question #":"question #3","question":"What prohibitions did the Prophet Muhammad (ﷺ) declare on the Day of the battle of Khaibar?","id":"bukhari-90-65"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"One should not prevent others from watering their animals with the surplus of \nhis water in order to prevent them from benefiting by the surplus of grass.\"","reference":"Sahih al-Bukhari 6962, Book 90, Hadith 9","grade":"","question #":"question #3","question":"What ethical principles can be derived from the teachings on sharing surplus resources?","id":"bukhari-90-66"},{"hadith-eng":"Allah's Messenger (ﷺ) forbade the practice of An-Najsh.","reference":"Sahih al-Bukhari 6963, Book 90, Hadith 10","grade":"","question #":"question #3","question":"What are the implications of engaging in deceptive practices like An-Najsh in Islamic teachings?","id":"bukhari-90-67"},{"hadith-eng":"A man mentioned to the Prophet (ﷺ) that he had always been cheated in bargains. The Prophet (ﷺ) said, \n\"Whenever you do bargain, say, 'No cheating.'\"","reference":"Sahih al-Bukhari 6964, Book 90, Hadith 11","grade":"","question #":"question #3","question":"What is the significance of honesty and transparency in Islamic business ethics?","id":"bukhari-90-68"},{"hadith-eng":"That he asked `Aisha regarding the Verse: 'If you fear that you shall not be able to deal justly with the \norphan girls, marry (other) women of your choice.' (4.3) `Aisha said, \"It is about an orphan girl under \nthe custody of her guardian who being attracted by her wealth and beauty wants to marry her with \nMahr less than other women of her status. So such guardians were forbidden to marry them unless \nthey treat them justly by giving them their full Mahr. Then the people sought the verdict of Allah's \nApostle for such cases, whereupon Allah revealed: 'They ask your instruction concerning women..' \n(4.127) (The sub-narrator then mentioned the Hadith.)","reference":"Sahih al-Bukhari 6965, Book 90, Hadith 12","grade":"","question #":"question #3","question":"What are the conditions set by Islam for guardians who wish to marry orphan girls under their care?","id":"bukhari-90-69"},{"hadith-eng":"The Prophet (ﷺ) said, \"For every betrayer there will be a flag by which he will be recognized on the Day \nof Resurrection. \"","reference":"Sahih al-Bukhari 6966, Book 90, Hadith 13","grade":"","question #":"question #3","question":"What significance does a flag hold in the context of identifying betrayers in the afterlife?","id":"bukhari-90-70"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am only a human being, and you people have disputes. May be some one \namongst you can present his case in a more eloquent and convincing manner than the other, and I give \nmy judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody \nsomething of his brother's right then he should not take it as I have only, given him a piece of Fire.\" \n(See Hadith No. 638. Vol. 3)","reference":"Sahih al-Bukhari 6967, Book 90, Hadith 14","grade":"","question #":"question #3","question":"What warning is given to those who might unjustly benefit from a legal decision in this narration?","id":"bukhari-90-71"},{"hadith-eng":"The Prophet (ﷺ) said, \"A virgin should not be married till she is asked for her consent; and the matron \nshould not be married till she is asked whether she agrees to marry or not.\" It was asked, \"O Allah's \nApostle! How will she (the virgin) express her consent?\" He said, \"By keeping silent.\" Some people \nsaid that if a virgin is not asked for her consent and she is not married, and then a man, by playing a trick \npresents two false witnesses that he has married her with her consent and the judge confirms his \nmarriage as a true one, and the husband knows that the witnesses were false ones, then there is no \nharm for him to consummate his marriage with her and the marriage is regarded as valid.","reference":"Sahih al-Bukhari 6968, Book 90, Hadith 15","grade":"","question #":"question #3","question":"What are the implications of using false witnesses in the context of marriage in Islamic jurisprudence?","id":"bukhari-90-72"},{"hadith-eng":"A woman from the offspring of Ja`far was afraid lest her guardian marry her (to somebody) against \nher will. So she sent for two elderly men from the Ansar, `AbdurRahman and Mujammi', the two sons \nof Jariya, and they said to her, \"Don't be afraid, for Khansa' bint Khidam was given by her father in \nmarriage against her will, then the Prophet (ﷺ) cancelled that marriage.\" (See Hadith No. 78)","reference":"Sahih al-Bukhari 6969, Book 90, Hadith 16","grade":"","question #":"question #3","question":"What role do guardians play in the marriage decisions of women in Islam?","id":"bukhari-90-73"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"A lady slave should not be given in marriage until she is consulted, and a virgin \nshould not be given in marriage until her permission is granted.\" The people said, \"How will she \nexpress her permission?\" The Prophet (ﷺ) said, \"By keeping silent (when asked her consent).\" Some \npeople said, \"If a man, by playing a trick, presents two false witnesses before the judge to testify that \nhe has married a matron with her consent and the judge confirms his marriage, and the husband is sure \nthat he has never married her (before), then such a marriage will be considered as a legal one and he \nmay live with her as husband.\"","reference":"Sahih al-Bukhari 6970, Book 90, Hadith 17","grade":"","question #":"question #3","question":"What are the implications of presenting false witnesses in marriage contracts in Islam?","id":"bukhari-90-74"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"It is essential to have the consent of a virgin (for the marriage). I said, \"A virgin \nfeels shy.\" The Prophet; said, \"Her silence means her consent.\" Some people said, \"If a man falls in \nlove with an orphan slave girl or a virgin and she refuses (him) and then he makes a trick by bringing \ntwo false witnesses to testify that he has married her, and then she attains the age of puberty and \nagrees to marry him and the judge accepts the false witness and the husband knows that the witnesses \nwere false ones, he may consummate his marriage.\"","reference":"Sahih al-Bukhari 6971, Book 90, Hadith 18","grade":"","question #":"question #3","question":"What are the implications of using false witnesses in marriage according to Islamic law?","id":"bukhari-90-75"},{"hadith-eng":"Allah's Messenger (ﷺ) used to like sweets and also used to like honey, and whenever he finished the `Asr \nprayer, he used to visit his wives and stay with them. Once he visited Hafsa and remained with her \nlonger than the period he used to stay, so I enquired about it. It was said to me, \"A woman from her \ntribe gave her a leather skin containing honey as a present, and she gave some of it to Allah's Messenger (ﷺ) \nto drink.\" I said, \"By Allah, we will play a trick on him.\" So I mentioned the story to Sauda (the wife \nof the Prophet) and said to her, \"When he enters upon you, he will come near to you whereupon you \nshould say to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He will say, 'No.' Then you say to \nhim, 'What is this bad smell? ' And it would be very hard on Allah's Messenger (ﷺ) that a bad smell should be \nfound on his body. He will say, 'Hafsa has given me a drink of honey.' Then you should say to him, \n'Its bees must have sucked from the Al-`Urfut (a foul smelling flower).' I too, will tell him the same. \nAnd you, O Saifya, say the same.\" \nSo when the Prophet (ﷺ) entered upon Sauda (the following happened). Sauda said, \"By Him except \nWhom none has the right to be worshipped, I was about to say to him what you had told me to say \nwhile he was still at the gate because of fear from you. But when Allah 's Apostle came near to me, I \nsaid to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He replied, 'No.' I said, 'What about this \nsmell?' He said, 'Hafsa has given me a drink of honey.' I said, 'Its bees must have sucked Al-`Urfut.' \" \nWhen he entered upon me, I told him the same as that, and when he entered upon Safiya, she too told \nhim the same. So when he visited Hafsa again, she said to him, \"O Allah's Messenger (ﷺ)! Shall I give you a \ndrink of it (honey)?\" He said, \"I have no desire for it.\" Sauda said, Subhan Allah! We have deprived \nhim of it (honey).\" I said to her, \"Be quiet!\"","reference":"Sahih al-Bukhari 6972, Book 90, Hadith 19","grade":"","question #":"question #3","question":"What can be learned about the cultural practices and social interactions during the time of the Prophet (ﷺ) from this story?","id":"bukhari-90-76"},{"hadith-eng":"`Umar bin Al-Khattab left for Sham, and when he reached a placed called Sargh, he came to know \nthat there was an outbreak of an epidemic (of plague) in Sham. Then `AbdurRahman bin `Auf told \nhim that Allah's Messenger (ﷺ) said, \"If you hear the news of an outbreak of an epidemic (plague) in a \ncertain place, do not enter that place: and if the epidemic falls in a place while you are present in it, do \nnot leave that place to escape from the epidemic.\" So `Umar returned from Sargh.","reference":"Sahih al-Bukhari 6973, Book 90, Hadith 20","grade":"","question #":"question #3","question":"What actions did `Umar bin Al-Khattab take upon learning about the epidemic in Sham?","id":"bukhari-90-77"},{"hadith-eng":"That he heard Usama bin Zaid speaking to Sa`d, saying, \"Allah's Messenger (ﷺ) mentioned the plague and \nsaid, 'It is a means of punishment with which some nations were punished and some of it has \nremained, and it appears now and then. So whoever hears that there is an outbreak of plague in some \nland, he should not go to that land, and if the plague breaks out in the land where one is already \npresent, one should not run away from that land, escaping from the plague.\"","reference":"Sahih al-Bukhari 6974, Book 90, Hadith 21","grade":"","question #":"question #3","question":"What actions are recommended for individuals living in an area affected by a plague according to Islamic teachings?","id":"bukhari-90-78"},{"hadith-eng":"The Prophet (ﷺ) said, \"The one who takes back his gift is like a dog swallowing its own vomit, and we \n(believers) should not act according to this bad example.\"","reference":"Sahih al-Bukhari 6975, Book 90, Hadith 22","grade":"","question #":"question #3","question":"Why are believers advised against following the example of taking back gifts?","id":"bukhari-90-79"},{"hadith-eng":"The Prophet (ﷺ) has decreed that preemption is valid in all cases where the real estate concerned has not \nbeen divided, but if the boundaries are established and the ways are made, then there is no preemption. \nA man said, \"Preemption is only for the neighbor,\" and then he makes invalid what he has confirmed. \nHe said, \"If someone wants to buy a house and being afraid that the neighbor (of the house) may buy \nit through preemption, he buys one share out of one hundred shares of the house and then buys the rest \nof the house, then the neighbor can only have the right of preemption for the first share but not for the \nrest of the house; and the buyer may play such a trick in this case.\"","reference":"Sahih al-Bukhari 6976, Book 90, Hadith 23","grade":"","question #":"question #3","question":"What strategies might a buyer use to circumvent a neighbor's right of preemption in property purchases?","id":"bukhari-90-80"},{"hadith-eng":"Al-Miswar bin Makhrama came and put his hand on my shoulder and I \n     accompanied him to Sa'd. Abu Rafi' said to Al-Miswar, \"Won't you order\n     this (i.e. Sa'd) to buy my house which is in my yard?\" Sa'd said, \"I \n     will not offer more than four hundred in installments over a fixed \n     period.\" Abu Rafi said, \"I was offered five hundred cash but I \n     refused. Had I not heard the Prophet (ﷺ) saying, 'A neighbor is more \n     entitled to receive the care of his neighbor,' I would not have sold \n     it to you.\" The narrator said, to Sufyan: Ma'mar did not say so. \n     Sufyan said, \"But he did say so to me.\" Some people said, \"If someone \n     wants to sell a house and deprived somebody of the right of \n     preemption, he has the right to play a trick to render the preemption \n     invalid. And that is by giving the house to the buyer as a present and\n     marking its boundaries and giving it to him. The buyer then gives the \n     seller one-thousand Dirham as compensation in which case the preemptor\n     loses his right of preemption.\"","reference":"Sahih al-Bukhari 6977, Book 90, Hadith 24","grade":"","question #":"question #3","question":"What ethical considerations should be taken into account when selling property according to Islamic principles?","id":"bukhari-90-81"},{"hadith-eng":"Abu Rafi' said that Sa'd offered him \n     four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had \n     not heard Allah's Messenger (ﷺ) saying, 'A neighbor has more right to be \n     taken care of by his neighbor,' then I would not have given it to \n     you.\" Some people said, \"If one has bought a portion of a house and \n     wants to cancel the right of preemption, he may give it as a present \n     to his little son and he will not be obliged to take an oath.\"","reference":"Sahih al-Bukhari 6978, Book 90, Hadith 25","grade":"","question #":"question #3","question":"What ethical considerations should be taken into account when selling property in Islam?","id":"bukhari-90-82"},{"hadith-eng":"Allah's Messenger (ﷺ) appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's \ntribe. When he returned, the Prophet (ﷺ) called him to account. He said (to the Prophet, 'This is your \nmoney, and this has been given to me as a gift.\" On that, Allah's Messenger (ﷺ) said, \"Why didn't you stay in \nyour father's and mother's house to see whether you will be given gifts or not if you are telling the \ntruth?\" Then the Prophet (ﷺ) addressed us, and after praising and glorifying Allah, he said: \"Amma \nBa'du\", I employ a man from among you to manage some affair of what Allah has put under my \ncustody, and then he comes to me and says, 'This is your money and this has been given to me as a \ngift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? \nBy Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of \nResurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a \nmooing cow or a bleating sheep on meeting Allah.\" Then the Prophet (ﷺ) raised both his hands till the \nwhiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your \nMessage)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).","reference":"Sahih al-Bukhari 6979, Book 90, Hadith 26","grade":"","question #":"question #3","question":"What are the consequences of taking something unlawfully according to Islamic teachings?","id":"bukhari-90-83"},{"hadith-eng":"The Prophet (ﷺ) said, \"The neighbor has more right to be taken care of by his neighbor (than anyone \nelse).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play \na trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but \npaying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in \ncash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the \nhouse, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the \nhouse proves to belong to somebody else other than the seller, the buyer should take back from the \nseller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to \nsomebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it \ndoes not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams \n(instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man \nallows (some people) the playing of tricks amongst the Muslims (although) the Prophet (ﷺ) said, 'In \ndealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"","reference":"Sahih al-Bukhari 6980, Book 90, Hadith 27","grade":"","question #":"question #3","question":"What ethical considerations should be taken into account when dealing with preemption in property sales?","id":"bukhari-90-84"},{"hadith-eng":"Abu Rafi` sold a house to Sa`d bin Malik for four-hundred Mithqal of gold, and said, \"If I had not \nheard the Prophet (ﷺ) saying, 'The neighbor has more right to be taken care of by his neighbor (than \nanyone else),' then I would not have sold it to you.\"","reference":"Sahih al-Bukhari 6981, Book 90, Hadith 28","grade":"","question #":"question #3","question":"What ethical considerations should be taken into account when selling property according to Islamic principles?","id":"bukhari-90-85"}]