[{"hadith-eng":"The Prophet (ﷺ) said, \"I will be at my Lake-Fount (Kauthar) waiting for whoever will come to me. Then \nsome people will be taken away from me whereupon I will say, 'My followers!' It will be said, 'You \ndo not know they turned Apostates as renegades (deserted their religion).'\" (Ibn Abi Mulaika said, \n\"Allah, we seek refuge with You from turning on our heels from the (Islamic) religion and from being \nput to trial\").","reference":"Sahih al-Bukhari 7048, Book 92, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of the Lake-Fount (Kauthar) in Islamic eschatology?","id":"bukhari-92-1"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount (Kauthar) and some men amongst you \nwill be brought to me, and when I will try to hand them some water, they will be pulled away from me \nby force whereupon I will say, 'O Lord, my companions!' Then the Almighty will say, 'You do not \nknow what they did after you left, they introduced new things into the religion after you.'\"","reference":"Sahih al-Bukhari 7049, Book 92, Hadith 2","grade":"","question #":"question #1","question":"What is the significance of the Lake-Fount (Kauthar) in Islamic eschatology?","id":"bukhari-92-2"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"I am your predecessor at the Lake-Fount (Kauthar), and whoever will \ncome to it, will drink from it, and whoever will drink from it, will never become thirsty after that. \nThere will come to me some people whom I know and they know me, and then a barrier will be set up \nbetween me and them.\"","reference":"Sahih al-Bukhari 7050, Book 92, Hadith 3","grade":"","question #":"question #1","question":"What is the significance of the Lake-Fount (Kauthar) in Islamic eschatology?","id":"bukhari-92-3"},{"hadith-eng":"\"I will say those \npeople are from me. It will be said, 'You do not know what changes and new things they did after \nyou.' Then I will say, 'Far removed (from mercy), far removed (from mercy), those who changed (the \nreligion) after me!\"","reference":"Sahih al-Bukhari 7051, Book 92, Hadith 4","grade":"","question #":"question #1","question":"What warning is given about altering religious teachings after the Prophet's time?","id":"bukhari-92-4"},{"hadith-eng":"Allah's Messenger (ﷺ) said to us, \"You will see after me, selfishness (on the part of other people) and other \nmatters that you will disapprove of.\" They asked, \"What do you order us to do, O Allah's Messenger (ﷺ)? \n(under such circumstances)?\" He said, \"Pay their rights to them (to the rulers) and ask your right from \nAllah.\"","reference":"Sahih al-Bukhari 7052, Book 92, Hadith 5","grade":"","question #":"question #1","question":"How should one respond to selfishness and disapproved matters in society according to Islamic teachings?","id":"bukhari-92-5"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever disapproves of something done by his ruler then he should be patient, for \nwhoever disobeys the ruler even a little (little = a span) will die as those who died in the Pre-lslamic \nPeriod of Ignorance. (i.e. as rebellious Sinners).","reference":"Sahih al-Bukhari 7053, Book 92, Hadith 6","grade":"","question #":"question #1","question":"What is the significance of patience when dealing with actions of a ruler that one disapproves of?","id":"bukhari-92-6"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever notices something which he dislikes done by his ruler, then he should be \npatient, for whoever becomes separate from the company of the Muslims even for a span and then \ndies, he will die as those who died in the Pre-lslamic period of Ignorance (as rebellious sinners). \n(Fath-ul-Bari page 112, Vol. 16)","reference":"Sahih al-Bukhari 7054, Book 92, Hadith 7","grade":"","question #":"question #1","question":"What is the significance of patience when dealing with rulers or leaders in Islam?","id":"bukhari-92-7"},{"hadith-eng":"We entered upon 'Ubada bin As-Samit while he was sick. We said, \"May Allah make you healthy. \nWill you tell us a Hadith you heard from the Prophet (ﷺ) and by which Allah may make you benefit?\" He \nsaid, \"The Prophet (ﷺ) called us and we gave him the Pledge of allegiance for Islam, and among the \nconditions on which he took the Pledge from us, was that we were to listen and obey (the orders) both \nat the time when we were active and at the time when we were tired, and at our difficult time and at \nour ease and to be obedient to the ruler and give him his right even if he did not give us our right, and \nnot to fight against him unless we noticed him having open Kufr (disbelief) for which we would have \na proof with us from Allah.\"","reference":"Sahih al-Bukhari 7055, 7056, Book 92, Hadith 8","grade":"","question #":"question #1","question":"What are the conditions under which Muslims are required to listen and obey their leaders?","id":"bukhari-92-8"},{"hadith-eng":"We entered upon 'Ubada bin As-Samit while he was sick. We said, \"May Allah make you healthy. \nWill you tell us a Hadith you heard from the Prophet (ﷺ) and by which Allah may make you benefit?\" He \nsaid, \"The Prophet (ﷺ) called us and we gave him the Pledge of allegiance for Islam, and among the \nconditions on which he took the Pledge from us, was that we were to listen and obey (the orders) both \nat the time when we were active and at the time when we were tired, and at our difficult time and at \nour ease and to be obedient to the ruler and give him his right even if he did not give us our right, and \nnot to fight against him unless we noticed him having open Kufr (disbelief) for which we would have \na proof with us from Allah.\"","reference":"Sahih al-Bukhari 7055, 7056, Book 92, Hadith 8","grade":"","question #":"question #1","question":"What are the conditions under which Muslims are expected to listen and obey their leaders?","id":"bukhari-92-9"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You appointed such-and-such person and \nyou did not appoint me?\" The Prophet (ﷺ) said, \"After me you will see rulers not giving you your right \n(but you should give them their right) and be patient till you meet me.\"","reference":"Sahih al-Bukhari 7057, Book 92, Hadith 9","grade":"","question #":"question #1","question":"How should one respond to rulers or leaders who do not fulfill their rights towards the people?","id":"bukhari-92-10"},{"hadith-eng":"I heard the truthful and trusted by Allah (i.e., the Prophet (ﷺ) ) saying, \"The destruction of my followers \nwill be through the hands of young men from Quraish.\"","reference":"Sahih al-Bukhari 7058, Book 92, Hadith 10","grade":"","question #":"question #1","question":"What warning did the Prophet Muhammad (ﷺ) give regarding the future challenges faced by his followers?","id":"bukhari-92-11"},{"hadith-eng":"The Prophet (ﷺ) got up from his sleep with a flushed red face and said, \"None has the right to be \nworshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a \ngap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the \nnumber 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous \npeople among us?\" The Prophet (ﷺ) said, \"Yes, if evil increased.\"","reference":"Sahih al-Bukhari 7059, Book 92, Hadith 11","grade":"","question #":"question #1","question":"What warning did the Prophet Muhammad (ﷺ) give regarding the approaching evil for the Arabs?","id":"bukhari-92-12"},{"hadith-eng":"Once the Prophet (ﷺ) stood over one of the high buildings of Medina and then said (to the people), \"Do \nyou see what I see?\" They said, \"No.\" He said, \"I see afflictions falling among your houses as rain \ndrops fall.\"","reference":"Sahih al-Bukhari 7060, Book 92, Hadith 12","grade":"","question #":"question #1","question":"What is the significance of the Prophet's ability to foresee future events in Islamic teachings?","id":"bukhari-92-13"},{"hadith-eng":"The Prophet (ﷺ) said, \"Time will pass rapidly, good deeds will decrease, miserliness will be thrown (in the \nhearts of the people) afflictions will appear and there will be much 'Al-Harj.\" They said, \"O Allah's \nApostle! What is \"Al-Harj?\" He said, \"Killing! Killing!\" (See Hadith No. 63, Vol. 8)","reference":"Sahih al-Bukhari 7061, Book 92, Hadith 13","grade":"","question #":"question #1","question":"What are the signs of the end times as mentioned in the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-92-14"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour there will be days during which Religious \nignorance will spread, knowledge will be taken away (vanish) and there will be much Al-Harj, and Al- \nHarj means killing.\"","reference":"Sahih al-Bukhari 7062, 7063, Book 92, Hadith 14","grade":"","question #":"question #1","question":"What are the signs mentioned that indicate the approach of the Hour?","id":"bukhari-92-15"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour there will be days during which (religious) \nknowledge will be taken away (vanish) and general ignorance will spread, and there will be Al-Harj in \nabundance, and Al-Harj means killing.\"","reference":"Sahih al-Bukhari 7064, Book 92, Hadith 15","grade":"","question #":"question #1","question":"What are the signs that indicate the approach of the Hour according to Islamic teachings?","id":"bukhari-92-16"},{"hadith-eng":"The Prophet (ﷺ) said...(as above, 185). And Harj, in the Ethiopian language, means killing.","reference":"Sahih al-Bukhari 7065, Book 92, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of understanding different languages in the context of Islamic teachings?","id":"bukhari-92-17"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour, there will be the days of Al-Harj, and the \nreligious knowledge will be taken away (vanish i.e. by the death of Religious scholars) and general \nignorance will spread.\" Abu Musa said, \"Al-Harj, in the Ethiopian language, means killing.\"","reference":"Sahih al-Bukhari 7066, Book 92, Hadith 17","grade":"","question #":"question #1","question":"What are the signs that indicate the approach of the Hour in Islamic teachings?","id":"bukhari-92-18"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying; (It will be) from among the most wicked people who \nwill be living at the time when the Hour will be established.\"","reference":"Sahih al-Bukhari 7067, Book 92, Hadith 18","grade":"","question #":"question #1","question":"Who are considered among the most wicked people according to Islamic teachings?","id":"bukhari-92-19"},{"hadith-eng":"We went to Anas bin Malik and complained about the wrong we were suffering at the hand of Al- \nHajjaj. Anas bin Malik said, \"Be patient till you meet your Lord, for no time will come upon you but \nthe time following it will be worse than it. I heard that from the Prophet.\"","reference":"Sahih al-Bukhari 7068, Book 92, Hadith 19","grade":"","question #":"question #1","question":"What advice is given for dealing with suffering and injustice according to Islamic teachings?","id":"bukhari-92-20"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) woke up one night in a state of terror and said, \"Subhan \nAllah, How many treasures Allah has sent down! And how many afflictions have been sent down! \nWho will go and wake the lady dwellers (wives of the Prophet) up of these rooms (for prayers)?\" He \nmeant his wives, so that they might pray. He added, \"A well-dressed (soul) in this world may be naked \nin the Hereafter.\"","reference":"Sahih al-Bukhari 7069, Book 92, Hadith 20","grade":"","question #":"question #1","question":"What is the significance of waking up for prayer during the night in Islam?","id":"bukhari-92-21"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever takes up arms against us, is not from us.\"","reference":"Sahih al-Bukhari 7070, Book 92, Hadith 21","grade":"","question #":"question #1","question":"What is the stance of Islam on taking up arms against fellow Muslims?","id":"bukhari-92-22"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes up arms against us, is not from us.\"","reference":"Sahih al-Bukhari 7071, Book 92, Hadith 22","grade":"","question #":"question #1","question":"What is the stance of Islam on taking up arms against fellow Muslims?","id":"bukhari-92-23"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you should point out towards his Muslim brother with a weapon, for he \ndoes not know, Satan may tempt him to hit him and thus he would fall into a pit of fire (Hell)\"","reference":"Sahih al-Bukhari 7072, Book 92, Hadith 23","grade":"","question #":"question #1","question":"What are the potential dangers of pointing a weapon at someone, even in jest, according to Islamic teachings?","id":"bukhari-92-24"},{"hadith-eng":"I said to `Amr, \"O Abu Muhammad! Did you hear Jabir bin `Abdullah saying, 'A man carrying arrows \npassed through the mosque and Allah's Messenger (ﷺ) said to him, 'Hold the arrows by their heads! \"`Amr \nreplied, \"Yes.\"","reference":"Sahih al-Bukhari 7073, Book 92, Hadith 24","grade":"","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) give regarding carrying weapons in public places?","id":"bukhari-92-25"},{"hadith-eng":"A man passed through the mosque and he was carrying arrows, the heads of which were exposed \n(protruding). The man was ordered (by the Prophet) to hold the iron heads so that it might not scratch \n(injure) any Muslim.","reference":"Sahih al-Bukhari 7074, Book 92, Hadith 25","grade":"","question #":"question #1","question":"What precautions should be taken to ensure the safety of others in a communal space?","id":"bukhari-92-26"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you passed through our mosque or through our market while carrying \narrows, he should hold the iron heads,\" or said, \"..... he should hold (their heads) firmly with his hand \nlest he should injure one of the Muslims with it.\"","reference":"Sahih al-Bukhari 7075, Book 92, Hadith 26","grade":"","question #":"question #1","question":"What precautions should be taken to ensure the safety of others in public spaces according to Islamic teachings?","id":"bukhari-92-27"},{"hadith-eng":"The Prophet, said, \"Abusing a Muslim is Fusuq (evil doing) and killing him is Kufr (disbelief).","reference":"Sahih al-Bukhari 7076, Book 92, Hadith 27","grade":"","question #":"question #1","question":"What are the consequences of abusing a fellow Muslim in Islamic teachings?","id":"bukhari-92-28"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Do not revert to disbelief after me by striking (cutting) the necks of one \nanother.\"","reference":"Sahih al-Bukhari 7077, Book 92, Hadith 28","grade":"","question #":"question #1","question":"What warning did the Prophet Muhammad (ﷺ) give regarding actions that could lead to disbelief?","id":"bukhari-92-29"},{"hadith-eng":"Allah's Messenger (ﷺ) addressed the people saying, \"Don't you know what is the day today?\" They replied, \n\"Allah and His Apostle know better.\" We thought that he might give that day another name. The \nProphet said, \"Isn't it the day of An-Nahr?\" We replied, \"Yes. O Allah's Messenger (ﷺ).\" He then said, \"What \ntown is this? Isn't it the forbidden (Sacred) Town (Mecca)?\" We replied, \"Yes, O Allah's Messenger (ﷺ).\" He \nthen said, \"Your blood, your properties, your honors and your skins (i.e., bodies) are as sacred to one \nanother like the sanctity of this day of yours in this month of yours in this town of yours. (Listen) \nHaven't I conveyed Allah's message to you?\" We replied, \"Yes\" He said, \"O Allah! Be witness (for it). \nSo it is incumbent upon those who are present to convey it (this message of mine) to those who are \nabsent because the informed one might comprehend what I have said better than the present audience \nwho will convey it to him.)\" The narrator added: In fact, it was like that. The Prophet (ﷺ) added, \"Beware! \nDo not renegade as disbelievers after me by striking (cutting) the necks of one another.\"","reference":"Sahih al-Bukhari 7078, Book 92, Hadith 29","grade":"","question #":"question #1","question":"What is the significance of the sanctity of life, property, and honor in Islam?","id":"bukhari-92-30"},{"hadith-eng":"The Prophet (ﷺ) said, \"Beware! Do not renegade as (disbelievers) after me by striking (cutting) the necks \nof one another.\"","reference":"Sahih al-Bukhari 7079, Book 92, Hadith 30","grade":"","question #":"question #1","question":"What warning did the Prophet Muhammad (ﷺ) give regarding the behavior of Muslims towards each other after his passing?","id":"bukhari-92-31"},{"hadith-eng":"The Prophet (ﷺ) said to me during Hajjat-al-Wada`, \"Let the people keep quiet and listen.\" Then he said \n(addressing the people), \"Beware! Do not renegade as disbelievers after me by striking (cutting) the \nnecks of one another.\"","reference":"Sahih al-Bukhari 7080, Book 92, Hadith 31","grade":"","question #":"question #1","question":"What warning did the Prophet Muhammad (ﷺ) give regarding the behavior of Muslims after his departure?","id":"bukhari-92-32"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will be afflictions (in the near future) during which a sitting person will \nbe better than a standing one, and the standing one will be better than the walking one, and the \nwalking one will be better than the running one, and whoever will expose himself to these afflictions, \nthey will destroy him. So whoever can find a place of protection or refuge from them, should take \nshelter in it.\"","reference":"Sahih al-Bukhari 7081, Book 92, Hadith 32","grade":"","question #":"question #1","question":"What is the significance of seeking refuge or protection during times of affliction?","id":"bukhari-92-33"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will be afflictions (in the near future) during which a sitting person will \nbe better than a standing one, and the standing one will be better than a walking one, and the walking \none will be better than a running one, and whoever will expose himself to these afflictions, they will \ndestroy him. So whoever can find a place of protection or refuge from them, should take shelter in it.\"","reference":"Sahih al-Bukhari 7082, Book 92, Hadith 33","grade":"","question #":"question #1","question":"What is the significance of seeking refuge or protection during times of affliction?","id":"bukhari-92-34"},{"hadith-eng":"(Al-Ahnaf said:) I went out carrying my arms during the nights of the affliction (i.e. the war between \n`Ali and `Aisha) and Abu Bakra met me and asked, \"Where are you going?\" I replied, \"I intend to help \nthe cousin of Allah's Messenger (ﷺ) (i.e.,`Ali).\" Abu Bakra said, \"Allah's Messenger (ﷺ) said, 'If two Muslims take \nout their swords to fight each other, then both of them will be from amongst the people of the Hell- \nFire.' It was said to the Prophet, 'It is alright for the killer but what about the killed one?' He replied, \n'The killed one had the intention to kill his opponent.'\" (See Hadith No. 30, Vol. 1)Narrated Al-Ahnaf:Abu Bakra said: The Prophet (ﷺ) said (as above, 204).","reference":"Sahih al-Bukhari 7083, Book 92, Hadith 34","grade":"","question #":"question #1","question":"What is the Islamic perspective on Muslims engaging in combat against each other?","id":"bukhari-92-35"},{"hadith-eng":"The people used to ask Allah's Messenger (ﷺ) about the good but I used to ask him about the evil lest I \nshould be overtaken by them. So I said, \"O Allah's Messenger (ﷺ)! We were living in ignorance and in an \n(extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil \nafter this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but \nit will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some \npeople who will guide others not according to my tradition? You will approve of some of their deeds \nand disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, \n(there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their \ncall, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them \nto us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do \nyou order me to do if such a state should take place in my life?\" He said, \"Stick to the group of \nMuslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" \nHe said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death \novertakes you while you are in that state.\"","reference":"Sahih al-Bukhari 7084, Book 92, Hadith 35","grade":"","question #":"question #1","question":"What guidance does Islam provide for dealing with times of moral and social corruption?","id":"bukhari-92-36"},{"hadith-eng":"An army unit was being recruited from the people of Medina and my name was written among them. \nThen I met `Ikrima, and when I informed him about it, he discouraged me very strongly and said, \"Ibn \n`Abbas told me that there were some Muslims who were with the pagans to increase their number \nagainst Allah's Messenger (ﷺ) (and the Muslim army) so arrows (from the Muslim army) would hit one of \nthem and kill him or a Muslim would strike him (with his sword) and kill him. So Allah revealed:-- \n'Verily! As for those whom the angels take (in death) while they are wronging themselves (by staying \namong the disbelievers).' (4.97)","reference":"Sahih al-Bukhari 7085, Book 92, Hadith 36","grade":"","question #":"question #1","question":"What are the consequences for Muslims who align themselves with disbelievers against their own community?","id":"bukhari-92-37"},{"hadith-eng":"Allah's Messenger (ﷺ) related to us, two prophetic narrations one of which I have seen fulfilled and I am \nwaiting for the fulfillment of the other. The Prophet (ﷺ) told us that the virtue of honesty descended in the \nroots of men's hearts (from Allah) and then they learned it from the Qur'an and then they learned it \nfrom the Sunna (the Prophet's traditions). The Prophet (ﷺ) further told us how that honesty will be taken \naway: He said: \"Man will go to sleep during which honesty will be taken away from his heart and only \nits trace will remain in his heart like the trace of a dark spot; then man will go to sleep, during which \nhonesty will decrease further still, so that its trace will resemble the trace of blister as when an ember \nis dropped on one's foot which would make it swell, and one would see it swollen but there would be \nnothing inside. People would be carrying out their trade but hardly will there be a trustworthy person. \nIt will be said, 'in such-and-such tribe there is an honest man,' and later it will be said about some man, \n'What a wise, polite and strong man he is!' Though he will not have faith equal even to a mustard seed \nin his heart.\" No doubt, there came upon me a time when I did not mind dealing (bargaining) with \nanyone of you, for if he was a Muslim his Islam would compel him to pay me what is due to me, and \nif he was a Christian, the Muslim official would compel him to pay me what is due to me, but today I \ndo not deal except with such-and-such person.","reference":"Sahih al-Bukhari 7086, Book 92, Hadith 37","grade":"","question #":"question #1","question":"How does the concept of honesty evolve according to Islamic teachings?","id":"bukhari-92-38"},{"hadith-eng":"That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your \nheels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but \nAllah's Messenger (ﷺ) allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: \nWhen `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- \nRabadha and married there and begot children, and he stayed there till a few nights before his death \nwhen he came to Medina.","reference":"Sahih al-Bukhari 7087, Book 92, Hadith 38","grade":"","question #":"question #1","question":"What was the reason Salama bin Al-Akwa` chose to live with the Bedouins in the desert?","id":"bukhari-92-39"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will come a time when the best property of a Muslim will be sheep which \nhe will take to the tops of mountains and the places of rainfall so as to flee with his religion from the \nafflictions.","reference":"Sahih al-Bukhari 7088, Book 92, Hadith 39","grade":"","question #":"question #1","question":"What circumstances might lead a Muslim to seek isolation with their property for the sake of their faith?","id":"bukhari-92-40"},{"hadith-eng":"The people started asking the Prophet (ﷺ) too many questions importunately. So one day he ascended the \npulpit and said, \"You will not ask me any question but I will explain it to you.\" I looked right and left, \nand behold, every man was covering his head with his garment and weeping. Then got up a man who, \nwhenever quarreling with somebody, used to be accused of not being the son of his father. He said, \"O \nAllah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then `Umar got \nup and said, \"We accept Allah as our Lord, Islam as our religion and Muhammad as our Apostle and \nwe seek refuge with Allah from the evil of afflictions.\" The Prophet (ﷺ) said, \" I have never seen the good \nand bad like on this day. No doubt, Paradise and Hell was displayed in front of me till I saw them in \nfront of that wall,\" Qatada said: This Hadith used to be mentioned as an explanation of this Verse:-- 'O \nyou who believe! Ask not questions about things which, if made plain to you, may cause you trouble.' \n(5.101)","reference":"Sahih al-Bukhari 7089, Book 92, Hadith 40","grade":"","question #":"question #1","question":"What is the significance of asking too many questions in Islam and how can it lead to trouble?","id":"bukhari-92-41"},{"hadith-eng":"The the above hadith was narrated by Anas through another chain and said (with the wording) \"and every man had his head wrapped in his garment and weeping\".  And he said (with the wording) \"seeking refuge with Allah from the evil of afflictions\" or he said \"I seek refuge with Allah from the evil of afflictions.\"","reference":"Sahih al-Bukhari 7090, Book 92, Hadith 41","grade":"","question #":"question #1","question":"What is the significance of seeking refuge with Allah from the evil of afflictions?","id":"bukhari-92-42"},{"hadith-eng":"The above hadith is narrated on the authority of Anas thorugh another chain and he said (with the wording) \"seeking refuge with Allah from the evil of afflictions.\"","reference":"Sahih al-Bukhari 7091, Book 92, Hadith 42","grade":"","question #":"question #1","question":"What is the significance of seeking refuge with Allah from the evil of afflictions?","id":"bukhari-92-43"},{"hadith-eng":"The Prophet (ﷺ) stood up beside the pulpit (and pointed with his finger towards the East) and said, \n\"Afflictions are there! Afflictions are there, from where the side of the head of Satan comes out,\" or \nsaid, \"..the side of the sun..\"","reference":"Sahih al-Bukhari 7092, Book 92, Hadith 43","grade":"","question #":"question #1","question":"What is the significance of the Prophet's warning about afflictions coming from the East?","id":"bukhari-92-44"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) while he was facing the East, saying, \"Verily! Afflictions are there, from \nwhere the side of the head of Satan comes out.\"","reference":"Sahih al-Bukhari 7093, Book 92, Hadith 44","grade":"","question #":"question #1","question":"What is the significance of the direction mentioned in relation to afflictions in Islamic teachings?","id":"bukhari-92-45"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Bestow Your blessings on our Sham! O Allah! Bestow Your blessings on \nour Yemen.\" The People said, \"And also on our Najd.\" He said, \"O Allah! Bestow Your blessings on \nour Sham (north)! O Allah! Bestow Your blessings on our Yemen.\" The people said, \"O Allah's \nApostle! And also on our Najd.\" I think the third time the Prophet (ﷺ) said, \"There (in Najd) is the place \nof earthquakes and afflictions and from there comes out the side of the head of Satan.\"","reference":"Sahih al-Bukhari 7094, Book 92, Hadith 45","grade":"","question #":"question #1","question":"What significance do Sham and Yemen hold in Islamic tradition according to the Prophet's supplication?","id":"bukhari-92-46"},{"hadith-eng":"`Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before \nwe asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles \nduring the time of the afflictions, as Allah says:-- \n'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" \n(2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother \nbereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion \n(The pagans will either kill him or chain him as a captive). His fighting was not like your fighting \nwhich is carried on for the sake of ruling.\"","reference":"Sahih al-Bukhari 7095, Book 92, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of understanding the context of afflictions mentioned in religious texts?","id":"bukhari-92-47"},{"hadith-eng":"I heard Hudhaifa saying, \"While we were sitting with `Umar, he said, 'Who among you remembers the \nstatement of the Prophet (ﷺ) about the afflictions?' Hudhaifa said, \"The affliction of a man in his family, \nhis property, his children and his neighbors are expiated by his prayers, Zakat (and alms) and \nenjoining good and forbidding evil.\" `Umar said, \"I do not ask you about these afflictions, but about \nthose afflictions which will move like the waves of the sea.\" Hudhaifa said, \"Don't worry about it, O \nchief of the believers, for there is a closed door between you and them.\" `Umar said, \"Will that door \nbe broken or opened?\" I said, \"No. it will be broken.\" `Umar said, \"Then it will never be closed,\" I \nsaid, \"Yes.\" We asked Hudhaifa, \"Did `Umar know what that door meant?\" He replied, \"Yes, as I \nknow that there will be night before tomorrow morning, that is because I narrated to him a true \nnarration free from errors.\" We dared not ask Hudhaifa as to whom the door represented so we \nordered Masruq to ask him what does the door stand for? He replied, \"`Umar.\"","reference":"Sahih al-Bukhari 7096, Book 92, Hadith 47","grade":"","question #":"question #1","question":"What are the means by which a person's afflictions in family, property, and neighbors can be expiated?","id":"bukhari-92-48"},{"hadith-eng":"The Prophet (ﷺ) went out to one of the gardens of Medina for some business and I went out to follow him. \nWhen he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the \nProphet though he has not ordered me.\" The Prophet (ﷺ) went and finished his need and went to sit on the \nconstructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu \nBakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr \nwaited outside and I went to the Prophet (ﷺ) and said, \"O Allah's Prophet! Abu Bakr asks your permission \nto enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr \nentered and sat on the right side of the Prophet (ﷺ) and uncovered his legs and hung them in the well. \nThen `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet (ﷺ) said, \"Admit him \nand give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the \nProphet and uncovered his legs and hung them in the well so that one side of the well became fully \noccupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \n\"Wait till I get permission for you.\" The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of \nentering Paradise with a calamity which will befall him.\" When he entered, he could not find any \nplace to sit with them so he went to the other edge of the well opposite them and uncovered his legs \nand hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his \ncoming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three \nare together and the grave of `Uthman is separate from theirs.\")","reference":"Sahih al-Bukhari 7097, Book 92, Hadith 48","grade":"","question #":"question #1","question":"What significance does the Prophet's act of giving glad tidings of Paradise to his companions hold in Islamic teachings?","id":"bukhari-92-49"},{"hadith-eng":"Someone said to Usama, \"Will you not talk to this (Uthman)?\" Usama said, \"I talked to him (secretly) \nwithout being the first man to open an evil door. I will never tell a ruler who rules over two men or \nmore that he is good after I heard Allah's Messenger (ﷺ) saying, 'A man will be brought and put in Hell (Fire) \nand he will circumambulate (go around and round) in Hell (Fire) like a donkey of a (flour) grinding \nmill, and all the people of Hell (Fire) will gather around him and will say to him, O so-and-so! Didn't \nyou use to order others for good and forbid them from evil?' That man will say, 'I used to order others \nto do good but I myself never used to do it, and I used to forbid others from evil while I myself used to \ndo evil.' \"","reference":"Sahih al-Bukhari 7098, Book 92, Hadith 49","grade":"","question #":"question #1","question":"What are the consequences of hypocrisy in religious teachings and actions?","id":"bukhari-92-50"},{"hadith-eng":"During the battle of Al-Jamal, Allah benefited me with a Word (I heard from the Prophet). When the \nProphet heard the news that the people of the Persia had made the daughter of Khosrau their Queen \n(ruler), he said, \"Never will succeed such a nation as makes a woman their ruler.\"","reference":"Sahih al-Bukhari 7099, Book 92, Hadith 50","grade":"","question #":"question #1","question":"What is the significance of leadership roles in Islam, particularly concerning gender?","id":"bukhari-92-51"},{"hadith-eng":"When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir and Hasan bin `Ali \nwho came to us at Kufa and ascended the pulpit. Al-Hasan bin `Ali was at the top of the pulpit and \n`Ammar was below Al-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has \nmoved to Al-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But \nAllah has put you to test whether you obey Him (Allah) or her (`Aisha).","reference":"Sahih al-Bukhari 7100, Book 92, Hadith 51","grade":"","question #":"question #1","question":"What is the significance of the relationship between the Prophet's wives and the Muslim community?","id":"bukhari-92-52"},{"hadith-eng":"`Ammar stood on the pulpit at Kufa and mentioned `Aisha and her coming (to Busra) and said, \"She is \nthe wife of your Prophet in this world and in the Hereafter, but you people are being put to test in this \nissue.\"","reference":"Sahih al-Bukhari 7101, Book 92, Hadith 52","grade":"","question #":"question #1","question":"What is the significance of Aisha's status as the wife of the Prophet in both this world and the Hereafter?","id":"bukhari-92-53"},{"hadith-eng":"Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).","reference":"Sahih al-Bukhari 7102, 7103, 7104, Book 92, Hadith 53","grade":"","question #":"question #1","question":"What can be inferred about the importance of unity and support among Muslims during times of conflict?","id":"bukhari-92-54"},{"hadith-eng":"I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"","reference":"Sahih al-Bukhari 7105, 7106, 7107, Book 92, Hadith 54","grade":"","question #":"question #1","question":"What can be inferred about the importance of resolving disagreements among companions in Islam?","id":"bukhari-92-55"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If Allah sends punishment upon a nation then it befalls upon the whole \npopulation indiscriminately and then they will be resurrected (and judged) according to their deeds. \"","reference":"Sahih al-Bukhari 7108, Book 92, Hadith 55","grade":"","question #":"question #1","question":"How does divine punishment affect a community as a whole according to Islamic teachings?","id":"bukhari-92-56"},{"hadith-eng":"When Al-Hasan bin `Ali moved with army units against Muawiya, `Amr bin AL-As said to Muawiya, \n\"I see an army that will not retreat unless and until the opposing army retreats.\" Muawiya said, \"(If the \nMuslims are killed) who will look after their children?\" `Amr bin Al-As said: I (will look after them). \nOn that, `Abdullah bin 'Amir and `Abdur-Rahman bin Samura said, \"Let us meet Muawaiya and \nsuggest peace.\" Al-Hasan Al-Basri added: No doubt, I heard that Abu Bakra said, \"Once while the \nProphet was addressing (the people), Al-Hasan (bin `Ali) came and the Prophet (ﷺ) said, 'This son of mine \nis a chief, and Allah may make peace between two groups of Muslims through him.\"","reference":"Sahih al-Bukhari 7109, Book 92, Hadith 56","grade":"","question #":"question #1","question":"What role did Al-Hasan bin Ali play in the reconciliation between two groups of Muslims?","id":"bukhari-92-57"},{"hadith-eng":"(Usama's Maula) Usama (bin Zaid) sent me to `Ali (at Kufa) and said, \"`Ali will ask you, 'What has \nprevented your companion from joining me?' You then should say to him, 'If you (`Ali) were in the \nmouth of a lion, I would like to be with you, but in this matter I won't take any part.' \" Harmala added: \n\"`Ali didn't give me anything (when I conveyed the message to him) so I went to Hasan, Hussain and \nIbn Ja`far and they loaded my camels with much (wealth).","reference":"Sahih al-Bukhari 7110, Book 92, Hadith 57","grade":"","question #":"question #1","question":"What can be inferred about the relationship between Usama bin Zaid and Ali from this narration?","id":"bukhari-92-58"},{"hadith-eng":"When the people of Medina dethroned Yazid bin Muawiya, Ibn `Umar gathered his special friends \nand children and said, \"I heard the Prophet (ﷺ) saying, 'A flag will be fixed for every betrayer on the Day \nof Resurrection,' and we have given the oath of allegiance to this person (Yazid) in accordance with \nthe conditions enjoined by Allah and His Apostle and I do not know of anything more faithless than \nfighting a person who has been given the oath of allegiance in accordance with the conditions \nenjoined by Allah and His Apostle , and if ever I learn that any person among you has agreed to \ndethrone Yazid, by giving the oath of allegiance (to somebody else) then there will be separation \nbetween him and me.\"","reference":"Sahih al-Bukhari 7111, Book 92, Hadith 58","grade":"","question #":"question #1","question":"What is the significance of maintaining oaths of allegiance in Islam?","id":"bukhari-92-59"},{"hadith-eng":"When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and \nQurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we \nentered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with \nhim and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the \npeople has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of \nbeing angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in \nmisery and were few in number and misguided, and that Allah has brought you out of all that with \nIslam and with Muhammad till He brought you to this state (of prosperity and happiness) which you \nsee now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. \nThe one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: \nand those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that \none who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly \ngain.\"","reference":"Sahih al-Bukhari 7112, Book 92, Hadith 59","grade":"","question #":"question #1","question":"What are the consequences of seeking worldly gains according to Islamic teachings?","id":"bukhari-92-60"},{"hadith-eng":"Hudhaifa bin Al-Yaman said, 'The hypocrites of today are worse than those of the lifetime of the \nProphet, because in those days they used to do evil deeds secretly but today they do such deeds \nopenly.'","reference":"Sahih al-Bukhari 7113, Book 92, Hadith 60","grade":"","question #":"question #1","question":"How has the behavior of hypocrites changed from the time of the Prophet to today?","id":"bukhari-92-61"},{"hadith-eng":"Hudhaifa said, 'In fact, it was hypocrisy that existed in the lifetime of the Prophet (ﷺ) but today it is Kufr \n(disbelief) after belief.'","reference":"Sahih al-Bukhari 7114, Book 92, Hadith 61","grade":"","question #":"question #1","question":"What is the difference between hypocrisy during the Prophet's lifetime and disbelief after belief in contemporary times?","id":"bukhari-92-62"},{"hadith-eng":"The Prophet (ﷺ) said, \"The Hour will not be established till a man passes by a grave of somebody and \nsays, 'Would that I were in his place.' \"","reference":"Sahih al-Bukhari 7115, Book 92, Hadith 62","grade":"","question #":"question #1","question":"What are the signs of the approaching Hour according to Islamic teachings?","id":"bukhari-92-63"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till the buttocks of the women of the tribe of \nDaus move while going round Dhi-al-Khalasa.\" Dhi-al-Khalasa was the idol of the Daus tribe which \nthey used to worship in the Pre Islamic Period of ignorance.","reference":"Sahih al-Bukhari 7116, Book 92, Hadith 63","grade":"","question #":"question #1","question":"What are some signs mentioned in Islamic teachings that indicate the approach of the Hour?","id":"bukhari-92-64"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till a man from Qahtan appears, driving the \npeople with his stick.\"","reference":"Sahih al-Bukhari 7117, Book 92, Hadith 64","grade":"","question #":"question #1","question":"What are the signs mentioned in Islamic teachings that indicate the approach of the Hour?","id":"bukhari-92-65"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till a fire will come out of the land of Hijaz, \nand it will throw light on the necks of the camels at Busra.\"","reference":"Sahih al-Bukhari 7118, Book 92, Hadith 65","grade":"","question #":"question #1","question":"What are some of the signs of the Hour mentioned in Islamic teachings?","id":"bukhari-92-66"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Soon the river \"Euphrates\" will disclose the treasure (the mountain) of gold, so \nwhoever will be present at that time should not take anything of it.\" Al-A'raj narrated from Abii \nHuraira that the Prophet (ﷺ) said the same but he said, \"It (Euphrates) will uncover a mountain of gold \n(under it).","reference":"Sahih al-Bukhari 7119, Book 92, Hadith 66","grade":"","question #":"question #1","question":"What is the significance of the Euphrates River in Islamic eschatology?","id":"bukhari-92-67"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Give in charity because there will come a time on the people when a \nperson will go out with his alms from place to place but will not find anybody to accept it.\"","reference":"Sahih al-Bukhari 7120, Book 92, Hadith 67","grade":"","question #":"question #1","question":"What is the significance of giving charity in Islam, especially in anticipation of future times?","id":"bukhari-92-68"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established (1) till two big groups fight each other \nwhereupon there will be a great number of casualties on both sides and they will be following one and \nthe same religious doctrine, (2) till about thirty Dajjals (liars) appear, and each one of them will claim \nthat he is Allah's Messenger (ﷺ), (3) till the religious knowledge is taken away (by the death of Religious \nscholars) (4) earthquakes will increase in number (5) time will pass quickly, (6) afflictions will \nappear, (7) Al-Harj, (i.e., killing) will increase, (8) till wealth will be in abundance ---- so abundant \nthat a wealthy person will worry lest nobody should accept his Zakat, and whenever he will present it \nto someone, that person (to whom it will be offered) will say, 'I am not in need of it, (9) till the people \ncompete with one another in constructing high buildings, (10) till a man when passing by a grave of \nsomeone will say, 'Would that I were in his place (11) and till the sun rises from the West. So when \nthe sun will rise and the people will see it (rising from the West) they will all believe (embrace Islam) \nbut that will be the time when: (As Allah said,) 'No good will it do to a soul to believe then, if it \nbelieved not before, nor earned good (by deeds of righteousness) through its Faith.' (6.158) And the \nHour will be established while two men spreading a garment in front of them but they will not be able \nto sell it, nor fold it up; and the Hour will be established when a man has milked his she-camel and has \ntaken away the milk but he will not be able to drink it; and the Hour will be established before a man \nrepairing a tank (for his livestock) is able to water (his animals) in it; and the Hour will be established \nwhen a person has raised a morsel (of food) to his mouth but will not be able to eat it.\"","reference":"Sahih al-Bukhari 7121, Book 92, Hadith 68","grade":"","question #":"question #1","question":"What are some of the signs that indicate the approach of the Hour according to Islamic teachings?","id":"bukhari-92-69"},{"hadith-eng":"Nobody asked the Prophet (ﷺ) as many questions as I asked regarding Ad-Dajjal. The Prophet (ﷺ) said to me, \n\"What worries you about him?\" I said, \"Because the people say that he will have a mountain of bread \nand a river of water with him (i.e. he will have abundance of food and water)\" The Prophet (ﷺ) said, \"Nay, \nhe is too mean to be allowed such a thing by Allah\"' (but it is only to test mankind whether they \nbelieve in Allah or in Ad-Dajjal.)","reference":"Sahih al-Bukhari 7122, Book 92, Hadith 69","grade":"","question #":"question #1","question":"What concerns did people have about Ad-Dajjal's ability to provide abundance of food and water?","id":"bukhari-92-70"},{"hadith-eng":"The Prophet (ﷺ) said (about Ad-Dajjal) that he is one eyed, his right eye is as if a protruding out grape.\"","reference":"Sahih al-Bukhari 7123, Book 92, Hadith 70","grade":"","question #":"question #1","question":"What are the physical characteristics of Ad-Dajjal as described in Islamic teachings?","id":"bukhari-92-71"},{"hadith-eng":"The Prophet (ﷺ) said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will \nshake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"","reference":"Sahih al-Bukhari 7124, Book 92, Hadith 71","grade":"","question #":"question #1","question":"What is the significance of Medina in the events related to Ad-Dajjal?","id":"bukhari-92-72"},{"hadith-eng":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate (guarding them).","reference":"Sahih al-Bukhari 7125, Book 92, Hadith 72","grade":"","question #":"question #1","question":"What is the significance of Medina in Islamic eschatology concerning the protection from Al-Masih Ad-Dajjal?","id":"bukhari-92-73"},{"hadith-eng":"[as above]","reference":"Sahih al-Bukhari 7126, Book 92, Hadith 73","grade":"","question #":"question #1","question":"What is the significance of verifying the authenticity of a narration in Islamic tradition?","id":"bukhari-92-74"},{"hadith-eng":"Allah's Messenger (ﷺ) stood up amongst the people and then praised and glorified Allah as He deserved and \nthen he mentioned Ad-Dajjal, saying, \"I warn you of him, and there was no prophet but warned his \nfollowers of him; but I will tell you something about him which no prophet has told his followers: Ad- \nDajjal is one-eyed whereas Allah is not.\"","reference":"Sahih al-Bukhari 7127, Book 92, Hadith 74","grade":"","question #":"question #1","question":"What are the characteristics of Ad-Dajjal as described by the Prophet Muhammad (ﷺ)?","id":"bukhari-92-75"},{"hadith-eng":"Allah's Messenger (ﷺ) said. \"While I was sleeping, I saw myself (in a dream) performing Tawaf around the \nKa`ba. Behold, I saw a reddish-white man with lank hair, and water was dropping from his head. I \nasked, \"Who is this?' They replied, 'The son of Mary.' Then I turned my face to see another man with \na huge body, red complexion and curly hair and blind in one eye. His eye looked like a protruding out \ngrape. They said (to me), He is Ad-Dajjal.\" The Prophet (ﷺ) added, \"The man he resembled most is Ibn \nQatan, a man from the tribe of Khuza`a. \"","reference":"Sahih al-Bukhari 7128, Book 92, Hadith 75","grade":"","question #":"question #1","question":"What are the characteristics of the figures seen by the Prophet in his dream?","id":"bukhari-92-76"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) in his prayer, seeking refuge with Allah from the afflictions of Ad-Dajjal.","reference":"Sahih al-Bukhari 7129, Book 92, Hadith 76","grade":"","question #":"question #1","question":"Why is it important to seek refuge from the afflictions of Ad-Dajjal in prayer?","id":"bukhari-92-77"},{"hadith-eng":"The Prophet (ﷺ) said about Ad-Dajjal that he would have water and fire with him: (what would seem to \nbe) fire, would be cold water and (what would seem to be) water, would be fire.","reference":"Sahih al-Bukhari 7130, Book 92, Hadith 77","grade":"","question #":"question #1","question":"What are the deceptive characteristics of Ad-Dajjal as described in Islamic teachings?","id":"bukhari-92-78"},{"hadith-eng":"The Prophet (ﷺ) said, \"No prophet was sent but that he warned his followers against the one-eyed liar \n(Ad-Dajjal). Beware! He is blind in one eye, and your Lord is not so, and there will be written \nbetween his (Ad-Dajjal's) eyes (the word) Kafir (i.e., disbeliever).\" (This Hadith is also quoted by Abu \nHuraira and Ibn `Abbas).","reference":"Sahih al-Bukhari 7131, Book 92, Hadith 78","grade":"","question #":"question #1","question":"What are the characteristics of Ad-Dajjal as described in Islamic teachings?","id":"bukhari-92-79"},{"hadith-eng":"One day Allah's Messenger (ﷺ) narrated to us a long narration about Ad-Dajjal and among the things he \nnarrated to us, was: \"Ad-Dajjal will come, and he will be forbidden to enter the mountain passes of \nMedina. He will encamp in one of the salt areas neighboring Medina and there will appear to him a \nman who will be the best or one of the best of the people. He will say 'I testify that you are Ad-Dajjal \nwhose story Allah's Messenger (ﷺ) has told us.' Ad-Dajjal will say (to his audience), 'Look, if I kill this man \nand then give him life, will you have any doubt about my claim?' They will reply, 'No,' Then Ad- \nDajjal will kill that man and then will make him alive. The man will say, 'By Allah, now I recognize \nyou more than ever!' Ad-Dajjal will then try to kill him (again) but he will not be given the power to \ndo so.\"","reference":"Sahih al-Bukhari 7132, Book 92, Hadith 79","grade":"","question #":"question #1","question":"What are the characteristics and actions of Ad-Dajjal as described in Islamic teachings?","id":"bukhari-92-80"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There are angels at the mountain passes of Medina (so that) neither plague nor \nAd-Dajjal can enter it.'","reference":"Sahih al-Bukhari 7133, Book 92, Hadith 80","grade":"","question #":"question #1","question":"What protection does Medina have against plague and Ad-Dajjal according to Islamic teachings?","id":"bukhari-92-81"},{"hadith-eng":"The Prophet (ﷺ) said, \"Ad-Dajjal will come to Medina and find the angels guarding it. So Allah willing, \nneither Ad-Dajjal, nor plague will be able to come near it.\"","reference":"Sahih al-Bukhari 7134, Book 92, Hadith 81","grade":"","question #":"question #1","question":"What protection does Medina have against Ad-Dajjal according to Islamic teachings?","id":"bukhari-92-82"},{"hadith-eng":"That one day Allah's Messenger (ﷺ) entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet (ﷺ) made a circle with his index \nfinger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet (ﷺ) said, \"Yes, if the (number) of evil (persons) \nincreased.\"","reference":"Sahih al-Bukhari 7135, Book 92, Hadith 82","grade":"","question #":"question #1","question":"What is the significance of the Prophet's warning about the approaching evil for the Arabs?","id":"bukhari-92-83"},{"hadith-eng":"The Prophet (ﷺ) said, \"A hole has been opened in the dam of Gog and Magog.\" Wuhaib (the sub-narrator) \nmade the number 90 (with his index finger and thumb).","reference":"Sahih al-Bukhari 7136, Book 92, Hadith 83","grade":"","question #":"question #1","question":"What is the significance of the dam of Gog and Magog in Islamic eschatology?","id":"bukhari-92-84"},{"hadith-eng":"The Prophet (ﷺ) said, \"I will be at my Lake-Fount (Kauthar) waiting for whoever will come to me. Then \nsome people will be taken away from me whereupon I will say, 'My followers!' It will be said, 'You \ndo not know they turned Apostates as renegades (deserted their religion).'\" (Ibn Abi Mulaika said, \n\"Allah, we seek refuge with You from turning on our heels from the (Islamic) religion and from being \nput to trial\").","reference":"Sahih al-Bukhari 7048, Book 92, Hadith 1","grade":"","question #":"question #2","question":"What are the consequences for those who turn away from their religion according to Islamic teachings?","id":"bukhari-92-85"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount (Kauthar) and some men amongst you \nwill be brought to me, and when I will try to hand them some water, they will be pulled away from me \nby force whereupon I will say, 'O Lord, my companions!' Then the Almighty will say, 'You do not \nknow what they did after you left, they introduced new things into the religion after you.'\"","reference":"Sahih al-Bukhari 7049, Book 92, Hadith 2","grade":"","question #":"question #2","question":"What are the consequences of introducing new practices into the religion according to Islamic teachings?","id":"bukhari-92-86"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"I am your predecessor at the Lake-Fount (Kauthar), and whoever will \ncome to it, will drink from it, and whoever will drink from it, will never become thirsty after that. \nThere will come to me some people whom I know and they know me, and then a barrier will be set up \nbetween me and them.\"","reference":"Sahih al-Bukhari 7050, Book 92, Hadith 3","grade":"","question #":"question #2","question":"What does it mean for a barrier to be set up between the Prophet and certain people on the Day of Judgment?","id":"bukhari-92-87"},{"hadith-eng":"\"I will say those \npeople are from me. It will be said, 'You do not know what changes and new things they did after \nyou.' Then I will say, 'Far removed (from mercy), far removed (from mercy), those who changed (the \nreligion) after me!\"","reference":"Sahih al-Bukhari 7051, Book 92, Hadith 4","grade":"","question #":"question #2","question":"How does the Prophet express his disassociation from those who change the religion?","id":"bukhari-92-88"},{"hadith-eng":"Allah's Messenger (ﷺ) said to us, \"You will see after me, selfishness (on the part of other people) and other \nmatters that you will disapprove of.\" They asked, \"What do you order us to do, O Allah's Messenger (ﷺ)? \n(under such circumstances)?\" He said, \"Pay their rights to them (to the rulers) and ask your right from \nAllah.\"","reference":"Sahih al-Bukhari 7052, Book 92, Hadith 5","grade":"","question #":"question #2","question":"What is the advised course of action when faced with unjust rulers or leaders?","id":"bukhari-92-89"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever disapproves of something done by his ruler then he should be patient, for \nwhoever disobeys the ruler even a little (little = a span) will die as those who died in the Pre-lslamic \nPeriod of Ignorance. (i.e. as rebellious Sinners).","reference":"Sahih al-Bukhari 7053, Book 92, Hadith 6","grade":"","question #":"question #2","question":"What are the consequences of disobeying a ruler according to Islamic teachings?","id":"bukhari-92-90"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever notices something which he dislikes done by his ruler, then he should be \npatient, for whoever becomes separate from the company of the Muslims even for a span and then \ndies, he will die as those who died in the Pre-lslamic period of Ignorance (as rebellious sinners). \n(Fath-ul-Bari page 112, Vol. 16)","reference":"Sahih al-Bukhari 7054, Book 92, Hadith 7","grade":"","question #":"question #2","question":"What are the consequences of separating oneself from the Muslim community according to Islamic teachings?","id":"bukhari-92-91"},{"hadith-eng":"We entered upon 'Ubada bin As-Samit while he was sick. We said, \"May Allah make you healthy. \nWill you tell us a Hadith you heard from the Prophet (ﷺ) and by which Allah may make you benefit?\" He \nsaid, \"The Prophet (ﷺ) called us and we gave him the Pledge of allegiance for Islam, and among the \nconditions on which he took the Pledge from us, was that we were to listen and obey (the orders) both \nat the time when we were active and at the time when we were tired, and at our difficult time and at \nour ease and to be obedient to the ruler and give him his right even if he did not give us our right, and \nnot to fight against him unless we noticed him having open Kufr (disbelief) for which we would have \na proof with us from Allah.\"","reference":"Sahih al-Bukhari 7055, 7056, Book 92, Hadith 8","grade":"","question #":"question #2","question":"How should Muslims respond to rulers who do not fulfill their rights?","id":"bukhari-92-92"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You appointed such-and-such person and \nyou did not appoint me?\" The Prophet (ﷺ) said, \"After me you will see rulers not giving you your right \n(but you should give them their right) and be patient till you meet me.\"","reference":"Sahih al-Bukhari 7057, Book 92, Hadith 9","grade":"","question #":"question #2","question":"What is the significance of patience in dealing with unjust leadership according to Islamic teachings?","id":"bukhari-92-93"},{"hadith-eng":"I heard the truthful and trusted by Allah (i.e., the Prophet (ﷺ) ) saying, \"The destruction of my followers \nwill be through the hands of young men from Quraish.\"","reference":"Sahih al-Bukhari 7058, Book 92, Hadith 10","grade":"","question #":"question #2","question":"Who did the Prophet Muhammad (ﷺ) identify as a potential source of trouble for his followers?","id":"bukhari-92-94"},{"hadith-eng":"The Prophet (ﷺ) got up from his sleep with a flushed red face and said, \"None has the right to be \nworshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a \ngap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the \nnumber 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous \npeople among us?\" The Prophet (ﷺ) said, \"Yes, if evil increased.\"","reference":"Sahih al-Bukhari 7059, Book 92, Hadith 11","grade":"","question #":"question #2","question":"How does the presence of righteous people affect the potential destruction of a community according to Islamic teachings?","id":"bukhari-92-95"},{"hadith-eng":"Once the Prophet (ﷺ) stood over one of the high buildings of Medina and then said (to the people), \"Do \nyou see what I see?\" They said, \"No.\" He said, \"I see afflictions falling among your houses as rain \ndrops fall.\"","reference":"Sahih al-Bukhari 7060, Book 92, Hadith 12","grade":"","question #":"question #2","question":"How are afflictions and trials perceived in the context of Islamic belief?","id":"bukhari-92-96"},{"hadith-eng":"The Prophet (ﷺ) said, \"Time will pass rapidly, good deeds will decrease, miserliness will be thrown (in the \nhearts of the people) afflictions will appear and there will be much 'Al-Harj.\" They said, \"O Allah's \nApostle! What is \"Al-Harj?\" He said, \"Killing! Killing!\" (See Hadith No. 63, Vol. 8)","reference":"Sahih al-Bukhari 7061, Book 92, Hadith 13","grade":"","question #":"question #2","question":"How does the increase in miserliness and decrease in good deeds relate to societal changes in Islamic teachings?","id":"bukhari-92-97"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour there will be days during which Religious \nignorance will spread, knowledge will be taken away (vanish) and there will be much Al-Harj, and Al- \nHarj means killing.\"","reference":"Sahih al-Bukhari 7062, 7063, Book 92, Hadith 14","grade":"","question #":"question #2","question":"How does the spread of religious ignorance relate to the end times?","id":"bukhari-92-98"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour there will be days during which (religious) \nknowledge will be taken away (vanish) and general ignorance will spread, and there will be Al-Harj in \nabundance, and Al-Harj means killing.\"","reference":"Sahih al-Bukhari 7064, Book 92, Hadith 15","grade":"","question #":"question #2","question":"How does the spread of ignorance relate to the end times in Islamic eschatology?","id":"bukhari-92-99"},{"hadith-eng":"The Prophet (ﷺ) said...(as above, 185). And Harj, in the Ethiopian language, means killing.","reference":"Sahih al-Bukhari 7065, Book 92, Hadith 16","grade":"","question #":"question #2","question":"How does the meaning of words in different languages affect the interpretation of religious texts?","id":"bukhari-92-100"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour, there will be the days of Al-Harj, and the \nreligious knowledge will be taken away (vanish i.e. by the death of Religious scholars) and general \nignorance will spread.\" Abu Musa said, \"Al-Harj, in the Ethiopian language, means killing.\"","reference":"Sahih al-Bukhari 7066, Book 92, Hadith 17","grade":"","question #":"question #2","question":"How does the loss of religious knowledge impact society according to Islamic beliefs?","id":"bukhari-92-101"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying; (It will be) from among the most wicked people who \nwill be living at the time when the Hour will be established.\"","reference":"Sahih al-Bukhari 7067, Book 92, Hadith 18","grade":"","question #":"question #2","question":"What is the significance of the Hour in Islamic eschatology?","id":"bukhari-92-102"},{"hadith-eng":"We went to Anas bin Malik and complained about the wrong we were suffering at the hand of Al- \nHajjaj. Anas bin Malik said, \"Be patient till you meet your Lord, for no time will come upon you but \nthe time following it will be worse than it. I heard that from the Prophet.\"","reference":"Sahih al-Bukhari 7068, Book 92, Hadith 19","grade":"","question #":"question #2","question":"How does patience play a role in facing difficult times in life?","id":"bukhari-92-103"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) woke up one night in a state of terror and said, \"Subhan \nAllah, How many treasures Allah has sent down! And how many afflictions have been sent down! \nWho will go and wake the lady dwellers (wives of the Prophet) up of these rooms (for prayers)?\" He \nmeant his wives, so that they might pray. He added, \"A well-dressed (soul) in this world may be naked \nin the Hereafter.\"","reference":"Sahih al-Bukhari 7069, Book 92, Hadith 20","grade":"","question #":"question #2","question":"How does the concept of worldly attire relate to one's state in the Hereafter?","id":"bukhari-92-104"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever takes up arms against us, is not from us.\"","reference":"Sahih al-Bukhari 7070, Book 92, Hadith 21","grade":"","question #":"question #2","question":"How does Islam define the boundaries of community and belonging in terms of actions against the group?","id":"bukhari-92-105"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes up arms against us, is not from us.\"","reference":"Sahih al-Bukhari 7071, Book 92, Hadith 22","grade":"","question #":"question #2","question":"How does Islam define the boundaries of community and belonging in terms of actions against the group?","id":"bukhari-92-106"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you should point out towards his Muslim brother with a weapon, for he \ndoes not know, Satan may tempt him to hit him and thus he would fall into a pit of fire (Hell)\"","reference":"Sahih al-Bukhari 7072, Book 92, Hadith 23","grade":"","question #":"question #2","question":"How does Satan play a role in escalating conflicts or misunderstandings among people?","id":"bukhari-92-107"},{"hadith-eng":"I said to `Amr, \"O Abu Muhammad! Did you hear Jabir bin `Abdullah saying, 'A man carrying arrows \npassed through the mosque and Allah's Messenger (ﷺ) said to him, 'Hold the arrows by their heads! \"`Amr \nreplied, \"Yes.\"","reference":"Sahih al-Bukhari 7073, Book 92, Hadith 24","grade":"","question #":"question #2","question":"How can one ensure the safety of others when carrying potentially dangerous items?","id":"bukhari-92-108"},{"hadith-eng":"A man passed through the mosque and he was carrying arrows, the heads of which were exposed \n(protruding). The man was ordered (by the Prophet) to hold the iron heads so that it might not scratch \n(injure) any Muslim.","reference":"Sahih al-Bukhari 7074, Book 92, Hadith 25","grade":"","question #":"question #2","question":"How does Islam emphasize the importance of preventing harm to fellow Muslims?","id":"bukhari-92-109"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you passed through our mosque or through our market while carrying \narrows, he should hold the iron heads,\" or said, \"..... he should hold (their heads) firmly with his hand \nlest he should injure one of the Muslims with it.\"","reference":"Sahih al-Bukhari 7075, Book 92, Hadith 26","grade":"","question #":"question #2","question":"How does Islam emphasize the importance of being mindful of others' safety in communal areas?","id":"bukhari-92-110"},{"hadith-eng":"The Prophet, said, \"Abusing a Muslim is Fusuq (evil doing) and killing him is Kufr (disbelief).","reference":"Sahih al-Bukhari 7076, Book 92, Hadith 27","grade":"","question #":"question #2","question":"How is killing a Muslim viewed in terms of faith and belief in Islam?","id":"bukhari-92-111"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Do not revert to disbelief after me by striking (cutting) the necks of one \nanother.\"","reference":"Sahih al-Bukhari 7077, Book 92, Hadith 28","grade":"","question #":"question #2","question":"How does the hadith emphasize the importance of unity and avoiding violence among Muslims?","id":"bukhari-92-112"},{"hadith-eng":"Allah's Messenger (ﷺ) addressed the people saying, \"Don't you know what is the day today?\" They replied, \n\"Allah and His Apostle know better.\" We thought that he might give that day another name. The \nProphet said, \"Isn't it the day of An-Nahr?\" We replied, \"Yes. O Allah's Messenger (ﷺ).\" He then said, \"What \ntown is this? Isn't it the forbidden (Sacred) Town (Mecca)?\" We replied, \"Yes, O Allah's Messenger (ﷺ).\" He \nthen said, \"Your blood, your properties, your honors and your skins (i.e., bodies) are as sacred to one \nanother like the sanctity of this day of yours in this month of yours in this town of yours. (Listen) \nHaven't I conveyed Allah's message to you?\" We replied, \"Yes\" He said, \"O Allah! Be witness (for it). \nSo it is incumbent upon those who are present to convey it (this message of mine) to those who are \nabsent because the informed one might comprehend what I have said better than the present audience \nwho will convey it to him.)\" The narrator added: In fact, it was like that. The Prophet (ﷺ) added, \"Beware! \nDo not renegade as disbelievers after me by striking (cutting) the necks of one another.\"","reference":"Sahih al-Bukhari 7078, Book 92, Hadith 29","grade":"","question #":"question #2","question":"Why is it important to convey the message of the Prophet to those who are absent?","id":"bukhari-92-113"},{"hadith-eng":"The Prophet (ﷺ) said, \"Beware! Do not renegade as (disbelievers) after me by striking (cutting) the necks \nof one another.\"","reference":"Sahih al-Bukhari 7079, Book 92, Hadith 30","grade":"","question #":"question #2","question":"What actions are considered as renegading into disbelief according to the teachings of the Prophet Muhammad (ﷺ)?","id":"bukhari-92-114"},{"hadith-eng":"The Prophet (ﷺ) said to me during Hajjat-al-Wada`, \"Let the people keep quiet and listen.\" Then he said \n(addressing the people), \"Beware! Do not renegade as disbelievers after me by striking (cutting) the \nnecks of one another.\"","reference":"Sahih al-Bukhari 7080, Book 92, Hadith 31","grade":"","question #":"question #2","question":"What is the significance of maintaining unity and avoiding violence among Muslims according to the teachings of the Prophet (ﷺ)?","id":"bukhari-92-115"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will be afflictions (in the near future) during which a sitting person will \nbe better than a standing one, and the standing one will be better than the walking one, and the \nwalking one will be better than the running one, and whoever will expose himself to these afflictions, \nthey will destroy him. So whoever can find a place of protection or refuge from them, should take \nshelter in it.\"","reference":"Sahih al-Bukhari 7081, Book 92, Hadith 32","grade":"","question #":"question #2","question":"How can different postures or actions reflect one's safety during periods of turmoil?","id":"bukhari-92-116"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will be afflictions (in the near future) during which a sitting person will \nbe better than a standing one, and the standing one will be better than a walking one, and the walking \none will be better than a running one, and whoever will expose himself to these afflictions, they will \ndestroy him. So whoever can find a place of protection or refuge from them, should take shelter in it.\"","reference":"Sahih al-Bukhari 7082, Book 92, Hadith 33","grade":"","question #":"question #2","question":"How does the hadith describe the varying levels of safety during times of turmoil?","id":"bukhari-92-117"},{"hadith-eng":"(Al-Ahnaf said:) I went out carrying my arms during the nights of the affliction (i.e. the war between \n`Ali and `Aisha) and Abu Bakra met me and asked, \"Where are you going?\" I replied, \"I intend to help \nthe cousin of Allah's Messenger (ﷺ) (i.e.,`Ali).\" Abu Bakra said, \"Allah's Messenger (ﷺ) said, 'If two Muslims take \nout their swords to fight each other, then both of them will be from amongst the people of the Hell- \nFire.' It was said to the Prophet, 'It is alright for the killer but what about the killed one?' He replied, \n'The killed one had the intention to kill his opponent.'\" (See Hadith No. 30, Vol. 1)Narrated Al-Ahnaf:Abu Bakra said: The Prophet (ﷺ) said (as above, 204).","reference":"Sahih al-Bukhari 7083, Book 92, Hadith 34","grade":"","question #":"question #2","question":"What are the consequences in the afterlife for Muslims who fight each other with the intention to kill?","id":"bukhari-92-118"},{"hadith-eng":"The people used to ask Allah's Messenger (ﷺ) about the good but I used to ask him about the evil lest I \nshould be overtaken by them. So I said, \"O Allah's Messenger (ﷺ)! We were living in ignorance and in an \n(extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil \nafter this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but \nit will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some \npeople who will guide others not according to my tradition? You will approve of some of their deeds \nand disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, \n(there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their \ncall, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them \nto us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do \nyou order me to do if such a state should take place in my life?\" He said, \"Stick to the group of \nMuslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" \nHe said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death \novertakes you while you are in that state.\"","reference":"Sahih al-Bukhari 7084, Book 92, Hadith 35","grade":"","question #":"question #2","question":"How can one identify and respond to misleading leaders or groups within the Muslim community?","id":"bukhari-92-119"},{"hadith-eng":"An army unit was being recruited from the people of Medina and my name was written among them. \nThen I met `Ikrima, and when I informed him about it, he discouraged me very strongly and said, \"Ibn \n`Abbas told me that there were some Muslims who were with the pagans to increase their number \nagainst Allah's Messenger (ﷺ) (and the Muslim army) so arrows (from the Muslim army) would hit one of \nthem and kill him or a Muslim would strike him (with his sword) and kill him. So Allah revealed:-- \n'Verily! As for those whom the angels take (in death) while they are wronging themselves (by staying \namong the disbelievers).' (4.97)","reference":"Sahih al-Bukhari 7085, Book 92, Hadith 36","grade":"","question #":"question #2","question":"How does the Quran address the situation of Muslims who wrong themselves by staying among disbelievers?","id":"bukhari-92-120"},{"hadith-eng":"Allah's Messenger (ﷺ) related to us, two prophetic narrations one of which I have seen fulfilled and I am \nwaiting for the fulfillment of the other. The Prophet (ﷺ) told us that the virtue of honesty descended in the \nroots of men's hearts (from Allah) and then they learned it from the Qur'an and then they learned it \nfrom the Sunna (the Prophet's traditions). The Prophet (ﷺ) further told us how that honesty will be taken \naway: He said: \"Man will go to sleep during which honesty will be taken away from his heart and only \nits trace will remain in his heart like the trace of a dark spot; then man will go to sleep, during which \nhonesty will decrease further still, so that its trace will resemble the trace of blister as when an ember \nis dropped on one's foot which would make it swell, and one would see it swollen but there would be \nnothing inside. People would be carrying out their trade but hardly will there be a trustworthy person. \nIt will be said, 'in such-and-such tribe there is an honest man,' and later it will be said about some man, \n'What a wise, polite and strong man he is!' Though he will not have faith equal even to a mustard seed \nin his heart.\" No doubt, there came upon me a time when I did not mind dealing (bargaining) with \nanyone of you, for if he was a Muslim his Islam would compel him to pay me what is due to me, and \nif he was a Christian, the Muslim official would compel him to pay me what is due to me, but today I \ndo not deal except with such-and-such person.","reference":"Sahih al-Bukhari 7086, Book 92, Hadith 37","grade":"","question #":"question #2","question":"What are the consequences of the decline of honesty in society as described in Islamic tradition?","id":"bukhari-92-121"},{"hadith-eng":"That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your \nheels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but \nAllah's Messenger (ﷺ) allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: \nWhen `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- \nRabadha and married there and begot children, and he stayed there till a few nights before his death \nwhen he came to Medina.","reference":"Sahih al-Bukhari 7087, Book 92, Hadith 38","grade":"","question #":"question #2","question":"How did Salama bin Al-Akwa` justify his decision to live in the desert to Al-Hajjaj?","id":"bukhari-92-122"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will come a time when the best property of a Muslim will be sheep which \nhe will take to the tops of mountains and the places of rainfall so as to flee with his religion from the \nafflictions.","reference":"Sahih al-Bukhari 7088, Book 92, Hadith 39","grade":"","question #":"question #2","question":"How can afflictions impact a person's religious practice and what measures can be taken to protect one's faith?","id":"bukhari-92-123"},{"hadith-eng":"The people started asking the Prophet (ﷺ) too many questions importunately. So one day he ascended the \npulpit and said, \"You will not ask me any question but I will explain it to you.\" I looked right and left, \nand behold, every man was covering his head with his garment and weeping. Then got up a man who, \nwhenever quarreling with somebody, used to be accused of not being the son of his father. He said, \"O \nAllah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then `Umar got \nup and said, \"We accept Allah as our Lord, Islam as our religion and Muhammad as our Apostle and \nwe seek refuge with Allah from the evil of afflictions.\" The Prophet (ﷺ) said, \" I have never seen the good \nand bad like on this day. No doubt, Paradise and Hell was displayed in front of me till I saw them in \nfront of that wall,\" Qatada said: This Hadith used to be mentioned as an explanation of this Verse:-- 'O \nyou who believe! Ask not questions about things which, if made plain to you, may cause you trouble.' \n(5.101)","reference":"Sahih al-Bukhari 7089, Book 92, Hadith 40","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to questions that were asked importunately by the people?","id":"bukhari-92-124"},{"hadith-eng":"The the above hadith was narrated by Anas through another chain and said (with the wording) \"and every man had his head wrapped in his garment and weeping\".  And he said (with the wording) \"seeking refuge with Allah from the evil of afflictions\" or he said \"I seek refuge with Allah from the evil of afflictions.\"","reference":"Sahih al-Bukhari 7090, Book 92, Hadith 41","grade":"","question #":"question #2","question":"How did the companions of the Prophet express their emotions during moments of distress?","id":"bukhari-92-125"},{"hadith-eng":"The above hadith is narrated on the authority of Anas thorugh another chain and he said (with the wording) \"seeking refuge with Allah from the evil of afflictions.\"","reference":"Sahih al-Bukhari 7091, Book 92, Hadith 42","grade":"","question #":"question #2","question":"How does seeking refuge with Allah help in dealing with life's challenges?","id":"bukhari-92-126"},{"hadith-eng":"The Prophet (ﷺ) stood up beside the pulpit (and pointed with his finger towards the East) and said, \n\"Afflictions are there! Afflictions are there, from where the side of the head of Satan comes out,\" or \nsaid, \"..the side of the sun..\"","reference":"Sahih al-Bukhari 7092, Book 92, Hadith 43","grade":"","question #":"question #2","question":"How does the Prophet describe the origin of afflictions in relation to Satan?","id":"bukhari-92-127"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) while he was facing the East, saying, \"Verily! Afflictions are there, from \nwhere the side of the head of Satan comes out.\"","reference":"Sahih al-Bukhari 7093, Book 92, Hadith 44","grade":"","question #":"question #2","question":"How are afflictions and trials perceived in Islamic eschatology?","id":"bukhari-92-128"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Bestow Your blessings on our Sham! O Allah! Bestow Your blessings on \nour Yemen.\" The People said, \"And also on our Najd.\" He said, \"O Allah! Bestow Your blessings on \nour Sham (north)! O Allah! Bestow Your blessings on our Yemen.\" The people said, \"O Allah's \nApostle! And also on our Najd.\" I think the third time the Prophet (ﷺ) said, \"There (in Najd) is the place \nof earthquakes and afflictions and from there comes out the side of the head of Satan.\"","reference":"Sahih al-Bukhari 7094, Book 92, Hadith 45","grade":"","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) express concern about Najd in relation to earthquakes and afflictions?","id":"bukhari-92-129"},{"hadith-eng":"`Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before \nwe asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles \nduring the time of the afflictions, as Allah says:-- \n'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" \n(2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother \nbereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion \n(The pagans will either kill him or chain him as a captive). His fighting was not like your fighting \nwhich is carried on for the sake of ruling.\"","reference":"Sahih al-Bukhari 7095, Book 92, Hadith 46","grade":"","question #":"question #2","question":"How did the battles during the Prophet Muhammad's time differ from later conflicts according to Islamic teachings?","id":"bukhari-92-130"},{"hadith-eng":"I heard Hudhaifa saying, \"While we were sitting with `Umar, he said, 'Who among you remembers the \nstatement of the Prophet (ﷺ) about the afflictions?' Hudhaifa said, \"The affliction of a man in his family, \nhis property, his children and his neighbors are expiated by his prayers, Zakat (and alms) and \nenjoining good and forbidding evil.\" `Umar said, \"I do not ask you about these afflictions, but about \nthose afflictions which will move like the waves of the sea.\" Hudhaifa said, \"Don't worry about it, O \nchief of the believers, for there is a closed door between you and them.\" `Umar said, \"Will that door \nbe broken or opened?\" I said, \"No. it will be broken.\" `Umar said, \"Then it will never be closed,\" I \nsaid, \"Yes.\" We asked Hudhaifa, \"Did `Umar know what that door meant?\" He replied, \"Yes, as I \nknow that there will be night before tomorrow morning, that is because I narrated to him a true \nnarration free from errors.\" We dared not ask Hudhaifa as to whom the door represented so we \nordered Masruq to ask him what does the door stand for? He replied, \"`Umar.\"","reference":"Sahih al-Bukhari 7096, Book 92, Hadith 47","grade":"","question #":"question #2","question":"How did Hudhaifa describe the nature of future afflictions to Umar?","id":"bukhari-92-131"},{"hadith-eng":"The Prophet (ﷺ) went out to one of the gardens of Medina for some business and I went out to follow him. \nWhen he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the \nProphet though he has not ordered me.\" The Prophet (ﷺ) went and finished his need and went to sit on the \nconstructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu \nBakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr \nwaited outside and I went to the Prophet (ﷺ) and said, \"O Allah's Prophet! Abu Bakr asks your permission \nto enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr \nentered and sat on the right side of the Prophet (ﷺ) and uncovered his legs and hung them in the well. \nThen `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet (ﷺ) said, \"Admit him \nand give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the \nProphet and uncovered his legs and hung them in the well so that one side of the well became fully \noccupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \n\"Wait till I get permission for you.\" The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of \nentering Paradise with a calamity which will befall him.\" When he entered, he could not find any \nplace to sit with them so he went to the other edge of the well opposite them and uncovered his legs \nand hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his \ncoming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three \nare together and the grave of `Uthman is separate from theirs.\")","reference":"Sahih al-Bukhari 7097, Book 92, Hadith 48","grade":"","question #":"question #2","question":"How does the interaction between the Prophet and his companions reflect the concept of companionship in Islam?","id":"bukhari-92-132"},{"hadith-eng":"Someone said to Usama, \"Will you not talk to this (Uthman)?\" Usama said, \"I talked to him (secretly) \nwithout being the first man to open an evil door. I will never tell a ruler who rules over two men or \nmore that he is good after I heard Allah's Messenger (ﷺ) saying, 'A man will be brought and put in Hell (Fire) \nand he will circumambulate (go around and round) in Hell (Fire) like a donkey of a (flour) grinding \nmill, and all the people of Hell (Fire) will gather around him and will say to him, O so-and-so! Didn't \nyou use to order others for good and forbid them from evil?' That man will say, 'I used to order others \nto do good but I myself never used to do it, and I used to forbid others from evil while I myself used to \ndo evil.' \"","reference":"Sahih al-Bukhari 7098, Book 92, Hadith 49","grade":"","question #":"question #2","question":"How does the concept of accountability manifest in the afterlife according to Islamic teachings?","id":"bukhari-92-133"},{"hadith-eng":"During the battle of Al-Jamal, Allah benefited me with a Word (I heard from the Prophet). When the \nProphet heard the news that the people of the Persia had made the daughter of Khosrau their Queen \n(ruler), he said, \"Never will succeed such a nation as makes a woman their ruler.\"","reference":"Sahih al-Bukhari 7099, Book 92, Hadith 50","grade":"","question #":"question #2","question":"How does the leadership of a nation impact its success according to Islamic teachings?","id":"bukhari-92-134"},{"hadith-eng":"When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir and Hasan bin `Ali \nwho came to us at Kufa and ascended the pulpit. Al-Hasan bin `Ali was at the top of the pulpit and \n`Ammar was below Al-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has \nmoved to Al-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But \nAllah has put you to test whether you obey Him (Allah) or her (`Aisha).","reference":"Sahih al-Bukhari 7100, Book 92, Hadith 51","grade":"","question #":"question #2","question":"How does the concept of obedience to Allah manifest in challenging situations involving respected figures?","id":"bukhari-92-135"},{"hadith-eng":"`Ammar stood on the pulpit at Kufa and mentioned `Aisha and her coming (to Busra) and said, \"She is \nthe wife of your Prophet in this world and in the Hereafter, but you people are being put to test in this \nissue.\"","reference":"Sahih al-Bukhari 7101, Book 92, Hadith 52","grade":"","question #":"question #2","question":"How does the mention of Aisha's journey to Busra relate to the trials faced by the people of Kufa?","id":"bukhari-92-136"},{"hadith-eng":"Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).","reference":"Sahih al-Bukhari 7102, 7103, 7104, Book 92, Hadith 53","grade":"","question #":"question #2","question":"How do personal judgments and criticisms affect relationships among companions in Islamic history?","id":"bukhari-92-137"},{"hadith-eng":"Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).","reference":"Sahih al-Bukhari 7102, 7103, 7104, Book 92, Hadith 53","grade":"","question #":"question #2","question":"How do personal judgments and criticisms affect relationships among companions in Islam?","id":"bukhari-92-138"},{"hadith-eng":"I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"","reference":"Sahih al-Bukhari 7105, 7106, 7107, Book 92, Hadith 54","grade":"","question #":"question #2","question":"How does generosity play a role in maintaining relationships among individuals according to Islamic teachings?","id":"bukhari-92-139"},{"hadith-eng":"I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"","reference":"Sahih al-Bukhari 7105, 7106, 7107, Book 92, Hadith 54","grade":"","question #":"question #2","question":"How does generosity play a role in maintaining relationships among companions?","id":"bukhari-92-140"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If Allah sends punishment upon a nation then it befalls upon the whole \npopulation indiscriminately and then they will be resurrected (and judged) according to their deeds. \"","reference":"Sahih al-Bukhari 7108, Book 92, Hadith 55","grade":"","question #":"question #2","question":"What is the significance of individual deeds in the context of collective punishment and resurrection?","id":"bukhari-92-141"},{"hadith-eng":"When Al-Hasan bin `Ali moved with army units against Muawiya, `Amr bin AL-As said to Muawiya, \n\"I see an army that will not retreat unless and until the opposing army retreats.\" Muawiya said, \"(If the \nMuslims are killed) who will look after their children?\" `Amr bin Al-As said: I (will look after them). \nOn that, `Abdullah bin 'Amir and `Abdur-Rahman bin Samura said, \"Let us meet Muawaiya and \nsuggest peace.\" Al-Hasan Al-Basri added: No doubt, I heard that Abu Bakra said, \"Once while the \nProphet was addressing (the people), Al-Hasan (bin `Ali) came and the Prophet (ﷺ) said, 'This son of mine \nis a chief, and Allah may make peace between two groups of Muslims through him.\"","reference":"Sahih al-Bukhari 7109, Book 92, Hadith 56","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) describe Al-Hasan bin Ali in terms of leadership and peace?","id":"bukhari-92-142"},{"hadith-eng":"(Usama's Maula) Usama (bin Zaid) sent me to `Ali (at Kufa) and said, \"`Ali will ask you, 'What has \nprevented your companion from joining me?' You then should say to him, 'If you (`Ali) were in the \nmouth of a lion, I would like to be with you, but in this matter I won't take any part.' \" Harmala added: \n\"`Ali didn't give me anything (when I conveyed the message to him) so I went to Hasan, Hussain and \nIbn Ja`far and they loaded my camels with much (wealth).","reference":"Sahih al-Bukhari 7110, Book 92, Hadith 57","grade":"","question #":"question #2","question":"How did Hasan, Hussain, and Ibn Ja'far respond to the messenger sent by Usama bin Zaid?","id":"bukhari-92-143"},{"hadith-eng":"When the people of Medina dethroned Yazid bin Muawiya, Ibn `Umar gathered his special friends \nand children and said, \"I heard the Prophet (ﷺ) saying, 'A flag will be fixed for every betrayer on the Day \nof Resurrection,' and we have given the oath of allegiance to this person (Yazid) in accordance with \nthe conditions enjoined by Allah and His Apostle and I do not know of anything more faithless than \nfighting a person who has been given the oath of allegiance in accordance with the conditions \nenjoined by Allah and His Apostle , and if ever I learn that any person among you has agreed to \ndethrone Yazid, by giving the oath of allegiance (to somebody else) then there will be separation \nbetween him and me.\"","reference":"Sahih al-Bukhari 7111, Book 92, Hadith 58","grade":"","question #":"question #2","question":"How does Islam view betrayal and its consequences on the Day of Resurrection?","id":"bukhari-92-144"},{"hadith-eng":"When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and \nQurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we \nentered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with \nhim and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the \npeople has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of \nbeing angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in \nmisery and were few in number and misguided, and that Allah has brought you out of all that with \nIslam and with Muhammad till He brought you to this state (of prosperity and happiness) which you \nsee now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. \nThe one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: \nand those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that \none who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly \ngain.\"","reference":"Sahih al-Bukhari 7112, Book 92, Hadith 59","grade":"","question #":"question #2","question":"How did Islam transform the condition of the Arabs according to historical accounts?","id":"bukhari-92-145"},{"hadith-eng":"Hudhaifa bin Al-Yaman said, 'The hypocrites of today are worse than those of the lifetime of the \nProphet, because in those days they used to do evil deeds secretly but today they do such deeds \nopenly.'","reference":"Sahih al-Bukhari 7113, Book 92, Hadith 60","grade":"","question #":"question #2","question":"What are the characteristics of hypocrisy as described in Islamic teachings?","id":"bukhari-92-146"},{"hadith-eng":"Hudhaifa said, 'In fact, it was hypocrisy that existed in the lifetime of the Prophet (ﷺ) but today it is Kufr \n(disbelief) after belief.'","reference":"Sahih al-Bukhari 7114, Book 92, Hadith 61","grade":"","question #":"question #2","question":"How did Hudhaifa describe the transformation of hypocrisy into disbelief after the Prophet's era?","id":"bukhari-92-147"},{"hadith-eng":"The Prophet (ﷺ) said, \"The Hour will not be established till a man passes by a grave of somebody and \nsays, 'Would that I were in his place.' \"","reference":"Sahih al-Bukhari 7115, Book 92, Hadith 62","grade":"","question #":"question #2","question":"What might lead a person to wish to be in the place of someone in their grave?","id":"bukhari-92-148"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till the buttocks of the women of the tribe of \nDaus move while going round Dhi-al-Khalasa.\" Dhi-al-Khalasa was the idol of the Daus tribe which \nthey used to worship in the Pre Islamic Period of ignorance.","reference":"Sahih al-Bukhari 7116, Book 92, Hadith 63","grade":"","question #":"question #2","question":"How did pre-Islamic tribes practice idolatry, and what significance does it hold in Islamic eschatology?","id":"bukhari-92-149"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till a man from Qahtan appears, driving the \npeople with his stick.\"","reference":"Sahih al-Bukhari 7117, Book 92, Hadith 64","grade":"","question #":"question #2","question":"Who is the man from Qahtan mentioned in Islamic eschatology, and what is his significance?","id":"bukhari-92-150"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till a fire will come out of the land of Hijaz, \nand it will throw light on the necks of the camels at Busra.\"","reference":"Sahih al-Bukhari 7118, Book 92, Hadith 65","grade":"","question #":"question #2","question":"How is the region of Hijaz significant in Islamic eschatology?","id":"bukhari-92-151"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Soon the river \"Euphrates\" will disclose the treasure (the mountain) of gold, so \nwhoever will be present at that time should not take anything of it.\" Al-A'raj narrated from Abii \nHuraira that the Prophet (ﷺ) said the same but he said, \"It (Euphrates) will uncover a mountain of gold \n(under it).","reference":"Sahih al-Bukhari 7119, Book 92, Hadith 66","grade":"","question #":"question #2","question":"Why are people advised against taking the gold from the Euphrates when it is uncovered?","id":"bukhari-92-152"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Give in charity because there will come a time on the people when a \nperson will go out with his alms from place to place but will not find anybody to accept it.\"","reference":"Sahih al-Bukhari 7120, Book 92, Hadith 67","grade":"","question #":"question #2","question":"What challenges might arise in the future regarding the acceptance of charity?","id":"bukhari-92-153"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established (1) till two big groups fight each other \nwhereupon there will be a great number of casualties on both sides and they will be following one and \nthe same religious doctrine, (2) till about thirty Dajjals (liars) appear, and each one of them will claim \nthat he is Allah's Messenger (ﷺ), (3) till the religious knowledge is taken away (by the death of Religious \nscholars) (4) earthquakes will increase in number (5) time will pass quickly, (6) afflictions will \nappear, (7) Al-Harj, (i.e., killing) will increase, (8) till wealth will be in abundance ---- so abundant \nthat a wealthy person will worry lest nobody should accept his Zakat, and whenever he will present it \nto someone, that person (to whom it will be offered) will say, 'I am not in need of it, (9) till the people \ncompete with one another in constructing high buildings, (10) till a man when passing by a grave of \nsomeone will say, 'Would that I were in his place (11) and till the sun rises from the West. So when \nthe sun will rise and the people will see it (rising from the West) they will all believe (embrace Islam) \nbut that will be the time when: (As Allah said,) 'No good will it do to a soul to believe then, if it \nbelieved not before, nor earned good (by deeds of righteousness) through its Faith.' (6.158) And the \nHour will be established while two men spreading a garment in front of them but they will not be able \nto sell it, nor fold it up; and the Hour will be established when a man has milked his she-camel and has \ntaken away the milk but he will not be able to drink it; and the Hour will be established before a man \nrepairing a tank (for his livestock) is able to water (his animals) in it; and the Hour will be established \nwhen a person has raised a morsel (of food) to his mouth but will not be able to eat it.\"","reference":"Sahih al-Bukhari 7121, Book 92, Hadith 68","grade":"","question #":"question #2","question":"How does the abundance of wealth and the reluctance to accept Zakat relate to the signs of the end times?","id":"bukhari-92-154"},{"hadith-eng":"Nobody asked the Prophet (ﷺ) as many questions as I asked regarding Ad-Dajjal. The Prophet (ﷺ) said to me, \n\"What worries you about him?\" I said, \"Because the people say that he will have a mountain of bread \nand a river of water with him (i.e. he will have abundance of food and water)\" The Prophet (ﷺ) said, \"Nay, \nhe is too mean to be allowed such a thing by Allah\"' (but it is only to test mankind whether they \nbelieve in Allah or in Ad-Dajjal.)","reference":"Sahih al-Bukhari 7122, Book 92, Hadith 69","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) describe the limitations of Ad-Dajjal's power?","id":"bukhari-92-155"},{"hadith-eng":"The Prophet (ﷺ) said (about Ad-Dajjal) that he is one eyed, his right eye is as if a protruding out grape.\"","reference":"Sahih al-Bukhari 7123, Book 92, Hadith 70","grade":"","question #":"question #2","question":"How is the appearance of Ad-Dajjal significant in Islamic eschatology?","id":"bukhari-92-156"},{"hadith-eng":"The Prophet (ﷺ) said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will \nshake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"","reference":"Sahih al-Bukhari 7124, Book 92, Hadith 71","grade":"","question #":"question #2","question":"How will the presence of Ad-Dajjal affect the inhabitants of Medina according to Islamic teachings?","id":"bukhari-92-157"},{"hadith-eng":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate (guarding them).","reference":"Sahih al-Bukhari 7125, Book 92, Hadith 72","grade":"","question #":"question #2","question":"How is the city of Medina protected during the time of Al-Masih Ad-Dajjal according to Islamic teachings?","id":"bukhari-92-158"},{"hadith-eng":"[as above]","reference":"Sahih al-Bukhari 7126, Book 92, Hadith 73","grade":"","question #":"question #2","question":"How can performing specific acts of worship aid in seeking forgiveness for sins?","id":"bukhari-92-159"},{"hadith-eng":"Allah's Messenger (ﷺ) stood up amongst the people and then praised and glorified Allah as He deserved and \nthen he mentioned Ad-Dajjal, saying, \"I warn you of him, and there was no prophet but warned his \nfollowers of him; but I will tell you something about him which no prophet has told his followers: Ad- \nDajjal is one-eyed whereas Allah is not.\"","reference":"Sahih al-Bukhari 7127, Book 92, Hadith 74","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) emphasize the importance of being aware of Ad-Dajjal?","id":"bukhari-92-160"},{"hadith-eng":"Allah's Messenger (ﷺ) said. \"While I was sleeping, I saw myself (in a dream) performing Tawaf around the \nKa`ba. Behold, I saw a reddish-white man with lank hair, and water was dropping from his head. I \nasked, \"Who is this?' They replied, 'The son of Mary.' Then I turned my face to see another man with \na huge body, red complexion and curly hair and blind in one eye. His eye looked like a protruding out \ngrape. They said (to me), He is Ad-Dajjal.\" The Prophet (ﷺ) added, \"The man he resembled most is Ibn \nQatan, a man from the tribe of Khuza`a. \"","reference":"Sahih al-Bukhari 7128, Book 92, Hadith 75","grade":"","question #":"question #2","question":"How is Ad-Dajjal described in the Prophet's dream?","id":"bukhari-92-161"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) in his prayer, seeking refuge with Allah from the afflictions of Ad-Dajjal.","reference":"Sahih al-Bukhari 7129, Book 92, Hadith 76","grade":"","question #":"question #2","question":"What are the potential dangers or trials associated with Ad-Dajjal that one should be aware of?","id":"bukhari-92-162"},{"hadith-eng":"The Prophet (ﷺ) said about Ad-Dajjal that he would have water and fire with him: (what would seem to \nbe) fire, would be cold water and (what would seem to be) water, would be fire.","reference":"Sahih al-Bukhari 7130, Book 92, Hadith 77","grade":"","question #":"question #2","question":"How can one discern between truth and deception in the context of Ad-Dajjal's trials?","id":"bukhari-92-163"},{"hadith-eng":"The Prophet (ﷺ) said, \"No prophet was sent but that he warned his followers against the one-eyed liar \n(Ad-Dajjal). Beware! He is blind in one eye, and your Lord is not so, and there will be written \nbetween his (Ad-Dajjal's) eyes (the word) Kafir (i.e., disbeliever).\" (This Hadith is also quoted by Abu \nHuraira and Ibn `Abbas).","reference":"Sahih al-Bukhari 7131, Book 92, Hadith 78","grade":"","question #":"question #2","question":"Why is it important for prophets to warn their followers about Ad-Dajjal?","id":"bukhari-92-164"},{"hadith-eng":"One day Allah's Messenger (ﷺ) narrated to us a long narration about Ad-Dajjal and among the things he \nnarrated to us, was: \"Ad-Dajjal will come, and he will be forbidden to enter the mountain passes of \nMedina. He will encamp in one of the salt areas neighboring Medina and there will appear to him a \nman who will be the best or one of the best of the people. He will say 'I testify that you are Ad-Dajjal \nwhose story Allah's Messenger (ﷺ) has told us.' Ad-Dajjal will say (to his audience), 'Look, if I kill this man \nand then give him life, will you have any doubt about my claim?' They will reply, 'No,' Then Ad- \nDajjal will kill that man and then will make him alive. The man will say, 'By Allah, now I recognize \nyou more than ever!' Ad-Dajjal will then try to kill him (again) but he will not be given the power to \ndo so.\"","reference":"Sahih al-Bukhari 7132, Book 92, Hadith 79","grade":"","question #":"question #2","question":"How is the city of Medina protected from the influence of Ad-Dajjal?","id":"bukhari-92-165"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There are angels at the mountain passes of Medina (so that) neither plague nor \nAd-Dajjal can enter it.'","reference":"Sahih al-Bukhari 7133, Book 92, Hadith 80","grade":"","question #":"question #2","question":"What role do angels play in safeguarding certain locations in Islamic belief?","id":"bukhari-92-166"},{"hadith-eng":"The Prophet (ﷺ) said, \"Ad-Dajjal will come to Medina and find the angels guarding it. So Allah willing, \nneither Ad-Dajjal, nor plague will be able to come near it.\"","reference":"Sahih al-Bukhari 7134, Book 92, Hadith 81","grade":"","question #":"question #2","question":"What role do angels play in safeguarding certain places from evil in Islamic belief?","id":"bukhari-92-167"},{"hadith-eng":"That one day Allah's Messenger (ﷺ) entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet (ﷺ) made a circle with his index \nfinger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet (ﷺ) said, \"Yes, if the (number) of evil (persons) \nincreased.\"","reference":"Sahih al-Bukhari 7135, Book 92, Hadith 82","grade":"","question #":"question #2","question":"How does the presence of righteous individuals affect the fate of a community facing widespread evil?","id":"bukhari-92-168"},{"hadith-eng":"The Prophet (ﷺ) said, \"A hole has been opened in the dam of Gog and Magog.\" Wuhaib (the sub-narrator) \nmade the number 90 (with his index finger and thumb).","reference":"Sahih al-Bukhari 7136, Book 92, Hadith 83","grade":"","question #":"question #2","question":"How does the opening of a hole in the dam of Gog and Magog relate to the signs of the Day of Judgment?","id":"bukhari-92-169"},{"hadith-eng":"The Prophet (ﷺ) said, \"I will be at my Lake-Fount (Kauthar) waiting for whoever will come to me. Then \nsome people will be taken away from me whereupon I will say, 'My followers!' It will be said, 'You \ndo not know they turned Apostates as renegades (deserted their religion).'\" (Ibn Abi Mulaika said, \n\"Allah, we seek refuge with You from turning on our heels from the (Islamic) religion and from being \nput to trial\").","reference":"Sahih al-Bukhari 7048, Book 92, Hadith 1","grade":"","question #":"question #3","question":"How can one seek protection from apostasy and trials in their faith journey?","id":"bukhari-92-170"},{"hadith-eng":"The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount (Kauthar) and some men amongst you \nwill be brought to me, and when I will try to hand them some water, they will be pulled away from me \nby force whereupon I will say, 'O Lord, my companions!' Then the Almighty will say, 'You do not \nknow what they did after you left, they introduced new things into the religion after you.'\"","reference":"Sahih al-Bukhari 7049, Book 92, Hadith 2","grade":"","question #":"question #3","question":"How does the concept of companionship with the Prophet relate to one's actions after his departure?","id":"bukhari-92-171"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"I am your predecessor at the Lake-Fount (Kauthar), and whoever will \ncome to it, will drink from it, and whoever will drink from it, will never become thirsty after that. \nThere will come to me some people whom I know and they know me, and then a barrier will be set up \nbetween me and them.\"","reference":"Sahih al-Bukhari 7050, Book 92, Hadith 3","grade":"","question #":"question #3","question":"How does the concept of recognition between the Prophet and his followers manifest in the afterlife?","id":"bukhari-92-172"},{"hadith-eng":"\"I will say those \npeople are from me. It will be said, 'You do not know what changes and new things they did after \nyou.' Then I will say, 'Far removed (from mercy), far removed (from mercy), those who changed (the \nreligion) after me!\"","reference":"Sahih al-Bukhari 7051, Book 92, Hadith 4","grade":"","question #":"question #3","question":"What consequences are mentioned for those who introduce changes in the religion after the Prophet?","id":"bukhari-92-173"},{"hadith-eng":"Allah's Messenger (ﷺ) said to us, \"You will see after me, selfishness (on the part of other people) and other \nmatters that you will disapprove of.\" They asked, \"What do you order us to do, O Allah's Messenger (ﷺ)? \n(under such circumstances)?\" He said, \"Pay their rights to them (to the rulers) and ask your right from \nAllah.\"","reference":"Sahih al-Bukhari 7052, Book 92, Hadith 5","grade":"","question #":"question #3","question":"How can one seek their rights from Allah in times of societal injustice?","id":"bukhari-92-174"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever disapproves of something done by his ruler then he should be patient, for \nwhoever disobeys the ruler even a little (little = a span) will die as those who died in the Pre-lslamic \nPeriod of Ignorance. (i.e. as rebellious Sinners).","reference":"Sahih al-Bukhari 7053, Book 92, Hadith 6","grade":"","question #":"question #3","question":"How is dying in a state of rebellion compared to the Pre-Islamic Period of Ignorance?","id":"bukhari-92-175"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever notices something which he dislikes done by his ruler, then he should be \npatient, for whoever becomes separate from the company of the Muslims even for a span and then \ndies, he will die as those who died in the Pre-lslamic period of Ignorance (as rebellious sinners). \n(Fath-ul-Bari page 112, Vol. 16)","reference":"Sahih al-Bukhari 7054, Book 92, Hadith 7","grade":"","question #":"question #3","question":"How does Islam view rebellion against authority in the context of historical ignorance?","id":"bukhari-92-176"},{"hadith-eng":"We entered upon 'Ubada bin As-Samit while he was sick. We said, \"May Allah make you healthy. \nWill you tell us a Hadith you heard from the Prophet (ﷺ) and by which Allah may make you benefit?\" He \nsaid, \"The Prophet (ﷺ) called us and we gave him the Pledge of allegiance for Islam, and among the \nconditions on which he took the Pledge from us, was that we were to listen and obey (the orders) both \nat the time when we were active and at the time when we were tired, and at our difficult time and at \nour ease and to be obedient to the ruler and give him his right even if he did not give us our right, and \nnot to fight against him unless we noticed him having open Kufr (disbelief) for which we would have \na proof with us from Allah.\"","reference":"Sahih al-Bukhari 7055, 7056, Book 92, Hadith 8","grade":"","question #":"question #3","question":"Under what circumstances is it permissible to oppose a ruler according to Islamic teachings?","id":"bukhari-92-177"},{"hadith-eng":"A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You appointed such-and-such person and \nyou did not appoint me?\" The Prophet (ﷺ) said, \"After me you will see rulers not giving you your right \n(but you should give them their right) and be patient till you meet me.\"","reference":"Sahih al-Bukhari 7057, Book 92, Hadith 9","grade":"","question #":"question #3","question":"What guidance does Islam provide for maintaining one's duties towards leaders despite personal grievances?","id":"bukhari-92-178"},{"hadith-eng":"I heard the truthful and trusted by Allah (i.e., the Prophet (ﷺ) ) saying, \"The destruction of my followers \nwill be through the hands of young men from Quraish.\"","reference":"Sahih al-Bukhari 7058, Book 92, Hadith 10","grade":"","question #":"question #3","question":"What significance does the Prophet Muhammad (ﷺ) place on the role of young men from Quraish in the context of his followers' challenges?","id":"bukhari-92-179"},{"hadith-eng":"The Prophet (ﷺ) got up from his sleep with a flushed red face and said, \"None has the right to be \nworshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a \ngap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the \nnumber 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous \npeople among us?\" The Prophet (ﷺ) said, \"Yes, if evil increased.\"","reference":"Sahih al-Bukhari 7059, Book 92, Hadith 11","grade":"","question #":"question #3","question":"What significance does the wall of Gog and Magog hold in Islamic eschatology?","id":"bukhari-92-180"},{"hadith-eng":"Once the Prophet (ﷺ) stood over one of the high buildings of Medina and then said (to the people), \"Do \nyou see what I see?\" They said, \"No.\" He said, \"I see afflictions falling among your houses as rain \ndrops fall.\"","reference":"Sahih al-Bukhari 7060, Book 92, Hadith 12","grade":"","question #":"question #3","question":"What can be learned from the Prophet's warning about future challenges faced by the community?","id":"bukhari-92-181"},{"hadith-eng":"The Prophet (ﷺ) said, \"Time will pass rapidly, good deeds will decrease, miserliness will be thrown (in the \nhearts of the people) afflictions will appear and there will be much 'Al-Harj.\" They said, \"O Allah's \nApostle! What is \"Al-Harj?\" He said, \"Killing! Killing!\" (See Hadith No. 63, Vol. 8)","reference":"Sahih al-Bukhari 7061, Book 92, Hadith 13","grade":"","question #":"question #3","question":"What is the significance of 'Al-Harj' in the context of future afflictions according to Islamic prophecy?","id":"bukhari-92-182"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour there will be days during which Religious \nignorance will spread, knowledge will be taken away (vanish) and there will be much Al-Harj, and Al- \nHarj means killing.\"","reference":"Sahih al-Bukhari 7062, 7063, Book 92, Hadith 14","grade":"","question #":"question #3","question":"What is the significance of the increase in killing as a sign of the Hour?","id":"bukhari-92-183"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour there will be days during which (religious) \nknowledge will be taken away (vanish) and general ignorance will spread, and there will be Al-Harj in \nabundance, and Al-Harj means killing.\"","reference":"Sahih al-Bukhari 7064, Book 92, Hadith 15","grade":"","question #":"question #3","question":"What is the significance of the term 'Al-Harj' in the context of the end times?","id":"bukhari-92-184"},{"hadith-eng":"The Prophet (ﷺ) said...(as above, 185). And Harj, in the Ethiopian language, means killing.","reference":"Sahih al-Bukhari 7065, Book 92, Hadith 16","grade":"","question #":"question #3","question":"What is the impact of language diversity on the transmission of hadiths?","id":"bukhari-92-185"},{"hadith-eng":"The Prophet (ﷺ) said, \"Near the establishment of the Hour, there will be the days of Al-Harj, and the \nreligious knowledge will be taken away (vanish i.e. by the death of Religious scholars) and general \nignorance will spread.\" Abu Musa said, \"Al-Harj, in the Ethiopian language, means killing.\"","reference":"Sahih al-Bukhari 7066, Book 92, Hadith 17","grade":"","question #":"question #3","question":"What is the significance of the term 'Al-Harj' in the context of the end times?","id":"bukhari-92-186"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying; (It will be) from among the most wicked people who \nwill be living at the time when the Hour will be established.\"","reference":"Sahih al-Bukhari 7067, Book 92, Hadith 18","grade":"","question #":"question #3","question":"How does the behavior of people at the time of the Hour reflect their wickedness?","id":"bukhari-92-187"},{"hadith-eng":"We went to Anas bin Malik and complained about the wrong we were suffering at the hand of Al- \nHajjaj. Anas bin Malik said, \"Be patient till you meet your Lord, for no time will come upon you but \nthe time following it will be worse than it. I heard that from the Prophet.\"","reference":"Sahih al-Bukhari 7068, Book 92, Hadith 19","grade":"","question #":"question #3","question":"What is the significance of believing that future times may be more challenging than the present?","id":"bukhari-92-188"},{"hadith-eng":"(the wife of the Prophet) Allah's Messenger (ﷺ) woke up one night in a state of terror and said, \"Subhan \nAllah, How many treasures Allah has sent down! And how many afflictions have been sent down! \nWho will go and wake the lady dwellers (wives of the Prophet) up of these rooms (for prayers)?\" He \nmeant his wives, so that they might pray. He added, \"A well-dressed (soul) in this world may be naked \nin the Hereafter.\"","reference":"Sahih al-Bukhari 7069, Book 92, Hadith 20","grade":"","question #":"question #3","question":"What can be inferred about the relationship between divine treasures and afflictions from this narration?","id":"bukhari-92-189"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Whoever takes up arms against us, is not from us.\"","reference":"Sahih al-Bukhari 7070, Book 92, Hadith 21","grade":"","question #":"question #3","question":"What are the implications of using violence within the Muslim community according to Islamic teachings?","id":"bukhari-92-190"},{"hadith-eng":"The Prophet (ﷺ) said, \"Whoever takes up arms against us, is not from us.\"","reference":"Sahih al-Bukhari 7071, Book 92, Hadith 22","grade":"","question #":"question #3","question":"What are the implications of being excluded from the Muslim community according to Islamic teachings?","id":"bukhari-92-191"},{"hadith-eng":"The Prophet (ﷺ) said, \"None of you should point out towards his Muslim brother with a weapon, for he \ndoes not know, Satan may tempt him to hit him and thus he would fall into a pit of fire (Hell)\"","reference":"Sahih al-Bukhari 7072, Book 92, Hadith 23","grade":"","question #":"question #3","question":"What are the consequences of unintentionally harming someone due to negligence or provocation in Islam?","id":"bukhari-92-192"},{"hadith-eng":"I said to `Amr, \"O Abu Muhammad! Did you hear Jabir bin `Abdullah saying, 'A man carrying arrows \npassed through the mosque and Allah's Messenger (ﷺ) said to him, 'Hold the arrows by their heads! \"`Amr \nreplied, \"Yes.\"","reference":"Sahih al-Bukhari 7073, Book 92, Hadith 24","grade":"","question #":"question #3","question":"What is the significance of being cautious with weapons in communal spaces according to Islamic teachings?","id":"bukhari-92-193"},{"hadith-eng":"A man passed through the mosque and he was carrying arrows, the heads of which were exposed \n(protruding). The man was ordered (by the Prophet) to hold the iron heads so that it might not scratch \n(injure) any Muslim.","reference":"Sahih al-Bukhari 7074, Book 92, Hadith 25","grade":"","question #":"question #3","question":"What responsibilities do individuals have when carrying potentially harmful objects in public areas?","id":"bukhari-92-194"},{"hadith-eng":"The Prophet (ﷺ) said, \"If anyone of you passed through our mosque or through our market while carrying \narrows, he should hold the iron heads,\" or said, \"..... he should hold (their heads) firmly with his hand \nlest he should injure one of the Muslims with it.\"","reference":"Sahih al-Bukhari 7075, Book 92, Hadith 26","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding carrying potentially harmful objects in crowded places?","id":"bukhari-92-195"},{"hadith-eng":"The Prophet, said, \"Abusing a Muslim is Fusuq (evil doing) and killing him is Kufr (disbelief).","reference":"Sahih al-Bukhari 7076, Book 92, Hadith 27","grade":"","question #":"question #3","question":"What is the distinction between Fusuq and Kufr in the context of this teaching?","id":"bukhari-92-196"},{"hadith-eng":"I heard the Prophet (ﷺ) saying, \"Do not revert to disbelief after me by striking (cutting) the necks of one \nanother.\"","reference":"Sahih al-Bukhari 7077, Book 92, Hadith 28","grade":"","question #":"question #3","question":"What are the consequences of engaging in violence against fellow Muslims according to Islamic teachings?","id":"bukhari-92-197"},{"hadith-eng":"Allah's Messenger (ﷺ) addressed the people saying, \"Don't you know what is the day today?\" They replied, \n\"Allah and His Apostle know better.\" We thought that he might give that day another name. The \nProphet said, \"Isn't it the day of An-Nahr?\" We replied, \"Yes. O Allah's Messenger (ﷺ).\" He then said, \"What \ntown is this? Isn't it the forbidden (Sacred) Town (Mecca)?\" We replied, \"Yes, O Allah's Messenger (ﷺ).\" He \nthen said, \"Your blood, your properties, your honors and your skins (i.e., bodies) are as sacred to one \nanother like the sanctity of this day of yours in this month of yours in this town of yours. (Listen) \nHaven't I conveyed Allah's message to you?\" We replied, \"Yes\" He said, \"O Allah! Be witness (for it). \nSo it is incumbent upon those who are present to convey it (this message of mine) to those who are \nabsent because the informed one might comprehend what I have said better than the present audience \nwho will convey it to him.)\" The narrator added: In fact, it was like that. The Prophet (ﷺ) added, \"Beware! \nDo not renegade as disbelievers after me by striking (cutting) the necks of one another.\"","reference":"Sahih al-Bukhari 7078, Book 92, Hadith 29","grade":"","question #":"question #3","question":"What warning did the Prophet give regarding actions that could lead to disbelief after his time?","id":"bukhari-92-198"},{"hadith-eng":"The Prophet (ﷺ) said, \"Beware! Do not renegade as (disbelievers) after me by striking (cutting) the necks \nof one another.\"","reference":"Sahih al-Bukhari 7079, Book 92, Hadith 30","grade":"","question #":"question #3","question":"How does the hadith emphasize the importance of unity and peace among Muslims?","id":"bukhari-92-199"},{"hadith-eng":"The Prophet (ﷺ) said to me during Hajjat-al-Wada`, \"Let the people keep quiet and listen.\" Then he said \n(addressing the people), \"Beware! Do not renegade as disbelievers after me by striking (cutting) the \nnecks of one another.\"","reference":"Sahih al-Bukhari 7080, Book 92, Hadith 31","grade":"","question #":"question #3","question":"How does the Prophet (ﷺ) emphasize the importance of listening and paying attention during significant events like Hajjat-al-Wada`?","id":"bukhari-92-200"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will be afflictions (in the near future) during which a sitting person will \nbe better than a standing one, and the standing one will be better than the walking one, and the \nwalking one will be better than the running one, and whoever will expose himself to these afflictions, \nthey will destroy him. So whoever can find a place of protection or refuge from them, should take \nshelter in it.\"","reference":"Sahih al-Bukhari 7081, Book 92, Hadith 32","grade":"","question #":"question #3","question":"What are the potential consequences of exposing oneself to afflictions or trials?","id":"bukhari-92-201"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will be afflictions (in the near future) during which a sitting person will \nbe better than a standing one, and the standing one will be better than a walking one, and the walking \none will be better than a running one, and whoever will expose himself to these afflictions, they will \ndestroy him. So whoever can find a place of protection or refuge from them, should take shelter in it.\"","reference":"Sahih al-Bukhari 7082, Book 92, Hadith 33","grade":"","question #":"question #3","question":"What are the consequences of exposing oneself to afflictions according to the teachings of the Prophet (ﷺ)?","id":"bukhari-92-202"},{"hadith-eng":"(Al-Ahnaf said:) I went out carrying my arms during the nights of the affliction (i.e. the war between \n`Ali and `Aisha) and Abu Bakra met me and asked, \"Where are you going?\" I replied, \"I intend to help \nthe cousin of Allah's Messenger (ﷺ) (i.e.,`Ali).\" Abu Bakra said, \"Allah's Messenger (ﷺ) said, 'If two Muslims take \nout their swords to fight each other, then both of them will be from amongst the people of the Hell- \nFire.' It was said to the Prophet, 'It is alright for the killer but what about the killed one?' He replied, \n'The killed one had the intention to kill his opponent.'\" (See Hadith No. 30, Vol. 1)Narrated Al-Ahnaf:Abu Bakra said: The Prophet (ﷺ) said (as above, 204).","reference":"Sahih al-Bukhari 7083, Book 92, Hadith 34","grade":"","question #":"question #3","question":"How does intention play a role in the accountability of actions in Islam, particularly in conflicts?","id":"bukhari-92-203"},{"hadith-eng":"The people used to ask Allah's Messenger (ﷺ) about the good but I used to ask him about the evil lest I \nshould be overtaken by them. So I said, \"O Allah's Messenger (ﷺ)! We were living in ignorance and in an \n(extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil \nafter this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but \nit will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some \npeople who will guide others not according to my tradition? You will approve of some of their deeds \nand disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, \n(there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their \ncall, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them \nto us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do \nyou order me to do if such a state should take place in my life?\" He said, \"Stick to the group of \nMuslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" \nHe said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death \novertakes you while you are in that state.\"","reference":"Sahih al-Bukhari 7084, Book 92, Hadith 35","grade":"","question #":"question #3","question":"What actions should a Muslim take when there is no clear leadership or community to follow?","id":"bukhari-92-204"},{"hadith-eng":"An army unit was being recruited from the people of Medina and my name was written among them. \nThen I met `Ikrima, and when I informed him about it, he discouraged me very strongly and said, \"Ibn \n`Abbas told me that there were some Muslims who were with the pagans to increase their number \nagainst Allah's Messenger (ﷺ) (and the Muslim army) so arrows (from the Muslim army) would hit one of \nthem and kill him or a Muslim would strike him (with his sword) and kill him. So Allah revealed:-- \n'Verily! As for those whom the angels take (in death) while they are wronging themselves (by staying \namong the disbelievers).' (4.97)","reference":"Sahih al-Bukhari 7085, Book 92, Hadith 36","grade":"","question #":"question #3","question":"What guidance does Islam provide regarding participation in battles against fellow Muslims?","id":"bukhari-92-205"},{"hadith-eng":"Allah's Messenger (ﷺ) related to us, two prophetic narrations one of which I have seen fulfilled and I am \nwaiting for the fulfillment of the other. The Prophet (ﷺ) told us that the virtue of honesty descended in the \nroots of men's hearts (from Allah) and then they learned it from the Qur'an and then they learned it \nfrom the Sunna (the Prophet's traditions). The Prophet (ﷺ) further told us how that honesty will be taken \naway: He said: \"Man will go to sleep during which honesty will be taken away from his heart and only \nits trace will remain in his heart like the trace of a dark spot; then man will go to sleep, during which \nhonesty will decrease further still, so that its trace will resemble the trace of blister as when an ember \nis dropped on one's foot which would make it swell, and one would see it swollen but there would be \nnothing inside. People would be carrying out their trade but hardly will there be a trustworthy person. \nIt will be said, 'in such-and-such tribe there is an honest man,' and later it will be said about some man, \n'What a wise, polite and strong man he is!' Though he will not have faith equal even to a mustard seed \nin his heart.\" No doubt, there came upon me a time when I did not mind dealing (bargaining) with \nanyone of you, for if he was a Muslim his Islam would compel him to pay me what is due to me, and \nif he was a Christian, the Muslim official would compel him to pay me what is due to me, but today I \ndo not deal except with such-and-such person.","reference":"Sahih al-Bukhari 7086, Book 92, Hadith 37","grade":"","question #":"question #3","question":"How is the presence of honesty in individuals and communities perceived over time in Islamic teachings?","id":"bukhari-92-206"},{"hadith-eng":"That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your \nheels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but \nAllah's Messenger (ﷺ) allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: \nWhen `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- \nRabadha and married there and begot children, and he stayed there till a few nights before his death \nwhen he came to Medina.","reference":"Sahih al-Bukhari 7087, Book 92, Hadith 38","grade":"","question #":"question #3","question":"What significant life events occurred for Salama bin Al-Akwa` after the martyrdom of Uthman bin Affan?","id":"bukhari-92-207"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There will come a time when the best property of a Muslim will be sheep which \nhe will take to the tops of mountains and the places of rainfall so as to flee with his religion from the \nafflictions.","reference":"Sahih al-Bukhari 7088, Book 92, Hadith 39","grade":"","question #":"question #3","question":"What significance do sheep and natural environments hold in the context of preserving one's religion during times of trial?","id":"bukhari-92-208"},{"hadith-eng":"The people started asking the Prophet (ﷺ) too many questions importunately. So one day he ascended the \npulpit and said, \"You will not ask me any question but I will explain it to you.\" I looked right and left, \nand behold, every man was covering his head with his garment and weeping. Then got up a man who, \nwhenever quarreling with somebody, used to be accused of not being the son of his father. He said, \"O \nAllah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then `Umar got \nup and said, \"We accept Allah as our Lord, Islam as our religion and Muhammad as our Apostle and \nwe seek refuge with Allah from the evil of afflictions.\" The Prophet (ﷺ) said, \" I have never seen the good \nand bad like on this day. No doubt, Paradise and Hell was displayed in front of me till I saw them in \nfront of that wall,\" Qatada said: This Hadith used to be mentioned as an explanation of this Verse:-- 'O \nyou who believe! Ask not questions about things which, if made plain to you, may cause you trouble.' \n(5.101)","reference":"Sahih al-Bukhari 7089, Book 92, Hadith 40","grade":"","question #":"question #3","question":"What lesson can be learned from the incident where Paradise and Hell were displayed to the Prophet (ﷺ)?","id":"bukhari-92-209"},{"hadith-eng":"The the above hadith was narrated by Anas through another chain and said (with the wording) \"and every man had his head wrapped in his garment and weeping\".  And he said (with the wording) \"seeking refuge with Allah from the evil of afflictions\" or he said \"I seek refuge with Allah from the evil of afflictions.\"","reference":"Sahih al-Bukhari 7090, Book 92, Hadith 41","grade":"","question #":"question #3","question":"What practices are recommended when facing trials and tribulations in life?","id":"bukhari-92-210"},{"hadith-eng":"The above hadith is narrated on the authority of Anas thorugh another chain and he said (with the wording) \"seeking refuge with Allah from the evil of afflictions.\"","reference":"Sahih al-Bukhari 7091, Book 92, Hadith 42","grade":"","question #":"question #3","question":"What are the benefits of seeking protection from Allah against trials and tribulations?","id":"bukhari-92-211"},{"hadith-eng":"The Prophet (ﷺ) stood up beside the pulpit (and pointed with his finger towards the East) and said, \n\"Afflictions are there! Afflictions are there, from where the side of the head of Satan comes out,\" or \nsaid, \"..the side of the sun..\"","reference":"Sahih al-Bukhari 7092, Book 92, Hadith 43","grade":"","question #":"question #3","question":"What can be inferred about the geographical direction associated with trials and tribulations in Islamic teachings?","id":"bukhari-92-212"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) while he was facing the East, saying, \"Verily! Afflictions are there, from \nwhere the side of the head of Satan comes out.\"","reference":"Sahih al-Bukhari 7093, Book 92, Hadith 44","grade":"","question #":"question #3","question":"What is the symbolic meaning of the 'side of the head of Satan' in Islamic tradition?","id":"bukhari-92-213"},{"hadith-eng":"The Prophet (ﷺ) said, \"O Allah! Bestow Your blessings on our Sham! O Allah! Bestow Your blessings on \nour Yemen.\" The People said, \"And also on our Najd.\" He said, \"O Allah! Bestow Your blessings on \nour Sham (north)! O Allah! Bestow Your blessings on our Yemen.\" The people said, \"O Allah's \nApostle! And also on our Najd.\" I think the third time the Prophet (ﷺ) said, \"There (in Najd) is the place \nof earthquakes and afflictions and from there comes out the side of the head of Satan.\"","reference":"Sahih al-Bukhari 7094, Book 92, Hadith 45","grade":"","question #":"question #3","question":"What is the implication of the phrase 'the side of the head of Satan' in the context of Najd?","id":"bukhari-92-214"},{"hadith-eng":"`Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before \nwe asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles \nduring the time of the afflictions, as Allah says:-- \n'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" \n(2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother \nbereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion \n(The pagans will either kill him or chain him as a captive). His fighting was not like your fighting \nwhich is carried on for the sake of ruling.\"","reference":"Sahih al-Bukhari 7095, Book 92, Hadith 46","grade":"","question #":"question #3","question":"What challenges did early Muslims face in practicing their religion during the time of the Prophet Muhammad?","id":"bukhari-92-215"},{"hadith-eng":"I heard Hudhaifa saying, \"While we were sitting with `Umar, he said, 'Who among you remembers the \nstatement of the Prophet (ﷺ) about the afflictions?' Hudhaifa said, \"The affliction of a man in his family, \nhis property, his children and his neighbors are expiated by his prayers, Zakat (and alms) and \nenjoining good and forbidding evil.\" `Umar said, \"I do not ask you about these afflictions, but about \nthose afflictions which will move like the waves of the sea.\" Hudhaifa said, \"Don't worry about it, O \nchief of the believers, for there is a closed door between you and them.\" `Umar said, \"Will that door \nbe broken or opened?\" I said, \"No. it will be broken.\" `Umar said, \"Then it will never be closed,\" I \nsaid, \"Yes.\" We asked Hudhaifa, \"Did `Umar know what that door meant?\" He replied, \"Yes, as I \nknow that there will be night before tomorrow morning, that is because I narrated to him a true \nnarration free from errors.\" We dared not ask Hudhaifa as to whom the door represented so we \nordered Masruq to ask him what does the door stand for? He replied, \"`Umar.\"","reference":"Sahih al-Bukhari 7096, Book 92, Hadith 47","grade":"","question #":"question #3","question":"What significance does the metaphor of a 'closed door' have in the context of future trials and tribulations?","id":"bukhari-92-216"},{"hadith-eng":"The Prophet (ﷺ) went out to one of the gardens of Medina for some business and I went out to follow him. \nWhen he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the \nProphet though he has not ordered me.\" The Prophet (ﷺ) went and finished his need and went to sit on the \nconstructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu \nBakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr \nwaited outside and I went to the Prophet (ﷺ) and said, \"O Allah's Prophet! Abu Bakr asks your permission \nto enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr \nentered and sat on the right side of the Prophet (ﷺ) and uncovered his legs and hung them in the well. \nThen `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet (ﷺ) said, \"Admit him \nand give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the \nProphet and uncovered his legs and hung them in the well so that one side of the well became fully \noccupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \n\"Wait till I get permission for you.\" The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of \nentering Paradise with a calamity which will befall him.\" When he entered, he could not find any \nplace to sit with them so he went to the other edge of the well opposite them and uncovered his legs \nand hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his \ncoming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three \nare together and the grave of `Uthman is separate from theirs.\")","reference":"Sahih al-Bukhari 7097, Book 92, Hadith 48","grade":"","question #":"question #3","question":"What can be learned about the roles and status of Abu Bakr, Umar, and Uthman in early Islamic history from this event?","id":"bukhari-92-217"},{"hadith-eng":"Someone said to Usama, \"Will you not talk to this (Uthman)?\" Usama said, \"I talked to him (secretly) \nwithout being the first man to open an evil door. I will never tell a ruler who rules over two men or \nmore that he is good after I heard Allah's Messenger (ﷺ) saying, 'A man will be brought and put in Hell (Fire) \nand he will circumambulate (go around and round) in Hell (Fire) like a donkey of a (flour) grinding \nmill, and all the people of Hell (Fire) will gather around him and will say to him, O so-and-so! Didn't \nyou use to order others for good and forbid them from evil?' That man will say, 'I used to order others \nto do good but I myself never used to do it, and I used to forbid others from evil while I myself used to \ndo evil.' \"","reference":"Sahih al-Bukhari 7098, Book 92, Hadith 49","grade":"","question #":"question #3","question":"What is the significance of practicing what one preaches in Islam?","id":"bukhari-92-218"},{"hadith-eng":"During the battle of Al-Jamal, Allah benefited me with a Word (I heard from the Prophet). When the \nProphet heard the news that the people of the Persia had made the daughter of Khosrau their Queen \n(ruler), he said, \"Never will succeed such a nation as makes a woman their ruler.\"","reference":"Sahih al-Bukhari 7099, Book 92, Hadith 50","grade":"","question #":"question #3","question":"What historical context is associated with the Prophet's statement regarding female rulers?","id":"bukhari-92-219"},{"hadith-eng":"When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir and Hasan bin `Ali \nwho came to us at Kufa and ascended the pulpit. Al-Hasan bin `Ali was at the top of the pulpit and \n`Ammar was below Al-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has \nmoved to Al-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But \nAllah has put you to test whether you obey Him (Allah) or her (`Aisha).","reference":"Sahih al-Bukhari 7100, Book 92, Hadith 51","grade":"","question #":"question #3","question":"What role does the concept of divine testing play in the lives of believers according to Islamic teachings?","id":"bukhari-92-220"},{"hadith-eng":"`Ammar stood on the pulpit at Kufa and mentioned `Aisha and her coming (to Busra) and said, \"She is \nthe wife of your Prophet in this world and in the Hereafter, but you people are being put to test in this \nissue.\"","reference":"Sahih al-Bukhari 7101, Book 92, Hadith 52","grade":"","question #":"question #3","question":"What kind of tests or trials are referred to in the context of Aisha's mention in this narration?","id":"bukhari-92-221"},{"hadith-eng":"Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).","reference":"Sahih al-Bukhari 7102, 7103, 7104, Book 92, Hadith 53","grade":"","question #":"question #3","question":"What role does providing for others play in fostering community and solidarity in Islam?","id":"bukhari-92-222"},{"hadith-eng":"Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).","reference":"Sahih al-Bukhari 7102, 7103, 7104, Book 92, Hadith 53","grade":"","question #":"question #3","question":"What role does providing for others play in fostering goodwill and resolving disagreements in Islamic teachings?","id":"bukhari-92-223"},{"hadith-eng":"I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"","reference":"Sahih al-Bukhari 7105, 7106, 7107, Book 92, Hadith 54","grade":"","question #":"question #3","question":"What is the significance of wearing clean or new clothes for Friday prayers in Islam?","id":"bukhari-92-224"},{"hadith-eng":"I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"","reference":"Sahih al-Bukhari 7105, 7106, 7107, Book 92, Hadith 54","grade":"","question #":"question #3","question":"What is the significance of wearing clean or new clothes for Friday prayers in Islamic tradition?","id":"bukhari-92-225"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"If Allah sends punishment upon a nation then it befalls upon the whole \npopulation indiscriminately and then they will be resurrected (and judged) according to their deeds. \"","reference":"Sahih al-Bukhari 7108, Book 92, Hadith 55","grade":"","question #":"question #3","question":"How are people judged after resurrection in relation to their actions during their lifetime?","id":"bukhari-92-226"},{"hadith-eng":"When Al-Hasan bin `Ali moved with army units against Muawiya, `Amr bin AL-As said to Muawiya, \n\"I see an army that will not retreat unless and until the opposing army retreats.\" Muawiya said, \"(If the \nMuslims are killed) who will look after their children?\" `Amr bin Al-As said: I (will look after them). \nOn that, `Abdullah bin 'Amir and `Abdur-Rahman bin Samura said, \"Let us meet Muawaiya and \nsuggest peace.\" Al-Hasan Al-Basri added: No doubt, I heard that Abu Bakra said, \"Once while the \nProphet was addressing (the people), Al-Hasan (bin `Ali) came and the Prophet (ﷺ) said, 'This son of mine \nis a chief, and Allah may make peace between two groups of Muslims through him.\"","reference":"Sahih al-Bukhari 7109, Book 92, Hadith 56","grade":"","question #":"question #3","question":"What considerations were made by Muawiya and his advisors regarding the welfare of Muslim children during conflict?","id":"bukhari-92-227"},{"hadith-eng":"(Usama's Maula) Usama (bin Zaid) sent me to `Ali (at Kufa) and said, \"`Ali will ask you, 'What has \nprevented your companion from joining me?' You then should say to him, 'If you (`Ali) were in the \nmouth of a lion, I would like to be with you, but in this matter I won't take any part.' \" Harmala added: \n\"`Ali didn't give me anything (when I conveyed the message to him) so I went to Hasan, Hussain and \nIbn Ja`far and they loaded my camels with much (wealth).","reference":"Sahih al-Bukhari 7110, Book 92, Hadith 57","grade":"","question #":"question #3","question":"What does this narration suggest about the political or social dynamics during the time of Ali?","id":"bukhari-92-228"},{"hadith-eng":"When the people of Medina dethroned Yazid bin Muawiya, Ibn `Umar gathered his special friends \nand children and said, \"I heard the Prophet (ﷺ) saying, 'A flag will be fixed for every betrayer on the Day \nof Resurrection,' and we have given the oath of allegiance to this person (Yazid) in accordance with \nthe conditions enjoined by Allah and His Apostle and I do not know of anything more faithless than \nfighting a person who has been given the oath of allegiance in accordance with the conditions \nenjoined by Allah and His Apostle , and if ever I learn that any person among you has agreed to \ndethrone Yazid, by giving the oath of allegiance (to somebody else) then there will be separation \nbetween him and me.\"","reference":"Sahih al-Bukhari 7111, Book 92, Hadith 58","grade":"","question #":"question #3","question":"What are the implications of breaking an oath of allegiance according to Islamic teachings?","id":"bukhari-92-229"},{"hadith-eng":"When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and \nQurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we \nentered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with \nhim and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the \npeople has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of \nbeing angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in \nmisery and were few in number and misguided, and that Allah has brought you out of all that with \nIslam and with Muhammad till He brought you to this state (of prosperity and happiness) which you \nsee now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. \nThe one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: \nand those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that \none who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly \ngain.\"","reference":"Sahih al-Bukhari 7112, Book 92, Hadith 59","grade":"","question #":"question #3","question":"What role does wealth and worldly pleasures play in causing discord among people?","id":"bukhari-92-230"},{"hadith-eng":"Hudhaifa bin Al-Yaman said, 'The hypocrites of today are worse than those of the lifetime of the \nProphet, because in those days they used to do evil deeds secretly but today they do such deeds \nopenly.'","reference":"Sahih al-Bukhari 7113, Book 92, Hadith 60","grade":"","question #":"question #3","question":"Why might open sinning be considered worse than secret sinning in the context of hypocrisy?","id":"bukhari-92-231"},{"hadith-eng":"Hudhaifa said, 'In fact, it was hypocrisy that existed in the lifetime of the Prophet (ﷺ) but today it is Kufr \n(disbelief) after belief.'","reference":"Sahih al-Bukhari 7114, Book 92, Hadith 61","grade":"","question #":"question #3","question":"What are the implications of hypocrisy turning into disbelief according to Islamic teachings?","id":"bukhari-92-232"},{"hadith-eng":"The Prophet (ﷺ) said, \"The Hour will not be established till a man passes by a grave of somebody and \nsays, 'Would that I were in his place.' \"","reference":"Sahih al-Bukhari 7115, Book 92, Hadith 62","grade":"","question #":"question #3","question":"How does the feeling of despair relate to the signs of the Last Day in Islam?","id":"bukhari-92-233"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till the buttocks of the women of the tribe of \nDaus move while going round Dhi-al-Khalasa.\" Dhi-al-Khalasa was the idol of the Daus tribe which \nthey used to worship in the Pre Islamic Period of ignorance.","reference":"Sahih al-Bukhari 7116, Book 92, Hadith 63","grade":"","question #":"question #3","question":"What is the significance of the tribe of Daus in the context of Islamic prophecies about the end times?","id":"bukhari-92-234"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till a man from Qahtan appears, driving the \npeople with his stick.\"","reference":"Sahih al-Bukhari 7117, Book 92, Hadith 64","grade":"","question #":"question #3","question":"What role does leadership play in the events leading up to the establishment of the Hour according to Islamic tradition?","id":"bukhari-92-235"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established till a fire will come out of the land of Hijaz, \nand it will throw light on the necks of the camels at Busra.\"","reference":"Sahih al-Bukhari 7118, Book 92, Hadith 65","grade":"","question #":"question #3","question":"What is the significance of the fire that will illuminate the necks of camels at Busra in Islamic prophecy?","id":"bukhari-92-236"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"Soon the river \"Euphrates\" will disclose the treasure (the mountain) of gold, so \nwhoever will be present at that time should not take anything of it.\" Al-A'raj narrated from Abii \nHuraira that the Prophet (ﷺ) said the same but he said, \"It (Euphrates) will uncover a mountain of gold \n(under it).","reference":"Sahih al-Bukhari 7119, Book 92, Hadith 66","grade":"","question #":"question #3","question":"What are the potential consequences of seeking worldly treasures according to Islamic teachings?","id":"bukhari-92-237"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) saying, \"Give in charity because there will come a time on the people when a \nperson will go out with his alms from place to place but will not find anybody to accept it.\"","reference":"Sahih al-Bukhari 7120, Book 92, Hadith 67","grade":"","question #":"question #3","question":"How does the concept of charity reflect on the social and economic conditions of a society?","id":"bukhari-92-238"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"The Hour will not be established (1) till two big groups fight each other \nwhereupon there will be a great number of casualties on both sides and they will be following one and \nthe same religious doctrine, (2) till about thirty Dajjals (liars) appear, and each one of them will claim \nthat he is Allah's Messenger (ﷺ), (3) till the religious knowledge is taken away (by the death of Religious \nscholars) (4) earthquakes will increase in number (5) time will pass quickly, (6) afflictions will \nappear, (7) Al-Harj, (i.e., killing) will increase, (8) till wealth will be in abundance ---- so abundant \nthat a wealthy person will worry lest nobody should accept his Zakat, and whenever he will present it \nto someone, that person (to whom it will be offered) will say, 'I am not in need of it, (9) till the people \ncompete with one another in constructing high buildings, (10) till a man when passing by a grave of \nsomeone will say, 'Would that I were in his place (11) and till the sun rises from the West. So when \nthe sun will rise and the people will see it (rising from the West) they will all believe (embrace Islam) \nbut that will be the time when: (As Allah said,) 'No good will it do to a soul to believe then, if it \nbelieved not before, nor earned good (by deeds of righteousness) through its Faith.' (6.158) And the \nHour will be established while two men spreading a garment in front of them but they will not be able \nto sell it, nor fold it up; and the Hour will be established when a man has milked his she-camel and has \ntaken away the milk but he will not be able to drink it; and the Hour will be established before a man \nrepairing a tank (for his livestock) is able to water (his animals) in it; and the Hour will be established \nwhen a person has raised a morsel (of food) to his mouth but will not be able to eat it.\"","reference":"Sahih al-Bukhari 7121, Book 92, Hadith 68","grade":"","question #":"question #3","question":"What is the significance of the sun rising from the West in Islamic eschatology?","id":"bukhari-92-239"},{"hadith-eng":"Nobody asked the Prophet (ﷺ) as many questions as I asked regarding Ad-Dajjal. The Prophet (ﷺ) said to me, \n\"What worries you about him?\" I said, \"Because the people say that he will have a mountain of bread \nand a river of water with him (i.e. he will have abundance of food and water)\" The Prophet (ﷺ) said, \"Nay, \nhe is too mean to be allowed such a thing by Allah\"' (but it is only to test mankind whether they \nbelieve in Allah or in Ad-Dajjal.)","reference":"Sahih al-Bukhari 7122, Book 92, Hadith 69","grade":"","question #":"question #3","question":"What is the significance of the test of faith in relation to Ad-Dajjal's appearance?","id":"bukhari-92-240"},{"hadith-eng":"The Prophet (ﷺ) said (about Ad-Dajjal) that he is one eyed, his right eye is as if a protruding out grape.\"","reference":"Sahih al-Bukhari 7123, Book 92, Hadith 70","grade":"","question #":"question #3","question":"What is the importance of recognizing the signs of Ad-Dajjal in Islamic belief?","id":"bukhari-92-241"},{"hadith-eng":"The Prophet (ﷺ) said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will \nshake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"","reference":"Sahih al-Bukhari 7124, Book 92, Hadith 71","grade":"","question #":"question #3","question":"What is the reaction of disbelievers and hypocrites when Ad-Dajjal approaches Medina?","id":"bukhari-92-242"},{"hadith-eng":"The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate (guarding them).","reference":"Sahih al-Bukhari 7125, Book 92, Hadith 72","grade":"","question #":"question #3","question":"What role do angels play in safeguarding Medina during the emergence of Al-Masih Ad-Dajjal?","id":"bukhari-92-243"},{"hadith-eng":"[as above]","reference":"Sahih al-Bukhari 7126, Book 92, Hadith 73","grade":"","question #":"question #3","question":"What is the relationship between prayer and seeking forgiveness in Islam?","id":"bukhari-92-244"},{"hadith-eng":"Allah's Messenger (ﷺ) stood up amongst the people and then praised and glorified Allah as He deserved and \nthen he mentioned Ad-Dajjal, saying, \"I warn you of him, and there was no prophet but warned his \nfollowers of him; but I will tell you something about him which no prophet has told his followers: Ad- \nDajjal is one-eyed whereas Allah is not.\"","reference":"Sahih al-Bukhari 7127, Book 92, Hadith 74","grade":"","question #":"question #3","question":"What unique information did the Prophet Muhammad (ﷺ) provide about Ad-Dajjal that was not mentioned by previous prophets?","id":"bukhari-92-245"},{"hadith-eng":"Allah's Messenger (ﷺ) said. \"While I was sleeping, I saw myself (in a dream) performing Tawaf around the \nKa`ba. Behold, I saw a reddish-white man with lank hair, and water was dropping from his head. I \nasked, \"Who is this?' They replied, 'The son of Mary.' Then I turned my face to see another man with \na huge body, red complexion and curly hair and blind in one eye. His eye looked like a protruding out \ngrape. They said (to me), He is Ad-Dajjal.\" The Prophet (ﷺ) added, \"The man he resembled most is Ibn \nQatan, a man from the tribe of Khuza`a. \"","reference":"Sahih al-Bukhari 7128, Book 92, Hadith 75","grade":"","question #":"question #3","question":"What significance do dreams hold in Islamic tradition, especially those experienced by the Prophet?","id":"bukhari-92-246"},{"hadith-eng":"I heard Allah's Messenger (ﷺ) in his prayer, seeking refuge with Allah from the afflictions of Ad-Dajjal.","reference":"Sahih al-Bukhari 7129, Book 92, Hadith 76","grade":"","question #":"question #3","question":"How can seeking refuge in prayer help protect against spiritual and worldly challenges?","id":"bukhari-92-247"},{"hadith-eng":"The Prophet (ﷺ) said about Ad-Dajjal that he would have water and fire with him: (what would seem to \nbe) fire, would be cold water and (what would seem to be) water, would be fire.","reference":"Sahih al-Bukhari 7130, Book 92, Hadith 77","grade":"","question #":"question #3","question":"What is the significance of understanding the true nature of Ad-Dajjal's water and fire?","id":"bukhari-92-248"},{"hadith-eng":"The Prophet (ﷺ) said, \"No prophet was sent but that he warned his followers against the one-eyed liar \n(Ad-Dajjal). Beware! He is blind in one eye, and your Lord is not so, and there will be written \nbetween his (Ad-Dajjal's) eyes (the word) Kafir (i.e., disbeliever).\" (This Hadith is also quoted by Abu \nHuraira and Ibn `Abbas).","reference":"Sahih al-Bukhari 7131, Book 92, Hadith 78","grade":"","question #":"question #3","question":"How can believers identify Ad-Dajjal according to the signs mentioned in the teachings?","id":"bukhari-92-249"},{"hadith-eng":"One day Allah's Messenger (ﷺ) narrated to us a long narration about Ad-Dajjal and among the things he \nnarrated to us, was: \"Ad-Dajjal will come, and he will be forbidden to enter the mountain passes of \nMedina. He will encamp in one of the salt areas neighboring Medina and there will appear to him a \nman who will be the best or one of the best of the people. He will say 'I testify that you are Ad-Dajjal \nwhose story Allah's Messenger (ﷺ) has told us.' Ad-Dajjal will say (to his audience), 'Look, if I kill this man \nand then give him life, will you have any doubt about my claim?' They will reply, 'No,' Then Ad- \nDajjal will kill that man and then will make him alive. The man will say, 'By Allah, now I recognize \nyou more than ever!' Ad-Dajjal will then try to kill him (again) but he will not be given the power to \ndo so.\"","reference":"Sahih al-Bukhari 7132, Book 92, Hadith 79","grade":"","question #":"question #3","question":"What is the significance of the man who confronts Ad-Dajjal and his testimony?","id":"bukhari-92-250"},{"hadith-eng":"Allah's Messenger (ﷺ) said, \"There are angels at the mountain passes of Medina (so that) neither plague nor \nAd-Dajjal can enter it.'","reference":"Sahih al-Bukhari 7133, Book 92, Hadith 80","grade":"","question #":"question #3","question":"How is the city of Medina uniquely protected in Islamic eschatology?","id":"bukhari-92-251"},{"hadith-eng":"The Prophet (ﷺ) said, \"Ad-Dajjal will come to Medina and find the angels guarding it. So Allah willing, \nneither Ad-Dajjal, nor plague will be able to come near it.\"","reference":"Sahih al-Bukhari 7134, Book 92, Hadith 81","grade":"","question #":"question #3","question":"How is the city of Medina protected from plagues according to Islamic tradition?","id":"bukhari-92-252"},{"hadith-eng":"That one day Allah's Messenger (ﷺ) entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet (ﷺ) made a circle with his index \nfinger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet (ﷺ) said, \"Yes, if the (number) of evil (persons) \nincreased.\"","reference":"Sahih al-Bukhari 7135, Book 92, Hadith 82","grade":"","question #":"question #3","question":"What does the opening of a hole in the dam of Gog and Magog symbolize in Islamic eschatology?","id":"bukhari-92-253"},{"hadith-eng":"The Prophet (ﷺ) said, \"A hole has been opened in the dam of Gog and Magog.\" Wuhaib (the sub-narrator) \nmade the number 90 (with his index finger and thumb).","reference":"Sahih al-Bukhari 7136, Book 92, Hadith 83","grade":"","question #":"question #3","question":"What role do Gog and Magog play in the events leading up to the end times according to Islamic teachings?","id":"bukhari-92-254"}]