[{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"","reference":"Jami` at-Tirmidhi 1423, Book 17, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who are the individuals exempt from accountability according to Islamic teachings?","id":"tirmidhi-17-1"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"","reference":"Jami` at-Tirmidhi 1424, Book 17, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of showing leniency in legal penalties within Islamic jurisprudence?","id":"tirmidhi-17-2"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"","reference":"Jami` at-Tirmidhi 1425, Book 17, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the benefits of relieving a fellow Muslim from worldly burdens?","id":"tirmidhi-17-3"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1426, Book 17, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of brotherhood among Muslims in Islam?","id":"tirmidhi-17-4"},{"hadith-eng":"That the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.","reference":"Jami` at-Tirmidhi 1427, Book 17, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of verifying information before taking action in Islamic teachings?","id":"tirmidhi-17-5"},{"hadith-eng":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","reference":"Jami` at-Tirmidhi 1428, Book 17, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of confession in Islamic jurisprudence?","id":"tirmidhi-17-6"},{"hadith-eng":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","reference":"Jami` at-Tirmidhi 1429, Book 17, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of self-confession in Islamic jurisprudence?","id":"tirmidhi-17-7"},{"hadith-eng":"\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"","reference":"Jami` at-Tirmidhi 1430, Book 17, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of equality in the application of legal penalties in Islam?","id":"tirmidhi-17-8"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"","reference":"Jami` at-Tirmidhi 1431, Book 17, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of following the practices of the Prophet Muhammad (ﷺ) and his companions in Islamic jurisprudence?","id":"tirmidhi-17-9"},{"hadith-eng":"\"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"","reference":"Jami` at-Tirmidhi 1432, Book 17, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Ayah of stoning in Islamic jurisprudence?","id":"tirmidhi-17-10"},{"hadith-eng":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","reference":"Jami` at-Tirmidhi 1433, Book 17, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of judging disputes according to the Book of Allah in Islamic jurisprudence?","id":"tirmidhi-17-11"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"","reference":"Jami` at-Tirmidhi 1434, Book 17, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the prescribed punishments for adultery according to Islamic teachings?","id":"tirmidhi-17-12"},{"hadith-eng":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","reference":"Jami` at-Tirmidhi 1435, Book 17, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of repentance in Islam, and how is it viewed in terms of its impact on the individual and the community?","id":"tirmidhi-17-13"},{"hadith-eng":"That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.","reference":"Jami` at-Tirmidhi 1436, Book 17, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the punishment of stoning in Islamic jurisprudence?","id":"tirmidhi-17-14"},{"hadith-eng":"That the Prophet (ﷺ) stoned a Jew and a Jewess.","reference":"Jami` at-Tirmidhi 1437, Book 17, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the punishment of stoning in Islamic jurisprudence?","id":"tirmidhi-17-15"},{"hadith-eng":"That the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.","reference":"Jami` at-Tirmidhi 1438, Book 17, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What were the actions taken by the Prophet Muhammad (ﷺ) and his companions in response to certain offenses?","id":"tirmidhi-17-16"},{"hadith-eng":"\"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"","reference":"Jami` at-Tirmidhi 1439, Book 17, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the key pledges that the Prophet (ﷺ) asked his companions to make regarding their faith and actions?","id":"tirmidhi-17-17"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"","reference":"Jami` at-Tirmidhi 1440, Book 17, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for a slave girl who commits illegal sexual intercourse according to Islamic teachings?","id":"tirmidhi-17-18"},{"hadith-eng":"\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"","reference":"Jami` at-Tirmidhi 1441, Book 17, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of establishing penalties for slaves in Islamic law?","id":"tirmidhi-17-19"},{"hadith-eng":"That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"","reference":"Jami` at-Tirmidhi 1442, Book 17, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the prescribed penalty for consuming wine in Islamic law?","id":"tirmidhi-17-20"},{"hadith-eng":"That a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.","reference":"Jami` at-Tirmidhi 1443, Book 17, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the initial punishment for drinking wine during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-17-21"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"","reference":"Jami` at-Tirmidhi 1444, Book 17, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for someone who drinks wine according to Islamic teachings?","id":"tirmidhi-17-22"},{"hadith-eng":"That the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.","reference":"Jami` at-Tirmidhi 1445, Book 17, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for theft in Islamic law according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-17-23"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"","reference":"Jami` at-Tirmidhi 1446, Book 17, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for theft in Islamic law?","id":"tirmidhi-17-24"},{"hadith-eng":"\"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"","reference":"Jami` at-Tirmidhi 1447, Book 17, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of hanging the hand around the neck of a thief in Islamic tradition?","id":"tirmidhi-17-25"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"","reference":"Jami` at-Tirmidhi 1448, Book 17, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the exceptions to the punishment of cutting the hand in Islamic law?","id":"tirmidhi-17-26"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"","reference":"Jami` at-Tirmidhi 1449, Book 17, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on theft involving fruits or palm marrow in Islamic law?","id":"tirmidhi-17-27"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"","reference":"Jami` at-Tirmidhi 1450, Book 17, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on cutting hands during battles in Islamic jurisprudence?","id":"tirmidhi-17-28"},{"hadith-eng":"\"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"","reference":"Jami` at-Tirmidhi 1451, Book 17, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on having relations with a slave girl according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-17-29"},{"hadith-eng":"(Another chain) from An-Nu'man bin Bashir with similar.","reference":"Jami` at-Tirmidhi 1452, Book 17, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narration for a hadith?","id":"tirmidhi-17-30"},{"hadith-eng":"That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.","reference":"Jami` at-Tirmidhi 1453, Book 17, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on punishing individuals who are forced into committing illegal acts?","id":"tirmidhi-17-31"},{"hadith-eng":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","reference":"Jami` at-Tirmidhi 1454, Book 17, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of repentance in Islam, and how is it demonstrated in this scenario?","id":"tirmidhi-17-32"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"","reference":"Jami` at-Tirmidhi 1455, Book 17, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for someone who engages in inappropriate relations with an animal in Islamic teachings?","id":"tirmidhi-17-33"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"","reference":"Jami` at-Tirmidhi 1456, Book 17, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #1","question":"What actions are associated with the people of Lut according to Islamic teachings?","id":"tirmidhi-17-34"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"","reference":"Jami` at-Tirmidhi 1457, Book 17, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #1","question":"What specific behavior of the people of Lut is considered a significant concern for the Muslim community?","id":"tirmidhi-17-35"},{"hadith-eng":"That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"","reference":"Jami` at-Tirmidhi 1458, Book 17, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on apostasy according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-17-36"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"","reference":"Jami` at-Tirmidhi 1459, Book 17, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the stance of Islam on carrying weapons against fellow Muslims?","id":"tirmidhi-17-37"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"","reference":"Jami` at-Tirmidhi 1460, Book 17, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for a practitioner of magic in Islamic teachings?","id":"tirmidhi-17-38"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"","reference":"Jami` at-Tirmidhi 1461, Book 17, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the prescribed punishment for stealing from the spoils of war in Islam?","id":"tirmidhi-17-39"},{"hadith-eng":"That the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"","reference":"Jami` at-Tirmidhi 1462, Book 17, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of using derogatory terms towards others in Islam?","id":"tirmidhi-17-40"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"","reference":"Jami` at-Tirmidhi 1463, Book 17, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the maximum number of lashes allowed for disciplinary actions according to Islamic teachings?","id":"tirmidhi-17-41"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"","reference":"Jami` at-Tirmidhi 1423, Book 17, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of mental capacity in determining accountability in Islam?","id":"tirmidhi-17-42"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"","reference":"Jami` at-Tirmidhi 1424, Book 17, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #2","question":"How should an Imam approach the decision-making process when it comes to legal punishments?","id":"tirmidhi-17-43"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"","reference":"Jami` at-Tirmidhi 1425, Book 17, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does covering the faults of others impact one's own life in this world and the Hereafter?","id":"tirmidhi-17-44"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1426, Book 17, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of oppressing or harming fellow Muslims?","id":"tirmidhi-17-45"},{"hadith-eng":"That the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.","reference":"Jami` at-Tirmidhi 1427, Book 17, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address the issue of adultery and its consequences?","id":"tirmidhi-17-46"},{"hadith-eng":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","reference":"Jami` at-Tirmidhi 1428, Book 17, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic law address the punishment for adultery?","id":"tirmidhi-17-47"},{"hadith-eng":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","reference":"Jami` at-Tirmidhi 1429, Book 17, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address the issue of adultery and its consequences?","id":"tirmidhi-17-48"},{"hadith-eng":"\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"","reference":"Jami` at-Tirmidhi 1430, Book 17, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does favoritism or bias in justice lead to societal destruction according to Islamic teachings?","id":"tirmidhi-17-49"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"","reference":"Jami` at-Tirmidhi 1431, Book 17, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might some Islamic rulings not be explicitly mentioned in the Quran?","id":"tirmidhi-17-50"},{"hadith-eng":"\"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"","reference":"Jami` at-Tirmidhi 1432, Book 17, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the practice of stoning as a punishment for adultery originate in Islamic tradition?","id":"tirmidhi-17-51"},{"hadith-eng":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","reference":"Jami` at-Tirmidhi 1433, Book 17, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does eloquence impact the presentation of a case in front of a judge in Islamic law?","id":"tirmidhi-17-52"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"","reference":"Jami` at-Tirmidhi 1434, Book 17, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law differentiate between married and unmarried individuals in cases of adultery?","id":"tirmidhi-17-53"},{"hadith-eng":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","reference":"Jami` at-Tirmidhi 1435, Book 17, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam address the issue of sin and forgiveness, particularly in cases of major sins like adultery?","id":"tirmidhi-17-54"},{"hadith-eng":"That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.","reference":"Jami` at-Tirmidhi 1436, Book 17, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address cases involving adultery?","id":"tirmidhi-17-55"},{"hadith-eng":"That the Prophet (ﷺ) stoned a Jew and a Jewess.","reference":"Jami` at-Tirmidhi 1437, Book 17, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address cases involving individuals of different faiths?","id":"tirmidhi-17-56"},{"hadith-eng":"That the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.","reference":"Jami` at-Tirmidhi 1438, Book 17, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the early Islamic leaders enforce justice and maintain social order?","id":"tirmidhi-17-57"},{"hadith-eng":"\"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"","reference":"Jami` at-Tirmidhi 1439, Book 17, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of not associating partners with Allah in Islamic teachings?","id":"tirmidhi-17-58"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"","reference":"Jami` at-Tirmidhi 1440, Book 17, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"How many times should a slave girl be punished for committing illegal sexual intercourse before considering selling her?","id":"tirmidhi-17-59"},{"hadith-eng":"\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"","reference":"Jami` at-Tirmidhi 1441, Book 17, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one approach the implementation of penalties when there are health concerns involved?","id":"tirmidhi-17-60"},{"hadith-eng":"That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"","reference":"Jami` at-Tirmidhi 1442, Book 17, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #2","question":"How was the penalty for certain offenses implemented during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-17-61"},{"hadith-eng":"That a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.","reference":"Jami` at-Tirmidhi 1443, Book 17, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the punishment for drinking wine change during the caliphate of Umar?","id":"tirmidhi-17-62"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"","reference":"Jami` at-Tirmidhi 1444, Book 17, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic law address repeated offenses of drinking wine?","id":"tirmidhi-17-63"},{"hadith-eng":"That the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.","reference":"Jami` at-Tirmidhi 1445, Book 17, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of the value 'a fourth of a Dinar' in determining the punishment for theft?","id":"tirmidhi-17-64"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"","reference":"Jami` at-Tirmidhi 1446, Book 17, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the value of a stolen item affect the implementation of punishment in Islam?","id":"tirmidhi-17-65"},{"hadith-eng":"\"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"","reference":"Jami` at-Tirmidhi 1447, Book 17, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law address the punishment for theft?","id":"tirmidhi-17-66"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"","reference":"Jami` at-Tirmidhi 1448, Book 17, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law differentiate between different types of theft or misappropriation?","id":"tirmidhi-17-67"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"","reference":"Jami` at-Tirmidhi 1449, Book 17, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic jurisprudence differentiate between types of theft?","id":"tirmidhi-17-68"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"","reference":"Jami` at-Tirmidhi 1450, Book 17, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address the punishment for theft in the context of warfare?","id":"tirmidhi-17-69"},{"hadith-eng":"\"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"","reference":"Jami` at-Tirmidhi 1451, Book 17, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the consequences in Islamic law for a man who has relations with a slave girl without his wife's permission?","id":"tirmidhi-17-70"},{"hadith-eng":"(Another chain) from An-Nu'man bin Bashir with similar.","reference":"Jami` at-Tirmidhi 1452, Book 17, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the consistency of a hadith's message across different narrators affect its authenticity?","id":"tirmidhi-17-71"},{"hadith-eng":"That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.","reference":"Jami` at-Tirmidhi 1453, Book 17, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law differentiate between the perpetrator and the victim in cases of coercion?","id":"tirmidhi-17-72"},{"hadith-eng":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","reference":"Jami` at-Tirmidhi 1454, Book 17, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic law address false accusations and the importance of truth in legal matters?","id":"tirmidhi-17-73"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"","reference":"Jami` at-Tirmidhi 1455, Book 17, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might the consumption or use of an animal involved in inappropriate relations be discouraged in Islam?","id":"tirmidhi-17-74"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"","reference":"Jami` at-Tirmidhi 1456, Book 17, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the prescribed punishment in Islam for those who engage in the actions of the people of Lut?","id":"tirmidhi-17-75"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"","reference":"Jami` at-Tirmidhi 1457, Book 17, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why might certain behaviors be feared for the well-being of the Muslim Ummah?","id":"tirmidhi-17-76"},{"hadith-eng":"That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"","reference":"Jami` at-Tirmidhi 1458, Book 17, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Ibn 'Abbas interpret the punishment for apostasy in Islam?","id":"tirmidhi-17-77"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"","reference":"Jami` at-Tirmidhi 1459, Book 17, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view acts of aggression within the Muslim community?","id":"tirmidhi-17-78"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"","reference":"Jami` at-Tirmidhi 1460, Book 17, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law view the act of practicing magic or sorcery?","id":"tirmidhi-17-79"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"","reference":"Jami` at-Tirmidhi 1461, Book 17, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #2","question":"How should items of religious significance, like a Mushaf, be treated if found among stolen goods?","id":"tirmidhi-17-80"},{"hadith-eng":"That the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"","reference":"Jami` at-Tirmidhi 1462, Book 17, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam address the issue of insulting others based on their identity or characteristics?","id":"tirmidhi-17-81"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"","reference":"Jami` at-Tirmidhi 1463, Book 17, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"Under what circumstances can more than ten lashes be administered in Islamic law?","id":"tirmidhi-17-82"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"","reference":"Jami` at-Tirmidhi 1423, Book 17, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islam view the actions of a person who is asleep in terms of accountability?","id":"tirmidhi-17-83"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"","reference":"Jami` at-Tirmidhi 1424, Book 17, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #3","question":"Why is it considered better to err on the side of forgiveness rather than punishment in Islamic law?","id":"tirmidhi-17-84"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"","reference":"Jami` at-Tirmidhi 1425, Book 17, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of helping others in Islam according to this teaching?","id":"tirmidhi-17-85"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1426, Book 17, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the rewards for helping and being concerned for the needs of fellow Muslims?","id":"tirmidhi-17-86"},{"hadith-eng":"That the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.","reference":"Jami` at-Tirmidhi 1427, Book 17, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of confession and testimony in Islamic legal proceedings?","id":"tirmidhi-17-87"},{"hadith-eng":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","reference":"Jami` at-Tirmidhi 1428, Book 17, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the role of the community in carrying out Islamic legal punishments?","id":"tirmidhi-17-88"},{"hadith-eng":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","reference":"Jami` at-Tirmidhi 1429, Book 17, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions required for the implementation of the punishment for adultery in Islam?","id":"tirmidhi-17-89"},{"hadith-eng":"\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"","reference":"Jami` at-Tirmidhi 1430, Book 17, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lesson can be learned from the Prophet Muhammad's stance on justice, even towards his own family?","id":"tirmidhi-17-90"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"","reference":"Jami` at-Tirmidhi 1431, Book 17, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What concerns might arise from not including certain practices in the written text of the Quran?","id":"tirmidhi-17-91"},{"hadith-eng":"\"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"","reference":"Jami` at-Tirmidhi 1432, Book 17, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"What concerns did 'Umar bin Al-Khattab express regarding the future understanding of the Ayah of stoning?","id":"tirmidhi-17-92"},{"hadith-eng":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","reference":"Jami` at-Tirmidhi 1433, Book 17, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the prescribed punishments for adultery according to Islamic teachings?","id":"tirmidhi-17-93"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"","reference":"Jami` at-Tirmidhi 1434, Book 17, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of stoning as a punishment in Islamic jurisprudence?","id":"tirmidhi-17-94"},{"hadith-eng":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","reference":"Jami` at-Tirmidhi 1435, Book 17, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does the guardian play in the process of repentance and punishment in Islamic jurisprudence?","id":"tirmidhi-17-95"},{"hadith-eng":"That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.","reference":"Jami` at-Tirmidhi 1436, Book 17, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do witnesses and evidence play in implementing legal punishments in Islam?","id":"tirmidhi-17-96"},{"hadith-eng":"That the Prophet (ﷺ) stoned a Jew and a Jewess.","reference":"Jami` at-Tirmidhi 1437, Book 17, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which stoning is prescribed in Islamic law?","id":"tirmidhi-17-97"},{"hadith-eng":"That the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.","reference":"Jami` at-Tirmidhi 1438, Book 17, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of lashing and banishment in Islamic legal practices?","id":"tirmidhi-17-98"},{"hadith-eng":"\"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"","reference":"Jami` at-Tirmidhi 1439, Book 17, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic teaching address the consequences of committing sins such as theft and adultery?","id":"tirmidhi-17-99"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"","reference":"Jami` at-Tirmidhi 1440, Book 17, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of following the Book of Allah in administering punishment for illegal sexual acts?","id":"tirmidhi-17-100"},{"hadith-eng":"\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"","reference":"Jami` at-Tirmidhi 1441, Book 17, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration teach about the Prophet Muhammad's (ﷺ) guidance in handling sensitive situations?","id":"tirmidhi-17-101"},{"hadith-eng":"That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"","reference":"Jami` at-Tirmidhi 1442, Book 17, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role do narrators play in conveying the details of penalties in Islamic tradition?","id":"tirmidhi-17-102"},{"hadith-eng":"That a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.","reference":"Jami` at-Tirmidhi 1443, Book 17, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did consultation play in determining the punishment for drinking wine during Umar's caliphate?","id":"tirmidhi-17-103"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"","reference":"Jami` at-Tirmidhi 1444, Book 17, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences for a person who drinks wine multiple times under Islamic jurisprudence?","id":"tirmidhi-17-104"},{"hadith-eng":"That the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.","reference":"Jami` at-Tirmidhi 1445, Book 17, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic jurisprudence determine the threshold for implementing the punishment for theft?","id":"tirmidhi-17-105"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"","reference":"Jami` at-Tirmidhi 1446, Book 17, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the item being a shield in the context of this ruling?","id":"tirmidhi-17-106"},{"hadith-eng":"\"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"","reference":"Jami` at-Tirmidhi 1447, Book 17, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role does the Sunnah play in determining the punishment for crimes in Islam?","id":"tirmidhi-17-107"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"","reference":"Jami` at-Tirmidhi 1448, Book 17, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of distinguishing between a traitor, an embezzler, and a plunderer in Islamic jurisprudence?","id":"tirmidhi-17-108"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"","reference":"Jami` at-Tirmidhi 1449, Book 17, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which the punishment of cutting the hand is applied in Islam?","id":"tirmidhi-17-109"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"","reference":"Jami` at-Tirmidhi 1450, Book 17, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the exceptions to the punishment of hand cutting in Islamic law?","id":"tirmidhi-17-110"},{"hadith-eng":"\"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"","reference":"Jami` at-Tirmidhi 1451, Book 17, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the judgement of An-Nu'man bin Bashir reflect the teachings of the Prophet Muhammad (ﷺ) regarding unlawful relations?","id":"tirmidhi-17-111"},{"hadith-eng":"(Another chain) from An-Nu'man bin Bashir with similar.","reference":"Jami` at-Tirmidhi 1452, Book 17, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-17-112"},{"hadith-eng":"That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.","reference":"Jami` at-Tirmidhi 1453, Book 17, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences for someone who forces another person into illegal sexual relations in Islam?","id":"tirmidhi-17-113"},{"hadith-eng":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","reference":"Jami` at-Tirmidhi 1454, Book 17, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences of committing a sin and the process of seeking forgiveness in Islamic teachings?","id":"tirmidhi-17-114"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"","reference":"Jami` at-Tirmidhi 1455, Book 17, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islamic law address the treatment of animals involved in acts of immorality?","id":"tirmidhi-17-115"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"","reference":"Jami` at-Tirmidhi 1456, Book 17, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islamic law address the issue of homosexuality?","id":"tirmidhi-17-116"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"","reference":"Jami` at-Tirmidhi 1457, Book 17, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #3","question":"How can the lessons from the story of the people of Lut be applied to contemporary society?","id":"tirmidhi-17-117"},{"hadith-eng":"That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"","reference":"Jami` at-Tirmidhi 1458, Book 17, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was 'Ali's action towards those who apostasized, and how did it differ from Ibn 'Abbas's understanding?","id":"tirmidhi-17-118"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"","reference":"Jami` at-Tirmidhi 1459, Book 17, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of being considered 'not from us' in the context of Islamic teachings?","id":"tirmidhi-17-119"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"","reference":"Jami` at-Tirmidhi 1460, Book 17, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences of engaging in sorcery according to Islamic jurisprudence?","id":"tirmidhi-17-120"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"","reference":"Jami` at-Tirmidhi 1461, Book 17, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions are taken when someone is caught stealing in the path of Allah according to Islamic teachings?","id":"tirmidhi-17-121"},{"hadith-eng":"That the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"","reference":"Jami` at-Tirmidhi 1462, Book 17, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the prescribed punishment for someone who insults another person by calling them a Jew or effeminate?","id":"tirmidhi-17-122"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"","reference":"Jami` at-Tirmidhi 1463, Book 17, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the legal punishments prescribed by Allah that may require more than ten lashes?","id":"tirmidhi-17-123"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"","reference":"Jami` at-Tirmidhi 1423, Book 17, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #4","question":"At what age does a boy become accountable for his actions in Islamic teachings?","id":"tirmidhi-17-124"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"","reference":"Jami` at-Tirmidhi 1424, Book 17, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of providing a way out for individuals facing legal penalties in Islam?","id":"tirmidhi-17-125"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"","reference":"Jami` at-Tirmidhi 1425, Book 17, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Allah's assistance relate to a person's willingness to help their fellow Muslims?","id":"tirmidhi-17-126"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1426, Book 17, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does relieving a Muslim of a burden relate to the Day of Judgement?","id":"tirmidhi-17-127"},{"hadith-eng":"That the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.","reference":"Jami` at-Tirmidhi 1427, Book 17, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of justice manifest in the application of Islamic punishments?","id":"tirmidhi-17-128"},{"hadith-eng":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","reference":"Jami` at-Tirmidhi 1428, Book 17, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of repentance relate to the enforcement of legal penalties in Islam?","id":"tirmidhi-17-129"},{"hadith-eng":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","reference":"Jami` at-Tirmidhi 1429, Book 17, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of mental health assessment in the application of Islamic legal punishments?","id":"tirmidhi-17-130"},{"hadith-eng":"\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"","reference":"Jami` at-Tirmidhi 1430, Book 17, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to uphold justice without discrimination between the noble and the weak?","id":"tirmidhi-17-131"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"","reference":"Jami` at-Tirmidhi 1431, Book 17, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the fear of future disbelief influence the preservation of Islamic teachings?","id":"tirmidhi-17-132"},{"hadith-eng":"\"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"","reference":"Jami` at-Tirmidhi 1432, Book 17, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the conditions under which stoning is prescribed as a punishment for adultery?","id":"tirmidhi-17-133"},{"hadith-eng":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","reference":"Jami` at-Tirmidhi 1433, Book 17, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of confession in the implementation of Islamic legal punishments?","id":"tirmidhi-17-134"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"","reference":"Jami` at-Tirmidhi 1434, Book 17, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does banishment play in the punishment for adultery in Islamic law?","id":"tirmidhi-17-135"},{"hadith-eng":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","reference":"Jami` at-Tirmidhi 1435, Book 17, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of sacrifice for the sake of Allah manifest in Islamic teachings?","id":"tirmidhi-17-136"},{"hadith-eng":"That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.","reference":"Jami` at-Tirmidhi 1436, Book 17, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are legal rulings applied to non-Muslims under Islamic governance?","id":"tirmidhi-17-137"},{"hadith-eng":"That the Prophet (ﷺ) stoned a Jew and a Jewess.","reference":"Jami` at-Tirmidhi 1437, Book 17, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the application of Islamic punishments reflect on the justice system in Islam?","id":"tirmidhi-17-138"},{"hadith-eng":"That the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.","reference":"Jami` at-Tirmidhi 1438, Book 17, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the practices of the Prophet Muhammad (ﷺ) influence the actions of Abu Bakr and 'Umar?","id":"tirmidhi-17-139"},{"hadith-eng":"\"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"","reference":"Jami` at-Tirmidhi 1439, Book 17, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the hadith suggest about the concept of atonement and divine forgiveness in Islam?","id":"tirmidhi-17-140"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"","reference":"Jami` at-Tirmidhi 1440, Book 17, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the hadith suggest as a consequence if a slave girl repeatedly commits illegal sexual intercourse?","id":"tirmidhi-17-141"},{"hadith-eng":"\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"","reference":"Jami` at-Tirmidhi 1441, Book 17, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does consultation play in decision-making according to Islamic teachings?","id":"tirmidhi-17-142"},{"hadith-eng":"That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"","reference":"Jami` at-Tirmidhi 1442, Book 17, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the use of specific objects, like shoes, relate to the implementation of penalties in Islamic jurisprudence?","id":"tirmidhi-17-143"},{"hadith-eng":"That a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.","reference":"Jami` at-Tirmidhi 1443, Book 17, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who suggested the increase in the penalty for drinking wine to eighty lashes?","id":"tirmidhi-17-144"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"","reference":"Jami` at-Tirmidhi 1444, Book 17, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of the fourth offense in the context of drinking wine in Islam?","id":"tirmidhi-17-145"},{"hadith-eng":"That the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.","reference":"Jami` at-Tirmidhi 1445, Book 17, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the value of stolen property play in the application of Islamic legal punishments?","id":"tirmidhi-17-146"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"","reference":"Jami` at-Tirmidhi 1446, Book 17, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic jurisprudence determine the threshold for theft punishments?","id":"tirmidhi-17-147"},{"hadith-eng":"\"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"","reference":"Jami` at-Tirmidhi 1447, Book 17, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of public punishment in Islamic jurisprudence?","id":"tirmidhi-17-148"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"","reference":"Jami` at-Tirmidhi 1448, Book 17, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of this hadith on the application of hudud punishments?","id":"tirmidhi-17-149"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"","reference":"Jami` at-Tirmidhi 1449, Book 17, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this hadith imply about the value of certain goods in Islamic legal rulings?","id":"tirmidhi-17-150"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"","reference":"Jami` at-Tirmidhi 1450, Book 17, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the context of battle affect the implementation of certain punishments in Islam?","id":"tirmidhi-17-151"},{"hadith-eng":"\"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"","reference":"Jami` at-Tirmidhi 1451, Book 17, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of lashing and stoning as punishments in Islamic jurisprudence?","id":"tirmidhi-17-152"},{"hadith-eng":"That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.","reference":"Jami` at-Tirmidhi 1453, Book 17, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of justice manifest in Islamic rulings regarding forced illegal acts?","id":"tirmidhi-17-153"},{"hadith-eng":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","reference":"Jami` at-Tirmidhi 1454, Book 17, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of justice manifest in the actions of the Prophet (ﷺ) in this situation?","id":"tirmidhi-17-154"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"","reference":"Jami` at-Tirmidhi 1455, Book 17, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of not having a direct statement from the Prophet (ﷺ) regarding the use of an animal involved in such acts?","id":"tirmidhi-17-155"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"","reference":"Jami` at-Tirmidhi 1456, Book 17, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of the hadith regarding the actions of the people of Lut in Islamic jurisprudence?","id":"tirmidhi-17-156"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"","reference":"Jami` at-Tirmidhi 1457, Book 17, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the potential consequences of adopting behaviors similar to those of the people of Lut?","id":"tirmidhi-17-157"},{"hadith-eng":"That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"","reference":"Jami` at-Tirmidhi 1458, Book 17, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"What did the Prophet Muhammad (ﷺ) say about using fire as a form of punishment?","id":"tirmidhi-17-158"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"","reference":"Jami` at-Tirmidhi 1459, Book 17, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions might lead to a person being excluded from the Muslim community according to Islamic teachings?","id":"tirmidhi-17-159"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"","reference":"Jami` at-Tirmidhi 1460, Book 17, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the severity of punishment for sorcery reflect its seriousness in Islam?","id":"tirmidhi-17-160"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"","reference":"Jami` at-Tirmidhi 1461, Book 17, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the role of charity in dealing with items of value found among stolen goods?","id":"tirmidhi-17-161"},{"hadith-eng":"That the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"","reference":"Jami` at-Tirmidhi 1462, Book 17, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the Islamic ruling on having relations with someone who is a Mahram?","id":"tirmidhi-17-162"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"","reference":"Jami` at-Tirmidhi 1463, Book 17, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic law differentiate between disciplinary actions and legal punishments?","id":"tirmidhi-17-163"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"","reference":"Jami` at-Tirmidhi 1423, Book 17, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the Islamic perspective on the accountability of mentally insane individuals?","id":"tirmidhi-17-164"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"","reference":"Jami` at-Tirmidhi 1424, Book 17, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this teaching reflect the broader principles of justice and mercy in Islam?","id":"tirmidhi-17-165"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"","reference":"Jami` at-Tirmidhi 1425, Book 17, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the spiritual rewards for supporting and aiding fellow believers?","id":"tirmidhi-17-166"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1426, Book 17, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of concealing the faults of others in Islam?","id":"tirmidhi-17-167"},{"hadith-eng":"That the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.","reference":"Jami` at-Tirmidhi 1427, Book 17, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does personal accountability play in Islamic jurisprudence?","id":"tirmidhi-17-168"},{"hadith-eng":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","reference":"Jami` at-Tirmidhi 1428, Book 17, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the conditions under which a confession is considered valid in Islamic law?","id":"tirmidhi-17-169"},{"hadith-eng":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","reference":"Jami` at-Tirmidhi 1429, Book 17, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet Muhammad (ﷺ) demonstrate compassion and justice in dealing with sinners?","id":"tirmidhi-17-170"},{"hadith-eng":"\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"","reference":"Jami` at-Tirmidhi 1430, Book 17, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does intercession play in the enforcement of legal penalties in Islam?","id":"tirmidhi-17-171"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"","reference":"Jami` at-Tirmidhi 1431, Book 17, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the consensus of the Prophet's companions play in the implementation of Islamic law?","id":"tirmidhi-17-172"},{"hadith-eng":"\"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"","reference":"Jami` at-Tirmidhi 1432, Book 17, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of evidence, pregnancy, or confession relate to the implementation of stoning in Islamic law?","id":"tirmidhi-17-173"},{"hadith-eng":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","reference":"Jami` at-Tirmidhi 1433, Book 17, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet Muhammad (ﷺ) exemplify justice in resolving disputes?","id":"tirmidhi-17-174"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"","reference":"Jami` at-Tirmidhi 1434, Book 17, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic law address the concept of justice and deterrence in the context of adultery?","id":"tirmidhi-17-175"},{"hadith-eng":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","reference":"Jami` at-Tirmidhi 1435, Book 17, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of performing funeral prayers for someone who has repented, even after committing a major sin?","id":"tirmidhi-17-176"},{"hadith-eng":"That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.","reference":"Jami` at-Tirmidhi 1436, Book 17, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the conditions required for the implementation of the punishment of stoning in Islamic law?","id":"tirmidhi-17-177"},{"hadith-eng":"That the Prophet (ﷺ) stoned a Jew and a Jewess.","reference":"Jami` at-Tirmidhi 1437, Book 17, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do narrations play in understanding the implementation of Islamic legal punishments?","id":"tirmidhi-17-178"},{"hadith-eng":"That the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.","reference":"Jami` at-Tirmidhi 1438, Book 17, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the consistency of legal punishments during the time of the Prophet and his companions?","id":"tirmidhi-17-179"},{"hadith-eng":"\"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"","reference":"Jami` at-Tirmidhi 1439, Book 17, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of divine will play a role in the forgiveness or punishment of sins according to Islamic belief?","id":"tirmidhi-17-180"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"","reference":"Jami` at-Tirmidhi 1440, Book 17, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the hadith imply about the value of a slave girl who repeatedly commits illegal sexual acts?","id":"tirmidhi-17-181"},{"hadith-eng":"\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"","reference":"Jami` at-Tirmidhi 1441, Book 17, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the balance between justice and compassion in Islam?","id":"tirmidhi-17-182"},{"hadith-eng":"That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"","reference":"Jami` at-Tirmidhi 1442, Book 17, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of the number forty in the context of penalties in Islamic teachings?","id":"tirmidhi-17-183"},{"hadith-eng":"That a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.","reference":"Jami` at-Tirmidhi 1443, Book 17, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the approach to punishing drinking wine evolve from the time of the Prophet Muhammad (ﷺ) to the caliphate of Umar?","id":"tirmidhi-17-184"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"","reference":"Jami` at-Tirmidhi 1444, Book 17, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the punishment for drinking wine escalate with repeated offenses in Islamic law?","id":"tirmidhi-17-185"},{"hadith-eng":"That the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.","reference":"Jami` at-Tirmidhi 1445, Book 17, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith reflect the balance between justice and mercy in Islamic law?","id":"tirmidhi-17-186"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"","reference":"Jami` at-Tirmidhi 1446, Book 17, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do monetary values, such as Dirhams, play in Islamic legal rulings?","id":"tirmidhi-17-187"},{"hadith-eng":"\"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"","reference":"Jami` at-Tirmidhi 1447, Book 17, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the practice of cutting off the hand relate to the principles of justice in Islam?","id":"tirmidhi-17-188"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"","reference":"Jami` at-Tirmidhi 1448, Book 17, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith reflect the principles of justice and fairness in Islamic law?","id":"tirmidhi-17-189"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"","reference":"Jami` at-Tirmidhi 1449, Book 17, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the severity of punishment vary with the nature of the stolen item in Islamic teachings?","id":"tirmidhi-17-190"},{"hadith-eng":"\"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"","reference":"Jami` at-Tirmidhi 1451, Book 17, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of making someone lawful or unlawful apply in the context of this hadith?","id":"tirmidhi-17-191"},{"hadith-eng":"That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.","reference":"Jami` at-Tirmidhi 1453, Book 17, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of not assigning a dowry in cases of forced illegal sexual relations according to Islamic teachings?","id":"tirmidhi-17-192"},{"hadith-eng":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","reference":"Jami` at-Tirmidhi 1454, Book 17, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does confession play in the process of repentance and forgiveness in Islam?","id":"tirmidhi-17-193"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"","reference":"Jami` at-Tirmidhi 1455, Book 17, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the opinion of a companion, like Ibn 'Abbas, influence Islamic rulings when there is no direct hadith from the Prophet (ﷺ)?","id":"tirmidhi-17-194"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"","reference":"Jami` at-Tirmidhi 1456, Book 17, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #5","question":"How do Islamic scholars interpret the punishment for the actions of the people of Lut?","id":"tirmidhi-17-195"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"","reference":"Jami` at-Tirmidhi 1457, Book 17, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the fear of certain behaviors reflect the moral and ethical priorities in Islam?","id":"tirmidhi-17-196"},{"hadith-eng":"That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"","reference":"Jami` at-Tirmidhi 1458, Book 17, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration illustrate the importance of adhering to the Prophet's teachings in Islamic jurisprudence?","id":"tirmidhi-17-197"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"","reference":"Jami` at-Tirmidhi 1459, Book 17, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching emphasize the importance of unity and peace among Muslims?","id":"tirmidhi-17-198"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"","reference":"Jami` at-Tirmidhi 1460, Book 17, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #5","question":"What measures are taken in Islamic law to deter individuals from practicing magic?","id":"tirmidhi-17-199"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"","reference":"Jami` at-Tirmidhi 1461, Book 17, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic law address the issue of theft during military campaigns?","id":"tirmidhi-17-200"},{"hadith-eng":"That the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"","reference":"Jami` at-Tirmidhi 1462, Book 17, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic law deal with serious offenses such as incest?","id":"tirmidhi-17-201"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"","reference":"Jami` at-Tirmidhi 1463, Book 17, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of limiting the number of lashes in disciplinary actions in Islam?","id":"tirmidhi-17-202"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1426, Book 17, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does Allah reward those who cover the faults of others on the Day of Judgement?","id":"tirmidhi-17-203"},{"hadith-eng":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","reference":"Jami` at-Tirmidhi 1428, Book 17, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does the Prophet Muhammad's (ﷺ) response reflect the principles of mercy and justice in Islam?","id":"tirmidhi-17-204"},{"hadith-eng":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","reference":"Jami` at-Tirmidhi 1429, Book 17, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the significance of not performing the funeral prayer for someone who has been punished for adultery?","id":"tirmidhi-17-205"},{"hadith-eng":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","reference":"Jami` at-Tirmidhi 1433, Book 17, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the importance of returning unjustly taken property in Islamic law?","id":"tirmidhi-17-206"},{"hadith-eng":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","reference":"Jami` at-Tirmidhi 1435, Book 17, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does the Prophet Muhammad's (ﷺ) response to the woman's repentance illustrate the balance between justice and mercy in Islam?","id":"tirmidhi-17-207"},{"hadith-eng":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","reference":"Jami` at-Tirmidhi 1454, Book 17, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does this incident illustrate the mercy and forgiveness of Allah towards those who sincerely repent?","id":"tirmidhi-17-208"}]