[{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is Khamr, and every intoxicant is unlawful. Whoever drinks Khamr in this world, and dies continuing it, he will not drink it in the Hereafter.He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, 'Abdullah bin 'Amr, 'Ubadah, Abu Malik Al-Ash'ari, and Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. It has been reported through other routes from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). Malik bin Anas reported it from Nafi' from Ibn 'Umar in Mawquf - not Marfu' form.","reference":"Jami` at-Tirmidhi 1861, Book 26, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on consuming intoxicants?","id":"tirmidhi-26-1"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.\nIf he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1862, Book 26, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of consuming Khamr on the acceptance of Salat?","id":"tirmidhi-26-2"},{"hadith-eng":"That the Prophet (ﷺ) was asked about Bit' so he said: \"All drinks that intoxicate are unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1863, Book 26, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on drinks that cause intoxication?","id":"tirmidhi-26-3"},{"hadith-eng":"That the Prophet (ﷺ) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani.[Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1864, Book 26, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on intoxicants?","id":"tirmidhi-26-4"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whatever a lot of it intoxicates, a little of it is unlawful.\"He said: There are narrations on this topic from Sa'd, 'Aishah, 'Abdullah bin 'Amr, Ibn 'Umar, and Khawwat bin Jubair.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Jabir.","reference":"Jami` at-Tirmidhi 1865, Book 26, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the ruling on consuming substances that can intoxicate in large quantities?","id":"tirmidhi-26-5"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful.\"[Abu 'Eisa said:] One of them said in his Hadith: \"A sip of it is unlawful.\"He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: \"Umar bin Salim\" (as well).","reference":"Jami` at-Tirmidhi 1866, Book 26, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on intoxicants and their consumption?","id":"tirmidhi-26-6"},{"hadith-eng":"From Tawus, that a man came to Ibn 'Umar and said: \"Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels?\" He said: \"Yes\" So Tawus said: \"I heard that from him, by Allah.\"He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1867, Book 26, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of prohibiting Nabidh prepared in earthenware vessels in Islamic teachings?","id":"tirmidhi-26-7"},{"hadith-eng":"\"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1868, Book 26, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What types of containers did the Prophet Muhammad (ﷺ) prohibit for use?","id":"tirmidhi-26-8"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1869, Book 26, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on using containers for storing substances according to Islamic teachings?","id":"tirmidhi-26-9"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.'\"He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1870, Book 26, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the initial prohibition regarding the use of certain containers by the Prophet (ﷺ)?","id":"tirmidhi-26-10"},{"hadith-eng":"\"We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning.\"He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.","reference":"Jami` at-Tirmidhi 1871, Book 26, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is Nabidh and how was it prepared during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-26-11"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1872, Book 26, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the different sources from which Khamr can be produced according to Islamic teachings?","id":"tirmidhi-26-12"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 1873, Book 26, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the origin of Khamr according to Islamic teachings?","id":"tirmidhi-26-13"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\"[After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: \"Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].'\" And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.","reference":"Jami` at-Tirmidhi 1874, Book 26, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of identifying the source of Khamr in Islamic teachings?","id":"tirmidhi-26-14"},{"hadith-eng":"That he heard Abu Hurairah saying that the Messenger of Allah (ﷺ) said: \"Khamr comes from these two trees (plants): The datepalm and the grape (vine).\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Kathir As-Suhaimi is Al-Ghubari, and his name is Yazid bin 'Abdur-Rahman bin Ghufailah and Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar.","reference":"Jami` at-Tirmidhi 1875, Book 26, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the sources of khamr according to Islamic teachings?","id":"tirmidhi-26-15"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited making Nabidh from unripend dates and fresh dates together.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1876, Book 26, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the prohibition on mixing unripened dates and fresh dates in making Nabidh?","id":"tirmidhi-26-16"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1877, Book 26, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of mixing different types of dates and raisins in Islamic dietary laws?","id":"tirmidhi-26-17"},{"hadith-eng":"\"I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (ﷺ) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (ﷺ) said: \"If is for them in this world, and for you in the Hereafter.\"He said: There are narrations on this topic from Umm Salamah, Al-Bara', and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1878, Book 26, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on using vessels made from silver and gold?","id":"tirmidhi-26-18"},{"hadith-eng":"From Anas: \"The Prophet (ﷺ) prohibited that a man should drink while standing.\" (Qatadah said:) So it was said: \"And eating ?\" He (Anas) said: \"That is worse.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1879, Book 26, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on drinking while standing?","id":"tirmidhi-26-19"},{"hadith-eng":"\"We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.","reference":"Jami` at-Tirmidhi 1880, Book 26, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does this narration indicate about the practices of eating and drinking during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-26-20"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","reference":"Jami` at-Tirmidhi 1881, Book 26, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the prohibition against drinking while standing in Islamic teachings?","id":"tirmidhi-26-21"},{"hadith-eng":"\"The Prophet (ﷺ) drank from Zamzam while he was standing.\"He said: There are narrations on this topic from 'Ali, Sa'd, 'Abdullah bin 'Amr and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1882, Book 26, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of drinking Zamzam water in Islam?","id":"tirmidhi-26-22"},{"hadith-eng":"From his father, from his grandfather who said: \"I saw the Messenger of Allah (ﷺ) drinking while standing and sitting.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1883, Book 26, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the different postures in which the Prophet Muhammad (ﷺ) consumed beverages?","id":"tirmidhi-26-23"},{"hadith-eng":"That the Prophet (ﷺ) would breathe three times in the vessel and say: \"It is more wholesome and thirst quenching.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Hisham Ad-Dastawa'i reported it from Abu 'Isam, from Anas.","reference":"Jami` at-Tirmidhi 1884, Book 26, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of breathing three times while drinking from a vessel in Islamic tradition?","id":"tirmidhi-26-24"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish).\"[Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.","reference":"Jami` at-Tirmidhi 1885, Book 26, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the recommended way to drink water according to Islamic teachings?","id":"tirmidhi-26-25"},{"hadith-eng":"\"When the Prophet (ﷺ) drank, he would breathe two times.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Rishdin bin Kuraib.He said: I asked [Abu Muhammad] 'Abdullah bin 'Abdur-Rahman about Rishdin bin Kuraib: \"Is he stronger (in narration), or Muhammad bin Kuraib?\" He said: \"Neither are better to me. Rishdin bin Kuraib is preferred over them to me.\" He said: I asked Muhammad bin Isma'il about this, so he said: \"Muhammad bin Kuraib is preferred over Rishdin bin Kuraib.\" To me, the correct view is what Abu Muhammad 'Abdullah bin 'Abdur-Rahman said: Rishdin bin Kuraib is more preferred and he is elder. He lived to see Ibn 'Abbas, and they are brothers, and they both have Munkar narrations in their reports.\"","reference":"Jami` at-Tirmidhi 1886, Book 26, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of breathing while drinking according to Islamic teachings?","id":"tirmidhi-26-26"},{"hadith-eng":"That the Prophet (ﷺ) prohibited blowing into the drink. A man said: \"What about if one sees something floating in the vessel?\" He said: \"Spill it out (removing that).\" He said: \"I can not drink in one breath.\" He said: \"Then remove the cup away from your mouth.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1887, Book 26, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on blowing into a drink?","id":"tirmidhi-26-27"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1888, Book 26, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the etiquettes of drinking from a vessel in Islam?","id":"tirmidhi-26-28"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"When one of you drinks, then do not breathe into the vessel.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1889, Book 26, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the etiquette of drinking from a vessel in Islam?","id":"tirmidhi-26-29"},{"hadith-eng":"There are narrations on this topic from Jabir, Ibn 'Abbas, and Abu Hurairah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1890, Book 26, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of prohibiting bending the mouths of water-skins in Islamic teachings?","id":"tirmidhi-26-30"},{"hadith-eng":"From his father who said: \"I saw the Prophet (ﷺ) standing at a hanging water-skin, so he bent it, then drank from it.\"He said: There is something on this topic from Umm Salamah.[Abu 'Eisa said:] The chain of this Hadith is not Sahih. 'Abdullah bin 'Umar Al-'Umari (a narrator in the chain) was graded weak due to his memory, and I do not know if he heard from 'Eisa or not.","reference":"Jami` at-Tirmidhi 1891, Book 26, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of verifying the authenticity of a hadith's chain of narration?","id":"tirmidhi-26-31"},{"hadith-eng":"From his grandmother Kabshah who said: \"The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.","reference":"Jami` at-Tirmidhi 1892, Book 26, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet (ﷺ) drinking from a hanging water-skin while standing?","id":"tirmidhi-26-32"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was brought some milk which was mixed with some water. On his right was a Bedouin and on his left was Abu Bakr. So he drank, then he gave it to the Bedouin and said: 'The right, then the right.'\"He said: There are narrations on this topic from Ibn 'Abbas, Sahl  bin Sa'd, Ibn 'Umar, and 'Abdullah bin Busr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1893, Book 26, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of giving preference to the person on the right in Islamic etiquette?","id":"tirmidhi-26-33"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The one providing water for people is the last of them to drink.\"He said: There is something on this topic from Ibn Abi Awfa.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1894, Book 26, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of serving others before oneself in Islamic teachings?","id":"tirmidhi-26-34"},{"hadith-eng":"\"The drink most beloved to the Messenger of Allah (ﷺ) was the sweet, cool drink.\"[Abu 'Eisa said:] This was reported similarly by more than one narrator from Ibn 'Uyainah from Ma'mar, from Az-Zuhri, from 'Urwah from 'Aishah. What is correct what was reported by Az-Zuhri from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1895, Book 26, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #1","question":"What type of drink was most beloved to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-26-35"},{"hadith-eng":"\"The Prophet (ﷺ) was asked: 'Which drink is the best ?' He said: 'The sweet, cool drink.\"[Abu 'Eisa said:] This is how 'Abdur-Razzaq reported it from Ma'mar, from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. This is more correct that the narration of Ibn 'Uyainah (no. 1895).","reference":"Jami` at-Tirmidhi 1896, Book 26, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #1","question":"What characteristics make a drink considered the best according to Islamic teachings?","id":"tirmidhi-26-36"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is Khamr, and every intoxicant is unlawful. Whoever drinks Khamr in this world, and dies continuing it, he will not drink it in the Hereafter.He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, 'Abdullah bin 'Amr, 'Ubadah, Abu Malik Al-Ash'ari, and Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. It has been reported through other routes from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). Malik bin Anas reported it from Nafi' from Ibn 'Umar in Mawquf - not Marfu' form.","reference":"Jami` at-Tirmidhi 1861, Book 26, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the consequences in the Hereafter for those who consume intoxicants in this world?","id":"tirmidhi-26-37"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.\nIf he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1862, Book 26, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does repentance affect the acceptance of Salat after consuming Khamr?","id":"tirmidhi-26-38"},{"hadith-eng":"That the Prophet (ﷺ) was asked about Bit' so he said: \"All drinks that intoxicate are unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1863, Book 26, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam classify substances that have intoxicating effects?","id":"tirmidhi-26-39"},{"hadith-eng":"That the Prophet (ﷺ) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani.[Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1864, Book 26, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who are some of the companions who narrated the prohibition of intoxicants?","id":"tirmidhi-26-40"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whatever a lot of it intoxicates, a little of it is unlawful.\"He said: There are narrations on this topic from Sa'd, 'Aishah, 'Abdullah bin 'Amr, Ibn 'Umar, and Khawwat bin Jubair.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Jabir.","reference":"Jami` at-Tirmidhi 1865, Book 26, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the prohibition of intoxicants apply to both large and small quantities?","id":"tirmidhi-26-41"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful.\"[Abu 'Eisa said:] One of them said in his Hadith: \"A sip of it is unlawful.\"He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: \"Umar bin Salim\" (as well).","reference":"Jami` at-Tirmidhi 1866, Book 26, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the quantity of an intoxicant affect its permissibility in Islam?","id":"tirmidhi-26-42"},{"hadith-eng":"From Tawus, that a man came to Ibn 'Umar and said: \"Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels?\" He said: \"Yes\" So Tawus said: \"I heard that from him, by Allah.\"He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1867, Book 26, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who are some of the companions of the Prophet Muhammad (ﷺ) that narrated the prohibition of Nabidh in earthenware vessels?","id":"tirmidhi-26-43"},{"hadith-eng":"\"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1868, Book 26, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why were certain containers like Al-Hantamah and Ad-Dubba' prohibited in Islamic tradition?","id":"tirmidhi-26-44"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1869, Book 26, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the nature of a container affect the permissibility of its contents in Islam?","id":"tirmidhi-26-45"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.'\"He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1870, Book 26, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Ansar respond to the prohibition on using certain containers?","id":"tirmidhi-26-46"},{"hadith-eng":"\"We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning.\"He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.","reference":"Jami` at-Tirmidhi 1871, Book 26, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"What does the preparation and consumption of Nabidh indicate about the daily practices of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-26-47"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1872, Book 26, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to identify the various origins of Khamr in Islamic jurisprudence?","id":"tirmidhi-26-48"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 1873, Book 26, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is Khamr related to wheat in Islamic tradition?","id":"tirmidhi-26-49"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\"[After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: \"Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].'\" And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.","reference":"Jami` at-Tirmidhi 1874, Book 26, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the credibility of a narrator affect the acceptance of a hadith?","id":"tirmidhi-26-50"},{"hadith-eng":"That he heard Abu Hurairah saying that the Messenger of Allah (ﷺ) said: \"Khamr comes from these two trees (plants): The datepalm and the grape (vine).\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Kathir As-Suhaimi is Al-Ghubari, and his name is Yazid bin 'Abdur-Rahman bin Ghufailah and Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar.","reference":"Jami` at-Tirmidhi 1875, Book 26, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of identifying the origins of intoxicants in Islam?","id":"tirmidhi-26-51"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited making Nabidh from unripend dates and fresh dates together.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1876, Book 26, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address the preparation of beverages like Nabidh?","id":"tirmidhi-26-52"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1877, Book 26, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might the Prophet Muhammad (ﷺ) have prohibited the use of certain jars for making Nabidh?","id":"tirmidhi-26-53"},{"hadith-eng":"\"I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (ﷺ) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (ﷺ) said: \"If is for them in this world, and for you in the Hereafter.\"He said: There are narrations on this topic from Umm Salamah, Al-Bara', and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1878, Book 26, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why are silk and Dibaj prohibited for Muslims in this world?","id":"tirmidhi-26-54"},{"hadith-eng":"From Anas: \"The Prophet (ﷺ) prohibited that a man should drink while standing.\" (Qatadah said:) So it was said: \"And eating ?\" He (Anas) said: \"That is worse.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1879, Book 26, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the prohibition of drinking while standing relate to eating in Islamic teachings?","id":"tirmidhi-26-55"},{"hadith-eng":"\"We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.","reference":"Jami` at-Tirmidhi 1880, Book 26, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this narration reflect the flexibility in the manners of eating and drinking in early Islamic society?","id":"tirmidhi-26-56"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","reference":"Jami` at-Tirmidhi 1881, Book 26, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the different narrations related to the prohibition of drinking while standing?","id":"tirmidhi-26-57"},{"hadith-eng":"\"The Prophet (ﷺ) drank from Zamzam while he was standing.\"He said: There are narrations on this topic from 'Ali, Sa'd, 'Abdullah bin 'Amr and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1882, Book 26, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"Is there any specific posture recommended for drinking Zamzam water?","id":"tirmidhi-26-58"},{"hadith-eng":"From his father, from his grandfather who said: \"I saw the Messenger of Allah (ﷺ) drinking while standing and sitting.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1883, Book 26, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the practice of drinking while standing or sitting relate to Islamic etiquette?","id":"tirmidhi-26-59"},{"hadith-eng":"That the Prophet (ﷺ) would breathe three times in the vessel and say: \"It is more wholesome and thirst quenching.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Hisham Ad-Dastawa'i reported it from Abu 'Isam, from Anas.","reference":"Jami` at-Tirmidhi 1884, Book 26, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of breathing in a vessel contribute to the wholesomeness and thirst-quenching nature of the drink?","id":"tirmidhi-26-60"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish).\"[Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.","reference":"Jami` at-Tirmidhi 1885, Book 26, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is it advised to avoid drinking water all at once like a camel?","id":"tirmidhi-26-61"},{"hadith-eng":"\"When the Prophet (ﷺ) drank, he would breathe two times.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Rishdin bin Kuraib.He said: I asked [Abu Muhammad] 'Abdullah bin 'Abdur-Rahman about Rishdin bin Kuraib: \"Is he stronger (in narration), or Muhammad bin Kuraib?\" He said: \"Neither are better to me. Rishdin bin Kuraib is preferred over them to me.\" He said: I asked Muhammad bin Isma'il about this, so he said: \"Muhammad bin Kuraib is preferred over Rishdin bin Kuraib.\" To me, the correct view is what Abu Muhammad 'Abdullah bin 'Abdur-Rahman said: Rishdin bin Kuraib is more preferred and he is elder. He lived to see Ibn 'Abbas, and they are brothers, and they both have Munkar narrations in their reports.\"","reference":"Jami` at-Tirmidhi 1886, Book 26, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #2","question":"How do scholars assess the reliability of narrators in hadith transmission?","id":"tirmidhi-26-62"},{"hadith-eng":"That the Prophet (ﷺ) prohibited blowing into the drink. A man said: \"What about if one sees something floating in the vessel?\" He said: \"Spill it out (removing that).\" He said: \"I can not drink in one breath.\" He said: \"Then remove the cup away from your mouth.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1887, Book 26, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one handle a situation where there is something floating in a drink?","id":"tirmidhi-26-63"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1888, Book 26, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it discouraged to breathe into a drinking vessel?","id":"tirmidhi-26-64"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"When one of you drinks, then do not breathe into the vessel.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1889, Book 26, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it advised not to breathe into a drinking vessel?","id":"tirmidhi-26-65"},{"hadith-eng":"There are narrations on this topic from Jabir, Ibn 'Abbas, and Abu Hurairah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1890, Book 26, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who are the other companions mentioned in the narrations related to the prohibition of bending water-skins?","id":"tirmidhi-26-66"},{"hadith-eng":"From his father who said: \"I saw the Prophet (ﷺ) standing at a hanging water-skin, so he bent it, then drank from it.\"He said: There is something on this topic from Umm Salamah.[Abu 'Eisa said:] The chain of this Hadith is not Sahih. 'Abdullah bin 'Umar Al-'Umari (a narrator in the chain) was graded weak due to his memory, and I do not know if he heard from 'Eisa or not.","reference":"Jami` at-Tirmidhi 1891, Book 26, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the reliability of narrators affect the classification of a hadith?","id":"tirmidhi-26-67"},{"hadith-eng":"From his grandmother Kabshah who said: \"The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.","reference":"Jami` at-Tirmidhi 1892, Book 26, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #2","question":"What actions did Kabshah take after the Prophet (ﷺ) drank from the water-skin?","id":"tirmidhi-26-68"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was brought some milk which was mixed with some water. On his right was a Bedouin and on his left was Abu Bakr. So he drank, then he gave it to the Bedouin and said: 'The right, then the right.'\"He said: There are narrations on this topic from Ibn 'Abbas, Sahl  bin Sa'd, Ibn 'Umar, and 'Abdullah bin Busr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1893, Book 26, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate fairness and respect in social gatherings?","id":"tirmidhi-26-69"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The one providing water for people is the last of them to drink.\"He said: There is something on this topic from Ibn Abi Awfa.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1894, Book 26, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the act of providing water relate to the concept of selflessness in Islam?","id":"tirmidhi-26-70"},{"hadith-eng":"\"The drink most beloved to the Messenger of Allah (ﷺ) was the sweet, cool drink.\"[Abu 'Eisa said:] This was reported similarly by more than one narrator from Ibn 'Uyainah from Ma'mar, from Az-Zuhri, from 'Urwah from 'Aishah. What is correct what was reported by Az-Zuhri from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1895, Book 26, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the preference of the Prophet Muhammad (ﷺ) for certain drinks conveyed through narrations?","id":"tirmidhi-26-71"},{"hadith-eng":"\"The Prophet (ﷺ) was asked: 'Which drink is the best ?' He said: 'The sweet, cool drink.\"[Abu 'Eisa said:] This is how 'Abdur-Razzaq reported it from Ma'mar, from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. This is more correct that the narration of Ibn 'Uyainah (no. 1895).","reference":"Jami` at-Tirmidhi 1896, Book 26, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) describe the qualities of an ideal drink?","id":"tirmidhi-26-72"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is Khamr, and every intoxicant is unlawful. Whoever drinks Khamr in this world, and dies continuing it, he will not drink it in the Hereafter.He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, 'Abdullah bin 'Amr, 'Ubadah, Abu Malik Al-Ash'ari, and Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. It has been reported through other routes from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). Malik bin Anas reported it from Nafi' from Ibn 'Umar in Mawquf - not Marfu' form.","reference":"Jami` at-Tirmidhi 1861, Book 26, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the classification of substances as Khamr affect their permissibility in Islam?","id":"tirmidhi-26-73"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.\nIf he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1862, Book 26, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of the number forty in the context of Salat and repentance?","id":"tirmidhi-26-74"},{"hadith-eng":"That the Prophet (ﷺ) was asked about Bit' so he said: \"All drinks that intoxicate are unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1863, Book 26, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding intoxicating beverages?","id":"tirmidhi-26-75"},{"hadith-eng":"That the Prophet (ﷺ) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani.[Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1864, Book 26, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is the authenticity of a hadith determined in Islamic tradition?","id":"tirmidhi-26-76"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whatever a lot of it intoxicates, a little of it is unlawful.\"He said: There are narrations on this topic from Sa'd, 'Aishah, 'Abdullah bin 'Amr, Ibn 'Umar, and Khawwat bin Jubair.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Jabir.","reference":"Jami` at-Tirmidhi 1865, Book 26, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of a substance being unlawful if it intoxicates in large amounts?","id":"tirmidhi-26-77"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful.\"[Abu 'Eisa said:] One of them said in his Hadith: \"A sip of it is unlawful.\"He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: \"Umar bin Salim\" (as well).","reference":"Jami` at-Tirmidhi 1866, Book 26, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the term 'Faraq' in the context of intoxicants?","id":"tirmidhi-26-78"},{"hadith-eng":"From Tawus, that a man came to Ibn 'Umar and said: \"Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels?\" He said: \"Yes\" So Tawus said: \"I heard that from him, by Allah.\"He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1867, Book 26, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the authenticity of a hadith impact its acceptance and practice in Islam?","id":"tirmidhi-26-79"},{"hadith-eng":"\"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1868, Book 26, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of using water-skins for preparing Nabidh according to Islamic teachings?","id":"tirmidhi-26-80"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1869, Book 26, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic stance on intoxicants and their consumption?","id":"tirmidhi-26-81"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.'\"He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1870, Book 26, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the Prophet's (ﷺ) response to the Ansar's complaint about the lack of vessels?","id":"tirmidhi-26-82"},{"hadith-eng":"\"We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning.\"He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.","reference":"Jami` at-Tirmidhi 1871, Book 26, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the preservation and storage methods of beverages in early Islamic society?","id":"tirmidhi-26-83"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1872, Book 26, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the classification of Khamr impact its permissibility in Islam?","id":"tirmidhi-26-84"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 1873, Book 26, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of Khamr being derived from wheat in Islamic jurisprudence?","id":"tirmidhi-26-85"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\"[After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: \"Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].'\" And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.","reference":"Jami` at-Tirmidhi 1874, Book 26, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of differing narrations on the understanding of Islamic rulings?","id":"tirmidhi-26-86"},{"hadith-eng":"That he heard Abu Hurairah saying that the Messenger of Allah (ﷺ) said: \"Khamr comes from these two trees (plants): The datepalm and the grape (vine).\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Kathir As-Suhaimi is Al-Ghubari, and his name is Yazid bin 'Abdur-Rahman bin Ghufailah and Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar.","reference":"Jami` at-Tirmidhi 1875, Book 26, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the classification of khamr relate to the prohibition of intoxicants in Islam?","id":"tirmidhi-26-87"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited making Nabidh from unripend dates and fresh dates together.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1876, Book 26, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential reasons for prohibiting certain combinations of ingredients in Islamic dietary laws?","id":"tirmidhi-26-88"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1877, Book 26, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential reasons for prohibiting the mixing of unripe dates with ripe dates?","id":"tirmidhi-26-89"},{"hadith-eng":"\"I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (ﷺ) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (ﷺ) said: \"If is for them in this world, and for you in the Hereafter.\"He said: There are narrations on this topic from Umm Salamah, Al-Bara', and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1878, Book 26, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the prohibition of certain materials for Muslims in this world and their availability in the Hereafter?","id":"tirmidhi-26-90"},{"hadith-eng":"From Anas: \"The Prophet (ﷺ) prohibited that a man should drink while standing.\" (Qatadah said:) So it was said: \"And eating ?\" He (Anas) said: \"That is worse.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1879, Book 26, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of considering eating while standing as worse than drinking while standing?","id":"tirmidhi-26-91"},{"hadith-eng":"\"We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.","reference":"Jami` at-Tirmidhi 1880, Book 26, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the permissibility of eating while walking and drinking while standing from this narration?","id":"tirmidhi-26-92"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","reference":"Jami` at-Tirmidhi 1881, Book 26, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"Who are the companions mentioned in the narrations about drinking while standing?","id":"tirmidhi-26-93"},{"hadith-eng":"\"The Prophet (ﷺ) drank from Zamzam while he was standing.\"He said: There are narrations on this topic from 'Ali, Sa'd, 'Abdullah bin 'Amr and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1882, Book 26, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different opinions or practices regarding drinking while standing in Islamic tradition?","id":"tirmidhi-26-94"},{"hadith-eng":"From his father, from his grandfather who said: \"I saw the Messenger of Allah (ﷺ) drinking while standing and sitting.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1883, Book 26, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of observing the actions of the Prophet Muhammad (ﷺ) in daily activities?","id":"tirmidhi-26-95"},{"hadith-eng":"That the Prophet (ﷺ) would breathe three times in the vessel and say: \"It is more wholesome and thirst quenching.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Hisham Ad-Dastawa'i reported it from Abu 'Isam, from Anas.","reference":"Jami` at-Tirmidhi 1884, Book 26, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the benefits of following the Prophet's (ﷺ) practices in daily activities such as drinking?","id":"tirmidhi-26-96"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish).\"[Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.","reference":"Jami` at-Tirmidhi 1885, Book 26, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of mentioning Allah's Name before drinking?","id":"tirmidhi-26-97"},{"hadith-eng":"\"When the Prophet (ﷺ) drank, he would breathe two times.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Rishdin bin Kuraib.He said: I asked [Abu Muhammad] 'Abdullah bin 'Abdur-Rahman about Rishdin bin Kuraib: \"Is he stronger (in narration), or Muhammad bin Kuraib?\" He said: \"Neither are better to me. Rishdin bin Kuraib is preferred over them to me.\" He said: I asked Muhammad bin Isma'il about this, so he said: \"Muhammad bin Kuraib is preferred over Rishdin bin Kuraib.\" To me, the correct view is what Abu Muhammad 'Abdullah bin 'Abdur-Rahman said: Rishdin bin Kuraib is more preferred and he is elder. He lived to see Ibn 'Abbas, and they are brothers, and they both have Munkar narrations in their reports.\"","reference":"Jami` at-Tirmidhi 1886, Book 26, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the criteria used by scholars to prefer one narrator over another in hadith literature?","id":"tirmidhi-26-98"},{"hadith-eng":"That the Prophet (ﷺ) prohibited blowing into the drink. A man said: \"What about if one sees something floating in the vessel?\" He said: \"Spill it out (removing that).\" He said: \"I can not drink in one breath.\" He said: \"Then remove the cup away from your mouth.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1887, Book 26, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the recommended way to drink if one cannot consume a drink in one breath?","id":"tirmidhi-26-99"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1888, Book 26, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential health or hygiene reasons behind not blowing into a vessel?","id":"tirmidhi-26-100"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"When one of you drinks, then do not breathe into the vessel.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1889, Book 26, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this teaching reflect on personal hygiene and manners in Islam?","id":"tirmidhi-26-101"},{"hadith-eng":"There are narrations on this topic from Jabir, Ibn 'Abbas, and Abu Hurairah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1890, Book 26, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the classification 'Hasan Sahih' indicate about the reliability of a hadith?","id":"tirmidhi-26-102"},{"hadith-eng":"From his father who said: \"I saw the Prophet (ﷺ) standing at a hanging water-skin, so he bent it, then drank from it.\"He said: There is something on this topic from Umm Salamah.[Abu 'Eisa said:] The chain of this Hadith is not Sahih. 'Abdullah bin 'Umar Al-'Umari (a narrator in the chain) was graded weak due to his memory, and I do not know if he heard from 'Eisa or not.","reference":"Jami` at-Tirmidhi 1891, Book 26, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of a narrator being graded weak due to memory issues?","id":"tirmidhi-26-103"},{"hadith-eng":"From his grandmother Kabshah who said: \"The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.","reference":"Jami` at-Tirmidhi 1892, Book 26, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #3","question":"How is the authenticity of this hadith described in terms of its classification?","id":"tirmidhi-26-104"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was brought some milk which was mixed with some water. On his right was a Bedouin and on his left was Abu Bakr. So he drank, then he gave it to the Bedouin and said: 'The right, then the right.'\"He said: There are narrations on this topic from Ibn 'Abbas, Sahl  bin Sa'd, Ibn 'Umar, and 'Abdullah bin Busr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1893, Book 26, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the Prophet's (ﷺ) interactions with different people from this narration?","id":"tirmidhi-26-105"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The one providing water for people is the last of them to drink.\"He said: There is something on this topic from Ibn Abi Awfa.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1894, Book 26, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lessons can be learned about leadership and responsibility from the act of serving others first?","id":"tirmidhi-26-106"},{"hadith-eng":"\"The drink most beloved to the Messenger of Allah (ﷺ) was the sweet, cool drink.\"[Abu 'Eisa said:] This was reported similarly by more than one narrator from Ibn 'Uyainah from Ma'mar, from Az-Zuhri, from 'Urwah from 'Aishah. What is correct what was reported by Az-Zuhri from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1895, Book 26, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the preference of the Prophet Muhammad (ﷺ) for sweet, cool drinks indicate about his personal tastes?","id":"tirmidhi-26-107"},{"hadith-eng":"\"The Prophet (ﷺ) was asked: 'Which drink is the best ?' He said: 'The sweet, cool drink.\"[Abu 'Eisa said:] This is how 'Abdur-Razzaq reported it from Ma'mar, from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. This is more correct that the narration of Ibn 'Uyainah (no. 1895).","reference":"Jami` at-Tirmidhi 1896, Book 26, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of sweetness and coolness in beverages in Islamic tradition?","id":"tirmidhi-26-108"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is Khamr, and every intoxicant is unlawful. Whoever drinks Khamr in this world, and dies continuing it, he will not drink it in the Hereafter.He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, 'Abdullah bin 'Amr, 'Ubadah, Abu Malik Al-Ash'ari, and Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. It has been reported through other routes from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). Malik bin Anas reported it from Nafi' from Ibn 'Umar in Mawquf - not Marfu' form.","reference":"Jami` at-Tirmidhi 1861, Book 26, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the different sources that report the prohibition of intoxicants in Islam?","id":"tirmidhi-26-109"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.\nIf he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1862, Book 26, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the river of Al-Khabal and its significance in Islamic teachings?","id":"tirmidhi-26-110"},{"hadith-eng":"That the Prophet (ﷺ) was asked about Bit' so he said: \"All drinks that intoxicate are unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1863, Book 26, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the term 'Bit'' in the context of Islamic dietary laws?","id":"tirmidhi-26-111"},{"hadith-eng":"That the Prophet (ﷺ) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani.[Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1864, Book 26, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of a hadith being classified as Hasan or Sahih?","id":"tirmidhi-26-112"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whatever a lot of it intoxicates, a little of it is unlawful.\"He said: There are narrations on this topic from Sa'd, 'Aishah, 'Abdullah bin 'Amr, Ibn 'Umar, and Khawwat bin Jubair.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Jabir.","reference":"Jami` at-Tirmidhi 1865, Book 26, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #4","question":"What other companions of the Prophet Muhammad (ﷺ) have narrated similar teachings about intoxicants?","id":"tirmidhi-26-113"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful.\"[Abu 'Eisa said:] One of them said in his Hadith: \"A sip of it is unlawful.\"He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: \"Umar bin Salim\" (as well).","reference":"Jami` at-Tirmidhi 1866, Book 26, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is even a small amount of an intoxicant considered unlawful in Islam?","id":"tirmidhi-26-114"},{"hadith-eng":"From Tawus, that a man came to Ibn 'Umar and said: \"Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels?\" He said: \"Yes\" So Tawus said: \"I heard that from him, by Allah.\"He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1867, Book 26, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does swearing by Allah play in confirming the truthfulness of a narration?","id":"tirmidhi-26-115"},{"hadith-eng":"\"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1868, Book 26, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did Ibn 'Umar convey the teachings of the Prophet (ﷺ) regarding prohibited containers?","id":"tirmidhi-26-116"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1869, Book 26, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might certain containers have been previously forbidden in Islamic tradition?","id":"tirmidhi-26-117"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.'\"He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1870, Book 26, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"Which other companions narrated similar accounts regarding the use of containers?","id":"tirmidhi-26-118"},{"hadith-eng":"\"We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning.\"He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.","reference":"Jami` at-Tirmidhi 1871, Book 26, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who are some of the other companions who narrated similar practices regarding Nabidh?","id":"tirmidhi-26-119"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1872, Book 26, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of understanding the ingredients of Khamr in Islamic dietary laws?","id":"tirmidhi-26-120"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\"[After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: \"Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].'\" And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.","reference":"Jami` at-Tirmidhi 1874, Book 26, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to verify the strength of a narrator in hadith transmission?","id":"tirmidhi-26-121"},{"hadith-eng":"That he heard Abu Hurairah saying that the Messenger of Allah (ﷺ) said: \"Khamr comes from these two trees (plants): The datepalm and the grape (vine).\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Kathir As-Suhaimi is Al-Ghubari, and his name is Yazid bin 'Abdur-Rahman bin Ghufailah and Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar.","reference":"Jami` at-Tirmidhi 1875, Book 26, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of the hadith regarding the consumption of products derived from date palms and grapevines?","id":"tirmidhi-26-122"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited making Nabidh from unripend dates and fresh dates together.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1876, Book 26, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the term 'Hasan Sahih' indicate about the authenticity and reliability of a hadith?","id":"tirmidhi-26-123"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1877, Book 26, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do different narrations from various companions contribute to understanding Islamic rulings on food and drink?","id":"tirmidhi-26-124"},{"hadith-eng":"\"I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (ﷺ) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (ﷺ) said: \"If is for them in this world, and for you in the Hereafter.\"He said: There are narrations on this topic from Umm Salamah, Al-Bara', and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1878, Book 26, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did Hudhaifah react when offered a silver vessel, and what does this teach about adherence to Islamic teachings?","id":"tirmidhi-26-125"},{"hadith-eng":"From Anas: \"The Prophet (ﷺ) prohibited that a man should drink while standing.\" (Qatadah said:) So it was said: \"And eating ?\" He (Anas) said: \"That is worse.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1879, Book 26, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of classifying a hadith as Hasan Sahih in Islamic scholarship?","id":"tirmidhi-26-126"},{"hadith-eng":"\"We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.","reference":"Jami` at-Tirmidhi 1880, Book 26, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration contribute to understanding the daily life and habits of the companions of the Prophet (ﷺ)?","id":"tirmidhi-26-127"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","reference":"Jami` at-Tirmidhi 1881, Book 26, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the classification of the hadith regarding drinking while standing?","id":"tirmidhi-26-128"},{"hadith-eng":"\"The Prophet (ﷺ) drank from Zamzam while he was standing.\"He said: There are narrations on this topic from 'Ali, Sa'd, 'Abdullah bin 'Amr and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1882, Book 26, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who are some of the companions of the Prophet Muhammad (ﷺ) that narrated about drinking Zamzam water?","id":"tirmidhi-26-129"},{"hadith-eng":"From his father, from his grandfather who said: \"I saw the Messenger of Allah (ﷺ) drinking while standing and sitting.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1883, Book 26, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the classification of a hadith as Hasan Sahih affect its acceptance and application in Islamic teachings?","id":"tirmidhi-26-130"},{"hadith-eng":"That the Prophet (ﷺ) would breathe three times in the vessel and say: \"It is more wholesome and thirst quenching.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Hisham Ad-Dastawa'i reported it from Abu 'Isam, from Anas.","reference":"Jami` at-Tirmidhi 1884, Book 26, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the authenticity of a hadith determined in Islamic scholarship?","id":"tirmidhi-26-131"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish).\"[Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.","reference":"Jami` at-Tirmidhi 1885, Book 26, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #4","question":"How should one express gratitude after finishing a drink?","id":"tirmidhi-26-132"},{"hadith-eng":"\"When the Prophet (ﷺ) drank, he would breathe two times.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Rishdin bin Kuraib.He said: I asked [Abu Muhammad] 'Abdullah bin 'Abdur-Rahman about Rishdin bin Kuraib: \"Is he stronger (in narration), or Muhammad bin Kuraib?\" He said: \"Neither are better to me. Rishdin bin Kuraib is preferred over them to me.\" He said: I asked Muhammad bin Isma'il about this, so he said: \"Muhammad bin Kuraib is preferred over Rishdin bin Kuraib.\" To me, the correct view is what Abu Muhammad 'Abdullah bin 'Abdur-Rahman said: Rishdin bin Kuraib is more preferred and he is elder. He lived to see Ibn 'Abbas, and they are brothers, and they both have Munkar narrations in their reports.\"","reference":"Jami` at-Tirmidhi 1886, Book 26, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the term 'Hasan Gharib' indicate about the classification of a hadith?","id":"tirmidhi-26-133"},{"hadith-eng":"That the Prophet (ﷺ) prohibited blowing into the drink. A man said: \"What about if one sees something floating in the vessel?\" He said: \"Spill it out (removing that).\" He said: \"I can not drink in one breath.\" He said: \"Then remove the cup away from your mouth.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1887, Book 26, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the etiquettes of drinking according to Islamic teachings?","id":"tirmidhi-26-134"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1888, Book 26, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic teaching promote cleanliness and hygiene in daily practices?","id":"tirmidhi-26-135"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"When one of you drinks, then do not breathe into the vessel.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1889, Book 26, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of following the Prophet's guidance on daily habits?","id":"tirmidhi-26-136"},{"hadith-eng":"There are narrations on this topic from Jabir, Ibn 'Abbas, and Abu Hurairah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1890, Book 26, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the prohibition of bending water-skins relate to the broader principles of hygiene and consumption in Islam?","id":"tirmidhi-26-137"},{"hadith-eng":"From his father who said: \"I saw the Prophet (ﷺ) standing at a hanging water-skin, so he bent it, then drank from it.\"He said: There is something on this topic from Umm Salamah.[Abu 'Eisa said:] The chain of this Hadith is not Sahih. 'Abdullah bin 'Umar Al-'Umari (a narrator in the chain) was graded weak due to his memory, and I do not know if he heard from 'Eisa or not.","reference":"Jami` at-Tirmidhi 1891, Book 26, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #4","question":"What actions did the Prophet (ﷺ) take when drinking from a hanging water-skin?","id":"tirmidhi-26-138"},{"hadith-eng":"From his grandmother Kabshah who said: \"The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.","reference":"Jami` at-Tirmidhi 1892, Book 26, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #4","question":"Who is the narrator of this hadith and what is her relation to 'Abdur-Rahman bin Abi 'Amrah?","id":"tirmidhi-26-139"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was brought some milk which was mixed with some water. On his right was a Bedouin and on his left was Abu Bakr. So he drank, then he gave it to the Bedouin and said: 'The right, then the right.'\"He said: There are narrations on this topic from Ibn 'Abbas, Sahl  bin Sa'd, Ibn 'Umar, and 'Abdullah bin Busr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1893, Book 26, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration illustrate the importance of following the Sunnah in daily actions?","id":"tirmidhi-26-140"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The one providing water for people is the last of them to drink.\"He said: There is something on this topic from Ibn Abi Awfa.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1894, Book 26, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways does prioritizing others' needs reflect the values of compassion and generosity in Islam?","id":"tirmidhi-26-141"},{"hadith-eng":"\"The drink most beloved to the Messenger of Allah (ﷺ) was the sweet, cool drink.\"[Abu 'Eisa said:] This was reported similarly by more than one narrator from Ibn 'Uyainah from Ma'mar, from Az-Zuhri, from 'Urwah from 'Aishah. What is correct what was reported by Az-Zuhri from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1895, Book 26, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #4","question":"How do different narrators contribute to the transmission of hadiths about the Prophet Muhammad's (ﷺ) preferences?","id":"tirmidhi-26-142"},{"hadith-eng":"\"The Prophet (ﷺ) was asked: 'Which drink is the best ?' He said: 'The sweet, cool drink.\"[Abu 'Eisa said:] This is how 'Abdur-Razzaq reported it from Ma'mar, from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. This is more correct that the narration of Ibn 'Uyainah (no. 1895).","reference":"Jami` at-Tirmidhi 1896, Book 26, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #4","question":"How are different narrations of hadith evaluated for authenticity in Islamic scholarship?","id":"tirmidhi-26-143"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is Khamr, and every intoxicant is unlawful. Whoever drinks Khamr in this world, and dies continuing it, he will not drink it in the Hereafter.He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, 'Abdullah bin 'Amr, 'Ubadah, Abu Malik Al-Ash'ari, and Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. It has been reported through other routes from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). Malik bin Anas reported it from Nafi' from Ibn 'Umar in Mawquf - not Marfu' form.","reference":"Jami` at-Tirmidhi 1861, Book 26, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the hadith being classified as Hasan Sahih?","id":"tirmidhi-26-144"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.\nIf he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1862, Book 26, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does repeated sinning affect the acceptance of repentance in Islam?","id":"tirmidhi-26-145"},{"hadith-eng":"That the Prophet (ﷺ) was asked about Bit' so he said: \"All drinks that intoxicate are unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1863, Book 26, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the classification of intoxicants relate to their permissibility in Islam?","id":"tirmidhi-26-146"},{"hadith-eng":"That the Prophet (ﷺ) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani.[Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1864, Book 26, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of multiple narrators reporting the same hadith?","id":"tirmidhi-26-147"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whatever a lot of it intoxicates, a little of it is unlawful.\"He said: There are narrations on this topic from Sa'd, 'Aishah, 'Abdullah bin 'Amr, Ibn 'Umar, and Khawwat bin Jubair.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Jabir.","reference":"Jami` at-Tirmidhi 1865, Book 26, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #5","question":"How is the authenticity of a hadith determined when it is described as Hasan Gharib?","id":"tirmidhi-26-148"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful.\"[Abu 'Eisa said:] One of them said in his Hadith: \"A sip of it is unlawful.\"He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: \"Umar bin Salim\" (as well).","reference":"Jami` at-Tirmidhi 1866, Book 26, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of a hadith being classified as 'Hasan'?","id":"tirmidhi-26-149"},{"hadith-eng":"From Tawus, that a man came to Ibn 'Umar and said: \"Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels?\" He said: \"Yes\" So Tawus said: \"I heard that from him, by Allah.\"He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1867, Book 26, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the classification of this hadith according to Abu 'Eisa?","id":"tirmidhi-26-150"},{"hadith-eng":"\"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1868, Book 26, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the characteristics of the containers that were prohibited by the Prophet Muhammad (ﷺ)?","id":"tirmidhi-26-151"},{"hadith-eng":"From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1869, Book 26, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the prohibition of intoxicants in Islam?","id":"tirmidhi-26-152"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited using (certain) containers. So the Ansar complained about that to him. They said: 'We will have no vessels!' so he said: 'If so then use them.'\"He said: There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Sa'eed, and 'Abdullah bin 'Amr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1870, Book 26, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'Hasan Sahih' indicate about the authenticity of this hadith?","id":"tirmidhi-26-153"},{"hadith-eng":"\"We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning.\"He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.","reference":"Jami` at-Tirmidhi 1871, Book 26, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the hadith being classified as Gharib in Islamic scholarship?","id":"tirmidhi-26-154"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1872, Book 26, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #5","question":"How do different narrations contribute to the understanding of the concept of Khamr in Islam?","id":"tirmidhi-26-155"},{"hadith-eng":"\"Indeed Khamr comes from wheat.\"[After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: \"Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].'\" And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.","reference":"Jami` at-Tirmidhi 1874, Book 26, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does scholarly opinion play in determining the authenticity of a hadith?","id":"tirmidhi-26-156"},{"hadith-eng":"That he heard Abu Hurairah saying that the Messenger of Allah (ﷺ) said: \"Khamr comes from these two trees (plants): The datepalm and the grape (vine).\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Kathir As-Suhaimi is Al-Ghubari, and his name is Yazid bin 'Abdur-Rahman bin Ghufailah and Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar.","reference":"Jami` at-Tirmidhi 1875, Book 26, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the authenticity of a hadith impact its acceptance and application in Islamic jurisprudence?","id":"tirmidhi-26-157"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited making Nabidh from unripend dates and fresh dates together.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1876, Book 26, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do scholars classify hadiths in terms of their authenticity and what are the implications of these classifications?","id":"tirmidhi-26-158"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1877, Book 26, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of classifying a hadith as Hasan Sahih in Islamic scholarship?","id":"tirmidhi-26-159"},{"hadith-eng":"\"I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (ﷺ) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (ﷺ) said: \"If is for them in this world, and for you in the Hereafter.\"He said: There are narrations on this topic from Umm Salamah, Al-Bara', and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1878, Book 26, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the consequences of using prohibited items according to Islamic teachings?","id":"tirmidhi-26-160"},{"hadith-eng":"From Anas: \"The Prophet (ﷺ) prohibited that a man should drink while standing.\" (Qatadah said:) So it was said: \"And eating ?\" He (Anas) said: \"That is worse.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1879, Book 26, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do cultural practices influence the interpretation of hadiths related to eating and drinking?","id":"tirmidhi-26-161"},{"hadith-eng":"\"We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.","reference":"Jami` at-Tirmidhi 1880, Book 26, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the chain of narrators in this hadith, and how does it affect its authenticity?","id":"tirmidhi-26-162"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","reference":"Jami` at-Tirmidhi 1881, Book 26, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'Hasan Gharib' indicate about a hadith?","id":"tirmidhi-26-163"},{"hadith-eng":"\"The Prophet (ﷺ) drank from Zamzam while he was standing.\"He said: There are narrations on this topic from 'Ali, Sa'd, 'Abdullah bin 'Amr and 'Aishah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1882, Book 26, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the authenticity of a hadith determined in Islamic scholarship?","id":"tirmidhi-26-164"},{"hadith-eng":"That the Prophet (ﷺ) would breathe three times in the vessel and say: \"It is more wholesome and thirst quenching.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Hisham Ad-Dastawa'i reported it from Abu 'Isam, from Anas.","reference":"Jami` at-Tirmidhi 1884, Book 26, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'Hasan Gharib' indicate about the classification of a hadith?","id":"tirmidhi-26-165"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Let none of you drink all at once like the camel. But drink two or three times, mentioning Allah's Name when you drink, and praising Him when you (finish).\"[Abu 'Eisa said:] This Hadith is Gharib. Yazid bin Sinan Al-Jazari is Abu Farwah Ar-Ruhawi.","reference":"Jami` at-Tirmidhi 1885, Book 26, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the etiquettes of drinking water in Islam?","id":"tirmidhi-26-166"},{"hadith-eng":"\"When the Prophet (ﷺ) drank, he would breathe two times.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Rishdin bin Kuraib.He said: I asked [Abu Muhammad] 'Abdullah bin 'Abdur-Rahman about Rishdin bin Kuraib: \"Is he stronger (in narration), or Muhammad bin Kuraib?\" He said: \"Neither are better to me. Rishdin bin Kuraib is preferred over them to me.\" He said: I asked Muhammad bin Isma'il about this, so he said: \"Muhammad bin Kuraib is preferred over Rishdin bin Kuraib.\" To me, the correct view is what Abu Muhammad 'Abdullah bin 'Abdur-Rahman said: Rishdin bin Kuraib is more preferred and he is elder. He lived to see Ibn 'Abbas, and they are brothers, and they both have Munkar narrations in their reports.\"","reference":"Jami` at-Tirmidhi 1886, Book 26, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #5","question":"How do differing opinions among scholars affect the acceptance of a hadith?","id":"tirmidhi-26-167"},{"hadith-eng":"That the Prophet (ﷺ) prohibited blowing into the drink. A man said: \"What about if one sees something floating in the vessel?\" He said: \"Spill it out (removing that).\" He said: \"I can not drink in one breath.\" He said: \"Then remove the cup away from your mouth.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1887, Book 26, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does one ensure cleanliness and hygiene in consuming beverages in Islam?","id":"tirmidhi-26-168"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1888, Book 26, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of following the Prophet's guidance in everyday actions?","id":"tirmidhi-26-169"},{"hadith-eng":"From his father who said: \"I saw the Prophet (ﷺ) standing at a hanging water-skin, so he bent it, then drank from it.\"He said: There is something on this topic from Umm Salamah.[Abu 'Eisa said:] The chain of this Hadith is not Sahih. 'Abdullah bin 'Umar Al-'Umari (a narrator in the chain) was graded weak due to his memory, and I do not know if he heard from 'Eisa or not.","reference":"Jami` at-Tirmidhi 1891, Book 26, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #5","question":"Why is it important to know if a narrator heard directly from another in the chain of narration?","id":"tirmidhi-26-170"},{"hadith-eng":"From his grandmother Kabshah who said: \"The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.","reference":"Jami` at-Tirmidhi 1892, Book 26, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be inferred about the practices of drinking water from this narration?","id":"tirmidhi-26-171"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was brought some milk which was mixed with some water. On his right was a Bedouin and on his left was Abu Bakr. So he drank, then he gave it to the Bedouin and said: 'The right, then the right.'\"He said: There are narrations on this topic from Ibn 'Abbas, Sahl  bin Sa'd, Ibn 'Umar, and 'Abdullah bin Busr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1893, Book 26, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this hadith teach about the distribution of food and drink in a group setting?","id":"tirmidhi-26-172"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The one providing water for people is the last of them to drink.\"He said: There is something on this topic from Ibn Abi Awfa.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1894, Book 26, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching encourage community service and cooperation among people?","id":"tirmidhi-26-173"},{"hadith-eng":"\"The drink most beloved to the Messenger of Allah (ﷺ) was the sweet, cool drink.\"[Abu 'Eisa said:] This was reported similarly by more than one narrator from Ibn 'Uyainah from Ma'mar, from Az-Zuhri, from 'Urwah from 'Aishah. What is correct what was reported by Az-Zuhri from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1895, Book 26, Hadith 36","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of the Mursal form in the transmission of hadiths?","id":"tirmidhi-26-174"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.\nIf he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1862, Book 26, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #6","question":"What is the Islamic perspective on the cycle of sinning and repentance?","id":"tirmidhi-26-175"},{"hadith-eng":"\"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1868, Book 26, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #6","question":"Which companions of the Prophet (ﷺ) narrated similar teachings about prohibited containers?","id":"tirmidhi-26-176"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.","reference":"Jami` at-Tirmidhi 1881, Book 26, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the importance of verifying the correct names and titles of narrators in hadith transmission?","id":"tirmidhi-26-177"}]