[{"hadith-eng":"\"The Messenger of Allah(s.a.w) came out to us while we were discussing about Al-Qadar. He became angry such that his face became red, as if a pomegranate  was bursting through his cheeks. He said: 'Is this what I ordered you to do?' - or: 'Is this what I have been sent to you with? The people before you were only ruined when they differed about this matter. I order you [I order you] to not debate about it.'\". (Daif))","reference":"Jami` at-Tirmidhi 2133, Book 32, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of avoiding debates on predestination in Islam?","id":"tirmidhi-32-1"},{"hadith-eng":"\"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"","reference":"Jami` at-Tirmidhi 2134, Book 32, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the dialogue between Adam and Musa in understanding predestination in Islam?","id":"tirmidhi-32-2"},{"hadith-eng":"' I heard Salim bin 'Abdullah narrating a Hadith from his father who said: \"'Umar said :\n\"O Messenger of Allah! Do you see that what we do is a new matter- or a matter initiated – or it is a matter already concluded?” He (s.a.w)  said: “ O Ibn Al-Khattab! It is a matter already concluded. For everyone is suited (for that for which he is created). As for one who is among the people of happiness, then he works for happiness, and as for the one who is among the people of misery, then he works for his misery.” (Hasan)","reference":"Jami` at-Tirmidhi 2135, Book 32, Hadith 3","grade":"","question #":"question #1","question":"What does the concept of predestination imply about human actions and their outcomes?","id":"tirmidhi-32-3"},{"hadith-eng":"\"We were with the Messenger of Allah (s.a.w) and he was scraping the ground, when he raised his head to the heavens, then said:\n'There is not one of you but (his place) is known' – Waki said: 'His place has been decreed (be it) in the Fire, and (or) his place in Paradise.' They said: 'Shall we not rely upon this O Messenger of Allah?' He said: 'No. Work, for everyone is facilitated for what he was created.'”(Sahih)","reference":"Jami` at-Tirmidhi 2136, Book 32, Hadith 4","grade":"","question #":"question #1","question":"What does it mean that everyone's place is known in the context of destiny and divine decree?","id":"tirmidhi-32-4"},{"hadith-eng":"The Messenger of Allah (s.a.w) narrated to us - and he is the truthful and entrusted one:\n'Indeed the creation of one of you is gathered inside his mother in forty days. Then, for a similar period, he is a clot. Then, for a similar period, he is a piece of flesh. Then Allah sends the angel to him to blow the soul into him, and he is ordered to write four (things): To write his provision, his life-span, his works, and whether he will be wretched or happy. By the One besides Whom there is none other worthy of worship! One of you will do deeds of the people of Paradise, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of the Fire, so that he enters it. And indeed one of you will do deeds of the people of the Fire, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of Paradise, so that he enters it.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2137, Book 32, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the process of human creation as described in Islamic teachings?","id":"tirmidhi-32-5"},{"hadith-eng":"\"Every child is born upon the Millah, then his parents make him a Jew, a Christian, or an idolater.\" It was said: \"O Messenger of Allah! What about those  who die before that?\" He said: \"Allah knows best what they would have done.\"\n\n[Another chain) with similar in \nmeaning, and he said: \"Born \nupon the Fiirah.\"","reference":"Jami` at-Tirmidhi 2138, Book 32, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the concept of innate disposition in Islam regarding the faith of a newborn child?","id":"tirmidhi-32-6"},{"hadith-eng":"\"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"","reference":"Jami` at-Tirmidhi 2139, Book 32, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of supplication in influencing divine decree?","id":"tirmidhi-32-7"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) would often say: Ya Muqallibal-qulub, thabbit qalbi 'ala dinik('O Changer of the Hearts! Strengthen my heart upon Your Religion.)' So I said: 'O Prophet of Allah! We believe in you and what you have come with, but do you fear for us?' He said:\n'Yes. Indeed the hearts are between two Fingers of Allah's Fingers, He changes them as He wills.'\"","reference":"Jami` at-Tirmidhi 2140, Book 32, Hadith 8","grade":"","question #":"question #1","question":"What is the significance of the supplication 'O Changer of the Hearts! Strengthen my heart upon Your Religion' in Islamic teachings?","id":"tirmidhi-32-8"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) came out to us with two books in hand. And he said:\n'Do you know what these two books are?' We said: 'No, O Messenger of Allah ! Unless you inform us.' He said about the one that was in his right hand: 'This is a book from the Lord of the worlds, in it are the names of the people of Paradise, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' Then he said about the one that was in his left: 'This is a book from the Lord of the worlds, in it are the names of the people of Fire, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' The companions said: 'So why work O Messenger of Allah! Since the matter is already decided (and over)?' He said: 'Seek to do what is right and draw nearer, for indeed the inhabitant of Paradise, shall have his work sealed off with the deeds of the people of Paradise, whichever deeds he did. And indeed the inhabitant of Fire, shall have his work sealed off with the deeds of the people of Fire, whichever deeds he did.' Then the Messenger of Allah motioned with his hands, casting them down and said: 'Your Lord finished with the slaves, a group in Paradise, and a group in the Blazing Fire.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2141, Book 32, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the two books mentioned by the Prophet in relation to the people of Paradise and the people of Fire?","id":"tirmidhi-32-9"},{"hadith-eng":"\"When  Allah wants good for a slave, He puts him in action.\" It was said: \"How does he put him in action O Messenger Of Allah?\" He said: \"By making him meet up with the righteous deeds before death.\"","reference":"Jami` at-Tirmidhi 2142, Book 32, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does it mean for Allah to want good for a person in terms of their actions?","id":"tirmidhi-32-10"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) stood among us and said:\n'One thing does not infect another.' So a Bedouin said: 'O Messenger of Allah! If a camel gets mangy glands and we leave it at the resting place of camels, then all of the camels get mange?' The Messenger of Allah (s.a.w) said: 'Who caused the first to get mange? There is no 'Adwa nor safar. Allah created every soul, so he wrote its life, its provision, and its afflictions.'\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Jami` at-Tirmidhi 2143, Book 32, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on the belief that diseases can spread from one being to another?","id":"tirmidhi-32-11"},{"hadith-eng":"'A slave  (of Allah) shall not believe until he believes in Al-Qadar, its good and its bad, such that he knows that what struck him would not have missed him, and that what missed him would not have struck him.\"","reference":"Jami` at-Tirmidhi 2144, Book 32, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of believing in Al-Qadar in Islam?","id":"tirmidhi-32-12"},{"hadith-eng":"'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2145, 2145, Book 32, Hadith 13","grade":"Hasan,(Darussalam)","question #":"question #1","question":"What are the fundamental beliefs required for a person to be considered a believer in Islam?","id":"tirmidhi-32-13"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2146, 2298, Book 32, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does divine decree influence the circumstances of a person's death according to Islamic teachings?","id":"tirmidhi-32-14"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\" Or, he said: \"In it.\"","reference":"Jami` at-Tirmidhi 2147, Book 32, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does divine decree influence the circumstances of a person's death according to Islamic teachings?","id":"tirmidhi-32-15"},{"hadith-eng":"\"O Messenger of Allah! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves with prevent anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2148, Book 32, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the relationship between using treatments and Allah's Decree?","id":"tirmidhi-32-16"},{"hadith-eng":"\"There are two groups in my Ummah for whom there is no share in Islam: The Murji'ah and the Qadariyyah.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2149, Book 32, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #1","question":"Who are the Murji'ah and what are their beliefs that exclude them from having a share in Islam?","id":"tirmidhi-32-17"},{"hadith-eng":"'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"","reference":"Jami` at-Tirmidhi 2150, Book 32, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #1","question":"What does the hadith imply about the nature of human life and its challenges?","id":"tirmidhi-32-18"},{"hadith-eng":"'From (the signs of) the son of Adam's prosperity, is his satisfaction with what Allah decreed for him, and from the son of Adam's misery is his avoiding to request guidance from Allah, and from the son of Adam's misery is his anger with what Allah decreed for him.\"","reference":"Jami` at-Tirmidhi 2151, Book 32, Hadith 19","grade":"","question #":"question #1","question":"What is considered a sign of prosperity for a person according to Islamic teachings?","id":"tirmidhi-32-19"},{"hadith-eng":"\"So-and-so conveys his Salam to you.\" So he said: \"It has been conveyed to me that he has innovated, so if he has indeed innovated, then do not convey my Salam to him, for I heard the Messenger of Allah (s.a.w) saying: 'In this Ummah' or: 'In my Ummah'\" - the doubt was his - \"a collapse of the earth, or a transformation, or stones shall rain upon the people of Al-Qadr.'\"","reference":"Jami` at-Tirmidhi 2152, Book 32, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of conveying Salam in Islamic tradition?","id":"tirmidhi-32-20"},{"hadith-eng":"\"There will be a collapse of the earth and transformation in my Ummah, and that is for those who deny Al-Qadar.\"","reference":"Jami` at-Tirmidhi 2153, Book 32, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences mentioned for those who deny Al-Qadar?","id":"tirmidhi-32-21"},{"hadith-eng":"\" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"","reference":"Jami` at-Tirmidhi 2154, Book 32, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences mentioned for altering the Book of Allah?","id":"tirmidhi-32-22"},{"hadith-eng":"\"I arrived in Makkah and met 'Ata bin Abi Rabah. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book. Verily, We have  made it a Qur'an in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of 'Ubadah bin As-Samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar- all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write.' It said : 'What shall I write?' He said : 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"","reference":"Jami` at-Tirmidhi 2155, Book 32, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of believing in Al-Qadar in Islam?","id":"tirmidhi-32-23"},{"hadith-eng":"\"Allah decreed the measures fifty-thousand years before He created the Heavens and the earth.\"","reference":"Jami` at-Tirmidhi 2156, Book 32, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of divine decree in Islam?","id":"tirmidhi-32-24"},{"hadith-eng":"\"Idolaters from the Quraish came to the Messenger of Allah (s.a.w) quarreling about Al-Qadar. So this Ayah was revealed:\n\"The day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell.\" Verily we have created all things with Qadar.","reference":"Jami` at-Tirmidhi 2157, Book 32, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of belief in Al-Qadar in Islam?","id":"tirmidhi-32-25"},{"hadith-eng":"\"The Messenger of Allah(s.a.w) came out to us while we were discussing about Al-Qadar. He became angry such that his face became red, as if a pomegranate  was bursting through his cheeks. He said: 'Is this what I ordered you to do?' - or: 'Is this what I have been sent to you with? The people before you were only ruined when they differed about this matter. I order you [I order you] to not debate about it.'\". (Daif))","reference":"Jami` at-Tirmidhi 2133, Book 32, Hadith 1","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) react to discussions about Al-Qadar among his companions?","id":"tirmidhi-32-26"},{"hadith-eng":"\"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"","reference":"Jami` at-Tirmidhi 2134, Book 32, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of divine decree relate to human actions and accountability?","id":"tirmidhi-32-27"},{"hadith-eng":"' I heard Salim bin 'Abdullah narrating a Hadith from his father who said: \"'Umar said :\n\"O Messenger of Allah! Do you see that what we do is a new matter- or a matter initiated – or it is a matter already concluded?” He (s.a.w)  said: “ O Ibn Al-Khattab! It is a matter already concluded. For everyone is suited (for that for which he is created). As for one who is among the people of happiness, then he works for happiness, and as for the one who is among the people of misery, then he works for his misery.” (Hasan)","reference":"Jami` at-Tirmidhi 2135, Book 32, Hadith 3","grade":"","question #":"question #2","question":"How does the belief in predestination influence a person's approach to happiness and misery?","id":"tirmidhi-32-28"},{"hadith-eng":"\"We were with the Messenger of Allah (s.a.w) and he was scraping the ground, when he raised his head to the heavens, then said:\n'There is not one of you but (his place) is known' – Waki said: 'His place has been decreed (be it) in the Fire, and (or) his place in Paradise.' They said: 'Shall we not rely upon this O Messenger of Allah?' He said: 'No. Work, for everyone is facilitated for what he was created.'”(Sahih)","reference":"Jami` at-Tirmidhi 2136, Book 32, Hadith 4","grade":"","question #":"question #2","question":"How does the concept of predestination relate to human effort and actions in Islam?","id":"tirmidhi-32-29"},{"hadith-eng":"The Messenger of Allah (s.a.w) narrated to us - and he is the truthful and entrusted one:\n'Indeed the creation of one of you is gathered inside his mother in forty days. Then, for a similar period, he is a clot. Then, for a similar period, he is a piece of flesh. Then Allah sends the angel to him to blow the soul into him, and he is ordered to write four (things): To write his provision, his life-span, his works, and whether he will be wretched or happy. By the One besides Whom there is none other worthy of worship! One of you will do deeds of the people of Paradise, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of the Fire, so that he enters it. And indeed one of you will do deeds of the people of the Fire, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of Paradise, so that he enters it.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2137, Book 32, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"What role does an angel play in the development of a human being according to Islamic belief?","id":"tirmidhi-32-30"},{"hadith-eng":"\"Every child is born upon the Millah, then his parents make him a Jew, a Christian, or an idolater.\" It was said: \"O Messenger of Allah! What about those  who die before that?\" He said: \"Allah knows best what they would have done.\"\n\n[Another chain) with similar in \nmeaning, and he said: \"Born \nupon the Fiirah.\"","reference":"Jami` at-Tirmidhi 2138, Book 32, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do parents influence the religious beliefs of their children according to Islamic teachings?","id":"tirmidhi-32-31"},{"hadith-eng":"\"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"","reference":"Jami` at-Tirmidhi 2139, Book 32, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can righteousness impact a person's lifespan?","id":"tirmidhi-32-32"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) would often say: Ya Muqallibal-qulub, thabbit qalbi 'ala dinik('O Changer of the Hearts! Strengthen my heart upon Your Religion.)' So I said: 'O Prophet of Allah! We believe in you and what you have come with, but do you fear for us?' He said:\n'Yes. Indeed the hearts are between two Fingers of Allah's Fingers, He changes them as He wills.'\"","reference":"Jami` at-Tirmidhi 2140, Book 32, Hadith 8","grade":"","question #":"question #2","question":"Why is the concept of the heart's changeability important in understanding faith in Islam?","id":"tirmidhi-32-33"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) came out to us with two books in hand. And he said:\n'Do you know what these two books are?' We said: 'No, O Messenger of Allah ! Unless you inform us.' He said about the one that was in his right hand: 'This is a book from the Lord of the worlds, in it are the names of the people of Paradise, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' Then he said about the one that was in his left: 'This is a book from the Lord of the worlds, in it are the names of the people of Fire, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' The companions said: 'So why work O Messenger of Allah! Since the matter is already decided (and over)?' He said: 'Seek to do what is right and draw nearer, for indeed the inhabitant of Paradise, shall have his work sealed off with the deeds of the people of Paradise, whichever deeds he did. And indeed the inhabitant of Fire, shall have his work sealed off with the deeds of the people of Fire, whichever deeds he did.' Then the Messenger of Allah motioned with his hands, casting them down and said: 'Your Lord finished with the slaves, a group in Paradise, and a group in the Blazing Fire.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2141, Book 32, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of predestination relate to human actions and their ultimate fate according to Islamic teachings?","id":"tirmidhi-32-34"},{"hadith-eng":"\"When  Allah wants good for a slave, He puts him in action.\" It was said: \"How does he put him in action O Messenger Of Allah?\" He said: \"By making him meet up with the righteous deeds before death.\"","reference":"Jami` at-Tirmidhi 2142, Book 32, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can meeting up with righteous deeds before death be interpreted as a sign of divine favor?","id":"tirmidhi-32-35"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) stood among us and said:\n'One thing does not infect another.' So a Bedouin said: 'O Messenger of Allah! If a camel gets mangy glands and we leave it at the resting place of camels, then all of the camels get mange?' The Messenger of Allah (s.a.w) said: 'Who caused the first to get mange? There is no 'Adwa nor safar. Allah created every soul, so he wrote its life, its provision, and its afflictions.'\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Jami` at-Tirmidhi 2143, Book 32, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view superstitions related to disease transmission and afflictions?","id":"tirmidhi-32-36"},{"hadith-eng":"'A slave  (of Allah) shall not believe until he believes in Al-Qadar, its good and its bad, such that he knows that what struck him would not have missed him, and that what missed him would not have struck him.\"","reference":"Jami` at-Tirmidhi 2144, Book 32, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does belief in predestination affect a person's faith?","id":"tirmidhi-32-37"},{"hadith-eng":"'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2145, 2145, Book 32, Hadith 13","grade":"Hasan,(Darussalam)","question #":"question #2","question":"Why is the testimony of faith important in Islamic belief?","id":"tirmidhi-32-38"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2146, 2298, Book 32, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of a person's needs being tied to a specific land in the context of their death?","id":"tirmidhi-32-39"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\" Or, he said: \"In it.\"","reference":"Jami` at-Tirmidhi 2147, Book 32, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of a person's needs being tied to a specific land in the context of their death?","id":"tirmidhi-32-40"},{"hadith-eng":"\"O Messenger of Allah! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves with prevent anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2148, Book 32, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of Ruqyah fit within the framework of divine destiny?","id":"tirmidhi-32-41"},{"hadith-eng":"\"There are two groups in my Ummah for whom there is no share in Islam: The Murji'ah and the Qadariyyah.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2149, Book 32, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #2","question":"Who are the Qadariyyah and what are their beliefs that exclude them from having a share in Islam?","id":"tirmidhi-32-42"},{"hadith-eng":"'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"","reference":"Jami` at-Tirmidhi 2150, Book 32, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of decrepitude relate to the human experience according to Islamic teachings?","id":"tirmidhi-32-43"},{"hadith-eng":"'From (the signs of) the son of Adam's prosperity, is his satisfaction with what Allah decreed for him, and from the son of Adam's misery is his avoiding to request guidance from Allah, and from the son of Adam's misery is his anger with what Allah decreed for him.\"","reference":"Jami` at-Tirmidhi 2151, Book 32, Hadith 19","grade":"","question #":"question #2","question":"How does satisfaction with divine decree relate to a person's well-being?","id":"tirmidhi-32-44"},{"hadith-eng":"\"So-and-so conveys his Salam to you.\" So he said: \"It has been conveyed to me that he has innovated, so if he has indeed innovated, then do not convey my Salam to him, for I heard the Messenger of Allah (s.a.w) saying: 'In this Ummah' or: 'In my Ummah'\" - the doubt was his - \"a collapse of the earth, or a transformation, or stones shall rain upon the people of Al-Qadr.'\"","reference":"Jami` at-Tirmidhi 2152, Book 32, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should one respond to someone who has innovated in religious matters?","id":"tirmidhi-32-45"},{"hadith-eng":"\"There will be a collapse of the earth and transformation in my Ummah, and that is for those who deny Al-Qadar.\"","reference":"Jami` at-Tirmidhi 2153, Book 32, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #2","question":"What does the concept of Al-Qadar signify in Islamic belief?","id":"tirmidhi-32-46"},{"hadith-eng":"\" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"","reference":"Jami` at-Tirmidhi 2154, Book 32, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is denying Allah's Qadar viewed in this narration?","id":"tirmidhi-32-47"},{"hadith-eng":"\"I arrived in Makkah and met 'Ata bin Abi Rabah. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book. Verily, We have  made it a Qur'an in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of 'Ubadah bin As-Samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar- all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write.' It said : 'What shall I write?' He said : 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"","reference":"Jami` at-Tirmidhi 2155, Book 32, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Quran describe its own origin and purpose according to this narration?","id":"tirmidhi-32-48"},{"hadith-eng":"\"Allah decreed the measures fifty-thousand years before He created the Heavens and the earth.\"","reference":"Jami` at-Tirmidhi 2156, Book 32, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of predestination relate to the creation of the universe in Islamic belief?","id":"tirmidhi-32-49"},{"hadith-eng":"\"Idolaters from the Quraish came to the Messenger of Allah (s.a.w) quarreling about Al-Qadar. So this Ayah was revealed:\n\"The day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell.\" Verily we have created all things with Qadar.","reference":"Jami` at-Tirmidhi 2157, Book 32, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of Al-Qadar relate to the consequences faced by disbelievers in the Hereafter?","id":"tirmidhi-32-50"},{"hadith-eng":"\"The Messenger of Allah(s.a.w) came out to us while we were discussing about Al-Qadar. He became angry such that his face became red, as if a pomegranate  was bursting through his cheeks. He said: 'Is this what I ordered you to do?' - or: 'Is this what I have been sent to you with? The people before you were only ruined when they differed about this matter. I order you [I order you] to not debate about it.'\". (Daif))","reference":"Jami` at-Tirmidhi 2133, Book 32, Hadith 1","grade":"","question #":"question #3","question":"What can lead to the ruin of previous communities according to Islamic teachings?","id":"tirmidhi-32-51"},{"hadith-eng":"\"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"","reference":"Jami` at-Tirmidhi 2134, Book 32, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the interaction between Adam and Musa regarding the nature of blame and responsibility?","id":"tirmidhi-32-52"},{"hadith-eng":"' I heard Salim bin 'Abdullah narrating a Hadith from his father who said: \"'Umar said :\n\"O Messenger of Allah! Do you see that what we do is a new matter- or a matter initiated – or it is a matter already concluded?” He (s.a.w)  said: “ O Ibn Al-Khattab! It is a matter already concluded. For everyone is suited (for that for which he is created). As for one who is among the people of happiness, then he works for happiness, and as for the one who is among the people of misery, then he works for his misery.” (Hasan)","reference":"Jami` at-Tirmidhi 2135, Book 32, Hadith 3","grade":"","question #":"question #3","question":"What is the significance of understanding whether actions are newly initiated or already concluded in Islamic theology?","id":"tirmidhi-32-53"},{"hadith-eng":"\"We were with the Messenger of Allah (s.a.w) and he was scraping the ground, when he raised his head to the heavens, then said:\n'There is not one of you but (his place) is known' – Waki said: 'His place has been decreed (be it) in the Fire, and (or) his place in Paradise.' They said: 'Shall we not rely upon this O Messenger of Allah?' He said: 'No. Work, for everyone is facilitated for what he was created.'”(Sahih)","reference":"Jami` at-Tirmidhi 2136, Book 32, Hadith 4","grade":"","question #":"question #3","question":"What is the significance of the Prophet's advice to continue working despite the knowledge of predestination?","id":"tirmidhi-32-54"},{"hadith-eng":"The Messenger of Allah (s.a.w) narrated to us - and he is the truthful and entrusted one:\n'Indeed the creation of one of you is gathered inside his mother in forty days. Then, for a similar period, he is a clot. Then, for a similar period, he is a piece of flesh. Then Allah sends the angel to him to blow the soul into him, and he is ordered to write four (things): To write his provision, his life-span, his works, and whether he will be wretched or happy. By the One besides Whom there is none other worthy of worship! One of you will do deeds of the people of Paradise, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of the Fire, so that he enters it. And indeed one of you will do deeds of the people of the Fire, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of Paradise, so that he enters it.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2137, Book 32, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the four things that are written for a person before birth in Islamic tradition?","id":"tirmidhi-32-55"},{"hadith-eng":"\"Every child is born upon the Millah, then his parents make him a Jew, a Christian, or an idolater.\" It was said: \"O Messenger of Allah! What about those  who die before that?\" He said: \"Allah knows best what they would have done.\"\n\n[Another chain) with similar in \nmeaning, and he said: \"Born \nupon the Fiirah.\"","reference":"Jami` at-Tirmidhi 2138, Book 32, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the term 'Millah' or 'Fitrah' in the context of a child's birth?","id":"tirmidhi-32-56"},{"hadith-eng":"\"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"","reference":"Jami` at-Tirmidhi 2139, Book 32, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the benefits of engaging in righteous deeds according to Islamic teachings?","id":"tirmidhi-32-57"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) would often say: Ya Muqallibal-qulub, thabbit qalbi 'ala dinik('O Changer of the Hearts! Strengthen my heart upon Your Religion.)' So I said: 'O Prophet of Allah! We believe in you and what you have come with, but do you fear for us?' He said:\n'Yes. Indeed the hearts are between two Fingers of Allah's Fingers, He changes them as He wills.'\"","reference":"Jami` at-Tirmidhi 2140, Book 32, Hadith 8","grade":"","question #":"question #3","question":"How does the belief in Allah's control over hearts influence a Muslim's spiritual life?","id":"tirmidhi-32-58"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) came out to us with two books in hand. And he said:\n'Do you know what these two books are?' We said: 'No, O Messenger of Allah ! Unless you inform us.' He said about the one that was in his right hand: 'This is a book from the Lord of the worlds, in it are the names of the people of Paradise, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' Then he said about the one that was in his left: 'This is a book from the Lord of the worlds, in it are the names of the people of Fire, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' The companions said: 'So why work O Messenger of Allah! Since the matter is already decided (and over)?' He said: 'Seek to do what is right and draw nearer, for indeed the inhabitant of Paradise, shall have his work sealed off with the deeds of the people of Paradise, whichever deeds he did. And indeed the inhabitant of Fire, shall have his work sealed off with the deeds of the people of Fire, whichever deeds he did.' Then the Messenger of Allah motioned with his hands, casting them down and said: 'Your Lord finished with the slaves, a group in Paradise, and a group in the Blazing Fire.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2141, Book 32, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the importance of striving for righteousness despite the belief in predestination?","id":"tirmidhi-32-59"},{"hadith-eng":"\"When  Allah wants good for a slave, He puts him in action.\" It was said: \"How does he put him in action O Messenger Of Allah?\" He said: \"By making him meet up with the righteous deeds before death.\"","reference":"Jami` at-Tirmidhi 2142, Book 32, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of righteous deeds in the life of a believer according to Islamic teachings?","id":"tirmidhi-32-60"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) stood among us and said:\n'One thing does not infect another.' So a Bedouin said: 'O Messenger of Allah! If a camel gets mangy glands and we leave it at the resting place of camels, then all of the camels get mange?' The Messenger of Allah (s.a.w) said: 'Who caused the first to get mange? There is no 'Adwa nor safar. Allah created every soul, so he wrote its life, its provision, and its afflictions.'\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Jami` at-Tirmidhi 2143, Book 32, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does Islamic teaching say about the control of life, provision, and afflictions?","id":"tirmidhi-32-61"},{"hadith-eng":"'A slave  (of Allah) shall not believe until he believes in Al-Qadar, its good and its bad, such that he knows that what struck him would not have missed him, and that what missed him would not have struck him.\"","reference":"Jami` at-Tirmidhi 2144, Book 32, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the relationship between belief in Al-Qadar and understanding life's events?","id":"tirmidhi-32-62"},{"hadith-eng":"'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2145, 2145, Book 32, Hadith 13","grade":"Hasan,(Darussalam)","question #":"question #3","question":"What is the significance of believing in the Prophethood of Muhammad in Islam?","id":"tirmidhi-32-63"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2146, 2298, Book 32, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of predestination relate to the place of a person's death in Islam?","id":"tirmidhi-32-64"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\" Or, he said: \"In it.\"","reference":"Jami` at-Tirmidhi 2147, Book 32, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of predestination relate to the location of a person's death in Islam?","id":"tirmidhi-32-65"},{"hadith-eng":"\"O Messenger of Allah! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves with prevent anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2148, Book 32, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on seeking protection through Ruqyah and treatments?","id":"tirmidhi-32-66"},{"hadith-eng":"\"There are two groups in my Ummah for whom there is no share in Islam: The Murji'ah and the Qadariyyah.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2149, Book 32, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does it mean for a group to have no share in Islam according to Islamic teachings?","id":"tirmidhi-32-67"},{"hadith-eng":"'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"","reference":"Jami` at-Tirmidhi 2150, Book 32, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of understanding calamities in the context of human existence?","id":"tirmidhi-32-68"},{"hadith-eng":"'From (the signs of) the son of Adam's prosperity, is his satisfaction with what Allah decreed for him, and from the son of Adam's misery is his avoiding to request guidance from Allah, and from the son of Adam's misery is his anger with what Allah decreed for him.\"","reference":"Jami` at-Tirmidhi 2151, Book 32, Hadith 19","grade":"","question #":"question #3","question":"What are the consequences of not seeking guidance from Allah in one's life?","id":"tirmidhi-32-69"},{"hadith-eng":"\"So-and-so conveys his Salam to you.\" So he said: \"It has been conveyed to me that he has innovated, so if he has indeed innovated, then do not convey my Salam to him, for I heard the Messenger of Allah (s.a.w) saying: 'In this Ummah' or: 'In my Ummah'\" - the doubt was his - \"a collapse of the earth, or a transformation, or stones shall rain upon the people of Al-Qadr.'\"","reference":"Jami` at-Tirmidhi 2152, Book 32, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences mentioned for the people of Al-Qadr in the hadith?","id":"tirmidhi-32-70"},{"hadith-eng":"\"There will be a collapse of the earth and transformation in my Ummah, and that is for those who deny Al-Qadar.\"","reference":"Jami` at-Tirmidhi 2153, Book 32, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the denial of Al-Qadar affect the Ummah according to Islamic teachings?","id":"tirmidhi-32-71"},{"hadith-eng":"\" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"","reference":"Jami` at-Tirmidhi 2154, Book 32, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of ruling with justice according to this narration?","id":"tirmidhi-32-72"},{"hadith-eng":"\"I arrived in Makkah and met 'Ata bin Abi Rabah. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book. Verily, We have  made it a Qur'an in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of 'Ubadah bin As-Samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar- all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write.' It said : 'What shall I write?' He said : 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"","reference":"Jami` at-Tirmidhi 2155, Book 32, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #3","question":"What advice did Al-Walid receive from his father regarding faith and Taqwa?","id":"tirmidhi-32-73"},{"hadith-eng":"\"Allah decreed the measures fifty-thousand years before He created the Heavens and the earth.\"","reference":"Jami` at-Tirmidhi 2156, Book 32, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the timeline of Allah's decree in relation to the creation of the heavens and the earth?","id":"tirmidhi-32-74"},{"hadith-eng":"\"Idolaters from the Quraish came to the Messenger of Allah (s.a.w) quarreling about Al-Qadar. So this Ayah was revealed:\n\"The day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell.\" Verily we have created all things with Qadar.","reference":"Jami` at-Tirmidhi 2157, Book 32, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the reaction of the Quraish idolaters towards the concept of Al-Qadar?","id":"tirmidhi-32-75"},{"hadith-eng":"\"The Messenger of Allah(s.a.w) came out to us while we were discussing about Al-Qadar. He became angry such that his face became red, as if a pomegranate  was bursting through his cheeks. He said: 'Is this what I ordered you to do?' - or: 'Is this what I have been sent to you with? The people before you were only ruined when they differed about this matter. I order you [I order you] to not debate about it.'\". (Daif))","reference":"Jami` at-Tirmidhi 2133, Book 32, Hadith 1","grade":"","question #":"question #4","question":"Why is it important to adhere to the teachings and commands of the Prophet Muhammad (peace be upon him)?","id":"tirmidhi-32-76"},{"hadith-eng":"\"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"","reference":"Jami` at-Tirmidhi 2134, Book 32, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the hadith illustrate the relationship between free will and divine will?","id":"tirmidhi-32-77"},{"hadith-eng":"' I heard Salim bin 'Abdullah narrating a Hadith from his father who said: \"'Umar said :\n\"O Messenger of Allah! Do you see that what we do is a new matter- or a matter initiated – or it is a matter already concluded?” He (s.a.w)  said: “ O Ibn Al-Khattab! It is a matter already concluded. For everyone is suited (for that for which he is created). As for one who is among the people of happiness, then he works for happiness, and as for the one who is among the people of misery, then he works for his misery.” (Hasan)","reference":"Jami` at-Tirmidhi 2135, Book 32, Hadith 3","grade":"","question #":"question #4","question":"How does the hadith address the relationship between one's destiny and their deeds?","id":"tirmidhi-32-78"},{"hadith-eng":"\"We were with the Messenger of Allah (s.a.w) and he was scraping the ground, when he raised his head to the heavens, then said:\n'There is not one of you but (his place) is known' – Waki said: 'His place has been decreed (be it) in the Fire, and (or) his place in Paradise.' They said: 'Shall we not rely upon this O Messenger of Allah?' He said: 'No. Work, for everyone is facilitated for what he was created.'”(Sahih)","reference":"Jami` at-Tirmidhi 2136, Book 32, Hadith 4","grade":"","question #":"question #4","question":"How does this narration address the balance between reliance on divine decree and personal responsibility?","id":"tirmidhi-32-79"},{"hadith-eng":"The Messenger of Allah (s.a.w) narrated to us - and he is the truthful and entrusted one:\n'Indeed the creation of one of you is gathered inside his mother in forty days. Then, for a similar period, he is a clot. Then, for a similar period, he is a piece of flesh. Then Allah sends the angel to him to blow the soul into him, and he is ordered to write four (things): To write his provision, his life-span, his works, and whether he will be wretched or happy. By the One besides Whom there is none other worthy of worship! One of you will do deeds of the people of Paradise, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of the Fire, so that he enters it. And indeed one of you will do deeds of the people of the Fire, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of Paradise, so that he enters it.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2137, Book 32, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of predestination relate to a person's actions and ultimate fate in Islam?","id":"tirmidhi-32-80"},{"hadith-eng":"\"Every child is born upon the Millah, then his parents make him a Jew, a Christian, or an idolater.\" It was said: \"O Messenger of Allah! What about those  who die before that?\" He said: \"Allah knows best what they would have done.\"\n\n[Another chain) with similar in \nmeaning, and he said: \"Born \nupon the Fiirah.\"","reference":"Jami` at-Tirmidhi 2138, Book 32, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam address the fate of children who die before reaching an age of religious accountability?","id":"tirmidhi-32-81"},{"hadith-eng":"\"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"","reference":"Jami` at-Tirmidhi 2139, Book 32, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #4","question":"In what ways can a believer actively seek to alter their destiny through Islamic practices?","id":"tirmidhi-32-82"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) would often say: Ya Muqallibal-qulub, thabbit qalbi 'ala dinik('O Changer of the Hearts! Strengthen my heart upon Your Religion.)' So I said: 'O Prophet of Allah! We believe in you and what you have come with, but do you fear for us?' He said:\n'Yes. Indeed the hearts are between two Fingers of Allah's Fingers, He changes them as He wills.'\"","reference":"Jami` at-Tirmidhi 2140, Book 32, Hadith 8","grade":"","question #":"question #4","question":"What does the Prophet's concern for his followers' faith indicate about the nature of belief in Islam?","id":"tirmidhi-32-83"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) came out to us with two books in hand. And he said:\n'Do you know what these two books are?' We said: 'No, O Messenger of Allah ! Unless you inform us.' He said about the one that was in his right hand: 'This is a book from the Lord of the worlds, in it are the names of the people of Paradise, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' Then he said about the one that was in his left: 'This is a book from the Lord of the worlds, in it are the names of the people of Fire, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' The companions said: 'So why work O Messenger of Allah! Since the matter is already decided (and over)?' He said: 'Seek to do what is right and draw nearer, for indeed the inhabitant of Paradise, shall have his work sealed off with the deeds of the people of Paradise, whichever deeds he did. And indeed the inhabitant of Fire, shall have his work sealed off with the deeds of the people of Fire, whichever deeds he did.' Then the Messenger of Allah motioned with his hands, casting them down and said: 'Your Lord finished with the slaves, a group in Paradise, and a group in the Blazing Fire.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2141, Book 32, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the sealing of one's deeds with the actions of either the people of Paradise or the people of Fire affect their final abode?","id":"tirmidhi-32-84"},{"hadith-eng":"\"When  Allah wants good for a slave, He puts him in action.\" It was said: \"How does he put him in action O Messenger Of Allah?\" He said: \"By making him meet up with the righteous deeds before death.\"","reference":"Jami` at-Tirmidhi 2142, Book 32, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of divine guidance relate to a person's ability to perform good deeds?","id":"tirmidhi-32-85"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) stood among us and said:\n'One thing does not infect another.' So a Bedouin said: 'O Messenger of Allah! If a camel gets mangy glands and we leave it at the resting place of camels, then all of the camels get mange?' The Messenger of Allah (s.a.w) said: 'Who caused the first to get mange? There is no 'Adwa nor safar. Allah created every soul, so he wrote its life, its provision, and its afflictions.'\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Jami` at-Tirmidhi 2143, Book 32, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of divine decree relate to health and illness in Islam?","id":"tirmidhi-32-86"},{"hadith-eng":"'A slave  (of Allah) shall not believe until he believes in Al-Qadar, its good and its bad, such that he knows that what struck him would not have missed him, and that what missed him would not have struck him.\"","reference":"Jami` at-Tirmidhi 2144, Book 32, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important for a believer to accept both the good and bad aspects of destiny?","id":"tirmidhi-32-87"},{"hadith-eng":"'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2145, 2145, Book 32, Hadith 13","grade":"Hasan,(Darussalam)","question #":"question #4","question":"How does belief in death and resurrection influence a Muslim's faith?","id":"tirmidhi-32-88"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2146, 2298, Book 32, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does necessity or need play in determining the location of a person's death according to Islamic belief?","id":"tirmidhi-32-89"},{"hadith-eng":"\"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\" Or, he said: \"In it.\"","reference":"Jami` at-Tirmidhi 2147, Book 32, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does necessity or need play in determining where a person will die according to Islamic belief?","id":"tirmidhi-32-90"},{"hadith-eng":"\"O Messenger of Allah! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves with prevent anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2148, Book 32, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does belief in Allah's Decree influence the use of medical treatments and protective measures?","id":"tirmidhi-32-91"},{"hadith-eng":"\"There are two groups in my Ummah for whom there is no share in Islam: The Murji'ah and the Qadariyyah.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2149, Book 32, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #4","question":"How do different Islamic sects and beliefs impact one's standing in Islam?","id":"tirmidhi-32-92"},{"hadith-eng":"'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"","reference":"Jami` at-Tirmidhi 2150, Book 32, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #4","question":"How can one find solace or understanding in the face of life's inevitable difficulties as described in Islamic teachings?","id":"tirmidhi-32-93"},{"hadith-eng":"'From (the signs of) the son of Adam's prosperity, is his satisfaction with what Allah decreed for him, and from the son of Adam's misery is his avoiding to request guidance from Allah, and from the son of Adam's misery is his anger with what Allah decreed for him.\"","reference":"Jami` at-Tirmidhi 2151, Book 32, Hadith 19","grade":"","question #":"question #4","question":"How does anger towards divine decree affect a person's spiritual state?","id":"tirmidhi-32-94"},{"hadith-eng":"\"So-and-so conveys his Salam to you.\" So he said: \"It has been conveyed to me that he has innovated, so if he has indeed innovated, then do not convey my Salam to him, for I heard the Messenger of Allah (s.a.w) saying: 'In this Ummah' or: 'In my Ummah'\" - the doubt was his - \"a collapse of the earth, or a transformation, or stones shall rain upon the people of Al-Qadr.'\"","reference":"Jami` at-Tirmidhi 2152, Book 32, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the hadith imply about the acceptance of innovations in Islam?","id":"tirmidhi-32-95"},{"hadith-eng":"\"There will be a collapse of the earth and transformation in my Ummah, and that is for those who deny Al-Qadar.\"","reference":"Jami` at-Tirmidhi 2153, Book 32, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the signs of transformation and collapse mentioned in relation to the denial of Al-Qadar?","id":"tirmidhi-32-96"},{"hadith-eng":"\" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"","reference":"Jami` at-Tirmidhi 2154, Book 32, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of legalizing what Allah has forbidden?","id":"tirmidhi-32-97"},{"hadith-eng":"\"I arrived in Makkah and met 'Ata bin Abi Rabah. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book. Verily, We have  made it a Qur'an in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of 'Ubadah bin As-Samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar- all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write.' It said : 'What shall I write?' He said : 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"","reference":"Jami` at-Tirmidhi 2155, Book 32, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the Pen play in the creation according to Islamic teachings?","id":"tirmidhi-32-98"},{"hadith-eng":"\"Allah decreed the measures fifty-thousand years before He created the Heavens and the earth.\"","reference":"Jami` at-Tirmidhi 2156, Book 32, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the belief in divine measures affect a Muslim's understanding of fate and destiny?","id":"tirmidhi-32-99"},{"hadith-eng":"\"Idolaters from the Quraish came to the Messenger of Allah (s.a.w) quarreling about Al-Qadar. So this Ayah was revealed:\n\"The day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell.\" Verily we have created all things with Qadar.","reference":"Jami` at-Tirmidhi 2157, Book 32, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Quran address disputes regarding predestination and divine decree?","id":"tirmidhi-32-100"},{"hadith-eng":"\"The Messenger of Allah(s.a.w) came out to us while we were discussing about Al-Qadar. He became angry such that his face became red, as if a pomegranate  was bursting through his cheeks. He said: 'Is this what I ordered you to do?' - or: 'Is this what I have been sent to you with? The people before you were only ruined when they differed about this matter. I order you [I order you] to not debate about it.'\". (Daif))","reference":"Jami` at-Tirmidhi 2133, Book 32, Hadith 1","grade":"","question #":"question #5","question":"What are the potential consequences of differing on matters of faith in Islam?","id":"tirmidhi-32-101"},{"hadith-eng":"\"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"","reference":"Jami` at-Tirmidhi 2134, Book 32, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the conversation between Adam and Musa teach about the attributes of Allah, such as His knowledge and will?","id":"tirmidhi-32-102"},{"hadith-eng":"' I heard Salim bin 'Abdullah narrating a Hadith from his father who said: \"'Umar said :\n\"O Messenger of Allah! Do you see that what we do is a new matter- or a matter initiated – or it is a matter already concluded?” He (s.a.w)  said: “ O Ibn Al-Khattab! It is a matter already concluded. For everyone is suited (for that for which he is created). As for one who is among the people of happiness, then he works for happiness, and as for the one who is among the people of misery, then he works for his misery.” (Hasan)","reference":"Jami` at-Tirmidhi 2135, Book 32, Hadith 3","grade":"","question #":"question #5","question":"What role does divine decree play in determining a person's ultimate fate according to Islamic teachings?","id":"tirmidhi-32-103"},{"hadith-eng":"\"We were with the Messenger of Allah (s.a.w) and he was scraping the ground, when he raised his head to the heavens, then said:\n'There is not one of you but (his place) is known' – Waki said: 'His place has been decreed (be it) in the Fire, and (or) his place in Paradise.' They said: 'Shall we not rely upon this O Messenger of Allah?' He said: 'No. Work, for everyone is facilitated for what he was created.'”(Sahih)","reference":"Jami` at-Tirmidhi 2136, Book 32, Hadith 4","grade":"","question #":"question #5","question":"What does it mean that everyone is facilitated for what they were created for?","id":"tirmidhi-32-104"},{"hadith-eng":"The Messenger of Allah (s.a.w) narrated to us - and he is the truthful and entrusted one:\n'Indeed the creation of one of you is gathered inside his mother in forty days. Then, for a similar period, he is a clot. Then, for a similar period, he is a piece of flesh. Then Allah sends the angel to him to blow the soul into him, and he is ordered to write four (things): To write his provision, his life-span, his works, and whether he will be wretched or happy. By the One besides Whom there is none other worthy of worship! One of you will do deeds of the people of Paradise, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of the Fire, so that he enters it. And indeed one of you will do deeds of the people of the Fire, until there is between him and it but a forearm span, then he is overcome by what is written for him, and he is sealed off with the deeds of the people of Paradise, so that he enters it.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2137, Book 32, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does Islamic teaching say about the unpredictability of a person's final deeds and their impact on their afterlife?","id":"tirmidhi-32-105"},{"hadith-eng":"\"Every child is born upon the Millah, then his parents make him a Jew, a Christian, or an idolater.\" It was said: \"O Messenger of Allah! What about those  who die before that?\" He said: \"Allah knows best what they would have done.\"\n\n[Another chain) with similar in \nmeaning, and he said: \"Born \nupon the Fiirah.\"","reference":"Jami` at-Tirmidhi 2138, Book 32, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration imply about the role of divine knowledge in determining a person's actions?","id":"tirmidhi-32-106"},{"hadith-eng":"\"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"","reference":"Jami` at-Tirmidhi 2139, Book 32, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic tradition view the relationship between prayer and divine will?","id":"tirmidhi-32-107"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) would often say: Ya Muqallibal-qulub, thabbit qalbi 'ala dinik('O Changer of the Hearts! Strengthen my heart upon Your Religion.)' So I said: 'O Prophet of Allah! We believe in you and what you have come with, but do you fear for us?' He said:\n'Yes. Indeed the hearts are between two Fingers of Allah's Fingers, He changes them as He wills.'\"","reference":"Jami` at-Tirmidhi 2140, Book 32, Hadith 8","grade":"","question #":"question #5","question":"How does the metaphor of hearts being between Allah's Fingers illustrate divine power and human vulnerability?","id":"tirmidhi-32-108"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) came out to us with two books in hand. And he said:\n'Do you know what these two books are?' We said: 'No, O Messenger of Allah ! Unless you inform us.' He said about the one that was in his right hand: 'This is a book from the Lord of the worlds, in it are the names of the people of Paradise, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' Then he said about the one that was in his left: 'This is a book from the Lord of the worlds, in it are the names of the people of Fire, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' The companions said: 'So why work O Messenger of Allah! Since the matter is already decided (and over)?' He said: 'Seek to do what is right and draw nearer, for indeed the inhabitant of Paradise, shall have his work sealed off with the deeds of the people of Paradise, whichever deeds he did. And indeed the inhabitant of Fire, shall have his work sealed off with the deeds of the people of Fire, whichever deeds he did.' Then the Messenger of Allah motioned with his hands, casting them down and said: 'Your Lord finished with the slaves, a group in Paradise, and a group in the Blazing Fire.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2141, Book 32, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the hadith imply about the role of divine knowledge in determining the fate of individuals?","id":"tirmidhi-32-109"},{"hadith-eng":"\"When  Allah wants good for a slave, He puts him in action.\" It was said: \"How does he put him in action O Messenger Of Allah?\" He said: \"By making him meet up with the righteous deeds before death.\"","reference":"Jami` at-Tirmidhi 2142, Book 32, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does timing play in the performance of righteous deeds in Islam?","id":"tirmidhi-32-110"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) stood among us and said:\n'One thing does not infect another.' So a Bedouin said: 'O Messenger of Allah! If a camel gets mangy glands and we leave it at the resting place of camels, then all of the camels get mange?' The Messenger of Allah (s.a.w) said: 'Who caused the first to get mange? There is no 'Adwa nor safar. Allah created every soul, so he wrote its life, its provision, and its afflictions.'\"Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.","reference":"Jami` at-Tirmidhi 2143, Book 32, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of questioning the cause of the first instance of a disease in Islamic teachings?","id":"tirmidhi-32-111"},{"hadith-eng":"'A slave  (of Allah) shall not believe until he believes in Al-Qadar, its good and its bad, such that he knows that what struck him would not have missed him, and that what missed him would not have struck him.\"","reference":"Jami` at-Tirmidhi 2144, Book 32, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does belief in Al-Qadar influence a person's reaction to life's challenges?","id":"tirmidhi-32-112"},{"hadith-eng":"'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2145, 2145, Book 32, Hadith 13","grade":"Hasan,(Darussalam)","question #":"question #5","question":"What is the role of belief in Al-Qadar (Divine Decree) in a Muslim's faith?","id":"tirmidhi-32-113"},{"hadith-eng":"\"O Messenger of Allah! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves with prevent anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2148, Book 32, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of acknowledging that treatments and Ruqyah are part of Allah's Decree?","id":"tirmidhi-32-114"},{"hadith-eng":"\"There are two groups in my Ummah for whom there is no share in Islam: The Murji'ah and the Qadariyyah.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2149, Book 32, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of being part of a group that is considered to have no share in Islam?","id":"tirmidhi-32-115"},{"hadith-eng":"'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"","reference":"Jami` at-Tirmidhi 2150, Book 32, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #5","question":"What lessons can be drawn about the transient nature of life from this narration?","id":"tirmidhi-32-116"},{"hadith-eng":"'From (the signs of) the son of Adam's prosperity, is his satisfaction with what Allah decreed for him, and from the son of Adam's misery is his avoiding to request guidance from Allah, and from the son of Adam's misery is his anger with what Allah decreed for him.\"","reference":"Jami` at-Tirmidhi 2151, Book 32, Hadith 19","grade":"","question #":"question #5","question":"What role does acceptance of Allah's will play in a person's happiness?","id":"tirmidhi-32-117"},{"hadith-eng":"\"So-and-so conveys his Salam to you.\" So he said: \"It has been conveyed to me that he has innovated, so if he has indeed innovated, then do not convey my Salam to him, for I heard the Messenger of Allah (s.a.w) saying: 'In this Ummah' or: 'In my Ummah'\" - the doubt was his - \"a collapse of the earth, or a transformation, or stones shall rain upon the people of Al-Qadr.'\"","reference":"Jami` at-Tirmidhi 2152, Book 32, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the potential signs of divine punishment mentioned in the hadith?","id":"tirmidhi-32-118"},{"hadith-eng":"\"There will be a collapse of the earth and transformation in my Ummah, and that is for those who deny Al-Qadar.\"","reference":"Jami` at-Tirmidhi 2153, Book 32, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #5","question":"Why is belief in Al-Qadar considered important in Islam?","id":"tirmidhi-32-119"},{"hadith-eng":"\" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"","reference":"Jami` at-Tirmidhi 2154, Book 32, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #5","question":"How is abandoning the Sunnah of the Prophet regarded in this narration?","id":"tirmidhi-32-120"},{"hadith-eng":"\"I arrived in Makkah and met 'Ata bin Abi Rabah. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book. Verily, We have  made it a Qur'an in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of 'Ubadah bin As-Samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar- all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write.' It said : 'What shall I write?' He said : 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"","reference":"Jami` at-Tirmidhi 2155, Book 32, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the concept of predestination explained in Islamic theology?","id":"tirmidhi-32-121"},{"hadith-eng":"\"Allah decreed the measures fifty-thousand years before He created the Heavens and the earth.\"","reference":"Jami` at-Tirmidhi 2156, Book 32, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does Islamic theology say about the pre-existence of divine decrees before the creation of the world?","id":"tirmidhi-32-122"},{"hadith-eng":"\"Idolaters from the Quraish came to the Messenger of Allah (s.a.w) quarreling about Al-Qadar. So this Ayah was revealed:\n\"The day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell.\" Verily we have created all things with Qadar.","reference":"Jami` at-Tirmidhi 2157, Book 32, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the relationship between human actions and divine decree in Islamic theology?","id":"tirmidhi-32-123"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) came out to us with two books in hand. And he said:\n'Do you know what these two books are?' We said: 'No, O Messenger of Allah ! Unless you inform us.' He said about the one that was in his right hand: 'This is a book from the Lord of the worlds, in it are the names of the people of Paradise, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' Then he said about the one that was in his left: 'This is a book from the Lord of the worlds, in it are the names of the people of Fire, and the name of their fathers and their tribes. Then there is a summary at the end of them, there being no addition to them nor deduction from them forever.' The companions said: 'So why work O Messenger of Allah! Since the matter is already decided (and over)?' He said: 'Seek to do what is right and draw nearer, for indeed the inhabitant of Paradise, shall have his work sealed off with the deeds of the people of Paradise, whichever deeds he did. And indeed the inhabitant of Fire, shall have his work sealed off with the deeds of the people of Fire, whichever deeds he did.' Then the Messenger of Allah motioned with his hands, casting them down and said: 'Your Lord finished with the slaves, a group in Paradise, and a group in the Blazing Fire.'\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2141, Book 32, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #6","question":"How should Muslims understand the balance between divine decree and personal responsibility in their actions?","id":"tirmidhi-32-124"},{"hadith-eng":"\" Six are cursed, being cursed by Allah and by every Prophet that came: The one who adds to Allah's Book, the one who denies Allah's Qadar, the one who rules with tyranny by which he honors whom Allah has debased, and he dishonors whom Allah has honored, and the one who legalizes what Allah forbade, and the one from my family who legalizes what Allah forbade, and the abandoner of my Sunnah.\"","reference":"Jami` at-Tirmidhi 2154, Book 32, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #6","question":"What is the stance on members of the Prophet's family who legalize what Allah has forbidden?","id":"tirmidhi-32-125"},{"hadith-eng":"\"I arrived in Makkah and met 'Ata bin Abi Rabah. I said to him: 'O Abu Muhammad! The people of Al-Basrah speak about Al-Qadar.' He said: 'O my son! Do you recite the Quran?' I said: 'Yes.' He said: 'Then recite Az-Zukhruf to me.'\" He said: 'So I recited: Ha Mim. By the manifest Book. Verily, We have  made it a Qur'an in Arabic that you may be able to understand. And verily, it is in the Mother of Book with Us, indeed exalted, full of wisdom. Then he said: 'Do you know what Mother of Books is?' I said: 'Allah and His Messenger know better.' He said:'It is a book that Allah wrote before He created the Heavens, and before  He created the earth. In it, it is  (written): Fir'awn is among the inhabitants of the Fire, and in it is: Perish the two hands of Abu Lahab, and perish he!'Ata said: 'I met Al-Walid the son of 'Ubadah bin As-Samit the Companion of the Messenger of Allah (s.a.w) and asked him:'What was your father's admonition when he died?\" He said:\"He called me and said: 'O my son ! Have Taqwa of Allah, and know that you will never have Taqwa of Allah until you believe in Allah, and you believe in Al-Qadar- all of it-its good and its bad. If you die upon other than  this you shall  enter  the Fire. Indeed  I heard the Messenger of Allah (s.a.w)  saying: \"Verily the first of what Allah created was the Pen. So He said: 'Write.' It said : 'What shall I write?' He said : 'Write Al-Qadar, what it is , and what shall be, until  the end.'\"","reference":"Jami` at-Tirmidhi 2155, Book 32, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the importance of understanding the Quran in its original language as mentioned in the narration?","id":"tirmidhi-32-126"}]