[{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul! You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I inform you about a matter which if you do it, then you will love one another? Spread the Salam among each other.\"","reference":"Jami` at-Tirmidhi 2688, Book 42, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the relationship between belief and entering Paradise?","id":"tirmidhi-42-1"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) and said: 'As-Salamu 'Alaykum (Peace be upon you).'\" [He said:] \"So the Prophet (ﷺ) said: 'Ten.' Then another came and he said: 'As-Salamu 'Alaykum Wa Rahmatullah (Peace be upon you, and the mercy of Allah).' So the Prophet (ﷺ) said: 'Twenty.' Then another came and said: 'As-Salamu 'Alaykum Wa Rahmatullahi Wa Barakatuh (Peace be upon you, and the mercy of Allah, and His Blessings).' So the Prophet (ﷺ) said: 'Thirty.'\"","reference":"Jami` at-Tirmidhi 2689, Book 42, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of greeting others with peace in Islam?","id":"tirmidhi-42-2"},{"hadith-eng":"\"Abu Musa sought permission to enter upon 'Umar. He said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Once.' Then he was silent for some time. Then he said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: Twice.' Then he was silent for some time. Then he said: 'As-salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Three times.' Then he (Abu Musa) left. 'Umar said to the gate-keeper: 'What did he do?' He replied: 'He left.\" He said: 'Bring him to me.' So when he came, 'Umar said to him: 'What is this that you have done?' He said: 'The Sunnah.' He said: 'The Sunnah? By Allah! You had better bring me proof or a witness to clarify this, or I will do this or that to you.'\" He said \"So he came to us while we were sitting with Ansar. He said: 'O People of the Ansar! Are you not the most knowledgeable people about the Ahadith of the Messenger of Allah (ﷺ)? Did the Messenger of Allah (ﷺ) not say: \"Seeking permission is to be done three time. Either you are permitted, or other wise leave?\" The people began joking. Abu Sa'eed said: \"Then I raised my head toward him and said: \"Whatever punishment you are afflicted with because of this, then I shall be your partner in it.\" So he went to 'Umar to inform him him about it, and 'Umar said: \"I did not know about about this.\"","reference":"Jami` at-Tirmidhi 2690, Book 42, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before entering someone's space in Islamic teachings?","id":"tirmidhi-42-3"},{"hadith-eng":"that Uman bin Al-Khattab said: \"I sought permission (to enter) from the Messenger of Allah (ﷺ) three times, then he permitted me.\"","reference":"Jami` at-Tirmidhi 2691, Book 42, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before entering someone's presence in Islamic etiquette?","id":"tirmidhi-42-4"},{"hadith-eng":"\"A man enter the Masjid and performed Salat while the Messenger of Allah (ﷺ) was sitting at the back of the Masjid. Then he came to greet him, so the Prophet (ﷺ) said: \"Wa Alaikum (and upon you); go back and pray for indeed you have not prayed.'\" And he mentioned the Hadith in its entirety.","reference":"Jami` at-Tirmidhi 2692, Book 42, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions should be taken if a prayer is deemed incomplete or incorrect?","id":"tirmidhi-42-5"},{"hadith-eng":"that 'Aishah narrated to him that he Messenger of Allah (ﷺ) said to her: \"Indeeed Jibril has sent Salam to you.\" She said: \"And upon him be peace and the mercy of Allah and His Blessings.\"","reference":"Jami` at-Tirmidhi 2693, Book 42, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Jibril sending greetings to individuals in Islamic tradition?","id":"tirmidhi-42-6"},{"hadith-eng":"\"They said: 'O Messenger of Allah! When two men meet, which of them initiates the Salam?' He said: 'The nearest of them to Allah.'\"","reference":"Jami` at-Tirmidhi 2694, Book 42, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who is encouraged to initiate the greeting of Salam when two people meet?","id":"tirmidhi-42-7"},{"hadith-eng":"from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"He is not one of us who resembles other than us, no who resembles the Jews nor the Christians. For indeed greeting of the Jews is pointing the finger, and the greeting of the Christians is waving with the hand.\"","reference":"Jami` at-Tirmidhi 2695, Book 42, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of maintaining a distinct identity in Islam according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-42-8"},{"hadith-eng":"\"I was walking with Thabit Al-Bunani. He passed by some boys, so he said Salam to them. Then Thabit said: 'I was with Anas when he passed by some boys and gave the Salam to them, and Anas said: I was with the Prophet (ﷺ) when he passed by some boys and he gave the Salam to them.'\"","reference":"Jami` at-Tirmidhi 2696, Book 42, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of greeting others with Salam in Islam?","id":"tirmidhi-42-9"},{"hadith-eng":"that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.","reference":"Jami` at-Tirmidhi 2697, Book 42, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet Muhammad (ﷺ) greeting women in the mosque?","id":"tirmidhi-42-10"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"","reference":"Jami` at-Tirmidhi 2698, Book 42, Hadith 11","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of giving Salam when entering one's home?","id":"tirmidhi-42-11"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Salam is before talking.\"\nWith this chain it has been reported that the Prophet (ﷺ) said: \"Do not invite anyone to the food until the Salam is given.\"","reference":"Jami` at-Tirmidhi 2699, Book 42, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of giving Salam before engaging in conversation?","id":"tirmidhi-42-12"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one of you meets them in the path, then force them to its narrow portion.\"","reference":"Jami` at-Tirmidhi 2700, Book 42, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance is given regarding greeting people of other faiths in Islam?","id":"tirmidhi-42-13"},{"hadith-eng":"that a group of Jews entered upon the Prophet (ﷺ) and they said: \"As-Samu 'Alaik (death be upon you).\" So the Prophet (ﷺ) said: \"Wa 'Alaik (And upon you).\" So 'Aishah said: \"I said: '[Rather] upon you be death and the curse.'\" So the Prophet (ﷺ) said: \"O 'Aishah! Indeed Allah loves gentleness in every matter.\" 'Aishah said: \"Did you not hear what they said?\" He said: \"And I replied: 'And upon you.'\"","reference":"Jami` at-Tirmidhi 2701, Book 42, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"How should one respond to hostility or insults according to Islamic teachings?","id":"tirmidhi-42-14"},{"hadith-eng":"that the Prophet (ﷺ) passed by a gathering in which the Muslims and the Jews were mixed, so he gave the Salam to them.","reference":"Jami` at-Tirmidhi 2702, Book 42, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of greeting people of different faiths in Islam?","id":"tirmidhi-42-15"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"\nIbn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"","reference":"Jami` at-Tirmidhi 2703, Book 42, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the etiquette of greeting among people of different statuses or positions?","id":"tirmidhi-42-16"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The young one gives the Salam to the elder, the one passing the by to the one sitting and the few to the many.\"","reference":"Jami` at-Tirmidhi 2704, Book 42, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the etiquette of greeting in Islam between younger and older individuals?","id":"tirmidhi-42-17"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The horseman gives Salam to the walking person, the walking person to the one standing and the few to the many.\"","reference":"Jami` at-Tirmidhi 2705, Book 42, Hadith 18","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the etiquette of giving Salam in different situations according to Islamic teachings?","id":"tirmidhi-42-18"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you arrives at the gathering, then give the Salam, and if he is given a place to sit, then let him sit. Then when he stands, let him give the Salam, the first is more worthy than the last.\"","reference":"Jami` at-Tirmidhi 2706, Book 42, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of giving Salam when arriving at a gathering?","id":"tirmidhi-42-19"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2707, Book 42, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of invading someone's privacy without permission according to Islamic teachings?","id":"tirmidhi-42-20"},{"hadith-eng":"that the Prophet (ﷺ) was in his house when a man looked in at him, so he lunged towards him with an arrow head, so the man backed up.","reference":"Jami` at-Tirmidhi 2708, Book 42, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions did the Prophet (ﷺ) take when someone invaded his privacy?","id":"tirmidhi-42-21"},{"hadith-eng":"that a man peeked in on the Messenger of Allah (ﷺ), in one of the apartments of the Prophet (ﷺ), while the Prophet (ﷺ) had a Midrah (an iron comb) with which he was scratching his head. So the Prophet (ﷺ) said: \"If I knew that you were looking then I would have poked your eyes with it. Seeking permission has only been enjoined because of the sight.\"","reference":"Jami` at-Tirmidhi 2709, Book 42, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before entering someone's private space in Islam?","id":"tirmidhi-42-22"},{"hadith-eng":"that 'Amr bin 'Abdullah bin Safwan informed him, that Kaladah bin Hanbal had informed him, that Safwan bin Umayyah sent him to bring some milk, colostrum, and Daghabis (a type of herb) to the Prophet (ﷺ) while he was in the upper valley. (He said): \"I entered upon him without seeking permission nor giving Salam. The Prophet (ﷺ) said: 'Go back and say: As-Salamu Alaykum, may I enter?'\" And that was after Safwan had accepted Islam.\"","reference":"Jami` at-Tirmidhi 2710, Book 42, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before entering someone's presence in Islamic etiquette?","id":"tirmidhi-42-23"},{"hadith-eng":"\"I sought permission to enter upon the Prophet (ﷺ) regarding a debt my father owed, so he said: 'Who is this?' I said: 'Me.' He said: 'Me, me.'As if he disliked that.\"","reference":"Jami` at-Tirmidhi 2711, Book 42, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the etiquette of seeking permission to enter someone's presence from this narration?","id":"tirmidhi-42-24"},{"hadith-eng":"that the Prophet (ﷺ) prohibited them from returning to the women from a journey during the night.","reference":"Jami` at-Tirmidhi 2712, Book 42, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance did the Prophet (ﷺ) provide regarding returning home from a journey?","id":"tirmidhi-42-25"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you writes something, then let him Yutarrib (smeared with dust to dry the ink) it, for that is more conducive to the need.\"","reference":"Jami` at-Tirmidhi 2713, Book 42, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the recommended method for drying ink when writing according to Islamic teachings?","id":"tirmidhi-42-26"},{"hadith-eng":"\"I entered upon the Messenger of Allah (ﷺ) while there was a scribe in front of him, and I heard him saying: 'Put the pen on your ear, for that is more conducive to the scribe remembering.'\"","reference":"Jami` at-Tirmidhi 2714, Book 42, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #1","question":"What advice did the Prophet Muhammad (ﷺ) give to scribes to help them remember their writing tasks?","id":"tirmidhi-42-27"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered me to learn some statements from writings of the Jews for him, and he said: 'For indeed by Allah! I do no trust the Jews with my letters.'\" He said: \"Half a month did not pass before I learned it, when he (ﷺ) wanted to write to the Jews I would write it to them, and when they wrote to him I would read their letters to him.\"","reference":"Jami` at-Tirmidhi 2715, Book 42, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of learning other languages or scripts in the context of communication and diplomacy in Islam?","id":"tirmidhi-42-28"},{"hadith-eng":"\"Before he died, the Messenger of Allah (ﷺ) had written to Kisra, Ceasar, An-Najashi, and to every tyrant calling them to Allah. This An-Najashi is not the one that the Prophet (ﷺ) performed to the funeral Salat for.\"","reference":"Jami` at-Tirmidhi 2716, Book 42, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the purpose of the letters sent by the Prophet Muhammad (ﷺ) to various rulers?","id":"tirmidhi-42-29"},{"hadith-eng":"that Abu Sufyan bin Harb informed him that Hiraql had sent for him while he was with a party of the Quraish, and they were trading in Ash-Sham, so they went to him.\" And he mentioned the Hadith and said: \"Then he called for the letter of the Messenger of Allah (ﷺ) to be read, and it said in it: 'In the Name of Allah, the Merciful, the Beneficent. From Muhammad, Allah's Slave and His Messenger, to Hiraql the leader of Rome. Peace be upon whoever follows the guidance. To proceed:\"","reference":"Jami` at-Tirmidhi 2717, Book 42, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the letter sent by Prophet Muhammad to Hiraql, the leader of Rome?","id":"tirmidhi-42-30"},{"hadith-eng":"\"When the Prophet of Allah (ﷺ) wanted to write to the foreigners, it was said to him: 'The foreigners do not accept a letter unless it has a seal.' So he had a ring made.\" He said: \"It is as if I am now looking at its whiteness in his hand.\"","reference":"Jami` at-Tirmidhi 2718, Book 42, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"Why was it necessary for the Prophet Muhammad (ﷺ) to have a seal on letters sent to foreigners?","id":"tirmidhi-42-31"},{"hadith-eng":"\"Two of my companions and I went and presented ourselves to the Companions of the Prophet (ﷺ), for our hearing and sight had gone from suffering (hunger and thirst). But there was no one who would accept us. So we went to the Prophet (ﷺ) and he brought us to his family where there were three goats. The Prophet (ﷺ) said: 'Milk these.' We milked them, and each person drank his share, and we put aside a share for the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) came during the night and gave the Salam such that it would not wake the sleeping person, and the one who was awake could hear it. Then he went to the Masjid to per form Salat. Then he went for his drink and drank it.\"","reference":"Jami` at-Tirmidhi 2719, Book 42, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be learned about the Prophet's (ﷺ) hospitality and generosity from his actions towards his companions?","id":"tirmidhi-42-32"},{"hadith-eng":"that a man gave the Salam to the Prophet (ﷺ) while he was urinating, but the Prophet (ﷺ) did not return the Salam to him.\"","reference":"Jami` at-Tirmidhi 2720, Book 42, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the etiquette of giving Salam in Islam?","id":"tirmidhi-42-33"},{"hadith-eng":"from a man among his people, who said: \"I went looking for the Prophet (ﷺ) but I was not able to find him. So I sat down, and then I saw a group of people, and he was among them, but I did not recognize him. He was settling some matter between them so when he was finished, some of them stood up with him and they were saying: 'O Messenger of Allah.' When I saw that, I said: \"'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah!' He replied: 'Indeed \"'Alaikas-Salam (upon you be peace)\" is the greeting for the dead.' Then he came toward me and said: 'When a man meets his Muslim brother then he should say: \"As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh (peace be upon you, and the mercy and blessings of Allah).\" Then the Prophet (ﷺ) responded to my greeting, he said: 'And may Allah's mercy be upon you, and may Allah's mercy be upon you, and may Allah's mercy be upon you.'\"","reference":"Jami` at-Tirmidhi 2721, Book 42, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the appropriate greeting when meeting a fellow Muslim according to Islamic teachings?","id":"tirmidhi-42-34"},{"hadith-eng":"from Abu Tamimah al-Hujaimi from Jabir bin Sulaim who said: \"I went to the Prophet (ﷺ) and I said: ''Alaikas-Salam (upon you be peace)' so he replied: 'Do not say \"'Alaikas-Salam\" rather say As-Salamu Alaik.'\" And he mentioned the story in its entirety.","reference":"Jami` at-Tirmidhi 2722, Book 42, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the correct way to greet someone in Islam according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-42-35"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) would give the Salam he would do so three times, and when he would say a statement, he would say it three times.\"","reference":"Jami` at-Tirmidhi 2723, Book 42, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of repeating the Salam three times in Islamic tradition?","id":"tirmidhi-42-36"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"","reference":"Jami` at-Tirmidhi 2724, Book 42, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of greeting with Salam in Islamic gatherings?","id":"tirmidhi-42-37"},{"hadith-eng":"\"When we went to the Prophet (ﷺ), each of us would sit wherever he wound up at.\"","reference":"Jami` at-Tirmidhi 2725, Book 42, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #1","question":"What does this narration suggest about the seating arrangement when visiting the Prophet?","id":"tirmidhi-42-38"},{"hadith-eng":"\"From Abu Ishaq, from Al-Bara - and he did not hear it from him - the Messenger of Allah (ﷺ) passed by some people from the Ansar while they were sitting in the road. He said: 'If you people must do this, then return the Salam, assist the wronged, and give directions to the one who is on the route.\"","reference":"Jami` at-Tirmidhi 2726, Book 42, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the etiquettes recommended for people sitting in public places?","id":"tirmidhi-42-39"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"No two Muslims meet each other and shake hands, except that Allah forgives them before they part.\"","reference":"Jami` at-Tirmidhi 2727, Book 42, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of shaking hands between two Muslims in terms of forgiveness?","id":"tirmidhi-42-40"},{"hadith-eng":"that a man said: \"O Messenger of Allah! When a man among us meets his brother or his friend should he bow to him?\" He said: \"No.\" The man continued: \"Should he embrace him and kiss him?\" He said: \"No.\" He said: \"Should he take his hand and shake it?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 2728, Book 42, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on bowing to others as a form of greeting?","id":"tirmidhi-42-41"},{"hadith-eng":"that he asked Anas bin Malik: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake each other's hand?\" He said, \"Yes.\"","reference":"Jami` at-Tirmidhi 2729, Book 42, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of handshaking among the Companions of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-42-42"},{"hadith-eng":"that the Prophet (ﷺ) said: \"taking hold of the hand is from the completeness of the greeting.\"","reference":"Jami` at-Tirmidhi 2730, Book 42, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of physical gestures in greeting others in Islam?","id":"tirmidhi-42-43"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"","reference":"Jami` at-Tirmidhi 2731, Book 42, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #1","question":"What actions are recommended when visiting someone who is ill?","id":"tirmidhi-42-44"},{"hadith-eng":"\"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"\n\n(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.","reference":"Jami` at-Tirmidhi 2732, Book 42, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #1","question":"What does this narration reveal about the relationship between the Prophet Muhammad (ﷺ) and Zaid bin Harithah?","id":"tirmidhi-42-45"},{"hadith-eng":"\"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"","reference":"Jami` at-Tirmidhi 2733, Book 42, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the nine clear signs mentioned by the Prophet Muhammad (ﷺ) in his response to the Jews?","id":"tirmidhi-42-46"},{"hadith-eng":"\"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"","reference":"Jami` at-Tirmidhi 2734, Book 42, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of greeting others in Islam as demonstrated in this event?","id":"tirmidhi-42-47"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul! You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I inform you about a matter which if you do it, then you will love one another? Spread the Salam among each other.\"","reference":"Jami` at-Tirmidhi 2688, Book 42, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is love among believers connected to faith?","id":"tirmidhi-42-48"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) and said: 'As-Salamu 'Alaykum (Peace be upon you).'\" [He said:] \"So the Prophet (ﷺ) said: 'Ten.' Then another came and he said: 'As-Salamu 'Alaykum Wa Rahmatullah (Peace be upon you, and the mercy of Allah).' So the Prophet (ﷺ) said: 'Twenty.' Then another came and said: 'As-Salamu 'Alaykum Wa Rahmatullahi Wa Barakatuh (Peace be upon you, and the mercy of Allah, and His Blessings).' So the Prophet (ﷺ) said: 'Thirty.'\"","reference":"Jami` at-Tirmidhi 2689, Book 42, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the length of the Islamic greeting affect the reward received?","id":"tirmidhi-42-49"},{"hadith-eng":"\"Abu Musa sought permission to enter upon 'Umar. He said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Once.' Then he was silent for some time. Then he said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: Twice.' Then he was silent for some time. Then he said: 'As-salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Three times.' Then he (Abu Musa) left. 'Umar said to the gate-keeper: 'What did he do?' He replied: 'He left.\" He said: 'Bring him to me.' So when he came, 'Umar said to him: 'What is this that you have done?' He said: 'The Sunnah.' He said: 'The Sunnah? By Allah! You had better bring me proof or a witness to clarify this, or I will do this or that to you.'\" He said \"So he came to us while we were sitting with Ansar. He said: 'O People of the Ansar! Are you not the most knowledgeable people about the Ahadith of the Messenger of Allah (ﷺ)? Did the Messenger of Allah (ﷺ) not say: \"Seeking permission is to be done three time. Either you are permitted, or other wise leave?\" The people began joking. Abu Sa'eed said: \"Then I raised my head toward him and said: \"Whatever punishment you are afflicted with because of this, then I shall be your partner in it.\" So he went to 'Umar to inform him him about it, and 'Umar said: \"I did not know about about this.\"","reference":"Jami` at-Tirmidhi 2690, Book 42, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many times should one seek permission before deciding to leave if not granted entry?","id":"tirmidhi-42-50"},{"hadith-eng":"that Uman bin Al-Khattab said: \"I sought permission (to enter) from the Messenger of Allah (ﷺ) three times, then he permitted me.\"","reference":"Jami` at-Tirmidhi 2691, Book 42, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many times should one seek permission before entering according to Islamic teachings?","id":"tirmidhi-42-51"},{"hadith-eng":"\"A man enter the Masjid and performed Salat while the Messenger of Allah (ﷺ) was sitting at the back of the Masjid. Then he came to greet him, so the Prophet (ﷺ) said: \"Wa Alaikum (and upon you); go back and pray for indeed you have not prayed.'\" And he mentioned the Hadith in its entirety.","reference":"Jami` at-Tirmidhi 2692, Book 42, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) guide individuals in correcting their prayer?","id":"tirmidhi-42-52"},{"hadith-eng":"that 'Aishah narrated to him that he Messenger of Allah (ﷺ) said to her: \"Indeeed Jibril has sent Salam to you.\" She said: \"And upon him be peace and the mercy of Allah and His Blessings.\"","reference":"Jami` at-Tirmidhi 2693, Book 42, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Aishah respond to the greeting from Jibril, and what does this teach about etiquette in responding to greetings?","id":"tirmidhi-42-53"},{"hadith-eng":"\"They said: 'O Messenger of Allah! When two men meet, which of them initiates the Salam?' He said: 'The nearest of them to Allah.'\"","reference":"Jami` at-Tirmidhi 2694, Book 42, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of being nearest to Allah in the context of initiating Salam?","id":"tirmidhi-42-54"},{"hadith-eng":"from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"He is not one of us who resembles other than us, no who resembles the Jews nor the Christians. For indeed greeting of the Jews is pointing the finger, and the greeting of the Christians is waving with the hand.\"","reference":"Jami` at-Tirmidhi 2695, Book 42, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic tradition view the act of imitating the customs of other religious communities?","id":"tirmidhi-42-55"},{"hadith-eng":"\"I was walking with Thabit Al-Bunani. He passed by some boys, so he said Salam to them. Then Thabit said: 'I was with Anas when he passed by some boys and gave the Salam to them, and Anas said: I was with the Prophet (ﷺ) when he passed by some boys and he gave the Salam to them.'\"","reference":"Jami` at-Tirmidhi 2696, Book 42, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of greeting children reflect the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-42-56"},{"hadith-eng":"that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.","reference":"Jami` at-Tirmidhi 2697, Book 42, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the gesture of Salam to a group of women?","id":"tirmidhi-42-57"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"","reference":"Jami` at-Tirmidhi 2698, Book 42, Hadith 11","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can giving Salam bring blessings to a household?","id":"tirmidhi-42-58"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Salam is before talking.\"\nWith this chain it has been reported that the Prophet (ﷺ) said: \"Do not invite anyone to the food until the Salam is given.\"","reference":"Jami` at-Tirmidhi 2699, Book 42, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is it important to give Salam before inviting someone to a meal?","id":"tirmidhi-42-59"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one of you meets them in the path, then force them to its narrow portion.\"","reference":"Jami` at-Tirmidhi 2700, Book 42, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should Muslims interact with Jews and Christians according to Islamic teachings?","id":"tirmidhi-42-60"},{"hadith-eng":"that a group of Jews entered upon the Prophet (ﷺ) and they said: \"As-Samu 'Alaik (death be upon you).\" So the Prophet (ﷺ) said: \"Wa 'Alaik (And upon you).\" So 'Aishah said: \"I said: '[Rather] upon you be death and the curse.'\" So the Prophet (ﷺ) said: \"O 'Aishah! Indeed Allah loves gentleness in every matter.\" 'Aishah said: \"Did you not hear what they said?\" He said: \"And I replied: 'And upon you.'\"","reference":"Jami` at-Tirmidhi 2701, Book 42, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of gentleness in dealing with others in Islam?","id":"tirmidhi-42-61"},{"hadith-eng":"that the Prophet (ﷺ) passed by a gathering in which the Muslims and the Jews were mixed, so he gave the Salam to them.","reference":"Jami` at-Tirmidhi 2702, Book 42, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the act of giving Salam promote peace and coexistence among diverse communities?","id":"tirmidhi-42-62"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"\nIbn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"","reference":"Jami` at-Tirmidhi 2703, Book 42, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic tradition prioritize who should initiate greetings in various social situations?","id":"tirmidhi-42-63"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The young one gives the Salam to the elder, the one passing the by to the one sitting and the few to the many.\"","reference":"Jami` at-Tirmidhi 2704, Book 42, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should a person passing by greet someone who is sitting?","id":"tirmidhi-42-64"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The horseman gives Salam to the walking person, the walking person to the one standing and the few to the many.\"","reference":"Jami` at-Tirmidhi 2705, Book 42, Hadith 18","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the status or position of a person affect the order of giving Salam?","id":"tirmidhi-42-65"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you arrives at the gathering, then give the Salam, and if he is given a place to sit, then let him sit. Then when he stands, let him give the Salam, the first is more worthy than the last.\"","reference":"Jami` at-Tirmidhi 2706, Book 42, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to give Salam when leaving a gathering?","id":"tirmidhi-42-66"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2707, Book 42, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law view the act of looking into someone's home without their consent?","id":"tirmidhi-42-67"},{"hadith-eng":"that the Prophet (ﷺ) was in his house when a man looked in at him, so he lunged towards him with an arrow head, so the man backed up.","reference":"Jami` at-Tirmidhi 2708, Book 42, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet (ﷺ) react to someone looking into his house without permission?","id":"tirmidhi-42-68"},{"hadith-eng":"that a man peeked in on the Messenger of Allah (ﷺ), in one of the apartments of the Prophet (ﷺ), while the Prophet (ﷺ) had a Midrah (an iron comb) with which he was scratching his head. So the Prophet (ﷺ) said: \"If I knew that you were looking then I would have poked your eyes with it. Seeking permission has only been enjoined because of the sight.\"","reference":"Jami` at-Tirmidhi 2709, Book 42, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of invading someone's privacy?","id":"tirmidhi-42-69"},{"hadith-eng":"that 'Amr bin 'Abdullah bin Safwan informed him, that Kaladah bin Hanbal had informed him, that Safwan bin Umayyah sent him to bring some milk, colostrum, and Daghabis (a type of herb) to the Prophet (ﷺ) while he was in the upper valley. (He said): \"I entered upon him without seeking permission nor giving Salam. The Prophet (ﷺ) said: 'Go back and say: As-Salamu Alaykum, may I enter?'\" And that was after Safwan had accepted Islam.\"","reference":"Jami` at-Tirmidhi 2710, Book 42, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should one properly greet others according to Islamic teachings?","id":"tirmidhi-42-70"},{"hadith-eng":"\"I sought permission to enter upon the Prophet (ﷺ) regarding a debt my father owed, so he said: 'Who is this?' I said: 'Me.' He said: 'Me, me.'As if he disliked that.\"","reference":"Jami` at-Tirmidhi 2711, Book 42, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate his feelings towards certain expressions or phrases?","id":"tirmidhi-42-71"},{"hadith-eng":"that the Prophet (ﷺ) prohibited them from returning to the women from a journey during the night.","reference":"Jami` at-Tirmidhi 2712, Book 42, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might it be discouraged to return to one's family during the night after a journey?","id":"tirmidhi-42-72"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you writes something, then let him Yutarrib (smeared with dust to dry the ink) it, for that is more conducive to the need.\"","reference":"Jami` at-Tirmidhi 2713, Book 42, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is it important to ensure that ink is properly dried when writing?","id":"tirmidhi-42-73"},{"hadith-eng":"\"I entered upon the Messenger of Allah (ﷺ) while there was a scribe in front of him, and I heard him saying: 'Put the pen on your ear, for that is more conducive to the scribe remembering.'\"","reference":"Jami` at-Tirmidhi 2714, Book 42, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of placing the pen on the ear according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-42-74"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered me to learn some statements from writings of the Jews for him, and he said: 'For indeed by Allah! I do no trust the Jews with my letters.'\" He said: \"Half a month did not pass before I learned it, when he (ﷺ) wanted to write to the Jews I would write it to them, and when they wrote to him I would read their letters to him.\"","reference":"Jami` at-Tirmidhi 2715, Book 42, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does this narration reflect the Prophet Muhammad's (ﷺ) approach to dealing with different communities?","id":"tirmidhi-42-75"},{"hadith-eng":"\"Before he died, the Messenger of Allah (ﷺ) had written to Kisra, Ceasar, An-Najashi, and to every tyrant calling them to Allah. This An-Najashi is not the one that the Prophet (ﷺ) performed to the funeral Salat for.\"","reference":"Jami` at-Tirmidhi 2716, Book 42, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who were some of the rulers that the Prophet Muhammad (ﷺ) wrote to before his death?","id":"tirmidhi-42-76"},{"hadith-eng":"that Abu Sufyan bin Harb informed him that Hiraql had sent for him while he was with a party of the Quraish, and they were trading in Ash-Sham, so they went to him.\" And he mentioned the Hadith and said: \"Then he called for the letter of the Messenger of Allah (ﷺ) to be read, and it said in it: 'In the Name of Allah, the Merciful, the Beneficent. From Muhammad, Allah's Slave and His Messenger, to Hiraql the leader of Rome. Peace be upon whoever follows the guidance. To proceed:\"","reference":"Jami` at-Tirmidhi 2717, Book 42, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Abu Sufyan bin Harb come to be in the presence of Hiraql?","id":"tirmidhi-42-77"},{"hadith-eng":"\"When the Prophet of Allah (ﷺ) wanted to write to the foreigners, it was said to him: 'The foreigners do not accept a letter unless it has a seal.' So he had a ring made.\" He said: \"It is as if I am now looking at its whiteness in his hand.\"","reference":"Jami` at-Tirmidhi 2718, Book 42, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"What does the practice of sealing letters signify in terms of communication and authenticity?","id":"tirmidhi-42-78"},{"hadith-eng":"\"Two of my companions and I went and presented ourselves to the Companions of the Prophet (ﷺ), for our hearing and sight had gone from suffering (hunger and thirst). But there was no one who would accept us. So we went to the Prophet (ﷺ) and he brought us to his family where there were three goats. The Prophet (ﷺ) said: 'Milk these.' We milked them, and each person drank his share, and we put aside a share for the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) came during the night and gave the Salam such that it would not wake the sleeping person, and the one who was awake could hear it. Then he went to the Masjid to per form Salat. Then he went for his drink and drank it.\"","reference":"Jami` at-Tirmidhi 2719, Book 42, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet (ﷺ) demonstrate consideration for others when entering a place where people might be sleeping?","id":"tirmidhi-42-79"},{"hadith-eng":"that a man gave the Salam to the Prophet (ﷺ) while he was urinating, but the Prophet (ﷺ) did not return the Salam to him.\"","reference":"Jami` at-Tirmidhi 2720, Book 42, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one behave when someone is engaged in a private act like urination?","id":"tirmidhi-42-80"},{"hadith-eng":"from a man among his people, who said: \"I went looking for the Prophet (ﷺ) but I was not able to find him. So I sat down, and then I saw a group of people, and he was among them, but I did not recognize him. He was settling some matter between them so when he was finished, some of them stood up with him and they were saying: 'O Messenger of Allah.' When I saw that, I said: \"'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah!' He replied: 'Indeed \"'Alaikas-Salam (upon you be peace)\" is the greeting for the dead.' Then he came toward me and said: 'When a man meets his Muslim brother then he should say: \"As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh (peace be upon you, and the mercy and blessings of Allah).\" Then the Prophet (ﷺ) responded to my greeting, he said: 'And may Allah's mercy be upon you, and may Allah's mercy be upon you, and may Allah's mercy be upon you.'\"","reference":"Jami` at-Tirmidhi 2721, Book 42, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the phrase 'Alaikas-Salam' considered a greeting for the dead in Islamic tradition?","id":"tirmidhi-42-81"},{"hadith-eng":"from Abu Tamimah al-Hujaimi from Jabir bin Sulaim who said: \"I went to the Prophet (ﷺ) and I said: ''Alaikas-Salam (upon you be peace)' so he replied: 'Do not say \"'Alaikas-Salam\" rather say As-Salamu Alaik.'\" And he mentioned the story in its entirety.","reference":"Jami` at-Tirmidhi 2722, Book 42, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to use the phrase 'As-Salamu Alaik' instead of 'Alaikas-Salam'?","id":"tirmidhi-42-82"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) would give the Salam he would do so three times, and when he would say a statement, he would say it three times.\"","reference":"Jami` at-Tirmidhi 2723, Book 42, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does repetition enhance the clarity and understanding of a message in communication?","id":"tirmidhi-42-83"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"","reference":"Jami` at-Tirmidhi 2724, Book 42, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does one's approach to religious gatherings reflect their relationship with Allah?","id":"tirmidhi-42-84"},{"hadith-eng":"\"When we went to the Prophet (ﷺ), each of us would sit wherever he wound up at.\"","reference":"Jami` at-Tirmidhi 2725, Book 42, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet behave when they visited him?","id":"tirmidhi-42-85"},{"hadith-eng":"\"From Abu Ishaq, from Al-Bara - and he did not hear it from him - the Messenger of Allah (ﷺ) passed by some people from the Ansar while they were sitting in the road. He said: 'If you people must do this, then return the Salam, assist the wronged, and give directions to the one who is on the route.\"","reference":"Jami` at-Tirmidhi 2726, Book 42, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one respond when greeted with Salam in a public setting?","id":"tirmidhi-42-86"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"No two Muslims meet each other and shake hands, except that Allah forgives them before they part.\"","reference":"Jami` at-Tirmidhi 2727, Book 42, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does physical interaction, like shaking hands, impact the spiritual relationship between Muslims?","id":"tirmidhi-42-87"},{"hadith-eng":"that a man said: \"O Messenger of Allah! When a man among us meets his brother or his friend should he bow to him?\" He said: \"No.\" The man continued: \"Should he embrace him and kiss him?\" He said: \"No.\" He said: \"Should he take his hand and shake it?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 2728, Book 42, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the recommended ways to greet a friend or brother in Islam?","id":"tirmidhi-42-88"},{"hadith-eng":"that he asked Anas bin Malik: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake each other's hand?\" He said, \"Yes.\"","reference":"Jami` at-Tirmidhi 2729, Book 42, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Companions of the Prophet (ﷺ) express their camaraderie and brotherhood?","id":"tirmidhi-42-89"},{"hadith-eng":"that the Prophet (ﷺ) said: \"taking hold of the hand is from the completeness of the greeting.\"","reference":"Jami` at-Tirmidhi 2730, Book 42, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does holding hands relate to the concept of greeting in Islamic tradition?","id":"tirmidhi-42-90"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"","reference":"Jami` at-Tirmidhi 2731, Book 42, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can one show compassion and care during a visit to a sick person?","id":"tirmidhi-42-91"},{"hadith-eng":"\"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"\n\n(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.","reference":"Jami` at-Tirmidhi 2732, Book 42, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does this incident reflect the Prophet Muhammad's (ﷺ) affection and warmth towards his companions?","id":"tirmidhi-42-92"},{"hadith-eng":"\"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"","reference":"Jami` at-Tirmidhi 2733, Book 42, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why did the Jews hesitate to acknowledge Prophet Muhammad (ﷺ) despite recognizing him as a Prophet?","id":"tirmidhi-42-93"},{"hadith-eng":"\"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"","reference":"Jami` at-Tirmidhi 2734, Book 42, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"How was privacy maintained during the Prophet's time as shown in this incident?","id":"tirmidhi-42-94"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul! You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I inform you about a matter which if you do it, then you will love one another? Spread the Salam among each other.\"","reference":"Jami` at-Tirmidhi 2688, Book 42, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"What action can foster love among people according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-42-95"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) and said: 'As-Salamu 'Alaykum (Peace be upon you).'\" [He said:] \"So the Prophet (ﷺ) said: 'Ten.' Then another came and he said: 'As-Salamu 'Alaykum Wa Rahmatullah (Peace be upon you, and the mercy of Allah).' So the Prophet (ﷺ) said: 'Twenty.' Then another came and said: 'As-Salamu 'Alaykum Wa Rahmatullahi Wa Barakatuh (Peace be upon you, and the mercy of Allah, and His Blessings).' So the Prophet (ﷺ) said: 'Thirty.'\"","reference":"Jami` at-Tirmidhi 2689, Book 42, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the different forms of Islamic greetings mentioned in the hadith?","id":"tirmidhi-42-96"},{"hadith-eng":"\"Abu Musa sought permission to enter upon 'Umar. He said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Once.' Then he was silent for some time. Then he said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: Twice.' Then he was silent for some time. Then he said: 'As-salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Three times.' Then he (Abu Musa) left. 'Umar said to the gate-keeper: 'What did he do?' He replied: 'He left.\" He said: 'Bring him to me.' So when he came, 'Umar said to him: 'What is this that you have done?' He said: 'The Sunnah.' He said: 'The Sunnah? By Allah! You had better bring me proof or a witness to clarify this, or I will do this or that to you.'\" He said \"So he came to us while we were sitting with Ansar. He said: 'O People of the Ansar! Are you not the most knowledgeable people about the Ahadith of the Messenger of Allah (ﷺ)? Did the Messenger of Allah (ﷺ) not say: \"Seeking permission is to be done three time. Either you are permitted, or other wise leave?\" The people began joking. Abu Sa'eed said: \"Then I raised my head toward him and said: \"Whatever punishment you are afflicted with because of this, then I shall be your partner in it.\" So he went to 'Umar to inform him him about it, and 'Umar said: \"I did not know about about this.\"","reference":"Jami` at-Tirmidhi 2690, Book 42, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do witnesses play in verifying the authenticity of a practice in Islam?","id":"tirmidhi-42-97"},{"hadith-eng":"that Uman bin Al-Khattab said: \"I sought permission (to enter) from the Messenger of Allah (ﷺ) three times, then he permitted me.\"","reference":"Jami` at-Tirmidhi 2691, Book 42, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the behavior of Umar bin Al-Khattab in relation to seeking permission?","id":"tirmidhi-42-98"},{"hadith-eng":"\"A man enter the Masjid and performed Salat while the Messenger of Allah (ﷺ) was sitting at the back of the Masjid. Then he came to greet him, so the Prophet (ﷺ) said: \"Wa Alaikum (and upon you); go back and pray for indeed you have not prayed.'\" And he mentioned the Hadith in its entirety.","reference":"Jami` at-Tirmidhi 2692, Book 42, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of greeting the Prophet (ﷺ) after performing Salat?","id":"tirmidhi-42-99"},{"hadith-eng":"that 'Aishah narrated to him that he Messenger of Allah (ﷺ) said to her: \"Indeeed Jibril has sent Salam to you.\" She said: \"And upon him be peace and the mercy of Allah and His Blessings.\"","reference":"Jami` at-Tirmidhi 2693, Book 42, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration imply about the relationship between the Prophet Muhammad (ﷺ) and Jibril?","id":"tirmidhi-42-100"},{"hadith-eng":"\"They said: 'O Messenger of Allah! When two men meet, which of them initiates the Salam?' He said: 'The nearest of them to Allah.'\"","reference":"Jami` at-Tirmidhi 2694, Book 42, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does initiating Salam reflect one's closeness to Allah?","id":"tirmidhi-42-101"},{"hadith-eng":"from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"He is not one of us who resembles other than us, no who resembles the Jews nor the Christians. For indeed greeting of the Jews is pointing the finger, and the greeting of the Christians is waving with the hand.\"","reference":"Jami` at-Tirmidhi 2695, Book 42, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the specific greetings associated with Jews and Christians as mentioned in the teachings of the Prophet (ﷺ)?","id":"tirmidhi-42-102"},{"hadith-eng":"\"I was walking with Thabit Al-Bunani. He passed by some boys, so he said Salam to them. Then Thabit said: 'I was with Anas when he passed by some boys and gave the Salam to them, and Anas said: I was with the Prophet (ﷺ) when he passed by some boys and he gave the Salam to them.'\"","reference":"Jami` at-Tirmidhi 2696, Book 42, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the behavior of the Prophet (ﷺ) towards young people?","id":"tirmidhi-42-103"},{"hadith-eng":"that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.","reference":"Jami` at-Tirmidhi 2697, Book 42, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned about the interaction between the Prophet Muhammad (ﷺ) and women from this event?","id":"tirmidhi-42-104"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"","reference":"Jami` at-Tirmidhi 2698, Book 42, Hadith 11","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the benefits of greeting family members with Salam according to Islamic teachings?","id":"tirmidhi-42-105"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Salam is before talking.\"\nWith this chain it has been reported that the Prophet (ﷺ) said: \"Do not invite anyone to the food until the Salam is given.\"","reference":"Jami` at-Tirmidhi 2699, Book 42, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the practice of giving Salam reflect on social etiquette in Islam?","id":"tirmidhi-42-106"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one of you meets them in the path, then force them to its narrow portion.\"","reference":"Jami` at-Tirmidhi 2700, Book 42, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the path's narrow portion in interactions with non-Muslims?","id":"tirmidhi-42-107"},{"hadith-eng":"that a group of Jews entered upon the Prophet (ﷺ) and they said: \"As-Samu 'Alaik (death be upon you).\" So the Prophet (ﷺ) said: \"Wa 'Alaik (And upon you).\" So 'Aishah said: \"I said: '[Rather] upon you be death and the curse.'\" So the Prophet (ﷺ) said: \"O 'Aishah! Indeed Allah loves gentleness in every matter.\" 'Aishah said: \"Did you not hear what they said?\" He said: \"And I replied: 'And upon you.'\"","reference":"Jami` at-Tirmidhi 2701, Book 42, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) demonstrate patience and wisdom in the face of provocation?","id":"tirmidhi-42-108"},{"hadith-eng":"that the Prophet (ﷺ) passed by a gathering in which the Muslims and the Jews were mixed, so he gave the Salam to them.","reference":"Jami` at-Tirmidhi 2702, Book 42, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's interaction with gatherings of mixed religious groups?","id":"tirmidhi-42-109"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"\nIbn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"","reference":"Jami` at-Tirmidhi 2703, Book 42, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of younger individuals greeting elders in Islamic culture?","id":"tirmidhi-42-110"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The young one gives the Salam to the elder, the one passing the by to the one sitting and the few to the many.\"","reference":"Jami` at-Tirmidhi 2704, Book 42, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the recommended way for a smaller group to greet a larger group?","id":"tirmidhi-42-111"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The horseman gives Salam to the walking person, the walking person to the one standing and the few to the many.\"","reference":"Jami` at-Tirmidhi 2705, Book 42, Hadith 18","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of greeting others with Salam in Islam?","id":"tirmidhi-42-112"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you arrives at the gathering, then give the Salam, and if he is given a place to sit, then let him sit. Then when he stands, let him give the Salam, the first is more worthy than the last.\"","reference":"Jami` at-Tirmidhi 2706, Book 42, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #3","question":"What etiquette should be followed when being offered a place to sit in a gathering?","id":"tirmidhi-42-113"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2707, Book 42, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the responsibility of homeowners in maintaining their privacy according to this teaching?","id":"tirmidhi-42-114"},{"hadith-eng":"that the Prophet (ﷺ) was in his house when a man looked in at him, so he lunged towards him with an arrow head, so the man backed up.","reference":"Jami` at-Tirmidhi 2708, Book 42, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the importance of privacy in Islam from the Prophet's (ﷺ) reaction?","id":"tirmidhi-42-115"},{"hadith-eng":"that a man peeked in on the Messenger of Allah (ﷺ), in one of the apartments of the Prophet (ﷺ), while the Prophet (ﷺ) had a Midrah (an iron comb) with which he was scratching his head. So the Prophet (ﷺ) said: \"If I knew that you were looking then I would have poked your eyes with it. Seeking permission has only been enjoined because of the sight.\"","reference":"Jami` at-Tirmidhi 2709, Book 42, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences mentioned for invading someone's privacy without permission?","id":"tirmidhi-42-116"},{"hadith-eng":"that 'Amr bin 'Abdullah bin Safwan informed him, that Kaladah bin Hanbal had informed him, that Safwan bin Umayyah sent him to bring some milk, colostrum, and Daghabis (a type of herb) to the Prophet (ﷺ) while he was in the upper valley. (He said): \"I entered upon him without seeking permission nor giving Salam. The Prophet (ﷺ) said: 'Go back and say: As-Salamu Alaykum, may I enter?'\" And that was after Safwan had accepted Islam.\"","reference":"Jami` at-Tirmidhi 2710, Book 42, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned about the importance of greetings in Islam from the actions of the Prophet (ﷺ)?","id":"tirmidhi-42-117"},{"hadith-eng":"\"I sought permission to enter upon the Prophet (ﷺ) regarding a debt my father owed, so he said: 'Who is this?' I said: 'Me.' He said: 'Me, me.'As if he disliked that.\"","reference":"Jami` at-Tirmidhi 2711, Book 42, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration suggest about the importance of clear communication when identifying oneself?","id":"tirmidhi-42-118"},{"hadith-eng":"that the Prophet (ﷺ) prohibited them from returning to the women from a journey during the night.","reference":"Jami` at-Tirmidhi 2712, Book 42, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What considerations should be taken into account when planning the timing of returning home from travel?","id":"tirmidhi-42-119"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you writes something, then let him Yutarrib (smeared with dust to dry the ink) it, for that is more conducive to the need.\"","reference":"Jami` at-Tirmidhi 2713, Book 42, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the benefits of smearing ink with dust in the context of writing?","id":"tirmidhi-42-120"},{"hadith-eng":"\"I entered upon the Messenger of Allah (ﷺ) while there was a scribe in front of him, and I heard him saying: 'Put the pen on your ear, for that is more conducive to the scribe remembering.'\"","reference":"Jami` at-Tirmidhi 2714, Book 42, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #3","question":"How can physical actions aid in memory retention according to Islamic teachings?","id":"tirmidhi-42-121"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered me to learn some statements from writings of the Jews for him, and he said: 'For indeed by Allah! I do no trust the Jews with my letters.'\" He said: \"Half a month did not pass before I learned it, when he (ﷺ) wanted to write to the Jews I would write it to them, and when they wrote to him I would read their letters to him.\"","reference":"Jami` at-Tirmidhi 2715, Book 42, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be inferred about the trustworthiness of different groups from this narration?","id":"tirmidhi-42-122"},{"hadith-eng":"\"Before he died, the Messenger of Allah (ﷺ) had written to Kisra, Ceasar, An-Najashi, and to every tyrant calling them to Allah. This An-Najashi is not the one that the Prophet (ﷺ) performed to the funeral Salat for.\"","reference":"Jami` at-Tirmidhi 2716, Book 42, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the hadith imply about the Prophet's approach to spreading the message of Islam?","id":"tirmidhi-42-123"},{"hadith-eng":"that Abu Sufyan bin Harb informed him that Hiraql had sent for him while he was with a party of the Quraish, and they were trading in Ash-Sham, so they went to him.\" And he mentioned the Hadith and said: \"Then he called for the letter of the Messenger of Allah (ﷺ) to be read, and it said in it: 'In the Name of Allah, the Merciful, the Beneficent. From Muhammad, Allah's Slave and His Messenger, to Hiraql the leader of Rome. Peace be upon whoever follows the guidance. To proceed:\"","reference":"Jami` at-Tirmidhi 2717, Book 42, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the phrase 'Peace be upon whoever follows the guidance' imply in the context of the letter?","id":"tirmidhi-42-124"},{"hadith-eng":"\"When the Prophet of Allah (ﷺ) wanted to write to the foreigners, it was said to him: 'The foreigners do not accept a letter unless it has a seal.' So he had a ring made.\" He said: \"It is as if I am now looking at its whiteness in his hand.\"","reference":"Jami` at-Tirmidhi 2718, Book 42, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) adapt to the customs of foreign nations in his correspondence?","id":"tirmidhi-42-125"},{"hadith-eng":"\"Two of my companions and I went and presented ourselves to the Companions of the Prophet (ﷺ), for our hearing and sight had gone from suffering (hunger and thirst). But there was no one who would accept us. So we went to the Prophet (ﷺ) and he brought us to his family where there were three goats. The Prophet (ﷺ) said: 'Milk these.' We milked them, and each person drank his share, and we put aside a share for the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) came during the night and gave the Salam such that it would not wake the sleeping person, and the one who was awake could hear it. Then he went to the Masjid to per form Salat. Then he went for his drink and drank it.\"","reference":"Jami` at-Tirmidhi 2719, Book 42, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration teach about the importance of sharing and caring for others in times of need?","id":"tirmidhi-42-126"},{"hadith-eng":"that a man gave the Salam to the Prophet (ﷺ) while he was urinating, but the Prophet (ﷺ) did not return the Salam to him.\"","reference":"Jami` at-Tirmidhi 2720, Book 42, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the circumstances under which returning Salam is not obligatory?","id":"tirmidhi-42-127"},{"hadith-eng":"from a man among his people, who said: \"I went looking for the Prophet (ﷺ) but I was not able to find him. So I sat down, and then I saw a group of people, and he was among them, but I did not recognize him. He was settling some matter between them so when he was finished, some of them stood up with him and they were saying: 'O Messenger of Allah.' When I saw that, I said: \"'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah!' He replied: 'Indeed \"'Alaikas-Salam (upon you be peace)\" is the greeting for the dead.' Then he came toward me and said: 'When a man meets his Muslim brother then he should say: \"As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh (peace be upon you, and the mercy and blessings of Allah).\" Then the Prophet (ﷺ) responded to my greeting, he said: 'And may Allah's mercy be upon you, and may Allah's mercy be upon you, and may Allah's mercy be upon you.'\"","reference":"Jami` at-Tirmidhi 2721, Book 42, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) instruct Muslims to greet each other?","id":"tirmidhi-42-128"},{"hadith-eng":"from Abu Tamimah al-Hujaimi from Jabir bin Sulaim who said: \"I went to the Prophet (ﷺ) and I said: ''Alaikas-Salam (upon you be peace)' so he replied: 'Do not say \"'Alaikas-Salam\" rather say As-Salamu Alaik.'\" And he mentioned the story in its entirety.","reference":"Jami` at-Tirmidhi 2722, Book 42, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the interaction between Jabir bin Sulaim and the Prophet (ﷺ) regarding Islamic etiquette?","id":"tirmidhi-42-129"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) would give the Salam he would do so three times, and when he would say a statement, he would say it three times.\"","reference":"Jami` at-Tirmidhi 2723, Book 42, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's communication style from his practice of repeating statements?","id":"tirmidhi-42-130"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"","reference":"Jami` at-Tirmidhi 2724, Book 42, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the consequences of turning away from religious teachings?","id":"tirmidhi-42-131"},{"hadith-eng":"\"When we went to the Prophet (ﷺ), each of us would sit wherever he wound up at.\"","reference":"Jami` at-Tirmidhi 2725, Book 42, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the etiquette of sitting in gatherings from this narration?","id":"tirmidhi-42-132"},{"hadith-eng":"\"From Abu Ishaq, from Al-Bara - and he did not hear it from him - the Messenger of Allah (ﷺ) passed by some people from the Ansar while they were sitting in the road. He said: 'If you people must do this, then return the Salam, assist the wronged, and give directions to the one who is on the route.\"","reference":"Jami` at-Tirmidhi 2726, Book 42, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions are encouraged to assist those who have been wronged?","id":"tirmidhi-42-133"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"No two Muslims meet each other and shake hands, except that Allah forgives them before they part.\"","reference":"Jami` at-Tirmidhi 2727, Book 42, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the spiritual benefits of meeting and greeting fellow Muslims?","id":"tirmidhi-42-134"},{"hadith-eng":"that a man said: \"O Messenger of Allah! When a man among us meets his brother or his friend should he bow to him?\" He said: \"No.\" The man continued: \"Should he embrace him and kiss him?\" He said: \"No.\" He said: \"Should he take his hand and shake it?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 2728, Book 42, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #3","question":"Is embracing and kissing a friend or brother encouraged in Islamic greetings?","id":"tirmidhi-42-135"},{"hadith-eng":"that he asked Anas bin Malik: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake each other's hand?\" He said, \"Yes.\"","reference":"Jami` at-Tirmidhi 2729, Book 42, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are some traditional practices of greeting in Islam as observed by the early Muslims?","id":"tirmidhi-42-136"},{"hadith-eng":"that the Prophet (ﷺ) said: \"taking hold of the hand is from the completeness of the greeting.\"","reference":"Jami` at-Tirmidhi 2730, Book 42, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the components of a complete greeting in Islamic teachings?","id":"tirmidhi-42-137"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"","reference":"Jami` at-Tirmidhi 2731, Book 42, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of physical touch, such as placing a hand on the forehead or hand, when visiting the sick?","id":"tirmidhi-42-138"},{"hadith-eng":"\"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"\n\n(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.","reference":"Jami` at-Tirmidhi 2732, Book 42, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #3","question":"What cultural or social norms can be inferred from the Prophet Muhammad's (ﷺ) actions in this narration?","id":"tirmidhi-42-139"},{"hadith-eng":"\"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"","reference":"Jami` at-Tirmidhi 2733, Book 42, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions are prohibited according to the teachings of Islam as mentioned in the hadith?","id":"tirmidhi-42-140"},{"hadith-eng":"\"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"","reference":"Jami` at-Tirmidhi 2734, Book 42, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration reveal about the relationship between the Prophet and his family members?","id":"tirmidhi-42-141"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul! You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I inform you about a matter which if you do it, then you will love one another? Spread the Salam among each other.\"","reference":"Jami` at-Tirmidhi 2688, Book 42, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of spreading Salam in Islam?","id":"tirmidhi-42-142"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) and said: 'As-Salamu 'Alaykum (Peace be upon you).'\" [He said:] \"So the Prophet (ﷺ) said: 'Ten.' Then another came and he said: 'As-Salamu 'Alaykum Wa Rahmatullah (Peace be upon you, and the mercy of Allah).' So the Prophet (ﷺ) said: 'Twenty.' Then another came and said: 'As-Salamu 'Alaykum Wa Rahmatullahi Wa Barakatuh (Peace be upon you, and the mercy of Allah, and His Blessings).' So the Prophet (ﷺ) said: 'Thirty.'\"","reference":"Jami` at-Tirmidhi 2689, Book 42, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #4","question":"What rewards are associated with saying 'As-Salamu 'Alaykum' according to Islamic teachings?","id":"tirmidhi-42-143"},{"hadith-eng":"\"Abu Musa sought permission to enter upon 'Umar. He said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Once.' Then he was silent for some time. Then he said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: Twice.' Then he was silent for some time. Then he said: 'As-salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Three times.' Then he (Abu Musa) left. 'Umar said to the gate-keeper: 'What did he do?' He replied: 'He left.\" He said: 'Bring him to me.' So when he came, 'Umar said to him: 'What is this that you have done?' He said: 'The Sunnah.' He said: 'The Sunnah? By Allah! You had better bring me proof or a witness to clarify this, or I will do this or that to you.'\" He said \"So he came to us while we were sitting with Ansar. He said: 'O People of the Ansar! Are you not the most knowledgeable people about the Ahadith of the Messenger of Allah (ﷺ)? Did the Messenger of Allah (ﷺ) not say: \"Seeking permission is to be done three time. Either you are permitted, or other wise leave?\" The people began joking. Abu Sa'eed said: \"Then I raised my head toward him and said: \"Whatever punishment you are afflicted with because of this, then I shall be your partner in it.\" So he went to 'Umar to inform him him about it, and 'Umar said: \"I did not know about about this.\"","reference":"Jami` at-Tirmidhi 2690, Book 42, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet (ﷺ) ensure the accuracy of the Sunnah?","id":"tirmidhi-42-144"},{"hadith-eng":"that Uman bin Al-Khattab said: \"I sought permission (to enter) from the Messenger of Allah (ﷺ) three times, then he permitted me.\"","reference":"Jami` at-Tirmidhi 2691, Book 42, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration teach about the Prophet Muhammad's (ﷺ) response to requests for permission?","id":"tirmidhi-42-145"},{"hadith-eng":"\"A man enter the Masjid and performed Salat while the Messenger of Allah (ﷺ) was sitting at the back of the Masjid. Then he came to greet him, so the Prophet (ﷺ) said: \"Wa Alaikum (and upon you); go back and pray for indeed you have not prayed.'\" And he mentioned the Hadith in its entirety.","reference":"Jami` at-Tirmidhi 2692, Book 42, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the importance of proper Salat from the Prophet's (ﷺ) response?","id":"tirmidhi-42-146"},{"hadith-eng":"that 'Aishah narrated to him that he Messenger of Allah (ﷺ) said to her: \"Indeeed Jibril has sent Salam to you.\" She said: \"And upon him be peace and the mercy of Allah and His Blessings.\"","reference":"Jami` at-Tirmidhi 2693, Book 42, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the role of angels in conveying messages in Islam from this narration?","id":"tirmidhi-42-147"},{"hadith-eng":"\"They said: 'O Messenger of Allah! When two men meet, which of them initiates the Salam?' He said: 'The nearest of them to Allah.'\"","reference":"Jami` at-Tirmidhi 2694, Book 42, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of Salam in fostering relationships between individuals?","id":"tirmidhi-42-148"},{"hadith-eng":"from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"He is not one of us who resembles other than us, no who resembles the Jews nor the Christians. For indeed greeting of the Jews is pointing the finger, and the greeting of the Christians is waving with the hand.\"","reference":"Jami` at-Tirmidhi 2695, Book 42, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important for Muslims to avoid resembling the practices of other religious groups?","id":"tirmidhi-42-149"},{"hadith-eng":"\"I was walking with Thabit Al-Bunani. He passed by some boys, so he said Salam to them. Then Thabit said: 'I was with Anas when he passed by some boys and gave the Salam to them, and Anas said: I was with the Prophet (ﷺ) when he passed by some boys and he gave the Salam to them.'\"","reference":"Jami` at-Tirmidhi 2696, Book 42, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to follow the example of the Prophet (ﷺ) in daily interactions?","id":"tirmidhi-42-150"},{"hadith-eng":"that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.","reference":"Jami` at-Tirmidhi 2697, Book 42, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does this narration indicate about the Prophet Muhammad's (ﷺ) approach to inclusivity in religious spaces?","id":"tirmidhi-42-151"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"","reference":"Jami` at-Tirmidhi 2698, Book 42, Hadith 11","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the practice of giving Salam impact the atmosphere of a home?","id":"tirmidhi-42-152"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Salam is before talking.\"\nWith this chain it has been reported that the Prophet (ﷺ) said: \"Do not invite anyone to the food until the Salam is given.\"","reference":"Jami` at-Tirmidhi 2699, Book 42, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of not giving Salam before speaking or inviting others?","id":"tirmidhi-42-153"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one of you meets them in the path, then force them to its narrow portion.\"","reference":"Jami` at-Tirmidhi 2700, Book 42, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the etiquettes of offering Salam in Islam?","id":"tirmidhi-42-154"},{"hadith-eng":"that a group of Jews entered upon the Prophet (ﷺ) and they said: \"As-Samu 'Alaik (death be upon you).\" So the Prophet (ﷺ) said: \"Wa 'Alaik (And upon you).\" So 'Aishah said: \"I said: '[Rather] upon you be death and the curse.'\" So the Prophet (ﷺ) said: \"O 'Aishah! Indeed Allah loves gentleness in every matter.\" 'Aishah said: \"Did you not hear what they said?\" He said: \"And I replied: 'And upon you.'\"","reference":"Jami` at-Tirmidhi 2701, Book 42, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What lesson can be learned about controlling one's reaction to offensive remarks?","id":"tirmidhi-42-155"},{"hadith-eng":"that the Prophet (ﷺ) passed by a gathering in which the Muslims and the Jews were mixed, so he gave the Salam to them.","reference":"Jami` at-Tirmidhi 2702, Book 42, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the importance of Salam in Islamic social etiquette?","id":"tirmidhi-42-156"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"\nIbn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"","reference":"Jami` at-Tirmidhi 2703, Book 42, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of greeting reflect respect and humility in social interactions?","id":"tirmidhi-42-157"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The young one gives the Salam to the elder, the one passing the by to the one sitting and the few to the many.\"","reference":"Jami` at-Tirmidhi 2704, Book 42, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this hadith teach about the importance of initiating greetings?","id":"tirmidhi-42-158"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The horseman gives Salam to the walking person, the walking person to the one standing and the few to the many.\"","reference":"Jami` at-Tirmidhi 2705, Book 42, Hadith 18","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the number of people in a group influence the practice of giving Salam?","id":"tirmidhi-42-159"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you arrives at the gathering, then give the Salam, and if he is given a place to sit, then let him sit. Then when he stands, let him give the Salam, the first is more worthy than the last.\"","reference":"Jami` at-Tirmidhi 2706, Book 42, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the act of giving Salam contribute to social harmony and respect?","id":"tirmidhi-42-160"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2707, Book 42, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #4","question":"What actions are justified if someone invades the privacy of a home without permission?","id":"tirmidhi-42-161"},{"hadith-eng":"that the Prophet (ﷺ) was in his house when a man looked in at him, so he lunged towards him with an arrow head, so the man backed up.","reference":"Jami` at-Tirmidhi 2708, Book 42, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"What measures are suggested in Islam to protect one's privacy based on the Prophet's (ﷺ) actions?","id":"tirmidhi-42-162"},{"hadith-eng":"that a man peeked in on the Messenger of Allah (ﷺ), in one of the apartments of the Prophet (ﷺ), while the Prophet (ﷺ) had a Midrah (an iron comb) with which he was scratching his head. So the Prophet (ﷺ) said: \"If I knew that you were looking then I would have poked your eyes with it. Seeking permission has only been enjoined because of the sight.\"","reference":"Jami` at-Tirmidhi 2709, Book 42, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is seeking permission emphasized in Islamic teachings?","id":"tirmidhi-42-163"},{"hadith-eng":"that 'Amr bin 'Abdullah bin Safwan informed him, that Kaladah bin Hanbal had informed him, that Safwan bin Umayyah sent him to bring some milk, colostrum, and Daghabis (a type of herb) to the Prophet (ﷺ) while he was in the upper valley. (He said): \"I entered upon him without seeking permission nor giving Salam. The Prophet (ﷺ) said: 'Go back and say: As-Salamu Alaykum, may I enter?'\" And that was after Safwan had accepted Islam.\"","reference":"Jami` at-Tirmidhi 2710, Book 42, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the practice of seeking permission and greeting relate to respect and manners in Islam?","id":"tirmidhi-42-164"},{"hadith-eng":"\"I sought permission to enter upon the Prophet (ﷺ) regarding a debt my father owed, so he said: 'Who is this?' I said: 'Me.' He said: 'Me, me.'As if he disliked that.\"","reference":"Jami` at-Tirmidhi 2711, Book 42, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's (ﷺ) attitude towards repetition in speech from this incident?","id":"tirmidhi-42-165"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you writes something, then let him Yutarrib (smeared with dust to dry the ink) it, for that is more conducive to the need.\"","reference":"Jami` at-Tirmidhi 2713, Book 42, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the practice of drying ink relate to the preservation of written documents?","id":"tirmidhi-42-166"},{"hadith-eng":"\"I entered upon the Messenger of Allah (ﷺ) while there was a scribe in front of him, and I heard him saying: 'Put the pen on your ear, for that is more conducive to the scribe remembering.'\"","reference":"Jami` at-Tirmidhi 2714, Book 42, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role does the scribe play in the preservation of knowledge in Islamic tradition?","id":"tirmidhi-42-167"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered me to learn some statements from writings of the Jews for him, and he said: 'For indeed by Allah! I do no trust the Jews with my letters.'\" He said: \"Half a month did not pass before I learned it, when he (ﷺ) wanted to write to the Jews I would write it to them, and when they wrote to him I would read their letters to him.\"","reference":"Jami` at-Tirmidhi 2715, Book 42, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role did Zaid bin Thabit play in the communication between the Prophet Muhammad (ﷺ) and the Jewish community?","id":"tirmidhi-42-168"},{"hadith-eng":"\"Before he died, the Messenger of Allah (ﷺ) had written to Kisra, Ceasar, An-Najashi, and to every tyrant calling them to Allah. This An-Najashi is not the one that the Prophet (ﷺ) performed to the funeral Salat for.\"","reference":"Jami` at-Tirmidhi 2716, Book 42, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the hadith distinguish between different individuals with the title An-Najashi?","id":"tirmidhi-42-169"},{"hadith-eng":"that Abu Sufyan bin Harb informed him that Hiraql had sent for him while he was with a party of the Quraish, and they were trading in Ash-Sham, so they went to him.\" And he mentioned the Hadith and said: \"Then he called for the letter of the Messenger of Allah (ﷺ) to be read, and it said in it: 'In the Name of Allah, the Merciful, the Beneficent. From Muhammad, Allah's Slave and His Messenger, to Hiraql the leader of Rome. Peace be upon whoever follows the guidance. To proceed:\"","reference":"Jami` at-Tirmidhi 2717, Book 42, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role did trade play in the interaction between the Quraish and Hiraql?","id":"tirmidhi-42-170"},{"hadith-eng":"\"When the Prophet of Allah (ﷺ) wanted to write to the foreigners, it was said to him: 'The foreigners do not accept a letter unless it has a seal.' So he had a ring made.\" He said: \"It is as if I am now looking at its whiteness in his hand.\"","reference":"Jami` at-Tirmidhi 2718, Book 42, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be inferred about the importance of cultural practices in diplomatic relations from this narration?","id":"tirmidhi-42-171"},{"hadith-eng":"\"Two of my companions and I went and presented ourselves to the Companions of the Prophet (ﷺ), for our hearing and sight had gone from suffering (hunger and thirst). But there was no one who would accept us. So we went to the Prophet (ﷺ) and he brought us to his family where there were three goats. The Prophet (ﷺ) said: 'Milk these.' We milked them, and each person drank his share, and we put aside a share for the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) came during the night and gave the Salam such that it would not wake the sleeping person, and the one who was awake could hear it. Then he went to the Masjid to per form Salat. Then he went for his drink and drank it.\"","reference":"Jami` at-Tirmidhi 2719, Book 42, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet's (ﷺ) behavior reflect his mindfulness and respect for the privacy and rest of others?","id":"tirmidhi-42-172"},{"hadith-eng":"that a man gave the Salam to the Prophet (ﷺ) while he was urinating, but the Prophet (ﷺ) did not return the Salam to him.\"","reference":"Jami` at-Tirmidhi 2720, Book 42, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's (ﷺ) behavior in different situations from this incident?","id":"tirmidhi-42-173"},{"hadith-eng":"from a man among his people, who said: \"I went looking for the Prophet (ﷺ) but I was not able to find him. So I sat down, and then I saw a group of people, and he was among them, but I did not recognize him. He was settling some matter between them so when he was finished, some of them stood up with him and they were saying: 'O Messenger of Allah.' When I saw that, I said: \"'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah!' He replied: 'Indeed \"'Alaikas-Salam (upon you be peace)\" is the greeting for the dead.' Then he came toward me and said: 'When a man meets his Muslim brother then he should say: \"As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh (peace be upon you, and the mercy and blessings of Allah).\" Then the Prophet (ﷺ) responded to my greeting, he said: 'And may Allah's mercy be upon you, and may Allah's mercy be upon you, and may Allah's mercy be upon you.'\"","reference":"Jami` at-Tirmidhi 2721, Book 42, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the greeting 'As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh' in Islam?","id":"tirmidhi-42-174"},{"hadith-eng":"from Abu Tamimah al-Hujaimi from Jabir bin Sulaim who said: \"I went to the Prophet (ﷺ) and I said: ''Alaikas-Salam (upon you be peace)' so he replied: 'Do not say \"'Alaikas-Salam\" rather say As-Salamu Alaik.'\" And he mentioned the story in its entirety.","reference":"Jami` at-Tirmidhi 2722, Book 42, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet (ﷺ) guide his companions in matters of speech and greeting?","id":"tirmidhi-42-175"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) would give the Salam he would do so three times, and when he would say a statement, he would say it three times.\"","reference":"Jami` at-Tirmidhi 2723, Book 42, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might repetition be an important aspect of conveying important messages in Islam?","id":"tirmidhi-42-176"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"","reference":"Jami` at-Tirmidhi 2724, Book 42, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does shyness or modesty affect one's standing with Allah?","id":"tirmidhi-42-177"},{"hadith-eng":"\"When we went to the Prophet (ﷺ), each of us would sit wherever he wound up at.\"","reference":"Jami` at-Tirmidhi 2725, Book 42, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does this narration reflect the simplicity and humility in the gatherings of the Prophet?","id":"tirmidhi-42-178"},{"hadith-eng":"\"From Abu Ishaq, from Al-Bara - and he did not hear it from him - the Messenger of Allah (ﷺ) passed by some people from the Ansar while they were sitting in the road. He said: 'If you people must do this, then return the Salam, assist the wronged, and give directions to the one who is on the route.\"","reference":"Jami` at-Tirmidhi 2726, Book 42, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can one provide guidance to someone who is lost or seeking directions?","id":"tirmidhi-42-179"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"No two Muslims meet each other and shake hands, except that Allah forgives them before they part.\"","reference":"Jami` at-Tirmidhi 2727, Book 42, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Allah's forgiveness manifest in the interactions between Muslims?","id":"tirmidhi-42-180"},{"hadith-eng":"that a man said: \"O Messenger of Allah! When a man among us meets his brother or his friend should he bow to him?\" He said: \"No.\" The man continued: \"Should he embrace him and kiss him?\" He said: \"No.\" He said: \"Should he take his hand and shake it?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 2728, Book 42, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the significance of handshaking in Islamic culture?","id":"tirmidhi-42-181"},{"hadith-eng":"that he asked Anas bin Malik: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake each other's hand?\" He said, \"Yes.\"","reference":"Jami` at-Tirmidhi 2729, Book 42, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does handshaking reflect the social interactions among the early Muslim community?","id":"tirmidhi-42-182"},{"hadith-eng":"that the Prophet (ﷺ) said: \"taking hold of the hand is from the completeness of the greeting.\"","reference":"Jami` at-Tirmidhi 2730, Book 42, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might physical contact be considered important in social interactions according to Islamic teachings?","id":"tirmidhi-42-183"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"","reference":"Jami` at-Tirmidhi 2731, Book 42, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does shaking hands contribute to the completion of greetings among people?","id":"tirmidhi-42-184"},{"hadith-eng":"\"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"\n\n(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.","reference":"Jami` at-Tirmidhi 2732, Book 42, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does this narration suggest about the Prophet Muhammad's (ﷺ) behavior in private settings?","id":"tirmidhi-42-185"},{"hadith-eng":"\"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"","reference":"Jami` at-Tirmidhi 2733, Book 42, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #4","question":"How did the Jews express their recognition of Prophet Muhammad (ﷺ) after questioning him?","id":"tirmidhi-42-186"},{"hadith-eng":"\"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"","reference":"Jami` at-Tirmidhi 2734, Book 42, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this event illustrate the Prophet's hospitality and welcoming nature?","id":"tirmidhi-42-187"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul! You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I inform you about a matter which if you do it, then you will love one another? Spread the Salam among each other.\"","reference":"Jami` at-Tirmidhi 2688, Book 42, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does spreading Salam contribute to building a harmonious community?","id":"tirmidhi-42-188"},{"hadith-eng":"\"A man came to the Prophet (ﷺ) and said: 'As-Salamu 'Alaykum (Peace be upon you).'\" [He said:] \"So the Prophet (ﷺ) said: 'Ten.' Then another came and he said: 'As-Salamu 'Alaykum Wa Rahmatullah (Peace be upon you, and the mercy of Allah).' So the Prophet (ﷺ) said: 'Twenty.' Then another came and said: 'As-Salamu 'Alaykum Wa Rahmatullahi Wa Barakatuh (Peace be upon you, and the mercy of Allah, and His Blessings).' So the Prophet (ﷺ) said: 'Thirty.'\"","reference":"Jami` at-Tirmidhi 2689, Book 42, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does adding 'Wa Rahmatullah' and 'Wa Barakatuh' to the greeting impact the reward?","id":"tirmidhi-42-189"},{"hadith-eng":"\"Abu Musa sought permission to enter upon 'Umar. He said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Once.' Then he was silent for some time. Then he said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: Twice.' Then he was silent for some time. Then he said: 'As-salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Three times.' Then he (Abu Musa) left. 'Umar said to the gate-keeper: 'What did he do?' He replied: 'He left.\" He said: 'Bring him to me.' So when he came, 'Umar said to him: 'What is this that you have done?' He said: 'The Sunnah.' He said: 'The Sunnah? By Allah! You had better bring me proof or a witness to clarify this, or I will do this or that to you.'\" He said \"So he came to us while we were sitting with Ansar. He said: 'O People of the Ansar! Are you not the most knowledgeable people about the Ahadith of the Messenger of Allah (ﷺ)? Did the Messenger of Allah (ﷺ) not say: \"Seeking permission is to be done three time. Either you are permitted, or other wise leave?\" The people began joking. Abu Sa'eed said: \"Then I raised my head toward him and said: \"Whatever punishment you are afflicted with because of this, then I shall be your partner in it.\" So he went to 'Umar to inform him him about it, and 'Umar said: \"I did not know about about this.\"","reference":"Jami` at-Tirmidhi 2690, Book 42, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of consulting knowledgeable individuals about the teachings of the Prophet (ﷺ)?","id":"tirmidhi-42-190"},{"hadith-eng":"\"A man enter the Masjid and performed Salat while the Messenger of Allah (ﷺ) was sitting at the back of the Masjid. Then he came to greet him, so the Prophet (ﷺ) said: \"Wa Alaikum (and upon you); go back and pray for indeed you have not prayed.'\" And he mentioned the Hadith in its entirety.","reference":"Jami` at-Tirmidhi 2692, Book 42, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the interaction between the man and the Prophet (ﷺ) highlight the importance of prayer in Islam?","id":"tirmidhi-42-191"},{"hadith-eng":"that 'Aishah narrated to him that he Messenger of Allah (ﷺ) said to her: \"Indeeed Jibril has sent Salam to you.\" She said: \"And upon him be peace and the mercy of Allah and His Blessings.\"","reference":"Jami` at-Tirmidhi 2693, Book 42, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the honor and status of Aishah in the Islamic tradition?","id":"tirmidhi-42-192"},{"hadith-eng":"\"They said: 'O Messenger of Allah! When two men meet, which of them initiates the Salam?' He said: 'The nearest of them to Allah.'\"","reference":"Jami` at-Tirmidhi 2694, Book 42, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can initiating Salam be seen as an act of piety or righteousness?","id":"tirmidhi-42-193"},{"hadith-eng":"from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"He is not one of us who resembles other than us, no who resembles the Jews nor the Christians. For indeed greeting of the Jews is pointing the finger, and the greeting of the Christians is waving with the hand.\"","reference":"Jami` at-Tirmidhi 2695, Book 42, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does the hadith imply about the cultural and religious boundaries in Islamic practice?","id":"tirmidhi-42-194"},{"hadith-eng":"\"I was walking with Thabit Al-Bunani. He passed by some boys, so he said Salam to them. Then Thabit said: 'I was with Anas when he passed by some boys and gave the Salam to them, and Anas said: I was with the Prophet (ﷺ) when he passed by some boys and he gave the Salam to them.'\"","reference":"Jami` at-Tirmidhi 2696, Book 42, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does giving Salam to others promote community and kindness in Islam?","id":"tirmidhi-42-195"},{"hadith-eng":"that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.","reference":"Jami` at-Tirmidhi 2697, Book 42, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this event reflect the social norms and practices during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-42-196"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"","reference":"Jami` at-Tirmidhi 2698, Book 42, Hadith 11","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role does Salam play in fostering family relationships in Islam?","id":"tirmidhi-42-197"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Salam is before talking.\"\nWith this chain it has been reported that the Prophet (ﷺ) said: \"Do not invite anyone to the food until the Salam is given.\"","reference":"Jami` at-Tirmidhi 2699, Book 42, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does giving Salam before talking promote harmony and respect in social interactions?","id":"tirmidhi-42-198"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one of you meets them in the path, then force them to its narrow portion.\"","reference":"Jami` at-Tirmidhi 2700, Book 42, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic teaching address coexistence with people of other religions?","id":"tirmidhi-42-199"},{"hadith-eng":"that a group of Jews entered upon the Prophet (ﷺ) and they said: \"As-Samu 'Alaik (death be upon you).\" So the Prophet (ﷺ) said: \"Wa 'Alaik (And upon you).\" So 'Aishah said: \"I said: '[Rather] upon you be death and the curse.'\" So the Prophet (ﷺ) said: \"O 'Aishah! Indeed Allah loves gentleness in every matter.\" 'Aishah said: \"Did you not hear what they said?\" He said: \"And I replied: 'And upon you.'\"","reference":"Jami` at-Tirmidhi 2701, Book 42, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam emphasize the importance of maintaining composure and kindness in difficult situations?","id":"tirmidhi-42-200"},{"hadith-eng":"that the Prophet (ﷺ) passed by a gathering in which the Muslims and the Jews were mixed, so he gave the Salam to them.","reference":"Jami` at-Tirmidhi 2702, Book 42, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet's behavior towards non-Muslims reflect Islamic teachings on interfaith relations?","id":"tirmidhi-42-201"},{"hadith-eng":"from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"\nIbn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"","reference":"Jami` at-Tirmidhi 2703, Book 42, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the guidelines for offering Salam in a group setting according to Islamic teachings?","id":"tirmidhi-42-202"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The horseman gives Salam to the walking person, the walking person to the one standing and the few to the many.\"","reference":"Jami` at-Tirmidhi 2705, Book 42, Hadith 18","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the social implications of the practice of Salam in fostering community and respect?","id":"tirmidhi-42-203"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you arrives at the gathering, then give the Salam, and if he is given a place to sit, then let him sit. Then when he stands, let him give the Salam, the first is more worthy than the last.\"","reference":"Jami` at-Tirmidhi 2706, Book 42, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the phrase 'the first is more worthy than the last' imply in the context of giving Salam?","id":"tirmidhi-42-204"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2707, Book 42, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of privacy in Islam apply to situations where a door is open or uncovered?","id":"tirmidhi-42-205"},{"hadith-eng":"that the Prophet (ﷺ) was in his house when a man looked in at him, so he lunged towards him with an arrow head, so the man backed up.","reference":"Jami` at-Tirmidhi 2708, Book 42, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this incident reflect the Prophet's (ﷺ) stance on personal boundaries?","id":"tirmidhi-42-206"},{"hadith-eng":"that a man peeked in on the Messenger of Allah (ﷺ), in one of the apartments of the Prophet (ﷺ), while the Prophet (ﷺ) had a Midrah (an iron comb) with which he was scratching his head. So the Prophet (ﷺ) said: \"If I knew that you were looking then I would have poked your eyes with it. Seeking permission has only been enjoined because of the sight.\"","reference":"Jami` at-Tirmidhi 2709, Book 42, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"What tools or objects are mentioned in the hadith related to the Prophet's response to privacy invasion?","id":"tirmidhi-42-207"},{"hadith-eng":"that 'Amr bin 'Abdullah bin Safwan informed him, that Kaladah bin Hanbal had informed him, that Safwan bin Umayyah sent him to bring some milk, colostrum, and Daghabis (a type of herb) to the Prophet (ﷺ) while he was in the upper valley. (He said): \"I entered upon him without seeking permission nor giving Salam. The Prophet (ﷺ) said: 'Go back and say: As-Salamu Alaykum, may I enter?'\" And that was after Safwan had accepted Islam.\"","reference":"Jami` at-Tirmidhi 2710, Book 42, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this incident teach about the changes in behavior expected after accepting Islam?","id":"tirmidhi-42-208"},{"hadith-eng":"\"I sought permission to enter upon the Prophet (ﷺ) regarding a debt my father owed, so he said: 'Who is this?' I said: 'Me.' He said: 'Me, me.'As if he disliked that.\"","reference":"Jami` at-Tirmidhi 2711, Book 42, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's (ﷺ) approach to addressing matters related to debts?","id":"tirmidhi-42-209"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you writes something, then let him Yutarrib (smeared with dust to dry the ink) it, for that is more conducive to the need.\"","reference":"Jami` at-Tirmidhi 2713, Book 42, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does the instruction to smear ink with dust suggest about the writing practices during the time of the Prophet (ﷺ)?","id":"tirmidhi-42-210"},{"hadith-eng":"\"I entered upon the Messenger of Allah (ﷺ) while there was a scribe in front of him, and I heard him saying: 'Put the pen on your ear, for that is more conducive to the scribe remembering.'\"","reference":"Jami` at-Tirmidhi 2714, Book 42, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #5","question":"What methods are recommended in Islam for enhancing memory and concentration?","id":"tirmidhi-42-211"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered me to learn some statements from writings of the Jews for him, and he said: 'For indeed by Allah! I do no trust the Jews with my letters.'\" He said: \"Half a month did not pass before I learned it, when he (ﷺ) wanted to write to the Jews I would write it to them, and when they wrote to him I would read their letters to him.\"","reference":"Jami` at-Tirmidhi 2715, Book 42, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this narration illustrate the importance of literacy and education in early Islamic society?","id":"tirmidhi-42-212"},{"hadith-eng":"\"Before he died, the Messenger of Allah (ﷺ) had written to Kisra, Ceasar, An-Najashi, and to every tyrant calling them to Allah. This An-Najashi is not the one that the Prophet (ﷺ) performed to the funeral Salat for.\"","reference":"Jami` at-Tirmidhi 2716, Book 42, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet's efforts in inviting leaders to Islam from this narration?","id":"tirmidhi-42-213"},{"hadith-eng":"that Abu Sufyan bin Harb informed him that Hiraql had sent for him while he was with a party of the Quraish, and they were trading in Ash-Sham, so they went to him.\" And he mentioned the Hadith and said: \"Then he called for the letter of the Messenger of Allah (ﷺ) to be read, and it said in it: 'In the Name of Allah, the Merciful, the Beneficent. From Muhammad, Allah's Slave and His Messenger, to Hiraql the leader of Rome. Peace be upon whoever follows the guidance. To proceed:\"","reference":"Jami` at-Tirmidhi 2717, Book 42, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the introduction of the letter reflect the Islamic greeting and message?","id":"tirmidhi-42-214"},{"hadith-eng":"\"When the Prophet of Allah (ﷺ) wanted to write to the foreigners, it was said to him: 'The foreigners do not accept a letter unless it has a seal.' So he had a ring made.\" He said: \"It is as if I am now looking at its whiteness in his hand.\"","reference":"Jami` at-Tirmidhi 2718, Book 42, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the description of the ring's whiteness in the Prophet's hand indicate about its significance or appearance?","id":"tirmidhi-42-215"},{"hadith-eng":"\"Two of my companions and I went and presented ourselves to the Companions of the Prophet (ﷺ), for our hearing and sight had gone from suffering (hunger and thirst). But there was no one who would accept us. So we went to the Prophet (ﷺ) and he brought us to his family where there were three goats. The Prophet (ﷺ) said: 'Milk these.' We milked them, and each person drank his share, and we put aside a share for the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) came during the night and gave the Salam such that it would not wake the sleeping person, and the one who was awake could hear it. Then he went to the Masjid to per form Salat. Then he went for his drink and drank it.\"","reference":"Jami` at-Tirmidhi 2719, Book 42, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does prayer play in the daily routine of the Prophet (ﷺ) as depicted in this narration?","id":"tirmidhi-42-216"},{"hadith-eng":"from a man among his people, who said: \"I went looking for the Prophet (ﷺ) but I was not able to find him. So I sat down, and then I saw a group of people, and he was among them, but I did not recognize him. He was settling some matter between them so when he was finished, some of them stood up with him and they were saying: 'O Messenger of Allah.' When I saw that, I said: \"'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah!' He replied: 'Indeed \"'Alaikas-Salam (upon you be peace)\" is the greeting for the dead.' Then he came toward me and said: 'When a man meets his Muslim brother then he should say: \"As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh (peace be upon you, and the mercy and blessings of Allah).\" Then the Prophet (ﷺ) responded to my greeting, he said: 'And may Allah's mercy be upon you, and may Allah's mercy be upon you, and may Allah's mercy be upon you.'\"","reference":"Jami` at-Tirmidhi 2721, Book 42, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad (ﷺ) respond to the greeting in this narration?","id":"tirmidhi-42-217"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) would give the Salam he would do so three times, and when he would say a statement, he would say it three times.\"","reference":"Jami` at-Tirmidhi 2723, Book 42, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the practice of repeating the Salam reflect on the Prophet's emphasis on greetings?","id":"tirmidhi-42-218"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"","reference":"Jami` at-Tirmidhi 2724, Book 42, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration teach about the importance of seeking closeness to religious knowledge?","id":"tirmidhi-42-219"},{"hadith-eng":"\"From Abu Ishaq, from Al-Bara - and he did not hear it from him - the Messenger of Allah (ﷺ) passed by some people from the Ansar while they were sitting in the road. He said: 'If you people must do this, then return the Salam, assist the wronged, and give directions to the one who is on the route.\"","reference":"Jami` at-Tirmidhi 2726, Book 42, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of returning Salam in Islamic social conduct?","id":"tirmidhi-42-220"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"No two Muslims meet each other and shake hands, except that Allah forgives them before they part.\"","reference":"Jami` at-Tirmidhi 2727, Book 42, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #5","question":"What actions can lead to forgiveness from Allah during social interactions among Muslims?","id":"tirmidhi-42-221"},{"hadith-eng":"that the Prophet (ﷺ) said: \"taking hold of the hand is from the completeness of the greeting.\"","reference":"Jami` at-Tirmidhi 2730, Book 42, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the act of shaking hands enhance the greeting process in Islam?","id":"tirmidhi-42-222"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"","reference":"Jami` at-Tirmidhi 2731, Book 42, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the etiquettes of greeting others in Islam?","id":"tirmidhi-42-223"},{"hadith-eng":"\"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"\n\n(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.","reference":"Jami` at-Tirmidhi 2732, Book 42, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this event illustrate the Prophet Muhammad's (ﷺ) humility and simplicity in his personal life?","id":"tirmidhi-42-224"},{"hadith-eng":"\"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"","reference":"Jami` at-Tirmidhi 2733, Book 42, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #5","question":"What specific commandment was given to the Jews regarding the Sabbath in the hadith?","id":"tirmidhi-42-225"},{"hadith-eng":"\"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"","reference":"Jami` at-Tirmidhi 2734, Book 42, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the practice of Ghusl from this narration?","id":"tirmidhi-42-226"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"","reference":"Jami` at-Tirmidhi 2724, Book 42, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does Allah respond to different attitudes towards religious gatherings?","id":"tirmidhi-42-227"},{"hadith-eng":"\"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"","reference":"Jami` at-Tirmidhi 2733, Book 42, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #6","question":"What was the concern of the Jews regarding their safety if they followed Prophet Muhammad (ﷺ)?","id":"tirmidhi-42-228"}]