[{"hadith-eng":"\"I traveled with the Prophet, Abu Bakr, Umar, and Uthman; they would pray Zuhr and Asr as two Rak'ah and two Rak'ah, not praying before them nor after them.\" And Ibn Umar said: \"If I was going to pray before it or after it then I would pray it complete.\"","reference":"Jami` at-Tirmidhi 544, Book 6, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of shortening prayers during travel in Islam?","id":"tirmidhi-6-1"},{"hadith-eng":"\"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 545, Book 6, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of shortening the prayer for travelers in Islam?","id":"tirmidhi-6-2"},{"hadith-eng":"\"We prayed Zuhr as four with the Prophet in Al-Madinah, and Asr as two Rak'ah in Dhil-Hulaifah.\"","reference":"Jami` at-Tirmidhi 546, Book 6, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing different numbers of Rak'ah for Zuhr and Asr prayers in different locations?","id":"tirmidhi-6-3"},{"hadith-eng":"\"The Prophet went from Al-Madinah to Makkah, not fearing anyone except Allah the Lord of the worlds, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 547, Book 6, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does this narration teach about the Prophet's reliance on Allah during his travels?","id":"tirmidhi-6-4"},{"hadith-eng":"that Anas bin Malik said: \"We went with the Messenger of Allah from Al-Madinah to Makkah, and he prayed two Rak'ah.\" He said: \"I said to Anas: 'How long did Messenger of Allah stay in Makkah?' He said: 'Ten (days).'\"","reference":"Jami` at-Tirmidhi 548, Book 6, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of shortening prayers during travel in Islam?","id":"tirmidhi-6-5"},{"hadith-eng":"\"The Messenger of Allah traveled on a journey and he prayed two Rak'ah for nineteen days.\" Ibn Abbas said: \"So when we would stay somewhere for nineteen (days) we would pray two Rak'ah , and if we stayed longer than that we would complete the Salat.\"","reference":"Jami` at-Tirmidhi 549, Book 6, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of shortening prayers during travel in Islam?","id":"tirmidhi-6-6"},{"hadith-eng":"\"I accompanied the Messenger of Allah on eighteen journeys, and I did not see him leave  the two  Rak'ah when the sun waned before Zuhr.\"","reference":"Jami` at-Tirmidhi 550, Book 6, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #1","question":"How many journeys did Al-Bara bin Azib accompany the Prophet on?","id":"tirmidhi-6-7"},{"hadith-eng":"\"I prayed Zuhr with the Prophet on a journey as two Rak'ah, and two Rak'ah after it.\"","reference":"Jami` at-Tirmidhi 551, Book 6, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #1","question":"How many Rak'ahs are performed for Zuhr prayer during travel according to Islamic teachings?","id":"tirmidhi-6-8"},{"hadith-eng":"\"I prayed with the Prophet both, while a resident and while traveling. So I prayed four for Zuhr with him as a resident, and two Rak'ah after it. I prayed two Rak'ah for Zuhr with him while traveling and two Rak'ah after it, and two Rak'ah for Asr, and he did not pray anything after it. Maghrib while a resident and traveling is the same; three Rak'ah, it is not decreased as a resident nor while traveling. It is Witr of the day, and after it are two Rak'ah.\"","reference":"Jami` at-Tirmidhi 552, Book 6, Hadith 9","grade":"Da'if(Darussalam)","question #":"question #1","question":"How does the number of Rak'ahs for Zuhr prayer differ when performed as a resident versus while traveling?","id":"tirmidhi-6-9"},{"hadith-eng":"\"While the Prophet as at the Battle of Tabuk, if he wanted to depart before the sun's decline he would delay Zuhr so that he could pray it together with Asr. If he wanted to depart after the sun's decline, he would hasten Asr to Zuhr, and pray Zuhr and Asr together, and then move it. If he wanted to depart before Maghrib he would delay Maghrib until he prayed it with Isha, and if he wanted to depart after Maghrib he would hasten Isha so that he would pray it along with Maghrib.\"","reference":"Jami` at-Tirmidhi 553, Book 6, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet manage prayer times during travel or battle situations?","id":"tirmidhi-6-10"},{"hadith-eng":"\"Ibn Umar had been requested to urgently attend to one of his wives, so he hurried en route and delayed Maghrib until the twilight disappeared, then he dismounted to combine them (the prayers). Then he informed them that the Messenger of Allah would do that when he was in a hurry on a trip.\"","reference":"Jami` at-Tirmidhi 555, Book 6, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on combining prayers during travel according to Islamic teachings?","id":"tirmidhi-6-11"},{"hadith-eng":"\"The Messenger of Allah went out with the people to seek rain. So he led them in prayer for two Rak'ah, reciting aloud in them, turning his upper wrap around, raising his hands, requesting rain, and facing the Qiblah.\"","reference":"Jami` at-Tirmidhi 556, Book 6, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing a special prayer when seeking rain in Islam?","id":"tirmidhi-6-12"},{"hadith-eng":"he saw the Messenger of Allah at Ahjar Az-Zait, supplicating for rain, and he was raising his hands in supplication.","reference":"Jami` at-Tirmidhi 557, Book 6, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of raising hands during supplication in Islamic practice?","id":"tirmidhi-6-13"},{"hadith-eng":"\"Al-Walid bin Uqbah, the governor of Al-Madinah, sent me to ask Ibn Abbas about how the Messenger of Allah would perform Salat Al-Istisqa. I came to him and he said: 'The Messenger of Allah would go out in modest dress, humbly, imploring, until he reached the Musalla. He would not give this Khutbah of yours, rather, he would continue supplication and imploring saying the Takbir, and pray two Rak'ah, just as he would pray for the Eid.'\"","reference":"Jami` at-Tirmidhi 558, Book 6, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #1","question":"How did the Prophet Muhammad perform the prayer for rain (Salat Al-Istisqa)?","id":"tirmidhi-6-14"},{"hadith-eng":"and he mentioned a similar narration and added: \"with humility\" to it.","reference":"Jami` at-Tirmidhi 559, Book 6, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of adding 'with humility' in the context of performing religious acts?","id":"tirmidhi-6-15"},{"hadith-eng":"\"The Prophet prayed during the eclipse. He recited, then bowed, then recited, then bowed, then recited, then bowed. (three times), then he performed two prostrations, and the next one (Rak'ah) was the same.\"","reference":"Jami` at-Tirmidhi 560, Book 6, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"How is the prayer during an eclipse performed according to Islamic tradition?","id":"tirmidhi-6-16"},{"hadith-eng":"\"The sun was eclipsed during the time of the Messenger of Allah, so the Messenger of Allah led the people in prayer. He recited a lengthy recitation, then he bowed a lengthy bowing, then he raised his head and recited a lengthy recitation that was less than the first. Then he bowed a lengthy bowing that was less than the first. Then he raised his head and prostrated. Then he did (similar to) that in the second Rak'ah.\"","reference":"Jami` at-Tirmidhi 561, Book 6, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing a special prayer during a solar eclipse in Islam?","id":"tirmidhi-6-17"},{"hadith-eng":"\"The Prophet led us in prayer during an eclipse; we did not hear his voice.\"","reference":"Jami` at-Tirmidhi 562, Book 6, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing prayer during a solar or lunar eclipse in Islam?","id":"tirmidhi-6-18"},{"hadith-eng":"\"The Prophet prayed the eclipse payer, and he recited aloud in it.\"","reference":"Jami` at-Tirmidhi 563, Book 6, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reciting aloud during the eclipse prayer?","id":"tirmidhi-6-19"},{"hadith-eng":"\"The Prophet prayed Salat Al-Khawf, praying one Rak'ah with one of the two groups, while the other group was facing the enemy. (When the first group finished they first Rak'ah with him), they went and took position (of the second group, facing the enemy). Then the second group came and he led them in another Rak'ah, then he said the Taslim to them, while the group proceeded to complete their (second) Rak'ah. Thereafter, the first group stood up to finish their (second) Rak'ah.\"","reference":"Jami` at-Tirmidhi 564, Book 6, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Salat Al-Khawf in Islamic practice?","id":"tirmidhi-6-20"},{"hadith-eng":"\"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"","reference":"Jami` at-Tirmidhi 565, Book 6, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the procedure for performing Salat Al-Khawf during times of danger or battle?","id":"tirmidhi-6-21"},{"hadith-eng":") Muhammad bin Bash-har said:\n\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)","reference":"Jami` at-Tirmidhi 566, Book 6, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of verifying the authenticity of a hadith through different chains of narrators?","id":"tirmidhi-6-22"},{"hadith-eng":"from Salih bin Khawwat, from someone who prayed Salat Al-Khawf with the Prophet, and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 567, Book 6, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is Salat Al-Khawf and in what circumstances is it performed?","id":"tirmidhi-6-23"},{"hadith-eng":"\"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 568, Book 6, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #1","question":"How many prostrations of recitation did the Prophet Muhammad perform according to this narration?","id":"tirmidhi-6-24"},{"hadith-eng":"\"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 569, Book 6, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #1","question":"How many prostrations did the narrator perform with the Prophet Muhammad (ﷺ)?","id":"tirmidhi-6-25"},{"hadith-eng":"\"We were with Ibn Umar, and he said: 'The Messenger of Allah said: \"Permit the women to go at night to the Masajid.\" His son said: 'By Allah! We would not permit them lest they become insidious from that.' So he (Abdullah) retorted: 'May Allah do and such with you.' I say: \"The Messenger of Allah said,\" and you say: \"We do not permit them?\"","reference":"Jami` at-Tirmidhi 570, Book 6, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of allowing women to attend mosques at night in Islam?","id":"tirmidhi-6-26"},{"hadith-eng":"the Messenger of Allah said: \"When you are in Salat then do not spit on your right, but behind you or toward your left, or under your left foot.\"","reference":"Jami` at-Tirmidhi 571, Book 6, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the etiquettes of spitting during prayer according to Islamic teachings?","id":"tirmidhi-6-27"},{"hadith-eng":"the Messenger of Allah said: \"To spit in the Masjid is a sin, and burying it is its atonement.\"","reference":"Jami` at-Tirmidhi 572, Book 6, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions are considered sinful in a mosque according to Islamic teachings?","id":"tirmidhi-6-28"},{"hadith-eng":"\"We prostrated with the Messenger of Allah in: 'Read! In the Name of your Lord' and 'When the heaven is split asunder.'\"","reference":"Jami` at-Tirmidhi 573, Book 6, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does prostration hold in the context of specific Quranic chapters?","id":"tirmidhi-6-29"},{"hadith-eng":"from the Prophet similarly.","reference":"Jami` at-Tirmidhi 574, Book 6, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who was the narrator of this hadith and what is its significance?","id":"tirmidhi-6-30"},{"hadith-eng":"\"The Messenger of Allah prostrated for it - meaning (in Surat) An-Najm - and so did the Muslims, the idolaters, the Jinns, and the people.\"","reference":"Jami` at-Tirmidhi 575, Book 6, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the act of prostration hold in Islamic practice?","id":"tirmidhi-6-31"},{"hadith-eng":"\"I recited Surat An-Najm to the Messenger of Allah, and he did not prostrate for it.\"","reference":"Jami` at-Tirmidhi 576, Book 6, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of prostration during the recitation of certain Surahs in the Quran?","id":"tirmidhi-6-32"},{"hadith-eng":"\"I saw the Messenger of Allah prostrating for (Surat) Sad.\" Ibn Abbas said: \"It is not one of the resolute prostrations.\"","reference":"Jami` at-Tirmidhi 577, Book 6, Hadith 34","grade":"","question #":"question #1","question":"What is the significance of prostration in Islamic prayer?","id":"tirmidhi-6-33"},{"hadith-eng":"\"I said: 'O Messenger of Allah! Surah Al-Hajj has been esteemed by two prostrations?' He said: 'Yes, and whoever does not prostrate for them, he should not recite them.'\"","reference":"Jami` at-Tirmidhi 578, Book 6, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing prostrations during the recitation of certain Surahs in the Quran?","id":"tirmidhi-6-34"},{"hadith-eng":"Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"","reference":"Jami` at-Tirmidhi 579, Book 6, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does dreaming hold in Islamic tradition, particularly when it involves religious acts like prayer?","id":"tirmidhi-6-35"},{"hadith-eng":"\"When the Messenger of Allah would prostrate (for recitation of) the Qur'an, he would say: (Sajada wajhiya lilladhi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.) (I have prostrated my face to the One Who created it, and made its hearing and vision, though His ability and power.)\"","reference":"Jami` at-Tirmidhi 580, Book 6, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of prostration in the context of reciting the Qur'an?","id":"tirmidhi-6-36"},{"hadith-eng":"the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"","reference":"Jami` at-Tirmidhi 581, Book 6, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of making up missed recitations according to Islamic teachings?","id":"tirmidhi-6-37"},{"hadith-eng":"\"Muhammad said: 'Does not the one who raises his head before the Imam fear that Allah will transform his head into a donkey's head?'\"","reference":"Jami` at-Tirmidhi 582, Book 6, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences of not following the Imam during prayer?","id":"tirmidhi-6-38"},{"hadith-eng":"'Mu'adh bin Jabal would pray Al-Maghrib with the Messenger of Allah, then he would return to his people to lead them (in prayer).\"","reference":"Jami` at-Tirmidhi 583, Book 6, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of leading prayers in a community after praying with the Prophet?","id":"tirmidhi-6-39"},{"hadith-eng":"\"When we prayed behind the Prophet in the midday heat, we would prostrate on our garments as a protection against the heat.\"","reference":"Jami` at-Tirmidhi 584, Book 6, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the companions of the Prophet adapt their prayer practices to cope with extreme weather conditions?","id":"tirmidhi-6-40"},{"hadith-eng":"\"When the Prophet prayed Fajr he would remain seated where he had prayed until the sun had risen.\"","reference":"Jami` at-Tirmidhi 585, Book 6, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of remaining seated after the Fajr prayer until the sun rises?","id":"tirmidhi-6-41"},{"hadith-eng":"the Messenger of Allah said: \"Whoever prays Fajr in congregation, then sits remembering Allah until the sun has risen, then he prays two Rak'ah, then for him is the reward like that of a Hajj and Umrah.\" He said: \"The Messenger of Allah said: 'Complete, complete, complete.'\"","reference":"Jami` at-Tirmidhi 586, Book 6, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of praying Fajr in congregation according to Islamic teachings?","id":"tirmidhi-6-42"},{"hadith-eng":"\"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"","reference":"Jami` at-Tirmidhi 587, Book 6, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of maintaining focus during Salat?","id":"tirmidhi-6-43"},{"hadith-eng":"\"The Prophet would glance during Salat\" and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 588, Book 6, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of maintaining focus during Salat?","id":"tirmidhi-6-44"},{"hadith-eng":"\"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if)","reference":"Jami` at-Tirmidhi 589, Book 6, Hadith 46","grade":"","question #":"question #1","question":"What is the significance of maintaining focus during obligatory prayers in Islam?","id":"tirmidhi-6-45"},{"hadith-eng":"\"I asked the Messenger of Allah about looking around during the Salat. He said: 'It is a portion which the Shaitan snatches during a man's prayer.'\"","reference":"Jami` at-Tirmidhi 590, Book 6, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of maintaining focus during prayer in Islam?","id":"tirmidhi-6-46"},{"hadith-eng":"the Messenger of Allah said: \"When one of you comes to the Salat and (finds) the Imam is in a position, then do as the Imam is doing.\"","reference":"Jami` at-Tirmidhi 591, Book 6, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #1","question":"What should a person do when they arrive late to a congregational prayer and the Imam is already in a certain position?","id":"tirmidhi-6-47"},{"hadith-eng":"the Messenger of Allah said: \"When the Iqamah is called for the prayer, then do not stand until you see that I have come out.\"","reference":"Jami` at-Tirmidhi 592, Book 6, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of waiting for the Imam before standing for prayer?","id":"tirmidhi-6-48"},{"hadith-eng":"\"I was prayed and the Prophet, Abu Bakr, and Umar were there, so when I sat, I started off with praising Allah, then sending Salat upon the Prophet, then supplicating for myself. So the Prophet said: 'Ask, your request will be granted, ask, your request will be ranted.'\"","reference":"Jami` at-Tirmidhi 593, Book 6, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of praising Allah before making a supplication?","id":"tirmidhi-6-49"},{"hadith-eng":"\"The Prophet ordered the construction of Masajid in all Dur and that they be kept clean and scented.\"","reference":"Jami` at-Tirmidhi 594, Book 6, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of building mosques in every neighborhood?","id":"tirmidhi-6-50"},{"hadith-eng":"\"That the Prophet ordered.\" And he mentioned similarly.","reference":"Jami` at-Tirmidhi 595, Book 6, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of following the Prophet's orders in Islamic teachings?","id":"tirmidhi-6-51"},{"hadith-eng":"\"That the Prophet ordered.\" And he mentioned similarly.","reference":"Jami` at-Tirmidhi 596, Book 6, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of following the Prophet's orders in Islamic teachings?","id":"tirmidhi-6-52"},{"hadith-eng":"the Prophet said: \"The Salat during the night and the day is two and two.\"","reference":"Jami` at-Tirmidhi 597, Book 6, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the prescribed number of rak'ahs for prayers during the night and day?","id":"tirmidhi-6-53"},{"hadith-eng":"\"We asked Ali about the prayer of the Messenger of Allah during the day. He said: 'You will not be able to do that.' We said: 'Whoever among is able (he will)?' So he said: 'When the sun appeared over there (east) like it appears here (west) at Asr, the Messenger of Allah would pray two Rak'ah, and when the sun appeared over there (east) like it appears here (west) at Zuhr, he would pray four Rak'ah. And he would pray four before Zuhr and two after it, and four before Asr separating between every two Rak'ah with At-Taslim upon the angels that are close (to Allah) and those who follow them among the believers, and the Muslims.\"","reference":"Jami` at-Tirmidhi 598, Book 6, Hadith 55","grade":"Hasan(Darussalam)","question #":"question #1","question":"What was Ali's response when asked about the Prophet's prayer during the day?","id":"tirmidhi-6-54"},{"hadith-eng":"from the Prophet similarly (no. 598).","reference":"Jami` at-Tirmidhi 599, Book 6, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narration in hadith literature?","id":"tirmidhi-6-55"},{"hadith-eng":"\"The Messenger of Allah would not pray in women's covers.\"","reference":"Jami` at-Tirmidhi 600, Book 6, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the guidelines for the type of clothing suitable for prayer in Islam?","id":"tirmidhi-6-56"},{"hadith-eng":"\"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.","reference":"Jami` at-Tirmidhi 601, Book 6, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #1","question":"What does this narration indicate about the Prophet's (ﷺ) behavior during prayer when interrupted?","id":"tirmidhi-6-57"},{"hadith-eng":"\"A man asked Abdullah bin Mas'ud about this phrase: 'Ghairi asin' or is it Yasin? So he said: 'You can recite all of the Quran besides this [phrase]?' He said: 'Yes.' He said: 'Indeed a people recite it, disbursing it like Ad-Daqqa are dispersed, without it passing their throats. Indeed I am aware of thesurahsthat are comparable which the Messenger of Allah would recite together.'\" He said: \"So we told Alqamah to ask him (what they were). He said: \"Twentysurahsfrom the Mufassal from which the Prophet would combine, reciting every two Surah in a Rak'ah.'\"","reference":"Jami` at-Tirmidhi 602, Book 6, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of understanding the correct pronunciation and recitation of Quranic phrases?","id":"tirmidhi-6-58"},{"hadith-eng":"the Prophet said: \"When a man performs Wudu and he performs his Wudu well, then he leaves to the Salat, and he did not leave - or he said: He had no urge - except for it, then there is not one step that he takes except that Allah raises him a degree from it, or removes a sin from him for it. \"","reference":"Jami` at-Tirmidhi 603, Book 6, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the benefits of performing Wudu with excellence before prayer?","id":"tirmidhi-6-59"},{"hadith-eng":"\"The Prophet prayed Maghrib in the Masjid of Banu Abdul-Ashbal, and some people stood to offer voluntary prayers, so the Prophet said: 'This Salat is to be performed by you in your homes.'\"","reference":"Jami` at-Tirmidhi 604, Book 6, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing voluntary prayers at home according to Islamic teachings?","id":"tirmidhi-6-60"},{"hadith-eng":"he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.","reference":"Jami` at-Tirmidhi 605, Book 6, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl upon accepting Islam?","id":"tirmidhi-6-61"},{"hadith-eng":"the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"","reference":"Jami` at-Tirmidhi 606, Book 6, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of saying 'Bismillah' before entering the restroom in Islamic teachings?","id":"tirmidhi-6-62"},{"hadith-eng":"the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"","reference":"Jami` at-Tirmidhi 607, Book 6, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does prostration hold in Islam, especially in the context of the Day of Resurrection?","id":"tirmidhi-6-63"},{"hadith-eng":"\"The Messenger of Allah would love to start with the right side when he purified himself, and when he combed, and when putting his sandals on.\"","reference":"Jami` at-Tirmidhi 608, Book 6, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of starting with the right side in personal grooming and purification?","id":"tirmidhi-6-64"},{"hadith-eng":"the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"","reference":"Jami` at-Tirmidhi 609, Book 6, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of using a specific amount of water in performing Wudu?","id":"tirmidhi-6-65"},{"hadith-eng":"the Messenger of Allah said, about urine of a male child that suckles: \"The urine of the boy is sprinkled, and the girl's urine is washed.\" Qatadah (one of the narrators) said: \"This is so, as long as they do not eat, when they eat, then both of them are washed.\"","reference":"Jami` at-Tirmidhi 610, Book 6, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the difference in the treatment of urine between male and female infants in Islamic teachings?","id":"tirmidhi-6-66"},{"hadith-eng":"\"I saw Jarir bin Abdullah performing Wudu and wiping over his Khuff.\" He said: \"So I asked him: 'What is that?' He said: 'I saw the Prophet performing Wudu and he wiped over his Khuff.' So I said to him: 'Before Al-Ma'idah or after Al-Ma'idah?' He said: 'I did not accept Islam until after Al-Ma'idah.'\"]","reference":"Jami` at-Tirmidhi 611, Book 6, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of wiping over the Khuff during Wudu in Islamic practice?","id":"tirmidhi-6-67"},{"hadith-eng":"(Another chain) from Khalid bin Ziyad with similar.","reference":"Jami` at-Tirmidhi 612, Book 6, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of verifying the authenticity of a narration in Islamic tradition?","id":"tirmidhi-6-68"},{"hadith-eng":"\"The Prophet permitted the Junub when he wanted to eat, drink, or sleep, to perform Wudu like the Wudu for Salat.\"","reference":"Jami` at-Tirmidhi 613, Book 6, Hadith 70","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of performing Wudu for someone in a state of Janabah before eating, drinking, or sleeping?","id":"tirmidhi-6-69"},{"hadith-eng":"\"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"","reference":"Jami` at-Tirmidhi 614, Book 6, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences of supporting oppressive leaders according to Islamic teachings?","id":"tirmidhi-6-70"},{"hadith-eng":"\"Ibn Numair narrated to us from Ubaidullah bin Musa, from Ghalib\" with this (Hadith).","reference":"Jami` at-Tirmidhi 615, Book 6, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who are the narrators involved in the transmission of this hadith?","id":"tirmidhi-6-71"},{"hadith-eng":"\"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"","reference":"Jami` at-Tirmidhi 616, Book 6, Hadith 73","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the key obligations mentioned for a Muslim to enter Paradise according to the Prophet's sermon during the Farewell Hajj?","id":"tirmidhi-6-72"},{"hadith-eng":"\"I traveled with the Prophet, Abu Bakr, Umar, and Uthman; they would pray Zuhr and Asr as two Rak'ah and two Rak'ah, not praying before them nor after them.\" And Ibn Umar said: \"If I was going to pray before it or after it then I would pray it complete.\"","reference":"Jami` at-Tirmidhi 544, Book 6, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet and his companions perform the Zuhr and Asr prayers while traveling?","id":"tirmidhi-6-73"},{"hadith-eng":"\"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 545, Book 6, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the practice of performing two Rak'ah during Hajj evolve during the leadership of the early caliphs?","id":"tirmidhi-6-74"},{"hadith-eng":"\"We prayed Zuhr as four with the Prophet in Al-Madinah, and Asr as two Rak'ah in Dhil-Hulaifah.\"","reference":"Jami` at-Tirmidhi 546, Book 6, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of shortening prayers relate to travel in Islamic tradition?","id":"tirmidhi-6-75"},{"hadith-eng":"\"The Prophet went from Al-Madinah to Makkah, not fearing anyone except Allah the Lord of the worlds, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 547, Book 6, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet's journey from Al-Madinah to Makkah demonstrate his trust in Allah?","id":"tirmidhi-6-76"},{"hadith-eng":"that Anas bin Malik said: \"We went with the Messenger of Allah from Al-Madinah to Makkah, and he prayed two Rak'ah.\" He said: \"I said to Anas: 'How long did Messenger of Allah stay in Makkah?' He said: 'Ten (days).'\"","reference":"Jami` at-Tirmidhi 548, Book 6, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long did the Prophet Muhammad stay in Makkah during this journey?","id":"tirmidhi-6-77"},{"hadith-eng":"\"The Messenger of Allah traveled on a journey and he prayed two Rak'ah for nineteen days.\" Ibn Abbas said: \"So when we would stay somewhere for nineteen (days) we would pray two Rak'ah , and if we stayed longer than that we would complete the Salat.\"","reference":"Jami` at-Tirmidhi 549, Book 6, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long can a traveler shorten their prayers according to Islamic teachings?","id":"tirmidhi-6-78"},{"hadith-eng":"\"I accompanied the Messenger of Allah on eighteen journeys, and I did not see him leave  the two  Rak'ah when the sun waned before Zuhr.\"","reference":"Jami` at-Tirmidhi 550, Book 6, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #2","question":"What specific prayer practice did the Prophet consistently perform before Zuhr?","id":"tirmidhi-6-79"},{"hadith-eng":"\"I prayed Zuhr with the Prophet on a journey as two Rak'ah, and two Rak'ah after it.\"","reference":"Jami` at-Tirmidhi 551, Book 6, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of performing additional Rak'ahs after the obligatory prayer while traveling?","id":"tirmidhi-6-80"},{"hadith-eng":"\"I prayed with the Prophet both, while a resident and while traveling. So I prayed four for Zuhr with him as a resident, and two Rak'ah after it. I prayed two Rak'ah for Zuhr with him while traveling and two Rak'ah after it, and two Rak'ah for Asr, and he did not pray anything after it. Maghrib while a resident and traveling is the same; three Rak'ah, it is not decreased as a resident nor while traveling. It is Witr of the day, and after it are two Rak'ah.\"","reference":"Jami` at-Tirmidhi 552, Book 6, Hadith 9","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of the Maghrib prayer in terms of its Rak'ahs when performed both as a resident and while traveling?","id":"tirmidhi-6-81"},{"hadith-eng":"\"While the Prophet as at the Battle of Tabuk, if he wanted to depart before the sun's decline he would delay Zuhr so that he could pray it together with Asr. If he wanted to depart after the sun's decline, he would hasten Asr to Zuhr, and pray Zuhr and Asr together, and then move it. If he wanted to depart before Maghrib he would delay Maghrib until he prayed it with Isha, and if he wanted to depart after Maghrib he would hasten Isha so that he would pray it along with Maghrib.\"","reference":"Jami` at-Tirmidhi 553, Book 6, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of combining prayers in Islam?","id":"tirmidhi-6-82"},{"hadith-eng":"\"Ibn Umar had been requested to urgently attend to one of his wives, so he hurried en route and delayed Maghrib until the twilight disappeared, then he dismounted to combine them (the prayers). Then he informed them that the Messenger of Allah would do that when he was in a hurry on a trip.\"","reference":"Jami` at-Tirmidhi 555, Book 6, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does urgency or necessity affect the timing of prayers in Islam?","id":"tirmidhi-6-83"},{"hadith-eng":"\"The Messenger of Allah went out with the people to seek rain. So he led them in prayer for two Rak'ah, reciting aloud in them, turning his upper wrap around, raising his hands, requesting rain, and facing the Qiblah.\"","reference":"Jami` at-Tirmidhi 556, Book 6, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad demonstrate the method of seeking rain through prayer?","id":"tirmidhi-6-84"},{"hadith-eng":"he saw the Messenger of Allah at Ahjar Az-Zait, supplicating for rain, and he was raising his hands in supplication.","reference":"Jami` at-Tirmidhi 557, Book 6, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the act of supplicating for rain?","id":"tirmidhi-6-85"},{"hadith-eng":"\"Al-Walid bin Uqbah, the governor of Al-Madinah, sent me to ask Ibn Abbas about how the Messenger of Allah would perform Salat Al-Istisqa. I came to him and he said: 'The Messenger of Allah would go out in modest dress, humbly, imploring, until he reached the Musalla. He would not give this Khutbah of yours, rather, he would continue supplication and imploring saying the Takbir, and pray two Rak'ah, just as he would pray for the Eid.'\"","reference":"Jami` at-Tirmidhi 558, Book 6, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of modesty and humility in seeking Allah's help during Salat Al-Istisqa?","id":"tirmidhi-6-86"},{"hadith-eng":"and he mentioned a similar narration and added: \"with humility\" to it.","reference":"Jami` at-Tirmidhi 559, Book 6, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does humility enhance the effectiveness of worship and supplication?","id":"tirmidhi-6-87"},{"hadith-eng":"\"The Prophet prayed during the eclipse. He recited, then bowed, then recited, then bowed, then recited, then bowed. (three times), then he performed two prostrations, and the next one (Rak'ah) was the same.\"","reference":"Jami` at-Tirmidhi 560, Book 6, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the specific actions involved in the eclipse prayer?","id":"tirmidhi-6-88"},{"hadith-eng":"\"The sun was eclipsed during the time of the Messenger of Allah, so the Messenger of Allah led the people in prayer. He recited a lengthy recitation, then he bowed a lengthy bowing, then he raised his head and recited a lengthy recitation that was less than the first. Then he bowed a lengthy bowing that was less than the first. Then he raised his head and prostrated. Then he did (similar to) that in the second Rak'ah.\"","reference":"Jami` at-Tirmidhi 561, Book 6, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad lead the prayer during the solar eclipse?","id":"tirmidhi-6-89"},{"hadith-eng":"\"The Prophet led us in prayer during an eclipse; we did not hear his voice.\"","reference":"Jami` at-Tirmidhi 562, Book 6, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad conduct the prayer during an eclipse?","id":"tirmidhi-6-90"},{"hadith-eng":"\"The Prophet prayed the eclipse payer, and he recited aloud in it.\"","reference":"Jami` at-Tirmidhi 563, Book 6, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet perform the eclipse prayer according to the narration?","id":"tirmidhi-6-91"},{"hadith-eng":"\"The Prophet prayed Salat Al-Khawf, praying one Rak'ah with one of the two groups, while the other group was facing the enemy. (When the first group finished they first Rak'ah with him), they went and took position (of the second group, facing the enemy). Then the second group came and he led them in another Rak'ah, then he said the Taslim to them, while the group proceeded to complete their (second) Rak'ah. Thereafter, the first group stood up to finish their (second) Rak'ah.\"","reference":"Jami` at-Tirmidhi 564, Book 6, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is Salat Al-Khawf performed during times of danger or conflict?","id":"tirmidhi-6-92"},{"hadith-eng":"\"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"","reference":"Jami` at-Tirmidhi 565, Book 6, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Imam lead the prayer when the congregation is divided during Salat Al-Khawf?","id":"tirmidhi-6-93"},{"hadith-eng":") Muhammad bin Bash-har said:\n\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)","reference":"Jami` at-Tirmidhi 566, Book 6, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the process of writing and recording hadiths contribute to their preservation?","id":"tirmidhi-6-94"},{"hadith-eng":"from Salih bin Khawwat, from someone who prayed Salat Al-Khawf with the Prophet, and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 567, Book 6, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who are the narrators involved in the transmission of this hadith?","id":"tirmidhi-6-95"},{"hadith-eng":"\"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 568, Book 6, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of performing prostrations of recitation in Islam?","id":"tirmidhi-6-96"},{"hadith-eng":"\"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 569, Book 6, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #2","question":"Which Surah is mentioned in the context of performing prostrations with the Prophet?","id":"tirmidhi-6-97"},{"hadith-eng":"\"We were with Ibn Umar, and he said: 'The Messenger of Allah said: \"Permit the women to go at night to the Masajid.\" His son said: 'By Allah! We would not permit them lest they become insidious from that.' So he (Abdullah) retorted: 'May Allah do and such with you.' I say: \"The Messenger of Allah said,\" and you say: \"We do not permit them?\"","reference":"Jami` at-Tirmidhi 570, Book 6, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one respond when a directive from the Prophet Muhammad is challenged or questioned?","id":"tirmidhi-6-98"},{"hadith-eng":"the Messenger of Allah said: \"When you are in Salat then do not spit on your right, but behind you or toward your left, or under your left foot.\"","reference":"Jami` at-Tirmidhi 571, Book 6, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it advised not to spit to the right while in prayer?","id":"tirmidhi-6-99"},{"hadith-eng":"the Messenger of Allah said: \"To spit in the Masjid is a sin, and burying it is its atonement.\"","reference":"Jami` at-Tirmidhi 572, Book 6, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can one atone for the sin of spitting in a mosque?","id":"tirmidhi-6-100"},{"hadith-eng":"\"We prostrated with the Messenger of Allah in: 'Read! In the Name of your Lord' and 'When the heaven is split asunder.'\"","reference":"Jami` at-Tirmidhi 573, Book 6, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) follow his actions during prayer?","id":"tirmidhi-6-101"},{"hadith-eng":"from the Prophet similarly.","reference":"Jami` at-Tirmidhi 574, Book 6, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the importance of verifying the chain of narration in hadith literature?","id":"tirmidhi-6-102"},{"hadith-eng":"\"The Messenger of Allah prostrated for it - meaning (in Surat) An-Najm - and so did the Muslims, the idolaters, the Jinns, and the people.\"","reference":"Jami` at-Tirmidhi 575, Book 6, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did different groups, including Muslims and non-Muslims, respond to the recitation of Surat An-Najm?","id":"tirmidhi-6-103"},{"hadith-eng":"\"I recited Surat An-Najm to the Messenger of Allah, and he did not prostrate for it.\"","reference":"Jami` at-Tirmidhi 576, Book 6, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"Are there specific Surahs in the Quran that require prostration upon recitation?","id":"tirmidhi-6-104"},{"hadith-eng":"\"I saw the Messenger of Allah prostrating for (Surat) Sad.\" Ibn Abbas said: \"It is not one of the resolute prostrations.\"","reference":"Jami` at-Tirmidhi 577, Book 6, Hadith 34","grade":"","question #":"question #2","question":"How does one determine which prostrations are considered resolute in Islam?","id":"tirmidhi-6-105"},{"hadith-eng":"\"I said: 'O Messenger of Allah! Surah Al-Hajj has been esteemed by two prostrations?' He said: 'Yes, and whoever does not prostrate for them, he should not recite them.'\"","reference":"Jami` at-Tirmidhi 578, Book 6, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #2","question":"What should one do if they choose not to perform the prostrations mentioned in Surah Al-Hajj?","id":"tirmidhi-6-106"},{"hadith-eng":"Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"","reference":"Jami` at-Tirmidhi 579, Book 6, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the act of prostration viewed in Islam, and what spiritual benefits are associated with it?","id":"tirmidhi-6-107"},{"hadith-eng":"\"When the Messenger of Allah would prostrate (for recitation of) the Qur'an, he would say: (Sajada wajhiya lilladhi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.) (I have prostrated my face to the One Who created it, and made its hearing and vision, though His ability and power.)\"","reference":"Jami` at-Tirmidhi 580, Book 6, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does acknowledging Allah's creation and power manifest in the act of prostration?","id":"tirmidhi-6-108"},{"hadith-eng":"the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"","reference":"Jami` at-Tirmidhi 581, Book 6, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of reciting missed sections affect its reward in Islam?","id":"tirmidhi-6-109"},{"hadith-eng":"\"Muhammad said: 'Does not the one who raises his head before the Imam fear that Allah will transform his head into a donkey's head?'\"","reference":"Jami` at-Tirmidhi 582, Book 6, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to maintain proper order and discipline in congregational prayers?","id":"tirmidhi-6-110"},{"hadith-eng":"'Mu'adh bin Jabal would pray Al-Maghrib with the Messenger of Allah, then he would return to his people to lead them (in prayer).\"","reference":"Jami` at-Tirmidhi 583, Book 6, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did companions of the Prophet manage their prayer obligations with their community?","id":"tirmidhi-6-111"},{"hadith-eng":"\"When we prayed behind the Prophet in the midday heat, we would prostrate on our garments as a protection against the heat.\"","reference":"Jami` at-Tirmidhi 584, Book 6, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #2","question":"What does this narration suggest about the flexibility of Islamic practices in response to environmental challenges?","id":"tirmidhi-6-112"},{"hadith-eng":"\"When the Prophet prayed Fajr he would remain seated where he had prayed until the sun had risen.\"","reference":"Jami` at-Tirmidhi 585, Book 6, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) spend his time after completing the Fajr prayer?","id":"tirmidhi-6-113"},{"hadith-eng":"the Messenger of Allah said: \"Whoever prays Fajr in congregation, then sits remembering Allah until the sun has risen, then he prays two Rak'ah, then for him is the reward like that of a Hajj and Umrah.\" He said: \"The Messenger of Allah said: 'Complete, complete, complete.'\"","reference":"Jami` at-Tirmidhi 586, Book 6, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does remembering Allah after Fajr prayer contribute to spiritual rewards?","id":"tirmidhi-6-114"},{"hadith-eng":"\"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"","reference":"Jami` at-Tirmidhi 587, Book 6, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should one manage distractions during prayer according to Islamic teachings?","id":"tirmidhi-6-115"},{"hadith-eng":"\"The Prophet would glance during Salat\" and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 588, Book 6, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) conduct himself during prayer?","id":"tirmidhi-6-116"},{"hadith-eng":"\"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if)","reference":"Jami` at-Tirmidhi 589, Book 6, Hadith 46","grade":"","question #":"question #2","question":"Why is looking around during prayer considered detrimental in Islamic teachings?","id":"tirmidhi-6-117"},{"hadith-eng":"\"I asked the Messenger of Allah about looking around during the Salat. He said: 'It is a portion which the Shaitan snatches during a man's prayer.'\"","reference":"Jami` at-Tirmidhi 590, Book 6, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does distraction during prayer affect its spiritual value?","id":"tirmidhi-6-118"},{"hadith-eng":"the Messenger of Allah said: \"When one of you comes to the Salat and (finds) the Imam is in a position, then do as the Imam is doing.\"","reference":"Jami` at-Tirmidhi 591, Book 6, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #2","question":"How should a follower in prayer synchronize their actions with the Imam during Salat?","id":"tirmidhi-6-119"},{"hadith-eng":"the Messenger of Allah said: \"When the Iqamah is called for the prayer, then do not stand until you see that I have come out.\"","reference":"Jami` at-Tirmidhi 592, Book 6, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of standing for prayer relate to the Iqamah?","id":"tirmidhi-6-120"},{"hadith-eng":"\"I was prayed and the Prophet, Abu Bakr, and Umar were there, so when I sat, I started off with praising Allah, then sending Salat upon the Prophet, then supplicating for myself. So the Prophet said: 'Ask, your request will be granted, ask, your request will be ranted.'\"","reference":"Jami` at-Tirmidhi 593, Book 6, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does sending Salat upon the Prophet influence the acceptance of a supplication?","id":"tirmidhi-6-121"},{"hadith-eng":"\"The Prophet ordered the construction of Masajid in all Dur and that they be kept clean and scented.\"","reference":"Jami` at-Tirmidhi 594, Book 6, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to maintain cleanliness in mosques?","id":"tirmidhi-6-122"},{"hadith-eng":"\"That the Prophet ordered.\" And he mentioned similarly.","reference":"Jami` at-Tirmidhi 595, Book 6, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the chain of narration impact the authenticity of a hadith?","id":"tirmidhi-6-123"},{"hadith-eng":"\"That the Prophet ordered.\" And he mentioned similarly.","reference":"Jami` at-Tirmidhi 596, Book 6, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the chain of narration impact the authenticity of a hadith?","id":"tirmidhi-6-124"},{"hadith-eng":"the Prophet said: \"The Salat during the night and the day is two and two.\"","reference":"Jami` at-Tirmidhi 597, Book 6, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are the units of prayer structured according to Islamic teachings?","id":"tirmidhi-6-125"},{"hadith-eng":"\"We asked Ali about the prayer of the Messenger of Allah during the day. He said: 'You will not be able to do that.' We said: 'Whoever among is able (he will)?' So he said: 'When the sun appeared over there (east) like it appears here (west) at Asr, the Messenger of Allah would pray two Rak'ah, and when the sun appeared over there (east) like it appears here (west) at Zuhr, he would pray four Rak'ah. And he would pray four before Zuhr and two after it, and four before Asr separating between every two Rak'ah with At-Taslim upon the angels that are close (to Allah) and those who follow them among the believers, and the Muslims.\"","reference":"Jami` at-Tirmidhi 598, Book 6, Hadith 55","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad structure his prayers in relation to the position of the sun?","id":"tirmidhi-6-126"},{"hadith-eng":"from the Prophet similarly (no. 598).","reference":"Jami` at-Tirmidhi 599, Book 6, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the consistency of a hadith across different narrations affect its authenticity?","id":"tirmidhi-6-127"},{"hadith-eng":"\"The Messenger of Allah would not pray in women's covers.\"","reference":"Jami` at-Tirmidhi 600, Book 6, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the choice of clothing impact the validity of prayer in Islamic teachings?","id":"tirmidhi-6-128"},{"hadith-eng":"\"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.","reference":"Jami` at-Tirmidhi 601, Book 6, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the direction of the door in relation to the Qiblah play a role in this event?","id":"tirmidhi-6-129"},{"hadith-eng":"\"A man asked Abdullah bin Mas'ud about this phrase: 'Ghairi asin' or is it Yasin? So he said: 'You can recite all of the Quran besides this [phrase]?' He said: 'Yes.' He said: 'Indeed a people recite it, disbursing it like Ad-Daqqa are dispersed, without it passing their throats. Indeed I am aware of thesurahsthat are comparable which the Messenger of Allah would recite together.'\" He said: \"So we told Alqamah to ask him (what they were). He said: \"Twentysurahsfrom the Mufassal from which the Prophet would combine, reciting every two Surah in a Rak'ah.'\"","reference":"Jami` at-Tirmidhi 602, Book 6, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the recitation of the Quran impact the spiritual state of a person according to Islamic teachings?","id":"tirmidhi-6-130"},{"hadith-eng":"the Prophet said: \"When a man performs Wudu and he performs his Wudu well, then he leaves to the Salat, and he did not leave - or he said: He had no urge - except for it, then there is not one step that he takes except that Allah raises him a degree from it, or removes a sin from him for it. \"","reference":"Jami` at-Tirmidhi 603, Book 6, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does performing Wudu and attending prayer affect a person's spiritual status?","id":"tirmidhi-6-131"},{"hadith-eng":"\"The Prophet prayed Maghrib in the Masjid of Banu Abdul-Ashbal, and some people stood to offer voluntary prayers, so the Prophet said: 'This Salat is to be performed by you in your homes.'\"","reference":"Jami` at-Tirmidhi 604, Book 6, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the location of performing voluntary prayers affect their spiritual value?","id":"tirmidhi-6-132"},{"hadith-eng":"he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.","reference":"Jami` at-Tirmidhi 605, Book 6, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the role of Sidr in the process of Ghusl?","id":"tirmidhi-6-133"},{"hadith-eng":"the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"","reference":"Jami` at-Tirmidhi 606, Book 6, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does saying 'Bismillah' provide protection from jinns according to Islamic beliefs?","id":"tirmidhi-6-134"},{"hadith-eng":"the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"","reference":"Jami` at-Tirmidhi 607, Book 6, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does performing Wudu contribute to a person's spiritual state on the Day of Judgment?","id":"tirmidhi-6-135"},{"hadith-eng":"\"The Messenger of Allah would love to start with the right side when he purified himself, and when he combed, and when putting his sandals on.\"","reference":"Jami` at-Tirmidhi 608, Book 6, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad demonstrate his preference for using the right side in daily activities?","id":"tirmidhi-6-136"},{"hadith-eng":"the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"","reference":"Jami` at-Tirmidhi 609, Book 6, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of moderation apply to the practice of Wudu in Islam?","id":"tirmidhi-6-137"},{"hadith-eng":"the Messenger of Allah said, about urine of a male child that suckles: \"The urine of the boy is sprinkled, and the girl's urine is washed.\" Qatadah (one of the narrators) said: \"This is so, as long as they do not eat, when they eat, then both of them are washed.\"","reference":"Jami` at-Tirmidhi 610, Book 6, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the dietary status of an infant affect the cleaning process of their urine?","id":"tirmidhi-6-138"},{"hadith-eng":"\"I saw Jarir bin Abdullah performing Wudu and wiping over his Khuff.\" He said: \"So I asked him: 'What is that?' He said: 'I saw the Prophet performing Wudu and he wiped over his Khuff.' So I said to him: 'Before Al-Ma'idah or after Al-Ma'idah?' He said: 'I did not accept Islam until after Al-Ma'idah.'\"]","reference":"Jami` at-Tirmidhi 611, Book 6, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the timing of one's conversion to Islam affect their understanding of certain practices?","id":"tirmidhi-6-139"},{"hadith-eng":"(Another chain) from Khalid bin Ziyad with similar.","reference":"Jami` at-Tirmidhi 612, Book 6, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the chain of narrators affect the credibility of a hadith?","id":"tirmidhi-6-140"},{"hadith-eng":"\"The Prophet permitted the Junub when he wanted to eat, drink, or sleep, to perform Wudu like the Wudu for Salat.\"","reference":"Jami` at-Tirmidhi 613, Book 6, Hadith 70","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does performing Wudu relate to the state of ritual impurity in Islam?","id":"tirmidhi-6-141"},{"hadith-eng":"\"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"","reference":"Jami` at-Tirmidhi 614, Book 6, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does one maintain a connection with the Prophet Muhammad at the Hawd?","id":"tirmidhi-6-142"},{"hadith-eng":"\"Ibn Numair narrated to us from Ubaidullah bin Musa, from Ghalib\" with this (Hadith).","reference":"Jami` at-Tirmidhi 615, Book 6, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of the chain of narrators in the authentication of hadiths?","id":"tirmidhi-6-143"},{"hadith-eng":"\"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"","reference":"Jami` at-Tirmidhi 616, Book 6, Hadith 73","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of Taqwa relate to the practices of prayer, fasting, and paying Zakat?","id":"tirmidhi-6-144"},{"hadith-eng":"\"I traveled with the Prophet, Abu Bakr, Umar, and Uthman; they would pray Zuhr and Asr as two Rak'ah and two Rak'ah, not praying before them nor after them.\" And Ibn Umar said: \"If I was going to pray before it or after it then I would pray it complete.\"","reference":"Jami` at-Tirmidhi 544, Book 6, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the ruling on performing additional prayers before or after the obligatory prayers during travel?","id":"tirmidhi-6-145"},{"hadith-eng":"\"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 545, Book 6, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the consistency of religious practices from the actions of the Prophet and the early caliphs?","id":"tirmidhi-6-146"},{"hadith-eng":"\"We prayed Zuhr as four with the Prophet in Al-Madinah, and Asr as two Rak'ah in Dhil-Hulaifah.\"","reference":"Jami` at-Tirmidhi 546, Book 6, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which Muslims are allowed to shorten their prayers?","id":"tirmidhi-6-147"},{"hadith-eng":"\"The Prophet went from Al-Madinah to Makkah, not fearing anyone except Allah the Lord of the worlds, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 547, Book 6, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance does praying two Rak'ah hold in the context of travel according to this narration?","id":"tirmidhi-6-148"},{"hadith-eng":"that Anas bin Malik said: \"We went with the Messenger of Allah from Al-Madinah to Makkah, and he prayed two Rak'ah.\" He said: \"I said to Anas: 'How long did Messenger of Allah stay in Makkah?' He said: 'Ten (days).'\"","reference":"Jami` at-Tirmidhi 548, Book 6, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the Prophet's travel practices from this narration?","id":"tirmidhi-6-149"},{"hadith-eng":"\"The Messenger of Allah traveled on a journey and he prayed two Rak'ah for nineteen days.\" Ibn Abbas said: \"So when we would stay somewhere for nineteen (days) we would pray two Rak'ah , and if we stayed longer than that we would complete the Salat.\"","reference":"Jami` at-Tirmidhi 549, Book 6, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What did Ibn Abbas practice regarding prayer when staying in a place for nineteen days?","id":"tirmidhi-6-150"},{"hadith-eng":"\"I accompanied the Messenger of Allah on eighteen journeys, and I did not see him leave  the two  Rak'ah when the sun waned before Zuhr.\"","reference":"Jami` at-Tirmidhi 550, Book 6, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of performing two Rak'ah when the sun wanes?","id":"tirmidhi-6-151"},{"hadith-eng":"\"I prayed Zuhr with the Prophet on a journey as two Rak'ah, and two Rak'ah after it.\"","reference":"Jami` at-Tirmidhi 551, Book 6, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the practice of shortening prayers during travel reflect the flexibility in Islamic worship?","id":"tirmidhi-6-152"},{"hadith-eng":"\"I prayed with the Prophet both, while a resident and while traveling. So I prayed four for Zuhr with him as a resident, and two Rak'ah after it. I prayed two Rak'ah for Zuhr with him while traveling and two Rak'ah after it, and two Rak'ah for Asr, and he did not pray anything after it. Maghrib while a resident and traveling is the same; three Rak'ah, it is not decreased as a resident nor while traveling. It is Witr of the day, and after it are two Rak'ah.\"","reference":"Jami` at-Tirmidhi 552, Book 6, Hadith 9","grade":"Da'if(Darussalam)","question #":"question #3","question":"What additional prayers are performed after the Zuhr prayer when traveling according to this narration?","id":"tirmidhi-6-153"},{"hadith-eng":"\"While the Prophet as at the Battle of Tabuk, if he wanted to depart before the sun's decline he would delay Zuhr so that he could pray it together with Asr. If he wanted to depart after the sun's decline, he would hasten Asr to Zuhr, and pray Zuhr and Asr together, and then move it. If he wanted to depart before Maghrib he would delay Maghrib until he prayed it with Isha, and if he wanted to depart after Maghrib he would hasten Isha so that he would pray it along with Maghrib.\"","reference":"Jami` at-Tirmidhi 553, Book 6, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the timing of departure influence the combining of prayers?","id":"tirmidhi-6-154"},{"hadith-eng":"\"Ibn Umar had been requested to urgently attend to one of his wives, so he hurried en route and delayed Maghrib until the twilight disappeared, then he dismounted to combine them (the prayers). Then he informed them that the Messenger of Allah would do that when he was in a hurry on a trip.\"","reference":"Jami` at-Tirmidhi 555, Book 6, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which a Muslim can delay or combine prayers?","id":"tirmidhi-6-155"},{"hadith-eng":"\"The Messenger of Allah went out with the people to seek rain. So he led them in prayer for two Rak'ah, reciting aloud in them, turning his upper wrap around, raising his hands, requesting rain, and facing the Qiblah.\"","reference":"Jami` at-Tirmidhi 556, Book 6, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions are involved in the prayer for rain according to Islamic tradition?","id":"tirmidhi-6-156"},{"hadith-eng":"he saw the Messenger of Allah at Ahjar Az-Zait, supplicating for rain, and he was raising his hands in supplication.","reference":"Jami` at-Tirmidhi 557, Book 6, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the practices associated with seeking rain through prayer in Islam?","id":"tirmidhi-6-157"},{"hadith-eng":"\"Al-Walid bin Uqbah, the governor of Al-Madinah, sent me to ask Ibn Abbas about how the Messenger of Allah would perform Salat Al-Istisqa. I came to him and he said: 'The Messenger of Allah would go out in modest dress, humbly, imploring, until he reached the Musalla. He would not give this Khutbah of yours, rather, he would continue supplication and imploring saying the Takbir, and pray two Rak'ah, just as he would pray for the Eid.'\"","reference":"Jami` at-Tirmidhi 558, Book 6, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the Salat Al-Istisqa differ from the regular Friday sermon or Khutbah?","id":"tirmidhi-6-158"},{"hadith-eng":"and he mentioned a similar narration and added: \"with humility\" to it.","reference":"Jami` at-Tirmidhi 559, Book 6, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why is humility considered an important aspect in the practice of faith?","id":"tirmidhi-6-159"},{"hadith-eng":"\"The Prophet prayed during the eclipse. He recited, then bowed, then recited, then bowed, then recited, then bowed. (three times), then he performed two prostrations, and the next one (Rak'ah) was the same.\"","reference":"Jami` at-Tirmidhi 560, Book 6, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"How many times did the Prophet bow during the eclipse prayer?","id":"tirmidhi-6-160"},{"hadith-eng":"\"The sun was eclipsed during the time of the Messenger of Allah, so the Messenger of Allah led the people in prayer. He recited a lengthy recitation, then he bowed a lengthy bowing, then he raised his head and recited a lengthy recitation that was less than the first. Then he bowed a lengthy bowing that was less than the first. Then he raised his head and prostrated. Then he did (similar to) that in the second Rak'ah.\"","reference":"Jami` at-Tirmidhi 561, Book 6, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the steps involved in the prayer performed during a solar eclipse according to Islamic tradition?","id":"tirmidhi-6-161"},{"hadith-eng":"\"The Prophet led us in prayer during an eclipse; we did not hear his voice.\"","reference":"Jami` at-Tirmidhi 562, Book 6, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's recitation during the eclipse prayer?","id":"tirmidhi-6-162"},{"hadith-eng":"\"The Prophet prayed the eclipse payer, and he recited aloud in it.\"","reference":"Jami` at-Tirmidhi 563, Book 6, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the characteristics of the eclipse prayer in Islamic tradition?","id":"tirmidhi-6-163"},{"hadith-eng":"\"The Prophet prayed Salat Al-Khawf, praying one Rak'ah with one of the two groups, while the other group was facing the enemy. (When the first group finished they first Rak'ah with him), they went and took position (of the second group, facing the enemy). Then the second group came and he led them in another Rak'ah, then he said the Taslim to them, while the group proceeded to complete their (second) Rak'ah. Thereafter, the first group stood up to finish their (second) Rak'ah.\"","reference":"Jami` at-Tirmidhi 564, Book 6, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of the Imam in leading Salat Al-Khawf?","id":"tirmidhi-6-164"},{"hadith-eng":"\"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"","reference":"Jami` at-Tirmidhi 565, Book 6, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the congregation alternating positions during Salat Al-Khawf?","id":"tirmidhi-6-165"},{"hadith-eng":") Muhammad bin Bash-har said:\n\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)","reference":"Jami` at-Tirmidhi 566, Book 6, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-6-166"},{"hadith-eng":"from Salih bin Khawwat, from someone who prayed Salat Al-Khawf with the Prophet, and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 567, Book 6, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of having multiple narrators in the chain of a hadith?","id":"tirmidhi-6-167"},{"hadith-eng":"\"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 568, Book 6, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #3","question":"Which Surah is mentioned in the context of performing prostrations of recitation?","id":"tirmidhi-6-168"},{"hadith-eng":"\"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 569, Book 6, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of performing prostrations during prayer in Islam?","id":"tirmidhi-6-169"},{"hadith-eng":"\"We were with Ibn Umar, and he said: 'The Messenger of Allah said: \"Permit the women to go at night to the Masajid.\" His son said: 'By Allah! We would not permit them lest they become insidious from that.' So he (Abdullah) retorted: 'May Allah do and such with you.' I say: \"The Messenger of Allah said,\" and you say: \"We do not permit them?\"","reference":"Jami` at-Tirmidhi 570, Book 6, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential concerns regarding women attending mosques at night, according to some viewpoints?","id":"tirmidhi-6-170"},{"hadith-eng":"the Messenger of Allah said: \"When you are in Salat then do not spit on your right, but behind you or toward your left, or under your left foot.\"","reference":"Jami` at-Tirmidhi 571, Book 6, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the permissible directions for spitting during Salat?","id":"tirmidhi-6-171"},{"hadith-eng":"the Messenger of Allah said: \"To spit in the Masjid is a sin, and burying it is its atonement.\"","reference":"Jami` at-Tirmidhi 572, Book 6, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of maintaining cleanliness in a mosque?","id":"tirmidhi-6-172"},{"hadith-eng":"\"We prostrated with the Messenger of Allah in: 'Read! In the Name of your Lord' and 'When the heaven is split asunder.'\"","reference":"Jami` at-Tirmidhi 573, Book 6, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of prostrating upon reciting certain verses of the Quran?","id":"tirmidhi-6-173"},{"hadith-eng":"from the Prophet similarly.","reference":"Jami` at-Tirmidhi 574, Book 6, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the classification of hadiths affect their application in Islamic teachings?","id":"tirmidhi-6-174"},{"hadith-eng":"\"The Messenger of Allah prostrated for it - meaning (in Surat) An-Najm - and so did the Muslims, the idolaters, the Jinns, and the people.\"","reference":"Jami` at-Tirmidhi 575, Book 6, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of Jinns in Islamic teachings, particularly in acts of worship?","id":"tirmidhi-6-175"},{"hadith-eng":"\"I recited Surat An-Najm to the Messenger of Allah, and he did not prostrate for it.\"","reference":"Jami` at-Tirmidhi 576, Book 6, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the circumstances under which prostration is not performed during the recitation of a Surah?","id":"tirmidhi-6-176"},{"hadith-eng":"\"I saw the Messenger of Allah prostrating for (Surat) Sad.\" Ibn Abbas said: \"It is not one of the resolute prostrations.\"","reference":"Jami` at-Tirmidhi 577, Book 6, Hadith 34","grade":"","question #":"question #3","question":"What is the role of specific surahs in determining the practice of prostration during prayer?","id":"tirmidhi-6-177"},{"hadith-eng":"\"I said: 'O Messenger of Allah! Surah Al-Hajj has been esteemed by two prostrations?' He said: 'Yes, and whoever does not prostrate for them, he should not recite them.'\"","reference":"Jami` at-Tirmidhi 578, Book 6, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the act of prostration relate to the recitation of Surah Al-Hajj?","id":"tirmidhi-6-178"},{"hadith-eng":"Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"","reference":"Jami` at-Tirmidhi 579, Book 6, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the importance of seeking rewards and forgiveness from Allah in Islamic prayers?","id":"tirmidhi-6-179"},{"hadith-eng":"\"When the Messenger of Allah would prostrate (for recitation of) the Qur'an, he would say: (Sajada wajhiya lilladhi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.) (I have prostrated my face to the One Who created it, and made its hearing and vision, though His ability and power.)\"","reference":"Jami` at-Tirmidhi 580, Book 6, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the importance of recognizing Allah's ability and power in one's prayers?","id":"tirmidhi-6-180"},{"hadith-eng":"the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"","reference":"Jami` at-Tirmidhi 581, Book 6, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of consistency in reciting sections of the Quran?","id":"tirmidhi-6-181"},{"hadith-eng":"\"Muhammad said: 'Does not the one who raises his head before the Imam fear that Allah will transform his head into a donkey's head?'\"","reference":"Jami` at-Tirmidhi 582, Book 6, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does Islamic teaching say about the significance of following the Imam in Salah?","id":"tirmidhi-6-182"},{"hadith-eng":"'Mu'adh bin Jabal would pray Al-Maghrib with the Messenger of Allah, then he would return to his people to lead them (in prayer).\"","reference":"Jami` at-Tirmidhi 583, Book 6, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the practice of praying in congregation from the actions of Mu'adh bin Jabal?","id":"tirmidhi-6-183"},{"hadith-eng":"\"When we prayed behind the Prophet in the midday heat, we would prostrate on our garments as a protection against the heat.\"","reference":"Jami` at-Tirmidhi 584, Book 6, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #3","question":"How important is it to maintain the performance of prayers despite difficult circumstances?","id":"tirmidhi-6-184"},{"hadith-eng":"\"When the Prophet prayed Fajr he would remain seated where he had prayed until the sun had risen.\"","reference":"Jami` at-Tirmidhi 585, Book 6, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What practices are recommended after the Fajr prayer according to Islamic tradition?","id":"tirmidhi-6-185"},{"hadith-eng":"the Messenger of Allah said: \"Whoever prays Fajr in congregation, then sits remembering Allah until the sun has risen, then he prays two Rak'ah, then for him is the reward like that of a Hajj and Umrah.\" He said: \"The Messenger of Allah said: 'Complete, complete, complete.'\"","reference":"Jami` at-Tirmidhi 586, Book 6, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the importance of performing additional prayers after sunrise in Islam?","id":"tirmidhi-6-186"},{"hadith-eng":"\"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"","reference":"Jami` at-Tirmidhi 587, Book 6, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the guidelines for physical movements during Salat?","id":"tirmidhi-6-187"},{"hadith-eng":"\"The Prophet would glance during Salat\" and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 588, Book 6, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of glancing during Salat in Islamic practice?","id":"tirmidhi-6-188"},{"hadith-eng":"\"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if)","reference":"Jami` at-Tirmidhi 589, Book 6, Hadith 46","grade":"","question #":"question #3","question":"How does the permissibility of certain actions differ between voluntary and obligatory prayers?","id":"tirmidhi-6-189"},{"hadith-eng":"\"I asked the Messenger of Allah about looking around during the Salat. He said: 'It is a portion which the Shaitan snatches during a man's prayer.'\"","reference":"Jami` at-Tirmidhi 590, Book 6, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does Shaitan play in disrupting a person's prayer?","id":"tirmidhi-6-190"},{"hadith-eng":"the Messenger of Allah said: \"When one of you comes to the Salat and (finds) the Imam is in a position, then do as the Imam is doing.\"","reference":"Jami` at-Tirmidhi 591, Book 6, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of following the Imam's actions during congregational prayer?","id":"tirmidhi-6-191"},{"hadith-eng":"the Messenger of Allah said: \"When the Iqamah is called for the prayer, then do not stand until you see that I have come out.\"","reference":"Jami` at-Tirmidhi 592, Book 6, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #3","question":"What instructions did the Prophet give regarding the commencement of prayer after the Iqamah?","id":"tirmidhi-6-192"},{"hadith-eng":"\"I was prayed and the Prophet, Abu Bakr, and Umar were there, so when I sat, I started off with praising Allah, then sending Salat upon the Prophet, then supplicating for myself. So the Prophet said: 'Ask, your request will be granted, ask, your request will be ranted.'\"","reference":"Jami` at-Tirmidhi 593, Book 6, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the recommended order of actions when making a personal supplication in prayer?","id":"tirmidhi-6-193"},{"hadith-eng":"\"The Prophet ordered the construction of Masajid in all Dur and that they be kept clean and scented.\"","reference":"Jami` at-Tirmidhi 594, Book 6, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does scenting play in the upkeep of mosques?","id":"tirmidhi-6-194"},{"hadith-eng":"\"That the Prophet ordered.\" And he mentioned similarly.","reference":"Jami` at-Tirmidhi 595, Book 6, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-6-195"},{"hadith-eng":"\"That the Prophet ordered.\" And he mentioned similarly.","reference":"Jami` at-Tirmidhi 596, Book 6, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-6-196"},{"hadith-eng":"the Prophet said: \"The Salat during the night and the day is two and two.\"","reference":"Jami` at-Tirmidhi 597, Book 6, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #3","question":"What guidance is provided for performing Salat throughout the day and night?","id":"tirmidhi-6-197"},{"hadith-eng":"\"We asked Ali about the prayer of the Messenger of Allah during the day. He said: 'You will not be able to do that.' We said: 'Whoever among is able (he will)?' So he said: 'When the sun appeared over there (east) like it appears here (west) at Asr, the Messenger of Allah would pray two Rak'ah, and when the sun appeared over there (east) like it appears here (west) at Zuhr, he would pray four Rak'ah. And he would pray four before Zuhr and two after it, and four before Asr separating between every two Rak'ah with At-Taslim upon the angels that are close (to Allah) and those who follow them among the believers, and the Muslims.\"","reference":"Jami` at-Tirmidhi 598, Book 6, Hadith 55","grade":"Hasan(Darussalam)","question #":"question #3","question":"What specific prayers did the Prophet perform before and after Zuhr?","id":"tirmidhi-6-198"},{"hadith-eng":"from the Prophet similarly (no. 598).","reference":"Jami` at-Tirmidhi 599, Book 6, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-6-199"},{"hadith-eng":"\"The Messenger of Allah would not pray in women's covers.\"","reference":"Jami` at-Tirmidhi 600, Book 6, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"What considerations should be taken into account regarding the materials or items used for prayer garments?","id":"tirmidhi-6-200"},{"hadith-eng":"\"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.","reference":"Jami` at-Tirmidhi 601, Book 6, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) approach to maintaining focus in prayer despite interruptions?","id":"tirmidhi-6-201"},{"hadith-eng":"\"A man asked Abdullah bin Mas'ud about this phrase: 'Ghairi asin' or is it Yasin? So he said: 'You can recite all of the Quran besides this [phrase]?' He said: 'Yes.' He said: 'Indeed a people recite it, disbursing it like Ad-Daqqa are dispersed, without it passing their throats. Indeed I am aware of thesurahsthat are comparable which the Messenger of Allah would recite together.'\" He said: \"So we told Alqamah to ask him (what they were). He said: \"Twentysurahsfrom the Mufassal from which the Prophet would combine, reciting every two Surah in a Rak'ah.'\"","reference":"Jami` at-Tirmidhi 602, Book 6, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of knowing which Surahs the Prophet Muhammad would recite together in prayers?","id":"tirmidhi-6-202"},{"hadith-eng":"the Prophet said: \"When a man performs Wudu and he performs his Wudu well, then he leaves to the Salat, and he did not leave - or he said: He had no urge - except for it, then there is not one step that he takes except that Allah raises him a degree from it, or removes a sin from him for it. \"","reference":"Jami` at-Tirmidhi 603, Book 6, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #3","question":"What impact does each step taken towards prayer have on a person's sins and spiritual rank?","id":"tirmidhi-6-203"},{"hadith-eng":"\"The Prophet prayed Maghrib in the Masjid of Banu Abdul-Ashbal, and some people stood to offer voluntary prayers, so the Prophet said: 'This Salat is to be performed by you in your homes.'\"","reference":"Jami` at-Tirmidhi 604, Book 6, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #3","question":"What guidance did the Prophet provide regarding the performance of voluntary prayers after Maghrib?","id":"tirmidhi-6-204"},{"hadith-eng":"he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.","reference":"Jami` at-Tirmidhi 605, Book 6, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the act of Ghusl symbolize purification in Islam?","id":"tirmidhi-6-205"},{"hadith-eng":"the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"","reference":"Jami` at-Tirmidhi 606, Book 6, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the relationship between modesty and seeking protection from jinns in Islam?","id":"tirmidhi-6-206"},{"hadith-eng":"the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"","reference":"Jami` at-Tirmidhi 607, Book 6, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the spiritual benefits of Wudu and prostration in the afterlife according to Islamic teachings?","id":"tirmidhi-6-207"},{"hadith-eng":"\"The Messenger of Allah would love to start with the right side when he purified himself, and when he combed, and when putting his sandals on.\"","reference":"Jami` at-Tirmidhi 608, Book 6, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #3","question":"In what aspects of daily life did the Prophet Muhammad show a preference for the right side?","id":"tirmidhi-6-208"},{"hadith-eng":"the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"","reference":"Jami` at-Tirmidhi 609, Book 6, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of performing Wudu with an acceptable amount of water on environmental conservation?","id":"tirmidhi-6-209"},{"hadith-eng":"the Messenger of Allah said, about urine of a male child that suckles: \"The urine of the boy is sprinkled, and the girl's urine is washed.\" Qatadah (one of the narrators) said: \"This is so, as long as they do not eat, when they eat, then both of them are washed.\"","reference":"Jami` at-Tirmidhi 610, Book 6, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the guidelines for purifying surfaces contaminated by infant urine in Islam?","id":"tirmidhi-6-210"},{"hadith-eng":"\"I saw Jarir bin Abdullah performing Wudu and wiping over his Khuff.\" He said: \"So I asked him: 'What is that?' He said: 'I saw the Prophet performing Wudu and he wiped over his Khuff.' So I said to him: 'Before Al-Ma'idah or after Al-Ma'idah?' He said: 'I did not accept Islam until after Al-Ma'idah.'\"]","reference":"Jami` at-Tirmidhi 611, Book 6, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the relevance of the revelation of Surah Al-Ma'idah in relation to Islamic rituals?","id":"tirmidhi-6-211"},{"hadith-eng":"(Another chain) from Khalid bin Ziyad with similar.","reference":"Jami` at-Tirmidhi 612, Book 6, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-6-212"},{"hadith-eng":"\"The Prophet permitted the Junub when he wanted to eat, drink, or sleep, to perform Wudu like the Wudu for Salat.\"","reference":"Jami` at-Tirmidhi 613, Book 6, Hadith 70","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the actions that a person in a state of Janabah is permitted to do after performing Wudu?","id":"tirmidhi-6-213"},{"hadith-eng":"\"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"","reference":"Jami` at-Tirmidhi 614, Book 6, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the spiritual benefits of Salat, Sawm, and Sadaqah in Islam?","id":"tirmidhi-6-214"},{"hadith-eng":"\"Ibn Numair narrated to us from Ubaidullah bin Musa, from Ghalib\" with this (Hadith).","reference":"Jami` at-Tirmidhi 615, Book 6, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the credibility of narrators affect the acceptance of a hadith?","id":"tirmidhi-6-215"},{"hadith-eng":"\"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"","reference":"Jami` at-Tirmidhi 616, Book 6, Hadith 73","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of obeying those in authority in Islam as mentioned in the Prophet's sermon?","id":"tirmidhi-6-216"},{"hadith-eng":"\"I traveled with the Prophet, Abu Bakr, Umar, and Uthman; they would pray Zuhr and Asr as two Rak'ah and two Rak'ah, not praying before them nor after them.\" And Ibn Umar said: \"If I was going to pray before it or after it then I would pray it complete.\"","reference":"Jami` at-Tirmidhi 544, Book 6, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #4","question":"How did Ibn Umar approach the practice of praying additional units during travel?","id":"tirmidhi-6-217"},{"hadith-eng":"\"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 545, Book 6, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the practice of shortening prayers reflect the flexibility of Islamic rituals for travelers?","id":"tirmidhi-6-218"},{"hadith-eng":"\"We prayed Zuhr as four with the Prophet in Al-Madinah, and Asr as two Rak'ah in Dhil-Hulaifah.\"","reference":"Jami` at-Tirmidhi 546, Book 6, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of prayer differ when performed in a mosque versus during travel?","id":"tirmidhi-6-219"},{"hadith-eng":"\"The Prophet went from Al-Madinah to Makkah, not fearing anyone except Allah the Lord of the worlds, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 547, Book 6, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's attitude towards fear and reliance on Allah from this journey?","id":"tirmidhi-6-220"},{"hadith-eng":"that Anas bin Malik said: \"We went with the Messenger of Allah from Al-Madinah to Makkah, and he prayed two Rak'ah.\" He said: \"I said to Anas: 'How long did Messenger of Allah stay in Makkah?' He said: 'Ten (days).'\"","reference":"Jami` at-Tirmidhi 548, Book 6, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of companions in preserving the details of the Prophet's journeys?","id":"tirmidhi-6-221"},{"hadith-eng":"\"The Messenger of Allah traveled on a journey and he prayed two Rak'ah for nineteen days.\" Ibn Abbas said: \"So when we would stay somewhere for nineteen (days) we would pray two Rak'ah , and if we stayed longer than that we would complete the Salat.\"","reference":"Jami` at-Tirmidhi 549, Book 6, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the ruling on completing prayers if a stay extends beyond a certain number of days?","id":"tirmidhi-6-222"},{"hadith-eng":"\"I accompanied the Messenger of Allah on eighteen journeys, and I did not see him leave  the two  Rak'ah when the sun waned before Zuhr.\"","reference":"Jami` at-Tirmidhi 550, Book 6, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the consistency of the Prophet's actions during journeys reflect on his commitment to prayer?","id":"tirmidhi-6-223"},{"hadith-eng":"\"I prayed Zuhr with the Prophet on a journey as two Rak'ah, and two Rak'ah after it.\"","reference":"Jami` at-Tirmidhi 551, Book 6, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the conditions under which a Muslim is allowed to shorten their prayers?","id":"tirmidhi-6-224"},{"hadith-eng":"\"I prayed with the Prophet both, while a resident and while traveling. So I prayed four for Zuhr with him as a resident, and two Rak'ah after it. I prayed two Rak'ah for Zuhr with him while traveling and two Rak'ah after it, and two Rak'ah for Asr, and he did not pray anything after it. Maghrib while a resident and traveling is the same; three Rak'ah, it is not decreased as a resident nor while traveling. It is Witr of the day, and after it are two Rak'ah.\"","reference":"Jami` at-Tirmidhi 552, Book 6, Hadith 9","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the role of the two Rak'ahs after Maghrib prayer as mentioned in the narration?","id":"tirmidhi-6-225"},{"hadith-eng":"\"While the Prophet as at the Battle of Tabuk, if he wanted to depart before the sun's decline he would delay Zuhr so that he could pray it together with Asr. If he wanted to depart after the sun's decline, he would hasten Asr to Zuhr, and pray Zuhr and Asr together, and then move it. If he wanted to depart before Maghrib he would delay Maghrib until he prayed it with Isha, and if he wanted to depart after Maghrib he would hasten Isha so that he would pray it along with Maghrib.\"","reference":"Jami` at-Tirmidhi 553, Book 6, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the conditions under which Zuhr and Asr prayers can be combined?","id":"tirmidhi-6-226"},{"hadith-eng":"\"Ibn Umar had been requested to urgently attend to one of his wives, so he hurried en route and delayed Maghrib until the twilight disappeared, then he dismounted to combine them (the prayers). Then he informed them that the Messenger of Allah would do that when he was in a hurry on a trip.\"","reference":"Jami` at-Tirmidhi 555, Book 6, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (ﷺ) handle prayer timings during travel?","id":"tirmidhi-6-227"},{"hadith-eng":"\"The Messenger of Allah went out with the people to seek rain. So he led them in prayer for two Rak'ah, reciting aloud in them, turning his upper wrap around, raising his hands, requesting rain, and facing the Qiblah.\"","reference":"Jami` at-Tirmidhi 556, Book 6, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to face the Qiblah during the prayer for rain?","id":"tirmidhi-6-228"},{"hadith-eng":"he saw the Messenger of Allah at Ahjar Az-Zait, supplicating for rain, and he was raising his hands in supplication.","reference":"Jami` at-Tirmidhi 557, Book 6, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned from the Prophet's actions at Ahjar Az-Zait regarding supplication?","id":"tirmidhi-6-229"},{"hadith-eng":"\"Al-Walid bin Uqbah, the governor of Al-Madinah, sent me to ask Ibn Abbas about how the Messenger of Allah would perform Salat Al-Istisqa. I came to him and he said: 'The Messenger of Allah would go out in modest dress, humbly, imploring, until he reached the Musalla. He would not give this Khutbah of yours, rather, he would continue supplication and imploring saying the Takbir, and pray two Rak'ah, just as he would pray for the Eid.'\"","reference":"Jami` at-Tirmidhi 558, Book 6, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of supplication and imploring in the practice of Salat Al-Istisqa?","id":"tirmidhi-6-230"},{"hadith-eng":"\"The Prophet prayed during the eclipse. He recited, then bowed, then recited, then bowed, then recited, then bowed. (three times), then he performed two prostrations, and the next one (Rak'ah) was the same.\"","reference":"Jami` at-Tirmidhi 560, Book 6, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of performing multiple recitations and bows in the eclipse prayer?","id":"tirmidhi-6-231"},{"hadith-eng":"\"The sun was eclipsed during the time of the Messenger of Allah, so the Messenger of Allah led the people in prayer. He recited a lengthy recitation, then he bowed a lengthy bowing, then he raised his head and recited a lengthy recitation that was less than the first. Then he bowed a lengthy bowing that was less than the first. Then he raised his head and prostrated. Then he did (similar to) that in the second Rak'ah.\"","reference":"Jami` at-Tirmidhi 561, Book 6, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is the recitation and bowing in the eclipse prayer described as lengthy?","id":"tirmidhi-6-232"},{"hadith-eng":"\"The Prophet led us in prayer during an eclipse; we did not hear his voice.\"","reference":"Jami` at-Tirmidhi 562, Book 6, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the characteristics of the eclipse prayer led by the Prophet?","id":"tirmidhi-6-233"},{"hadith-eng":"\"The Prophet prayed the eclipse payer, and he recited aloud in it.\"","reference":"Jami` at-Tirmidhi 563, Book 6, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the Prophet have chosen to recite aloud during certain prayers?","id":"tirmidhi-6-234"},{"hadith-eng":"\"The Prophet prayed Salat Al-Khawf, praying one Rak'ah with one of the two groups, while the other group was facing the enemy. (When the first group finished they first Rak'ah with him), they went and took position (of the second group, facing the enemy). Then the second group came and he led them in another Rak'ah, then he said the Taslim to them, while the group proceeded to complete their (second) Rak'ah. Thereafter, the first group stood up to finish their (second) Rak'ah.\"","reference":"Jami` at-Tirmidhi 564, Book 6, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do different groups participate in Salat Al-Khawf during a battle?","id":"tirmidhi-6-235"},{"hadith-eng":"\"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"","reference":"Jami` at-Tirmidhi 565, Book 6, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"How many Rak'ahs does the Imam complete in Salat Al-Khawf, and how does it differ for the congregation?","id":"tirmidhi-6-236"},{"hadith-eng":") Muhammad bin Bash-har said:\n\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)","reference":"Jami` at-Tirmidhi 566, Book 6, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to compare different narrations of the same hadith?","id":"tirmidhi-6-237"},{"hadith-eng":"from Salih bin Khawwat, from someone who prayed Salat Al-Khawf with the Prophet, and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 567, Book 6, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of Salat Al-Khawf demonstrate the flexibility of Islamic prayer?","id":"tirmidhi-6-238"},{"hadith-eng":"\"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 568, Book 6, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #4","question":"What can be learned about the practice of prostrations of recitation from the companions of the Prophet?","id":"tirmidhi-6-239"},{"hadith-eng":"\"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 569, Book 6, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #4","question":"Who is the narrator of the hadith that mentions performing prostrations with the Prophet?","id":"tirmidhi-6-240"},{"hadith-eng":"\"We were with Ibn Umar, and he said: 'The Messenger of Allah said: \"Permit the women to go at night to the Masajid.\" His son said: 'By Allah! We would not permit them lest they become insidious from that.' So he (Abdullah) retorted: 'May Allah do and such with you.' I say: \"The Messenger of Allah said,\" and you say: \"We do not permit them?\"","reference":"Jami` at-Tirmidhi 570, Book 6, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the hadith reflect the importance of adhering to the teachings of the Prophet Muhammad?","id":"tirmidhi-6-241"},{"hadith-eng":"the Messenger of Allah said: \"When you are in Salat then do not spit on your right, but behind you or toward your left, or under your left foot.\"","reference":"Jami` at-Tirmidhi 571, Book 6, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the direction of spitting relate to maintaining cleanliness in prayer?","id":"tirmidhi-6-242"},{"hadith-eng":"the Messenger of Allah said: \"To spit in the Masjid is a sin, and burying it is its atonement.\"","reference":"Jami` at-Tirmidhi 572, Book 6, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does Islamic tradition say about the consequences of disrespecting sacred places?","id":"tirmidhi-6-243"},{"hadith-eng":"\"We prostrated with the Messenger of Allah in: 'Read! In the Name of your Lord' and 'When the heaven is split asunder.'\"","reference":"Jami` at-Tirmidhi 573, Book 6, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of prostration relate to the recitation of Quranic revelations?","id":"tirmidhi-6-244"},{"hadith-eng":"\"The Messenger of Allah prostrated for it - meaning (in Surat) An-Najm - and so did the Muslims, the idolaters, the Jinns, and the people.\"","reference":"Jami` at-Tirmidhi 575, Book 6, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be inferred about the influence of the Prophet's actions on both believers and non-believers?","id":"tirmidhi-6-245"},{"hadith-eng":"\"I recited Surat An-Najm to the Messenger of Allah, and he did not prostrate for it.\"","reference":"Jami` at-Tirmidhi 576, Book 6, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (ﷺ) demonstrate the practice of prostration during Quranic recitation?","id":"tirmidhi-6-246"},{"hadith-eng":"\"I saw the Messenger of Allah prostrating for (Surat) Sad.\" Ibn Abbas said: \"It is not one of the resolute prostrations.\"","reference":"Jami` at-Tirmidhi 577, Book 6, Hadith 34","grade":"","question #":"question #4","question":"How did the companions of the Prophet Muhammad observe and report his practices in prayer?","id":"tirmidhi-6-247"},{"hadith-eng":"\"I said: 'O Messenger of Allah! Surah Al-Hajj has been esteemed by two prostrations?' He said: 'Yes, and whoever does not prostrate for them, he should not recite them.'\"","reference":"Jami` at-Tirmidhi 578, Book 6, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #4","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the recitation of Surah Al-Hajj?","id":"tirmidhi-6-248"},{"hadith-eng":"Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"","reference":"Jami` at-Tirmidhi 579, Book 6, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of storing good deeds with Allah reflect in Islamic teachings?","id":"tirmidhi-6-249"},{"hadith-eng":"\"When the Messenger of Allah would prostrate (for recitation of) the Qur'an, he would say: (Sajada wajhiya lilladhi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.) (I have prostrated my face to the One Who created it, and made its hearing and vision, though His ability and power.)\"","reference":"Jami` at-Tirmidhi 580, Book 6, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the act of prostration relate to the acknowledgment of one's faculties such as hearing and vision?","id":"tirmidhi-6-250"},{"hadith-eng":"the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"","reference":"Jami` at-Tirmidhi 581, Book 6, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the act of compensating for missed religious duties?","id":"tirmidhi-6-251"},{"hadith-eng":"\"Muhammad said: 'Does not the one who raises his head before the Imam fear that Allah will transform his head into a donkey's head?'\"","reference":"Jami` at-Tirmidhi 582, Book 6, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic tradition view the act of raising one's head before the Imam in prayer?","id":"tirmidhi-6-252"},{"hadith-eng":"'Mu'adh bin Jabal would pray Al-Maghrib with the Messenger of Allah, then he would return to his people to lead them (in prayer).\"","reference":"Jami` at-Tirmidhi 583, Book 6, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions balance their duties between praying with the Prophet and their own communities?","id":"tirmidhi-6-253"},{"hadith-eng":"\"When we prayed behind the Prophet in the midday heat, we would prostrate on our garments as a protection against the heat.\"","reference":"Jami` at-Tirmidhi 584, Book 6, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #4","question":"What methods can be used to protect oneself from environmental discomfort during prayer?","id":"tirmidhi-6-254"},{"hadith-eng":"\"When the Prophet prayed Fajr he would remain seated where he had prayed until the sun had risen.\"","reference":"Jami` at-Tirmidhi 585, Book 6, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned from the Prophet's actions after the Fajr prayer regarding morning routines?","id":"tirmidhi-6-255"},{"hadith-eng":"the Messenger of Allah said: \"Whoever prays Fajr in congregation, then sits remembering Allah until the sun has risen, then he prays two Rak'ah, then for him is the reward like that of a Hajj and Umrah.\" He said: \"The Messenger of Allah said: 'Complete, complete, complete.'\"","reference":"Jami` at-Tirmidhi 586, Book 6, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #4","question":"How is the reward of Hajj and Umrah related to specific acts of worship in Islam?","id":"tirmidhi-6-256"},{"hadith-eng":"\"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"","reference":"Jami` at-Tirmidhi 587, Book 6, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the direction of one's gaze affect the quality of Salat?","id":"tirmidhi-6-257"},{"hadith-eng":"\"The Prophet would glance during Salat\" and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 588, Book 6, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the behavior of the Prophet during Salat serve as a model for Muslims?","id":"tirmidhi-6-258"},{"hadith-eng":"\"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if)","reference":"Jami` at-Tirmidhi 589, Book 6, Hadith 46","grade":"","question #":"question #4","question":"What are the consequences of distraction during prayer according to Islamic teachings?","id":"tirmidhi-6-259"},{"hadith-eng":"\"I asked the Messenger of Allah about looking around during the Salat. He said: 'It is a portion which the Shaitan snatches during a man's prayer.'\"","reference":"Jami` at-Tirmidhi 590, Book 6, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to avoid looking around during Salat?","id":"tirmidhi-6-260"},{"hadith-eng":"the Messenger of Allah said: \"When one of you comes to the Salat and (finds) the Imam is in a position, then do as the Imam is doing.\"","reference":"Jami` at-Tirmidhi 591, Book 6, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #4","question":"What guidance is provided for someone joining a prayer already in progress?","id":"tirmidhi-6-261"},{"hadith-eng":"the Messenger of Allah said: \"When the Iqamah is called for the prayer, then do not stand until you see that I have come out.\"","reference":"Jami` at-Tirmidhi 592, Book 6, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to wait for the Imam's presence before starting the prayer?","id":"tirmidhi-6-262"},{"hadith-eng":"\"I was prayed and the Prophet, Abu Bakr, and Umar were there, so when I sat, I started off with praising Allah, then sending Salat upon the Prophet, then supplicating for myself. So the Prophet said: 'Ask, your request will be granted, ask, your request will be ranted.'\"","reference":"Jami` at-Tirmidhi 593, Book 6, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #4","question":"What assurance is given to those who follow the proper etiquette in supplication during prayer?","id":"tirmidhi-6-263"},{"hadith-eng":"\"The Prophet ordered the construction of Masajid in all Dur and that they be kept clean and scented.\"","reference":"Jami` at-Tirmidhi 594, Book 6, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the construction of mosques contribute to community life?","id":"tirmidhi-6-264"},{"hadith-eng":"the Prophet said: \"The Salat during the night and the day is two and two.\"","reference":"Jami` at-Tirmidhi 597, Book 6, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the division of prayer units affect the practice of daily prayers?","id":"tirmidhi-6-265"},{"hadith-eng":"\"We asked Ali about the prayer of the Messenger of Allah during the day. He said: 'You will not be able to do that.' We said: 'Whoever among is able (he will)?' So he said: 'When the sun appeared over there (east) like it appears here (west) at Asr, the Messenger of Allah would pray two Rak'ah, and when the sun appeared over there (east) like it appears here (west) at Zuhr, he would pray four Rak'ah. And he would pray four before Zuhr and two after it, and four before Asr separating between every two Rak'ah with At-Taslim upon the angels that are close (to Allah) and those who follow them among the believers, and the Muslims.\"","reference":"Jami` at-Tirmidhi 598, Book 6, Hadith 55","grade":"Hasan(Darussalam)","question #":"question #4","question":"How did the Prophet separate his prayers before Asr?","id":"tirmidhi-6-266"},{"hadith-eng":"from the Prophet similarly (no. 598).","reference":"Jami` at-Tirmidhi 599, Book 6, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to reference the source and chain of a hadith?","id":"tirmidhi-6-267"},{"hadith-eng":"\"The Messenger of Allah would not pray in women's covers.\"","reference":"Jami` at-Tirmidhi 600, Book 6, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of using certain types of covers or garments during prayer?","id":"tirmidhi-6-268"},{"hadith-eng":"\"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.","reference":"Jami` at-Tirmidhi 601, Book 6, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does this incident reveal about the accessibility of the Prophet's (ﷺ) household during prayer times?","id":"tirmidhi-6-269"},{"hadith-eng":"\"A man asked Abdullah bin Mas'ud about this phrase: 'Ghairi asin' or is it Yasin? So he said: 'You can recite all of the Quran besides this [phrase]?' He said: 'Yes.' He said: 'Indeed a people recite it, disbursing it like Ad-Daqqa are dispersed, without it passing their throats. Indeed I am aware of thesurahsthat are comparable which the Messenger of Allah would recite together.'\" He said: \"So we told Alqamah to ask him (what they were). He said: \"Twentysurahsfrom the Mufassal from which the Prophet would combine, reciting every two Surah in a Rak'ah.'\"","reference":"Jami` at-Tirmidhi 602, Book 6, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of reciting the Quran with understanding differ from mere verbal recitation?","id":"tirmidhi-6-270"},{"hadith-eng":"the Prophet said: \"When a man performs Wudu and he performs his Wudu well, then he leaves to the Salat, and he did not leave - or he said: He had no urge - except for it, then there is not one step that he takes except that Allah raises him a degree from it, or removes a sin from him for it. \"","reference":"Jami` at-Tirmidhi 603, Book 6, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #4","question":"What intentions should a person have when leaving for prayer to gain spiritual benefits?","id":"tirmidhi-6-271"},{"hadith-eng":"\"The Prophet prayed Maghrib in the Masjid of Banu Abdul-Ashbal, and some people stood to offer voluntary prayers, so the Prophet said: 'This Salat is to be performed by you in your homes.'\"","reference":"Jami` at-Tirmidhi 604, Book 6, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why might it be recommended to perform certain prayers at home rather than in the mosque?","id":"tirmidhi-6-272"},{"hadith-eng":"he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.","reference":"Jami` at-Tirmidhi 605, Book 6, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the steps involved in performing Ghusl according to Islamic teachings?","id":"tirmidhi-6-273"},{"hadith-eng":"the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"","reference":"Jami` at-Tirmidhi 606, Book 6, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to maintain a screen between humans and jinns, especially in private moments?","id":"tirmidhi-6-274"},{"hadith-eng":"the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"","reference":"Jami` at-Tirmidhi 607, Book 6, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways are the physical acts of worship reflected in a person's appearance on the Day of Resurrection?","id":"tirmidhi-6-275"},{"hadith-eng":"\"The Messenger of Allah would love to start with the right side when he purified himself, and when he combed, and when putting his sandals on.\"","reference":"Jami` at-Tirmidhi 608, Book 6, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned from the Prophet's habits regarding personal hygiene and grooming?","id":"tirmidhi-6-276"},{"hadith-eng":"the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"","reference":"Jami` at-Tirmidhi 609, Book 6, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the prescribed amount of water for Wudu reflect the principles of simplicity and sufficiency in Islamic teachings?","id":"tirmidhi-6-277"},{"hadith-eng":"the Messenger of Allah said, about urine of a male child that suckles: \"The urine of the boy is sprinkled, and the girl's urine is washed.\" Qatadah (one of the narrators) said: \"This is so, as long as they do not eat, when they eat, then both of them are washed.\"","reference":"Jami` at-Tirmidhi 610, Book 6, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is there a distinction between the cleaning methods for male and female infant urine?","id":"tirmidhi-6-278"},{"hadith-eng":"\"I saw Jarir bin Abdullah performing Wudu and wiping over his Khuff.\" He said: \"So I asked him: 'What is that?' He said: 'I saw the Prophet performing Wudu and he wiped over his Khuff.' So I said to him: 'Before Al-Ma'idah or after Al-Ma'idah?' He said: 'I did not accept Islam until after Al-Ma'idah.'\"]","reference":"Jami` at-Tirmidhi 611, Book 6, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #4","question":"How do personal observations of the Prophet's actions influence Islamic jurisprudence?","id":"tirmidhi-6-279"},{"hadith-eng":"(Another chain) from Khalid bin Ziyad with similar.","reference":"Jami` at-Tirmidhi 612, Book 6, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to have multiple chains of narration for a single hadith?","id":"tirmidhi-6-280"},{"hadith-eng":"\"The Prophet permitted the Junub when he wanted to eat, drink, or sleep, to perform Wudu like the Wudu for Salat.\"","reference":"Jami` at-Tirmidhi 613, Book 6, Hadith 70","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might the Prophet have allowed Wudu for specific activities while in a state of Janabah?","id":"tirmidhi-6-281"},{"hadith-eng":"\"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"","reference":"Jami` at-Tirmidhi 614, Book 6, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of consuming lawful sustenance in Islam?","id":"tirmidhi-6-282"},{"hadith-eng":"\"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"","reference":"Jami` at-Tirmidhi 616, Book 6, Hadith 73","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the Farewell Hajj sermon emphasize the importance of the five daily prayers in a Muslim's life?","id":"tirmidhi-6-283"},{"hadith-eng":"\"I traveled with the Prophet, Abu Bakr, Umar, and Uthman; they would pray Zuhr and Asr as two Rak'ah and two Rak'ah, not praying before them nor after them.\" And Ibn Umar said: \"If I was going to pray before it or after it then I would pray it complete.\"","reference":"Jami` at-Tirmidhi 544, Book 6, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned from the practices of the Prophet and his companions regarding prayer during travel?","id":"tirmidhi-6-284"},{"hadith-eng":"\"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 545, Book 6, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role did the early caliphs play in maintaining the traditions established by the Prophet during Hajj?","id":"tirmidhi-6-285"},{"hadith-eng":"\"We prayed Zuhr as four with the Prophet in Al-Madinah, and Asr as two Rak'ah in Dhil-Hulaifah.\"","reference":"Jami` at-Tirmidhi 546, Book 6, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the historical context of the Prophet's prayer practices in Al-Madinah and Dhil-Hulaifah?","id":"tirmidhi-6-286"},{"hadith-eng":"\"The Prophet went from Al-Madinah to Makkah, not fearing anyone except Allah the Lord of the worlds, and he prayed two Rak'ah.\"","reference":"Jami` at-Tirmidhi 547, Book 6, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's devotion and worship during travel?","id":"tirmidhi-6-287"},{"hadith-eng":"that Anas bin Malik said: \"We went with the Messenger of Allah from Al-Madinah to Makkah, and he prayed two Rak'ah.\" He said: \"I said to Anas: 'How long did Messenger of Allah stay in Makkah?' He said: 'Ten (days).'\"","reference":"Jami` at-Tirmidhi 548, Book 6, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration illustrate the practice of combining or shortening prayers?","id":"tirmidhi-6-288"},{"hadith-eng":"\"The Messenger of Allah traveled on a journey and he prayed two Rak'ah for nineteen days.\" Ibn Abbas said: \"So when we would stay somewhere for nineteen (days) we would pray two Rak'ah , and if we stayed longer than that we would complete the Salat.\"","reference":"Jami` at-Tirmidhi 549, Book 6, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the practice of the Prophet Muhammad influence the rules of prayer during travel?","id":"tirmidhi-6-289"},{"hadith-eng":"\"I prayed with the Prophet both, while a resident and while traveling. So I prayed four for Zuhr with him as a resident, and two Rak'ah after it. I prayed two Rak'ah for Zuhr with him while traveling and two Rak'ah after it, and two Rak'ah for Asr, and he did not pray anything after it. Maghrib while a resident and traveling is the same; three Rak'ah, it is not decreased as a resident nor while traveling. It is Witr of the day, and after it are two Rak'ah.\"","reference":"Jami` at-Tirmidhi 552, Book 6, Hadith 9","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the Prophet's practice of Asr prayer differ from Zuhr in terms of additional prayers?","id":"tirmidhi-6-290"},{"hadith-eng":"\"While the Prophet as at the Battle of Tabuk, if he wanted to depart before the sun's decline he would delay Zuhr so that he could pray it together with Asr. If he wanted to depart after the sun's decline, he would hasten Asr to Zuhr, and pray Zuhr and Asr together, and then move it. If he wanted to depart before Maghrib he would delay Maghrib until he prayed it with Isha, and if he wanted to depart after Maghrib he would hasten Isha so that he would pray it along with Maghrib.\"","reference":"Jami` at-Tirmidhi 553, Book 6, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"In what circumstances can Maghrib and Isha prayers be combined?","id":"tirmidhi-6-291"},{"hadith-eng":"\"Ibn Umar had been requested to urgently attend to one of his wives, so he hurried en route and delayed Maghrib until the twilight disappeared, then he dismounted to combine them (the prayers). Then he informed them that the Messenger of Allah would do that when he was in a hurry on a trip.\"","reference":"Jami` at-Tirmidhi 555, Book 6, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of twilight in determining prayer times in Islam?","id":"tirmidhi-6-292"},{"hadith-eng":"\"The Messenger of Allah went out with the people to seek rain. So he led them in prayer for two Rak'ah, reciting aloud in them, turning his upper wrap around, raising his hands, requesting rain, and facing the Qiblah.\"","reference":"Jami` at-Tirmidhi 556, Book 6, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of raising hands in supplication during the prayer for rain?","id":"tirmidhi-6-293"},{"hadith-eng":"\"Al-Walid bin Uqbah, the governor of Al-Madinah, sent me to ask Ibn Abbas about how the Messenger of Allah would perform Salat Al-Istisqa. I came to him and he said: 'The Messenger of Allah would go out in modest dress, humbly, imploring, until he reached the Musalla. He would not give this Khutbah of yours, rather, he would continue supplication and imploring saying the Takbir, and pray two Rak'ah, just as he would pray for the Eid.'\"","reference":"Jami` at-Tirmidhi 558, Book 6, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #5","question":"In what way is the Salat Al-Istisqa similar to the Eid prayer?","id":"tirmidhi-6-294"},{"hadith-eng":"\"The Prophet prayed during the eclipse. He recited, then bowed, then recited, then bowed, then recited, then bowed. (three times), then he performed two prostrations, and the next one (Rak'ah) was the same.\"","reference":"Jami` at-Tirmidhi 560, Book 6, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the structure of the eclipse prayer differ from regular prayers?","id":"tirmidhi-6-295"},{"hadith-eng":"\"The sun was eclipsed during the time of the Messenger of Allah, so the Messenger of Allah led the people in prayer. He recited a lengthy recitation, then he bowed a lengthy bowing, then he raised his head and recited a lengthy recitation that was less than the first. Then he bowed a lengthy bowing that was less than the first. Then he raised his head and prostrated. Then he did (similar to) that in the second Rak'ah.\"","reference":"Jami` at-Tirmidhi 561, Book 6, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the structure of the eclipse prayer from the actions of the Prophet Muhammad?","id":"tirmidhi-6-296"},{"hadith-eng":"\"The Prophet prayed Salat Al-Khawf, praying one Rak'ah with one of the two groups, while the other group was facing the enemy. (When the first group finished they first Rak'ah with him), they went and took position (of the second group, facing the enemy). Then the second group came and he led them in another Rak'ah, then he said the Taslim to them, while the group proceeded to complete their (second) Rak'ah. Thereafter, the first group stood up to finish their (second) Rak'ah.\"","reference":"Jami` at-Tirmidhi 564, Book 6, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the steps involved in completing Salat Al-Khawf for each group?","id":"tirmidhi-6-297"},{"hadith-eng":"\"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"","reference":"Jami` at-Tirmidhi 565, Book 6, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the specific movements involved in Salat Al-Khawf for both the Imam and the congregation?","id":"tirmidhi-6-298"},{"hadith-eng":") Muhammad bin Bash-har said:\n\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)","reference":"Jami` at-Tirmidhi 566, Book 6, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the consistency of a hadith across different narrators affect its reliability?","id":"tirmidhi-6-299"},{"hadith-eng":"from Salih bin Khawwat, from someone who prayed Salat Al-Khawf with the Prophet, and he mentioned a similar narration.","reference":"Jami` at-Tirmidhi 567, Book 6, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the importance of eyewitness accounts in hadith transmission?","id":"tirmidhi-6-300"},{"hadith-eng":"\"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 568, Book 6, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the practice of prostrations of recitation reflect the devotion of the Prophet and his companions?","id":"tirmidhi-6-301"},{"hadith-eng":"\"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"","reference":"Jami` at-Tirmidhi 569, Book 6, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be learned about the practice of prostration from the companions of the Prophet?","id":"tirmidhi-6-302"},{"hadith-eng":"\"We were with Ibn Umar, and he said: 'The Messenger of Allah said: \"Permit the women to go at night to the Masajid.\" His son said: 'By Allah! We would not permit them lest they become insidious from that.' So he (Abdullah) retorted: 'May Allah do and such with you.' I say: \"The Messenger of Allah said,\" and you say: \"We do not permit them?\"","reference":"Jami` at-Tirmidhi 570, Book 6, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the dynamics of family discussions on religious matters from this narration?","id":"tirmidhi-6-303"},{"hadith-eng":"the Messenger of Allah said: \"When you are in Salat then do not spit on your right, but behind you or toward your left, or under your left foot.\"","reference":"Jami` at-Tirmidhi 571, Book 6, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of spitting under the left foot during prayer?","id":"tirmidhi-6-304"},{"hadith-eng":"the Messenger of Allah said: \"To spit in the Masjid is a sin, and burying it is its atonement.\"","reference":"Jami` at-Tirmidhi 572, Book 6, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam view the act of spitting in public spaces, especially religious ones?","id":"tirmidhi-6-305"},{"hadith-eng":"\"The Messenger of Allah prostrated for it - meaning (in Surat) An-Najm - and so did the Muslims, the idolaters, the Jinns, and the people.\"","reference":"Jami` at-Tirmidhi 575, Book 6, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the collective prostration during the recitation of a specific Surah reflect on the unity among different beings?","id":"tirmidhi-6-306"},{"hadith-eng":"\"I saw the Messenger of Allah prostrating for (Surat) Sad.\" Ibn Abbas said: \"It is not one of the resolute prostrations.\"","reference":"Jami` at-Tirmidhi 577, Book 6, Hadith 34","grade":"","question #":"question #5","question":"What are the criteria for a prostration to be classified as resolute or non-resolute?","id":"tirmidhi-6-307"},{"hadith-eng":"\"I said: 'O Messenger of Allah! Surah Al-Hajj has been esteemed by two prostrations?' He said: 'Yes, and whoever does not prostrate for them, he should not recite them.'\"","reference":"Jami` at-Tirmidhi 578, Book 6, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #5","question":"Why might certain Surahs in the Quran be associated with specific physical acts like prostration?","id":"tirmidhi-6-308"},{"hadith-eng":"Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"","reference":"Jami` at-Tirmidhi 579, Book 6, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role do trees or nature play in Islamic spirituality and symbolism?","id":"tirmidhi-6-309"},{"hadith-eng":"\"When the Messenger of Allah would prostrate (for recitation of) the Qur'an, he would say: (Sajada wajhiya lilladhi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.) (I have prostrated my face to the One Who created it, and made its hearing and vision, though His ability and power.)\"","reference":"Jami` at-Tirmidhi 580, Book 6, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be learned about humility and submission to Allah from the act of prostration?","id":"tirmidhi-6-310"},{"hadith-eng":"the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"","reference":"Jami` at-Tirmidhi 581, Book 6, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the benefits of reciting Quranic sections between Fajr and Zuhr prayers?","id":"tirmidhi-6-311"},{"hadith-eng":"\"Muhammad said: 'Does not the one who raises his head before the Imam fear that Allah will transform his head into a donkey's head?'\"","reference":"Jami` at-Tirmidhi 582, Book 6, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned about obedience and respect in communal worship from this teaching?","id":"tirmidhi-6-312"},{"hadith-eng":"\"When we prayed behind the Prophet in the midday heat, we would prostrate on our garments as a protection against the heat.\"","reference":"Jami` at-Tirmidhi 584, Book 6, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the companions' dedication to performing prayers on time?","id":"tirmidhi-6-313"},{"hadith-eng":"\"When the Prophet prayed Fajr he would remain seated where he had prayed until the sun had risen.\"","reference":"Jami` at-Tirmidhi 585, Book 6, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the time spent after Fajr prayer relate to spiritual reflection and meditation?","id":"tirmidhi-6-314"},{"hadith-eng":"the Messenger of Allah said: \"Whoever prays Fajr in congregation, then sits remembering Allah until the sun has risen, then he prays two Rak'ah, then for him is the reward like that of a Hajj and Umrah.\" He said: \"The Messenger of Allah said: 'Complete, complete, complete.'\"","reference":"Jami` at-Tirmidhi 586, Book 6, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does the repetition of the word 'complete' signify in the context of this religious practice?","id":"tirmidhi-6-315"},{"hadith-eng":"\"The Messenger of Allah would glance toward the right and the left during Salat but he would not turn his neck to look behind him.\"","reference":"Jami` at-Tirmidhi 587, Book 6, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of turning one's neck during prayer?","id":"tirmidhi-6-316"},{"hadith-eng":"\"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if)","reference":"Jami` at-Tirmidhi 589, Book 6, Hadith 46","grade":"","question #":"question #5","question":"What advice is given to maintain concentration during Salat?","id":"tirmidhi-6-317"},{"hadith-eng":"\"I asked the Messenger of Allah about looking around during the Salat. He said: 'It is a portion which the Shaitan snatches during a man's prayer.'\"","reference":"Jami` at-Tirmidhi 590, Book 6, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the consequences of losing concentration during Salat?","id":"tirmidhi-6-318"},{"hadith-eng":"\"I was prayed and the Prophet, Abu Bakr, and Umar were there, so when I sat, I started off with praising Allah, then sending Salat upon the Prophet, then supplicating for myself. So the Prophet said: 'Ask, your request will be granted, ask, your request will be ranted.'\"","reference":"Jami` at-Tirmidhi 593, Book 6, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #5","question":"How did the presence of the Prophet, Abu Bakr, and Umar impact the prayer and supplication of Abdullah?","id":"tirmidhi-6-319"},{"hadith-eng":"\"The Prophet ordered the construction of Masajid in all Dur and that they be kept clean and scented.\"","reference":"Jami` at-Tirmidhi 594, Book 6, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the responsibilities of a community towards their local mosque?","id":"tirmidhi-6-320"},{"hadith-eng":"\"We asked Ali about the prayer of the Messenger of Allah during the day. He said: 'You will not be able to do that.' We said: 'Whoever among is able (he will)?' So he said: 'When the sun appeared over there (east) like it appears here (west) at Asr, the Messenger of Allah would pray two Rak'ah, and when the sun appeared over there (east) like it appears here (west) at Zuhr, he would pray four Rak'ah. And he would pray four before Zuhr and two after it, and four before Asr separating between every two Rak'ah with At-Taslim upon the angels that are close (to Allah) and those who follow them among the believers, and the Muslims.\"","reference":"Jami` at-Tirmidhi 598, Book 6, Hadith 55","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of At-Taslim in the Prophet's prayers?","id":"tirmidhi-6-321"},{"hadith-eng":"\"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.","reference":"Jami` at-Tirmidhi 601, Book 6, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's (ﷺ) consideration for his family members?","id":"tirmidhi-6-322"},{"hadith-eng":"\"A man asked Abdullah bin Mas'ud about this phrase: 'Ghairi asin' or is it Yasin? So he said: 'You can recite all of the Quran besides this [phrase]?' He said: 'Yes.' He said: 'Indeed a people recite it, disbursing it like Ad-Daqqa are dispersed, without it passing their throats. Indeed I am aware of thesurahsthat are comparable which the Messenger of Allah would recite together.'\" He said: \"So we told Alqamah to ask him (what they were). He said: \"Twentysurahsfrom the Mufassal from which the Prophet would combine, reciting every two Surah in a Rak'ah.'\"","reference":"Jami` at-Tirmidhi 602, Book 6, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the Mufassal section of the Quran play in Islamic prayer practices?","id":"tirmidhi-6-323"},{"hadith-eng":"the Prophet said: \"When a man performs Wudu and he performs his Wudu well, then he leaves to the Salat, and he did not leave - or he said: He had no urge - except for it, then there is not one step that he takes except that Allah raises him a degree from it, or removes a sin from him for it. \"","reference":"Jami` at-Tirmidhi 603, Book 6, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the act of performing Wudu relate to the concept of purification in Islam?","id":"tirmidhi-6-324"},{"hadith-eng":"\"The Prophet prayed Maghrib in the Masjid of Banu Abdul-Ashbal, and some people stood to offer voluntary prayers, so the Prophet said: 'This Salat is to be performed by you in your homes.'\"","reference":"Jami` at-Tirmidhi 604, Book 6, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the benefits of performing voluntary prayers in one's home?","id":"tirmidhi-6-325"},{"hadith-eng":"he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.","reference":"Jami` at-Tirmidhi 605, Book 6, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why might the Prophet have instructed the use of water and Sidr for Ghusl?","id":"tirmidhi-6-326"},{"hadith-eng":"the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"","reference":"Jami` at-Tirmidhi 606, Book 6, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #5","question":"What practices are recommended in Islam to ensure privacy and protection from unseen entities?","id":"tirmidhi-6-327"},{"hadith-eng":"the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"","reference":"Jami` at-Tirmidhi 607, Book 6, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of radiance and shining relate to the acts of worship in Islam?","id":"tirmidhi-6-328"},{"hadith-eng":"\"The Messenger of Allah would love to start with the right side when he purified himself, and when he combed, and when putting his sandals on.\"","reference":"Jami` at-Tirmidhi 608, Book 6, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why might starting with the right side be considered important in Islamic tradition?","id":"tirmidhi-6-329"},{"hadith-eng":"the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"","reference":"Jami` at-Tirmidhi 609, Book 6, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #5","question":"What lessons can be learned about resource management from the practice of Wudu in Islam?","id":"tirmidhi-6-330"},{"hadith-eng":"the Messenger of Allah said, about urine of a male child that suckles: \"The urine of the boy is sprinkled, and the girl's urine is washed.\" Qatadah (one of the narrators) said: \"This is so, as long as they do not eat, when they eat, then both of them are washed.\"","reference":"Jami` at-Tirmidhi 610, Book 6, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #5","question":"What changes in the purification process when an infant begins to eat solid food?","id":"tirmidhi-6-331"},{"hadith-eng":"\"I saw Jarir bin Abdullah performing Wudu and wiping over his Khuff.\" He said: \"So I asked him: 'What is that?' He said: 'I saw the Prophet performing Wudu and he wiped over his Khuff.' So I said to him: 'Before Al-Ma'idah or after Al-Ma'idah?' He said: 'I did not accept Islam until after Al-Ma'idah.'\"]","reference":"Jami` at-Tirmidhi 611, Book 6, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the conditions under which wiping over the Khuff is permissible during Wudu?","id":"tirmidhi-6-332"},{"hadith-eng":"(Another chain) from Khalid bin Ziyad with similar.","reference":"Jami` at-Tirmidhi 612, Book 6, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the reliability of narrators impact the acceptance of a hadith?","id":"tirmidhi-6-333"},{"hadith-eng":"\"The Prophet permitted the Junub when he wanted to eat, drink, or sleep, to perform Wudu like the Wudu for Salat.\"","reference":"Jami` at-Tirmidhi 613, Book 6, Hadith 70","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the process of performing Wudu similar to the one for Salat?","id":"tirmidhi-6-334"},{"hadith-eng":"\"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"","reference":"Jami` at-Tirmidhi 614, Book 6, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does charity act as a means to extinguish sins in Islamic belief?","id":"tirmidhi-6-335"},{"hadith-eng":"\"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"","reference":"Jami` at-Tirmidhi 616, Book 6, Hadith 73","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does fasting during the month of Ramadan play in achieving spiritual success according to Islamic teachings?","id":"tirmidhi-6-336"},{"hadith-eng":"Ibn Juraij said to me: O Hasan! Ubaidullah bin Abi Yazid informed me that Ibn Abbas said: \"A man came to the Prophet and said: 'O Messenger of Allah! I had a dream at night while I was sleeping in which I was praying behind a tree, when I prostrated the tree prostrated along with me. Then I heard it saying: (Allahummaktuh li biha indaka ajran, wad a anni biha wizran, waj'alha li biha indaka dhukhran, wa taqabbalha minni kama taqabbaltaha min abdiki Dawud.)\" (O Allah! Record for me, a reward with You for it, remove a sin for me by it, and store it away for me with You, and accept it from me as You accepted it from Your worshipper Dawud). Al-Hasan said: \"Ibn Juraij said to me: 'Your grandfather said to me: 'Ibn Abbas said: 'So the Prophet recited (an Ayah of) prostration then prostrated.'\" (He said) \"So Ibn Abbas said: 'I listened to him, and he was saying the same as the man informed that the tree had said.'\"","reference":"Jami` at-Tirmidhi 579, Book 6, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does the example of Prophet Dawud influence Islamic practices of worship and supplication?","id":"tirmidhi-6-337"},{"hadith-eng":"\"We asked Ali about the prayer of the Messenger of Allah during the day. He said: 'You will not be able to do that.' We said: 'Whoever among is able (he will)?' So he said: 'When the sun appeared over there (east) like it appears here (west) at Asr, the Messenger of Allah would pray two Rak'ah, and when the sun appeared over there (east) like it appears here (west) at Zuhr, he would pray four Rak'ah. And he would pray four before Zuhr and two after it, and four before Asr separating between every two Rak'ah with At-Taslim upon the angels that are close (to Allah) and those who follow them among the believers, and the Muslims.\"","reference":"Jami` at-Tirmidhi 598, Book 6, Hadith 55","grade":"Hasan(Darussalam)","question #":"question #6","question":"Who are the recipients of At-Taslim according to the narration?","id":"tirmidhi-6-338"},{"hadith-eng":"\"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"","reference":"Jami` at-Tirmidhi 614, Book 6, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #6","question":"What is the role of prayer as a clear proof in a Muslim's life?","id":"tirmidhi-6-339"},{"hadith-eng":"\"I heard Abu Umamah saying: I heard the Messenger of Allah giving a Khutbah during the Farewell Hajj, and he said: 'Have Taqwa of your Lord, and pray your five (prayers), and fast your month, and pay the Zakat on your wealth, and obey thosewho are in charge of you, you will enter the Paradise of your Lord.'\" He said: \"I said to Abu Umamah: 'How old were you when you heard this Hadith (from the Messenger of Allah)?' He said: 'I heard it when I was thirty years old.'\"","reference":"Jami` at-Tirmidhi 616, Book 6, Hadith 73","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does the payment of Zakat contribute to a Muslim's spiritual and communal responsibilities?","id":"tirmidhi-6-340"}]