[{"hadith-eng":"the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"","reference":"Jami` at-Tirmidhi 682, Book 8, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #1","question":"What happens to the Shayatin and jinns during the month of Ramadan?","id":"tirmidhi-8-1"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"","reference":"Jami` at-Tirmidhi 683, Book 8, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the spiritual benefits of fasting during Ramadan according to Islamic teachings?","id":"tirmidhi-8-2"},{"hadith-eng":"the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"","reference":"Jami` at-Tirmidhi 684, Book 8, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of not preceding the month with fasting before its sighting?","id":"tirmidhi-8-3"},{"hadith-eng":"the Messenger of Allah said: \"Do no precede the month of Ramadan by fasting a day or two before it, unless it is the case of a man who normally performs some fast, then let him fast it.\"","reference":"Jami` at-Tirmidhi 685, Book 8, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on fasting immediately before the month of Ramadan?","id":"tirmidhi-8-4"},{"hadith-eng":"\"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"","reference":"Jami` at-Tirmidhi 686, Book 8, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of avoiding fasting on days of doubt in Islamic teachings?","id":"tirmidhi-8-5"},{"hadith-eng":"the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"","reference":"Jami` at-Tirmidhi 687, Book 8, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of observing the crescent moon in Islamic months?","id":"tirmidhi-8-6"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast before Ramadan. Fast with its sighting, and break fast with its sighting, and if it is obscured from you, then complete thirty days.\"","reference":"Jami` at-Tirmidhi 688, Book 8, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of sighting the moon in determining the start and end of Ramadan?","id":"tirmidhi-8-7"},{"hadith-eng":"\"What I fasted with the Prophet that was twenty-nine (days), was more than what we fasted that was thirty.\"\n(He said): There are narrations on this topic from `Umar, Abu Hurairah, `A'isha, Sa`d bin Abi Waqqas, Ibn `Abbas, Ibn `Umar, Anas, Jabir, Umm Salamah, Abu Bakrah, that the Prophet (ﷺ) said: \"The month is twenty nine (days).\"","reference":"Jami` at-Tirmidhi 689, Book 8, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the lunar calendar in determining the length of a month in Islam?","id":"tirmidhi-8-8"},{"hadith-eng":"\"The Messenger of Allah vowed to stay away from his wives for a month, so he stayed in a loft for twenty-nine days. They said: 'O Messenger of Allah, your vow was for a month,' so he said: 'The month is twenty-nine (days).'\"","reference":"Jami` at-Tirmidhi 690, Book 8, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's vow to stay away from his wives for a month?","id":"tirmidhi-8-9"},{"hadith-eng":"\"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"","reference":"Jami` at-Tirmidhi 691, Book 8, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of witnessing the crescent moon in determining the start of fasting in Islam?","id":"tirmidhi-8-10"},{"hadith-eng":"the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"","reference":"Jami` at-Tirmidhi 692, Book 8, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the two months of Eid in Islam?","id":"tirmidhi-8-11"},{"hadith-eng":"\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"","reference":"Jami` at-Tirmidhi 693, Book 8, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of local moon sighting in determining the start of Ramadan?","id":"tirmidhi-8-12"},{"hadith-eng":"the Messenger of Allah said: \"Whoever has dried dates, then let him break the fast with that, and whoever does not, then let him break the fast with water, for indeed water is purifying.\"","reference":"Jami` at-Tirmidhi 694, Book 8, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the recommended foods or drinks to break a fast in Islam?","id":"tirmidhi-8-13"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"","reference":"Jami` at-Tirmidhi 695, Book 8, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the recommended food to break a fast with according to Islamic teachings?","id":"tirmidhi-8-14"},{"hadith-eng":"\"The Messenger of Allah would break the fast with fresh dates before performing Salat. If there were no fresh dates then (he would break the fast) with dried dates, and if there were no dried dates then he would take a few sips of water.\"","reference":"Jami` at-Tirmidhi 696, Book 8, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of breaking the fast with fresh dates in Islamic tradition?","id":"tirmidhi-8-15"},{"hadith-eng":"the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"","reference":"Jami` at-Tirmidhi 697, Book 8, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of communal observance in fasting and breaking the fast in Islam?","id":"tirmidhi-8-16"},{"hadith-eng":"The Messenger of Allah said: \"When the night advances and the day retreats, and the sun is hidden, then the fast is to be broken.\"","reference":"Jami` at-Tirmidhi 698, Book 8, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the signs that indicate the time to break the fast during Ramadan?","id":"tirmidhi-8-17"},{"hadith-eng":"the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\"","reference":"Jami` at-Tirmidhi 699, Book 8, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of hastening to break the fast in Islam?","id":"tirmidhi-8-18"},{"hadith-eng":"the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"","reference":"Jami` at-Tirmidhi 700, Book 8, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #1","question":"Who are considered the most beloved worshippers to Allah according to this saying?","id":"tirmidhi-8-19"},{"hadith-eng":"(A Hadith similar to no. 700 with a different chain).","reference":"Jami` at-Tirmidhi 701, Book 8, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of Abu Hurairah as a narrator in Islamic tradition?","id":"tirmidhi-8-20"},{"hadith-eng":"\"Masruq and I entered upon Aishah and we said: 'O Mother of the Believers! There are two men from the Companions of Muhammad, one of them hastens to break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"","reference":"Jami` at-Tirmidhi 702, Book 8, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of hastening to break the fast in Islamic practice?","id":"tirmidhi-8-21"},{"hadith-eng":"Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 703, Book 8, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the pre-dawn meal (Sahar) in Islamic practice?","id":"tirmidhi-8-22"},{"hadith-eng":"(Another chain) except that he said: \"About the length for reciting fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 704, Book 8, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the length of time it takes to recite fifty Ayahs in Islamic practice?","id":"tirmidhi-8-23"},{"hadith-eng":"The Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears to you on the horizon.\"","reference":"Jami` at-Tirmidhi 705, Book 8, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidance is provided regarding the timing of eating and drinking during fasting?","id":"tirmidhi-8-24"},{"hadith-eng":"the Messenger of Allah said: \"Do not let the Adhan of Bilal prevent you from your Sahar, nor the drawn out Fajr, but the Fajr that spreads on the horizon.\"","reference":"Jami` at-Tirmidhi 706, Book 8, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Adhan of Bilal in relation to the pre-dawn meal during Ramadan?","id":"tirmidhi-8-25"},{"hadith-eng":"the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"","reference":"Jami` at-Tirmidhi 707, Book 8, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of abandoning false speech during fasting in Islam?","id":"tirmidhi-8-26"},{"hadith-eng":"the Messenger of Allah said: \"Partake of Sahar, for indeed there is a blessing in the Sahar.\"","reference":"Jami` at-Tirmidhi 708, Book 8, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of consuming Sahar in Islamic tradition?","id":"tirmidhi-8-27"},{"hadith-eng":"(similar to no. 708) from the Prophet.","reference":"Jami` at-Tirmidhi 709, Book 8, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Amr bin Al-As as a narrator in Islamic tradition?","id":"tirmidhi-8-28"},{"hadith-eng":"\"The Messenger of Allah went to Makkah in the Year of the Conquest, so he fasted until he reached Kura Al-Ghamim and the people were fasting with him. Then it was said to him: 'The fast has become difficult for the people, and they are watching you to see what you will do.' So after Asr, he called for a cup of water and drank it while the people were looking at him. Some of them broke the fast while some of them continued their fasting. It was conveyed to him that people were still fasting, so he said: \"Those are the disobedient.'\"","reference":"Jami` at-Tirmidhi 710, Book 8, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions did the Prophet take when he realized fasting had become difficult for the people during the journey?","id":"tirmidhi-8-29"},{"hadith-eng":"Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"","reference":"Jami` at-Tirmidhi 711, Book 8, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on fasting while traveling in Islam?","id":"tirmidhi-8-30"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"","reference":"Jami` at-Tirmidhi 712, Book 8, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of mutual respect for individual choices regarding fasting during a journey?","id":"tirmidhi-8-31"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"","reference":"Jami` at-Tirmidhi 713, Book 8, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of mutual respect and understanding among Muslims regarding fasting during a journey?","id":"tirmidhi-8-32"},{"hadith-eng":"he asked Ibn Al-Musaiyab about fasting on a journey, so he narrated to him that Umar bin Al-Khattab said: \"We fought in two battles along with the Messenger of Allah during Ramadan; the Day of Badr, and the Conquest (of Makkah), so we broke our fast during them.\"","reference":"Jami` at-Tirmidhi 714, Book 8, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on fasting during travel in Islam?","id":"tirmidhi-8-33"},{"hadith-eng":"\"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - or fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the breast-feeding person.' And by Allah! The Prophet said both of them or one of them. So woe to me! For I did not eat from the meal of the Prophet.\"","reference":"Jami` at-Tirmidhi 715, Book 8, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the exemptions from fasting mentioned for travelers, pregnant, and breastfeeding individuals?","id":"tirmidhi-8-34"},{"hadith-eng":"\"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"","reference":"Jami` at-Tirmidhi 716, Book 8, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fulfilling religious obligations on behalf of deceased family members?","id":"tirmidhi-8-35"},{"hadith-eng":"(A Hadith similar to no. 716 with a different chain.)","reference":"Jami` at-Tirmidhi 717, Book 8, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of different chains of narration in understanding hadiths?","id":"tirmidhi-8-36"},{"hadith-eng":"the Prophet said: \"Whoever died while he had a month to fast, then a needy person should be fed on his behalf in place of every day.\"","reference":"Jami` at-Tirmidhi 718, Book 8, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #1","question":"What should be done if a person dies with missed fasts?","id":"tirmidhi-8-37"},{"hadith-eng":"the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"","reference":"Jami` at-Tirmidhi 719, Book 8, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the actions that do not invalidate the fast according to Islamic teachings?","id":"tirmidhi-8-38"},{"hadith-eng":"the Prophet said: \"Whoever is overcome by vomiting, then he is not required to make up (the fast), and whoever vomits on purpose, then he must make it up.\"","reference":"Jami` at-Tirmidhi 720, Book 8, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on fasting if a person vomits unintentionally?","id":"tirmidhi-8-39"},{"hadith-eng":"\"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision that Allah provided for him.\"","reference":"Jami` at-Tirmidhi 721, Book 8, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on eating or drinking forgetfully while fasting in Islam?","id":"tirmidhi-8-40"},{"hadith-eng":"(Another chain) with the same or similar (Hadith as no. 721).","reference":"Jami` at-Tirmidhi 722, Book 8, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who is the narrator of this hadith and what is its significance?","id":"tirmidhi-8-41"},{"hadith-eng":"the Messenger of Allah said: \"Whoever breaks the fast during Ramadan without an allowance or illness, then if he fasted for all time, his fasting would not make up for it.\"","reference":"Jami` at-Tirmidhi 723, Book 8, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of breaking the fast during Ramadan without a valid reason?","id":"tirmidhi-8-42"},{"hadith-eng":"A man came and said: \"O Messenger of Allah; I am ruined!\" He said: \"What has ruined you?\" He said: \"I had sexual relations with my wife during Ramadan.\" He said: \"Are you able to free a slave?\" He said, \"No.\" He said: \"Then are you able to fast for two consecutive months?\" He said, \"No.\" He said: \"Then are you able to feed sixty needy people?\" He said, \"No.\" He said: \"Sit.\" So he sat. A big basket full of dates was brought to the Prophet, and he said: \"Give it in charity.\" So he said: \"There is no one needier than us between its two mountains.\" So the Prophet laughing until his pre-molar teeth appeared, and he said: \"Then take it to feed your family.\"","reference":"Jami` at-Tirmidhi 724, Book 8, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences of having sexual relations during Ramadan fasting?","id":"tirmidhi-8-43"},{"hadith-eng":"\"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"","reference":"Jami` at-Tirmidhi 725, Book 8, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of using the Siwak in Islam, especially during fasting?","id":"tirmidhi-8-44"},{"hadith-eng":"a man came to the Prophet and said: \"My eyes are bothering me, can I use Kuhl while I am fasting?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 726, Book 8, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #1","question":"Is it permissible to use eye medication while fasting?","id":"tirmidhi-8-45"},{"hadith-eng":"\"The Prophet would kiss during the month of fasting.\"","reference":"Jami` at-Tirmidhi 727, Book 8, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions are permissible between spouses during the month of fasting?","id":"tirmidhi-8-46"},{"hadith-eng":"\"The Messenger of Allah would fondle me while he was fasting, and he had the most control among you of his limb (li irbihi).\"","reference":"Jami` at-Tirmidhi 728, Book 8, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does this narration suggest about the self-control of the Prophet Muhammad (peace be upon him) during fasting?","id":"tirmidhi-8-47"},{"hadith-eng":"\"The Messenger of Allah would kiss and fondle while he was fasting, and he had the most control among you of his limbs.\"","reference":"Jami` at-Tirmidhi 729, Book 8, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions are permissible between spouses during fasting?","id":"tirmidhi-8-48"},{"hadith-eng":"the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"","reference":"Jami` at-Tirmidhi 730, Book 8, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of making an intention to fast before Fajr in Islam?","id":"tirmidhi-8-49"},{"hadith-eng":"\"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"","reference":"Jami` at-Tirmidhi 731, Book 8, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on breaking a voluntary fast in Islam?","id":"tirmidhi-8-50"},{"hadith-eng":"\"A person from the offspring of Umm Hani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, and Umm Hani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this from Umm Hani?' He said: 'No Abu Salih and our family informed us of it from Umm Hani.'\"","reference":"Jami` at-Tirmidhi 732, Book 8, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on breaking a voluntary fast in Islam?","id":"tirmidhi-8-51"},{"hadith-eng":"\"The Messenger of Allah visited me one day and said: 'Do you have anything (to eat)?'\" She said: \"I said: 'No.' He said: 'Then I am fasting.'\"","reference":"Jami` at-Tirmidhi 733, Book 8, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet's (ﷺ) approach to fasting when there is no food available?","id":"tirmidhi-8-52"},{"hadith-eng":"\"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"","reference":"Jami` at-Tirmidhi 734, Book 8, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of flexibility in fasting according to Islamic teachings?","id":"tirmidhi-8-53"},{"hadith-eng":"\"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"","reference":"Jami` at-Tirmidhi 735, Book 8, Hadith 54","grade":"Da'if(Darussalam)","question #":"question #1","question":"What should one do if they break their fast unintentionally or due to temptation?","id":"tirmidhi-8-54"},{"hadith-eng":"\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"","reference":"Jami` at-Tirmidhi 736, Book 8, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting during the months of Sha'ban and Ramadan in Islam?","id":"tirmidhi-8-55"},{"hadith-eng":"from the Prophet.","reference":"Jami` at-Tirmidhi 737, Book 8, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of Aishah as a narrator in Islamic tradition?","id":"tirmidhi-8-56"},{"hadith-eng":"the Messenger of Allah said: \"When a half of Sha'ban remains then do not fast.\"","reference":"Jami` at-Tirmidhi 738, Book 8, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the month of Sha'ban in Islamic tradition?","id":"tirmidhi-8-57"},{"hadith-eng":"\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"","reference":"Jami` at-Tirmidhi 739, Book 8, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the middle of Sha'ban in Islamic tradition?","id":"tirmidhi-8-58"},{"hadith-eng":"the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"","reference":"Jami` at-Tirmidhi 740, Book 8, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"Which month is considered the most virtuous for fasting after Ramadan?","id":"tirmidhi-8-59"},{"hadith-eng":"\"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"","reference":"Jami` at-Tirmidhi 741, Book 8, Hadith 60","grade":"Da'if(Darussalam)","question #":"question #1","question":"Which month is recommended for fasting after Ramadan according to Islamic teachings?","id":"tirmidhi-8-60"},{"hadith-eng":"\"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"","reference":"Jami` at-Tirmidhi 742, Book 8, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of fasting at the beginning of each month in Islam?","id":"tirmidhi-8-61"},{"hadith-eng":"the Messenger of Allah said: \"None of you should fast on Friday unless he fasts before it, or he fasts after it.\"","reference":"Jami` at-Tirmidhi 743, Book 8, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting on specific days in Islam?","id":"tirmidhi-8-62"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"","reference":"Jami` at-Tirmidhi 744, Book 8, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of not fasting on Saturday in Islamic teachings?","id":"tirmidhi-8-63"},{"hadith-eng":"\"The Prophet used to try to fast on Mondays and Thursdays.\"","reference":"Jami` at-Tirmidhi 745, Book 8, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #1","question":"What days did the Prophet Muhammad (ﷺ) prefer for fasting during the week?","id":"tirmidhi-8-64"},{"hadith-eng":"\"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"","reference":"Jami` at-Tirmidhi 746, Book 8, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #1","question":"What days of the week did the Prophet Muhammad (ﷺ) choose to fast in different months?","id":"tirmidhi-8-65"},{"hadith-eng":"the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"","reference":"Jami` at-Tirmidhi 747, Book 8, Hadith 66","grade":"Hasan(Darussalam)","question #":"question #1","question":"On which days are deeds presented to Allah according to Islamic teachings?","id":"tirmidhi-8-66"},{"hadith-eng":"\"I asked - or; the Prophet was asked - about fasting daily. So he said: 'Your family has a right over you.' Then he said: 'Fast Ramadan and that which is after it, and every Wednesday and Thursday. If you do that, then you will have fasted daily, as well as broken (the fast).'\"","reference":"Jami` at-Tirmidhi 748, Book 8, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of balancing religious practices with family rights in Islam?","id":"tirmidhi-8-67"},{"hadith-eng":"the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"","reference":"Jami` at-Tirmidhi 749, Book 8, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of fasting on the Day of Arafah in Islam?","id":"tirmidhi-8-68"},{"hadith-eng":"\"The Prophet broke (the fast) of Arafah, Umm Fadl sent him some milk to drink.\"","reference":"Jami` at-Tirmidhi 750, Book 8, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of breaking the fast on the day of Arafah?","id":"tirmidhi-8-69"},{"hadith-eng":"\"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"","reference":"Jami` at-Tirmidhi 751, Book 8, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting on the Day of Arafah according to Islamic tradition?","id":"tirmidhi-8-70"},{"hadith-eng":"the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"","reference":"Jami` at-Tirmidhi 752, Book 8, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting on the Day of Ashura in Islam?","id":"tirmidhi-8-71"},{"hadith-eng":"\"Ashura was a day that the Quraish used to fast during Jahiliyyah, and the Messenger of Allah used to fast it. But when (the fast of) Ramadan became obligatory, the Ramadan was the required and Ashura was left. So whoever wanted to, he fasted it, and whoever wanted to, he left it.\"","reference":"Jami` at-Tirmidhi 753, Book 8, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of fasting on the day of Ashura during the pre-Islamic period?","id":"tirmidhi-8-72"},{"hadith-eng":"\"I met up with Ibn Abbas while he was reclining on his Rida at the Zamzam (well). So I said: 'Inform me about the Day of Ashura. On which day is it fasted?' He said: 'When you see the crescent of Al-Muharram, then count, then fast on the morning of the ninth day.'\" He said: 'I said: Is this how Muhammad fasted it?' He said: 'Yes.'\"","reference":"Jami` at-Tirmidhi 754, Book 8, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting on the Day of Ashura in Islam?","id":"tirmidhi-8-73"},{"hadith-eng":"\"The Messenger of Allah ordered fasting the tenth day for the Day of Ashura.\"","reference":"Jami` at-Tirmidhi 755, Book 8, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of fasting on the Day of Ashura in Islam?","id":"tirmidhi-8-74"},{"hadith-eng":"\"I did not see the Prophet fasting at all during the ten.\"","reference":"Jami` at-Tirmidhi 756, Book 8, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet's fasting habits during the first ten days of a particular month?","id":"tirmidhi-8-75"},{"hadith-eng":"the Messenger of Allah said: \"There are no days in which righteous deeds are more beloved to Allah than those ten days.\" They said: \"O Messenger of Allah! Not even Jihad in Allah Cause?\" The Messenger of Allah said: \"Not even Jihad in Allah's Cause, unless a man were to out with his self and his wealth and not return from that with anything.\"","reference":"Jami` at-Tirmidhi 757, Book 8, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the most beloved days to Allah for performing righteous deeds?","id":"tirmidhi-8-76"},{"hadith-eng":"the Prophet said: \"There are no days more beloved to Allah that He be worshipped in them than the ten days of Dhul-Hijjah, fasting every day of them is the equivalent of fasting a year, and standing every night of them (in prayer) is the equivalent of standing on the Night of Qadr.\"","reference":"Jami` at-Tirmidhi 758, Book 8, Hadith 77","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the ten days of Dhul-Hijjah in Islamic worship?","id":"tirmidhi-8-77"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan, then follows it with six from Shawwal, then that is (equal in reward) to fasting everyday.\"","reference":"Jami` at-Tirmidhi 759, Book 8, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting during the month of Ramadan in Islam?","id":"tirmidhi-8-78"},{"hadith-eng":"\"The Messenger of Allah took a covenant from me for three: To not sleep except after performing Witr, to fast three days of every month, and to perform the Duha prayer.\"","reference":"Jami` at-Tirmidhi 760, Book 8, Hadith 79","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing the Witr prayer before sleeping?","id":"tirmidhi-8-79"},{"hadith-eng":"the Messenger of Allah said: \"O Abu Dharr! When you fast three days out of a month, then fast the thirteenth, fourteenth, and fifteenth.\"","reference":"Jami` at-Tirmidhi 761, Book 8, Hadith 80","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the recommended days for fasting in the middle of the lunar month?","id":"tirmidhi-8-80"},{"hadith-eng":"\"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"","reference":"Jami` at-Tirmidhi 762, Book 8, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of fasting three days each month in Islam?","id":"tirmidhi-8-81"},{"hadith-eng":"\"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"","reference":"Jami` at-Tirmidhi 763, Book 8, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #1","question":"Did the Prophet Muhammad (ﷺ) have a specific routine for fasting three days each month?","id":"tirmidhi-8-82"},{"hadith-eng":"The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 764, Book 8, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does fasting serve as a shield from the Fire according to Islamic teachings?","id":"tirmidhi-8-83"},{"hadith-eng":"The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"","reference":"Jami` at-Tirmidhi 765, Book 8, Hadith 84","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the gate called Ar-Raiyyan in Paradise?","id":"tirmidhi-8-84"},{"hadith-eng":"The Messenger of Allah said: \"There are two joys for the fasting person: the joy when he breaks his fast, and the joy of when he meets his Lord.\"","reference":"Jami` at-Tirmidhi 766, Book 8, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the two types of joy experienced by a fasting person?","id":"tirmidhi-8-85"},{"hadith-eng":"\"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"","reference":"Jami` at-Tirmidhi 767, Book 8, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of moderation in fasting according to Islamic teachings?","id":"tirmidhi-8-86"},{"hadith-eng":"\"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"","reference":"Jami` at-Tirmidhi 768, Book 8, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) vary his fasting practices throughout the year?","id":"tirmidhi-8-87"},{"hadith-eng":"Anas bin Malik was asked about the Prophet's fasting and he said: \"He would fast during a month until we thought that he did not want to abstain from fasting during any of it. And, he would not fast during a month until we thought that he did not want to fast during any of it. (There was no time) that I wanted to see if he was performing Salat during the night, except that I would see him praying, nor to see him sleeping, except that I would see him sleeping.\"","reference":"Jami` at-Tirmidhi 769, Book 8, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) balance fasting and not fasting during different months?","id":"tirmidhi-8-88"},{"hadith-eng":"The Messenger of Allah said: \"The most virtuous fast is the fast of my brother Dawud. He would fast a day, and not fast (the next) day. He would not flee at the time of engagement (with the enemy).\"","reference":"Jami` at-Tirmidhi 770, Book 8, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is considered the most virtuous form of fasting in Islam?","id":"tirmidhi-8-89"},{"hadith-eng":"\"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"","reference":"Jami` at-Tirmidhi 771, Book 8, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Salat before the Khutbah on the Day of Nahr?","id":"tirmidhi-8-90"},{"hadith-eng":"\"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"","reference":"Jami` at-Tirmidhi 772, Book 8, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #1","question":"Which two specific days are Muslims prohibited from fasting?","id":"tirmidhi-8-91"},{"hadith-eng":"The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"","reference":"Jami` at-Tirmidhi 773, Book 8, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the significant days mentioned as Eid for Muslims in this narration?","id":"tirmidhi-8-92"},{"hadith-eng":"The Prophet said: \"The cupper and the one cupped have broke the fast.\"","reference":"Jami` at-Tirmidhi 774, Book 8, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on cupping during fasting in Islam?","id":"tirmidhi-8-93"},{"hadith-eng":"\"the Messenger of Allah was cupped while he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 775, Book 8, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of cupping in Islamic tradition, especially during fasting and Ihram?","id":"tirmidhi-8-94"},{"hadith-eng":"\"The Prophet was cupped while he was fasting.\"","reference":"Jami` at-Tirmidhi 776, Book 8, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on cupping while fasting in Islam?","id":"tirmidhi-8-95"},{"hadith-eng":"\"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 777, Book 8, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of cupping in Islamic tradition?","id":"tirmidhi-8-96"},{"hadith-eng":"the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"","reference":"Jami` at-Tirmidhi 778, Book 8, Hadith 97","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the practice of Wisal in fasting and why is it discouraged?","id":"tirmidhi-8-97"},{"hadith-eng":"\"Aishah and Umm Salamah, the wives of the Prophet informed me that the Prophet would find that it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"","reference":"Jami` at-Tirmidhi 779, Book 8, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl before starting a fast?","id":"tirmidhi-8-98"},{"hadith-eng":"The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.","reference":"Jami` at-Tirmidhi 780, Book 8, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #1","question":"What should a person do when they receive an invitation to eat?","id":"tirmidhi-8-99"},{"hadith-eng":"The Prophet said: \"When one of you is invited (to a meal) and he is fasting, then let him said: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 781, Book 8, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #1","question":"What should a person do when invited to a meal while fasting?","id":"tirmidhi-8-100"},{"hadith-eng":"The Prophet said: \"A woman may not fast a day - other than in the month of Ramadan - while her husband is present, except with his permission.\"","reference":"Jami` at-Tirmidhi 782, Book 8, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a husband's permission for a woman to fast outside of Ramadan?","id":"tirmidhi-8-101"},{"hadith-eng":"\"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"","reference":"Jami` at-Tirmidhi 783, Book 8, Hadith 102","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of making up missed fasts from Ramadan before the next Ramadan begins?","id":"tirmidhi-8-102"},{"hadith-eng":"The Prophet said: \"When those who are not fasting eat in the presence of the fasting person, the angels send Salat upon him.\"","reference":"Jami` at-Tirmidhi 784, Book 8, Hadith 103","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the angels sending Salat upon a fasting person when others eat in their presence?","id":"tirmidhi-8-103"},{"hadith-eng":"\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother] Umm Amarah bint Ka'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\"","reference":"Jami` at-Tirmidhi 785, Book 8, Hadith 104","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of fasting in the presence of others who are eating?","id":"tirmidhi-8-104"},{"hadith-eng":"From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\"","reference":"Jami` at-Tirmidhi 786, Book 8, Hadith 105","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of narrations that have slight variations in wording?","id":"tirmidhi-8-105"},{"hadith-eng":"\"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"","reference":"Jami` at-Tirmidhi 787, Book 8, Hadith 106","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the ruling on making up missed fasts due to menstruation in Islam?","id":"tirmidhi-8-106"},{"hadith-eng":"From his father who said: \"I said. 'O Messenger of Allah! Inform me about Wudu.' So he said: \"Perform Wudu well, and go between the fingers, and perform Istinshaq extensively except when fasting.\"","reference":"Jami` at-Tirmidhi 788, Book 8, Hadith 107","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the key components of performing Wudu correctly?","id":"tirmidhi-8-107"},{"hadith-eng":"The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"","reference":"Jami` at-Tirmidhi 789, Book 8, Hadith 108","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before fasting when staying with others?","id":"tirmidhi-8-108"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (days) of Ramadan until Allah took him.\"","reference":"Jami` at-Tirmidhi 790, Book 8, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing I'tikaf during the last ten days of Ramadan?","id":"tirmidhi-8-109"},{"hadith-eng":"\"When the Messenger of Allah wanted to perform I'tikaf, he would perform Fajr prayer and then he would enter his place of I'tikaf.\"","reference":"Jami` at-Tirmidhi 791, Book 8, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Fajr prayer before starting I'tikaf?","id":"tirmidhi-8-110"},{"hadith-eng":"\"The Messenger of Allah would Yujawir (stay in I'tikaf) during the last ten (nights) of Ramadan and he said: 'Seek the Night of Al-Qadr during the last ten (nights) of Ramadan.'\"","reference":"Jami` at-Tirmidhi 792, Book 8, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of I'tikaf during the last ten nights of Ramadan?","id":"tirmidhi-8-111"},{"hadith-eng":"\"I said to Ubayy bin Ka'b: 'O Abu Al-Mundhir! How do you know that it is the night of the twenty-seventh?' He said: 'Rather, the Messenger of Allah informed us that it is a night (after which) the sun rises without rays, so we counted and we remembered it. By Allah! Ibn Mas'ud learned that it is in Ramadan and that it is the nigh of the twenty-seventh, but he did not want to inform you lest you would depend on it.\"","reference":"Jami` at-Tirmidhi 793, Book 8, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the signs of the night of the twenty-seventh of Ramadan according to Islamic tradition?","id":"tirmidhi-8-112"},{"hadith-eng":"\"My father narrated to me: 'The Night of Al-Qadr was mentioned in the presence of Abu Bakrah, so he said: \"I do not search for it due to something that I heard from the Messenger of Allah, except for during the last ten (nights); for indeed I heard him say: 'Search for it when nine remain, or; when seven remain, or; when five remain, or; during the last three nights.'\" He (Uyainah) said: \"During the twenty (nights) of Ramadan, Abu Bakrah used to perform Salat just as he performed Salat during the rest of the year. But when the (last) ten began, he would struggle (performing more Salat during the night).\"","reference":"Jami` at-Tirmidhi 794, Book 8, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the last ten nights of Ramadan in Islamic tradition?","id":"tirmidhi-8-113"},{"hadith-eng":"\"The Prophet would awaken his family during the last ten (nights) of Ramadan.\"","reference":"Jami` at-Tirmidhi 795, Book 8, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions did the Prophet take during the last ten nights of Ramadan?","id":"tirmidhi-8-114"},{"hadith-eng":"\"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"","reference":"Jami` at-Tirmidhi 796, Book 8, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the last ten nights of Ramadan in Islamic practice?","id":"tirmidhi-8-115"},{"hadith-eng":"The Prophet said: \"Fasting during the winter is an easy reward.\"","reference":"Jami` at-Tirmidhi 797, Book 8, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the benefits of fasting during the winter season?","id":"tirmidhi-8-116"},{"hadith-eng":"\"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"","reference":"Jami` at-Tirmidhi 798, Book 8, Hadith 117","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does the concept of abrogation in Islamic law signify?","id":"tirmidhi-8-117"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan and he was about to travel. His mount was prepared for him, and he put on his traveling clothes, then he called for some food to eat, and I said to him: 'Is it Sunnah?' He said: 'It is Sunnah.' Then he rode.\"","reference":"Jami` at-Tirmidhi 799, Book 8, Hadith 118","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions are considered Sunnah when preparing for travel during Ramadan?","id":"tirmidhi-8-118"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan\" and he mentioned a similar narration (as no. 799).","reference":"Jami` at-Tirmidhi 800, Book 8, Hadith 119","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of visiting companions of the Prophet during Ramadan?","id":"tirmidhi-8-119"},{"hadith-eng":"The Messenger of Allah said: \"The gift for the fasting person is (fragrant) oil and a censer.\"","reference":"Jami` at-Tirmidhi 801, Book 8, Hadith 120","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are some recommended gifts for a fasting person?","id":"tirmidhi-8-120"},{"hadith-eng":"The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"","reference":"Jami` at-Tirmidhi 802, Book 8, Hadith 121","grade":"Sahih(Darussalam)","question #":"question #1","question":"What determines the day of Eid al-Fitr in the Islamic tradition?","id":"tirmidhi-8-121"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (nights) of Ramadan. One year he did not perform I'tikaf, so he performed I'tikaf for twenty (nights) in the following year.\"","reference":"Jami` at-Tirmidhi 803, Book 8, Hadith 122","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing I'tikaf during the last ten nights of Ramadan?","id":"tirmidhi-8-122"},{"hadith-eng":"\"When the Messenger of Allah performed I'tikaf, he would bring his head near me so I could comb it, and he would not enter the house except for some personal needs.\"","reference":"Jami` at-Tirmidhi 804, Book 8, Hadith 123","grade":"Sahih(Darussalam)","question #":"question #1","question":"What activities are permissible during I'tikaf according to the practices of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-8-123"},{"hadith-eng":"\"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"","reference":"Jami` at-Tirmidhi 806, Book 8, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of praying with the Imam during Ramadan nights?","id":"tirmidhi-8-124"},{"hadith-eng":"The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"","reference":"Jami` at-Tirmidhi 807, Book 8, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of providing food to a fasting person in Islam?","id":"tirmidhi-8-125"},{"hadith-eng":"\"The Messenger of Allah would encourage the  night prayer in Ramadan without firmly ordering it, and he would say: \"Whoever stands (in the night prayer) for Ramadan with faith and seeking the reward (from Allah), then he will be forgiven what has preceded of his sins.' So the Messenger of Allah died and the matter was like that. Then the matter was the same during the Khilafah of Abu Bakr and it continued during a portion of the Khilafah of Umar bin Al-Khattab.\"","reference":"Jami` at-Tirmidhi 808, Book 8, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the night prayer during Ramadan in terms of forgiveness of sins?","id":"tirmidhi-8-126"},{"hadith-eng":"the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"","reference":"Jami` at-Tirmidhi 682, Book 8, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are the gates of Paradise and the Fires affected during Ramadan?","id":"tirmidhi-8-127"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"","reference":"Jami` at-Tirmidhi 683, Book 8, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does standing in night prayer during Ramadan contribute to forgiveness of sins?","id":"tirmidhi-8-128"},{"hadith-eng":"the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"","reference":"Jami` at-Tirmidhi 684, Book 8, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one determine the beginning and end of the fasting month according to Islamic teachings?","id":"tirmidhi-8-129"},{"hadith-eng":"the Messenger of Allah said: \"Do no precede the month of Ramadan by fasting a day or two before it, unless it is the case of a man who normally performs some fast, then let him fast it.\"","reference":"Jami` at-Tirmidhi 685, Book 8, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"Are there any exceptions to fasting a day or two before Ramadan begins?","id":"tirmidhi-8-130"},{"hadith-eng":"\"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"","reference":"Jami` at-Tirmidhi 686, Book 8, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Ammar bin Yasir's statement reflect the importance of certainty in religious observances?","id":"tirmidhi-8-131"},{"hadith-eng":"the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"","reference":"Jami` at-Tirmidhi 687, Book 8, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the sighting of the crescent moon affect the determination of Ramadan?","id":"tirmidhi-8-132"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast before Ramadan. Fast with its sighting, and break fast with its sighting, and if it is obscured from you, then complete thirty days.\"","reference":"Jami` at-Tirmidhi 688, Book 8, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it advised not to fast before the month of Ramadan begins?","id":"tirmidhi-8-133"},{"hadith-eng":"\"What I fasted with the Prophet that was twenty-nine (days), was more than what we fasted that was thirty.\"\n(He said): There are narrations on this topic from `Umar, Abu Hurairah, `A'isha, Sa`d bin Abi Waqqas, Ibn `Abbas, Ibn `Umar, Anas, Jabir, Umm Salamah, Abu Bakrah, that the Prophet (ﷺ) said: \"The month is twenty nine (days).\"","reference":"Jami` at-Tirmidhi 689, Book 8, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the variation in the number of days in a month affect the observance of fasting in Islam?","id":"tirmidhi-8-134"},{"hadith-eng":"\"The Messenger of Allah vowed to stay away from his wives for a month, so he stayed in a loft for twenty-nine days. They said: 'O Messenger of Allah, your vow was for a month,' so he said: 'The month is twenty-nine (days).'\"","reference":"Jami` at-Tirmidhi 690, Book 8, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Islamic calendar define the length of a month?","id":"tirmidhi-8-135"},{"hadith-eng":"\"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"","reference":"Jami` at-Tirmidhi 691, Book 8, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the testimony of faith play a role in Islamic practices and rituals?","id":"tirmidhi-8-136"},{"hadith-eng":"the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"","reference":"Jami` at-Tirmidhi 692, Book 8, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why are the months of Ramadan and Dhul-Hijjah considered important in the Islamic calendar?","id":"tirmidhi-8-137"},{"hadith-eng":"\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"","reference":"Jami` at-Tirmidhi 693, Book 8, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Ibn Abbas respond to the moon sighting reported from Ash-Sham?","id":"tirmidhi-8-138"},{"hadith-eng":"the Messenger of Allah said: \"Whoever has dried dates, then let him break the fast with that, and whoever does not, then let him break the fast with water, for indeed water is purifying.\"","reference":"Jami` at-Tirmidhi 694, Book 8, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why are dried dates considered significant for breaking the fast?","id":"tirmidhi-8-139"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"","reference":"Jami` at-Tirmidhi 695, Book 8, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"What should a person do if they cannot find dates to break their fast?","id":"tirmidhi-8-140"},{"hadith-eng":"\"The Messenger of Allah would break the fast with fresh dates before performing Salat. If there were no fresh dates then (he would break the fast) with dried dates, and if there were no dried dates then he would take a few sips of water.\"","reference":"Jami` at-Tirmidhi 696, Book 8, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #2","question":"What alternatives are suggested if fresh dates are not available for breaking the fast?","id":"tirmidhi-8-141"},{"hadith-eng":"the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"","reference":"Jami` at-Tirmidhi 697, Book 8, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the timing of religious practices like fasting and sacrifice relate to the community's actions?","id":"tirmidhi-8-142"},{"hadith-eng":"The Messenger of Allah said: \"When the night advances and the day retreats, and the sun is hidden, then the fast is to be broken.\"","reference":"Jami` at-Tirmidhi 698, Book 8, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the position of the sun relate to the timing of breaking the fast?","id":"tirmidhi-8-143"},{"hadith-eng":"the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\"","reference":"Jami` at-Tirmidhi 699, Book 8, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of breaking the fast relate to the concept of goodness in the community?","id":"tirmidhi-8-144"},{"hadith-eng":"the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"","reference":"Jami` at-Tirmidhi 700, Book 8, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of breaking the fast quickly in Islam?","id":"tirmidhi-8-145"},{"hadith-eng":"(A Hadith similar to no. 700 with a different chain).","reference":"Jami` at-Tirmidhi 701, Book 8, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the chain of narration affect the authenticity of a hadith?","id":"tirmidhi-8-146"},{"hadith-eng":"\"Masruq and I entered upon Aishah and we said: 'O Mother of the Believers! There are two men from the Companions of Muhammad, one of them hastens to break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"","reference":"Jami` at-Tirmidhi 702, Book 8, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) approach the timing of breaking the fast and performing Salat?","id":"tirmidhi-8-147"},{"hadith-eng":"Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 703, Book 8, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of the pre-dawn meal relate to the timing of the Fajr prayer?","id":"tirmidhi-8-148"},{"hadith-eng":"(Another chain) except that he said: \"About the length for reciting fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 704, Book 8, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the recitation of a specific number of Ayahs relate to the performance of certain religious duties?","id":"tirmidhi-8-149"},{"hadith-eng":"The Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears to you on the horizon.\"","reference":"Jami` at-Tirmidhi 705, Book 8, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the appearance of redness on the horizon relate to the fasting schedule?","id":"tirmidhi-8-150"},{"hadith-eng":"the Messenger of Allah said: \"Do not let the Adhan of Bilal prevent you from your Sahar, nor the drawn out Fajr, but the Fajr that spreads on the horizon.\"","reference":"Jami` at-Tirmidhi 706, Book 8, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can one distinguish between the drawn out Fajr and the Fajr that spreads on the horizon?","id":"tirmidhi-8-151"},{"hadith-eng":"the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"","reference":"Jami` at-Tirmidhi 707, Book 8, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does engaging in false speech affect the spiritual benefits of fasting?","id":"tirmidhi-8-152"},{"hadith-eng":"the Messenger of Allah said: \"Partake of Sahar, for indeed there is a blessing in the Sahar.\"","reference":"Jami` at-Tirmidhi 708, Book 8, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the concept of blessing associated with the pre-dawn meal in Islam?","id":"tirmidhi-8-153"},{"hadith-eng":"(similar to no. 708) from the Prophet.","reference":"Jami` at-Tirmidhi 709, Book 8, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the repetition of a hadith in different narrations affect its understanding and interpretation?","id":"tirmidhi-8-154"},{"hadith-eng":"\"The Messenger of Allah went to Makkah in the Year of the Conquest, so he fasted until he reached Kura Al-Ghamim and the people were fasting with him. Then it was said to him: 'The fast has become difficult for the people, and they are watching you to see what you will do.' So after Asr, he called for a cup of water and drank it while the people were looking at him. Some of them broke the fast while some of them continued their fasting. It was conveyed to him that people were still fasting, so he said: \"Those are the disobedient.'\"","reference":"Jami` at-Tirmidhi 710, Book 8, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet demonstrate leadership and consideration for his followers during the journey to Makkah?","id":"tirmidhi-8-155"},{"hadith-eng":"Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"","reference":"Jami` at-Tirmidhi 711, Book 8, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam provide flexibility in religious obligations during travel?","id":"tirmidhi-8-156"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"","reference":"Jami` at-Tirmidhi 712, Book 8, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this narration illustrate the flexibility of fasting rules during travel in Ramadan?","id":"tirmidhi-8-157"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"","reference":"Jami` at-Tirmidhi 713, Book 8, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this narration illustrate the flexibility in Islamic rulings concerning fasting while traveling?","id":"tirmidhi-8-158"},{"hadith-eng":"he asked Ibn Al-Musaiyab about fasting on a journey, so he narrated to him that Umar bin Al-Khattab said: \"We fought in two battles along with the Messenger of Allah during Ramadan; the Day of Badr, and the Conquest (of Makkah), so we broke our fast during them.\"","reference":"Jami` at-Tirmidhi 714, Book 8, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet handle fasting during significant battles?","id":"tirmidhi-8-159"},{"hadith-eng":"\"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - or fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the breast-feeding person.' And by Allah! The Prophet said both of them or one of them. So woe to me! For I did not eat from the meal of the Prophet.\"","reference":"Jami` at-Tirmidhi 715, Book 8, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the hadith address the concept of flexibility in religious obligations for certain individuals?","id":"tirmidhi-8-160"},{"hadith-eng":"\"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"","reference":"Jami` at-Tirmidhi 716, Book 8, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of debt relate to religious duties in Islam?","id":"tirmidhi-8-161"},{"hadith-eng":"(A Hadith similar to no. 716 with a different chain.)","reference":"Jami` at-Tirmidhi 717, Book 8, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the variation in chains of narration affect the authenticity of a hadith?","id":"tirmidhi-8-162"},{"hadith-eng":"the Prophet said: \"Whoever died while he had a month to fast, then a needy person should be fed on his behalf in place of every day.\"","reference":"Jami` at-Tirmidhi 718, Book 8, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can the obligation of missed fasts be fulfilled on behalf of a deceased person?","id":"tirmidhi-8-163"},{"hadith-eng":"the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"","reference":"Jami` at-Tirmidhi 719, Book 8, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic jurisprudence view the impact of cupping on fasting?","id":"tirmidhi-8-164"},{"hadith-eng":"the Prophet said: \"Whoever is overcome by vomiting, then he is not required to make up (the fast), and whoever vomits on purpose, then he must make it up.\"","reference":"Jami` at-Tirmidhi 720, Book 8, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #2","question":"What should a person do if they induce vomiting while fasting?","id":"tirmidhi-8-165"},{"hadith-eng":"\"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision that Allah provided for him.\"","reference":"Jami` at-Tirmidhi 721, Book 8, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view unintentional actions during fasting?","id":"tirmidhi-8-166"},{"hadith-eng":"(Another chain) with the same or similar (Hadith as no. 721).","reference":"Jami` at-Tirmidhi 722, Book 8, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the importance of verifying the chain of narration in hadith literature?","id":"tirmidhi-8-167"},{"hadith-eng":"the Messenger of Allah said: \"Whoever breaks the fast during Ramadan without an allowance or illness, then if he fasted for all time, his fasting would not make up for it.\"","reference":"Jami` at-Tirmidhi 723, Book 8, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #2","question":"How significant is it to maintain the fast during Ramadan according to Islamic teachings?","id":"tirmidhi-8-168"},{"hadith-eng":"A man came and said: \"O Messenger of Allah; I am ruined!\" He said: \"What has ruined you?\" He said: \"I had sexual relations with my wife during Ramadan.\" He said: \"Are you able to free a slave?\" He said, \"No.\" He said: \"Then are you able to fast for two consecutive months?\" He said, \"No.\" He said: \"Then are you able to feed sixty needy people?\" He said, \"No.\" He said: \"Sit.\" So he sat. A big basket full of dates was brought to the Prophet, and he said: \"Give it in charity.\" So he said: \"There is no one needier than us between its two mountains.\" So the Prophet laughing until his pre-molar teeth appeared, and he said: \"Then take it to feed your family.\"","reference":"Jami` at-Tirmidhi 724, Book 8, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the options for expiation if someone breaks their fast by having sexual relations during Ramadan?","id":"tirmidhi-8-169"},{"hadith-eng":"\"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"","reference":"Jami` at-Tirmidhi 725, Book 8, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #2","question":"How frequently did the Prophet Muhammad (ﷺ) use the Siwak while fasting according to this narration?","id":"tirmidhi-8-170"},{"hadith-eng":"a man came to the Prophet and said: \"My eyes are bothering me, can I use Kuhl while I am fasting?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 726, Book 8, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #2","question":"What guidance did the Prophet provide regarding the use of Kuhl during fasting?","id":"tirmidhi-8-171"},{"hadith-eng":"\"The Prophet would kiss during the month of fasting.\"","reference":"Jami` at-Tirmidhi 727, Book 8, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the act of kissing relate to the observance of fasting in Islam?","id":"tirmidhi-8-172"},{"hadith-eng":"\"The Messenger of Allah would fondle me while he was fasting, and he had the most control among you of his limb (li irbihi).\"","reference":"Jami` at-Tirmidhi 728, Book 8, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this narration illustrate the balance between marital affection and religious observance?","id":"tirmidhi-8-173"},{"hadith-eng":"\"The Messenger of Allah would kiss and fondle while he was fasting, and he had the most control among you of his limbs.\"","reference":"Jami` at-Tirmidhi 729, Book 8, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does self-control relate to fasting in Islam?","id":"tirmidhi-8-174"},{"hadith-eng":"the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"","reference":"Jami` at-Tirmidhi 730, Book 8, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the timing of making an intention affect the validity of a fast?","id":"tirmidhi-8-175"},{"hadith-eng":"\"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"","reference":"Jami` at-Tirmidhi 731, Book 8, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) respond to someone who unintentionally breaks a fast?","id":"tirmidhi-8-176"},{"hadith-eng":"\"A person from the offspring of Umm Hani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, and Umm Hani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this from Umm Hani?' He said: 'No Abu Salih and our family informed us of it from Umm Hani.'\"","reference":"Jami` at-Tirmidhi 732, Book 8, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of personal discretion apply to voluntary fasting?","id":"tirmidhi-8-177"},{"hadith-eng":"\"The Messenger of Allah visited me one day and said: 'Do you have anything (to eat)?'\" She said: \"I said: 'No.' He said: 'Then I am fasting.'\"","reference":"Jami` at-Tirmidhi 733, Book 8, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet (ﷺ) demonstrate flexibility in his daily routine regarding fasting?","id":"tirmidhi-8-178"},{"hadith-eng":"\"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"","reference":"Jami` at-Tirmidhi 734, Book 8, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of intention affect the observance of fasting in Islam?","id":"tirmidhi-8-179"},{"hadith-eng":"\"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"","reference":"Jami` at-Tirmidhi 735, Book 8, Hadith 54","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of making up a missed fast reflect on the principles of accountability in Islam?","id":"tirmidhi-8-180"},{"hadith-eng":"\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"","reference":"Jami` at-Tirmidhi 736, Book 8, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #2","question":"How often did the Prophet Muhammad (ﷺ) fast consecutively, according to the narration?","id":"tirmidhi-8-181"},{"hadith-eng":"from the Prophet.","reference":"Jami` at-Tirmidhi 737, Book 8, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the chain of narration impact the authenticity of a hadith?","id":"tirmidhi-8-182"},{"hadith-eng":"the Messenger of Allah said: \"When a half of Sha'ban remains then do not fast.\"","reference":"Jami` at-Tirmidhi 738, Book 8, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might fasting be discouraged during the latter half of Sha'ban?","id":"tirmidhi-8-183"},{"hadith-eng":"\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"","reference":"Jami` at-Tirmidhi 739, Book 8, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Allah's forgiveness manifest during the night of the middle of Sha'ban?","id":"tirmidhi-8-184"},{"hadith-eng":"the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"","reference":"Jami` at-Tirmidhi 740, Book 8, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance does the month of Al-Muharram hold in Islamic tradition?","id":"tirmidhi-8-185"},{"hadith-eng":"\"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"","reference":"Jami` at-Tirmidhi 741, Book 8, Hadith 60","grade":"Da'if(Darussalam)","question #":"question #2","question":"What significance does the month of Al-Muharram hold in Islam?","id":"tirmidhi-8-186"},{"hadith-eng":"\"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"","reference":"Jami` at-Tirmidhi 742, Book 8, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #2","question":"How often did the Prophet Muhammad (ﷺ) fast during the beginning of the month?","id":"tirmidhi-8-187"},{"hadith-eng":"the Messenger of Allah said: \"None of you should fast on Friday unless he fasts before it, or he fasts after it.\"","reference":"Jami` at-Tirmidhi 743, Book 8, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it recommended to fast on days before or after Friday?","id":"tirmidhi-8-188"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"","reference":"Jami` at-Tirmidhi 744, Book 8, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #2","question":"Under what circumstances is fasting on Saturday permissible?","id":"tirmidhi-8-189"},{"hadith-eng":"\"The Prophet used to try to fast on Mondays and Thursdays.\"","reference":"Jami` at-Tirmidhi 745, Book 8, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of fasting on specific days in Islam?","id":"tirmidhi-8-190"},{"hadith-eng":"\"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"","reference":"Jami` at-Tirmidhi 746, Book 8, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the fasting schedule of the Prophet Muhammad (ﷺ) vary between different months?","id":"tirmidhi-8-191"},{"hadith-eng":"the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"","reference":"Jami` at-Tirmidhi 747, Book 8, Hadith 66","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of fasting on specific days in Islam?","id":"tirmidhi-8-192"},{"hadith-eng":"\"I asked - or; the Prophet was asked - about fasting daily. So he said: 'Your family has a right over you.' Then he said: 'Fast Ramadan and that which is after it, and every Wednesday and Thursday. If you do that, then you will have fasted daily, as well as broken (the fast).'\"","reference":"Jami` at-Tirmidhi 748, Book 8, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can one achieve the reward of fasting daily while still observing breaks?","id":"tirmidhi-8-193"},{"hadith-eng":"the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"","reference":"Jami` at-Tirmidhi 749, Book 8, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does fasting on the Day of Arafah impact the forgiveness of sins?","id":"tirmidhi-8-194"},{"hadith-eng":"\"The Prophet broke (the fast) of Arafah, Umm Fadl sent him some milk to drink.\"","reference":"Jami` at-Tirmidhi 750, Book 8, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet respond to receiving milk from Umm Fadl on the day of Arafah?","id":"tirmidhi-8-195"},{"hadith-eng":"\"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"","reference":"Jami` at-Tirmidhi 751, Book 8, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad and his companions approach fasting on the Day of Arafah during Hajj?","id":"tirmidhi-8-196"},{"hadith-eng":"the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"","reference":"Jami` at-Tirmidhi 752, Book 8, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does fasting on Ashura relate to the forgiveness of sins?","id":"tirmidhi-8-197"},{"hadith-eng":"\"Ashura was a day that the Quraish used to fast during Jahiliyyah, and the Messenger of Allah used to fast it. But when (the fast of) Ramadan became obligatory, the Ramadan was the required and Ashura was left. So whoever wanted to, he fasted it, and whoever wanted to, he left it.\"","reference":"Jami` at-Tirmidhi 753, Book 8, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the obligation of fasting change with the introduction of Ramadan in Islam?","id":"tirmidhi-8-198"},{"hadith-eng":"\"I met up with Ibn Abbas while he was reclining on his Rida at the Zamzam (well). So I said: 'Inform me about the Day of Ashura. On which day is it fasted?' He said: 'When you see the crescent of Al-Muharram, then count, then fast on the morning of the ninth day.'\" He said: 'I said: Is this how Muhammad fasted it?' He said: 'Yes.'\"","reference":"Jami` at-Tirmidhi 754, Book 8, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the date for fasting on Ashura determined according to Islamic tradition?","id":"tirmidhi-8-199"},{"hadith-eng":"\"The Messenger of Allah ordered fasting the tenth day for the Day of Ashura.\"","reference":"Jami` at-Tirmidhi 755, Book 8, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #2","question":"Which day is recommended for fasting according to Islamic tradition related to Ashura?","id":"tirmidhi-8-200"},{"hadith-eng":"\"I did not see the Prophet fasting at all during the ten.\"","reference":"Jami` at-Tirmidhi 756, Book 8, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of fasting vary among different periods in the Islamic calendar?","id":"tirmidhi-8-201"},{"hadith-eng":"the Messenger of Allah said: \"There are no days in which righteous deeds are more beloved to Allah than those ten days.\" They said: \"O Messenger of Allah! Not even Jihad in Allah Cause?\" The Messenger of Allah said: \"Not even Jihad in Allah's Cause, unless a man were to out with his self and his wealth and not return from that with anything.\"","reference":"Jami` at-Tirmidhi 757, Book 8, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do the ten days mentioned compare to Jihad in terms of their significance in Islam?","id":"tirmidhi-8-202"},{"hadith-eng":"the Prophet said: \"There are no days more beloved to Allah that He be worshipped in them than the ten days of Dhul-Hijjah, fasting every day of them is the equivalent of fasting a year, and standing every night of them (in prayer) is the equivalent of standing on the Night of Qadr.\"","reference":"Jami` at-Tirmidhi 758, Book 8, Hadith 77","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does fasting during the ten days of Dhul-Hijjah compare to fasting for an entire year?","id":"tirmidhi-8-203"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan, then follows it with six from Shawwal, then that is (equal in reward) to fasting everyday.\"","reference":"Jami` at-Tirmidhi 759, Book 8, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does fasting in the month of Shawwal complement the fasting of Ramadan?","id":"tirmidhi-8-204"},{"hadith-eng":"\"The Messenger of Allah took a covenant from me for three: To not sleep except after performing Witr, to fast three days of every month, and to perform the Duha prayer.\"","reference":"Jami` at-Tirmidhi 760, Book 8, Hadith 79","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is fasting three days of every month recommended in Islamic teachings?","id":"tirmidhi-8-205"},{"hadith-eng":"the Messenger of Allah said: \"O Abu Dharr! When you fast three days out of a month, then fast the thirteenth, fourteenth, and fifteenth.\"","reference":"Jami` at-Tirmidhi 761, Book 8, Hadith 80","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might fasting on specific days of the month be significant in Islamic practice?","id":"tirmidhi-8-206"},{"hadith-eng":"\"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"","reference":"Jami` at-Tirmidhi 762, Book 8, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does fasting three days a month equate to fasting every day according to Islamic teachings?","id":"tirmidhi-8-207"},{"hadith-eng":"\"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"","reference":"Jami` at-Tirmidhi 763, Book 8, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Aishah describe the Prophet's practice of fasting three days a month?","id":"tirmidhi-8-208"},{"hadith-eng":"The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 764, Book 8, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of the reward for good deeds in Islam, and how does it relate to fasting?","id":"tirmidhi-8-209"},{"hadith-eng":"The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"","reference":"Jami` at-Tirmidhi 765, Book 8, Hadith 84","grade":"Hasan(Darussalam)","question #":"question #2","question":"Who will be invited to enter through the gate of Ar-Raiyyan?","id":"tirmidhi-8-210"},{"hadith-eng":"The Messenger of Allah said: \"There are two joys for the fasting person: the joy when he breaks his fast, and the joy of when he meets his Lord.\"","reference":"Jami` at-Tirmidhi 766, Book 8, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does breaking the fast bring joy to a fasting person?","id":"tirmidhi-8-211"},{"hadith-eng":"\"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"","reference":"Jami` at-Tirmidhi 767, Book 8, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does fasting every day affect the spiritual and physical aspects of a Muslim's life?","id":"tirmidhi-8-212"},{"hadith-eng":"\"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"","reference":"Jami` at-Tirmidhi 768, Book 8, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #2","question":"What was the only month in which the Prophet Muhammad (ﷺ) fasted for the entire duration?","id":"tirmidhi-8-213"},{"hadith-eng":"Anas bin Malik was asked about the Prophet's fasting and he said: \"He would fast during a month until we thought that he did not want to abstain from fasting during any of it. And, he would not fast during a month until we thought that he did not want to fast during any of it. (There was no time) that I wanted to see if he was performing Salat during the night, except that I would see him praying, nor to see him sleeping, except that I would see him sleeping.\"","reference":"Jami` at-Tirmidhi 769, Book 8, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #2","question":"What can be learned about the Prophet's (ﷺ) night prayers from Anas bin Malik's observation?","id":"tirmidhi-8-214"},{"hadith-eng":"The Messenger of Allah said: \"The most virtuous fast is the fast of my brother Dawud. He would fast a day, and not fast (the next) day. He would not flee at the time of engagement (with the enemy).\"","reference":"Jami` at-Tirmidhi 770, Book 8, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Prophet Dawud practice fasting according to Islamic teachings?","id":"tirmidhi-8-215"},{"hadith-eng":"\"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"","reference":"Jami` at-Tirmidhi 771, Book 8, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is fasting prohibited on the Day of Fitr and the Day of Adha?","id":"tirmidhi-8-216"},{"hadith-eng":"\"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"","reference":"Jami` at-Tirmidhi 772, Book 8, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of the Day of Adha in Islam?","id":"tirmidhi-8-217"},{"hadith-eng":"The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"","reference":"Jami` at-Tirmidhi 773, Book 8, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #2","question":"What activities are encouraged during the Days of Tashriq according to Islamic teachings?","id":"tirmidhi-8-218"},{"hadith-eng":"The Prophet said: \"The cupper and the one cupped have broke the fast.\"","reference":"Jami` at-Tirmidhi 774, Book 8, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does cupping affect the validity of a fast?","id":"tirmidhi-8-219"},{"hadith-eng":"\"the Messenger of Allah was cupped while he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 775, Book 8, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of cupping relate to the observance of fasting in Islam?","id":"tirmidhi-8-220"},{"hadith-eng":"\"The Prophet was cupped while he was fasting.\"","reference":"Jami` at-Tirmidhi 776, Book 8, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of cupping relate to the observance of fasting?","id":"tirmidhi-8-221"},{"hadith-eng":"\"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 777, Book 8, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does fasting affect the permissibility of medical treatments like cupping?","id":"tirmidhi-8-222"},{"hadith-eng":"the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"","reference":"Jami` at-Tirmidhi 778, Book 8, Hadith 97","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad's ability to perform Wisal differ from that of his followers?","id":"tirmidhi-8-223"},{"hadith-eng":"\"Aishah and Umm Salamah, the wives of the Prophet informed me that the Prophet would find that it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"","reference":"Jami` at-Tirmidhi 779, Book 8, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the state of being Junub affect the validity of fasting?","id":"tirmidhi-8-224"},{"hadith-eng":"The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.","reference":"Jami` at-Tirmidhi 780, Book 8, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should a fasting person respond to an invitation to eat?","id":"tirmidhi-8-225"},{"hadith-eng":"The Prophet said: \"When one of you is invited (to a meal) and he is fasting, then let him said: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 781, Book 8, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one communicate their fasting status when invited to eat?","id":"tirmidhi-8-226"},{"hadith-eng":"The Prophet said: \"A woman may not fast a day - other than in the month of Ramadan - while her husband is present, except with his permission.\"","reference":"Jami` at-Tirmidhi 782, Book 8, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the presence of a husband affect a woman's voluntary fasting?","id":"tirmidhi-8-227"},{"hadith-eng":"\"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"","reference":"Jami` at-Tirmidhi 783, Book 8, Hadith 102","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did Aishah manage her missed fasts from Ramadan according to her narration?","id":"tirmidhi-8-228"},{"hadith-eng":"The Prophet said: \"When those who are not fasting eat in the presence of the fasting person, the angels send Salat upon him.\"","reference":"Jami` at-Tirmidhi 784, Book 8, Hadith 103","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the presence of non-fasting individuals affect the spiritual state of a fasting person?","id":"tirmidhi-8-229"},{"hadith-eng":"\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother] Umm Amarah bint Ka'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\"","reference":"Jami` at-Tirmidhi 785, Book 8, Hadith 104","grade":"Hasan(Darussalam)","question #":"question #2","question":"How do the angels interact with a fasting person when others are eating around them?","id":"tirmidhi-8-230"},{"hadith-eng":"From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\"","reference":"Jami` at-Tirmidhi 786, Book 8, Hadith 105","grade":"Hasan(Darussalam)","question #":"question #2","question":"How do different chains of narration affect the understanding of a hadith?","id":"tirmidhi-8-231"},{"hadith-eng":"\"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"","reference":"Jami` at-Tirmidhi 787, Book 8, Hadith 106","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why are women not required to make up missed prayers during menstruation?","id":"tirmidhi-8-232"},{"hadith-eng":"From his father who said: \"I said. 'O Messenger of Allah! Inform me about Wudu.' So he said: \"Perform Wudu well, and go between the fingers, and perform Istinshaq extensively except when fasting.\"","reference":"Jami` at-Tirmidhi 788, Book 8, Hadith 107","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to clean between the fingers during Wudu?","id":"tirmidhi-8-233"},{"hadith-eng":"The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"","reference":"Jami` at-Tirmidhi 789, Book 8, Hadith 108","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of communal harmony relate to individual acts of worship like fasting?","id":"tirmidhi-8-234"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (days) of Ramadan until Allah took him.\"","reference":"Jami` at-Tirmidhi 790, Book 8, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) observe the last ten days of Ramadan?","id":"tirmidhi-8-235"},{"hadith-eng":"\"When the Messenger of Allah wanted to perform I'tikaf, he would perform Fajr prayer and then he would enter his place of I'tikaf.\"","reference":"Jami` at-Tirmidhi 791, Book 8, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prepare for I'tikaf?","id":"tirmidhi-8-236"},{"hadith-eng":"\"The Messenger of Allah would Yujawir (stay in I'tikaf) during the last ten (nights) of Ramadan and he said: 'Seek the Night of Al-Qadr during the last ten (nights) of Ramadan.'\"","reference":"Jami` at-Tirmidhi 792, Book 8, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the Night of Al-Qadr considered important in Islamic tradition?","id":"tirmidhi-8-237"},{"hadith-eng":"\"I said to Ubayy bin Ka'b: 'O Abu Al-Mundhir! How do you know that it is the night of the twenty-seventh?' He said: 'Rather, the Messenger of Allah informed us that it is a night (after which) the sun rises without rays, so we counted and we remembered it. By Allah! Ibn Mas'ud learned that it is in Ramadan and that it is the nigh of the twenty-seventh, but he did not want to inform you lest you would depend on it.\"","reference":"Jami` at-Tirmidhi 793, Book 8, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might some companions choose not to disclose the exact night of Laylat al-Qadr?","id":"tirmidhi-8-238"},{"hadith-eng":"\"My father narrated to me: 'The Night of Al-Qadr was mentioned in the presence of Abu Bakrah, so he said: \"I do not search for it due to something that I heard from the Messenger of Allah, except for during the last ten (nights); for indeed I heard him say: 'Search for it when nine remain, or; when seven remain, or; when five remain, or; during the last three nights.'\" He (Uyainah) said: \"During the twenty (nights) of Ramadan, Abu Bakrah used to perform Salat just as he performed Salat during the rest of the year. But when the (last) ten began, he would struggle (performing more Salat during the night).\"","reference":"Jami` at-Tirmidhi 794, Book 8, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Abu Bakrah's prayer routine change during the last ten nights of Ramadan?","id":"tirmidhi-8-239"},{"hadith-eng":"\"The Prophet would awaken his family during the last ten (nights) of Ramadan.\"","reference":"Jami` at-Tirmidhi 795, Book 8, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet involve his family in the practices of the last ten nights of Ramadan?","id":"tirmidhi-8-240"},{"hadith-eng":"\"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"","reference":"Jami` at-Tirmidhi 796, Book 8, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad increase his efforts in worship during the last ten nights of Ramadan?","id":"tirmidhi-8-241"},{"hadith-eng":"The Prophet said: \"Fasting during the winter is an easy reward.\"","reference":"Jami` at-Tirmidhi 797, Book 8, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is fasting considered easier during the winter months?","id":"tirmidhi-8-242"},{"hadith-eng":"\"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"","reference":"Jami` at-Tirmidhi 798, Book 8, Hadith 117","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the early Muslims respond to the revelation of new Quranic verses?","id":"tirmidhi-8-243"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan and he was about to travel. His mount was prepared for him, and he put on his traveling clothes, then he called for some food to eat, and I said to him: 'Is it Sunnah?' He said: 'It is Sunnah.' Then he rode.\"","reference":"Jami` at-Tirmidhi 799, Book 8, Hadith 118","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Anas bin Malik demonstrate the practice of Sunnah before traveling?","id":"tirmidhi-8-244"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan\" and he mentioned a similar narration (as no. 799).","reference":"Jami` at-Tirmidhi 800, Book 8, Hadith 119","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can the practices of the companions during Ramadan serve as a model for Muslims today?","id":"tirmidhi-8-245"},{"hadith-eng":"The Messenger of Allah said: \"The gift for the fasting person is (fragrant) oil and a censer.\"","reference":"Jami` at-Tirmidhi 801, Book 8, Hadith 120","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can fragrant oil and a censer be significant for someone who is fasting?","id":"tirmidhi-8-246"},{"hadith-eng":"The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"","reference":"Jami` at-Tirmidhi 802, Book 8, Hadith 121","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the day of Eid al-Adha identified according to Islamic teachings?","id":"tirmidhi-8-247"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (nights) of Ramadan. One year he did not perform I'tikaf, so he performed I'tikaf for twenty (nights) in the following year.\"","reference":"Jami` at-Tirmidhi 803, Book 8, Hadith 122","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet compensate for missing I'tikaf in one year?","id":"tirmidhi-8-248"},{"hadith-eng":"\"When the Messenger of Allah performed I'tikaf, he would bring his head near me so I could comb it, and he would not enter the house except for some personal needs.\"","reference":"Jami` at-Tirmidhi 804, Book 8, Hadith 123","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain personal grooming during I'tikaf?","id":"tirmidhi-8-249"},{"hadith-eng":"\"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"","reference":"Jami` at-Tirmidhi 806, Book 8, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does praying with the Imam affect the reward of praying the entire night?","id":"tirmidhi-8-250"},{"hadith-eng":"The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"","reference":"Jami` at-Tirmidhi 807, Book 8, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does sharing in the reward of a fasting person benefit the provider of food?","id":"tirmidhi-8-251"},{"hadith-eng":"\"The Messenger of Allah would encourage the  night prayer in Ramadan without firmly ordering it, and he would say: \"Whoever stands (in the night prayer) for Ramadan with faith and seeking the reward (from Allah), then he will be forgiven what has preceded of his sins.' So the Messenger of Allah died and the matter was like that. Then the matter was the same during the Khilafah of Abu Bakr and it continued during a portion of the Khilafah of Umar bin Al-Khattab.\"","reference":"Jami` at-Tirmidhi 808, Book 8, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the practice of night prayer in Ramadan continue after the death of the Prophet Muhammad?","id":"tirmidhi-8-252"},{"hadith-eng":"the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"","reference":"Jami` at-Tirmidhi 682, Book 8, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the caller's message during Ramadan nights?","id":"tirmidhi-8-253"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"","reference":"Jami` at-Tirmidhi 683, Book 8, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the Night of Al-Qadr in Islam?","id":"tirmidhi-8-254"},{"hadith-eng":"the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"","reference":"Jami` at-Tirmidhi 684, Book 8, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What should be done if the sky is cloudy and the moon cannot be sighted for determining the fasting month?","id":"tirmidhi-8-255"},{"hadith-eng":"the Messenger of Allah said: \"Do no precede the month of Ramadan by fasting a day or two before it, unless it is the case of a man who normally performs some fast, then let him fast it.\"","reference":"Jami` at-Tirmidhi 685, Book 8, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does one's regular fasting routine affect the permissibility of fasting before Ramadan?","id":"tirmidhi-8-256"},{"hadith-eng":"\"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"","reference":"Jami` at-Tirmidhi 686, Book 8, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of fasting on a day of doubt according to Islamic tradition?","id":"tirmidhi-8-257"},{"hadith-eng":"the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"","reference":"Jami` at-Tirmidhi 687, Book 8, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #3","question":"Why is it important to count the days of Sha'ban in relation to Ramadan?","id":"tirmidhi-8-258"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast before Ramadan. Fast with its sighting, and break fast with its sighting, and if it is obscured from you, then complete thirty days.\"","reference":"Jami` at-Tirmidhi 688, Book 8, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What should be done if the moon is not visible at the end of Sha'ban?","id":"tirmidhi-8-259"},{"hadith-eng":"\"What I fasted with the Prophet that was twenty-nine (days), was more than what we fasted that was thirty.\"\n(He said): There are narrations on this topic from `Umar, Abu Hurairah, `A'isha, Sa`d bin Abi Waqqas, Ibn `Abbas, Ibn `Umar, Anas, Jabir, Umm Salamah, Abu Bakrah, that the Prophet (ﷺ) said: \"The month is twenty nine (days).\"","reference":"Jami` at-Tirmidhi 689, Book 8, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of the Prophet's practice on the understanding of the Islamic calendar?","id":"tirmidhi-8-260"},{"hadith-eng":"\"The Messenger of Allah vowed to stay away from his wives for a month, so he stayed in a loft for twenty-nine days. They said: 'O Messenger of Allah, your vow was for a month,' so he said: 'The month is twenty-nine (days).'\"","reference":"Jami` at-Tirmidhi 690, Book 8, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's explanation of the month's duration?","id":"tirmidhi-8-261"},{"hadith-eng":"\"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"","reference":"Jami` at-Tirmidhi 691, Book 8, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the process for announcing the beginning of fasting in the Islamic tradition?","id":"tirmidhi-8-262"},{"hadith-eng":"the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"","reference":"Jami` at-Tirmidhi 692, Book 8, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does it mean for the months of Ramadan and Dhul-Hijjah to not be deficient?","id":"tirmidhi-8-263"},{"hadith-eng":"\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"","reference":"Jami` at-Tirmidhi 693, Book 8, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the practice of the Prophet Muhammad regarding moon sighting and fasting?","id":"tirmidhi-8-264"},{"hadith-eng":"the Messenger of Allah said: \"Whoever has dried dates, then let him break the fast with that, and whoever does not, then let him break the fast with water, for indeed water is purifying.\"","reference":"Jami` at-Tirmidhi 694, Book 8, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of water in the context of breaking a fast?","id":"tirmidhi-8-265"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"","reference":"Jami` at-Tirmidhi 695, Book 8, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is water considered purifying in the context of breaking a fast?","id":"tirmidhi-8-266"},{"hadith-eng":"\"The Messenger of Allah would break the fast with fresh dates before performing Salat. If there were no fresh dates then (he would break the fast) with dried dates, and if there were no dried dates then he would take a few sips of water.\"","reference":"Jami` at-Tirmidhi 696, Book 8, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the practice of breaking the fast with dates relate to the Sunnah of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-8-267"},{"hadith-eng":"the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"","reference":"Jami` at-Tirmidhi 697, Book 8, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why is it important for Muslims to align their fasting and sacrifice with the community?","id":"tirmidhi-8-268"},{"hadith-eng":"The Messenger of Allah said: \"When the night advances and the day retreats, and the sun is hidden, then the fast is to be broken.\"","reference":"Jami` at-Tirmidhi 698, Book 8, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the night advancing and the day retreating in Islamic practices?","id":"tirmidhi-8-269"},{"hadith-eng":"the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\"","reference":"Jami` at-Tirmidhi 699, Book 8, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the benefits of promptly breaking the fast according to Islamic teachings?","id":"tirmidhi-8-270"},{"hadith-eng":"the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"","reference":"Jami` at-Tirmidhi 700, Book 8, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the timing of breaking the fast relate to one's devotion to Allah?","id":"tirmidhi-8-271"},{"hadith-eng":"(A Hadith similar to no. 700 with a different chain).","reference":"Jami` at-Tirmidhi 701, Book 8, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the key elements that contribute to the reliability of a hadith?","id":"tirmidhi-8-272"},{"hadith-eng":"\"Masruq and I entered upon Aishah and we said: 'O Mother of the Believers! There are two men from the Companions of Muhammad, one of them hastens to break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"","reference":"Jami` at-Tirmidhi 702, Book 8, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the actions of Abdullah bin Mas'ud regarding fasting and prayer?","id":"tirmidhi-8-273"},{"hadith-eng":"Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 703, Book 8, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the duration of time between the pre-dawn meal and the Fajr prayer?","id":"tirmidhi-8-274"},{"hadith-eng":"(Another chain) except that he said: \"About the length for reciting fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 704, Book 8, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the pace and focus required during the recitation of the Quran from this narration?","id":"tirmidhi-8-275"},{"hadith-eng":"The Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears to you on the horizon.\"","reference":"Jami` at-Tirmidhi 705, Book 8, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the rising glow in determining the time for Suhoor?","id":"tirmidhi-8-276"},{"hadith-eng":"the Messenger of Allah said: \"Do not let the Adhan of Bilal prevent you from your Sahar, nor the drawn out Fajr, but the Fajr that spreads on the horizon.\"","reference":"Jami` at-Tirmidhi 706, Book 8, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does the Prophet provide regarding the timing of the pre-dawn meal and Fajr prayer?","id":"tirmidhi-8-277"},{"hadith-eng":"the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"","reference":"Jami` at-Tirmidhi 707, Book 8, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions are considered contrary to the spirit of fasting according to Islamic teachings?","id":"tirmidhi-8-278"},{"hadith-eng":"the Messenger of Allah said: \"Partake of Sahar, for indeed there is a blessing in the Sahar.\"","reference":"Jami` at-Tirmidhi 708, Book 8, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it recommended to partake in Sahar during fasting?","id":"tirmidhi-8-279"},{"hadith-eng":"(similar to no. 708) from the Prophet.","reference":"Jami` at-Tirmidhi 709, Book 8, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of Jami` at-Tirmidhi in the compilation of hadith literature?","id":"tirmidhi-8-280"},{"hadith-eng":"\"The Messenger of Allah went to Makkah in the Year of the Conquest, so he fasted until he reached Kura Al-Ghamim and the people were fasting with him. Then it was said to him: 'The fast has become difficult for the people, and they are watching you to see what you will do.' So after Asr, he called for a cup of water and drank it while the people were looking at him. Some of them broke the fast while some of them continued their fasting. It was conveyed to him that people were still fasting, so he said: \"Those are the disobedient.'\"","reference":"Jami` at-Tirmidhi 710, Book 8, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the reaction of the people when the Prophet broke his fast, and how did he address those who continued fasting?","id":"tirmidhi-8-281"},{"hadith-eng":"Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"","reference":"Jami` at-Tirmidhi 711, Book 8, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What options does a traveler have regarding fasting according to Islamic teachings?","id":"tirmidhi-8-282"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"","reference":"Jami` at-Tirmidhi 712, Book 8, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the companions' attitudes towards fasting and breaking fast during travel?","id":"tirmidhi-8-283"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"","reference":"Jami` at-Tirmidhi 713, Book 8, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What considerations should be taken into account when deciding to fast or break the fast during travel?","id":"tirmidhi-8-284"},{"hadith-eng":"he asked Ibn Al-Musaiyab about fasting on a journey, so he narrated to him that Umar bin Al-Khattab said: \"We fought in two battles along with the Messenger of Allah during Ramadan; the Day of Badr, and the Conquest (of Makkah), so we broke our fast during them.\"","reference":"Jami` at-Tirmidhi 714, Book 8, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the exceptions to fasting during Ramadan according to Islamic teachings?","id":"tirmidhi-8-285"},{"hadith-eng":"\"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - or fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the breast-feeding person.' And by Allah! The Prophet said both of them or one of them. So woe to me! For I did not eat from the meal of the Prophet.\"","reference":"Jami` at-Tirmidhi 715, Book 8, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the Prophet inviting someone to eat while they are fasting?","id":"tirmidhi-8-286"},{"hadith-eng":"\"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"","reference":"Jami` at-Tirmidhi 716, Book 8, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of fulfilling the rights of Allah compared to human obligations?","id":"tirmidhi-8-287"},{"hadith-eng":"(A Hadith similar to no. 716 with a different chain.)","reference":"Jami` at-Tirmidhi 717, Book 8, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does Ibn Abbas play in the transmission of hadiths?","id":"tirmidhi-8-288"},{"hadith-eng":"the Prophet said: \"Whoever died while he had a month to fast, then a needy person should be fed on his behalf in place of every day.\"","reference":"Jami` at-Tirmidhi 718, Book 8, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of feeding a needy person in place of missed fasts?","id":"tirmidhi-8-289"},{"hadith-eng":"the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"","reference":"Jami` at-Tirmidhi 719, Book 8, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the ruling on vomiting during fasting in Islam?","id":"tirmidhi-8-290"},{"hadith-eng":"the Prophet said: \"Whoever is overcome by vomiting, then he is not required to make up (the fast), and whoever vomits on purpose, then he must make it up.\"","reference":"Jami` at-Tirmidhi 720, Book 8, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does intentional vomiting affect the validity of a fast?","id":"tirmidhi-8-291"},{"hadith-eng":"\"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision that Allah provided for him.\"","reference":"Jami` at-Tirmidhi 721, Book 8, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is considered a provision from Allah during fasting?","id":"tirmidhi-8-292"},{"hadith-eng":"(Another chain) with the same or similar (Hadith as no. 721).","reference":"Jami` at-Tirmidhi 722, Book 8, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the classification of hadiths contribute to Islamic jurisprudence?","id":"tirmidhi-8-293"},{"hadith-eng":"the Messenger of Allah said: \"Whoever breaks the fast during Ramadan without an allowance or illness, then if he fasted for all time, his fasting would not make up for it.\"","reference":"Jami` at-Tirmidhi 723, Book 8, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does Islamic tradition say about compensating for a missed fast during Ramadan without a valid excuse?","id":"tirmidhi-8-294"},{"hadith-eng":"A man came and said: \"O Messenger of Allah; I am ruined!\" He said: \"What has ruined you?\" He said: \"I had sexual relations with my wife during Ramadan.\" He said: \"Are you able to free a slave?\" He said, \"No.\" He said: \"Then are you able to fast for two consecutive months?\" He said, \"No.\" He said: \"Then are you able to feed sixty needy people?\" He said, \"No.\" He said: \"Sit.\" So he sat. A big basket full of dates was brought to the Prophet, and he said: \"Give it in charity.\" So he said: \"There is no one needier than us between its two mountains.\" So the Prophet laughing until his pre-molar teeth appeared, and he said: \"Then take it to feed your family.\"","reference":"Jami` at-Tirmidhi 724, Book 8, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of charity play a role in seeking forgiveness for breaking a fast?","id":"tirmidhi-8-295"},{"hadith-eng":"\"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"","reference":"Jami` at-Tirmidhi 725, Book 8, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) personal hygiene practices from this narration?","id":"tirmidhi-8-296"},{"hadith-eng":"a man came to the Prophet and said: \"My eyes are bothering me, can I use Kuhl while I am fasting?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 726, Book 8, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does this narration address concerns about maintaining a fast while using eye treatments?","id":"tirmidhi-8-297"},{"hadith-eng":"\"The Prophet would kiss during the month of fasting.\"","reference":"Jami` at-Tirmidhi 727, Book 8, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the boundaries of physical affection during Ramadan?","id":"tirmidhi-8-298"},{"hadith-eng":"\"The Messenger of Allah would fondle me while he was fasting, and he had the most control among you of his limb (li irbihi).\"","reference":"Jami` at-Tirmidhi 728, Book 8, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the permissibility of physical affection between spouses during fasting from this narration?","id":"tirmidhi-8-299"},{"hadith-eng":"\"The Messenger of Allah would kiss and fondle while he was fasting, and he had the most control among you of his limbs.\"","reference":"Jami` at-Tirmidhi 729, Book 8, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of controlling one's desires while fasting?","id":"tirmidhi-8-300"},{"hadith-eng":"the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"","reference":"Jami` at-Tirmidhi 730, Book 8, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences of not deciding to fast before Fajr?","id":"tirmidhi-8-301"},{"hadith-eng":"\"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"","reference":"Jami` at-Tirmidhi 731, Book 8, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of intention in fasting according to Islamic teachings?","id":"tirmidhi-8-302"},{"hadith-eng":"\"A person from the offspring of Umm Hani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, and Umm Hani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this from Umm Hani?' He said: 'No Abu Salih and our family informed us of it from Umm Hani.'\"","reference":"Jami` at-Tirmidhi 732, Book 8, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of sharing food or drink with others in Islamic tradition?","id":"tirmidhi-8-303"},{"hadith-eng":"\"The Messenger of Allah visited me one day and said: 'Do you have anything (to eat)?'\" She said: \"I said: 'No.' He said: 'Then I am fasting.'\"","reference":"Jami` at-Tirmidhi 733, Book 8, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration reveal about the simplicity of the Prophet's (ﷺ) lifestyle?","id":"tirmidhi-8-304"},{"hadith-eng":"\"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"","reference":"Jami` at-Tirmidhi 734, Book 8, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does receiving a gift play in the decision to break a fast?","id":"tirmidhi-8-305"},{"hadith-eng":"\"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"","reference":"Jami` at-Tirmidhi 735, Book 8, Hadith 54","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of honesty and confession in seeking guidance from the Prophet?","id":"tirmidhi-8-306"},{"hadith-eng":"\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"","reference":"Jami` at-Tirmidhi 736, Book 8, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's fasting habits outside of Ramadan?","id":"tirmidhi-8-307"},{"hadith-eng":"from the Prophet.","reference":"Jami` at-Tirmidhi 737, Book 8, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role does Jami` at-Tirmidhi play in the collection of hadiths?","id":"tirmidhi-8-308"},{"hadith-eng":"the Messenger of Allah said: \"When a half of Sha'ban remains then do not fast.\"","reference":"Jami` at-Tirmidhi 738, Book 8, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the timing of fasting relate to the preparation for Ramadan?","id":"tirmidhi-8-309"},{"hadith-eng":"\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"","reference":"Jami` at-Tirmidhi 739, Book 8, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the hadith imply about the relationship between the Prophet and his wives?","id":"tirmidhi-8-310"},{"hadith-eng":"the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"","reference":"Jami` at-Tirmidhi 740, Book 8, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does fasting in Al-Muharram compare to fasting in other months outside of Ramadan?","id":"tirmidhi-8-311"},{"hadith-eng":"\"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"","reference":"Jami` at-Tirmidhi 741, Book 8, Hadith 60","grade":"Da'if(Darussalam)","question #":"question #3","question":"Why is Al-Muharram referred to as Allah's month in Islamic tradition?","id":"tirmidhi-8-312"},{"hadith-eng":"\"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"","reference":"Jami` at-Tirmidhi 742, Book 8, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the importance of fasting on Fridays according to Islamic teachings?","id":"tirmidhi-8-313"},{"hadith-eng":"the Messenger of Allah said: \"None of you should fast on Friday unless he fasts before it, or he fasts after it.\"","reference":"Jami` at-Tirmidhi 743, Book 8, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the guidelines for fasting on Fridays in Islamic teachings?","id":"tirmidhi-8-314"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"","reference":"Jami` at-Tirmidhi 744, Book 8, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #3","question":"What should a person do if they have nothing to eat on a Saturday when fasting is not allowed?","id":"tirmidhi-8-315"},{"hadith-eng":"\"The Prophet used to try to fast on Mondays and Thursdays.\"","reference":"Jami` at-Tirmidhi 745, Book 8, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does fasting on Mondays and Thursdays relate to the practices of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-8-316"},{"hadith-eng":"\"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"","reference":"Jami` at-Tirmidhi 746, Book 8, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the flexibility of fasting practices from the Prophet Muhammad's (ﷺ) routine?","id":"tirmidhi-8-317"},{"hadith-eng":"the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"","reference":"Jami` at-Tirmidhi 747, Book 8, Hadith 66","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why might someone prefer to be fasting when their deeds are presented?","id":"tirmidhi-8-318"},{"hadith-eng":"\"I asked - or; the Prophet was asked - about fasting daily. So he said: 'Your family has a right over you.' Then he said: 'Fast Ramadan and that which is after it, and every Wednesday and Thursday. If you do that, then you will have fasted daily, as well as broken (the fast).'\"","reference":"Jami` at-Tirmidhi 748, Book 8, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #3","question":"What days are recommended for fasting outside of Ramadan according to Islamic teachings?","id":"tirmidhi-8-319"},{"hadith-eng":"the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"","reference":"Jami` at-Tirmidhi 749, Book 8, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the spiritual benefits associated with fasting on the Day of Arafah?","id":"tirmidhi-8-320"},{"hadith-eng":"\"The Prophet broke (the fast) of Arafah, Umm Fadl sent him some milk to drink.\"","reference":"Jami` at-Tirmidhi 750, Book 8, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the permissibility of consuming milk while fasting on Arafah?","id":"tirmidhi-8-321"},{"hadith-eng":"\"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"","reference":"Jami` at-Tirmidhi 751, Book 8, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the practice of fasting on the Day of Arafah from the actions of the Prophet and his companions?","id":"tirmidhi-8-322"},{"hadith-eng":"the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"","reference":"Jami` at-Tirmidhi 752, Book 8, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the benefits of observing the fast on the Day of Ashura?","id":"tirmidhi-8-323"},{"hadith-eng":"\"Ashura was a day that the Quraish used to fast during Jahiliyyah, and the Messenger of Allah used to fast it. But when (the fast of) Ramadan became obligatory, the Ramadan was the required and Ashura was left. So whoever wanted to, he fasted it, and whoever wanted to, he left it.\"","reference":"Jami` at-Tirmidhi 753, Book 8, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #3","question":"What options do Muslims have regarding fasting on the day of Ashura after the obligation of Ramadan?","id":"tirmidhi-8-324"},{"hadith-eng":"\"I met up with Ibn Abbas while he was reclining on his Rida at the Zamzam (well). So I said: 'Inform me about the Day of Ashura. On which day is it fasted?' He said: 'When you see the crescent of Al-Muharram, then count, then fast on the morning of the ninth day.'\" He said: 'I said: Is this how Muhammad fasted it?' He said: 'Yes.'\"","reference":"Jami` at-Tirmidhi 754, Book 8, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does the sighting of the crescent moon play in determining Islamic fasting days?","id":"tirmidhi-8-325"},{"hadith-eng":"\"The Messenger of Allah ordered fasting the tenth day for the Day of Ashura.\"","reference":"Jami` at-Tirmidhi 755, Book 8, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does fasting on Ashura reflect the teachings of the Prophet Muhammad (peace be upon him)?","id":"tirmidhi-8-326"},{"hadith-eng":"\"I did not see the Prophet fasting at all during the ten.\"","reference":"Jami` at-Tirmidhi 756, Book 8, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance do the first ten days of a month hold in Islamic tradition regarding fasting?","id":"tirmidhi-8-327"},{"hadith-eng":"the Messenger of Allah said: \"There are no days in which righteous deeds are more beloved to Allah than those ten days.\" They said: \"O Messenger of Allah! Not even Jihad in Allah Cause?\" The Messenger of Allah said: \"Not even Jihad in Allah's Cause, unless a man were to out with his self and his wealth and not return from that with anything.\"","reference":"Jami` at-Tirmidhi 757, Book 8, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of sacrificing one's self and wealth in the path of Allah?","id":"tirmidhi-8-328"},{"hadith-eng":"the Prophet said: \"There are no days more beloved to Allah that He be worshipped in them than the ten days of Dhul-Hijjah, fasting every day of them is the equivalent of fasting a year, and standing every night of them (in prayer) is the equivalent of standing on the Night of Qadr.\"","reference":"Jami` at-Tirmidhi 758, Book 8, Hadith 77","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the reward for standing in prayer during the nights of the ten days of Dhul-Hijjah?","id":"tirmidhi-8-329"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan, then follows it with six from Shawwal, then that is (equal in reward) to fasting everyday.\"","reference":"Jami` at-Tirmidhi 759, Book 8, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reward for fasting six days in Shawwal after Ramadan?","id":"tirmidhi-8-330"},{"hadith-eng":"\"The Messenger of Allah took a covenant from me for three: To not sleep except after performing Witr, to fast three days of every month, and to perform the Duha prayer.\"","reference":"Jami` at-Tirmidhi 760, Book 8, Hadith 79","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the importance of the Duha prayer in daily worship?","id":"tirmidhi-8-331"},{"hadith-eng":"the Messenger of Allah said: \"O Abu Dharr! When you fast three days out of a month, then fast the thirteenth, fourteenth, and fifteenth.\"","reference":"Jami` at-Tirmidhi 761, Book 8, Hadith 80","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does fasting on the thirteenth, fourteenth, and fifteenth of the lunar month benefit a Muslim?","id":"tirmidhi-8-332"},{"hadith-eng":"\"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"","reference":"Jami` at-Tirmidhi 762, Book 8, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the Quran say about the reward for good deeds?","id":"tirmidhi-8-333"},{"hadith-eng":"\"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"","reference":"Jami` at-Tirmidhi 763, Book 8, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the flexibility of the Prophet's fasting schedule from Aishah's response?","id":"tirmidhi-8-334"},{"hadith-eng":"The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 764, Book 8, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is the smell from the mouth of a fasting person considered more pleasant to Allah than musk?","id":"tirmidhi-8-335"},{"hadith-eng":"The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"","reference":"Jami` at-Tirmidhi 765, Book 8, Hadith 84","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the reward for those who fast, as mentioned in the hadith?","id":"tirmidhi-8-336"},{"hadith-eng":"The Messenger of Allah said: \"There are two joys for the fasting person: the joy when he breaks his fast, and the joy of when he meets his Lord.\"","reference":"Jami` at-Tirmidhi 766, Book 8, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of meeting one's Lord for a fasting person?","id":"tirmidhi-8-337"},{"hadith-eng":"\"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"","reference":"Jami` at-Tirmidhi 767, Book 8, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential drawbacks of fasting continuously without breaks?","id":"tirmidhi-8-338"},{"hadith-eng":"\"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"","reference":"Jami` at-Tirmidhi 768, Book 8, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did Aishah describe the Prophet's fasting habits in terms of consistency and variation?","id":"tirmidhi-8-339"},{"hadith-eng":"Anas bin Malik was asked about the Prophet's fasting and he said: \"He would fast during a month until we thought that he did not want to abstain from fasting during any of it. And, he would not fast during a month until we thought that he did not want to fast during any of it. (There was no time) that I wanted to see if he was performing Salat during the night, except that I would see him praying, nor to see him sleeping, except that I would see him sleeping.\"","reference":"Jami` at-Tirmidhi 769, Book 8, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet's (ﷺ) approach to fasting vary throughout the year?","id":"tirmidhi-8-340"},{"hadith-eng":"The Messenger of Allah said: \"The most virtuous fast is the fast of my brother Dawud. He would fast a day, and not fast (the next) day. He would not flee at the time of engagement (with the enemy).\"","reference":"Jami` at-Tirmidhi 770, Book 8, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of consistency and balance in religious practices like fasting?","id":"tirmidhi-8-341"},{"hadith-eng":"\"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"","reference":"Jami` at-Tirmidhi 771, Book 8, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the purpose of the Day of Fitr for Muslims?","id":"tirmidhi-8-342"},{"hadith-eng":"\"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"","reference":"Jami` at-Tirmidhi 772, Book 8, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the Day of Fitr in Islam?","id":"tirmidhi-8-343"},{"hadith-eng":"The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"","reference":"Jami` at-Tirmidhi 773, Book 8, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #3","question":"How is the Day of Arafah significant in the Islamic calendar?","id":"tirmidhi-8-344"},{"hadith-eng":"The Prophet said: \"The cupper and the one cupped have broke the fast.\"","reference":"Jami` at-Tirmidhi 774, Book 8, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications for both the cupper and the person being cupped during fasting?","id":"tirmidhi-8-345"},{"hadith-eng":"\"the Messenger of Allah was cupped while he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 775, Book 8, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of performing medical treatments like cupping while in the state of Ihram?","id":"tirmidhi-8-346"},{"hadith-eng":"\"The Prophet was cupped while he was fasting.\"","reference":"Jami` at-Tirmidhi 776, Book 8, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of medical treatments on fasting during Ramadan?","id":"tirmidhi-8-347"},{"hadith-eng":"\"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 777, Book 8, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the rules of Ihram and how do they relate to medical practices?","id":"tirmidhi-8-348"},{"hadith-eng":"the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"","reference":"Jami` at-Tirmidhi 778, Book 8, Hadith 97","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the statement 'my Lord feeds me and gives me to drink' imply about the Prophet's spiritual state during fasting?","id":"tirmidhi-8-349"},{"hadith-eng":"\"Aishah and Umm Salamah, the wives of the Prophet informed me that the Prophet would find that it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"","reference":"Jami` at-Tirmidhi 779, Book 8, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions did the Prophet take upon realizing it was Fajr while in a state of Janabah?","id":"tirmidhi-8-350"},{"hadith-eng":"The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.","reference":"Jami` at-Tirmidhi 780, Book 8, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of supplication when one is fasting and invited to eat?","id":"tirmidhi-8-351"},{"hadith-eng":"The Prophet said: \"When one of you is invited (to a meal) and he is fasting, then let him said: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 781, Book 8, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the etiquette for responding to meal invitations during fasting?","id":"tirmidhi-8-352"},{"hadith-eng":"The Prophet said: \"A woman may not fast a day - other than in the month of Ramadan - while her husband is present, except with his permission.\"","reference":"Jami` at-Tirmidhi 782, Book 8, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which a woman may fast outside of Ramadan according to Islamic teachings?","id":"tirmidhi-8-353"},{"hadith-eng":"\"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"","reference":"Jami` at-Tirmidhi 783, Book 8, Hadith 102","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be inferred about the flexibility in making up missed fasts from the actions of Aishah?","id":"tirmidhi-8-354"},{"hadith-eng":"The Prophet said: \"When those who are not fasting eat in the presence of the fasting person, the angels send Salat upon him.\"","reference":"Jami` at-Tirmidhi 784, Book 8, Hadith 103","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions or circumstances can lead to the angels sending blessings upon a person during Ramadan?","id":"tirmidhi-8-355"},{"hadith-eng":"\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother] Umm Amarah bint Ka'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\"","reference":"Jami` at-Tirmidhi 785, Book 8, Hadith 104","grade":"Hasan(Darussalam)","question #":"question #3","question":"What blessings are mentioned for a fasting person when they are surrounded by people who are eating?","id":"tirmidhi-8-356"},{"hadith-eng":"From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\"","reference":"Jami` at-Tirmidhi 786, Book 8, Hadith 105","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the role of the narrator in conveying the message of the Prophet accurately?","id":"tirmidhi-8-357"},{"hadith-eng":"\"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"","reference":"Jami` at-Tirmidhi 787, Book 8, Hadith 106","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does menstruation affect the religious obligations of fasting and prayer for women?","id":"tirmidhi-8-358"},{"hadith-eng":"From his father who said: \"I said. 'O Messenger of Allah! Inform me about Wudu.' So he said: \"Perform Wudu well, and go between the fingers, and perform Istinshaq extensively except when fasting.\"","reference":"Jami` at-Tirmidhi 788, Book 8, Hadith 107","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of performing Istinshaq extensively during Wudu?","id":"tirmidhi-8-359"},{"hadith-eng":"The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"","reference":"Jami` at-Tirmidhi 789, Book 8, Hadith 108","grade":"Da'if(Darussalam)","question #":"question #3","question":"Why might it be important to consider the preferences of a host when engaging in personal religious practices?","id":"tirmidhi-8-360"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (days) of Ramadan until Allah took him.\"","reference":"Jami` at-Tirmidhi 790, Book 8, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #3","question":"What practices are associated with I'tikaf in the context of Ramadan?","id":"tirmidhi-8-361"},{"hadith-eng":"\"When the Messenger of Allah wanted to perform I'tikaf, he would perform Fajr prayer and then he would enter his place of I'tikaf.\"","reference":"Jami` at-Tirmidhi 791, Book 8, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of I'tikaf in Islamic worship?","id":"tirmidhi-8-362"},{"hadith-eng":"\"The Messenger of Allah would Yujawir (stay in I'tikaf) during the last ten (nights) of Ramadan and he said: 'Seek the Night of Al-Qadr during the last ten (nights) of Ramadan.'\"","reference":"Jami` at-Tirmidhi 792, Book 8, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #3","question":"How can one seek the Night of Al-Qadr during Ramadan?","id":"tirmidhi-8-363"},{"hadith-eng":"\"I said to Ubayy bin Ka'b: 'O Abu Al-Mundhir! How do you know that it is the night of the twenty-seventh?' He said: 'Rather, the Messenger of Allah informed us that it is a night (after which) the sun rises without rays, so we counted and we remembered it. By Allah! Ibn Mas'ud learned that it is in Ramadan and that it is the nigh of the twenty-seventh, but he did not want to inform you lest you would depend on it.\"","reference":"Jami` at-Tirmidhi 793, Book 8, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the companions of the Prophet determine the night of Laylat al-Qadr?","id":"tirmidhi-8-364"},{"hadith-eng":"\"My father narrated to me: 'The Night of Al-Qadr was mentioned in the presence of Abu Bakrah, so he said: \"I do not search for it due to something that I heard from the Messenger of Allah, except for during the last ten (nights); for indeed I heard him say: 'Search for it when nine remain, or; when seven remain, or; when five remain, or; during the last three nights.'\" He (Uyainah) said: \"During the twenty (nights) of Ramadan, Abu Bakrah used to perform Salat just as he performed Salat during the rest of the year. But when the (last) ten began, he would struggle (performing more Salat during the night).\"","reference":"Jami` at-Tirmidhi 794, Book 8, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the specific nights mentioned for seeking the Night of Al-Qadr?","id":"tirmidhi-8-365"},{"hadith-eng":"\"The Prophet would awaken his family during the last ten (nights) of Ramadan.\"","reference":"Jami` at-Tirmidhi 795, Book 8, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the last ten nights of Ramadan in Islamic tradition?","id":"tirmidhi-8-366"},{"hadith-eng":"\"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"","reference":"Jami` at-Tirmidhi 796, Book 8, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why might the last ten nights of Ramadan be considered a special time for increased devotion?","id":"tirmidhi-8-367"},{"hadith-eng":"The Prophet said: \"Fasting during the winter is an easy reward.\"","reference":"Jami` at-Tirmidhi 797, Book 8, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the concept of reward relate to fasting in different seasons?","id":"tirmidhi-8-368"},{"hadith-eng":"\"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"","reference":"Jami` at-Tirmidhi 798, Book 8, Hadith 117","grade":"Sahih(Darussalam)","question #":"question #3","question":"What options were available for those who found fasting difficult before the abrogation?","id":"tirmidhi-8-369"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan and he was about to travel. His mount was prepared for him, and he put on his traveling clothes, then he called for some food to eat, and I said to him: 'Is it Sunnah?' He said: 'It is Sunnah.' Then he rode.\"","reference":"Jami` at-Tirmidhi 799, Book 8, Hadith 118","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of eating before traveling during Ramadan according to Islamic tradition?","id":"tirmidhi-8-370"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan\" and he mentioned a similar narration (as no. 799).","reference":"Jami` at-Tirmidhi 800, Book 8, Hadith 119","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does sharing and discussing religious knowledge play during the month of Ramadan?","id":"tirmidhi-8-371"},{"hadith-eng":"The Messenger of Allah said: \"The gift for the fasting person is (fragrant) oil and a censer.\"","reference":"Jami` at-Tirmidhi 801, Book 8, Hadith 120","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the cultural or religious significance of giving gifts to those who are fasting?","id":"tirmidhi-8-372"},{"hadith-eng":"The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"","reference":"Jami` at-Tirmidhi 802, Book 8, Hadith 121","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of communal consensus in determining Islamic festivals?","id":"tirmidhi-8-373"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (nights) of Ramadan. One year he did not perform I'tikaf, so he performed I'tikaf for twenty (nights) in the following year.\"","reference":"Jami` at-Tirmidhi 803, Book 8, Hadith 122","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's dedication to I'tikaf even after missing it?","id":"tirmidhi-8-374"},{"hadith-eng":"\"When the Messenger of Allah performed I'tikaf, he would bring his head near me so I could comb it, and he would not enter the house except for some personal needs.\"","reference":"Jami` at-Tirmidhi 804, Book 8, Hadith 123","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the interaction between the Prophet Muhammad (ﷺ) and Aishah during I'tikaf indicate about their relationship?","id":"tirmidhi-8-375"},{"hadith-eng":"\"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"","reference":"Jami` at-Tirmidhi 806, Book 8, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the meaning of 'Falah' in the context of night prayers during Ramadan?","id":"tirmidhi-8-376"},{"hadith-eng":"The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"","reference":"Jami` at-Tirmidhi 807, Book 8, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration imply about the concept of reward in Islam?","id":"tirmidhi-8-377"},{"hadith-eng":"\"The Messenger of Allah would encourage the  night prayer in Ramadan without firmly ordering it, and he would say: \"Whoever stands (in the night prayer) for Ramadan with faith and seeking the reward (from Allah), then he will be forgiven what has preceded of his sins.' So the Messenger of Allah died and the matter was like that. Then the matter was the same during the Khilafah of Abu Bakr and it continued during a portion of the Khilafah of Umar bin Al-Khattab.\"","reference":"Jami` at-Tirmidhi 808, Book 8, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of faith and seeking reward from Allah in the context of night prayer during Ramadan?","id":"tirmidhi-8-378"},{"hadith-eng":"the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"","reference":"Jami` at-Tirmidhi 682, Book 8, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #4","question":"What encouragement is given to those seeking good during Ramadan?","id":"tirmidhi-8-379"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"","reference":"Jami` at-Tirmidhi 683, Book 8, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does faith and seeking reward from Allah influence the acceptance of worship?","id":"tirmidhi-8-380"},{"hadith-eng":"the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"","reference":"Jami` at-Tirmidhi 684, Book 8, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to adhere to the sighting of the moon for starting and ending the fast?","id":"tirmidhi-8-381"},{"hadith-eng":"the Messenger of Allah said: \"Do no precede the month of Ramadan by fasting a day or two before it, unless it is the case of a man who normally performs some fast, then let him fast it.\"","reference":"Jami` at-Tirmidhi 685, Book 8, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might it be discouraged to fast just before Ramadan starts?","id":"tirmidhi-8-382"},{"hadith-eng":"\"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"","reference":"Jami` at-Tirmidhi 686, Book 8, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to follow the guidance of the Prophet Muhammad (pbuh) regarding fasting?","id":"tirmidhi-8-383"},{"hadith-eng":"the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"","reference":"Jami` at-Tirmidhi 687, Book 8, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role does moon sighting play in the Islamic calendar?","id":"tirmidhi-8-384"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast before Ramadan. Fast with its sighting, and break fast with its sighting, and if it is obscured from you, then complete thirty days.\"","reference":"Jami` at-Tirmidhi 688, Book 8, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the completion of thirty days relate to the lunar calendar in Islamic practice?","id":"tirmidhi-8-385"},{"hadith-eng":"\"What I fasted with the Prophet that was twenty-nine (days), was more than what we fasted that was thirty.\"\n(He said): There are narrations on this topic from `Umar, Abu Hurairah, `A'isha, Sa`d bin Abi Waqqas, Ibn `Abbas, Ibn `Umar, Anas, Jabir, Umm Salamah, Abu Bakrah, that the Prophet (ﷺ) said: \"The month is twenty nine (days).\"","reference":"Jami` at-Tirmidhi 689, Book 8, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do different narrations contribute to the understanding of the length of an Islamic month?","id":"tirmidhi-8-386"},{"hadith-eng":"\"The Messenger of Allah vowed to stay away from his wives for a month, so he stayed in a loft for twenty-nine days. They said: 'O Messenger of Allah, your vow was for a month,' so he said: 'The month is twenty-nine (days).'\"","reference":"Jami` at-Tirmidhi 690, Book 8, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet's action reflect his adherence to vows and promises?","id":"tirmidhi-8-387"},{"hadith-eng":"\"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"","reference":"Jami` at-Tirmidhi 691, Book 8, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the role of a witness in confirming the sighting of the crescent moon for Islamic observances?","id":"tirmidhi-8-388"},{"hadith-eng":"the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"","reference":"Jami` at-Tirmidhi 692, Book 8, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of deficiency relate to the lunar months in Islam?","id":"tirmidhi-8-389"},{"hadith-eng":"\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"","reference":"Jami` at-Tirmidhi 693, Book 8, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why did Ibn Abbas insist on completing thirty days of fasting despite the sighting in Ash-Sham?","id":"tirmidhi-8-390"},{"hadith-eng":"the Messenger of Allah said: \"Whoever has dried dates, then let him break the fast with that, and whoever does not, then let him break the fast with water, for indeed water is purifying.\"","reference":"Jami` at-Tirmidhi 694, Book 8, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the choice of food or drink for breaking the fast relate to purification?","id":"tirmidhi-8-391"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"","reference":"Jami` at-Tirmidhi 695, Book 8, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What significance do dates hold in the practice of breaking a fast in Islam?","id":"tirmidhi-8-392"},{"hadith-eng":"\"The Messenger of Allah would break the fast with fresh dates before performing Salat. If there were no fresh dates then (he would break the fast) with dried dates, and if there were no dried dates then he would take a few sips of water.\"","reference":"Jami` at-Tirmidhi 696, Book 8, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the importance of consuming water when breaking the fast if dates are unavailable?","id":"tirmidhi-8-393"},{"hadith-eng":"the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"","reference":"Jami` at-Tirmidhi 697, Book 8, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role does unity play in the observance of Islamic rituals such as fasting and sacrifice?","id":"tirmidhi-8-394"},{"hadith-eng":"The Messenger of Allah said: \"When the night advances and the day retreats, and the sun is hidden, then the fast is to be broken.\"","reference":"Jami` at-Tirmidhi 698, Book 8, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the conditions that must be met before breaking the fast according to Islamic teachings?","id":"tirmidhi-8-395"},{"hadith-eng":"the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\"","reference":"Jami` at-Tirmidhi 699, Book 8, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of breaking the fast on time reflect on a person's adherence to the Sunnah?","id":"tirmidhi-8-396"},{"hadith-eng":"the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"","reference":"Jami` at-Tirmidhi 700, Book 8, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #4","question":"What actions can make a worshipper more beloved to Allah?","id":"tirmidhi-8-397"},{"hadith-eng":"(A Hadith similar to no. 700 with a different chain).","reference":"Jami` at-Tirmidhi 701, Book 8, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to compare different chains of narration for the same hadith?","id":"tirmidhi-8-398"},{"hadith-eng":"\"Masruq and I entered upon Aishah and we said: 'O Mother of the Believers! There are two men from the Companions of Muhammad, one of them hastens to break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"","reference":"Jami` at-Tirmidhi 702, Book 8, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do the practices of different companions of the Prophet reflect their understanding of his teachings?","id":"tirmidhi-8-399"},{"hadith-eng":"Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 703, Book 8, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of eating Sahar reflect the Prophet's routine during Ramadan?","id":"tirmidhi-8-400"},{"hadith-eng":"The Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears to you on the horizon.\"","reference":"Jami` at-Tirmidhi 705, Book 8, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the signs that indicate the end of the permissible time for eating and drinking before fasting?","id":"tirmidhi-8-401"},{"hadith-eng":"the Messenger of Allah said: \"Do not let the Adhan of Bilal prevent you from your Sahar, nor the drawn out Fajr, but the Fajr that spreads on the horizon.\"","reference":"Jami` at-Tirmidhi 706, Book 8, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to differentiate between different types of Fajr when observing fasting?","id":"tirmidhi-8-402"},{"hadith-eng":"the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"","reference":"Jami` at-Tirmidhi 707, Book 8, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to align one's actions with the purpose of fasting in Islam?","id":"tirmidhi-8-403"},{"hadith-eng":"the Messenger of Allah said: \"Partake of Sahar, for indeed there is a blessing in the Sahar.\"","reference":"Jami` at-Tirmidhi 708, Book 8, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the spiritual benefits of eating Sahar before fasting?","id":"tirmidhi-8-404"},{"hadith-eng":"(similar to no. 708) from the Prophet.","reference":"Jami` at-Tirmidhi 709, Book 8, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are hadiths categorized and referenced in Islamic texts?","id":"tirmidhi-8-405"},{"hadith-eng":"\"The Messenger of Allah went to Makkah in the Year of the Conquest, so he fasted until he reached Kura Al-Ghamim and the people were fasting with him. Then it was said to him: 'The fast has become difficult for the people, and they are watching you to see what you will do.' So after Asr, he called for a cup of water and drank it while the people were looking at him. Some of them broke the fast while some of them continued their fasting. It was conveyed to him that people were still fasting, so he said: \"Those are the disobedient.'\"","reference":"Jami` at-Tirmidhi 710, Book 8, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the importance of flexibility in religious observance from this event?","id":"tirmidhi-8-406"},{"hadith-eng":"Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"","reference":"Jami` at-Tirmidhi 711, Book 8, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does personal choice play a role in fasting during travel in Islam?","id":"tirmidhi-8-407"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"","reference":"Jami` at-Tirmidhi 712, Book 8, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this account reflect the Prophet's approach to fasting during travel?","id":"tirmidhi-8-408"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"","reference":"Jami` at-Tirmidhi 713, Book 8, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration highlight the importance of individual capacity and strength in religious observance?","id":"tirmidhi-8-409"},{"hadith-eng":"he asked Ibn Al-Musaiyab about fasting on a journey, so he narrated to him that Umar bin Al-Khattab said: \"We fought in two battles along with the Messenger of Allah during Ramadan; the Day of Badr, and the Conquest (of Makkah), so we broke our fast during them.\"","reference":"Jami` at-Tirmidhi 714, Book 8, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #4","question":"What historical events are associated with the companions breaking their fast during Ramadan?","id":"tirmidhi-8-410"},{"hadith-eng":"\"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - or fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the breast-feeding person.' And by Allah! The Prophet said both of them or one of them. So woe to me! For I did not eat from the meal of the Prophet.\"","reference":"Jami` at-Tirmidhi 715, Book 8, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the hadith illustrate the Prophet's understanding and compassion towards different circumstances?","id":"tirmidhi-8-411"},{"hadith-eng":"\"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"","reference":"Jami` at-Tirmidhi 716, Book 8, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can family members assist in completing the religious duties of a deceased relative?","id":"tirmidhi-8-412"},{"hadith-eng":"(A Hadith similar to no. 716 with a different chain.)","reference":"Jami` at-Tirmidhi 717, Book 8, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to compare similar hadiths with different chains?","id":"tirmidhi-8-413"},{"hadith-eng":"the Prophet said: \"Whoever died while he had a month to fast, then a needy person should be fed on his behalf in place of every day.\"","reference":"Jami` at-Tirmidhi 718, Book 8, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the responsibilities of the living towards the religious obligations of the deceased?","id":"tirmidhi-8-414"},{"hadith-eng":"the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"","reference":"Jami` at-Tirmidhi 719, Book 8, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #4","question":"How is a wet dream treated in relation to fasting in Islamic law?","id":"tirmidhi-8-415"},{"hadith-eng":"the Prophet said: \"Whoever is overcome by vomiting, then he is not required to make up (the fast), and whoever vomits on purpose, then he must make it up.\"","reference":"Jami` at-Tirmidhi 720, Book 8, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of unintentional vomiting on one's fast?","id":"tirmidhi-8-416"},{"hadith-eng":"\"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision that Allah provided for him.\"","reference":"Jami` at-Tirmidhi 721, Book 8, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #4","question":"What should a person do if they accidentally eat or drink while fasting?","id":"tirmidhi-8-417"},{"hadith-eng":"the Messenger of Allah said: \"Whoever breaks the fast during Ramadan without an allowance or illness, then if he fasted for all time, his fasting would not make up for it.\"","reference":"Jami` at-Tirmidhi 723, Book 8, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the valid reasons for breaking a fast during Ramadan in Islam?","id":"tirmidhi-8-418"},{"hadith-eng":"A man came and said: \"O Messenger of Allah; I am ruined!\" He said: \"What has ruined you?\" He said: \"I had sexual relations with my wife during Ramadan.\" He said: \"Are you able to free a slave?\" He said, \"No.\" He said: \"Then are you able to fast for two consecutive months?\" He said, \"No.\" He said: \"Then are you able to feed sixty needy people?\" He said, \"No.\" He said: \"Sit.\" So he sat. A big basket full of dates was brought to the Prophet, and he said: \"Give it in charity.\" So he said: \"There is no one needier than us between its two mountains.\" So the Prophet laughing until his pre-molar teeth appeared, and he said: \"Then take it to feed your family.\"","reference":"Jami` at-Tirmidhi 724, Book 8, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the Prophet's reaction to the man's situation in this narration?","id":"tirmidhi-8-419"},{"hadith-eng":"\"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"","reference":"Jami` at-Tirmidhi 725, Book 8, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the benefits of using the Siwak as observed in Islamic tradition?","id":"tirmidhi-8-420"},{"hadith-eng":"a man came to the Prophet and said: \"My eyes are bothering me, can I use Kuhl while I am fasting?\" He said: \"Yes.\"","reference":"Jami` at-Tirmidhi 726, Book 8, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of using medicinal substances during fasting in Islam?","id":"tirmidhi-8-421"},{"hadith-eng":"\"The Prophet would kiss during the month of fasting.\"","reference":"Jami` at-Tirmidhi 727, Book 8, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic jurisprudence address intimate actions while fasting?","id":"tirmidhi-8-422"},{"hadith-eng":"\"The Messenger of Allah would fondle me while he was fasting, and he had the most control among you of his limb (li irbihi).\"","reference":"Jami` at-Tirmidhi 728, Book 8, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration reflect the personal conduct of the Prophet Muhammad (peace be upon him) in private matters?","id":"tirmidhi-8-423"},{"hadith-eng":"\"The Messenger of Allah would kiss and fondle while he was fasting, and he had the most control among you of his limbs.\"","reference":"Jami` at-Tirmidhi 729, Book 8, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet's example guide Muslims in maintaining discipline during fasting?","id":"tirmidhi-8-424"},{"hadith-eng":"the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"","reference":"Jami` at-Tirmidhi 730, Book 8, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is the intention to fast considered an essential part of the fasting process?","id":"tirmidhi-8-425"},{"hadith-eng":"\"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"","reference":"Jami` at-Tirmidhi 731, Book 8, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islam view the concept of sin and forgiveness in the context of fasting?","id":"tirmidhi-8-426"},{"hadith-eng":"\"A person from the offspring of Umm Hani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, and Umm Hani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this from Umm Hani?' He said: 'No Abu Salih and our family informed us of it from Umm Hani.'\"","reference":"Jami` at-Tirmidhi 732, Book 8, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the narration illustrate the flexibility of voluntary acts of worship in Islam?","id":"tirmidhi-8-427"},{"hadith-eng":"\"The Messenger of Allah visited me one day and said: 'Do you have anything (to eat)?'\" She said: \"I said: 'No.' He said: 'Then I am fasting.'\"","reference":"Jami` at-Tirmidhi 733, Book 8, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the interaction between the Prophet (ﷺ) and Aishah reflect on their household practices?","id":"tirmidhi-8-428"},{"hadith-eng":"\"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"","reference":"Jami` at-Tirmidhi 734, Book 8, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the interaction between the Prophet and Aishah illustrate the practice of fasting?","id":"tirmidhi-8-429"},{"hadith-eng":"\"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"","reference":"Jami` at-Tirmidhi 735, Book 8, Hadith 54","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does this narration illustrate the relationship between the Prophet and his family members?","id":"tirmidhi-8-430"},{"hadith-eng":"\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"","reference":"Jami` at-Tirmidhi 736, Book 8, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the Prophet have chosen to fast consecutively during Sha'ban and Ramadan?","id":"tirmidhi-8-431"},{"hadith-eng":"from the Prophet.","reference":"Jami` at-Tirmidhi 737, Book 8, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to have multiple chains of narration for a single hadith?","id":"tirmidhi-8-432"},{"hadith-eng":"the Messenger of Allah said: \"When a half of Sha'ban remains then do not fast.\"","reference":"Jami` at-Tirmidhi 738, Book 8, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the exceptions, if any, to the rule of not fasting in the second half of Sha'ban?","id":"tirmidhi-8-433"},{"hadith-eng":"\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"","reference":"Jami` at-Tirmidhi 739, Book 8, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the importance of Al-Baqi in Islamic history?","id":"tirmidhi-8-434"},{"hadith-eng":"the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"","reference":"Jami` at-Tirmidhi 740, Book 8, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the benefits of fasting during the month of Al-Muharram?","id":"tirmidhi-8-435"},{"hadith-eng":"\"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"","reference":"Jami` at-Tirmidhi 741, Book 8, Hadith 60","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the importance of repentance in the month of Al-Muharram?","id":"tirmidhi-8-436"},{"hadith-eng":"\"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"","reference":"Jami` at-Tirmidhi 742, Book 8, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's (ﷺ) fasting habits from this narration?","id":"tirmidhi-8-437"},{"hadith-eng":"the Messenger of Allah said: \"None of you should fast on Friday unless he fasts before it, or he fasts after it.\"","reference":"Jami` at-Tirmidhi 743, Book 8, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does fasting on consecutive days relate to Islamic practices?","id":"tirmidhi-8-438"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"","reference":"Jami` at-Tirmidhi 744, Book 8, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does this teaching reflect the importance of adhering to specific days for fasting in Islam?","id":"tirmidhi-8-439"},{"hadith-eng":"\"The Prophet used to try to fast on Mondays and Thursdays.\"","reference":"Jami` at-Tirmidhi 745, Book 8, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the benefits of fasting on Mondays and Thursdays according to Islamic tradition?","id":"tirmidhi-8-440"},{"hadith-eng":"\"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"","reference":"Jami` at-Tirmidhi 746, Book 8, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the fasting routine of the Prophet Muhammad (ﷺ) reflect on the importance of voluntary fasting?","id":"tirmidhi-8-441"},{"hadith-eng":"the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"","reference":"Jami` at-Tirmidhi 747, Book 8, Hadith 66","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does fasting relate to the presentation of deeds in Islamic belief?","id":"tirmidhi-8-442"},{"hadith-eng":"\"I asked - or; the Prophet was asked - about fasting daily. So he said: 'Your family has a right over you.' Then he said: 'Fast Ramadan and that which is after it, and every Wednesday and Thursday. If you do that, then you will have fasted daily, as well as broken (the fast).'\"","reference":"Jami` at-Tirmidhi 748, Book 8, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to consider the rights of one's family when planning religious observances?","id":"tirmidhi-8-443"},{"hadith-eng":"the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"","reference":"Jami` at-Tirmidhi 749, Book 8, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the Day of Arafah relate to the Islamic calendar and its observances?","id":"tirmidhi-8-444"},{"hadith-eng":"\"The Prophet broke (the fast) of Arafah, Umm Fadl sent him some milk to drink.\"","reference":"Jami` at-Tirmidhi 750, Book 8, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role did Umm Fadl play in the event of the Prophet breaking his fast on Arafah?","id":"tirmidhi-8-445"},{"hadith-eng":"\"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"","reference":"Jami` at-Tirmidhi 751, Book 8, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the stance of Ibn Umar regarding fasting on the Day of Arafah?","id":"tirmidhi-8-446"},{"hadith-eng":"the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"","reference":"Jami` at-Tirmidhi 752, Book 8, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of fasting on Ashura reflect the teachings of the Prophet Muhammad (peace be upon him)?","id":"tirmidhi-8-447"},{"hadith-eng":"\"Ashura was a day that the Quraish used to fast during Jahiliyyah, and the Messenger of Allah used to fast it. But when (the fast of) Ramadan became obligatory, the Ramadan was the required and Ashura was left. So whoever wanted to, he fasted it, and whoever wanted to, he left it.\"","reference":"Jami` at-Tirmidhi 753, Book 8, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the practice of fasting on Ashura evolve with the advent of Islam?","id":"tirmidhi-8-448"},{"hadith-eng":"\"I met up with Ibn Abbas while he was reclining on his Rida at the Zamzam (well). So I said: 'Inform me about the Day of Ashura. On which day is it fasted?' He said: 'When you see the crescent of Al-Muharram, then count, then fast on the morning of the ninth day.'\" He said: 'I said: Is this how Muhammad fasted it?' He said: 'Yes.'\"","reference":"Jami` at-Tirmidhi 754, Book 8, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the historical context of fasting on the ninth day of Muharram?","id":"tirmidhi-8-449"},{"hadith-eng":"\"The Messenger of Allah ordered fasting the tenth day for the Day of Ashura.\"","reference":"Jami` at-Tirmidhi 755, Book 8, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the historical or religious events associated with the Day of Ashura?","id":"tirmidhi-8-450"},{"hadith-eng":"\"I did not see the Prophet fasting at all during the ten.\"","reference":"Jami` at-Tirmidhi 756, Book 8, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the testimony of Aishah contribute to our understanding of the Prophet's fasting practices?","id":"tirmidhi-8-451"},{"hadith-eng":"the Messenger of Allah said: \"There are no days in which righteous deeds are more beloved to Allah than those ten days.\" They said: \"O Messenger of Allah! Not even Jihad in Allah Cause?\" The Messenger of Allah said: \"Not even Jihad in Allah's Cause, unless a man were to out with his self and his wealth and not return from that with anything.\"","reference":"Jami` at-Tirmidhi 757, Book 8, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might righteous deeds during certain days be more beloved to Allah than others?","id":"tirmidhi-8-452"},{"hadith-eng":"the Prophet said: \"There are no days more beloved to Allah that He be worshipped in them than the ten days of Dhul-Hijjah, fasting every day of them is the equivalent of fasting a year, and standing every night of them (in prayer) is the equivalent of standing on the Night of Qadr.\"","reference":"Jami` at-Tirmidhi 758, Book 8, Hadith 77","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why are the ten days of Dhul-Hijjah considered more beloved to Allah for worship?","id":"tirmidhi-8-453"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan, then follows it with six from Shawwal, then that is (equal in reward) to fasting everyday.\"","reference":"Jami` at-Tirmidhi 759, Book 8, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does fasting in Shawwal contribute to a Muslim's spiritual growth?","id":"tirmidhi-8-454"},{"hadith-eng":"\"The Messenger of Allah took a covenant from me for three: To not sleep except after performing Witr, to fast three days of every month, and to perform the Duha prayer.\"","reference":"Jami` at-Tirmidhi 760, Book 8, Hadith 79","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does regular observance of specific prayers and fasting contribute to a Muslim's spiritual routine?","id":"tirmidhi-8-455"},{"hadith-eng":"the Messenger of Allah said: \"O Abu Dharr! When you fast three days out of a month, then fast the thirteenth, fourteenth, and fifteenth.\"","reference":"Jami` at-Tirmidhi 761, Book 8, Hadith 80","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of fasting three days a month in Islam?","id":"tirmidhi-8-456"},{"hadith-eng":"\"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"","reference":"Jami` at-Tirmidhi 762, Book 8, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #4","question":"How is the concept of multiplying rewards for good deeds reflected in Islamic practice?","id":"tirmidhi-8-457"},{"hadith-eng":"\"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"","reference":"Jami` at-Tirmidhi 763, Book 8, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of fasting three days a month in Islamic tradition?","id":"tirmidhi-8-458"},{"hadith-eng":"The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 764, Book 8, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #4","question":"How should a fasting person respond to abuse or ignorance from others?","id":"tirmidhi-8-459"},{"hadith-eng":"The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"","reference":"Jami` at-Tirmidhi 765, Book 8, Hadith 84","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does entering through the gate of Ar-Raiyyan signify for those who fast?","id":"tirmidhi-8-460"},{"hadith-eng":"The Messenger of Allah said: \"There are two joys for the fasting person: the joy when he breaks his fast, and the joy of when he meets his Lord.\"","reference":"Jami` at-Tirmidhi 766, Book 8, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does fasting relate to spiritual joy and fulfillment?","id":"tirmidhi-8-461"},{"hadith-eng":"\"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"","reference":"Jami` at-Tirmidhi 767, Book 8, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of balance apply to religious practices like fasting in Islam?","id":"tirmidhi-8-462"},{"hadith-eng":"\"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"","reference":"Jami` at-Tirmidhi 768, Book 8, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be inferred about the Prophet's approach to fasting outside of Ramadan?","id":"tirmidhi-8-463"},{"hadith-eng":"Anas bin Malik was asked about the Prophet's fasting and he said: \"He would fast during a month until we thought that he did not want to abstain from fasting during any of it. And, he would not fast during a month until we thought that he did not want to fast during any of it. (There was no time) that I wanted to see if he was performing Salat during the night, except that I would see him praying, nor to see him sleeping, except that I would see him sleeping.\"","reference":"Jami` at-Tirmidhi 769, Book 8, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does Anas bin Malik's account reveal about the Prophet's (ﷺ) sleeping habits?","id":"tirmidhi-8-464"},{"hadith-eng":"The Messenger of Allah said: \"The most virtuous fast is the fast of my brother Dawud. He would fast a day, and not fast (the next) day. He would not flee at the time of engagement (with the enemy).\"","reference":"Jami` at-Tirmidhi 770, Book 8, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is courage and steadfastness portrayed in the actions of Prophet Dawud during times of conflict?","id":"tirmidhi-8-465"},{"hadith-eng":"\"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"","reference":"Jami` at-Tirmidhi 771, Book 8, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #4","question":"What should Muslims do with the flesh of the sacrifice on the Day of Adha?","id":"tirmidhi-8-466"},{"hadith-eng":"\"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"","reference":"Jami` at-Tirmidhi 772, Book 8, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might fasting be prohibited on certain Islamic holidays?","id":"tirmidhi-8-467"},{"hadith-eng":"The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"","reference":"Jami` at-Tirmidhi 773, Book 8, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the importance of the Day of Nahr in Islamic tradition?","id":"tirmidhi-8-468"},{"hadith-eng":"The Prophet said: \"The cupper and the one cupped have broke the fast.\"","reference":"Jami` at-Tirmidhi 774, Book 8, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions are considered to break the fast according to Islamic teachings?","id":"tirmidhi-8-469"},{"hadith-eng":"\"the Messenger of Allah was cupped while he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 775, Book 8, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration inform the understanding of permissible actions during fasting?","id":"tirmidhi-8-470"},{"hadith-eng":"\"The Prophet was cupped while he was fasting.\"","reference":"Jami` at-Tirmidhi 776, Book 8, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (ﷺ) manage his health while observing fasts?","id":"tirmidhi-8-471"},{"hadith-eng":"\"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 777, Book 8, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of performing cupping while in a state of Ihram?","id":"tirmidhi-8-472"},{"hadith-eng":"the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"","reference":"Jami` at-Tirmidhi 778, Book 8, Hadith 97","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the companions have been curious about performing Wisal like the Prophet?","id":"tirmidhi-8-473"},{"hadith-eng":"\"Aishah and Umm Salamah, the wives of the Prophet informed me that the Prophet would find that it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"","reference":"Jami` at-Tirmidhi 779, Book 8, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's routine in relation to fasting and purification?","id":"tirmidhi-8-474"},{"hadith-eng":"The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.","reference":"Jami` at-Tirmidhi 780, Book 8, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions are recommended for someone who is fasting when invited to a meal?","id":"tirmidhi-8-475"},{"hadith-eng":"The Prophet said: \"A woman may not fast a day - other than in the month of Ramadan - while her husband is present, except with his permission.\"","reference":"Jami` at-Tirmidhi 782, Book 8, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might a husband's consent be required for a woman to engage in non-obligatory fasting?","id":"tirmidhi-8-476"},{"hadith-eng":"\"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"","reference":"Jami` at-Tirmidhi 783, Book 8, Hadith 102","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does this narration suggest about the time frame for making up missed fasts?","id":"tirmidhi-8-477"},{"hadith-eng":"The Prophet said: \"When those who are not fasting eat in the presence of the fasting person, the angels send Salat upon him.\"","reference":"Jami` at-Tirmidhi 784, Book 8, Hadith 103","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of patience and self-restraint in fasting when surrounded by those who are not fasting?","id":"tirmidhi-8-478"},{"hadith-eng":"\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother] Umm Amarah bint Ka'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\"","reference":"Jami` at-Tirmidhi 785, Book 8, Hadith 104","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does this narration imply about the spiritual benefits of fasting?","id":"tirmidhi-8-479"},{"hadith-eng":"From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\"","reference":"Jami` at-Tirmidhi 786, Book 8, Hadith 105","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the omission of certain phrases impact the interpretation of a hadith?","id":"tirmidhi-8-480"},{"hadith-eng":"\"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"","reference":"Jami` at-Tirmidhi 787, Book 8, Hadith 106","grade":"Hasan(Darussalam)","question #":"question #4","question":"What instructions were given to women regarding fasting and prayer during the time of the Prophet Muhammad?","id":"tirmidhi-8-481"},{"hadith-eng":"From his father who said: \"I said. 'O Messenger of Allah! Inform me about Wudu.' So he said: \"Perform Wudu well, and go between the fingers, and perform Istinshaq extensively except when fasting.\"","reference":"Jami` at-Tirmidhi 788, Book 8, Hadith 107","grade":"Sahih(Darussalam)","question #":"question #4","question":"How should one modify the practice of Istinshaq when fasting?","id":"tirmidhi-8-482"},{"hadith-eng":"The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"","reference":"Jami` at-Tirmidhi 789, Book 8, Hadith 108","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of fasting without the consent of those you are staying with?","id":"tirmidhi-8-483"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (days) of Ramadan until Allah took him.\"","reference":"Jami` at-Tirmidhi 790, Book 8, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is the last ten days of Ramadan considered important in Islamic tradition?","id":"tirmidhi-8-484"},{"hadith-eng":"\"When the Messenger of Allah wanted to perform I'tikaf, he would perform Fajr prayer and then he would enter his place of I'tikaf.\"","reference":"Jami` at-Tirmidhi 791, Book 8, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the practices associated with entering a place of I'tikaf?","id":"tirmidhi-8-485"},{"hadith-eng":"\"The Messenger of Allah would Yujawir (stay in I'tikaf) during the last ten (nights) of Ramadan and he said: 'Seek the Night of Al-Qadr during the last ten (nights) of Ramadan.'\"","reference":"Jami` at-Tirmidhi 792, Book 8, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #4","question":"What practices are recommended during the last ten nights of Ramadan?","id":"tirmidhi-8-486"},{"hadith-eng":"\"I said to Ubayy bin Ka'b: 'O Abu Al-Mundhir! How do you know that it is the night of the twenty-seventh?' He said: 'Rather, the Messenger of Allah informed us that it is a night (after which) the sun rises without rays, so we counted and we remembered it. By Allah! Ibn Mas'ud learned that it is in Ramadan and that it is the nigh of the twenty-seventh, but he did not want to inform you lest you would depend on it.\"","reference":"Jami` at-Tirmidhi 793, Book 8, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the sun rising without rays in identifying Laylat al-Qadr?","id":"tirmidhi-8-487"},{"hadith-eng":"\"My father narrated to me: 'The Night of Al-Qadr was mentioned in the presence of Abu Bakrah, so he said: \"I do not search for it due to something that I heard from the Messenger of Allah, except for during the last ten (nights); for indeed I heard him say: 'Search for it when nine remain, or; when seven remain, or; when five remain, or; during the last three nights.'\" He (Uyainah) said: \"During the twenty (nights) of Ramadan, Abu Bakrah used to perform Salat just as he performed Salat during the rest of the year. But when the (last) ten began, he would struggle (performing more Salat during the night).\"","reference":"Jami` at-Tirmidhi 794, Book 8, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might someone choose not to search for the Night of Al-Qadr outside the last ten nights of Ramadan?","id":"tirmidhi-8-488"},{"hadith-eng":"\"The Prophet would awaken his family during the last ten (nights) of Ramadan.\"","reference":"Jami` at-Tirmidhi 795, Book 8, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can families incorporate the practices of the last ten nights of Ramadan into their own lives?","id":"tirmidhi-8-489"},{"hadith-eng":"\"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"","reference":"Jami` at-Tirmidhi 796, Book 8, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #4","question":"What practices are encouraged for Muslims during the last ten nights of Ramadan?","id":"tirmidhi-8-490"},{"hadith-eng":"The Prophet said: \"Fasting during the winter is an easy reward.\"","reference":"Jami` at-Tirmidhi 797, Book 8, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #4","question":"What factors might contribute to the ease of fasting in winter?","id":"tirmidhi-8-491"},{"hadith-eng":"\"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"","reference":"Jami` at-Tirmidhi 798, Book 8, Hadith 117","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Quran address the issue of feeding the poor as an alternative to fasting?","id":"tirmidhi-8-492"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan and he was about to travel. His mount was prepared for him, and he put on his traveling clothes, then he called for some food to eat, and I said to him: 'Is it Sunnah?' He said: 'It is Sunnah.' Then he rode.\"","reference":"Jami` at-Tirmidhi 799, Book 8, Hadith 118","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does one prepare for travel in accordance with Sunnah during the month of Ramadan?","id":"tirmidhi-8-493"},{"hadith-eng":"The Messenger of Allah said: \"The gift for the fasting person is (fragrant) oil and a censer.\"","reference":"Jami` at-Tirmidhi 801, Book 8, Hadith 120","grade":"Da'if(Darussalam)","question #":"question #4","question":"In what ways can gifts enhance the experience of fasting during Ramadan?","id":"tirmidhi-8-494"},{"hadith-eng":"The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"","reference":"Jami` at-Tirmidhi 802, Book 8, Hadith 121","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the key activities associated with Eid al-Fitr and Eid al-Adha?","id":"tirmidhi-8-495"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (nights) of Ramadan. One year he did not perform I'tikaf, so he performed I'tikaf for twenty (nights) in the following year.\"","reference":"Jami` at-Tirmidhi 803, Book 8, Hadith 122","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the Prophet have chosen to perform I'tikaf for twenty nights in the following year?","id":"tirmidhi-8-496"},{"hadith-eng":"\"When the Messenger of Allah performed I'tikaf, he would bring his head near me so I could comb it, and he would not enter the house except for some personal needs.\"","reference":"Jami` at-Tirmidhi 804, Book 8, Hadith 123","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the exceptions for leaving the mosque during I'tikaf?","id":"tirmidhi-8-497"},{"hadith-eng":"\"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"","reference":"Jami` at-Tirmidhi 806, Book 8, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why did the Prophet (pbuh) call his family and women to join the night prayer?","id":"tirmidhi-8-498"},{"hadith-eng":"The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"","reference":"Jami` at-Tirmidhi 807, Book 8, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this teaching encourage communal support during Ramadan?","id":"tirmidhi-8-499"},{"hadith-eng":"\"The Messenger of Allah would encourage the  night prayer in Ramadan without firmly ordering it, and he would say: \"Whoever stands (in the night prayer) for Ramadan with faith and seeking the reward (from Allah), then he will be forgiven what has preceded of his sins.' So the Messenger of Allah died and the matter was like that. Then the matter was the same during the Khilafah of Abu Bakr and it continued during a portion of the Khilafah of Umar bin Al-Khattab.\"","reference":"Jami` at-Tirmidhi 808, Book 8, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the practice of night prayer in Ramadan evolve during the caliphates of Abu Bakr and Umar bin Al-Khattab?","id":"tirmidhi-8-500"},{"hadith-eng":"the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"","reference":"Jami` at-Tirmidhi 682, Book 8, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #5","question":"What warning is given to those seeking evil during Ramadan?","id":"tirmidhi-8-501"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"","reference":"Jami` at-Tirmidhi 683, Book 8, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #5","question":"What actions are recommended for a believer to have their past sins forgiven?","id":"tirmidhi-8-502"},{"hadith-eng":"the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"","reference":"Jami` at-Tirmidhi 684, Book 8, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"What exceptions are there for fasting a day or two before the month begins?","id":"tirmidhi-8-503"},{"hadith-eng":"\"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"","reference":"Jami` at-Tirmidhi 686, Book 8, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does the term 'Abul-Qasim' refer to in Islamic context?","id":"tirmidhi-8-504"},{"hadith-eng":"the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"","reference":"Jami` at-Tirmidhi 687, Book 8, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the lunar calendar influence Islamic practices and observances?","id":"tirmidhi-8-505"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast before Ramadan. Fast with its sighting, and break fast with its sighting, and if it is obscured from you, then complete thirty days.\"","reference":"Jami` at-Tirmidhi 688, Book 8, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of moon sighting in Islamic rituals and observances?","id":"tirmidhi-8-506"},{"hadith-eng":"\"What I fasted with the Prophet that was twenty-nine (days), was more than what we fasted that was thirty.\"\n(He said): There are narrations on this topic from `Umar, Abu Hurairah, `A'isha, Sa`d bin Abi Waqqas, Ibn `Abbas, Ibn `Umar, Anas, Jabir, Umm Salamah, Abu Bakrah, that the Prophet (ﷺ) said: \"The month is twenty nine (days).\"","reference":"Jami` at-Tirmidhi 689, Book 8, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of eyewitness accounts in establishing religious practices in Islam?","id":"tirmidhi-8-507"},{"hadith-eng":"\"The Messenger of Allah vowed to stay away from his wives for a month, so he stayed in a loft for twenty-nine days. They said: 'O Messenger of Allah, your vow was for a month,' so he said: 'The month is twenty-nine (days).'\"","reference":"Jami` at-Tirmidhi 690, Book 8, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration teach about the flexibility in the understanding of time periods in Islam?","id":"tirmidhi-8-508"},{"hadith-eng":"\"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"","reference":"Jami` at-Tirmidhi 691, Book 8, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the testimony of a Bedouin impact the decision to commence fasting in this context?","id":"tirmidhi-8-509"},{"hadith-eng":"the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"","reference":"Jami` at-Tirmidhi 692, Book 8, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of the statement regarding the completeness of Ramadan and Dhul-Hijjah?","id":"tirmidhi-8-510"},{"hadith-eng":"\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"","reference":"Jami` at-Tirmidhi 693, Book 8, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the testimony of a community play in the sighting of the crescent moon?","id":"tirmidhi-8-511"},{"hadith-eng":"the Messenger of Allah said: \"Whoever has dried dates, then let him break the fast with that, and whoever does not, then let him break the fast with water, for indeed water is purifying.\"","reference":"Jami` at-Tirmidhi 694, Book 8, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"What alternatives are suggested if dried dates are not available for breaking the fast?","id":"tirmidhi-8-512"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"","reference":"Jami` at-Tirmidhi 695, Book 8, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the choice of food for breaking a fast reflect on one's adherence to prophetic traditions?","id":"tirmidhi-8-513"},{"hadith-eng":"\"The Messenger of Allah would break the fast with fresh dates before performing Salat. If there were no fresh dates then (he would break the fast) with dried dates, and if there were no dried dates then he would take a few sips of water.\"","reference":"Jami` at-Tirmidhi 696, Book 8, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this practice indicate about the simplicity and flexibility in the Prophet's (ﷺ) approach to breaking the fast?","id":"tirmidhi-8-514"},{"hadith-eng":"the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"","reference":"Jami` at-Tirmidhi 697, Book 8, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this teaching emphasize the importance of collective religious observance in Islam?","id":"tirmidhi-8-515"},{"hadith-eng":"the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\"","reference":"Jami` at-Tirmidhi 699, Book 8, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What impact does the prompt breaking of the fast have on maintaining goodness among people?","id":"tirmidhi-8-516"},{"hadith-eng":"the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"","reference":"Jami` at-Tirmidhi 700, Book 8, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does this saying imply about the relationship between fasting and divine love?","id":"tirmidhi-8-517"},{"hadith-eng":"(A Hadith similar to no. 700 with a different chain).","reference":"Jami` at-Tirmidhi 701, Book 8, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role does Jami` at-Tirmidhi play in the collection of hadiths?","id":"tirmidhi-8-518"},{"hadith-eng":"\"Masruq and I entered upon Aishah and we said: 'O Mother of the Believers! There are two men from the Companions of Muhammad, one of them hastens to break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"","reference":"Jami` at-Tirmidhi 702, Book 8, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does Aishah play in conveying the practices of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-8-519"},{"hadith-eng":"Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"","reference":"Jami` at-Tirmidhi 703, Book 8, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of following the Prophet's example in daily routines and practices?","id":"tirmidhi-8-520"},{"hadith-eng":"The Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears to you on the horizon.\"","reference":"Jami` at-Tirmidhi 705, Book 8, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this guidance help in understanding the start of the fasting period?","id":"tirmidhi-8-521"},{"hadith-eng":"the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"","reference":"Jami` at-Tirmidhi 707, Book 8, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does Islamic teaching say about the relationship between speech and fasting?","id":"tirmidhi-8-522"},{"hadith-eng":"\"The Messenger of Allah went to Makkah in the Year of the Conquest, so he fasted until he reached Kura Al-Ghamim and the people were fasting with him. Then it was said to him: 'The fast has become difficult for the people, and they are watching you to see what you will do.' So after Asr, he called for a cup of water and drank it while the people were looking at him. Some of them broke the fast while some of them continued their fasting. It was conveyed to him that people were still fasting, so he said: \"Those are the disobedient.'\"","reference":"Jami` at-Tirmidhi 710, Book 8, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this incident highlight the concept of obedience and disobedience in following the Prophet's actions?","id":"tirmidhi-8-523"},{"hadith-eng":"Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"","reference":"Jami` at-Tirmidhi 711, Book 8, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance did the Prophet Muhammad provide about fasting for those who travel regularly?","id":"tirmidhi-8-524"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"","reference":"Jami` at-Tirmidhi 712, Book 8, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration suggest about the communal harmony among the companions during Ramadan?","id":"tirmidhi-8-525"},{"hadith-eng":"\"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"","reference":"Jami` at-Tirmidhi 713, Book 8, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the Prophet's (ﷺ) approach to differences in religious practices among his companions?","id":"tirmidhi-8-526"},{"hadith-eng":"he asked Ibn Al-Musaiyab about fasting on a journey, so he narrated to him that Umar bin Al-Khattab said: \"We fought in two battles along with the Messenger of Allah during Ramadan; the Day of Badr, and the Conquest (of Makkah), so we broke our fast during them.\"","reference":"Jami` at-Tirmidhi 714, Book 8, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the example of Umar bin Al-Khattab illustrate the practice of fasting during travel?","id":"tirmidhi-8-527"},{"hadith-eng":"\"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - or fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the breast-feeding person.' And by Allah! The Prophet said both of them or one of them. So woe to me! For I did not eat from the meal of the Prophet.\"","reference":"Jami` at-Tirmidhi 715, Book 8, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned about the importance of accepting invitations from the Prophet's actions?","id":"tirmidhi-8-528"},{"hadith-eng":"\"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"","reference":"Jami` at-Tirmidhi 716, Book 8, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the Islamic perspective on compensating for missed fasts of a deceased person?","id":"tirmidhi-8-529"},{"hadith-eng":"the Prophet said: \"Whoever died while he had a month to fast, then a needy person should be fed on his behalf in place of every day.\"","reference":"Jami` at-Tirmidhi 718, Book 8, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic teaching address the issue of unfulfilled fasting obligations after death?","id":"tirmidhi-8-530"},{"hadith-eng":"the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"","reference":"Jami` at-Tirmidhi 719, Book 8, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of this hadith on the understanding of fasting rules?","id":"tirmidhi-8-531"},{"hadith-eng":"the Prophet said: \"Whoever is overcome by vomiting, then he is not required to make up (the fast), and whoever vomits on purpose, then he must make it up.\"","reference":"Jami` at-Tirmidhi 720, Book 8, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #5","question":"What actions are required if someone deliberately vomits during a fast?","id":"tirmidhi-8-532"},{"hadith-eng":"\"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision that Allah provided for him.\"","reference":"Jami` at-Tirmidhi 721, Book 8, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching reflect Allah's mercy in the context of fasting?","id":"tirmidhi-8-533"},{"hadith-eng":"the Messenger of Allah said: \"Whoever breaks the fast during Ramadan without an allowance or illness, then if he fasted for all time, his fasting would not make up for it.\"","reference":"Jami` at-Tirmidhi 723, Book 8, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of fasting for a lifetime relate to making up for a broken fast in Ramadan?","id":"tirmidhi-8-534"},{"hadith-eng":"A man came and said: \"O Messenger of Allah; I am ruined!\" He said: \"What has ruined you?\" He said: \"I had sexual relations with my wife during Ramadan.\" He said: \"Are you able to free a slave?\" He said, \"No.\" He said: \"Then are you able to fast for two consecutive months?\" He said, \"No.\" He said: \"Then are you able to feed sixty needy people?\" He said, \"No.\" He said: \"Sit.\" So he sat. A big basket full of dates was brought to the Prophet, and he said: \"Give it in charity.\" So he said: \"There is no one needier than us between its two mountains.\" So the Prophet laughing until his pre-molar teeth appeared, and he said: \"Then take it to feed your family.\"","reference":"Jami` at-Tirmidhi 724, Book 8, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration illustrate the flexibility and compassion in Islamic law?","id":"tirmidhi-8-535"},{"hadith-eng":"\"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"","reference":"Jami` at-Tirmidhi 725, Book 8, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the use of Siwak relate to the practices of fasting in Islam?","id":"tirmidhi-8-536"},{"hadith-eng":"\"The Prophet would kiss during the month of fasting.\"","reference":"Jami` at-Tirmidhi 727, Book 8, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does the Prophet provide regarding marital relations during fasting?","id":"tirmidhi-8-537"},{"hadith-eng":"\"The Messenger of Allah would fondle me while he was fasting, and he had the most control among you of his limb (li irbihi).\"","reference":"Jami` at-Tirmidhi 728, Book 8, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What insights does this narration provide about the nature of fasting in Islam?","id":"tirmidhi-8-538"},{"hadith-eng":"the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"","reference":"Jami` at-Tirmidhi 730, Book 8, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this teaching emphasize the importance of preparation in religious observances?","id":"tirmidhi-8-539"},{"hadith-eng":"\"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"","reference":"Jami` at-Tirmidhi 731, Book 8, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #5","question":"What should a person do if they break a fast that is not obligatory?","id":"tirmidhi-8-540"},{"hadith-eng":"\"A person from the offspring of Umm Hani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, and Umm Hani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this from Umm Hani?' He said: 'No Abu Salih and our family informed us of it from Umm Hani.'\"","reference":"Jami` at-Tirmidhi 732, Book 8, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be learned about the transmission of hadiths through family and community members?","id":"tirmidhi-8-541"},{"hadith-eng":"\"The Messenger of Allah visited me one day and said: 'Do you have anything (to eat)?'\" She said: \"I said: 'No.' He said: 'Then I am fasting.'\"","reference":"Jami` at-Tirmidhi 733, Book 8, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the Prophet's (ﷺ) attitude towards unexpected situations?","id":"tirmidhi-8-542"},{"hadith-eng":"\"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"","reference":"Jami` at-Tirmidhi 734, Book 8, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the Prophet's approach to fasting from his actions in this narration?","id":"tirmidhi-8-543"},{"hadith-eng":"\"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"","reference":"Jami` at-Tirmidhi 735, Book 8, Hadith 54","grade":"Da'if(Darussalam)","question #":"question #5","question":"What lessons can be learned about self-discipline and temptation from this incident?","id":"tirmidhi-8-544"},{"hadith-eng":"\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"","reference":"Jami` at-Tirmidhi 736, Book 8, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned from the Prophet's practice of fasting in terms of spiritual preparation?","id":"tirmidhi-8-545"},{"hadith-eng":"from the Prophet.","reference":"Jami` at-Tirmidhi 737, Book 8, Hadith 56","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the criteria for a hadith to be included in Jami` at-Tirmidhi?","id":"tirmidhi-8-546"},{"hadith-eng":"the Messenger of Allah said: \"When a half of Sha'ban remains then do not fast.\"","reference":"Jami` at-Tirmidhi 738, Book 8, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do Islamic scholars interpret the guidance on fasting in the second half of Sha'ban?","id":"tirmidhi-8-547"},{"hadith-eng":"\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"","reference":"Jami` at-Tirmidhi 739, Book 8, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the hadith illustrate the concept of divine mercy and forgiveness?","id":"tirmidhi-8-548"},{"hadith-eng":"\"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"","reference":"Jami` at-Tirmidhi 741, Book 8, Hadith 60","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does fasting in Al-Muharram relate to the concept of repentance in Islam?","id":"tirmidhi-8-549"},{"hadith-eng":"\"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"","reference":"Jami` at-Tirmidhi 742, Book 8, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #5","question":"Why might the Prophet (ﷺ) have chosen to fast for three days at the start of each month?","id":"tirmidhi-8-550"},{"hadith-eng":"the Messenger of Allah said: \"None of you should fast on Friday unless he fasts before it, or he fasts after it.\"","reference":"Jami` at-Tirmidhi 743, Book 8, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the exceptions to fasting on Fridays according to Islamic tradition?","id":"tirmidhi-8-551"},{"hadith-eng":"the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"","reference":"Jami` at-Tirmidhi 744, Book 8, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the exceptions to the prohibition of fasting on Saturdays?","id":"tirmidhi-8-552"},{"hadith-eng":"\"The Prophet used to try to fast on Mondays and Thursdays.\"","reference":"Jami` at-Tirmidhi 745, Book 8, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can the practice of fasting on certain days influence a Muslim's spiritual routine?","id":"tirmidhi-8-553"},{"hadith-eng":"\"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"","reference":"Jami` at-Tirmidhi 746, Book 8, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #5","question":"What significance do specific days of the week hold in the fasting practices of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-8-554"},{"hadith-eng":"the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"","reference":"Jami` at-Tirmidhi 747, Book 8, Hadith 66","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the benefits of fasting on Mondays and Thursdays in Islam?","id":"tirmidhi-8-555"},{"hadith-eng":"\"I asked - or; the Prophet was asked - about fasting daily. So he said: 'Your family has a right over you.' Then he said: 'Fast Ramadan and that which is after it, and every Wednesday and Thursday. If you do that, then you will have fasted daily, as well as broken (the fast).'\"","reference":"Jami` at-Tirmidhi 748, Book 8, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the recommended frequency of fasting to maintain a balance between devotion and personal obligations?","id":"tirmidhi-8-556"},{"hadith-eng":"the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"","reference":"Jami` at-Tirmidhi 749, Book 8, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the anticipated reward for fasting on the Day of Arafah according to Islamic teachings?","id":"tirmidhi-8-557"},{"hadith-eng":"\"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"","reference":"Jami` at-Tirmidhi 751, Book 8, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the practice of fasting on the Day of Arafah differ between those performing Hajj and those not performing it?","id":"tirmidhi-8-558"},{"hadith-eng":"the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"","reference":"Jami` at-Tirmidhi 752, Book 8, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the historical and religious context of the Day of Ashura in Islamic tradition?","id":"tirmidhi-8-559"},{"hadith-eng":"\"Ashura was a day that the Quraish used to fast during Jahiliyyah, and the Messenger of Allah used to fast it. But when (the fast of) Ramadan became obligatory, the Ramadan was the required and Ashura was left. So whoever wanted to, he fasted it, and whoever wanted to, he left it.\"","reference":"Jami` at-Tirmidhi 753, Book 8, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #5","question":"What was the practice of the Prophet Muhammad regarding fasting on Ashura before and after Ramadan became obligatory?","id":"tirmidhi-8-560"},{"hadith-eng":"\"I met up with Ibn Abbas while he was reclining on his Rida at the Zamzam (well). So I said: 'Inform me about the Day of Ashura. On which day is it fasted?' He said: 'When you see the crescent of Al-Muharram, then count, then fast on the morning of the ninth day.'\" He said: 'I said: Is this how Muhammad fasted it?' He said: 'Yes.'\"","reference":"Jami` at-Tirmidhi 754, Book 8, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad observe the fast of Ashura?","id":"tirmidhi-8-561"},{"hadith-eng":"\"The Messenger of Allah ordered fasting the tenth day for the Day of Ashura.\"","reference":"Jami` at-Tirmidhi 755, Book 8, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #5","question":"How is the practice of fasting on Ashura observed in the Muslim community?","id":"tirmidhi-8-562"},{"hadith-eng":"the Messenger of Allah said: \"There are no days in which righteous deeds are more beloved to Allah than those ten days.\" They said: \"O Messenger of Allah! Not even Jihad in Allah Cause?\" The Messenger of Allah said: \"Not even Jihad in Allah's Cause, unless a man were to out with his self and his wealth and not return from that with anything.\"","reference":"Jami` at-Tirmidhi 757, Book 8, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #5","question":"What actions are considered righteous deeds in Islam?","id":"tirmidhi-8-563"},{"hadith-eng":"the Prophet said: \"There are no days more beloved to Allah that He be worshipped in them than the ten days of Dhul-Hijjah, fasting every day of them is the equivalent of fasting a year, and standing every night of them (in prayer) is the equivalent of standing on the Night of Qadr.\"","reference":"Jami` at-Tirmidhi 758, Book 8, Hadith 77","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the spiritual significance of the Night of Qadr in comparison to the ten days of Dhul-Hijjah?","id":"tirmidhi-8-564"},{"hadith-eng":"the Messenger of Allah said: \"Whoever fasts Ramadan, then follows it with six from Shawwal, then that is (equal in reward) to fasting everyday.\"","reference":"Jami` at-Tirmidhi 759, Book 8, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the benefits of fasting beyond the month of Ramadan according to Islamic teachings?","id":"tirmidhi-8-565"},{"hadith-eng":"\"The Messenger of Allah took a covenant from me for three: To not sleep except after performing Witr, to fast three days of every month, and to perform the Duha prayer.\"","reference":"Jami` at-Tirmidhi 760, Book 8, Hadith 79","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the benefits of adhering to a covenant or commitment in religious practice?","id":"tirmidhi-8-566"},{"hadith-eng":"\"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"","reference":"Jami` at-Tirmidhi 762, Book 8, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the relationship between fasting and the multiplication of rewards in Islam?","id":"tirmidhi-8-567"},{"hadith-eng":"\"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"","reference":"Jami` at-Tirmidhi 763, Book 8, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did Mu'adhah inquire about the Prophet's fasting habits from Aishah?","id":"tirmidhi-8-568"},{"hadith-eng":"The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"","reference":"Jami` at-Tirmidhi 764, Book 8, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the statement 'Fasting is for Me, and I shall reward for it' imply about the nature of fasting?","id":"tirmidhi-8-569"},{"hadith-eng":"The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"","reference":"Jami` at-Tirmidhi 765, Book 8, Hadith 84","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does fasting relate to the concept of never experiencing thirst again in Paradise?","id":"tirmidhi-8-570"},{"hadith-eng":"The Messenger of Allah said: \"There are two joys for the fasting person: the joy when he breaks his fast, and the joy of when he meets his Lord.\"","reference":"Jami` at-Tirmidhi 766, Book 8, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the spiritual benefits of fasting according to Islamic teachings?","id":"tirmidhi-8-571"},{"hadith-eng":"\"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"","reference":"Jami` at-Tirmidhi 767, Book 8, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #5","question":"What might be the wisdom behind not fasting every single day in Islam?","id":"tirmidhi-8-572"},{"hadith-eng":"\"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"","reference":"Jami` at-Tirmidhi 768, Book 8, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Aishah's narration reflect the flexibility in the Prophet's fasting routine?","id":"tirmidhi-8-573"},{"hadith-eng":"Anas bin Malik was asked about the Prophet's fasting and he said: \"He would fast during a month until we thought that he did not want to abstain from fasting during any of it. And, he would not fast during a month until we thought that he did not want to fast during any of it. (There was no time) that I wanted to see if he was performing Salat during the night, except that I would see him praying, nor to see him sleeping, except that I would see him sleeping.\"","reference":"Jami` at-Tirmidhi 769, Book 8, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the companions perceive the Prophet's (ﷺ) fasting and prayer routines?","id":"tirmidhi-8-574"},{"hadith-eng":"The Messenger of Allah said: \"The most virtuous fast is the fast of my brother Dawud. He would fast a day, and not fast (the next) day. He would not flee at the time of engagement (with the enemy).\"","reference":"Jami` at-Tirmidhi 770, Book 8, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned from Prophet Dawud's approach to fasting and facing challenges?","id":"tirmidhi-8-575"},{"hadith-eng":"\"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"","reference":"Jami` at-Tirmidhi 771, Book 8, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did Umar bin Al-Khattab implement the teachings of the Prophet regarding the Day of Nahr?","id":"tirmidhi-8-576"},{"hadith-eng":"\"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"","reference":"Jami` at-Tirmidhi 772, Book 8, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do Islamic teachings guide the observance of religious holidays?","id":"tirmidhi-8-577"},{"hadith-eng":"The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"","reference":"Jami` at-Tirmidhi 773, Book 8, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #5","question":"Why are the Days of Tashriq considered days of eating and drinking in Islam?","id":"tirmidhi-8-578"},{"hadith-eng":"The Prophet said: \"The cupper and the one cupped have broke the fast.\"","reference":"Jami` at-Tirmidhi 774, Book 8, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this ruling impact the practice of cupping during Ramadan?","id":"tirmidhi-8-579"},{"hadith-eng":"\"the Messenger of Allah was cupped while he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 775, Book 8, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration suggest about the flexibility of certain practices during religious observances?","id":"tirmidhi-8-580"},{"hadith-eng":"\"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"","reference":"Jami` at-Tirmidhi 777, Book 8, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the location between Makkah and Al-Madinah hold significance in Islamic history?","id":"tirmidhi-8-581"},{"hadith-eng":"the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"","reference":"Jami` at-Tirmidhi 778, Book 8, Hadith 97","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned about the limitations of human endurance in religious practices from this narration?","id":"tirmidhi-8-582"},{"hadith-eng":"\"Aishah and Umm Salamah, the wives of the Prophet informed me that the Prophet would find that it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"","reference":"Jami` at-Tirmidhi 779, Book 8, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do the practices of the Prophet's wives contribute to understanding Islamic rituals?","id":"tirmidhi-8-583"},{"hadith-eng":"The Prophet said: \"A woman may not fast a day - other than in the month of Ramadan - while her husband is present, except with his permission.\"","reference":"Jami` at-Tirmidhi 782, Book 8, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of a husband's presence on a woman's religious practices?","id":"tirmidhi-8-584"},{"hadith-eng":"\"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"","reference":"Jami` at-Tirmidhi 783, Book 8, Hadith 102","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the practice of making up missed fasts reflect on one's commitment to religious obligations?","id":"tirmidhi-8-585"},{"hadith-eng":"\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother] Umm Amarah bint Ka'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\"","reference":"Jami` at-Tirmidhi 785, Book 8, Hadith 104","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the presence of food affect the fasting person's reward according to this narration?","id":"tirmidhi-8-586"},{"hadith-eng":"\"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"","reference":"Jami` at-Tirmidhi 787, Book 8, Hadith 106","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of differentiating between fasting and prayer in terms of making up missed obligations?","id":"tirmidhi-8-587"},{"hadith-eng":"From his father who said: \"I said. 'O Messenger of Allah! Inform me about Wudu.' So he said: \"Perform Wudu well, and go between the fingers, and perform Istinshaq extensively except when fasting.\"","reference":"Jami` at-Tirmidhi 788, Book 8, Hadith 107","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the performance of Wudu?","id":"tirmidhi-8-588"},{"hadith-eng":"The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"","reference":"Jami` at-Tirmidhi 789, Book 8, Hadith 108","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this guidance reflect the importance of social etiquette in Islam?","id":"tirmidhi-8-589"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (days) of Ramadan until Allah took him.\"","reference":"Jami` at-Tirmidhi 790, Book 8, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned from the Prophet's dedication to I'tikaf during Ramadan?","id":"tirmidhi-8-590"},{"hadith-eng":"\"When the Messenger of Allah wanted to perform I'tikaf, he would perform Fajr prayer and then he would enter his place of I'tikaf.\"","reference":"Jami` at-Tirmidhi 791, Book 8, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the timing of entering I'tikaf relate to daily prayers?","id":"tirmidhi-8-591"},{"hadith-eng":"\"The Messenger of Allah would Yujawir (stay in I'tikaf) during the last ten (nights) of Ramadan and he said: 'Seek the Night of Al-Qadr during the last ten (nights) of Ramadan.'\"","reference":"Jami` at-Tirmidhi 792, Book 8, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of the Prophet Muhammad in guiding Muslims to seek the Night of Al-Qadr?","id":"tirmidhi-8-592"},{"hadith-eng":"\"I said to Ubayy bin Ka'b: 'O Abu Al-Mundhir! How do you know that it is the night of the twenty-seventh?' He said: 'Rather, the Messenger of Allah informed us that it is a night (after which) the sun rises without rays, so we counted and we remembered it. By Allah! Ibn Mas'ud learned that it is in Ramadan and that it is the nigh of the twenty-seventh, but he did not want to inform you lest you would depend on it.\"","reference":"Jami` at-Tirmidhi 793, Book 8, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does memory and counting play in identifying significant nights in Islam?","id":"tirmidhi-8-593"},{"hadith-eng":"\"My father narrated to me: 'The Night of Al-Qadr was mentioned in the presence of Abu Bakrah, so he said: \"I do not search for it due to something that I heard from the Messenger of Allah, except for during the last ten (nights); for indeed I heard him say: 'Search for it when nine remain, or; when seven remain, or; when five remain, or; during the last three nights.'\" He (Uyainah) said: \"During the twenty (nights) of Ramadan, Abu Bakrah used to perform Salat just as he performed Salat during the rest of the year. But when the (last) ten began, he would struggle (performing more Salat during the night).\"","reference":"Jami` at-Tirmidhi 794, Book 8, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #5","question":"What actions are recommended during the last ten nights of Ramadan to increase spiritual devotion?","id":"tirmidhi-8-594"},{"hadith-eng":"\"The Prophet would awaken his family during the last ten (nights) of Ramadan.\"","reference":"Jami` at-Tirmidhi 795, Book 8, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are some recommended practices for Muslims during the last ten nights of Ramadan?","id":"tirmidhi-8-595"},{"hadith-eng":"\"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"","reference":"Jami` at-Tirmidhi 796, Book 8, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can Muslims emulate the Prophet's dedication during the last ten nights of Ramadan?","id":"tirmidhi-8-596"},{"hadith-eng":"The Prophet said: \"Fasting during the winter is an easy reward.\"","reference":"Jami` at-Tirmidhi 797, Book 8, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #5","question":"How can the timing of fasting impact its perceived difficulty or ease?","id":"tirmidhi-8-597"},{"hadith-eng":"\"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"","reference":"Jami` at-Tirmidhi 798, Book 8, Hadith 117","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the revelation process in shaping Islamic practices?","id":"tirmidhi-8-598"},{"hadith-eng":"\"I went to Anas bin Malik during Ramadan and he was about to travel. His mount was prepared for him, and he put on his traveling clothes, then he called for some food to eat, and I said to him: 'Is it Sunnah?' He said: 'It is Sunnah.' Then he rode.\"","reference":"Jami` at-Tirmidhi 799, Book 8, Hadith 118","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned from Anas bin Malik's actions regarding travel and fasting?","id":"tirmidhi-8-599"},{"hadith-eng":"The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"","reference":"Jami` at-Tirmidhi 802, Book 8, Hadith 121","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do Islamic practices emphasize the importance of community in religious observances?","id":"tirmidhi-8-600"},{"hadith-eng":"\"The Prophet would perform I'tikaf during the last ten (nights) of Ramadan. One year he did not perform I'tikaf, so he performed I'tikaf for twenty (nights) in the following year.\"","reference":"Jami` at-Tirmidhi 803, Book 8, Hadith 122","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this practice of I'tikaf indicate about the Prophet's devotion during Ramadan?","id":"tirmidhi-8-601"},{"hadith-eng":"\"When the Messenger of Allah performed I'tikaf, he would bring his head near me so I could comb it, and he would not enter the house except for some personal needs.\"","reference":"Jami` at-Tirmidhi 804, Book 8, Hadith 123","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the balance between spiritual devotion and personal needs?","id":"tirmidhi-8-602"},{"hadith-eng":"\"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"","reference":"Jami` at-Tirmidhi 806, Book 8, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of Suhur in the context of Ramadan fasting and prayers?","id":"tirmidhi-8-603"},{"hadith-eng":"The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"","reference":"Jami` at-Tirmidhi 807, Book 8, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the value of generosity from this teaching?","id":"tirmidhi-8-604"},{"hadith-eng":"\"The Messenger of Allah would encourage the  night prayer in Ramadan without firmly ordering it, and he would say: \"Whoever stands (in the night prayer) for Ramadan with faith and seeking the reward (from Allah), then he will be forgiven what has preceded of his sins.' So the Messenger of Allah died and the matter was like that. Then the matter was the same during the Khilafah of Abu Bakr and it continued during a portion of the Khilafah of Umar bin Al-Khattab.\"","reference":"Jami` at-Tirmidhi 808, Book 8, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does it mean to stand in the night prayer with faith and seeking reward?","id":"tirmidhi-8-605"},{"hadith-eng":"the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"","reference":"Jami` at-Tirmidhi 682, Book 8, Hadith 1","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does Allah show mercy to people during the nights of Ramadan?","id":"tirmidhi-8-606"},{"hadith-eng":"\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"","reference":"Jami` at-Tirmidhi 693, Book 8, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does this narration illustrate the importance of following the Prophet's instructions in religious matters?","id":"tirmidhi-8-607"},{"hadith-eng":"\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"","reference":"Jami` at-Tirmidhi 739, Book 8, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #6","question":"What can be inferred about the Prophet's nightly practices from this narration?","id":"tirmidhi-8-608"}]