{"number":70,"edition":"ha.gumi","ayahs":[{"number":1,"text":"Wani mai tambaya yã yi tambaya game da azãba, mai aukuwa"},{"number":2,"text":"Ga kãfirai, bã ta da mai tunkuɗẽwa"},{"number":3,"text":"Daga Allah Mai matãkala"},{"number":4,"text":"Malã'iku da Ruhi (Jibrila) sunã tãkãwa zuwa gare Shi, a cikin yini wanda gwargwadonsa, shẽkara dubu hamsin ne"},{"number":5,"text":"Sabõda haka, ka yi haƙuri, haƙuri mai kyãwo"},{"number":6,"text":"Lalle ne su, sunã ganin ta mai nĩsa"},{"number":7,"text":"Kuma Mu, Muna ganin ta a kusa"},{"number":8,"text":"Rãnar da sama zã ta kasance kamar narkakkar azurfa"},{"number":9,"text":"Kuma duwãtsu su zama kamar saɓin sũfi"},{"number":10,"text":"Kuma abõki bã ya tambayar inda wani abõki yake"},{"number":11,"text":"Ana sanya su, su gajũna, mai laifi na gũrin dã zai iya yin fansa, daga azãbar rãnar nan, da ɗiyansa"},{"number":12,"text":"Da matarsa da ɗan'uwansa"},{"number":13,"text":"Da danginsa, mãsu tattarã shi"},{"number":14,"text":"Da wanda ke a cikin dũniya duka gabã ɗaya, sa'an nan fansar, ta tsĩrar da shi"},{"number":15,"text":"A'aha! Lalle ne fa, ita ce Lazã"},{"number":16,"text":"Mai twãle fãtar goshi"},{"number":17,"text":"Tanã kiran wanda ya jũya bãya (daga addini) kuma ya kau da kai"},{"number":18,"text":"Ya tãra (dũkiya), kuma ya sanya ta a cikin jaka"},{"number":19,"text":"Lalle ne mutum an halitta shi mai ciwon kwaɗayi"},{"number":20,"text":"Idan sharri ya shãfe shi, ya kãsa haƙuri"},{"number":21,"text":"Kuma idan alhẽri ya shãfe shi, ya yi rõwa"},{"number":22,"text":"Sai mãsu yin salla"},{"number":23,"text":"Waɗanda suke, a kan sallarsu, su, mãsu dawwama ne"},{"number":24,"text":"Kuma waɗanda a cikin dũkiyarsu, akwai wani haƙƙi sananne"},{"number":25,"text":"Ga (matalauci) mai rõƙo da wanda aka hanã wa roƙon"},{"number":26,"text":"Da waɗannan da ke gaskata rãnar sakamako"},{"number":27,"text":"Da waɗannan sabõda azãbar Ubangijinsu, suna jin tsõro"},{"number":28,"text":"Lalle ne, azãbar Ubangijinsu bã wadda ake iya amincẽwaba ce"},{"number":29,"text":"Da waɗanda suke, ga farjojinsu, mãsu tsarewa ne"},{"number":30,"text":"Sai fa a kan matan aurensu da abin da hannayensu na dãma suka mallaka. To lalle ne sũkam ba waɗanda ake zargi ba ne"},{"number":31,"text":"To, duk wanda ya nẽmi abin da yake a bayan wannan, to, waɗancan sũ ne mãsu ƙetare iyãka"},{"number":32,"text":"Kuma da waɗannan da suke ga amãnõninsu da alkawarinsu mãsu tsarẽwa ne"},{"number":33,"text":"Kuma da waɗanda suke, ga shaidarsu, mãsu dãgẽwa ne"},{"number":34,"text":"Kuma waɗanda suke, a kan sallarsu, mãsu tsarẽwa ne"},{"number":35,"text":"Waɗannan, a cikin gidãjen Aljanna, waɗanda ake girmamãwa ne"},{"number":36,"text":"Mẽ yã sãmi waɗanda suka kãfirta, a wajenka, sunã gaugãwar (gudu)"},{"number":37,"text":"Daga jihar dãma, kuma daga jihar hagu, jama'a-jama'a"},{"number":38,"text":"Shin kõwane mutum daga cikinsu yana nẽman a shigar da shi a Aljannar ni'ima ne (ba da wani aiki ba)"},{"number":39,"text":"A'aha! Lalle Mũ, Mun halitta su, daga abin da suka sani"},{"number":40,"text":"Sabõda haka ba sai Na yi rantsuwa da Ubangijin wurãren ɓullõwar rãna da wurãren fãɗuwarta ba, lalle Mũ, Mãsu iyãwa ne"},{"number":41,"text":"Ga Mu musanya waɗanda suke mafi alhẽri, daga gare su. Kuma ba Mu kasance waɗanda ake rinjãya ba"},{"number":42,"text":"Sabõda haka ka bar su, su dulmuya, kuma su yi wãsã, har su haɗu da rãnarsu wadda ake yi musu alkawari (da ita)"},{"number":43,"text":"Rãnar da suke fitowa daga kaburbura da gaugãwa, kamar sũ, zuwa ga wata kafaffiyar (tuta), suke yin gaugãwa"},{"number":44,"text":"Maƙaskanta ga idanunsu, wani walakanci yana rufe su. wannan shi ne yinin da suka kasance ana yi musa alkawari (a kansa)"}]}