{"number":54,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Die Stunde nahte sich und der Mond spaltete sich"},{"number":2,"text":"Und wenn sie eine Aya sehen, wenden sie sich ab und sagen: \"Dies ist eine andauernde Magie"},{"number":3,"text":"Und sie leugneten ab und folgten ihren Neigungen. Und jede Angelegenheit hat einen Endpunkt"},{"number":4,"text":"Und gewiß, bereits kamen zu ihnen von den Mitteilungen, worin es Warnung gab"},{"number":5,"text":"Es ist eine (sie) erreichende Weisheit. Und was nützen denn die Warnungen"},{"number":6,"text":"So kehre dich von ihnen ab! An dem Tag, wenn der Rufende zu etwas Mißbilligtem ruft"},{"number":7,"text":"erniedrigt sind ihre Blicke, sie kommen aus den Gräbern heraus, als wären sie ausschwärmende Heuschrecken"},{"number":8,"text":"eilend zum Rufenden. Die Kafir sagen: \"Dies ist ein ziemlich schwerer Tag"},{"number":9,"text":"Vor ihnen leugneten die Leute von Nuh ab, so bezichtigten sie Unseren Diener der Lüge und sagten: \"Er ist geistesgestört und wurde besessen"},{"number":10,"text":"Dann richtete er Bittgebete an seinen HERRN: \"Ich bin unterlegen, so stehe bei"},{"number":11,"text":"Dann öffneten WIR dir Tore des Himmels mit geschütteten Wassermassen"},{"number":12,"text":"und WIR ließen aus der Erde Quellen entspringen, dann traf sich das Wasser für eine Angelegenheit, die bereits bestimmt wurde"},{"number":13,"text":"und WIR ließen ihn auf etwas von Planken und Nägeln tragen"},{"number":14,"text":"Es fuhr unter Unserer Aufsicht als Vergeltung für denjenigen, der Kufr zu betreiben pflegte"},{"number":15,"text":"Und gewiß, bereits ließen WIR es als eine Aya! Gibt es etwa einen sich Erinnernden"},{"number":16,"text":"Also wie waren Meine Peinigung und Meine Ermahnungen"},{"number":17,"text":"Und gewiß, bereits erleichterten WIR den Quran zur Ermahnung. Gibt es etwa einen sich Erinnernden"},{"number":18,"text":"Abgeleugnet hat 'Aad. Also wie waren Meine Peinigung und Meine Ermahnungen"},{"number":19,"text":"Gewiß, WIR schickten über sie einen Wirbelsturm an einem unheilvollen, andauernden Tag"},{"number":20,"text":"er zog die Menschen heraus, als wären sie Stümpfe entwurzelter Dattelpalmen"},{"number":21,"text":"Also wie waren Meine Peinigung und Meine Ermahnungen"},{"number":22,"text":"Und gewiß, bereits erleichterten WIR den Quran zur Ermahnung! Gibt es etwa einen sich Erinnernden"},{"number":23,"text":"Abgeleugnet hat Thamud die Warnungen"},{"number":24,"text":"Dann sagten sie: \"Etwa einem einzigen Menschen von uns folgen wir? Gewiß, wir sind dann doch im Irregehen und in Peinigung"},{"number":25,"text":"Wurde ihm etwa von unter uns die Ermahnung zuteil? Nein, sondern er ist ein prahlerischer Lügner"},{"number":26,"text":"Sie werden noch morgen wissen, wer der prahlerische Lügner ist"},{"number":27,"text":"Gewiß, WIR werden das Kamelweibchen als Fitna für sie entsenden, also warte auf sie und übe dich noch mehr in Geduld"},{"number":28,"text":"Und teile ihnen mit, daß das Wasser zwischen ihnen geteilt wird! Jeder Trinkanteil ist nur für die Anwesenden"},{"number":29,"text":"Dann riefen sie ihren Weggenossen, dann nahm er (das Schwert), dann verletzte er ihre Beine"},{"number":30,"text":"Also wie waren Meine Peinigung und Meine Ermahnungen"},{"number":31,"text":"Gewiß, WIR schickten über sie einen einzigen Schrei, dann waren sie wie die Stoppeln für den Stallinhaber"},{"number":32,"text":"Und gewiß, bereits erleichterten WIR den Quran zur Ermahnung! Gibt es etwa einen sich Erinnernden"},{"number":33,"text":"Abgeleugnet haben die Leute von Lut die Warnungen"},{"number":34,"text":"Gewiß, WIR schickten über sie einen Sandsturm außer der Familie von Lut, diese erretteten WIR vor der Morgendämmerung"},{"number":35,"text":"als Wohltat von Uns. Solcherart vergelten WIR demjenigen, der sich dankbar erweist"},{"number":36,"text":"Und gewiß, bereits warnten WIR sie vor Unserer Gewalttat, dann zweifelten sie die Warnungen an"},{"number":37,"text":"Und gewiß, bereits suchten sie ihn gegen seine Neigung und seine Gäste zu verführen, dann löschten WIR ihr Augenlicht aus. Also erfahrt Meine Peinigung und Meine Warnungen"},{"number":38,"text":"Und gewiß, bereits morgens, in der Morgenfrühe kam zu ihnen eine (über sie) niedergelassene Peinigung"},{"number":39,"text":"Also erfahrt Meine Peinigung und Meine Warnungen"},{"number":40,"text":"Und gewiß, bereits erleichterten WIR den Quran zur Ermahnung! Gibt es etwa einen sich Erinnernden"},{"number":41,"text":"Und gewiß, bereits kamen zu Pharaos Leuten die Warnungen"},{"number":42,"text":"Sie leugneten Unsere Ayat allesamt ab, dann bestraften WIR sie das Bestrafen Eines allmächtigen Allwürdigen"},{"number":43,"text":"Sind etwa eure Kafir besser als diese?! Oder gibt es für euch etwa eine Unschuldserklärung in den Schriften"},{"number":44,"text":"Oder sagen sie etwa: \"Wir sind alle zusammen Siegende"},{"number":45,"text":"Die Sammlung wird doch noch eine Niederlage erleiden und den Rücken flüchtend umkehren"},{"number":46,"text":"Nein, sondern die Stunde ist ihr Termin. Und die Stunde ist noch schlimmer, noch bitterer"},{"number":47,"text":"Gewiß, die schwer Verfehlenden sind im Irregehen und in Hitzeglut"},{"number":48,"text":"an dem Tag, wenn sie im Feuer auf ihren Gesichtern geschleift werden. Kostet die Berührung von Saqar"},{"number":49,"text":"Gewiß, jedes Ding erschufen WIR gemäß einer Bestimmung"},{"number":50,"text":"Und Unsere Anweisung ist nichts anderes als eine Einzige, wie der Augenblick"},{"number":51,"text":"Und gewiß, bereits richteten WIR eure Anhänger zugrunde. Gibt es etwa einen sich Erinnernden"},{"number":52,"text":"Und alles, was sie machten, ist in den Schriften"},{"number":53,"text":"Auch jedes Kleine und Große ist niedergeschrieben"},{"number":54,"text":"Gewiß, die Muttaqi sind in Dschannat und an Flüssen"},{"number":55,"text":"an einem Sitz des Wahrhaftigen, bei Einem allmächtigen Herrscher"}]}