{"number":68,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Nuun. Bei Al-qalam und dem, was sie in Zeilen schreiben"},{"number":2,"text":"Du bist wegen der Wohltat deines HERRN kein Geistesgestörter"},{"number":3,"text":"Und gewiß, für dich ist doch eine nicht ausgehende Belohnung bestimmt"},{"number":4,"text":"Und gewiß, du verfügst doch über einen vortrefflichen Charakter"},{"number":5,"text":"Also du wirst noch Einblick haben, und sie haben Einblick"},{"number":6,"text":"darüber, wer von euch der Fitna-Geplagte ist"},{"number":7,"text":"Gewiß, dein HERR weiß besser Bescheid über denjenigen, der von Seinem Weg abirrte, und ER weiß besser Bescheid über die Rechtgeleiteten"},{"number":8,"text":"So höre nicht auf die Ableugner"},{"number":9,"text":"Sie wünschten sich, du würdest dich anbiedern, dann biedern sie sich an"},{"number":10,"text":"Und höre nicht auf jeden erniedrigten Viel-Schwörenden"},{"number":11,"text":"(der) bloßstellend, Namima verbreitend"},{"number":12,"text":"das Gute verhindernd, Aggression begehend, viel verfehlend"},{"number":13,"text":"und flegelhaft ist, auch dazu noch ein Bastard ist"},{"number":14,"text":"(Dies nur), weil er über Vermögen und Kinder verfügte"},{"number":15,"text":"Wenn ihm Unsere Ayat vorgetragen wurden, sagte er: \"Es sind Legenden der Früheren"},{"number":16,"text":"WIR werden ihn auf dem Rüssel brandmarken"},{"number":17,"text":"Gewiß, WIR prüften sie, wie WIR die Besitzer der Dschanna prüften, als sie schworen, sie doch am Morgen abzuernten"},{"number":18,"text":"und nichts auszulassen"},{"number":19,"text":"Dann wirbelte durch sie ein Wirbelndes von deinem HERRN, während sie schliefen"},{"number":20,"text":"dann wurde sie wie das Abgeerntete"},{"number":21,"text":"Dann riefen sie einander am Morgen (zu)"},{"number":22,"text":"Geht in der Frühe zu eurem Ackerland, solltet ihr Aberntende sein"},{"number":23,"text":"Dann gingen sie los, während sie einander zuflüsterten"},{"number":24,"text":"Auf keinen Fall betritt sie heute zu euch ein Bedürftiger"},{"number":25,"text":"Und sie gingen in der Frühe zum Fernhalten fähig"},{"number":26,"text":"Und als sie sie sahen, sagten sie: \"Gewiß, wir haben uns doch geirrt"},{"number":27,"text":"Nein, sondern wir sind Ausgeschlossene"},{"number":28,"text":"Der Mittlere von ihnen sagte: \"Sagte ich euch nicht: würdet ihr doch nur lobpreisen"},{"number":29,"text":"Sie sagten: \"Gepriesen-erhaben ist unser HERR! Gewiß, wir waren Unrecht-Begehende"},{"number":30,"text":"Dann wandten sich die einen von ihnen den anderen zu, sie machten sich gegenseitig Vorwürfe"},{"number":31,"text":"sie sagten: \"Unser Niedergang! Gewiß, wir waren Übertretende"},{"number":32,"text":"Hoffentlich tauscht uns unser HERR Besseres als sie ein. Gewiß, wir sind ALLAH gegenüber Bittende"},{"number":33,"text":"Solcherart ist die Peinigung. Und die Peinigung des Jenseits ist doch noch größer, würden sie es nur wissen"},{"number":34,"text":"Gewiß, für die Muttaqi gibt es bei ihrem HERRN die Dschannat des Wohlergehens"},{"number":35,"text":"Lassen WIR etwa die Muslime wie die schwer Verfehlenden sein"},{"number":36,"text":"Was ist mit euch, wie urteilt ihr"},{"number":37,"text":"Oder verfügt ihr über eine Schrift, in der ihr lest"},{"number":38,"text":"daß es euer ist, was ihr euch auswählt"},{"number":39,"text":"Oder schulden WIR euch bis zum Tag der Auferstehung hinreichende Gelöbnisse, daß es euer ist, was ihr urteilt"},{"number":40,"text":"Frage sie, welcher von ihnen dies behauptet"},{"number":41,"text":"Oder haben sie etwa (ALLAH) Beigesellte?! Dann sollen sie ihre (ALLAH) Beigesellten bringen, sollten sie wahrhaftig sein"},{"number":42,"text":"An dem Tag, wenn etwas Schwerwiegendes aufgedeckt wird und sie zum Sudschud aufgefordert werden, dann es nicht können"},{"number":43,"text":"ihre Blicke sind (vor Ehrfurcht) gesenkt, und Demütigung überkommt sie. Und bereits wurden sie zum Sudschud aufgefordert, als sie heil waren"},{"number":44,"text":"Also laß Mich mit denjenigen, die diese Mitteilung ableugnen, WIR werden sie anlocken, von wo sie nicht wissen"},{"number":45,"text":"Und ICH gewähre ihnen Aufschub. Gewiß, Meine Planung ist stark"},{"number":46,"text":"Oder verlangst du von ihnen Lohn, so daß sie durch ihre Verpflichtung belastet sind"},{"number":47,"text":"Oder haben sie das Verborgene bei sich, so schreiben sie"},{"number":48,"text":"Also übe dich in Geduld mit der Bestimmung deines HERRN, und sei nicht wie der Weggenosse des Fisches, als er rief, während er bedrängt war"},{"number":49,"text":"Hätte ihn eine Wohltat von seinem HERRN nicht ereilt, wäre er doch ans blanke Land geworfen, während er getadelt war"},{"number":50,"text":"Dann erwählte ihn sein HERR, dann machte ER ihn von den gottgefällig Guttuenden"},{"number":51,"text":"Und diejenigen, die Kufr betrieben haben, hätten dich beinahe mit ihren Blicken doch zu Fall gebracht, als sie die Ermahnung hörten, und sie sagen: \"Gewiß, er ist doch geistesgestört"},{"number":52,"text":"Und er (der Quran) ist nichts anderes als Ermahnung für alle Schöpfung"}]}