{"page":139,"ayahs":[{"surahNumber":6,"surahName":"سُورَةُ الأَنۡعَامِ","surahEnglishName":"Al-An'aam","ayahNumber":91,"text":"وَمَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖۤ اِذْ قَالُوْا مَاۤ اَنْزَلَ اللّٰهُ عَلٰی بَشَرٍ مِّنْ شَیْءٍ ؕ قُلْ مَنْ اَنْزَلَ الْكِتٰبَ الَّذِیْ جَآءَ بِهٖ مُوْسٰی نُوْرًا وَّهُدًی لِّلنَّاسِ تَجْعَلُوْنَهٗ قَرَاطِیْسَ تُبْدُوْنَهَا وَتُخْفُوْنَ كَثِیْرًا ۚ وَعُلِّمْتُمْ مَّا لَمْ تَعْلَمُوْۤا اَنْتُمْ وَلَاۤ اٰبَآؤُكُمْ ؕ قُلِ اللّٰهُ ۙ ثُمَّ ذَرْهُمْ فِیْ خَوْضِهِمْ یَلْعَبُوْنَ ۟","juz":7,"ruku":112,"hizbQuarter":55,"sajda":false,"isSurahStart":false},{"surahNumber":6,"surahName":"سُورَةُ الأَنۡعَامِ","surahEnglishName":"Al-An'aam","ayahNumber":92,"text":"وَهٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ مُّصَدِّقُ الَّذِیْ بَیْنَ یَدَیْهِ وَلِتُنْذِرَ اُمَّ الْقُرٰی وَمَنْ حَوْلَهَا ؕ وَالَّذِیْنَ یُؤْمِنُوْنَ بِالْاٰخِرَةِ یُؤْمِنُوْنَ بِهٖ وَهُمْ عَلٰی صَلَاتِهِمْ یُحَافِظُوْنَ ۟","juz":7,"ruku":112,"hizbQuarter":55,"sajda":false,"isSurahStart":false},{"surahNumber":6,"surahName":"سُورَةُ الأَنۡعَامِ","surahEnglishName":"Al-An'aam","ayahNumber":93,"text":"وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا اَوْ قَالَ اُوْحِیَ اِلَیَّ وَلَمْ یُوْحَ اِلَیْهِ شَیْءٌ وَّمَنْ قَالَ سَاُنْزِلُ مِثْلَ مَاۤ اَنْزَلَ اللّٰهُ ؕ وَلَوْ تَرٰۤی اِذِ الظّٰلِمُوْنَ فِیْ غَمَرٰتِ الْمَوْتِ وَالْمَلٰٓىِٕكَةُ بَاسِطُوْۤا اَیْدِیْهِمْ ۚ اَخْرِجُوْۤا اَنْفُسَكُمْ ؕ اَلْیَوْمَ تُجْزَوْنَ عَذَابَ الْهُوْنِ بِمَا كُنْتُمْ تَقُوْلُوْنَ عَلَی اللّٰهِ غَیْرَ الْحَقِّ وَكُنْتُمْ عَنْ اٰیٰتِهٖ تَسْتَكْبِرُوْنَ ۟","juz":7,"ruku":112,"hizbQuarter":55,"sajda":false,"isSurahStart":false},{"surahNumber":6,"surahName":"سُورَةُ الأَنۡعَامِ","surahEnglishName":"Al-An'aam","ayahNumber":94,"text":"وَلَقَدْ جِئْتُمُوْنَا فُرَادٰی كَمَا خَلَقْنٰكُمْ اَوَّلَ مَرَّةٍ وَّتَرَكْتُمْ مَّا خَوَّلْنٰكُمْ وَرَآءَ ظُهُوْرِكُمْ ۚ وَمَا نَرٰی مَعَكُمْ شُفَعَآءَكُمُ الَّذِیْنَ زَعَمْتُمْ اَنَّهُمْ فِیْكُمْ شُرَكٰٓؤُا ؕ لَقَدْ تَّقَطَّعَ بَیْنَكُمْ وَضَلَّ عَنْكُمْ مَّا كُنْتُمْ تَزْعُمُوْنَ ۟۠","juz":7,"ruku":112,"hizbQuarter":55,"sajda":false,"isSurahStart":false}]}