{"number":52,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"Hora. Sinai"},{"number":2,"text":"uchovat v pameti bible"},{"number":3,"text":"uverejnit od zamluvit"},{"number":4,"text":"Bený Skrín S Ostatky"},{"number":5,"text":"povýšit horní hranice"},{"number":6,"text":"More urcit v plamenech"},{"number":7,"text":"Svuj Magnát náhrada jsem nezbytný"},{"number":8,"text":"nikoliv vnutit vesmír konec to"},{"number":9,"text":"Cas podlehnout when lye violently bít"},{"number":10,"text":"Hora otírat out"},{"number":11,"text":"Hore onen cas s disbelievers"},{"number":12,"text":"Který jsem od jejich chyba nepozorný"},{"number":13,"text":"Oni stádo Gehenna forcibly"},{"number":14,"text":"Tento jsem Zapálit od ty jednat pochybovat"},{"number":15,"text":"jsem tento kouzelný ty ne prijmout"},{"number":16,"text":"Snést svítit Ty jsem trpelivý netrpelivý ono jsem a spolu pro ty! Tento jsem proste náhrada co ty ucinil"},{"number":17,"text":"Spravedlivý zaslouilý zahradní bliss"},{"number":18,"text":"Oni trávit co jejich Magnát zachovat ti; jejich Magnát ušetrit ti odškodnení Peklo"},{"number":19,"text":"Strávit nápoj šastne operadlo svuj spravovat"},{"number":20,"text":"Oni uvolnit bujný domovní vybavení my shoda ti krásný snoubenec"},{"number":21,"text":"Pro ty verit jejich detský také následující ti domnenka my mel jejich detský svázat ti! My nikdy selhání odmenit ti kadý spravovat. Naprostý osoba byl platil nebo co on ucinil"},{"number":22,"text":"My dodat ti ovoce maso oni milovat"},{"number":23,"text":"Oni trávit pít nikdy znecistit nikdy hríšný nápoj"},{"number":24,"text":"Obsluhovat ti jsem sluha zabezpecený perlit se"},{"number":25,"text":"Oni vhodný kadý jinam reminisce sebe"},{"number":26,"text":"Oni odríkávat My jednat jsem hodný poníit náš lidé"},{"number":27,"text":"BUH ŠTESTÍ NÁS UŠETRIT NÁS ZÁPAS ŠPATNE RANIT"},{"number":28,"text":"My jednat vzývat Jemu; On jsem nejvetší Hodný Milosrdný"},{"number":29,"text":"Ty upomenout lidé. Na svuj Magnát štestí ty ty jsem ani veštec nor potreštený"},{"number":30,"text":"Oni odríkávat On jsem básník; just cekat ne on jsem naprostý"},{"number":31,"text":"Odríkávat Odchod u cekat; já cekat ty"},{"number":32,"text":"To byl jejich snení onen príkaz jejich behavior ar oni prirozene prostopášný"},{"number":33,"text":"Znicit oni odríkávat On zpusobit to úplne Místo oni jsem pouze disbelievers"},{"number":34,"text":"Pripustit ti vytáhnout Hadith tento jestlie oni jsem pravý"},{"number":35,"text":"Oni tvorit nic? Byl oni tvurce"},{"number":36,"text":"Oni tvorit nebe zahrabat? Vskutku oni ne mel urcitost"},{"number":37,"text":"Oni mít povaovat za cenné svuj Magnát? Oni od byl rízený"},{"number":38,"text":"Oni lézt pouštet oka zpusobit uvolnit ti naslouchat? Pripustit jejich posluchac beet jejich pevný"},{"number":39,"text":"On zpusobit dcera doba ty dret mel syn"},{"number":40,"text":"Ty poadovat ti kadý vést a oni zatíit tím"},{"number":41,"text":"Oni módní budoucí zpusobit to zaznamenat"},{"number":42,"text":"Oni obsah a úklad disbelievers' navrhovat selhat ti"},{"number":43,"text":"Oni mel jiný buh BUH? BUH OSLAVOVAT DRUHÝ MEL SPOJIT"},{"number":44,"text":"When oni prijmout masový dostat lye oni odríkávat Sloit zastínit"},{"number":45,"text":"Nedbat ti oni vhodný cas od který oni postihnout"},{"number":46,"text":"Onen cas jejich navrhovat ne ochranný ti nor prosit oni porce"},{"number":47,"text":"Ty zhrešit snést odškodnení sem mnoství z ti ne módní"},{"number":48,"text":"Ty steadfastly vytrvat prodávat svuj Magnát ovládání! - Ty jsem náš otvor - Oslavovat velebit svuj Lord when ty vzít si"},{"number":49,"text":"Také behem vecer oslavovat Jemu o záblesk jako vystupovat únik stranou"}]}