[{"hadith-eng":"When the verse, `Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:31]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), (is this) in addition to our disputes in this world?” He said: `Yes.` When the verse, `Then on that Day you shall be asked about the delights (you indulged in, in this world)” (at-Takathur [102:8]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), what delights will we be asked about? All we have is the two black ones - dates and water.” He said: `This will certainly take place.”","reference":"Musnad Ahmad 1405, Book 7, Hadith 1","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #1","question":"What is the significance of disputes on the Day of Resurrection according to Islamic teachings?","id":"ahmad-7-1"},{"hadith-eng":"I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, az-Zubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist (Sufyan said on one occasion: by Whose leave heaven and earth exist), do you know that the Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from; what we leave behind is charity`. They said: “By Allah, yes.”","reference":"Musnad Ahmad 1406, Book 7, Hadith 2","grade":"Sahih (Darussalam), al-Bukhari (3094) and Muslim (1757) without mentioning Talhah](Darussalam)","question #":"question #1","question":"What is the significance of the statement that prophets are not to be inherited from in Islamic teachings?","id":"ahmad-7-2"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Verily, for a man to carry a rope and gather firewood, then come and sell it in the marketplace and make himself independent of means thereby, so that he can spend on his (needs), is better than him asking people, whether they give him anything or not.”","reference":"Musnad Ahmad 1407, Book 7, Hadith 3","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #1","question":"What is the significance of self-reliance and earning one's livelihood in Islam?","id":"ahmad-7-3"},{"hadith-eng":"The Messenger of Allah (ﷺ) mentioned both of his parents together for me on the Day of ‘Uhud (i.e., in the phrase “may my father and mother be sacrificed for you`.]","reference":"Musnad Ahmad 1408, Book 7, Hadith 4","grade":"Sahih (Darussalam) according to the conditions of al Bukhari and Muslim](Darussalam)","question #":"question #1","question":"What is the significance of the phrase 'may my father and mother be sacrificed for you' in Islamic tradition?","id":"ahmad-7-4"},{"hadith-eng":"On the day of al-Khandaq, `Umar bin Abi Salamah and I were in the fort where the wives of the Messenger of Allah (ﷺ) were, the fort of Hassan. He would lift me up and I would lift him up. When he lifted me up, I saw my father go past on his way to Quraizah, as he was fighting alongside the Messenger of Allah (ﷺ) on the day of al-Khandaq. He said: “Who will go to Banu Quraizah and fight them?” I said to him when he came back: “O my father, I recognized you when you were going to Banu Quraizah.” He said: “O my son, by Allah, the Messenger of Allah(ﷺ) mentioned both his parents together for me when he said: May my father and mother be sacrificed for you.`","reference":"Musnad Ahmad 1409, Book 7, Hadith 5","grade":"Sahih (Darussalam), al Bukhari (3720) and Muslim (2416)](Darussalam)","question #":"question #1","question":"What significance does the phrase 'May my father and mother be sacrificed for you' hold in Islamic tradition?","id":"ahmad-7-5"},{"hadith-eng":"It was narrated from az-Zubair bin al-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it.","reference":"Musnad Ahmad 1410, Book 7, Hadith 6","grade":"Lts isnad is Sahih](Darussalam)","question #":"question #1","question":"What ethical considerations should be taken into account when buying or selling animals that were previously donated for a noble cause?","id":"ahmad-7-6"},{"hadith-eng":"We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1411, Book 7, Hadith 7","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because it is interrupted](Darussalam)","question #":"question #1","question":"What does this narration indicate about the conditions during the time of Jumu’ah prayer with the Prophet (ﷺ)?","id":"ahmad-7-7"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer) that shaves (destroys) religious commitment; it does not shave hair. By the One in Whose Hand is the soul of Muhammad, you will not believe until you love one another. Shall I not tell you something which, if you do it, you will love one another? Spread (the greeting of) salam amongst yourselves.”","reference":"Musnad Ahmad 1412, Book 7, Hadith 8","grade":"The Hadeeth is Hasan because of corroborating evidence and its isnad is interrupted](Darussalam)","question #":"question #1","question":"What are the consequences of jealousy and hatred on religious commitment?","id":"ahmad-7-8"},{"hadith-eng":"I said to az-Zubair (رضي الله عنه): “Why don`t I hear you narrating from the Messenger of Allah (ﷺ) as I hear Ibn Mas`ood and so and so, and so and so?” He said: “I never left him since I became Muslim, but I heard something from him: `Whoever tells a lie about me deliberately, let him take his place in Hell.””","reference":"Musnad Ahmad 1413, Book 7, Hadith 9","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #1","question":"What is the consequence of deliberately lying about the Prophet Muhammad (ﷺ)?","id":"ahmad-7-9"},{"hadith-eng":"We said to az-Zubair (رضي الله عنه): “O Abu `Abdullah, what brought you here? You let the caliph down until he was killed, then you came seeking vengeance for him?” Az-Zubair (رضي الله عنه) said: “At the time of the Prophet (ﷺ), Abu Bakr, `Umar and `Uthman and me, we read the verse: “And fear the Fitnah (affliction and trial) which affects not in particular (only those) of you who do wrong (but it may afflict all the good and the bad people).” [al-Anfal 8:25]. But we never knew that it referred to us until the turmoil befell us.”","reference":"Musnad Ahmad 1414, Book 7, Hadith 10","grade":"Its isnad is Jayyid](Darussalam)","question #":"question #1","question":"What is the significance of understanding the broader implications of Quranic verses in the context of societal trials and tribulations?","id":"ahmad-7-10"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Change grey hair, and do not resemble the Jews.`","reference":"Musnad Ahmad 1415, Book 7, Hadith 11","grade":"Hasan because of corroborating evidence and Da'if (Darussalam)](Darussalam)","question #":"question #1","question":"What is the significance of changing grey hair in Islamic teachings?","id":"ahmad-7-11"},{"hadith-eng":"We came from Liyyah with the Messenger of Allah (ﷺ) and when we reached Sidrah, the Messenger of Allah (ﷺ) stood at one side of Qarnul-Aswad, facing it, then he turned his gaze towards Nakhibah (i.e., a valley) and he waited until all the people had stopped too. Then he said: `Hunting in Wajj and cutting down its plants is haram; it is sacred to Allah.” That was before he came to at-Ta`if and besieged Thaqeef.","reference":"Musnad Ahmad 1416, Book 7, Hadith 12","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #1","question":"What is the significance of declaring certain areas as sacred in Islam?","id":"ahmad-7-12"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say one day: `Paradise is due to Talhah,` when he did what he did for the Messenger of Allah (ﷺ)(i.e., when Talhah leaned down and the Messenger of Allah (ﷺ) climbed on his back.)","reference":"Musnad Ahmad 1417, Book 7, Hadith 13","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #1","question":"What actions can lead to being promised Paradise according to Islamic teachings?","id":"ahmad-7-13"},{"hadith-eng":"My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.","reference":"Musnad Ahmad 1418, Book 7, Hadith 14","grade":"Lts isnad is Hasan](Darussalam)","question #":"question #1","question":"What actions did the Prophet (ﷺ) take to protect the feelings of women during the aftermath of a battle?","id":"ahmad-7-14"},{"hadith-eng":"’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”","reference":"Musnad Ahmad 1419, Book 7, Hadith 15","grade":"Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)](Darussalam)","question #":"question #1","question":"What is the significance of accepting the Prophet Muhammad's (ﷺ) judgment in disputes?","id":"ahmad-7-15"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: `This land is the land of Allah and the people are the slaves of Allah, so wherever you find something good, stay there.`","reference":"Musnad Ahmad 1420, Book 7, Hadith 16","grade":"Lts isnad is Da'if](Darussalam)","question #":"question #1","question":"What does the statement 'This land is the land of Allah' signify about the ownership of the earth?","id":"ahmad-7-16"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) recite this verse when he was in ‘Arafah: `Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise” (Surah AI-‘Imran [3:18]). And I am one of the witnesses to that, O Lord.”","reference":"Musnad Ahmad 1421, Book 7, Hadith 17","grade":"Da'if (Darussalam) like the previous report](Darussalam)","question #":"question #1","question":"What is the significance of the testimony of Allah, angels, and those with knowledge in Islamic belief?","id":"ahmad-7-17"},{"hadith-eng":"By Allah, it is as if we can see az-Zubair bin al-`Awwam (رضي الله عنه) when he came to us on a white mule of his and said: “O Umm ‘Ata, the Messenger of Allah (ﷺ) has forbidden the Muslims to eat from the meat of their sacrifices after three days.” I said: “May my father be sacrificed for you! What should we do with that which has been given to us?” He said: “As for what has been given to you, it is up to you.”","reference":"Musnad Ahmad 1422, Book 7, Hadith 18","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #1","question":"What was the instruction given by the Prophet Muhammad (ﷺ) regarding the consumption of sacrificial meat after three days?","id":"ahmad-7-18"},{"hadith-eng":"On the day of al-Ahzab, `Umar bin Abi Salamah and I were put with the women. I looked out and saw az-Zubair on his horse, coming and going from Banu Quraizah two or three times. When he came back I said: “O my father, I saw you coming and going.” He said: “Did you see me, O my son?” I said: “Yes.” He said: “The Messenger of Allah (ﷺ) said: `Who would like to go to Banu Quraizah and bring me news of them?` So I set out and when I came back, the Messenger of Allah (ﷺ) mentioned both his father and his mother for me and said: `May my father and mother be sacrificed for you.”","reference":"Musnad Ahmad 1423, Book 7, Hadith 19","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #1","question":"What significance does the phrase 'May my father and mother be sacrificed for you' hold in Islamic tradition?","id":"ahmad-7-19"},{"hadith-eng":"When we conquered Egypt without a peace deal (i.e., by force), az-Zubair bin al-`Awwam (رضي الله عنه) stood up and said: “O `Amr bin al `As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair (رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameer al-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah.","reference":"Musnad Ahmad 1424, Book 7, Hadith 20","grade":"Da'if (Darussalam) [](Darussalam)","question #":"question #1","question":"What considerations should be taken into account when deciding whether to divide conquered land?","id":"ahmad-7-20"},{"hadith-eng":"It was narrated from al Mundhir bin az-Zubair (رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse.","reference":"Musnad Ahmad 1425, Book 7, Hadith 21","grade":"Hasan because of corroborating evidence and this is a Da'if isnad, Fulaih is unknown](Darussalam)","question #":"question #1","question":"What is the significance of distributing shares in the context of this narration?","id":"ahmad-7-21"},{"hadith-eng":"A man came to az-Zubair bin al-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”\n\nAl-Hasan said:  A man came to az-Zubair bin al-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)","reference":"Musnad Ahmad 1426, 1427, Book 7, Hadith 22","grade":"Sahih], Sahih](Darussalam)","question #":"question #1","question":"What is the stance of Islam on assassination according to the teachings of the Prophet Muhammad (ﷺ)?","id":"ahmad-7-22"},{"hadith-eng":"I said to my father, az-Zubair bin al-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`","reference":"Musnad Ahmad 1428, Book 7, Hadith 23","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #1","question":"What is the consequence of lying about the Prophet Muhammad (ﷺ) according to Islamic teachings?","id":"ahmad-7-23"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “For one of you to take a rope and go to the mountains, then bring a bundle of firewood on his back and sell it, and make himself independent of means thereby, is better for him than to ask of people, whether they give him something or not.”","reference":"Musnad Ahmad 1429, Book 7, Hadith 24","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #1","question":"What is the significance of self-reliance and hard work in Islam?","id":"ahmad-7-24"},{"hadith-eng":"“There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eesh bin al-Waleed that a freed slave of the family of az-Zubair told him that az-Zubair (رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair (رضي الله عنه) that az-Zubair bin al-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,","reference":"Musnad Ahmad 1430, 1431, 1432, Book 7, Hadith 25","grade":"Da'if (Darussalam)], See the previous report], See the previous report](Darussalam)","question #":"question #1","question":"What are the consequences of jealousy and hatred on one's religious commitment?","id":"ahmad-7-25"},{"hadith-eng":"A man said to az-Zubair: “Shall I kill `Ali for you?” He said: “How would you kill him?” He said: “I will assassinate him.”He said: “No, the Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.`","reference":"Musnad Ahmad 1433, Book 7, Hadith 26","grade":"Sahih](Darussalam)","question #":"question #1","question":"What is the stance of Islam on assassination according to the teachings of the Prophet Muhammad (ﷺ)?","id":"ahmad-7-26"},{"hadith-eng":"When this surah was revealed to the Messenger of Allah (ﷺ): `Verily, you (O Muhammad is) will die, and verily, they (too) will die. Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:30,31]), az-Zubair said: “O Messenger of Allah, will we face again the disputes we had among us in this world in addition to other sins?” He said: “Yes, you will face these disputes again until everyone who has a right has been given his right.” AzZubair said: “By Allah, the matter is very serious.”","reference":"Musnad Ahmad 1434, Book 7, Hadith 27","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #1","question":"What does the Quran say about the inevitability of death for all humans, including the Prophet Muhammad (ﷺ)?","id":"ahmad-7-27"},{"hadith-eng":"I heard ‘lkrimah (recite): “And (remember) when We sent towards you (Muhammad (ﷺ)” and it was recited to Sufyan from az-Zubair, `a group (three to ten persons) of the jinn, (quietly) listening to the Qur`an` (al-Ahqaf [46:29]). He said: “[That was] in Nakhlah. The Messenger of Allah (ﷺ) was praying Isha`, and they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s (ﷺ) recitation)” (al-Jinn [72:19]). Sufyan said: “They were one above the other, like thick masses of clouds one above the other.”","reference":"Musnad Ahmad 1435, Book 7, Hadith 28","grade":"Hasan because of corroborating evidence and Da'if (Darussalam) because it is interrupted between Ikrimah and Az-Zubair](Darussalam)","question #":"question #1","question":"What is the significance of the jinn listening to the Qur'an being recited by the Prophet Muhammad (ﷺ)?","id":"ahmad-7-28"},{"hadith-eng":"Someone who heard him told me that az-Zubair bin al ‘Awwam (رضي الله عنه) said: “We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1436, Book 7, Hadith 29","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because the chain between Muslim bin Jundab and Az-Zubair is unknown)(Darussalam)","question #":"question #1","question":"What does this narration indicate about the timing of Jumu'ah prayer during the Prophet's time?","id":"ahmad-7-29"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to address us and remind us of the annals of Allah, until we could see that on his face (because of alarm). It was as if he was warning people against an enemy that would attack them in the morning. If he had just recently met with Jibreel, he would not smile until Jibreel had departed from him.","reference":"Musnad Ahmad 1437, Book 7, Hadith 30","grade":"Hasan (Darussalam)(Darussalam)","question #":"question #1","question":"What impact did the reminders of the Prophet (ﷺ) have on his companions?","id":"ahmad-7-30"},{"hadith-eng":"This verse was revealed when we were present with the Messenger of Allah (ﷺ) : `And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people)`. (al-Anfal [8:25]). We started saying: “What is this fitnah? And we never thought that it would happen as it did.”","reference":"Musnad Ahmad 1438, Book 7, Hadith 31","grade":"This hadeeth is Jayyid(Darussalam)","question #":"question #1","question":"What is the significance of fearing fitnah according to Islamic teachings?","id":"ahmad-7-31"},{"hadith-eng":"When the verse, `Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:31]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), (is this) in addition to our disputes in this world?” He said: `Yes.` When the verse, `Then on that Day you shall be asked about the delights (you indulged in, in this world)” (at-Takathur [102:8]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), what delights will we be asked about? All we have is the two black ones - dates and water.” He said: `This will certainly take place.”","reference":"Musnad Ahmad 1405, Book 7, Hadith 1","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #2","question":"How does the concept of accountability for worldly indulgences manifest in Islamic eschatology?","id":"ahmad-7-32"},{"hadith-eng":"I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, az-Zubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist (Sufyan said on one occasion: by Whose leave heaven and earth exist), do you know that the Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from; what we leave behind is charity`. They said: “By Allah, yes.”","reference":"Musnad Ahmad 1406, Book 7, Hadith 2","grade":"Sahih (Darussalam), al-Bukhari (3094) and Muslim (1757) without mentioning Talhah](Darussalam)","question #":"question #2","question":"How does the concept of charity relate to the possessions left by prophets according to Islamic tradition?","id":"ahmad-7-33"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Verily, for a man to carry a rope and gather firewood, then come and sell it in the marketplace and make himself independent of means thereby, so that he can spend on his (needs), is better than him asking people, whether they give him anything or not.”","reference":"Musnad Ahmad 1407, Book 7, Hadith 3","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #2","question":"How does Islam view the act of begging or asking others for help when one is capable of working?","id":"ahmad-7-34"},{"hadith-eng":"The Messenger of Allah (ﷺ) mentioned both of his parents together for me on the Day of ‘Uhud (i.e., in the phrase “may my father and mother be sacrificed for you`.]","reference":"Musnad Ahmad 1408, Book 7, Hadith 4","grade":"Sahih (Darussalam) according to the conditions of al Bukhari and Muslim](Darussalam)","question #":"question #2","question":"In what context did the Prophet Muhammad (ﷺ) mention both of his parents together?","id":"ahmad-7-35"},{"hadith-eng":"On the day of al-Khandaq, `Umar bin Abi Salamah and I were in the fort where the wives of the Messenger of Allah (ﷺ) were, the fort of Hassan. He would lift me up and I would lift him up. When he lifted me up, I saw my father go past on his way to Quraizah, as he was fighting alongside the Messenger of Allah (ﷺ) on the day of al-Khandaq. He said: “Who will go to Banu Quraizah and fight them?” I said to him when he came back: “O my father, I recognized you when you were going to Banu Quraizah.” He said: “O my son, by Allah, the Messenger of Allah(ﷺ) mentioned both his parents together for me when he said: May my father and mother be sacrificed for you.`","reference":"Musnad Ahmad 1409, Book 7, Hadith 5","grade":"Sahih (Darussalam), al Bukhari (3720) and Muslim (2416)](Darussalam)","question #":"question #2","question":"How did the companions of the Prophet Muhammad (ﷺ) demonstrate their loyalty and dedication during battles?","id":"ahmad-7-36"},{"hadith-eng":"It was narrated from az-Zubair bin al-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it.","reference":"Musnad Ahmad 1410, Book 7, Hadith 6","grade":"Lts isnad is Sahih](Darussalam)","question #":"question #2","question":"Why might it be discouraged to purchase an animal that was once given for jihad?","id":"ahmad-7-37"},{"hadith-eng":"We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1411, Book 7, Hadith 7","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because it is interrupted](Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) manage the heat after the Jumu’ah prayer?","id":"ahmad-7-38"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer) that shaves (destroys) religious commitment; it does not shave hair. By the One in Whose Hand is the soul of Muhammad, you will not believe until you love one another. Shall I not tell you something which, if you do it, you will love one another? Spread (the greeting of) salam amongst yourselves.”","reference":"Musnad Ahmad 1412, Book 7, Hadith 8","grade":"The Hadeeth is Hasan because of corroborating evidence and its isnad is interrupted](Darussalam)","question #":"question #2","question":"How can love among individuals be fostered according to Islamic teachings?","id":"ahmad-7-39"},{"hadith-eng":"I said to az-Zubair (رضي الله عنه): “Why don`t I hear you narrating from the Messenger of Allah (ﷺ) as I hear Ibn Mas`ood and so and so, and so and so?” He said: “I never left him since I became Muslim, but I heard something from him: `Whoever tells a lie about me deliberately, let him take his place in Hell.””","reference":"Musnad Ahmad 1413, Book 7, Hadith 9","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #2","question":"Why might some companions have narrated fewer hadiths than others?","id":"ahmad-7-40"},{"hadith-eng":"We said to az-Zubair (رضي الله عنه): “O Abu `Abdullah, what brought you here? You let the caliph down until he was killed, then you came seeking vengeance for him?” Az-Zubair (رضي الله عنه) said: “At the time of the Prophet (ﷺ), Abu Bakr, `Umar and `Uthman and me, we read the verse: “And fear the Fitnah (affliction and trial) which affects not in particular (only those) of you who do wrong (but it may afflict all the good and the bad people).” [al-Anfal 8:25]. But we never knew that it referred to us until the turmoil befell us.”","reference":"Musnad Ahmad 1414, Book 7, Hadith 10","grade":"Its isnad is Jayyid](Darussalam)","question #":"question #2","question":"How can historical events influence the interpretation of religious texts?","id":"ahmad-7-41"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Change grey hair, and do not resemble the Jews.`","reference":"Musnad Ahmad 1415, Book 7, Hadith 11","grade":"Hasan because of corroborating evidence and Da'if (Darussalam)](Darussalam)","question #":"question #2","question":"Why is it advised not to resemble the Jews in the context of this teaching?","id":"ahmad-7-42"},{"hadith-eng":"We came from Liyyah with the Messenger of Allah (ﷺ) and when we reached Sidrah, the Messenger of Allah (ﷺ) stood at one side of Qarnul-Aswad, facing it, then he turned his gaze towards Nakhibah (i.e., a valley) and he waited until all the people had stopped too. Then he said: `Hunting in Wajj and cutting down its plants is haram; it is sacred to Allah.” That was before he came to at-Ta`if and besieged Thaqeef.","reference":"Musnad Ahmad 1416, Book 7, Hadith 12","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #2","question":"What are the implications of prohibiting hunting and cutting down plants in specific regions?","id":"ahmad-7-43"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say one day: `Paradise is due to Talhah,` when he did what he did for the Messenger of Allah (ﷺ)(i.e., when Talhah leaned down and the Messenger of Allah (ﷺ) climbed on his back.)","reference":"Musnad Ahmad 1417, Book 7, Hadith 13","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #2","question":"Who was Talhah and what significant act did he perform for the Prophet Muhammad (ﷺ)?","id":"ahmad-7-44"},{"hadith-eng":"My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.","reference":"Musnad Ahmad 1418, Book 7, Hadith 14","grade":"Lts isnad is Hasan](Darussalam)","question #":"question #2","question":"How did az-Zubair (رضي الله عنه) respond when he thought his mother was approaching the slain at Uhud?","id":"ahmad-7-45"},{"hadith-eng":"’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”","reference":"Musnad Ahmad 1419, Book 7, Hadith 15","grade":"Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)](Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) handle disputes involving his relatives?","id":"ahmad-7-46"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: `This land is the land of Allah and the people are the slaves of Allah, so wherever you find something good, stay there.`","reference":"Musnad Ahmad 1420, Book 7, Hadith 16","grade":"Lts isnad is Da'if](Darussalam)","question #":"question #2","question":"How does the concept of being 'slaves of Allah' influence a believer's perspective on life and possessions?","id":"ahmad-7-47"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) recite this verse when he was in ‘Arafah: `Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise” (Surah AI-‘Imran [3:18]). And I am one of the witnesses to that, O Lord.”","reference":"Musnad Ahmad 1421, Book 7, Hadith 17","grade":"Da'if (Darussalam) like the previous report](Darussalam)","question #":"question #2","question":"How does the concept of Tawheed (the oneness of Allah) manifest in this verse?","id":"ahmad-7-48"},{"hadith-eng":"By Allah, it is as if we can see az-Zubair bin al-`Awwam (رضي الله عنه) when he came to us on a white mule of his and said: “O Umm ‘Ata, the Messenger of Allah (ﷺ) has forbidden the Muslims to eat from the meat of their sacrifices after three days.” I said: “May my father be sacrificed for you! What should we do with that which has been given to us?” He said: “As for what has been given to you, it is up to you.”","reference":"Musnad Ahmad 1422, Book 7, Hadith 18","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #2","question":"How did az-Zubair bin al-`Awwam convey the message of the Prophet (ﷺ) to others?","id":"ahmad-7-49"},{"hadith-eng":"On the day of al-Ahzab, `Umar bin Abi Salamah and I were put with the women. I looked out and saw az-Zubair on his horse, coming and going from Banu Quraizah two or three times. When he came back I said: “O my father, I saw you coming and going.” He said: “Did you see me, O my son?” I said: “Yes.” He said: “The Messenger of Allah (ﷺ) said: `Who would like to go to Banu Quraizah and bring me news of them?` So I set out and when I came back, the Messenger of Allah (ﷺ) mentioned both his father and his mother for me and said: `May my father and mother be sacrificed for you.”","reference":"Musnad Ahmad 1423, Book 7, Hadith 19","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #2","question":"What role did az-Zubair play during the events of al-Ahzab?","id":"ahmad-7-50"},{"hadith-eng":"When we conquered Egypt without a peace deal (i.e., by force), az-Zubair bin al-`Awwam (رضي الله عنه) stood up and said: “O `Amr bin al `As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair (رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameer al-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah.","reference":"Musnad Ahmad 1424, Book 7, Hadith 20","grade":"Da'if (Darussalam) [](Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) handle disagreements regarding the division of land?","id":"ahmad-7-51"},{"hadith-eng":"It was narrated from al Mundhir bin az-Zubair (رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse.","reference":"Musnad Ahmad 1425, Book 7, Hadith 21","grade":"Hasan because of corroborating evidence and this is a Da'if isnad, Fulaih is unknown](Darussalam)","question #":"question #2","question":"How were shares allocated to individuals and animals in early Islamic practices?","id":"ahmad-7-52"},{"hadith-eng":"A man came to az-Zubair bin al-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”\n\nAl-Hasan said:  A man came to az-Zubair bin al-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)","reference":"Musnad Ahmad 1426, 1427, Book 7, Hadith 22","grade":"Sahih], Sahih](Darussalam)","question #":"question #2","question":"How does faith influence a believer's actions regarding violence and assassination?","id":"ahmad-7-53"},{"hadith-eng":"I said to my father, az-Zubair bin al-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`","reference":"Musnad Ahmad 1428, Book 7, Hadith 23","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #2","question":"Why might someone choose not to narrate hadiths despite being close to the Prophet Muhammad (ﷺ)?","id":"ahmad-7-54"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “For one of you to take a rope and go to the mountains, then bring a bundle of firewood on his back and sell it, and make himself independent of means thereby, is better for him than to ask of people, whether they give him something or not.”","reference":"Musnad Ahmad 1429, Book 7, Hadith 24","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #2","question":"How does Islam view the act of asking others for help when one is capable of working?","id":"ahmad-7-55"},{"hadith-eng":"“There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eesh bin al-Waleed that a freed slave of the family of az-Zubair told him that az-Zubair (رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair (رضي الله عنه) that az-Zubair bin al-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,","reference":"Musnad Ahmad 1430, 1431, 1432, Book 7, Hadith 25","grade":"Da'if (Darussalam)], See the previous report], See the previous report](Darussalam)","question #":"question #2","question":"How does hatred act as a 'shaver' in the context of religious faith?","id":"ahmad-7-56"},{"hadith-eng":"A man said to az-Zubair: “Shall I kill `Ali for you?” He said: “How would you kill him?” He said: “I will assassinate him.”He said: “No, the Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.`","reference":"Musnad Ahmad 1433, Book 7, Hadith 26","grade":"Sahih](Darussalam)","question #":"question #2","question":"How does faith influence a believer's actions regarding violence and assassination?","id":"ahmad-7-57"},{"hadith-eng":"When this surah was revealed to the Messenger of Allah (ﷺ): `Verily, you (O Muhammad is) will die, and verily, they (too) will die. Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:30,31]), az-Zubair said: “O Messenger of Allah, will we face again the disputes we had among us in this world in addition to other sins?” He said: “Yes, you will face these disputes again until everyone who has a right has been given his right.” AzZubair said: “By Allah, the matter is very serious.”","reference":"Musnad Ahmad 1434, Book 7, Hadith 27","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #2","question":"How will disputes from this world be addressed on the Day of Resurrection according to Islamic teachings?","id":"ahmad-7-58"},{"hadith-eng":"I heard ‘lkrimah (recite): “And (remember) when We sent towards you (Muhammad (ﷺ)” and it was recited to Sufyan from az-Zubair, `a group (three to ten persons) of the jinn, (quietly) listening to the Qur`an` (al-Ahqaf [46:29]). He said: “[That was] in Nakhlah. The Messenger of Allah (ﷺ) was praying Isha`, and they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s (ﷺ) recitation)” (al-Jinn [72:19]). Sufyan said: “They were one above the other, like thick masses of clouds one above the other.”","reference":"Musnad Ahmad 1435, Book 7, Hadith 28","grade":"Hasan because of corroborating evidence and Da'if (Darussalam) because it is interrupted between Ikrimah and Az-Zubair](Darussalam)","question #":"question #2","question":"How did the jinn react to the recitation of the Qur'an by the Prophet Muhammad (ﷺ) during Isha prayer?","id":"ahmad-7-59"},{"hadith-eng":"Someone who heard him told me that az-Zubair bin al ‘Awwam (رضي الله عنه) said: “We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1436, Book 7, Hadith 29","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because the chain between Muslim bin Jundab and Az-Zubair is unknown)(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) seek shade after the Jumu'ah prayer?","id":"ahmad-7-60"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to address us and remind us of the annals of Allah, until we could see that on his face (because of alarm). It was as if he was warning people against an enemy that would attack them in the morning. If he had just recently met with Jibreel, he would not smile until Jibreel had departed from him.","reference":"Musnad Ahmad 1437, Book 7, Hadith 30","grade":"Hasan (Darussalam)(Darussalam)","question #":"question #2","question":"How did the Prophet (ﷺ) react after meeting with Jibreel?","id":"ahmad-7-61"},{"hadith-eng":"This verse was revealed when we were present with the Messenger of Allah (ﷺ) : `And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people)`. (al-Anfal [8:25]). We started saying: “What is this fitnah? And we never thought that it would happen as it did.”","reference":"Musnad Ahmad 1438, Book 7, Hadith 31","grade":"This hadeeth is Jayyid(Darussalam)","question #":"question #2","question":"How can fitnah affect both good and bad people in a community?","id":"ahmad-7-62"},{"hadith-eng":"When the verse, `Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:31]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), (is this) in addition to our disputes in this world?” He said: `Yes.` When the verse, `Then on that Day you shall be asked about the delights (you indulged in, in this world)” (at-Takathur [102:8]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), what delights will we be asked about? All we have is the two black ones - dates and water.” He said: `This will certainly take place.”","reference":"Musnad Ahmad 1405, Book 7, Hadith 1","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #3","question":"What are the 'delights' mentioned in Islamic scripture that people will be questioned about on the Day of Judgment?","id":"ahmad-7-63"},{"hadith-eng":"I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, az-Zubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist (Sufyan said on one occasion: by Whose leave heaven and earth exist), do you know that the Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from; what we leave behind is charity`. They said: “By Allah, yes.”","reference":"Musnad Ahmad 1406, Book 7, Hadith 2","grade":"Sahih (Darussalam), al-Bukhari (3094) and Muslim (1757) without mentioning Talhah](Darussalam)","question #":"question #3","question":"What role does swearing by Allah play in confirming the truth of a statement in Islamic discourse?","id":"ahmad-7-64"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Verily, for a man to carry a rope and gather firewood, then come and sell it in the marketplace and make himself independent of means thereby, so that he can spend on his (needs), is better than him asking people, whether they give him anything or not.”","reference":"Musnad Ahmad 1407, Book 7, Hadith 3","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #3","question":"What are the benefits of engaging in manual labor or trade according to Islamic teachings?","id":"ahmad-7-65"},{"hadith-eng":"The Messenger of Allah (ﷺ) mentioned both of his parents together for me on the Day of ‘Uhud (i.e., in the phrase “may my father and mother be sacrificed for you`.]","reference":"Musnad Ahmad 1408, Book 7, Hadith 4","grade":"Sahih (Darussalam) according to the conditions of al Bukhari and Muslim](Darussalam)","question #":"question #3","question":"How does the expression of sacrifice for one's parents reflect the values of respect and honor in Islam?","id":"ahmad-7-66"},{"hadith-eng":"On the day of al-Khandaq, `Umar bin Abi Salamah and I were in the fort where the wives of the Messenger of Allah (ﷺ) were, the fort of Hassan. He would lift me up and I would lift him up. When he lifted me up, I saw my father go past on his way to Quraizah, as he was fighting alongside the Messenger of Allah (ﷺ) on the day of al-Khandaq. He said: “Who will go to Banu Quraizah and fight them?” I said to him when he came back: “O my father, I recognized you when you were going to Banu Quraizah.” He said: “O my son, by Allah, the Messenger of Allah(ﷺ) mentioned both his parents together for me when he said: May my father and mother be sacrificed for you.`","reference":"Musnad Ahmad 1409, Book 7, Hadith 5","grade":"Sahih (Darussalam), al Bukhari (3720) and Muslim (2416)](Darussalam)","question #":"question #3","question":"What role did the family members of the Prophet's companions play during times of conflict?","id":"ahmad-7-67"},{"hadith-eng":"It was narrated from az-Zubair bin al-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it.","reference":"Musnad Ahmad 1410, Book 7, Hadith 6","grade":"Lts isnad is Sahih](Darussalam)","question #":"question #3","question":"What are the implications of buying back something that was previously given away for charity or a noble purpose?","id":"ahmad-7-68"},{"hadith-eng":"We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1411, Book 7, Hadith 7","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because it is interrupted](Darussalam)","question #":"question #3","question":"What can be inferred about the environment and infrastructure during the Prophet's (ﷺ) time from this narration?","id":"ahmad-7-69"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer) that shaves (destroys) religious commitment; it does not shave hair. By the One in Whose Hand is the soul of Muhammad, you will not believe until you love one another. Shall I not tell you something which, if you do it, you will love one another? Spread (the greeting of) salam amongst yourselves.”","reference":"Musnad Ahmad 1412, Book 7, Hadith 8","grade":"The Hadeeth is Hasan because of corroborating evidence and its isnad is interrupted](Darussalam)","question #":"question #3","question":"What is the significance of spreading salam in building community bonds?","id":"ahmad-7-70"},{"hadith-eng":"I said to az-Zubair (رضي الله عنه): “Why don`t I hear you narrating from the Messenger of Allah (ﷺ) as I hear Ibn Mas`ood and so and so, and so and so?” He said: “I never left him since I became Muslim, but I heard something from him: `Whoever tells a lie about me deliberately, let him take his place in Hell.””","reference":"Musnad Ahmad 1413, Book 7, Hadith 9","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #3","question":"What does this narration imply about the responsibility of accurately conveying the words of the Prophet (ﷺ)?","id":"ahmad-7-71"},{"hadith-eng":"We said to az-Zubair (رضي الله عنه): “O Abu `Abdullah, what brought you here? You let the caliph down until he was killed, then you came seeking vengeance for him?” Az-Zubair (رضي الله عنه) said: “At the time of the Prophet (ﷺ), Abu Bakr, `Umar and `Uthman and me, we read the verse: “And fear the Fitnah (affliction and trial) which affects not in particular (only those) of you who do wrong (but it may afflict all the good and the bad people).” [al-Anfal 8:25]. But we never knew that it referred to us until the turmoil befell us.”","reference":"Musnad Ahmad 1414, Book 7, Hadith 10","grade":"Its isnad is Jayyid](Darussalam)","question #":"question #3","question":"What lessons can be learned from the companions of the Prophet (ﷺ) regarding their understanding of trials and afflictions?","id":"ahmad-7-72"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Change grey hair, and do not resemble the Jews.`","reference":"Musnad Ahmad 1415, Book 7, Hadith 11","grade":"Hasan because of corroborating evidence and Da'if (Darussalam)](Darussalam)","question #":"question #3","question":"How does altering one's appearance relate to religious identity in Islam?","id":"ahmad-7-73"},{"hadith-eng":"We came from Liyyah with the Messenger of Allah (ﷺ) and when we reached Sidrah, the Messenger of Allah (ﷺ) stood at one side of Qarnul-Aswad, facing it, then he turned his gaze towards Nakhibah (i.e., a valley) and he waited until all the people had stopped too. Then he said: `Hunting in Wajj and cutting down its plants is haram; it is sacred to Allah.” That was before he came to at-Ta`if and besieged Thaqeef.","reference":"Musnad Ahmad 1416, Book 7, Hadith 12","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) demonstrate leadership and guidance during travel?","id":"ahmad-7-74"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say one day: `Paradise is due to Talhah,` when he did what he did for the Messenger of Allah (ﷺ)(i.e., when Talhah leaned down and the Messenger of Allah (ﷺ) climbed on his back.)","reference":"Musnad Ahmad 1417, Book 7, Hadith 13","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #3","question":"How is the concept of supporting the Prophet Muhammad (ﷺ) viewed in Islam?","id":"ahmad-7-75"},{"hadith-eng":"My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.","reference":"Musnad Ahmad 1418, Book 7, Hadith 14","grade":"Lts isnad is Hasan](Darussalam)","question #":"question #3","question":"What was the reaction of Safiyyah when she was stopped from seeing the slain at Uhud?","id":"ahmad-7-76"},{"hadith-eng":"’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”","reference":"Musnad Ahmad 1419, Book 7, Hadith 15","grade":"Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)](Darussalam)","question #":"question #3","question":"What can cause the Prophet Muhammad (ﷺ) to change his initial advice in a dispute?","id":"ahmad-7-77"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: `This land is the land of Allah and the people are the slaves of Allah, so wherever you find something good, stay there.`","reference":"Musnad Ahmad 1420, Book 7, Hadith 16","grade":"Lts isnad is Da'if](Darussalam)","question #":"question #3","question":"What guidance is provided for choosing a place to live according to this teaching?","id":"ahmad-7-78"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) recite this verse when he was in ‘Arafah: `Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise” (Surah AI-‘Imran [3:18]). And I am one of the witnesses to that, O Lord.”","reference":"Musnad Ahmad 1421, Book 7, Hadith 17","grade":"Da'if (Darussalam) like the previous report](Darussalam)","question #":"question #3","question":"What role do angels and knowledgeable individuals play in affirming the oneness of Allah?","id":"ahmad-7-79"},{"hadith-eng":"By Allah, it is as if we can see az-Zubair bin al-`Awwam (رضي الله عنه) when he came to us on a white mule of his and said: “O Umm ‘Ata, the Messenger of Allah (ﷺ) has forbidden the Muslims to eat from the meat of their sacrifices after three days.” I said: “May my father be sacrificed for you! What should we do with that which has been given to us?” He said: “As for what has been given to you, it is up to you.”","reference":"Musnad Ahmad 1422, Book 7, Hadith 18","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #3","question":"What options are available for the meat that has been given to someone after the sacrifice?","id":"ahmad-7-80"},{"hadith-eng":"On the day of al-Ahzab, `Umar bin Abi Salamah and I were put with the women. I looked out and saw az-Zubair on his horse, coming and going from Banu Quraizah two or three times. When he came back I said: “O my father, I saw you coming and going.” He said: “Did you see me, O my son?” I said: “Yes.” He said: “The Messenger of Allah (ﷺ) said: `Who would like to go to Banu Quraizah and bring me news of them?` So I set out and when I came back, the Messenger of Allah (ﷺ) mentioned both his father and his mother for me and said: `May my father and mother be sacrificed for you.”","reference":"Musnad Ahmad 1423, Book 7, Hadith 19","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) express appreciation for bravery and service?","id":"ahmad-7-81"},{"hadith-eng":"When we conquered Egypt without a peace deal (i.e., by force), az-Zubair bin al-`Awwam (رضي الله عنه) stood up and said: “O `Amr bin al `As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair (رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameer al-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah.","reference":"Musnad Ahmad 1424, Book 7, Hadith 20","grade":"Da'if (Darussalam) [](Darussalam)","question #":"question #3","question":"What was the reasoning behind leaving the land undivided for future generations?","id":"ahmad-7-82"},{"hadith-eng":"It was narrated from al Mundhir bin az-Zubair (رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse.","reference":"Musnad Ahmad 1425, Book 7, Hadith 21","grade":"Hasan because of corroborating evidence and this is a Da'if isnad, Fulaih is unknown](Darussalam)","question #":"question #3","question":"What does this narration imply about the treatment of animals in Islamic tradition?","id":"ahmad-7-83"},{"hadith-eng":"A man came to az-Zubair bin al-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”\n\nAl-Hasan said:  A man came to az-Zubair bin al-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)","reference":"Musnad Ahmad 1426, 1427, Book 7, Hadith 22","grade":"Sahih], Sahih](Darussalam)","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide about dealing with conflicts among Muslims?","id":"ahmad-7-84"},{"hadith-eng":"I said to my father, az-Zubair bin al-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`","reference":"Musnad Ahmad 1428, Book 7, Hadith 23","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #3","question":"What is the significance of accuracy and truthfulness in the transmission of hadiths?","id":"ahmad-7-85"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “For one of you to take a rope and go to the mountains, then bring a bundle of firewood on his back and sell it, and make himself independent of means thereby, is better for him than to ask of people, whether they give him something or not.”","reference":"Musnad Ahmad 1429, Book 7, Hadith 24","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #3","question":"What lessons can be learned about dignity and self-sufficiency from this teaching?","id":"ahmad-7-86"},{"hadith-eng":"“There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eesh bin al-Waleed that a freed slave of the family of az-Zubair told him that az-Zubair (رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair (رضي الله عنه) that az-Zubair bin al-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,","reference":"Musnad Ahmad 1430, 1431, 1432, Book 7, Hadith 25","grade":"Da'if (Darussalam)], See the previous report], See the previous report](Darussalam)","question #":"question #3","question":"What is the relationship between belief, love, and entering Paradise according to Islamic teachings?","id":"ahmad-7-87"},{"hadith-eng":"A man said to az-Zubair: “Shall I kill `Ali for you?” He said: “How would you kill him?” He said: “I will assassinate him.”He said: “No, the Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.`","reference":"Musnad Ahmad 1433, Book 7, Hadith 26","grade":"Sahih](Darussalam)","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide about dealing with enemies or adversaries?","id":"ahmad-7-88"},{"hadith-eng":"When this surah was revealed to the Messenger of Allah (ﷺ): `Verily, you (O Muhammad is) will die, and verily, they (too) will die. Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:30,31]), az-Zubair said: “O Messenger of Allah, will we face again the disputes we had among us in this world in addition to other sins?” He said: “Yes, you will face these disputes again until everyone who has a right has been given his right.” AzZubair said: “By Allah, the matter is very serious.”","reference":"Musnad Ahmad 1434, Book 7, Hadith 27","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #3","question":"What is the significance of ensuring that everyone receives their due rights in the hereafter?","id":"ahmad-7-89"},{"hadith-eng":"I heard ‘lkrimah (recite): “And (remember) when We sent towards you (Muhammad (ﷺ)” and it was recited to Sufyan from az-Zubair, `a group (three to ten persons) of the jinn, (quietly) listening to the Qur`an` (al-Ahqaf [46:29]). He said: “[That was] in Nakhlah. The Messenger of Allah (ﷺ) was praying Isha`, and they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s (ﷺ) recitation)” (al-Jinn [72:19]). Sufyan said: “They were one above the other, like thick masses of clouds one above the other.”","reference":"Musnad Ahmad 1435, Book 7, Hadith 28","grade":"Hasan because of corroborating evidence and Da'if (Darussalam) because it is interrupted between Ikrimah and Az-Zubair](Darussalam)","question #":"question #3","question":"What does the gathering of the jinn around the Prophet Muhammad (ﷺ) indicate about their interest in the Qur'an?","id":"ahmad-7-90"},{"hadith-eng":"Someone who heard him told me that az-Zubair bin al ‘Awwam (رضي الله عنه) said: “We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1436, Book 7, Hadith 29","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because the chain between Muslim bin Jundab and Az-Zubair is unknown)(Darussalam)","question #":"question #3","question":"What can be inferred about the climate or environment during the time of the Prophet (ﷺ) from this narration?","id":"ahmad-7-91"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to address us and remind us of the annals of Allah, until we could see that on his face (because of alarm). It was as if he was warning people against an enemy that would attack them in the morning. If he had just recently met with Jibreel, he would not smile until Jibreel had departed from him.","reference":"Musnad Ahmad 1437, Book 7, Hadith 30","grade":"Hasan (Darussalam)(Darussalam)","question #":"question #3","question":"What can be inferred about the seriousness of the Prophet's (ﷺ) warnings to his followers?","id":"ahmad-7-92"},{"hadith-eng":"This verse was revealed when we were present with the Messenger of Allah (ﷺ) : `And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people)`. (al-Anfal [8:25]). We started saying: “What is this fitnah? And we never thought that it would happen as it did.”","reference":"Musnad Ahmad 1438, Book 7, Hadith 31","grade":"This hadeeth is Jayyid(Darussalam)","question #":"question #3","question":"What was the reaction of the companions when the verse about fitnah was revealed?","id":"ahmad-7-93"},{"hadith-eng":"When the verse, `Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:31]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), (is this) in addition to our disputes in this world?” He said: `Yes.` When the verse, `Then on that Day you shall be asked about the delights (you indulged in, in this world)” (at-Takathur [102:8]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), what delights will we be asked about? All we have is the two black ones - dates and water.” He said: `This will certainly take place.”","reference":"Musnad Ahmad 1405, Book 7, Hadith 1","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #4","question":"How did the companions of the Prophet Muhammad (ﷺ) react to revelations about the afterlife and accountability?","id":"ahmad-7-94"},{"hadith-eng":"I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, az-Zubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist (Sufyan said on one occasion: by Whose leave heaven and earth exist), do you know that the Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from; what we leave behind is charity`. They said: “By Allah, yes.”","reference":"Musnad Ahmad 1406, Book 7, Hadith 2","grade":"Sahih (Darussalam), al-Bukhari (3094) and Muslim (1757) without mentioning Talhah](Darussalam)","question #":"question #4","question":"How does the testimony of companions contribute to the understanding of prophetic teachings?","id":"ahmad-7-95"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Verily, for a man to carry a rope and gather firewood, then come and sell it in the marketplace and make himself independent of means thereby, so that he can spend on his (needs), is better than him asking people, whether they give him anything or not.”","reference":"Musnad Ahmad 1407, Book 7, Hadith 3","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #4","question":"Why is it considered better to work and earn independently rather than relying on others for financial support?","id":"ahmad-7-96"},{"hadith-eng":"The Messenger of Allah (ﷺ) mentioned both of his parents together for me on the Day of ‘Uhud (i.e., in the phrase “may my father and mother be sacrificed for you`.]","reference":"Musnad Ahmad 1408, Book 7, Hadith 4","grade":"Sahih (Darussalam) according to the conditions of al Bukhari and Muslim](Darussalam)","question #":"question #4","question":"What can be learned about the relationship between the Prophet Muhammad (ﷺ) and his companions from this narration?","id":"ahmad-7-97"},{"hadith-eng":"On the day of al-Khandaq, `Umar bin Abi Salamah and I were in the fort where the wives of the Messenger of Allah (ﷺ) were, the fort of Hassan. He would lift me up and I would lift him up. When he lifted me up, I saw my father go past on his way to Quraizah, as he was fighting alongside the Messenger of Allah (ﷺ) on the day of al-Khandaq. He said: “Who will go to Banu Quraizah and fight them?” I said to him when he came back: “O my father, I recognized you when you were going to Banu Quraizah.” He said: “O my son, by Allah, the Messenger of Allah(ﷺ) mentioned both his parents together for me when he said: May my father and mother be sacrificed for you.`","reference":"Musnad Ahmad 1409, Book 7, Hadith 5","grade":"Sahih (Darussalam), al Bukhari (3720) and Muslim (2416)](Darussalam)","question #":"question #4","question":"How were the wives of the Prophet Muhammad (ﷺ) protected during the Battle of al-Khandaq?","id":"ahmad-7-98"},{"hadith-eng":"It was narrated from az-Zubair bin al-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it.","reference":"Musnad Ahmad 1410, Book 7, Hadith 6","grade":"Lts isnad is Sahih](Darussalam)","question #":"question #4","question":"How does the concept of ownership change when an item is donated for a cause in Islam?","id":"ahmad-7-99"},{"hadith-eng":"We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1411, Book 7, Hadith 7","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because it is interrupted](Darussalam)","question #":"question #4","question":"What does this narration reveal about the companions' dedication to attending Jumu’ah prayer despite environmental challenges?","id":"ahmad-7-100"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer) that shaves (destroys) religious commitment; it does not shave hair. By the One in Whose Hand is the soul of Muhammad, you will not believe until you love one another. Shall I not tell you something which, if you do it, you will love one another? Spread (the greeting of) salam amongst yourselves.”","reference":"Musnad Ahmad 1412, Book 7, Hadith 8","grade":"The Hadeeth is Hasan because of corroborating evidence and its isnad is interrupted](Darussalam)","question #":"question #4","question":"Why is mutual love considered essential for true belief in Islam?","id":"ahmad-7-101"},{"hadith-eng":"I said to az-Zubair (رضي الله عنه): “Why don`t I hear you narrating from the Messenger of Allah (ﷺ) as I hear Ibn Mas`ood and so and so, and so and so?” He said: “I never left him since I became Muslim, but I heard something from him: `Whoever tells a lie about me deliberately, let him take his place in Hell.””","reference":"Musnad Ahmad 1413, Book 7, Hadith 9","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #4","question":"How does this narration emphasize the importance of truthfulness in Islamic teachings?","id":"ahmad-7-102"},{"hadith-eng":"We said to az-Zubair (رضي الله عنه): “O Abu `Abdullah, what brought you here? You let the caliph down until he was killed, then you came seeking vengeance for him?” Az-Zubair (رضي الله عنه) said: “At the time of the Prophet (ﷺ), Abu Bakr, `Umar and `Uthman and me, we read the verse: “And fear the Fitnah (affliction and trial) which affects not in particular (only those) of you who do wrong (but it may afflict all the good and the bad people).” [al-Anfal 8:25]. But we never knew that it referred to us until the turmoil befell us.”","reference":"Musnad Ahmad 1414, Book 7, Hadith 10","grade":"Its isnad is Jayyid](Darussalam)","question #":"question #4","question":"How does the concept of fitnah relate to both individual and communal responsibility in Islam?","id":"ahmad-7-103"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Change grey hair, and do not resemble the Jews.`","reference":"Musnad Ahmad 1415, Book 7, Hadith 11","grade":"Hasan because of corroborating evidence and Da'if (Darussalam)](Darussalam)","question #":"question #4","question":"What are the cultural or religious implications of maintaining one's appearance according to Islamic tradition?","id":"ahmad-7-104"},{"hadith-eng":"We came from Liyyah with the Messenger of Allah (ﷺ) and when we reached Sidrah, the Messenger of Allah (ﷺ) stood at one side of Qarnul-Aswad, facing it, then he turned his gaze towards Nakhibah (i.e., a valley) and he waited until all the people had stopped too. Then he said: `Hunting in Wajj and cutting down its plants is haram; it is sacred to Allah.” That was before he came to at-Ta`if and besieged Thaqeef.","reference":"Musnad Ahmad 1416, Book 7, Hadith 12","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #4","question":"What is the historical context of the Prophet's journey to at-Ta'if and the siege of Thaqeef?","id":"ahmad-7-105"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say one day: `Paradise is due to Talhah,` when he did what he did for the Messenger of Allah (ﷺ)(i.e., when Talhah leaned down and the Messenger of Allah (ﷺ) climbed on his back.)","reference":"Musnad Ahmad 1417, Book 7, Hadith 13","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #4","question":"What is the significance of the Prophet Muhammad (ﷺ) acknowledging someone's actions with a promise of Paradise?","id":"ahmad-7-106"},{"hadith-eng":"My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.","reference":"Musnad Ahmad 1418, Book 7, Hadith 14","grade":"Lts isnad is Hasan](Darussalam)","question #":"question #4","question":"What did Safiyyah bring for her brother Hamzah after hearing about his death?","id":"ahmad-7-107"},{"hadith-eng":"’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”","reference":"Musnad Ahmad 1419, Book 7, Hadith 15","grade":"Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)](Darussalam)","question #":"question #4","question":"What does the reaction of the Ansari man reveal about human emotions in conflict resolution?","id":"ahmad-7-108"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: `This land is the land of Allah and the people are the slaves of Allah, so wherever you find something good, stay there.`","reference":"Musnad Ahmad 1420, Book 7, Hadith 16","grade":"Lts isnad is Da'if](Darussalam)","question #":"question #4","question":"How can one determine where to settle based on the advice given in this narration?","id":"ahmad-7-109"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) recite this verse when he was in ‘Arafah: `Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise” (Surah AI-‘Imran [3:18]). And I am one of the witnesses to that, O Lord.”","reference":"Musnad Ahmad 1421, Book 7, Hadith 17","grade":"Da'if (Darussalam) like the previous report](Darussalam)","question #":"question #4","question":"How is justice maintained by Allah according to this verse?","id":"ahmad-7-110"},{"hadith-eng":"By Allah, it is as if we can see az-Zubair bin al-`Awwam (رضي الله عنه) when he came to us on a white mule of his and said: “O Umm ‘Ata, the Messenger of Allah (ﷺ) has forbidden the Muslims to eat from the meat of their sacrifices after three days.” I said: “May my father be sacrificed for you! What should we do with that which has been given to us?” He said: “As for what has been given to you, it is up to you.”","reference":"Musnad Ahmad 1422, Book 7, Hadith 18","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #4","question":"What is the significance of az-Zubair bin al-`Awwam's mode of transportation in this narration?","id":"ahmad-7-111"},{"hadith-eng":"On the day of al-Ahzab, `Umar bin Abi Salamah and I were put with the women. I looked out and saw az-Zubair on his horse, coming and going from Banu Quraizah two or three times. When he came back I said: “O my father, I saw you coming and going.” He said: “Did you see me, O my son?” I said: “Yes.” He said: “The Messenger of Allah (ﷺ) said: `Who would like to go to Banu Quraizah and bring me news of them?` So I set out and when I came back, the Messenger of Allah (ﷺ) mentioned both his father and his mother for me and said: `May my father and mother be sacrificed for you.”","reference":"Musnad Ahmad 1423, Book 7, Hadith 19","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #4","question":"What can be learned about the responsibilities of companions during the time of the Prophet (ﷺ)?","id":"ahmad-7-112"},{"hadith-eng":"When we conquered Egypt without a peace deal (i.e., by force), az-Zubair bin al-`Awwam (رضي الله عنه) stood up and said: “O `Amr bin al `As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair (رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameer al-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah.","reference":"Musnad Ahmad 1424, Book 7, Hadith 20","grade":"Da'if (Darussalam) [](Darussalam)","question #":"question #4","question":"What role did consultation with leaders play in decision-making during the early Islamic conquests?","id":"ahmad-7-113"},{"hadith-eng":"It was narrated from al Mundhir bin az-Zubair (رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse.","reference":"Musnad Ahmad 1425, Book 7, Hadith 21","grade":"Hasan because of corroborating evidence and this is a Da'if isnad, Fulaih is unknown](Darussalam)","question #":"question #4","question":"How does this narration reflect the Prophet's (ﷺ) approach to fairness and justice?","id":"ahmad-7-114"},{"hadith-eng":"A man came to az-Zubair bin al-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”\n\nAl-Hasan said:  A man came to az-Zubair bin al-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)","reference":"Musnad Ahmad 1426, 1427, Book 7, Hadith 22","grade":"Sahih], Sahih](Darussalam)","question #":"question #4","question":"What role does loyalty and protection play in the relationships among the companions of the Prophet (ﷺ)?","id":"ahmad-7-115"},{"hadith-eng":"I said to my father, az-Zubair bin al-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`","reference":"Musnad Ahmad 1428, Book 7, Hadith 23","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #4","question":"How does the fear of punishment in the afterlife influence the behavior of early Muslims in narrating hadiths?","id":"ahmad-7-116"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “For one of you to take a rope and go to the mountains, then bring a bundle of firewood on his back and sell it, and make himself independent of means thereby, is better for him than to ask of people, whether they give him something or not.”","reference":"Musnad Ahmad 1429, Book 7, Hadith 24","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #4","question":"Why is earning a livelihood through one's own efforts emphasized in Islamic teachings?","id":"ahmad-7-117"},{"hadith-eng":"“There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eesh bin al-Waleed that a freed slave of the family of az-Zubair told him that az-Zubair (رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair (رضي الله عنه) that az-Zubair bin al-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,","reference":"Musnad Ahmad 1430, 1431, 1432, Book 7, Hadith 25","grade":"Da'if (Darussalam)], See the previous report], See the previous report](Darussalam)","question #":"question #4","question":"What practice is recommended to foster love and belief among individuals in a community?","id":"ahmad-7-118"},{"hadith-eng":"A man said to az-Zubair: “Shall I kill `Ali for you?” He said: “How would you kill him?” He said: “I will assassinate him.”He said: “No, the Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.`","reference":"Musnad Ahmad 1433, Book 7, Hadith 26","grade":"Sahih](Darussalam)","question #":"question #4","question":"What is the relationship between faith and moral conduct in Islam?","id":"ahmad-7-119"},{"hadith-eng":"When this surah was revealed to the Messenger of Allah (ﷺ): `Verily, you (O Muhammad is) will die, and verily, they (too) will die. Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:30,31]), az-Zubair said: “O Messenger of Allah, will we face again the disputes we had among us in this world in addition to other sins?” He said: “Yes, you will face these disputes again until everyone who has a right has been given his right.” AzZubair said: “By Allah, the matter is very serious.”","reference":"Musnad Ahmad 1434, Book 7, Hadith 27","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #4","question":"What concerns did az-Zubair express regarding disputes and sins in the afterlife?","id":"ahmad-7-120"},{"hadith-eng":"I heard ‘lkrimah (recite): “And (remember) when We sent towards you (Muhammad (ﷺ)” and it was recited to Sufyan from az-Zubair, `a group (three to ten persons) of the jinn, (quietly) listening to the Qur`an` (al-Ahqaf [46:29]). He said: “[That was] in Nakhlah. The Messenger of Allah (ﷺ) was praying Isha`, and they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s (ﷺ) recitation)” (al-Jinn [72:19]). Sufyan said: “They were one above the other, like thick masses of clouds one above the other.”","reference":"Musnad Ahmad 1435, Book 7, Hadith 28","grade":"Hasan because of corroborating evidence and Da'if (Darussalam) because it is interrupted between Ikrimah and Az-Zubair](Darussalam)","question #":"question #4","question":"What can be inferred about the setting and atmosphere when the jinn listened to the Prophet Muhammad (ﷺ) reciting the Qur'an?","id":"ahmad-7-121"},{"hadith-eng":"Someone who heard him told me that az-Zubair bin al ‘Awwam (رضي الله عنه) said: “We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1436, Book 7, Hadith 29","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because the chain between Muslim bin Jundab and Az-Zubair is unknown)(Darussalam)","question #":"question #4","question":"What does this narration reveal about the companions' dedication to attending Jumu'ah prayer despite environmental challenges?","id":"ahmad-7-122"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to address us and remind us of the annals of Allah, until we could see that on his face (because of alarm). It was as if he was warning people against an enemy that would attack them in the morning. If he had just recently met with Jibreel, he would not smile until Jibreel had departed from him.","reference":"Musnad Ahmad 1437, Book 7, Hadith 30","grade":"Hasan (Darussalam)(Darussalam)","question #":"question #4","question":"How did the Prophet's (ﷺ) demeanor change after receiving revelations?","id":"ahmad-7-123"},{"hadith-eng":"This verse was revealed when we were present with the Messenger of Allah (ﷺ) : `And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people)`. (al-Anfal [8:25]). We started saying: “What is this fitnah? And we never thought that it would happen as it did.”","reference":"Musnad Ahmad 1438, Book 7, Hadith 31","grade":"This hadeeth is Jayyid(Darussalam)","question #":"question #4","question":"Why is it important to be aware of trials and afflictions in society?","id":"ahmad-7-124"},{"hadith-eng":"When the verse, `Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:31]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), (is this) in addition to our disputes in this world?” He said: `Yes.` When the verse, `Then on that Day you shall be asked about the delights (you indulged in, in this world)” (at-Takathur [102:8]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), what delights will we be asked about? All we have is the two black ones - dates and water.” He said: `This will certainly take place.”","reference":"Musnad Ahmad 1405, Book 7, Hadith 1","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #5","question":"What does the term 'two black ones' refer to in the context of this narration?","id":"ahmad-7-125"},{"hadith-eng":"I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, az-Zubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist (Sufyan said on one occasion: by Whose leave heaven and earth exist), do you know that the Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from; what we leave behind is charity`. They said: “By Allah, yes.”","reference":"Musnad Ahmad 1406, Book 7, Hadith 2","grade":"Sahih (Darussalam), al-Bukhari (3094) and Muslim (1757) without mentioning Talhah](Darussalam)","question #":"question #5","question":"What is the importance of consensus among companions in verifying a hadith?","id":"ahmad-7-126"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “Verily, for a man to carry a rope and gather firewood, then come and sell it in the marketplace and make himself independent of means thereby, so that he can spend on his (needs), is better than him asking people, whether they give him anything or not.”","reference":"Musnad Ahmad 1407, Book 7, Hadith 3","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #5","question":"What lessons can be learned about dignity and self-sufficiency from this teaching?","id":"ahmad-7-127"},{"hadith-eng":"The Messenger of Allah (ﷺ) mentioned both of his parents together for me on the Day of ‘Uhud (i.e., in the phrase “may my father and mother be sacrificed for you`.]","reference":"Musnad Ahmad 1408, Book 7, Hadith 4","grade":"Sahih (Darussalam) according to the conditions of al Bukhari and Muslim](Darussalam)","question #":"question #5","question":"What is the historical significance of the Battle of Uhud in Islamic history?","id":"ahmad-7-128"},{"hadith-eng":"On the day of al-Khandaq, `Umar bin Abi Salamah and I were in the fort where the wives of the Messenger of Allah (ﷺ) were, the fort of Hassan. He would lift me up and I would lift him up. When he lifted me up, I saw my father go past on his way to Quraizah, as he was fighting alongside the Messenger of Allah (ﷺ) on the day of al-Khandaq. He said: “Who will go to Banu Quraizah and fight them?” I said to him when he came back: “O my father, I recognized you when you were going to Banu Quraizah.” He said: “O my son, by Allah, the Messenger of Allah(ﷺ) mentioned both his parents together for me when he said: May my father and mother be sacrificed for you.`","reference":"Musnad Ahmad 1409, Book 7, Hadith 5","grade":"Sahih (Darussalam), al Bukhari (3720) and Muslim (2416)](Darussalam)","question #":"question #5","question":"What does the interaction between Abdullah bin az-Zubair and his father reveal about family relationships in early Islamic society?","id":"ahmad-7-129"},{"hadith-eng":"It was narrated from az-Zubair bin al-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it.","reference":"Musnad Ahmad 1410, Book 7, Hadith 6","grade":"Lts isnad is Sahih](Darussalam)","question #":"question #5","question":"What lessons can be learned about the intentions behind giving and receiving in charitable acts?","id":"ahmad-7-130"},{"hadith-eng":"We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1411, Book 7, Hadith 7","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because it is interrupted](Darussalam)","question #":"question #5","question":"How does this narration reflect the simplicity of life during the Prophet's (ﷺ) era?","id":"ahmad-7-131"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer) that shaves (destroys) religious commitment; it does not shave hair. By the One in Whose Hand is the soul of Muhammad, you will not believe until you love one another. Shall I not tell you something which, if you do it, you will love one another? Spread (the greeting of) salam amongst yourselves.”","reference":"Musnad Ahmad 1412, Book 7, Hadith 8","grade":"The Hadeeth is Hasan because of corroborating evidence and its isnad is interrupted](Darussalam)","question #":"question #5","question":"What is the metaphorical meaning of 'shaver' in the context of religious commitment?","id":"ahmad-7-132"},{"hadith-eng":"I said to az-Zubair (رضي الله عنه): “Why don`t I hear you narrating from the Messenger of Allah (ﷺ) as I hear Ibn Mas`ood and so and so, and so and so?” He said: “I never left him since I became Muslim, but I heard something from him: `Whoever tells a lie about me deliberately, let him take his place in Hell.””","reference":"Musnad Ahmad 1413, Book 7, Hadith 9","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #5","question":"What can be inferred about the relationship between az-Zubair and the Prophet (ﷺ) from this narration?","id":"ahmad-7-133"},{"hadith-eng":"We said to az-Zubair (رضي الله عنه): “O Abu `Abdullah, what brought you here? You let the caliph down until he was killed, then you came seeking vengeance for him?” Az-Zubair (رضي الله عنه) said: “At the time of the Prophet (ﷺ), Abu Bakr, `Umar and `Uthman and me, we read the verse: “And fear the Fitnah (affliction and trial) which affects not in particular (only those) of you who do wrong (but it may afflict all the good and the bad people).” [al-Anfal 8:25]. But we never knew that it referred to us until the turmoil befell us.”","reference":"Musnad Ahmad 1414, Book 7, Hadith 10","grade":"Its isnad is Jayyid](Darussalam)","question #":"question #5","question":"What role does reflection on past events play in shaping one's understanding of religious teachings?","id":"ahmad-7-134"},{"hadith-eng":"We came from Liyyah with the Messenger of Allah (ﷺ) and when we reached Sidrah, the Messenger of Allah (ﷺ) stood at one side of Qarnul-Aswad, facing it, then he turned his gaze towards Nakhibah (i.e., a valley) and he waited until all the people had stopped too. Then he said: `Hunting in Wajj and cutting down its plants is haram; it is sacred to Allah.” That was before he came to at-Ta`if and besieged Thaqeef.","reference":"Musnad Ahmad 1416, Book 7, Hadith 12","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #5","question":"How does the concept of haram apply to geographical locations in Islamic teachings?","id":"ahmad-7-135"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say one day: `Paradise is due to Talhah,` when he did what he did for the Messenger of Allah (ﷺ)(i.e., when Talhah leaned down and the Messenger of Allah (ﷺ) climbed on his back.)","reference":"Musnad Ahmad 1417, Book 7, Hadith 13","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #5","question":"How does the relationship between the Prophet Muhammad (ﷺ) and his companions illustrate loyalty and support?","id":"ahmad-7-136"},{"hadith-eng":"My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.","reference":"Musnad Ahmad 1418, Book 7, Hadith 14","grade":"Lts isnad is Hasan](Darussalam)","question #":"question #5","question":"How was the decision made to distribute the shrouds between Hamzah and the Ansari?","id":"ahmad-7-137"},{"hadith-eng":"’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”","reference":"Musnad Ahmad 1419, Book 7, Hadith 15","grade":"Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)](Darussalam)","question #":"question #5","question":"How does this incident relate to the Quranic verse about accepting the Prophet's (ﷺ) decisions with full submission?","id":"ahmad-7-138"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: `This land is the land of Allah and the people are the slaves of Allah, so wherever you find something good, stay there.`","reference":"Musnad Ahmad 1420, Book 7, Hadith 16","grade":"Lts isnad is Da'if](Darussalam)","question #":"question #5","question":"What is the significance of finding 'something good' in a place according to this teaching?","id":"ahmad-7-139"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) recite this verse when he was in ‘Arafah: `Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise” (Surah AI-‘Imran [3:18]). And I am one of the witnesses to that, O Lord.”","reference":"Musnad Ahmad 1421, Book 7, Hadith 17","grade":"Da'if (Darussalam) like the previous report](Darussalam)","question #":"question #5","question":"What is the importance of being a witness to the oneness of Allah in Islam?","id":"ahmad-7-140"},{"hadith-eng":"By Allah, it is as if we can see az-Zubair bin al-`Awwam (رضي الله عنه) when he came to us on a white mule of his and said: “O Umm ‘Ata, the Messenger of Allah (ﷺ) has forbidden the Muslims to eat from the meat of their sacrifices after three days.” I said: “May my father be sacrificed for you! What should we do with that which has been given to us?” He said: “As for what has been given to you, it is up to you.”","reference":"Musnad Ahmad 1422, Book 7, Hadith 18","grade":"Da'if (Darussalam)](Darussalam)","question #":"question #5","question":"How does this narration illustrate the communication of religious instructions among early Muslims?","id":"ahmad-7-141"},{"hadith-eng":"On the day of al-Ahzab, `Umar bin Abi Salamah and I were put with the women. I looked out and saw az-Zubair on his horse, coming and going from Banu Quraizah two or three times. When he came back I said: “O my father, I saw you coming and going.” He said: “Did you see me, O my son?” I said: “Yes.” He said: “The Messenger of Allah (ﷺ) said: `Who would like to go to Banu Quraizah and bring me news of them?` So I set out and when I came back, the Messenger of Allah (ﷺ) mentioned both his father and his mother for me and said: `May my father and mother be sacrificed for you.”","reference":"Musnad Ahmad 1423, Book 7, Hadith 19","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #5","question":"How were children and women protected during times of conflict in early Islamic history?","id":"ahmad-7-142"},{"hadith-eng":"When we conquered Egypt without a peace deal (i.e., by force), az-Zubair bin al-`Awwam (رضي الله عنه) stood up and said: “O `Amr bin al `As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair (رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameer al-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah.","reference":"Musnad Ahmad 1424, Book 7, Hadith 20","grade":"Da'if (Darussalam) [](Darussalam)","question #":"question #5","question":"How did the early Muslim leaders ensure the welfare of future generations in their governance?","id":"ahmad-7-143"},{"hadith-eng":"It was narrated from al Mundhir bin az-Zubair (رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse.","reference":"Musnad Ahmad 1425, Book 7, Hadith 21","grade":"Hasan because of corroborating evidence and this is a Da'if isnad, Fulaih is unknown](Darussalam)","question #":"question #5","question":"What can be inferred about the role of family and animals in the distribution of resources?","id":"ahmad-7-144"},{"hadith-eng":"A man came to az-Zubair bin al-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”\n\nAl-Hasan said:  A man came to az-Zubair bin al-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)","reference":"Musnad Ahmad 1426, 1427, Book 7, Hadith 22","grade":"Sahih], Sahih](Darussalam)","question #":"question #5","question":"How should a believer respond to suggestions of violence against fellow Muslims?","id":"ahmad-7-145"},{"hadith-eng":"I said to my father, az-Zubair bin al-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`","reference":"Musnad Ahmad 1428, Book 7, Hadith 23","grade":"Sahih (Darussalam)](Darussalam)","question #":"question #5","question":"What can be inferred about the relationship between az-Zubair bin al-Awwam and the Prophet Muhammad (ﷺ) from this narration?","id":"ahmad-7-146"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: “For one of you to take a rope and go to the mountains, then bring a bundle of firewood on his back and sell it, and make himself independent of means thereby, is better for him than to ask of people, whether they give him something or not.”","reference":"Musnad Ahmad 1429, Book 7, Hadith 24","grade":"Sahih (Darussalam), al Bukhari (1471)](Darussalam)","question #":"question #5","question":"What are the ethical implications of seeking assistance from others when one can work?","id":"ahmad-7-147"},{"hadith-eng":"“There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eesh bin al-Waleed that a freed slave of the family of az-Zubair told him that az-Zubair (رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair (رضي الله عنه) that az-Zubair bin al-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,","reference":"Musnad Ahmad 1430, 1431, 1432, Book 7, Hadith 25","grade":"Da'if (Darussalam)], See the previous report], See the previous report](Darussalam)","question #":"question #5","question":"Why is spreading the greeting of salaam important in achieving mutual love and belief?","id":"ahmad-7-148"},{"hadith-eng":"A man said to az-Zubair: “Shall I kill `Ali for you?” He said: “How would you kill him?” He said: “I will assassinate him.”He said: “No, the Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.`","reference":"Musnad Ahmad 1433, Book 7, Hadith 26","grade":"Sahih](Darussalam)","question #":"question #5","question":"How should a believer respond to suggestions of committing acts of violence?","id":"ahmad-7-149"},{"hadith-eng":"When this surah was revealed to the Messenger of Allah (ﷺ): `Verily, you (O Muhammad is) will die, and verily, they (too) will die. Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:30,31]), az-Zubair said: “O Messenger of Allah, will we face again the disputes we had among us in this world in addition to other sins?” He said: “Yes, you will face these disputes again until everyone who has a right has been given his right.” AzZubair said: “By Allah, the matter is very serious.”","reference":"Musnad Ahmad 1434, Book 7, Hadith 27","grade":"Hasan (Darussalam)](Darussalam)","question #":"question #5","question":"How does the concept of accountability in the afterlife impact the seriousness of disputes and sins in this world?","id":"ahmad-7-150"},{"hadith-eng":"I heard ‘lkrimah (recite): “And (remember) when We sent towards you (Muhammad (ﷺ)” and it was recited to Sufyan from az-Zubair, `a group (three to ten persons) of the jinn, (quietly) listening to the Qur`an` (al-Ahqaf [46:29]). He said: “[That was] in Nakhlah. The Messenger of Allah (ﷺ) was praying Isha`, and they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s (ﷺ) recitation)” (al-Jinn [72:19]). Sufyan said: “They were one above the other, like thick masses of clouds one above the other.”","reference":"Musnad Ahmad 1435, Book 7, Hadith 28","grade":"Hasan because of corroborating evidence and Da'if (Darussalam) because it is interrupted between Ikrimah and Az-Zubair](Darussalam)","question #":"question #5","question":"How does the description of the jinn's formation around the Prophet Muhammad (ﷺ) enhance our understanding of their eagerness to listen?","id":"ahmad-7-151"},{"hadith-eng":"Someone who heard him told me that az-Zubair bin al ‘Awwam (رضي الله عنه) said: “We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.","reference":"Musnad Ahmad 1436, Book 7, Hadith 29","grade":"Sahih because of corroborating evidence; this is a Da'if isnad because the chain between Muslim bin Jundab and Az-Zubair is unknown)(Darussalam)","question #":"question #5","question":"How does this narration reflect the simplicity of the companions' lifestyle during the Prophet's era?","id":"ahmad-7-152"},{"hadith-eng":"The Messenger of Allah (ﷺ) used to address us and remind us of the annals of Allah, until we could see that on his face (because of alarm). It was as if he was warning people against an enemy that would attack them in the morning. If he had just recently met with Jibreel, he would not smile until Jibreel had departed from him.","reference":"Musnad Ahmad 1437, Book 7, Hadith 30","grade":"Hasan (Darussalam)(Darussalam)","question #":"question #5","question":"What does the Prophet's (ﷺ) interaction with Jibreel indicate about the nature of divine communication?","id":"ahmad-7-153"},{"hadith-eng":"This verse was revealed when we were present with the Messenger of Allah (ﷺ) : `And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people)`. (al-Anfal [8:25]). We started saying: “What is this fitnah? And we never thought that it would happen as it did.”","reference":"Musnad Ahmad 1438, Book 7, Hadith 31","grade":"This hadeeth is Jayyid(Darussalam)","question #":"question #5","question":"How does the concept of fitnah relate to communal responsibility in Islam?","id":"ahmad-7-154"},{"hadith-eng":"My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.","reference":"Musnad Ahmad 1418, Book 7, Hadith 14","grade":"Lts isnad is Hasan](Darussalam)","question #":"question #6","question":"What does this narration teach about fairness and equality in dealing with the deceased?","id":"ahmad-7-155"},{"hadith-eng":"’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”","reference":"Musnad Ahmad 1419, Book 7, Hadith 15","grade":"Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)](Darussalam)","question #":"question #6","question":"What lessons can be learned about fairness and justice from the Prophet Muhammad's (ﷺ) handling of this situation?","id":"ahmad-7-156"}]