{"number":20,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Ta-ha"},{"number":2,"text":"WIR sandten dir den Quran nicht hinab, damit du dich erschöpfst"},{"number":3,"text":"Es ist nur eine Erinnerung für diejenigen, die Ehrfurcht haben"},{"number":4,"text":"(Er ist) eine sukzessive Hinabsendung von Demjenigen, Der die Erde und die hohen Himmel erschuf"},{"number":5,"text":"ER ist Der Allgnade Erweisende, Der über Al'ahrsch komplett herrschte"},{"number":6,"text":"Ihm gehört, was in den Himmeln, was auf Erden, was zwischen beiden und was unter der Erde ist"},{"number":7,"text":"Und solltest du das Gesagte laut sprechen, so kennt ER doch das Geheimnis und das noch Verborgenere"},{"number":8,"text":"ALLAH, es gibt keine Gottheit außer Ihm! Ihm gebühren die schönsten Namen"},{"number":9,"text":"Und wurde dir die Begebenheit von Musa etwa nicht zuteil"},{"number":10,"text":"Nachdem er Feuer gesehen hatte, sagte er seiner Familie: \"Bleibt! Ich sah Feuer, vielleicht bringe ich euch davon Feuerbrand oder finde beim Feuer (jemanden, der) mich rechtleitet"},{"number":11,"text":"Und als er daran war, wurde gerufen: \"Musa"},{"number":12,"text":"Gewiß, ICH bin dein HERR, so ziehe deine Schuhe aus, denn du bist gewiß im rein gehaltenen Tal Tuwa"},{"number":13,"text":"Und ICH habe dich erwählt, so höre dem zu, was als Wahy erteilt wird"},{"number":14,"text":"Gewiß, ICH bin ALLAH. Keine Gottheit existiert, es sei denn ICH, so diene Mir und verrichte ordnungsgemäß das rituelle Gebet zu Meinem Gedenken"},{"number":15,"text":"Zweifellos, die Stunde ist im Kommen. Beinahe werde ICH sie enthüllen, damit jeder Seele nach ihrem Bestreben vergolten wird"},{"number":16,"text":"So soll dich von ihr nicht abwenden derjenige, der an sie keinen Iman verinnerlicht und seinen Neigungen folgt, sonst gehst du zugrunde"},{"number":17,"text":"Und was ist dies in deiner Rechten, Musa"},{"number":18,"text":"Er sagte: \"Es ist mein Stock, auf den stütze ich mich und mit ihm treibe ich meine Schafe zusammen. Und damit habe ich noch andere Verwendung"},{"number":19,"text":"ER sagte: \"Wirf ihn hin, Musa"},{"number":20,"text":"Sogleich warf er ihn hin, und er wurde zu einer Schlange, die umherglitt"},{"number":21,"text":"ER sagte: \"Nimm sie auf und fürchte dich nicht! WIR werden sie in ihre vorherige Gestalt zurückverwandeln"},{"number":22,"text":"Und führe deine Hand zu deiner Seite heran, kommt sie hell unversehrt heraus als eine zweite Aya"},{"number":23,"text":"damit WIR dir manche von Unseren großen Ayat zeigen"},{"number":24,"text":"Gehe zu Pharao, gewiß beging er äußerstes Übertreten"},{"number":25,"text":"Er sagte: \"Mein HERR! Entspanne mir meine Brust"},{"number":26,"text":"erleichtere mir meine Angelegenheit"},{"number":27,"text":"und entknote eines Knotens meine Zunge"},{"number":28,"text":"damit sie mein Gesagtes begreifen"},{"number":29,"text":"Und ernenne mir einen Assistenten von meiner Familie"},{"number":30,"text":"Harun, meinen Bruder"},{"number":31,"text":"stärke mich mit ihm"},{"number":32,"text":"und beteilige ihn an meiner Angelegenheit"},{"number":33,"text":"damit wir Dich viel lobpreisen"},{"number":34,"text":"und dir viel gedenken"},{"number":35,"text":"Gewiß, DU bist uns immer allsehend"},{"number":36,"text":"ER sagte: \"Bereits wurde dir deine Bitte gewährt, Musa"},{"number":37,"text":"Und gewiß, bereits erwiesen WIR dir ein anderes Mal Wohltaten"},{"number":38,"text":"als WIR deiner Mutter Wahy zuteil werden ließen von dem, was als Wahy erteilt wird"},{"number":39,"text":"Lege ihn in die Holzkiste, dann wirf sie in den Fluß, dann wird der Fluß sie ans Ufer spülen, dann nimmt ihn ein Feind von Mir und ein Feind von ihm.\" Und ICH machte dich beliebt und damit du unter Meiner Aufsicht erzogen wirst"},{"number":40,"text":"(Und erinnere daran), als deine Schwester vorbeiging und sagte: \"Soll ich euch jemanden zeigen, der ihn betreuen kann?\" Dann brachten WIR dich zu deiner Mutter zurück, damit sie fröhlich und nicht traurig wird. Und du hast einen Menschen getötet, dann retteten WIR dich von der Betrübnis und ließen dich mehreren Fitnas unterziehen, dann bist du (einige) Jahre bei den Leuten von Madyan geblieben. Dann kamst du der Bestimmung nach, Musa"},{"number":41,"text":"Und ICH habe dich für Mich auserwählt"},{"number":42,"text":"Gehe du und dein Bruder mitMeinen Ayat und laßt nicht mit Meinem Gedenken nach"},{"number":43,"text":"Geht beide zu Pharao, denn gewiß, er beging äußerste Übertretungen"},{"number":44,"text":"dann sagt ihm ein mildes Wort, damit er sich erinnert oder sich fürchtet"},{"number":45,"text":"Beide sagten: \"Unser HERR! Gewiß, wir fürchten, daß er uns mit Bösem ereilt oder daß er äußerste Übertretungen begeht"},{"number":46,"text":"ER sagte: \"Fürchtet euch beide nicht! Gewiß, ICH bin mit euch beiden, ICH höre und sehe"},{"number":47,"text":"So geht beide zu ihm, dann sagt beide: \"Wir sind beide die Gesandten deines HERRN, so schicke mit uns die Kinder Israils und peinige sie nicht! Bereits brachten wir dir eine Aya von deinem HERRN. Und Salam sei auf demjenigen, welcher der Rechtleitung folgt"},{"number":48,"text":"Gewiß, uns wurde bereits als Wahy zuteil, daß die Peinigung doch dem bestimmt ist, der leugnet und sich abwendet"},{"number":49,"text":"Er sagte: \"Wer ist denn euer HERR, Musa"},{"number":50,"text":"Er sagte: \"Unser HERR ist Derjenige, Der jeder Sache ihre Gestalt verliehen hat, dann Rechtleitung erwies"},{"number":51,"text":"Er sagte: \"(Und) was ist denn mit den früheren Generationen"},{"number":52,"text":"Er sagte: \"Das Wissen über sie ist bei meinem HERRN in einem Register. Weder irrt Mein HERR noch vergißt ER"},{"number":53,"text":"ER ist Derjenige, Der euch die Erde als Unterlage machte, für euch darin Wege bahnte und vom Himmel Wasser fallen ließ, mit dem WIR Paare von vielfältigen Pflanzen hervorbrachten"},{"number":54,"text":"Esst und lasst eure An'am weiden! Gewiß, darin sind doch Ayat für die Verständigen"},{"number":55,"text":"Aus ihr erschufen WIR euch und in sie bringen WIR euch zurück und aus ihr bringen WIR euch noch einmal hervor"},{"number":56,"text":"Und gewiß, bereits zeigten WIR ihm alle Unsere Ayat, dann leugnete er und lehnte sie ab"},{"number":57,"text":"Er sagte: \"Bist du etwa zu uns gekommen, Musa! - mit deiner Magie, damit du uns von unserem Land vertreibst"},{"number":58,"text":"also sicher werden wir dir gleichwertige Magie entgegensetzen, so lege zwischen uns und dir einen Termin fest, den weder wir noch du versäumen, an einem (uns) bekannten Ort"},{"number":59,"text":"Er sagte: \"Euer Termin ist der Tag der Festlichkeit. Und die Menschen sollen am Vormittag versammelt werden"},{"number":60,"text":"Dann wandte Pharao sich ab und sammelte sein Listzeug zusammen, dann kam er"},{"number":61,"text":"Musa sagte ihnen: \"Euer Untergang! Erfindet im Namen ALLAHs keine Lügen, sonst richtet ER euch mit einer Peinigung zugrunde. Und bereits versagen wird derjenige, der etwas erdichtet"},{"number":62,"text":"Und sie waren in ihrer Angelegenheit uneins und verheimlichten ihre Unterredung"},{"number":63,"text":"Sie sagten: \"Diese beiden sind sicherlich Magier, die euch aus eurem Land mit ihrer Magie vertreiben wollen und eure ideale Lebensweise annullieren"},{"number":64,"text":"Also kommt in eurer List überein, dann kommt in Reihe. Und bereits ist erfolgreich an diesem Tag, wer die Oberhand gewinnt"},{"number":65,"text":"Sie sagten: \"Musa! Entweder wirfst du, oder werden wir die ersten sein, die werfen"},{"number":66,"text":"Er sagte: \"Nein, sondern werft (ihr)!\" Und da erschienen ihm ihre Seile und Stöcke durch ihreMagie, als würden sie umhergleiten"},{"number":67,"text":"Dann ängstigte sich insgeheim, Musa"},{"number":68,"text":"WIR sagten: \"Fürchte dich nicht! Gewiß, du gewinnst die Oberhand"},{"number":69,"text":"Und wirf das, was in deiner Rechten ist, es verschlingt alles, was sie bewerkstelligten! Sie bewerkstelligten doch nur eine List eines Magiers. Und der Magier wird nie erfolgreich sein, überall wo er hinkommt"},{"number":70,"text":"So vollzogen die Magier Sudschud, sie sagten: \"Wir bekundeten den Iman an Den HERRN von Harun und Musa"},{"number":71,"text":"Er (Pharao) sagte: \"Habt ihr etwa den Iman bekundet, bevor ich euch die Zustimmung dazu gab? Gewiß, er ist doch euer Lehrmeister, der euch die Magie beibrachte. Abschneiden werde ich doch eure Hände und Füße wechselseitig und kreuzigen werde ich euch gewiß an die Stämme der Dattelpalmen. Und ihr werdet zweifelsohne noch in Erfahrung bringen, welcher von uns über die qualvollere und dauerhaftere Peinigung verfügt"},{"number":72,"text":"Sie sagten: \"Wir werden dich auf keinen Fall vor dem bevorzugen, was zu uns an eindeutigen Zeichen kam, und nicht vor Dem, Der uns erschuf. Also urteile, was du urteilst! Du fällst ein Urteil doch nur über dieses diesseitige Leben"},{"number":73,"text":"Gewiß, wir verinnerlichten den Iman an unseren HERRN, damit ER uns unsere Verfehlungen vergibt und das, wozu du uns an Magie gezwungen hast. Und ALLAH ist besser und bleibender"},{"number":74,"text":"Gewiß, wer zu seinem HERRN als schwer Verfehlender kommt, für den ist Dschahannam bestimmt, darin weder stirbt, noch lebt er"},{"number":75,"text":"Und wer zu Ihm als Mumin kommt, wobei er gottgefällig Gutes tat, für diese sind die hohen Ränge bestimmt"},{"number":76,"text":"die 'Adn-Dschannat, die von Flüssen durchflossen sind. Darin werden sie ewig bleiben. Und dies ist die Belohnung für denjenigen, der sich rein hält"},{"number":77,"text":"Und gewiß, bereits ließen WIR Musa Wahy zuteil werden: \"Brich nachts auf mit Meinen Dienern, dann schlage ihnen einen getrockneten Weg ins Meer! Habe keine Angst vor Verfolgung und fürchte dich nicht"},{"number":78,"text":"Dann verfolgte sie Pharao mit seinen Soldaten, dann überschwemmte sie vom Fluß, was sie überschwemmte"},{"number":79,"text":"Und Pharao verleitete seine Leute und leitete sie nicht recht"},{"number":80,"text":"Kinder Israils! WIR erretteten euch bereits von eurem Feind, verabredeten Uns mit euch an der rechten Seite des Tur-Bergs und ließen euch Al-mann und As-salwa zuteil werden"},{"number":81,"text":"Esst von den Tay-yibat vom Rizq, das WIR euch gewährten, und begeht darin keine Übertretungen, sonst widerfährt euch Mein Zorn. Und wem Mein Zorn widerfährt, ist bereits zugrunde gerichtet"},{"number":82,"text":"Und gewiß, ICH bin bestimmt allvergebend für denjenigen, der reuig wurde, den Iman verinnerlichte, gottgefällig Gutes tat und dann Rechtleitung fand"},{"number":83,"text":"Und was ließ dich hier vor deinen Leuten sein, Musa"},{"number":84,"text":"Er sagte: \"Sie sind da, sie folgen meinen Spuren. Und ich eilte zu Dir, mein HERR! - damit du (mir) Wohlgefallen erweist"},{"number":85,"text":"ER sagte: \"WIR ließen doch deine Leute nach dir der Fitna aussetzen. Und As-samiri verleitete sie"},{"number":86,"text":"Dann kehrte Musa zu seinen Leuten zurück, wütend und traurig. Er sagte: \"Meine Leute! Machte euch euer HERR etwa nicht ein schönes Versprechen?! War euch die vereinbarte Zeit zu lange, oder wolltet ihr, daß euch Zorn von eurem HERRN widerfährt, dann habt ihr das Versprechen mir gegenüber gebrochen"},{"number":87,"text":"Sie sagten: \"Wir brachen das Versprechen dir gegenüber nicht aus eigener Kraft. Auf uns wurden aber Schwerlastende von dem Schmuck der Leute gelegt, dann warfen wir sie (ins Feuer).\" Und solcherart warf ebenfalls As-samiri"},{"number":88,"text":"Dann brachte er ihnen hervor ein Kalb, einen Körper mit Gebrüll. Dann sagten sie: \"Dies ist euer Gott und Musas Gott. Er vergaß es jedoch"},{"number":89,"text":"Sehen sie etwa nicht, daß es ihnen nichts Gesagtes erwidert, und daß es ihnen weder zu schaden noch zu nützen vermag"},{"number":90,"text":"Und gewiß, bereits sagte Harun zu ihnen vorher: \"Meine Leute! Ihr wurdet mit ihm nur der Fitna ausgesetzt. Und euer HERR ist gewiß Der Allgnade Erweisende. Also folgt mir und gehorcht meiner Anweisung"},{"number":91,"text":"Sie sagten: \"Wir lassen es nicht, ihm Zuwendung zu erweisen, bis Musa zu uns zurückkehrt"},{"number":92,"text":"Er sagte: \"Harun! Was hinderte dich daran, nachdem du gesehen hattest, daß sie irregingen"},{"number":93,"text":"mir zu folgen? Hast du etwa dich gegen meine Anweisung widersetzt"},{"number":94,"text":"Er sagte: \"Sohn meiner Mutter! Zerre weder an meinem Bart, noch an meinem Kopf! Gewiß, ich fürchtete, du würdest sagen: \"Du hast die Kinder Israils gespalten und nicht auf meine Anweisung gewartet"},{"number":95,"text":"Er sagte: \"Was ist dein Bestreben, Samiri"},{"number":96,"text":"Er sagte: \"Ich nahm wahr, was sie nicht wahrnahmen, dann griff ich eine Handvoll von der Spur des Entsandten, dann warf ich sie hinein. Und solcherart machte es mir meine Seele leicht"},{"number":97,"text":"Er sagte: \"Geh! Denn dir ist in diesem Leben gewährt zu sagen: \"Keine Berührung!\" Und gewiß, für dich ist noch ein Versprechen bestimmt, das dir gegenüber nicht gebrochen wird. Und schau deinen Gott an, dem du ständig Zuwendung erwiesen hast, wir werden es zweifelsohne verbrennen, dann werden wir es gewiß in den Fluß streuen"},{"number":98,"text":"Euer Gott ist nur ALLAH, Derjenige, außer Ihm es keine Gottheit gibt. ER umfaßt alles mit Wissen"},{"number":99,"text":"Solcherart berichten WIR dir über Nachrichten von dem, was sich früher ereignete. Und WIR ließen dir von Uns aus eine Ermahnung (den Quran) zuteil werden"},{"number":100,"text":"Wer sich von ihm abwendet, dieser wird gewiß am Tag der Auferstehung eine Schuldenlast tragen"},{"number":101,"text":"Darin werden sie ewig bleiben. Und erbärmlich ist es für sie am Tag der Auferstehung als Schuldenlast"},{"number":102,"text":"am Tag, wenn in As-sur geblasen wird. Und WIR versammeln die schwer Verfehlenden an diesem Tag als Zurq"},{"number":103,"text":"Sie flüstern zueinander: \"Ihr habt doch nur zehn Tage verweilt"},{"number":104,"text":"WIR wissen besser, was sie sagen, wenn derjenige, der über die beste Denkart verfügt, sagt: \"Ihr habt doch nur einen Tag verweilt"},{"number":105,"text":"Und sie fragen dich nach den Felsenbergen, dann sag: \"Mein HERR wird sie in (kleinste) Teilchen zerkleinern"},{"number":106,"text":"Dann läßt ER sie zu einer ebenen Fläche werden"},{"number":107,"text":"auf der du weder Unebenheit noch Erhebung siehst"},{"number":108,"text":"An diesem Tag folgen sie dem Rufenden ohne Abweichung. Und die Stimmen verstummen vor Dem Allgnade Erweisenden, dann vernimmst du nichts außer Flüstern"},{"number":109,"text":"An diesem Tag nützt keine Fürsprache, außer (der Fürsprache) desjenigen, dem Der Allgnade Erweisende die Zustimmung gab und von ihm das Gesagte annahm"},{"number":110,"text":"ER kennt das, was vor ihnen und was hinter ihnen liegt. Sie jedoch haben kein umfassendes Wissen über Ihn"},{"number":111,"text":"Und die Gesichter sind geneigt vor Dem Lebendigen, Dem Allverantwortlichen. Und bereits versagte jeder, der Unrecht auf sich lud"},{"number":112,"text":"Doch wer von gottgefällig Gutem tut, während er Mumin ist, der fürchtet weder Ungerechtigkeit noch Minderung"},{"number":113,"text":"Und solcherart sandten WIR ihn hinab als einen arabischen Quran und erläuterten in ihm von der Ermahnung, damit sie Taqwa gemäß handeln und damit er ihnen eine Besinnung bewirkt"},{"number":114,"text":"Und hocherhaben ist ALLAH, Der Allherrschende, Der Wahrhaftigste! Und übereile dich nicht mit der Rezitation des Quran, bevor dir dessen Wahy komplett verkündet wurde. Und sag: \"Mein HERR! Lasse mir noch mehr Wissen zuteil werden"},{"number":115,"text":"Und gewiß, bereits wiesen WIR Adam vorher an, doch er vergaß, und WIR stellten bei ihm keinen Vorsatz fest"},{"number":116,"text":"(Und erinnere daran), als WIR den Engeln sagten: \"Vollzieht Sudschud für Adam!\" Sie vollzogen Sudschud, außer Iblis hat es abgelehnt"},{"number":117,"text":"Dann sagten WIR: \"Adam! Gewiß, dieser ist ein Feind für dich und für deine Gattin. Also lasst ihn nicht euch beide aus der Dschanna herausbringen, sonst mußt du dich mühen"},{"number":118,"text":"Es wird dir gewiß gewährt, daß du darin weder hungerst noch nackt wirst"},{"number":119,"text":"Und daß du darin weder dürstest noch unter Sonnenhitze leidest"},{"number":120,"text":"Dann flüsterte ihm der Satan ein, er sagte: \"Soll ich dir zeigen den Baum der Ewigkeit und eine Herrschaft, die nie vergeht"},{"number":121,"text":"Dann aßen beide von ihm, dann wurde beiden ihre Blöße sichtbar. Und beide begannen, von den Blättern der Dschanna auf sich zu flechten. Und Adam widersetzte sich seinem HERRN, so irrte er"},{"number":122,"text":"Dann erwählte ihn sein HERR, dann vergab ER ihm und leitete ihn recht"},{"number":123,"text":"ER sagte: \"Steigt von ihr, allesamt hinab! Die einen von euch (dieMenschen) sind für die anderen (Satan) Feind. Und wenn euch von Mir Rechtleitung zuteil wird, wer dann Meiner Rechtleitung folgt, der wird weder abirren noch unglücklich werden"},{"number":124,"text":"Und wer sich von Meiner Ermahnung abwendet, für den ist dann ein elendes Leben bestimmt, und WIR werden ihn am Tag der Auferstehung als Blinden zur Versammlung bringen"},{"number":125,"text":"Er sagte: \"Mein HERR! Weshalb bringst DU mich als Blinden zur Versammlung, wo ich doch bereits sehend war"},{"number":126,"text":"ER sagte: \"Solcherart wurden dir Meine Ayat zuteil, dann hast du sie vergessen. Und solcherart wirst du heute in Vergessenheit geraten"},{"number":127,"text":"Und solcherart vergelten WIR dem, der Übertretungen beging und den Iman an die Ayat seines HERRN nicht verinnerlichte. Und die Peinigung des Jenseits ist gewiß noch härter und andauernder"},{"number":128,"text":"Wurde ihnen etwa noch nicht deutlich, wie viele an Generationen vor ihnen WIR zugrunde richteten, durch deren Wohnstätten sie gehen?! Gewiß, darin sind doch Ayat für die Verständigen"},{"number":129,"text":"Und gäbe es kein von deinem HERRN bereits gefälltes Wort und keine festgelegte Frist, wäre es (das Bestrafen) sicherlich notwendig"},{"number":130,"text":"So übe dich in Geduld hinsichtlich dessen, was sie sagen. Und lobpreise mit dem Lob deines HERRN vor Sonnenaufgang und vor ihrem Untergang! Auch während der Nacht lobpreise Ihn und an den Tagesenden, damit du zufrieden wirst"},{"number":131,"text":"Und richte deine Augen nicht auf das, was WIR manchen von ihnen an vergänglichen Verbrauchsgütern als Schmuck des diesseitigen Lebens zur Verfügung stellten, damit WIR sie darin einer Fitna unterziehen. Und das Rizq von deinem HERRN ist noch besser und andauernder"},{"number":132,"text":"Und gebiete deiner Familie das rituelle Gebet und übe dich darin in Geduld. WIR bitten dich nicht um Rizq. WIR gewähren dir Rizq. Und das Anschließende ist für die Taqwa"},{"number":133,"text":"Und sie sagten: \"Würde er doch uns eine Aya von seinem HERRN bringen!\" Kam zu ihnen etwa nicht die Erklärung dessen, was in den früheren Schriften war"},{"number":134,"text":"Und hätten WIR sie mit einer Peinigung vor ihm zugrunde gerichtet, hätten sie gewiß gesagt: \"Unser HERR! Würdest DU uns doch einen Gesandten schicken, dann folgten wir Deinen Ayat, bevor wir erniedrigt und herabgewürdigt werden"},{"number":135,"text":"Sag: \"Jeder wartet, so wartet doch! Ihr werdet noch wissen, welche zu den Weggenossen des geraden Weges gehören und welche Rechtleitung fanden"}]}