{"number":44,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Ha-mim"},{"number":2,"text":"Bei der deutlichen Schrift"},{"number":3,"text":"Gewiß, WIR sandten sie in einer Nacht voller Baraka hinab - Gewiß, WIR waren Warnende"},{"number":4,"text":"in ihr wird jede weise Angelegenheit entschieden"},{"number":5,"text":"(WIR sandten sie hinab), als Angelegenheit von Uns. Gewiß, WIR waren Entsendende"},{"number":6,"text":"eine Gnade von deinem HERRN. Gewiß, ER ist Der Allhörende, Der Allwissende"},{"number":7,"text":"Der HERR der Himmel, der Erde und dessen, was dazwischen ist. Solltet ihr von den Gewißheit-Anstrebenden sein"},{"number":8,"text":"Es gibt keine Gottheit außer Ihm, ER belebt und läßt sterben. ER ist euer HERR und Der HERR eurer ersten Ahnen"},{"number":9,"text":"Nein, sondern sie sind im Zweifel, sie treiben Unfug"},{"number":10,"text":"Also warte auf den Tag, wenn der Himmel mit deutlichem Rauch kommt"},{"number":11,"text":"der die Menschen umhüllt. Dies ist eine qualvolle Peinigung"},{"number":12,"text":"Unser HERR, nimm von uns die Peinigung weg! Gewiß, wir sind Mumin"},{"number":13,"text":"Woher soll denn für sie die Ermahnung sein, und bereits kam zu ihnen ein deutlicher Gesandter"},{"number":14,"text":"Dann wandten sie sich von ihm ab und sagten: \"Er ist belehrt, geistesgestört"},{"number":15,"text":"Gewiß, WIR werden die Peinigung ein wenig wegnehmen. Gewiß, ihr seid Rückfällige"},{"number":16,"text":"An dem Tag, wenn WIR die größte Gewalt anwenden lassen, gewiß, WIR sind Vergeltung Übende"},{"number":17,"text":"Und gewiß, bereits unterzogen vor ihnen Pharaos Leute eine Fitna und zu ihnen kam ein edler Gesandter"},{"number":18,"text":"Gebt mir ALLAHs Diener! Gewiß, ich bin für euch ein vertrauenswürdiger Gesandter"},{"number":19,"text":"Und erhebt euch nicht in Arroganz ALLAH gegenüber! Gewiß, ich brachte euch einen deutlichen Beweis"},{"number":20,"text":"Und gewiß, ich suchte Schutz bei meinem HERRN und eurem HERRN, daß ihr mich steinigt"},{"number":21,"text":"Und solltet ihr mir keinen Iman schenken, dann bleibt mir fern"},{"number":22,"text":"Dann richtete Bittgebet an seinen HERRN: \"Diese sind doch schwer verfehlende Leute"},{"number":23,"text":"Also mache dich mit Meinen Dienern nachts auf den Weg! Gewiß, ihr werdet verfolgt"},{"number":24,"text":"Und laß das Meer still sein! Gewiß, sie sind ertränkte Soldaten"},{"number":25,"text":"Wie viele Dschannat und Quellen sie hinterließen"},{"number":26,"text":"auch Gewächs und edlen Aufenthalt"},{"number":27,"text":"sowie Wohlergehen, in dem sie freudenerregt waren"},{"number":28,"text":"Solcherart! Und WIR überließen diese anderen Leuten zum Erbe"},{"number":29,"text":"So weinten ihnen weder Himmel, noch Erde nach. Und ihnen wurde kein Aufschub gewährt"},{"number":30,"text":"Und gewiß, bereits erretteten WIR die Kinder Israils von der erniedrigenden Peinigung"},{"number":31,"text":"von Pharao. Gewiß, er war ein Arroganter von den Maßlosen"},{"number":32,"text":"Und gewiß, bereits erwählten WIR sie nach Wissen vor den (anderen) Menschen aus"},{"number":33,"text":"Und WIR ließen ihnen von den Ayat zuteil werden, worin deutliche Prüfung ist"},{"number":34,"text":"Gewiß, diese sagen doch"},{"number":35,"text":"Es ist nur unser erster Tod und wir werden nie auferstehen"},{"number":36,"text":"So bringt unsere Ahnen, solltet ihr wahrhaftig sein"},{"number":37,"text":"Sind sie etwa besser oder die Leute von Tubba' und diejenigen vor ihnen?! WIR richteten sie zugrunde. Gewiß, sie waren schwer verfehlende Leute"},{"number":38,"text":"Und WIR erschufen die Himmel, die Erde und das, was zwischen ihnen ist, nicht als Unfug-Treibende"},{"number":39,"text":"WIR erschufen beide nur nach der Gesetzmäßigkeit. Doch die meisten wissen es nicht"},{"number":40,"text":"Gewiß, der Tag des Richtens ist ihr Termin, allesamt"},{"number":41,"text":"An dem Tag, wenn kein Maula einem Maula etwas nützen kann. Und ihnen wird nicht beigestanden"},{"number":42,"text":"außer denjenigen, denen ALLAH Gnade erwies. Gewiß, ER ist Der Allwürdige, Der Allgnädige"},{"number":43,"text":"Gewiß, der Zaqqum-Baum"},{"number":44,"text":"ist die Speise des Verfehlenden"},{"number":45,"text":"Er ist wie das Verschmolzene, das in den Bäuchen kocht"},{"number":46,"text":"wie das Sieden des Siedenden"},{"number":47,"text":"Nehmt ihn, dann schleift ihn in Dschahannams Mitten"},{"number":48,"text":"dann gießt über seinen Kopf von der Peinigung des Siedenden"},{"number":49,"text":"Koste! Gewiß, du bist der Würdige, der Edle"},{"number":50,"text":"Gewiß, dies ist das, was ihr zu bezweifeln pflegtet"},{"number":51,"text":"Gewiß, die Muttaqi sind an einem sicheren Aufenthaltsort"},{"number":52,"text":"in Dschannat und an Quellen"},{"number":53,"text":"Sie tragen Kleidung aus Sundos und Istabraq einander gegenüber (sitzend)"},{"number":54,"text":"Solcherart! Und WIR vermählten sie mit Hur-'in"},{"number":55,"text":"Sie verlangen darin nach jeglicher Art Obst als sich sicher Fühlende"},{"number":56,"text":"Nicht erfahren sie den Tod darin, außer dem ersten Tod. Und ER schützte sie vor der Peinigung der Hölle"},{"number":57,"text":"als Gunst von deinem HERRN. Dies ist der gewaltige Erfolg"},{"number":58,"text":"Und WIR erleichterten ihn doch in deiner Sprache, damit sie sich besinnen"},{"number":59,"text":"So warte! Gewiß, sie warten ebenfalls"}]}