{"number":51,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Bei den das Streuen Streuenden"},{"number":2,"text":"dann den Schweres Tragenden"},{"number":3,"text":"dann den in Leichtigkeit sich Fortbewegenden"},{"number":4,"text":"dann den die Angelegenheit Einteilenden"},{"number":5,"text":"Was euch versprochen wird, ist doch wahrhaftig"},{"number":6,"text":"Und gewiß, der Din wird sicher geschehen"},{"number":7,"text":"Bei dem Himmel von Kreisbahnen"},{"number":8,"text":"Gewiß, ihr seid doch verschiedener Ansichten"},{"number":9,"text":"abgebracht wird davon, wer abgebracht wurde"},{"number":10,"text":"Tod sei den Lügnern"},{"number":11,"text":"die in den Tiefen (der Unwissenheit) achtlos bleiben"},{"number":12,"text":"Sie fragen: \"Wann geschieht der Tag des Din"},{"number":13,"text":"Am Tag, wenn sie im Feuer der Fitna unterzogen werden"},{"number":14,"text":"Erfahrt eure Fitna! Dies ist das, wozu ihr zur Eile aufzufordern pflegtet"},{"number":15,"text":"Gewiß, dieMuttaqi sind in Dschannat und an Quellen"},{"number":16,"text":"sie nehmen das, was ihr HERR ihnen zuteil werden ließ. Gewiß, sie pflegten vor diesem Muhsin zu sein"},{"number":17,"text":"Sie pflegten ein wenig von der Nacht zu schlafen"},{"number":18,"text":"und vor der Morgendämmerung baten sie um Vergebung"},{"number":19,"text":"Und in ihren Vermögensgütern ist ein Anrecht für den Bittenden und den Ausgeschlossenen"},{"number":20,"text":"Und auf Erden sind Ayat für die Gewißheit-Anstrebenden"},{"number":21,"text":"sowie in euch selbst. Habt ihr etwa keinen Einblick"},{"number":22,"text":"Und im Himmel ist euer Rizq und das, was euch versprochen wird"},{"number":23,"text":"Beim HERRN des Himmels und der Erde! Gewiß, es ist bestimmt wahr, genauso (wie es wahr ist), daß ihr sprecht"},{"number":24,"text":"Wurde dir der Bericht über Ibrahims gewürdigte Gäste zuteil"},{"number":25,"text":"Als sie zu ihm eintraten und sagten: \"Salam (sei mit dir)!\" Er sagte: \"Salam (sei mit euch), ihr unbekannte Leute"},{"number":26,"text":"Dann ging er unbemerkt zu seiner Familie, dann kam er mit einem wohlgenährten Kalb"},{"number":27,"text":"dann setzte er es ihnen vor, er sagte: \"Esst ihr etwa nicht"},{"number":28,"text":"Dann verbarg er Furcht vor ihnen. Sie sagten: \"Fürchte dich nicht!\" Und sie überbrachten ihm frohe Botschaft über einen äußerst wissenden Jungen"},{"number":29,"text":"Dann kam seine Frau in lautem Überschwang, schlug sich auf ihr Gesicht und sagte: \"Ich bin doch eine unfruchtbare Alte"},{"number":30,"text":"Sie sagten: \"Solcherart sagte dein HERR. Gewiß, ER ist Der Allweise, Der Allwissende"},{"number":31,"text":"Er sagte: \"Was ist euer Bestreben, ihr Entsandte"},{"number":32,"text":"Sie sagten: \"Gewiß, wir wurden zu schwer verfehlenden Leuten entsandt"},{"number":33,"text":"damit wir über sie Steine von Lehm schicken"},{"number":34,"text":"die bei deinem HERRN für die Maßlosen gekennzeichnet sind"},{"number":35,"text":"Dann brachten WIR heraus, wer in ihr von den Mumin war"},{"number":36,"text":"Dann fanden WIR in ihr nur ein Haus von Muslimen"},{"number":37,"text":"Und WIR ließen in ihr eine Aya für diejenigen, die sich vor der qualvollen Peinigung fürchten"},{"number":38,"text":"Und mit Musa (gab es eine Aya), als WIR ihn zu Pharao mit einem deutlichen Beweis entsandten"},{"number":39,"text":"Dann wandte er sich zu seinen Protektoren und sagte: \"(Er ist) ein Magier oder geistesgestört"},{"number":40,"text":"Dann bestraften WIR ihn mit seinen Soldaten, dann warfen WIR sie in den Fluß, während er tadelnswert war"},{"number":41,"text":"Und mit 'Aad (gab es eine Aya), als WIR über sie den unfruchtbar machenden Wind schickten"},{"number":42,"text":"der nichts von dem läßt, worüber er wehte, ohne daß er es zu Zermalmtem machte"},{"number":43,"text":"Und mit Thamud (gab es eine Aya), als ihnen gesagt wurde: \"Vergnügt euch nur bis zu einer Zeit"},{"number":44,"text":"Dann erhoben sie sich über die Anweisung ihres HERRN, dann erschlug sie der Blitzschlag während sie zuschauten"},{"number":45,"text":"Dann konnten sie weder aufstehen, noch wurde ihnen beigestanden"},{"number":46,"text":"Ebenso die Leute von Nuh vorher, gewiß, sie waren fisq-betreibende Leute"},{"number":47,"text":"Und den Himmel errichteten WIR mit Kraft, und gewiß, WIR sind doch Ausdehnende"},{"number":48,"text":"Und die Erde breiteten wir aus. Wie schön sind die Ebnenden"},{"number":49,"text":"Und von allen Dingen erschufen WIR Zweiheiten, damit ihr euch besinnt"},{"number":50,"text":"Also entweicht zu ALLAH! Gewiß, ich bin für euch vor Ihm ein deutlicher Warner"},{"number":51,"text":"Und setzt neben ALLAH keinen anderen Gott ein! Gewiß, ich bin für euch vor Ihm ein deutlicher Warner"},{"number":52,"text":"Solcherart, zu denjenigen vor ihnen kam kein Gesandter, ohne daß sie sagten: \"(Er ist) ein Magier oder geistesgestört"},{"number":53,"text":"Vermachten sie es einander etwa?! Nein, sondern sie sind übertretende Leute"},{"number":54,"text":"So wende dich von ihnen ab, denn du bist nicht tadelnswert"},{"number":55,"text":"Und erinnere, denn die Erinnerung nutzt doch den Mumin"},{"number":56,"text":"Und ICH erschuf die Dschinn und die Menschen nur, um Mir zu dienen"},{"number":57,"text":"ICH will von ihnen keinerlei Rizq, und ICH will nicht, daß sie Mich speisen"},{"number":58,"text":"Gewiß, ALLAH ist Der wahre reichlich Rizq-Gewährende, Der mit der Allkraft, Der absolut Solide"},{"number":59,"text":"Denn gewiß, für diejenigen, die Unrecht begingen, ist ein Anteil, wie der Anteil ihrer Weggenossen, so sollen sie nicht zur Eile auffordern"},{"number":60,"text":"Also Niedergang sei denjenigen, die Kufr betrieben haben, an ihrem Tag, der ihnen angedroht wird"}]}