{"number":74,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Mud-dath-thir"},{"number":2,"text":"Stehe auf, dann warne"},{"number":3,"text":"und deinen HERRN dann verherrliche mit Takbir"},{"number":4,"text":"und deine Kleidung dann mache rituell rein"},{"number":5,"text":"und die Götzen dann meide"},{"number":6,"text":"Und mache keine Vorhaltung, umMehrung zu erhalten"},{"number":7,"text":"Und für deinen HERRN dann übe dich in Geduld"},{"number":8,"text":"Also wenn in den Naquur gestoßen wird"},{"number":9,"text":"so ist dies an diesem Tag ein schwerer Tag"},{"number":10,"text":"für die Kafir, nicht leicht"},{"number":11,"text":"Lasst Mich mit demjenigen, den ICH als Einzelnen erschuf"},{"number":12,"text":"und dem ICH großes Vermögen gewährte"},{"number":13,"text":"sowie anwesende Kinder"},{"number":14,"text":"und dem ICH (den Weg zum Ruhm) ebnete"},{"number":15,"text":"Dann hofft er, daß ICH ihm noch mehr gebe"},{"number":16,"text":"Nein! Gewiß, er war Unseren Ayat gegenüber trotzig"},{"number":17,"text":"ICH werde ihn durch schwere Hürde ermatten"},{"number":18,"text":"Gewiß, er dachte und schätzte ein"},{"number":19,"text":"Also Tod sei ihm, wie er einschätzte"},{"number":20,"text":"Dann Tod sei ihm, wie er einschätzte"},{"number":21,"text":"Dann schaute er"},{"number":22,"text":"dann runzelte er die Stirn und finster wurde sein Gesicht"},{"number":23,"text":"dann kehrte er den Rücken und erhob sich in Arroganz"},{"number":24,"text":"dann sagte er: \"Dies ist doch nichts anderes als überlieferte Magie"},{"number":25,"text":"Dies ist doch nur Menschenwort"},{"number":26,"text":"ICH werde ihn in Saqar hineinwerfen"},{"number":27,"text":"Und was weißt du, was Saqar ist"},{"number":28,"text":"Sie läßt nichts übrig und läßt nichts aus"},{"number":29,"text":"Sie verbrennt die Oberfläche der Haut"},{"number":30,"text":"Über ihr sind neunzehn"},{"number":31,"text":"Und WIR ließen die Verantwortlichen des Feuers nichts anderes als Engel sein. Und WIR ließen ihre Anzahl nichts anderes als Fitna für diejenigen sein, die Kufr betrieben haben. Damit diejenigen, denen die Schrift zuteil wurde, Gewißheit haben, und diejenigen, die den Iman verinnerlichten, noch mehr Iman haben, und diejenigen, denen die Schrift zuteil wurde, und die Mumin nicht zweifeln. Und damit diejenigen, in deren Herzen Krankheit ist, und diejenigen, die Kufr betrieben haben, sagen: \"Was wollte ALLAH damit als Gleichnis?\" Solcherart läßt ALLAH abirren, wen ER will, und ER leitet recht, wen ER will. Und die Soldaten deines HERRN kennt niemand außer Ihm. Und es ist nichts anderes als eine Ermahnung für die Menschen"},{"number":32,"text":"Nein! Bei dem Mond"},{"number":33,"text":"Bei der Nacht, wenn sie vergeht"},{"number":34,"text":"Bei dem Morgen, wenn er strahlt"},{"number":35,"text":"Sie (Saqar) ist eine der größten (Katastrophen)"},{"number":36,"text":"als Warnung für die Menschen"},{"number":37,"text":"für denjenigen von euch, der vorgehen oder zurückgehen will"},{"number":38,"text":"Jede Seele ist von dem, was sie erwarb abhängig"},{"number":39,"text":"außer den Weggenossen der Rechten"},{"number":40,"text":"Sie sind in Dschannat und fragen einander"},{"number":41,"text":"nach den schwer Verfehlenden"},{"number":42,"text":"Was brachte euch in Saqar hinein"},{"number":43,"text":"Sie sagten: \"Wir pflegten nicht von den des rituellen Gebets Verrichtenden zu sein"},{"number":44,"text":"und wir pflegten nicht den Bedürftigen zu speisen"},{"number":45,"text":"und wir pflegten mit den des Sinnlosen Schwätzenden Sinnloses zu schwätzen"},{"number":46,"text":"und wir pflegten den Tag des Din abzuleugnen"},{"number":47,"text":"bis zu uns die Gewißheit kam"},{"number":48,"text":"So nützt ihnen nicht die Fürbitte der Fürbittenden"},{"number":49,"text":"Was ist mit ihnen, sich von der Ermahnung abwendend"},{"number":50,"text":"als wären sie erschreckte Esel"},{"number":51,"text":"die vor einem Löwen flohen"},{"number":52,"text":"Nein, sondern jeder Mann von ihnen will, daß ihm entfaltete Schriften zuteil werden"},{"number":53,"text":"Gewiß, nein! Sondern sie fürchten nicht das Jenseits"},{"number":54,"text":"Nein! Gewiß, er ist eine Ermahnung"},{"number":55,"text":"Wer will, erinnert sich daran"},{"number":56,"text":"Und sie erinnern sich nicht, außer wenn ALLAH will. ER ist würdig für die Taqwa und würdig für die Vergebung"}]}