{"number":75,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Nein, ICH schwöre beim Tag der Auferstehung"},{"number":2,"text":"nein, auch schwöre ICH bei der tadelnden Seele"},{"number":3,"text":"Denkt der Mensch etwa, daß WIR seine Knochen nicht zusammenfügen werden"},{"number":4,"text":"Doch, mit Sicherheit! WIR sind fähig, daß WIR seine Fingerkuppen in Ordnung bringen"},{"number":5,"text":"Nein, sondern der Mensch will, vor Ihm Verfehlungen öffentlich begehen"},{"number":6,"text":"Er fragt: \"Wann ist der Tag der Auferstehung"},{"number":7,"text":"Also wenn die Augen strahlen"},{"number":8,"text":"der Mond verfinstert wird"},{"number":9,"text":"und die Sonne und der Mond zusammengefügt werden"},{"number":10,"text":"sagt der Mensch an diesem Tag: \"Wo ist der Fluchtweg"},{"number":11,"text":"Nein! Es gibt keinen Zufluchtsort"},{"number":12,"text":"Bei deinem HERRN ist an diesem Tag der Aufenthaltsort"},{"number":13,"text":"Dem Menschen wird an diesem Tag mitgeteilt, was er vorlegte und was er aufschob"},{"number":14,"text":"Nein, sondern der Mensch hat über sich selbst Einblick"},{"number":15,"text":"auch dann, wenn er seine Entschuldigungen vorbringt"},{"number":16,"text":"Bewege damit nicht deine Zunge, damit du über ihn schneller verfügst"},{"number":17,"text":"Uns obliegt seine Sammlung und sein Rezitieren"},{"number":18,"text":"Wenn WIR ihn dann rezitieren ließen, dann folge seiner Rezitation"},{"number":19,"text":"Dann obliegt Uns seine Erläuterung"},{"number":20,"text":"Gewiß, nein! Sondern ihr liebt das Gegenwärtige"},{"number":21,"text":"und vernachlässigt das Jenseits"},{"number":22,"text":"Es sind an diesem Tag strahlende Gesichter"},{"number":23,"text":"die zu ihrem HERRN aufschauen"},{"number":24,"text":"und es sind an diesem Tag verfinsterte Gesichter"},{"number":25,"text":"Sie glauben, daß ihnen Vernichtendes angetan wird"},{"number":26,"text":"Gewiß, nein! Wenn sie (die Seele) die Schlüsselbeine erreicht"},{"number":27,"text":"und gesagt wird: \"Wer ist Heiler"},{"number":28,"text":"Und er glaubte, daß es doch die Trennung ist"},{"number":29,"text":"und das Bein über das (andere) Bein geschlagen wird"},{"number":30,"text":"zu deinem HERRN ist an diesem Tag das Hinbringen"},{"number":31,"text":"Also weder hielt er es für wahrhaftig, noch verrichtete er das rituelle Gebet"},{"number":32,"text":"sondern er leugnete ab und kehrte den Rücken"},{"number":33,"text":"dann ging er zu seiner Familie in Überheblichkeit"},{"number":34,"text":"Es (das Böse) kam dir näher, es kam näher"},{"number":35,"text":"ja! Es kam dir näher, es kam näher, (so nimm dich in Acht)"},{"number":36,"text":"Denkt der Mensch etwa, daß er als etwas Vernachlässigtes bleibt"},{"number":37,"text":"War er etwa nicht eine Nutfa aus Samen, der ergossen wird"},{"number":38,"text":"dann war er eine 'Alaqa, dann gab ER (ihm) die Schöpfung, dann machte ER (ihn) gut"},{"number":39,"text":"dann machte ER daraus die Zweiheit, das Männliche und das Weibliche"},{"number":40,"text":"Ist Dieser etwa nicht fähig, daß ER die Toten belebt"}]}