{"number":78,"edition":"de.zaidan","ayahs":[{"number":1,"text":"Wonach fragen sie einander"},{"number":2,"text":"Nach der gewaltigen Mitteilung"},{"number":3,"text":"über die sie uneins sind"},{"number":4,"text":"Gewiß, nein! Sie werden es noch wissen"},{"number":5,"text":"Dann gewiß, nein! Sie werden es noch wissen"},{"number":6,"text":"Machten WIR die Erde etwa nicht als Unterlage"},{"number":7,"text":"und die Berge als Pflöcke"},{"number":8,"text":"Und WIR erschufen euch als Zweiheiten"},{"number":9,"text":"Auch machten WIR euren Schlaf als Ausruhendes"},{"number":10,"text":"und WIR machten die Nacht als Umhüllendes"},{"number":11,"text":"Auch machten WIR den Tag als Zeit des Lebenserwerbs"},{"number":12,"text":"Und WIR richteten über euch sieben robuste (Himmel) ein"},{"number":13,"text":"Auch machten WIR eine leuchtende Lampe"},{"number":14,"text":"Und WIR ließen von Regenwolken reichlich fließendes Wasser fallen"},{"number":15,"text":"damit WIR mit ihm Getreide und Gewächs hervorsprießen lassen"},{"number":16,"text":"sowie dichtbewachsene Dschannat"},{"number":17,"text":"Gewiß, der Tag des Richtens ist ein festgelegter Zeitpunkt"},{"number":18,"text":"an dem Tag, wenn in As-sur geblasen wird, und ihr dann in Gruppen kommt"},{"number":19,"text":"und der Himmel geöffnet wird, und er voller Tore wird"},{"number":20,"text":"und die Berge vergangen werden, und sie dann zu Fata Morgana werden"},{"number":21,"text":"Gewiß, Dschahannam ist eine Warte"},{"number":22,"text":"für die Übertretenden ein Rückkehrort"},{"number":23,"text":"Sie verweilen darin Zeitspannen"},{"number":24,"text":"Sie kosten darin weder Kühles, noch Getränk"},{"number":25,"text":"außer Siedendem und Eiter"},{"number":26,"text":"Es ist eine entsprechende Vergeltung"},{"number":27,"text":"Gewiß, sie pflegten auf keine Abrechnung zu hoffen"},{"number":28,"text":"und leugneten Unsere Ayat mit Ableugnen ab"},{"number":29,"text":"Und alles erfaßten WIR detailliert in einem Register"},{"number":30,"text":"So kostet! WIR werden euch dann nur an Peinigung mehren"},{"number":31,"text":"Gewiß, für die Muttaqi gibt es einen Ort des Gewinns"},{"number":32,"text":"Gärten und Rebstöcke"},{"number":33,"text":"sowie gleichaltrige gut Bestückte"},{"number":34,"text":"und gefüllte Becher"},{"number":35,"text":"Sie hören darin weder sinnloses Gerede, noch Lügen"},{"number":36,"text":"Es ist eine Belohnung von deinem HERRN, eine ausreichende Gabe"},{"number":37,"text":"(von) Dem HERRN der Himmel, der Erde und das, was zwischen ihnen ist, (ER ist) Der Allgnade Erweisende. Sie haben mit Ihm nicht zu sprechen"},{"number":38,"text":"An dem Tag, wenn der Ruhh und die Engel in Reihe stehen, sie sprechen nicht außer demjenigen, dem Der Allgnade Erweisenden erlaubt, und Richtiges sagt"},{"number":39,"text":"Dies ist der wahre Tag. Also wer will, nimmt zu seinem HERRN eine Rückkehr"},{"number":40,"text":"Gewiß, WIR warnten euch vor einer nahen Peinigung an dem Tag, wenn der Mensch schaut, was er eigenhändig vorlegte, und der Kafir sagt: \"Wäre ich doch nur Erde gewesen"}]}