{"number":67,"edition":"tt.nugman","ayahs":[{"number":1,"text":"Аның кулында ике дөньяның патшалыгы булган Аллаһ мүбарәк вә олугъ булды, Ул – Аллаһ һәрнәрсәгә көче җитүчедер"},{"number":2,"text":"Ул үлемне һәм тереклекне халык кылды, йөкләмәләр йөкләп сезне сынамак өчен, кайсыларыгыз яхшырак гамәлле икәнлеген белмәк өчен, Ул һәрнәрсәдән өстен вә ярлыкаучы"},{"number":3,"text":"Ул – Аллаһ кат-кат итеп җиде күкне халык кылды. Аллаһ халык кылган нәрсәләрдә үлчәүсезлекне күрмәссең. Күзеңне кайтарып күккә карагыл анда берәр ярыкны, кимчелекне күрерсеңме"},{"number":4,"text":"Соңра икенче кат күзеңне кайтарып карагыл, әгәр карасаң күзең арып-талып өметсезләнеп кире кайтыр кимчелекне күрмәссең"},{"number":5,"text":"Тәхкыйк дөнья күген яктыртучы йолдызлар белән зиннәтләдек, вә ул йолдызларны шайтаннарга атылучы кылдык, вә ул шайтаннарга кыздырылган ут ґәзабын хәзерләдек"},{"number":6,"text":"Дәхи Раббыларына карышып кәфер булган кешеләргә җәһәннәм ґәзабыдыр, ул ут ни ямандыр"},{"number":7,"text":"Кәферләр ул җәһәннәмгә ташлансалар, анда ишәк тавышы кеби яман тавыш ишетерләр вә ул җәһәннәм кайнар"},{"number":8,"text":"Ул җәһәннәмгә бер фирка салынса, ул җәһәннәмнең сакчылары: \"Сезгә бу җәһәннәм белән куркытучы пәйгамбәрләр килмәдеме\", – дип сорарлар"},{"number":9,"text":"Кәферләр әйтерләр: \"Дөреслектә безгә бу җәһәннәм белән куркытучы пәйгамбәрләр килде дә бит, без аларны ялганга тоттык һәм әйттек: \"Аллаһ сезгә һич нәрсә иңдермәде, сүзләрегез ялган, сез каты саташу илә саташкан кешеләрдән башка түгелсез\", – дип"},{"number":10,"text":"Ул кәферләр янә әйтерләр: \"Әгәр без ул пәйгамбәрләрнең хак сүзләрен тыңлап кабул иткән булсак, яки алар өйрәткән шәригать хөкемнәрен аңлап гамәл кылган булсак, кыздырылган ут әһелләре эчендә булмас идек\", – дип"},{"number":11,"text":"Эш узгач гөнаһларын таныдылар, без ґәепле диделәр, кыздырылган ут әһелләренә Аллаһуның рәхмәте гаять ерактыр"},{"number":12,"text":"Тәхкыйк Раббыларының күренмәгән ґәзабыннан күргән кеби куркучы хак мөэминнәр, аларгадыр Аллаһуның ярлыкавы һәм олугъ әҗер"},{"number":13,"text":"Сүзләрегезне кирәк яшерен сөйләгез, кирәк – аны кычкырып сөйләгез. Тәхкыйк Ул – Аллаһ күкрәкләр эчендә булган уйларны бик яхшы беләдер"},{"number":14,"text":"Әйә Үзе халык кылган күкрәкләрне вә күңелләрне белмәсме? Вә Ул – Аллаһ һәрнәрсәне белеме илә чорнап алучы вә бик нечкә нәрсәләрдән дә хәбәрдар"},{"number":15,"text":"Ул – Аллаһ сезгә җирне йөрергә уңай кылды, ул җирнең җилкәсендә йөрегез теләгән җирендә яшәгез вә ул җирнең хәләл ризыкларын ашагыз, вә үлгәннән соң терелеп бармак Аллаһу хозурынадыр"},{"number":16,"text":"Әйә сез кешеләр тыныч булдыгызмы күктәге фәрештәләрнең сезгә ґәзаб алып килүләреннән җиргә йоттырулары белән, җир сезне астына алганчы хәрәкәтләнер"},{"number":17,"text":"Әйә сез тыныч булдыгызмы күктәге фәрештәләрнең таш яудыра торган каты җил белән сезне һәлак итүләреннән? Тиздән белерсез Безнең куркытуыбызның хаклыгын"},{"number":18,"text":"Тәхкыйк бу кәферләрдән элгәреге кәферләр пәйгамбәрләрне ялганга тоттылар, аларга Минем мәкерем, ґәзаб белән тотмаклыгым ничек булды"},{"number":19,"text":"Әйә алар күрмиләрме, гыйбрәт күзе илә карамыйлармы өсләрендә очып йөргән кошларга, канатларын җәярләр һәм кабыргаларын кысарлар. Ул кошларны һавада тотучы юк, мәгәр Аллаһ Үзе генә тотадыр, Ул – Аллаһ һәр нәрсәне күрүчедер"},{"number":20,"text":"Аллаһудан башка кая сезгә ярдәм итүче ґәскәр, ошбу сынымнарыгызмы сезгә ярдәм итүче? Кәферләрнең эше һичнәрсә түгел, мәгәр адашып алдану гынадыр"},{"number":21,"text":"Кая Аллаһудан башка сезләрне кем ризыкландыра, әллә сынымнарыгыз яки патшаларыгыз ризыкландырамы? Әгәр Аллаһ бирә торган ризыгын бирмичә туктатып куйса? Бәлки кәферләр моны белә торып тәкәбберләнеп карышмакта һәм хактан качмакта таза тордылар"},{"number":22,"text":"Әйә хаклыкны күрмәскә вә Коръән нуры илә файдаланмаска тырышып йөзтүбән аяк астына гына карап йөргән кешеме туры юлга күнелүчерәк, яки Коръән вә сөннәт белән танышып, хак белән батыл арасын аерып туры юлны карап, күреп барган кешеме хак юлга күнелүчерәк"},{"number":23,"text":"Әйт: \"Ул – Аллаһ сезне юктан бар кылды вә сезгә хак сүзне ишетмәк өчен колак бирде, вә гыйбрәтләрне күрмәк өчен күз бирде, вә фикерләп хак белән батылны аермак өчен күңел бирде, бу нигъмәтләргә караганда сезнең шөкер итүләрегез бик аздыр"},{"number":24,"text":"Әйт: \"Ул – Аллаһ сезне җирдә яратты, вә Аның хозурына кубарылырсыз"},{"number":25,"text":"Кәферләр әйтәләр: \"вәгъдә ителгән кыямәт көне кайчан була, дөрес сөйләүчеләрдән булсагыз, әйтегез?\" – дип"},{"number":26,"text":"Әйт: \"Шиксез, ул кыямәтнең вакытын Аллаһ кына белер, вә мин фәкать хисаб вә ґәзаб белән куркытучы гынамын"},{"number":27,"text":"Һәм ґәзабны бик якыннан күргәннәре вакытта, хакны инкяр итүче кәферләрнең йөзләре каралыр, вә аларга әйтелер: \"Бу – шул ґәзабтыр, сез аны ашыгып көтәдер идегез"},{"number":28,"text":"Әйт: \"Ничек уйлыйсыз, әгәр Аллаһ мине һәм минем белән бергә булган мөэминнәрне һәлак итсә, яки рәхмәт итеп безне исән калдырса, хакны инкяр итүче кәферләрне рәнҗеткүче каты ґәзабтан кем коткарыр"},{"number":29,"text":"Әйт: \"Ул – безнең Раббыбыз барча нәрсәгә рәхмәте ирешкүчедер, вә без Аңа иман китердек һәм Аңа тәвәккәл кылдык. Тиздән күрерсез, кем ачык адашып саташуда икәнлеген"},{"number":30,"text":"Әйт: \"Ничек уйлыйсыз, әгәр сезнең суыгыз һич ала алмаслык тирән җир астына киткән булып әверелсә, кем китерер сезгә кайнап агучы чишмә суларын"}]}