{"number":80,"edition":"tt.nugman","ayahs":[{"number":1,"text":"Йөзен чытты һәм төмсәләнеп борылды"},{"number":2,"text":"Аңа сукыр ибнү өммү Мәктүм килгән вакытта. (Бер- вакыт Мухәммәд г-м, кураешларның олугълары вә байлары илә сөйләшеп аларны иманга өндәп утырганда ибнү өммү Мәктүм килеп Мухәммәд г-мнең мәшгуль икәнен белмичә, йә Мухәммәд миңа Коръән укысаңчы, диде. Мухәммәд г-м кураешларның иманга килүләрен өмет итеп утырганлыктан мәҗлесне бүләсе килмичә, ибнү өммү Мәктүмгә йөзен чытты һәм аңардан борылды. Соңра Аллаһ ошбу сүрәне иңдереп расүлне шелтә кылды. Шуннан соң Мухәммәд г-м ибнү өммү Мәктүмне һәрвакыт хөрмәтли торган булды)"},{"number":3,"text":"Сиңа нәрсә белдерде ягъни ул кураешлар илә сөйләшүме яки Коръән өйрәтүме яхшы икәнен кайдан белдең, шаять ибнү өммү Мәктум синнән Коръән укырга өйрәнеп гөнаһлардан яки батыл диннән пакьләнер"},{"number":4,"text":"Яисә Коръән белән вәгазъләнер дә, вәгазь аңа файда бирер"},{"number":5,"text":"Әмма берәү байлыгына таянып хак динне кирәксенмәсә һәм Аллаһуга гыйбадәт кылудан баш тартса"},{"number":6,"text":"син аңа таба борыласың һәм сүзенә колак саласың"},{"number":7,"text":"Сиңа нинди зарар бар ул кешенең мөшриклектән һәм гөнаһтан пакьләнмәвеннән"},{"number":8,"text":"Вә әмма берәү ашыгып сиңа килсә"},{"number":9,"text":"Раббысыннан курыккан хәлдә"},{"number":10,"text":"син аңардан борылып башкалар илә мәшгуль буласың"},{"number":11,"text":"Юк, алай кирәкмәс, тәхкыйк ул Коръән кешегә файдалы вә зарарлы нәрсәләрнең һәммәсен сөйлидер"},{"number":12,"text":"Теләгән кеше Коръәнне аңлап гыйбрәтләнсен, аның белән гамәл кылып төзәлсен һәм туры юлны тапсын! (Димәк, Коръән белән вәгазьләнүне, Коръәндәге Аллаһ хөкемнәре белән танышуны һәм аның белән гамәл кылуны һичнәрсәгә алыштырырга ярамый)"},{"number":13,"text":"Ул Коръән хөрмәтле сәхифәләрдәдер"},{"number":14,"text":"Хөрияте бик югары, хатадан бик пакь"},{"number":15,"text":"Язучы фәрештәләр кулындадыр"},{"number":16,"text":"Ул фәрештәләр Аллаһ хозурында хөрмәтлеләр вә бик итагатьлеләр"},{"number":17,"text":"Ләгънәт төшкән кеше ни гаҗәп көфран нигъмәттә ифрат кылучыдыр, ягъни бик каты көферлек кыладыр"},{"number":18,"text":"Аллаһ аны ни нәрсәдән яратты соң"},{"number":19,"text":"Мәни суыннан бит! Кешене яратты да, аның әгъзасын, гомерен һәм ризыкларын чикләде"},{"number":20,"text":"Соңра хак юлны табарга мөмкинлек бирде ягъни гакыл, фикер бирде һәм китап иңдереп, пәйгамбәр күндереп туры юлны күрсәтте"},{"number":21,"text":"Соңра аны үтерде дә кабергә куйды, ягъни хайваннар кеби җир өстенә ташламады"},{"number":22,"text":"Соңра теләгән вакытында тергезеп кубарыр аны"},{"number":23,"text":"Юк, әле алай була торып та, Аллаһ әмерләрен җиренә җиткермәде"},{"number":24,"text":"Кеше карасын ашаган ризыгына"},{"number":25,"text":"Тәхкыйк Без аңа суны чын кою белән койдык"},{"number":26,"text":"Соңра җирне чын яру илә ярдык та"},{"number":27,"text":"ул җирдә иген бөртекләрен үстердек"},{"number":28,"text":"Йөземне вә җыеп алган коры җимешләрне"},{"number":29,"text":"дәхи зәйтүн, хөрмә агачларын үстердек"},{"number":30,"text":"Дәхи күп агачлы бакчаларны"},{"number":31,"text":"дәхи төрле җимешләрне вә печәннәрне үстердек"},{"number":32,"text":"Күп нәрсәләр үстердек үзегез һәм хайваннарыгыз файдалану өчен"},{"number":33,"text":"Һәркайчан колакны тондыручы каты сур тавышы килсә"},{"number":34,"text":"Ул көндә кеше качар карендәшләреннән"},{"number":35,"text":"Һәм анасыннан вә атасыннан"},{"number":36,"text":"Һәм хатыныннан вә балаларыннан качар"},{"number":37,"text":"Алардан һәм кеше өчен бардыр кыямәт көнендә аны мәшгуль итәрлек каты эшләр"},{"number":38,"text":"Ул көндә кайбер йөзләр якты"},{"number":39,"text":"көлүче, шатланучыдыр"},{"number":40,"text":"Вә ул көндә кайбер йөзләрдә караңгылык тузан булыр"},{"number":41,"text":"Ул йөзләрне каралык вә караңгылык каплар"},{"number":42,"text":"Бу кара йөзле кешеләр көфран нигъмәт кылучы һәм Аллаһуга итагать итмәүче кешеләрдер"}]}