{"number":74,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"Ey (libasına) bürünüb sarınan (Peyğəmbər)"},{"number":2,"text":"Qalx (qövmünü Allahın əzabı ilə) qorxut"},{"number":3,"text":"Öz Rəbbini uca tut"},{"number":4,"text":"Libasını təmizlə! (Nəfsini günahlardan pak et)"},{"number":5,"text":"(Əzaba səbəb olacaq) pis şeylərdən uzaqlaş! (Bütləri tərk et)"},{"number":6,"text":"(Etdiyin yaxşılığı) çox bilib başa qalxma! (Heç kəsə minnət qoyma)"},{"number":7,"text":"Rəbbinin yolunda (Rəbbinin rizasını qazanmaq üçün bu yolda sənə üz verəcək bütün çətinliklərə) səbr et"},{"number":8,"text":"Elə ki, sur çalındı"},{"number":9,"text":"O gün çox ağır bir gün olacaqdır"},{"number":10,"text":"(O gün) kafirlər üçün asan olmayacaqdır"},{"number":11,"text":"(Ya Peyğəmbər!) Məni Öz yaratdığım kimsə ilə tək burax! (Vəlid ibn Müğirə kimi kafirin cəzasını yalnız Mənə tapşır)"},{"number":12,"text":"Mən ona bollu mal-dövlət əta etdim"},{"number":13,"text":"Yanında hazır duran oğullar (verdim)"},{"number":14,"text":"Ona (hər şeyi) artıqlaması ilə müyəssər etdim (sərvət və mənsəbi ayağının altına döşədim)"},{"number":15,"text":"(Bütün bunlardan) sonra yenə də (var-dövlətini) artırmağımı istəyir"},{"number":16,"text":"Xeyr (bu ola bilməz). Çünki o, ayələrimizə qarşı inadkar oldu"},{"number":17,"text":"Mən onu məşəqqətli bir əzaba düçar edəcəyəm"},{"number":18,"text":"O (Qur’an barəsində) fikirləşdi və (orada deyilənləri öz ürəyində) ölçdü-biçdi"},{"number":19,"text":"Ölüm olsun ona! Necə ölçdü-biçdi?! (Peyğəmbərə sehrbaz dedi)"},{"number":20,"text":"Yenə də ölüm olsun ona! Necə ölçdü-biçdi"},{"number":21,"text":"Sonra (qövmünün üzünə) baxdı"},{"number":22,"text":"Sonra üz-gözünü turşutdu, qaşqabağını tökdü"},{"number":23,"text":"Sonra da (imandan) üz çevirdi, (Peyğəmbərə tabe olmağa) təkəbbür göstərdi"},{"number":24,"text":"Və dedi: “Bu (sehrbazlardan) öyrənilən sehrdən başqa bir şey deyildir"},{"number":25,"text":"Bu yalnız bəşər sözüdür!”"},{"number":26,"text":"Biz onu Səqərə atacağıq (orada yandıracağıq)"},{"number":27,"text":"(Ya Peyğəmbər!) Sən nə bilirsən (haradan bilirsən) ki, nədir Səqər"},{"number":28,"text":"O (heç kəsi sağ) qoymaz və (salamat) buraxmaz"},{"number":29,"text":"İnsanı yandırıb-yaxar"},{"number":30,"text":"Onun üstündə on doqquz (nəfər gözətçi mələk) vardır"},{"number":31,"text":"Biz cəhənnəm gözətçilərini yalnız mələklərdən etdik. Biz onların sayını ancaq kafirlərin imtahana çəkilməsi, kitab verilənlərin yəqinlik hasil etməsi (çünki onların kitablarında bu mələklərin sayı on doqquzdur), iman gətirənlərin imanının daha da artması, kitab əhlinin və mö’minlərin (bununla əlaqədar Muhəmməd əleyhissəlam barəsində) şübhəyə düşməməsi, həmçinin qəlblərində mərəz (nifaq və şəkk mərəzi) olanların və kafirlərin: “Allah bu misalla nə demək istəyir?” – demələri üçün (on doqquz) etdik. Allah istədiyi kimsəni (haqq yoldan) belə sapdırır və istədiyini də doğru yola salır. Rəbbinin ordularını özündən başqası bilməz. Bu (vəsf olunan Səqər) insanlar üçün ancaq bir öyüd-nəsihətdir"},{"number":32,"text":"Xeyr! (İş heç də bu müşriklərin zənn etdiyi kimi deyildir). And olsun aya"},{"number":33,"text":"Dönüb-qayıdan (yaxud gündüzün dalınca gələn) gecəyə"},{"number":34,"text":"Və sökülməkdə olan dan yerinə ki"},{"number":35,"text":"(Cəhənnəm) böyük bəlalardan biridir"},{"number":36,"text":"(O, Allahın əzabı ilə) qorxudur insanları"},{"number":37,"text":"Sizdən (yaxşı işlərdə) irəli düşmək, yaxud geri qalmaq istəyənləri"},{"number":38,"text":"Hər kəs öz əməlinin girovudur! (Hərə öz əməlinin əvəzini alacaqdır)"},{"number":39,"text":"Sağ tərəf sahibləri (əməl dəftərləri sağ əllərinə verilənlər) istisna olmaqla"},{"number":40,"text":"Onlar cənnətlərdədirlər; bir-birindən soruşacaqlar"},{"number":41,"text":"Günahkarlar barəsində (və sonra həmin günahkarlara müraciət edib belə deyəcəklər)"},{"number":42,"text":"“Sizi Səqərə (Cəhənnəmə) salan nədir?”"},{"number":43,"text":"Onlar deyəcəklər: “Biz namaz qılanlardan deyildik"},{"number":44,"text":"Yoxsulu da yedirtməzdik"},{"number":45,"text":"Batilə dalanlarla birlikdə biz də dalardıq"},{"number":46,"text":"Haqq-hesab gününü yalan sayardıq"},{"number":47,"text":"Ölüm bizi haqlayana qədər (bu vəziyyətdə qaldıq)”"},{"number":48,"text":"Şəfaət edənlərin şəfaəti onlara fayda verməz"},{"number":49,"text":"Onlara nə olub ki, öyüd-nəsihətdən üz çevirirlər (qaçırlar)"},{"number":50,"text":"Onlar sanki vəhşi eşşəklərdir"},{"number":51,"text":"(O eşşəklər ki) aslandan hürküb qaçarlar"},{"number":52,"text":"Xeyr, onların hər biri özünə (göydən) nazil olmuş səhifələr verilməsini istəyər"},{"number":53,"text":"Xeyr, daha doğrusu, onlar axirətdən qorxmazlar"},{"number":54,"text":"Xeyr, bu (Qur’an) bir öyüd-nəsihətdir"},{"number":55,"text":"İstəyənlər ondan öyüd alar"},{"number":56,"text":"Bununla belə, Allah istəməsə, onlar əsla öyüd ala bilməzlər. Qorxub çəkinməyə də, bağışlamağa da layiq olan ancaq Odur"}]}