{"number":81,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"Günəş (əmmamə kimi) sarınıb büküləcəyi (sönəcəyi) zaman"},{"number":2,"text":"Ulduzlar (göydən qopub yağış dənələri kimi yerə) səpələnəcəyi zaman"},{"number":3,"text":"Dağlar yerindən qopardılacağı (toz kimi havada uçacağı) zaman"},{"number":4,"text":"(Bədəvi ərəblərin çox əziz tutduğu) boğaz dəvələr başlı-başına buraxılacağı zaman"},{"number":5,"text":"Vəhşi heyvanlar (bir-birindən qisas almaq üçün) bir yerə toplanacağı zaman"},{"number":6,"text":"Dənizlər od tutub yanacağı (və ya dolub daşacağı) zaman"},{"number":7,"text":"Ruhlar (bədənlərə) qovuşacağı zaman"},{"number":8,"text":"Diri-diri torpağa gömülən körpə qızdan"},{"number":9,"text":"“Axı o hansı günaha görə öldürüldü?”; soruşulacağı zaman"},{"number":10,"text":"Əməl dəftərləri açılacağı zaman"},{"number":11,"text":"Göy (yerindən) qopardılacağı (və ya büküləcəyi) zaman"},{"number":12,"text":"Cəhənnəm alovlandırılacağı zaman"},{"number":13,"text":"Və Cənnət (mö’minlərə) yaxınlaşdırılacağı zaman"},{"number":14,"text":"Hər kəs (dünyada bugünkü günə özü üçün yaxşı, pis) nə hazır etdiyini biləcəkdir"},{"number":15,"text":"And içirəm (gecə) yanıb (gündüz) sönən ulduzlara"},{"number":16,"text":"(Günəşlə, ayla) seyr edib (onlar batdığı zaman) gizlənən səyyarələrə (Zühələ, Müştəriyə, Mərrixə, Zöhrəyə və Ütaridə)"},{"number":17,"text":"Qaralmaqda olan gecəyə (yaxud: qaralmaqda və çəkilməkdə olan gecəyə)"},{"number":18,"text":"Və sökülməkdə olan dan yerinə ki"},{"number":19,"text":"Bu (Qur’an Allah dərgahında) çox möhtərəm olan bir elçinin (Cəbrailin) gətirdiyi kəlamdır"},{"number":20,"text":"(Elə bir elçi ki) çox qüvvətlidir; ərşin sahibi (Allah) yanında çox hörmətlidir (izzətlidir)"},{"number":21,"text":"(Elə bir elçi ki, mələklər arasında) itaət ediləndir, həm də (Allah yanında vəhyə) e’tibarlı müvəkkildir"},{"number":22,"text":"(Ey Məkkə əhli!) Həqiqətən, sizin dostunuz (müşriklərin dediyi kimi) divanə deyildir"},{"number":23,"text":"And olsun ki, (Peyğəmbər!) onu (Cəbraili) açıq (ən uca) üfüqdə gördü"},{"number":24,"text":"O, qeyb (vəhyi olduğu kimi təbliğ etmək və sizə öyrətmək) barəsində xəsis deyildir"},{"number":25,"text":"O (Qur’an) da məl’un (Allahın rəhmətindən qovulmuş) Şeytanın sözü deyildir"},{"number":26,"text":"Elə isə (siz ondan üz döndərib) hara gedirsiniz"},{"number":27,"text":"O, aləmlər (bütün insanlar və cinlər) üçün ancaq bir öyüd-nəsihətdir"},{"number":28,"text":"Eləcə də sizdən doğru-düz (yolda) olmaq istəyənlər üçün"},{"number":29,"text":"(Onu da bilin ki) aləmlərin Rəbbi olan Allah istəməsə, siz (bunu) istəyə bilməzsiniz! (Yalnız Allah istəsə, istəyə bilərsiniz. Siz insanlar həmişə Allahın qüdrəti, hökmü və iradəsi altındasınız. O sizi bir şeyi istəməyincə siz onu özünüzə istəyə bilməzsiniz. Ona görə də hər işdə Allaha təvəkkül edin)"}]}