{"number":84,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"Göy yarılacağı"},{"number":2,"text":"Və Rəbbinin buyuruğunu haqq olaraq eşidib (Ona) itaət edəcəyi zaman"},{"number":3,"text":"Yer uzanıb dümdüz olacağı"},{"number":4,"text":"Qoynunda olanları bayıra atıb boşaldacağı"},{"number":5,"text":"Və Rəbbinin buyurduğunu haqq olaraq eşidib (Ona) itaət edəcəyi zaman (insan dünyada yaxşı və pis əməllərinin cəzasını layiqincə alacaqdır)"},{"number":6,"text":"Ey insan! Sən (ölənə qədər) Rəbbinə doğru çalışıb çabalayırsan. Sən Ona qovuşacaqsan! (Sənin qısa ömrün gündən-günə səni Allaha yaxınlaşdırır. Ölümün gəlib çatması Allah dərgahına qovuşmaq deməkdir. Öləndən sonra Allahın hüzuruna gedib dünyada etdiyin yaxşı, pis əməllərin əvəzini tamamilə alacaqsan. Yaxşı əməllər etmisənsə, xoş halına. Pis əməllər etmisənsə, vay halına)"},{"number":7,"text":"Kimin əməl dəftəri sağ əlinə verilmişsə"},{"number":8,"text":"Onun yüngül haqq-hesab çəkiləcək"},{"number":9,"text":"Və o, (Cənnətdəki) ailəsinin (yaxınlarının) yanına sevinclə qayıdacaqdır"},{"number":10,"text":"Kimin əməl dəftəri arxa tərəfdən (sol əlinə) verilmişsə"},{"number":11,"text":"O: “Ay öldüm!” – deyə şivən qopardacaq"},{"number":12,"text":"Və Cəhənnəmə vasil olacaqdır"},{"number":13,"text":"O, (dünyada) öz ailəsi (yaxınları) arasında sevinc içində idi"},{"number":14,"text":"Və elə zənn edirdi ki, (öləndən sonra dirilib haqq-hesab üçün Rəbbinin hüzuruna) qayıtmayacaqdır"},{"number":15,"text":"Xeyr! (Onun düşündüyü kimi deyildir. O, qiyamət günü dirilib Allahın hüzuruna qayıdacaqdır). Həqiqətən, Rəbbi onu görürdü"},{"number":16,"text":"And içirəm şəfəqə"},{"number":17,"text":"Gecəyə və (gecənin) qoynuna aldıqlarına"},{"number":18,"text":"Bədirlənməkdə olan aya ki"},{"number":19,"text":"Siz (ey kafirlər, qiyamət günü) haldan-hala düşəcəksiniz"},{"number":20,"text":"Onlara nə olub ki, iman gətirmirlər"},{"number":21,"text":"Özlərinə Qur’an oxunduqda səcdə etmirlər"},{"number":22,"text":"Əksinə, kafir olanlar (Allahın vəhdaniyyətini və ayələrini) təkzib edirlər"},{"number":23,"text":"Halbuki Allah onların (ürəklərində) gizlətdiklərini ən gözəl biləndir"},{"number":24,"text":"(Ya Peyğəmbər!) Onlara (qiyamət günü düçar olacaqları) şiddətli bir əzabla müjdə ver"},{"number":25,"text":"İman gətirib yaxşı əməllər edənlər istisna olmaqla! Onları (Cənnətdə) minnətsiz (tükənmək bilməyən) mükafat gözləyir"}]}