{"number":71,"edition":"fa.fooladvand","ayahs":[{"number":1,"text":"ما نوح را به سوى قومش فرستاديم كه: «قومت را، پيش از آنكه عذابى دردناك به آنان رسد، هشدار ده.»"},{"number":2,"text":"[نوح‌] گفت: «اى قوم من، من شما را هشدار دهنده‌اى آشكارم،"},{"number":3,"text":"كه خدا را بپرستيد و از او پروا داريد و مرا فرمان بريد"},{"number":4,"text":"[تا] برخى از گناهانتان را بر شما ببخشايد و [اجل‌] شما را تا وقتى معين به تأخير اندازد. اگر بدانيد، چون وقت مقرر خدا برسد، تأخير بر نخواهد داشت"},{"number":5,"text":"[نوح‌] گفت: «پروردگارا، من قوم خود را شب و روز دعوت كردم،"},{"number":6,"text":"و دعوت من جز بر گريزشان نيفزود"},{"number":7,"text":"و من هر بار كه آنان را دعوت كردم تا ايشان را بيامرزى، انگشتانشان را در گوشهايشان كردند و رداى خويشتن بر سر كشيدند و اصرار ورزيدند و هر چه بيشتر بر كبر خود افزودند"},{"number":8,"text":"سپس من آشكارا آنان را دعوت كردم"},{"number":9,"text":"باز من به آنان اعلام نمودم و در خلوت [و] پوشيده نيز به ايشان گفتم"},{"number":10,"text":"و گفتم: از پروردگارتان آمرزش بخواهيد كه او همواره آمرزنده است"},{"number":11,"text":"[تا] بر شما از آسمان باران پى در پى فرستد"},{"number":12,"text":"و شما را به اموال و پسران، يارى كند، و برايتان باغها قرار دهد و نهرها براى شما پديد آورد"},{"number":13,"text":"شما را چه شده است كه از شكوه خدا بيم نداريد؟"},{"number":14,"text":"و حال آنكه شما را مرحله به مرحله خلق كرده است"},{"number":15,"text":"مگر ملاحظه نكرده‌ايد كه چگونه خدا هفت آسمان را تُوبرتُو آفريده است؟"},{"number":16,"text":"و ماه را در ميان آنها روشنايى‌بخش گردانيد و خورشيد را [چون‌] چراغى قرار داد"},{"number":17,"text":"و خدا[ست كه‌] شما را [مانند] گياهى از زمين رويانيد؛"},{"number":18,"text":"سپس شما را در آن بازمى‌گرداند و بيرون مى‌آورد بيرون‌آوردنى [عجيب‌]"},{"number":19,"text":"و خدا زمين را براى شما فرشى [گسترده‌] ساخت،"},{"number":20,"text":"تا در راههاى فراخ آن برويد.»"},{"number":21,"text":"نوح گفت: «پروردگارا، آنان نافرمانى من كردند و كسى را پيروى نمودند كه مال و فرزندش جز بر زيان وى نيفزود"},{"number":22,"text":"و دست به نيرنگى بس بزرگ زدند"},{"number":23,"text":"و گفتند: زنهار، خدايان خود را رها مكنيد، و نه «وَدّ» را واگذاريد و نه «سُواع» و نه «يَغُوث» و نه «يَعُوق» و نه «نَسْر» را"},{"number":24,"text":"و بسيارى را گمراه كرده‌اند. [بار خدايا،] جز بر گمراهى ستمكاران ميفزاى.»"},{"number":25,"text":"[تا] به سبب گناهانشان غرقه گشتند و [پس از مرگ‌] در آتشى درآورده شدند و براى خود، در برابر خدا يارانى نيافتند"},{"number":26,"text":"و نوح گفت: «پروردگارا، هيچ كس از كافران را بر روى زمين مگذار،"},{"number":27,"text":"چرا كه اگر تو آنان را باقى گذارى، بندگانت را گمراه مى‌كنند و جز پليدكار ناسپاس نزايند"},{"number":28,"text":"پروردگارا، بر من و پدر و مادرم و هر مؤمنى كه در سرايم درآيد، و بر مردان و زنان با ايمان ببخشاى، و جز بر هلاكت ستمگران ميفزاى.»"}]}