{"number":45,"edition":"cs.nykl","ayahs":[{"number":1,"text":"Há. Mím"},{"number":2,"text":"Seslání Knihy od Boha, Mocného, Moudrého"},{"number":3,"text":"Zajisté v nebi a v zemi znamení jsou věřícím"},{"number":4,"text":"jakož i ve stvoření vás a v živočiších rozptýlených po zemi, znamení jsou lidu víry pevné"},{"number":5,"text":"a ve střídaní noci se dnem, a v tom, co Bůh seslal s nebe výživou, jíž oživuje zemi zmrtvělou; a v přeměně větrů, znamení jsou lidu chápavému"},{"number":6,"text":"Tato jsou znamení boží, jež předčítáme ti v opravdovosti: a v jakou rozpravu uvěří (tito lidé) po (zamítnutí) Boha a znamení jeho"},{"number":7,"text":"Běda každému (velkému) lháři hříšnému"},{"number":8,"text":"jenž naslouchá znamením božím, ana předčítána jsou mu, a pak setrvává v pýše své, jako by jich neslyšel: tomuto věstiž trest bolestný"},{"number":9,"text":"A naučil-li se čemu ze znamení našich, tropí si z nich šprým: těmto všem (schystán) jest trest potupný"},{"number":10,"text":"S zadu jich bude peklo: a neprospěje jim pranic to, čeho si byli dobyli, aniž ti, jež brali si za ochránce vedle Boha; jim (schystán) jest trest velký"},{"number":11,"text":"Toto jest (pravé) Vedení; a těm, kdož neuvěřili ve znamení Pána svého, (schystán) jest trest útrap bolestných"},{"number":12,"text":"Bůh to byl, jenž podrobil vám moře, aby lodi pluly po něm dle rozkazu jeho, a abyste snažili se dosíci (tak) podílu z milosti, jeho: a abyste snad byli vděčni"},{"number":13,"text":"A podrobil vám, což na nebi jest i na zemi: vše to jest od něho. Zajisté pak v tomto (všem) znamení jsou lidu přemýšlivému"},{"number":14,"text":"Rci těm, kdož uvěřili, aby odpustili těm, kteří nedoufají ve dny boží, jež stanovil, aby odměnil lid dle konání jejich"},{"number":15,"text":"Kdožkoli pak koná dobro, koná je ve svůj vlastní prospěch; a kdožkoli koná zlo, koná je proti sobě samému. Pak k Pánu svému navráceni budete"},{"number":16,"text":"Kdysi již dali jsme synům Israele Knihu a soudnost, a proroctví: a výživou dali jsme jim věci dobré, a vyznamenali je nad lidstvo veškeré"},{"number":17,"text":"A dali jsme jim jasné důkazy pro (naše) nařízení: a rozešli se (v mínění o nich) pouze poté, když přišlo jim vědění, ze vzájemné svévole. Zajisté pak Pán tvůj rozsoudí mezi nimi v den zmrtvýchvstání ohledně toho, v čem rozcházeli se"},{"number":18,"text":"Poté pak ustanovili jsme tebe nad zákonem ohledně nařízení našich: i následuj jej a nenásleduj choutek těch, kdož nevědí"},{"number":19,"text":"Neb oni zajisté neprospějí ti pranic proti Bohu: zajisté nepravostní jsou navzájem si ochránci, však Bůh ochráncem jest bohabojných"},{"number":20,"text":"Tato (Kniha) jest prohlédnutím lidstvu a (pravým) vedením a milosrdenstvím lidu pevně věřícímu"},{"number":21,"text":"Či domnívají se ti, kdož pášou špatnosti, že učiníme je rovnými těm, kteří uvěřili a konají dobré skutky, takže stejné bude jich žití a jich umírání? Jak špatně usuzují"},{"number":22,"text":"Stvořilť pak Bůh nebesa i zemi v pravdě; aby odměniti mohl každou duši po zásluze její: a nebude jim ukřivděno"},{"number":23,"text":"Co míníš? Ten, kdo vzal si za Boha choutku svou, a jejž Bůh zavedl vědomě, a pečeť vložil na sluch jeho a srdce jeho, a zastřel zrak jeho clonou — kdo uvede jej (na cestu pravou) poté, když Bůh (byl zavedl jej)? Což nebudete toho pamětlivi"},{"number":24,"text":"A říkají: „Není nám jiného života, vyjma života našeho pozemského; umíráme a žijeme a pouze čas hubí nás.“ Však nemají o tom nijakého vědění: pouze tak domnívají se"},{"number":25,"text":"A když předčítána jsou jim znamení naše jasná, jediný důvod jejich (proti nim) jest, že říkají: „Přiveďte nám sem tedy (zemřelé) předky naše, jste-li pravdomluvnými!“"},{"number":26,"text":"Rci: „Bůh vzbouzí vás k životu, pak dá vám zemříti: a pak shromáždí vás ke dni zmrtvýchvstání, o němž není pochybnosti; však většina lidí není si toho vědoma"},{"number":27,"text":"Bohu přináleží panství nebes a země: a v den, kdy nadejde hodina (soudu), v den onen záhubě propadnou ti, kdož (pravdu) popírají.“"},{"number":28,"text":"A spatříš všechny národy KLEČÍCÍ; každý národ zavolán bude ke Knize své: v den ten odměněni budete dle skutků svých"},{"number":29,"text":"Tato Kniha naše vyjadřuje se o vás dle pravdy, neb my zanášeli jsme v ní vše, což konali jste"},{"number":30,"text":"A pokud se týče těch, kdož uvěřili a konali dobré skutky, uvede je Pán jejich v milosrdenství své: toť blaženost bude zjevná"},{"number":31,"text":"A pokud se týče těch, kdož neuvěřili, (řekne se jim): „Což nebyla vám předčítána znamení naše? Však pyšně chovali jste se a byli jste lidem Provinilým"},{"number":32,"text":"A když řeklo se (vám): ‚Slib boží pravdivý jest: a není pochybnosti o hodině (soudu),‘ říkali jste: ‚Nevíme co hodina (soudu) jest: máme ji za pouhou domněnku a nejsme o ní nijak ujištěni.‘“"},{"number":33,"text":"Tehdy zjeví se jim špatnost skutků jejich a obklopí je to, čemu se byli posmívali"},{"number":34,"text":"A bude řečeno (jim), „Dnes zapomeneme na vás, jakož i vy zapomněli jste na setkání se (s námi) v den tento: a obydlím vašim bude oheň a nebude vám pomocníků"},{"number":35,"text":"To za to, že za žert měli jste znamení boží a že zmámil vás život pozemský.“ Pročež v den ten nebudou již vyvedeni z ohně a nebude popřáno jim prominutí"},{"number":36,"text":"Bohu tedy budiž chvála, Pánu nebes a Pánu země, Pánu veškerenstva"},{"number":37,"text":"Jemuť přináleží velikost na nebi a na zemi a on mocný jest, moudrý"}]}