{"number":73,"edition":"cs.nykl","ayahs":[{"number":1,"text":"Ó ZAHALENÝ"},{"number":2,"text":"Stůj celou noc, vyjma něco málo"},{"number":3,"text":"půl noci, neb zmenši půl o něco málo"},{"number":4,"text":"aneb přidej k ní; a předzpěvuj Korán předzpěvem"},{"number":5,"text":"myť zajisté vložíme na tě rčení převážná"},{"number":6,"text":"Zajisté počátek noci budí silnější dojmy (zbožnosti) a přímější mluvení"},{"number":7,"text":"neb během dne máš práci zdlouhavou"},{"number":8,"text":"Pročež pomni jména Pána svého a oddej se mu plným oddáním"},{"number":9,"text":"Pánu východu i západu; není Boha, kromě něho; i vezmi si jej ochráncem"},{"number":10,"text":"a snášej trpělivě to, co říkají a vzdaluj se jich vzdalováním přístojným"},{"number":11,"text":"a ponech mne (samotna) s těmi, kdož lhářem nazývají tě, tonoucími v rozkoších (světa) - a posečkej jim ještě maličko"},{"number":12,"text":"Myť zajisté máme pro ně pouta a výheň plamennou"},{"number":13,"text":"potravu dusící a trest bolestný"},{"number":14,"text":"v den, kdy zatřese se země a hory, a budou hory jako hromady volného písku"},{"number":15,"text":"Zajisté poslali jsme k vám posla, aby svědčil proti vám, jakož k Faraonovi posla jsme poslali"},{"number":16,"text":"Však neuposlechl Farao posla i zachvátili jsme jej mocným zachvácením"},{"number":17,"text":"A jak ochráníte se, neuvěříte-li, přede dnem, kdy děti zšedivějí"},{"number":18,"text":"Kdy nebe samo pukne jím: neb slib o něm bude naplněn"},{"number":19,"text":"Totoť jest připomínka! Pročež nechť kdo chce, nastoupí k Pánu svému stezku"},{"number":20,"text":"Zajisté Pán tvůj dobře ví, že stojíš (v modlitbě) téměř dvě třetiny noci, neb půl, neb třetinu: a taktéž činí skupina z těch, kdož s tebou jsou. A Bůh měří noc a den; (dobře) ví, že to nepočítáte (přesně) i odpouští vám. Pročež předčítejte z Koránu, kolik snadno jest vám; (Bůh) ví, že budou mezi vámi nemocní, a jiní že tlouci se budou zemí, žádajíce si podílu z milosti boží; a jiní že bojovati budou na stezce boží. Pročež předčítejte z něho, kolik snadno jest vám: a zachovávejte modlitbu a dávejte povinnou almužnu a půjčujte Bohu půjčku štědrou; neboť cokoliv dobrého pošlete před sebou ve prospěch duší svých, shledáte u Boha; bude to lepším a větším co do odměny. A proste Boha za odpuštění; zajisté Bůh velkým jest v odpouštění, slitovným"}]}