{"number":44,"edition":"th.thai","ayahs":[{"number":1,"text":"ฮามีม"},{"number":2,"text":"ขอสาบานด้วยคัมภีร์อันชัดแจ้ง"},{"number":3,"text":"แท้จริงเราได้ประทานอัลกุรอานลงมาในคืนอันจำเริญ แท้จริงเราเป็นผู้ตักเตือน"},{"number":4,"text":"ในคืนนั้นทุก ๆ กิจการที่สำคัญถูกจำแนกไว้แล้ว"},{"number":5,"text":"โดยทางบัญชามาจากเรา แท้จริงเราเป็นผู้ส่งมา"},{"number":6,"text":"เป็นความเมตตาจากพระเจ้าของเจ้า แท้จริงพระองค์เป็นผู้ทรงได้ยิน ผู้ทรงรอบรู้"},{"number":7,"text":"พระเจ้าแห่งชั้นฟ้าทั้งหลาย และแผ่นดินและสิ่งที่อยู่ระหว่างทั้งสอง หากพวกเจ้าเป็นผู้เชื่อมั่น"},{"number":8,"text":"ไม่มีพระผู้เป็นเจ้าอื่นใดอีกนอกจากพระองค์ ผู้ทรงให้เป็นและผู้ทรงให้ตาย พระเจ้าของพวกเจ้าและพระเจ้าแห่งบรรพบุรุษของพวกเจ้าในสมัยก่อน ๆ"},{"number":9,"text":"แต่ทว่าพวกเขากังวลอยู่ในการสงสัย"},{"number":10,"text":"ดังนั้น เจ้าจงคอยเฝ้าดูวันที่ชั้นฟ้าจะนำไอหมอกออกมาซึ่งจะเห็นได้ชัด"},{"number":11,"text":"ซึ่งจะครอบคลุมผู้คน นี่คือการลงโทษอันเจ็บปวด"},{"number":12,"text":"(พวกเขาจะกล่าวว่า) ข้าแต่พระเจ้าของข้าพระองค์ได้ทรงปลดเปลื้องการลงโทษนี้ ให้พ้นจากข้าพระองค์ แท้จริงพวกเราเป็นผู้ศรัทธา"},{"number":13,"text":"ข้อตักเตือนนั้นจะเป็นผลแก่พวกเขาได้อย่างไร ทั้ง ๆ ที่ได้มีร่อซูลผู้ชี้แจงอย่างแจ้งชัดมายังพวกเขาแล้ว"},{"number":14,"text":"แล้วพวกเขาก็ผินหลังออกไปจากเขา และพวกเขากล่าวว่าเขา (มุฮัมมัด) เป็นคนบ้าที่ได้รับการเสี้ยมสอน"},{"number":15,"text":"แน่นอนเราจะปลดเปลื้องการลงโทษนั้นให้พ้นไป (จากพวกเจ้า) ชั่วขณะหนึ่ง แล้วพวกเจ้าก็จะกลับไปสู่สภาพเดิม"},{"number":16,"text":"วันที่เราจะปราบพวกเขาด้วยการปราบครั้งยิ่งใหญ่ แน่นอนเราเป็นผู้ตอบแทนอย่างสาสม"},{"number":17,"text":"และโดยแน่นอน เราได้ทดสอบหมู่ชนของฟิรเอานฺก่อนหน้าพวกเขา และได้มีร่อซูล (มูซา) ผู้มีเกียรติมายังพวกเขา"},{"number":18,"text":"(โดยกล่าวว่า) จงมอบปวงบ่าวของอัลลอฮฺให้แก่ฉัน แท้จริงฉันคือร่อซูลผู้ซื่อสัตย์สำหรับพวกท่าน"},{"number":19,"text":"และพวกท่านอย่ายกตนเหนืออัลลอฮฺ แท้จริงฉันมาหาพวกท่านพร้อมด้วยหลักฐานอันชัดแจ้ง"},{"number":20,"text":"และแท้จริงฉันขอความคุ้มครองต่อพระเจ้าของฉัน และพระเจ้าของพวกท่านมิให้พวกท่านทำร้ายฉัน"},{"number":21,"text":"และถ้าหากพวกท่านไม่เชื่อฉันก็จงถอยห่างไปจากฉัน"},{"number":22,"text":"แล้วเขาก็วิงวอนขอต่อพระเจ้าของเขาว่า ชนเหล่านี้เป็นหมู่ชนผู้กระทำความผิด"},{"number":23,"text":"ดังนั้น จงเดินทางในเวลากลางคืนพร้อมด้วยปวงบ่าวของข้า เพราะพวกเจ้าจะถูกติดตามอย่างแน่นอน"},{"number":24,"text":"และจงปล่อยทะเลให้สงบนิ่ง (เหมือนเดิม) เพราะแท้จริงพวกเขาเป็นไพร่พลที่ถูกจมน้ำตาย"},{"number":25,"text":"กี่มากน้อยที่พวกเขาได้ทิ้งสวนหลากหลาย และน้ำพุหลายแห่ง"},{"number":26,"text":"และเรือกสวนไร่นา และอาคารระโหฐานอันมีเกียรติ"},{"number":27,"text":"และความสะดวกสะบายที่พวกเขาสนุกสนานร่าเริง"},{"number":28,"text":"เช่นนั้นแหละ เราได้ให้หมู่ชนอื่นรับมรดกครอบครองมัน"},{"number":29,"text":"และชั้นฟ้า และแผ่นดินมิได้ร่ำไห้เพราะ (เสียดาย) พวกเขาและพวกเขาจะไม่ถูกประวิงเวลา"},{"number":30,"text":"และโดยแน่นอน เราได้ให้วงศ์วานของอิสราเอลรอดพ้นจากการทรมานที่น่าอดสู"},{"number":31,"text":"จากฟิรเอานฺ แท้จริงเขาเป็นผู้โอหังที่มาจากผู้ฝ่าฝืน"},{"number":32,"text":"และโดยแน่นอนเราได้เลือกพวกเขาเหนือประชาชาติทั้งหลายในยุคนั้น เนื่องด้วยความรอบรู้ของเรา"},{"number":33,"text":"และเราได้ประทานสัญญาณต่าง ๆ แก่พวกเขา ซึ่งในนั้นมีข้อทดสอบอย่างชัดแจ้ง"},{"number":34,"text":"แท้จริงชนเหล่านั้น แน่นอนพวกเขาจะกล่าวว่า"},{"number":35,"text":"มันเป็นเพียงความตายครั้งแรกของเรา และเราจะไม่ถูกให้ฟื้นคืนชีพขึ้นมาอีก"},{"number":36,"text":"ดังนั้น จงนำบรรพบุรุษของเรากลับมาอีกซิ หากพวกท่านเป็นผู้ซื่อสัตย์จริง"},{"number":37,"text":"พวกเขา (กุฟฟารมักกะฮฺ) ดีกว่า หรือว่าหมู่ชนแห่งตุบบะอฺ (ชาวสะบะอฺแห่งเยเมน) และบรรดาหมู่ชนก่อนหน้าพวกเขาเราได้ทำลายล้างพวกเขา เพราะพวกเขาเหล่านั้นเป็นผู้กระทำความผิด"},{"number":38,"text":"และเรามิได้สร้างชั้นฟ้าทั้งหลาย และแผ่นดิน และสิ่งที่อยู่ระหว่างทั้งสองอย่าง อย่างไร้สาระ"},{"number":39,"text":"เรามิได้สร้างทั้งสอง (ดังกล่าวนั้น) เพื่ออื่นใดนอกจากเพื่อความจริง แต่ว่าส่วนมากของพวกเขาไม่รู้"},{"number":40,"text":"แท้จริงวันแห่งการตัดสินนั้นเป็นเวลาที่ถูกกำหนดไว้สำหรับพวกเขาทั้งหมด"},{"number":41,"text":"วันที่ญาติสนิทจะไม่อำนวยประโยชน์อันใดให้แก่ญาติสนิทอีกคนหนึ่งได้ และพวกเขาเองก็จะไม่ได้รับความช่วยเหลือ"},{"number":42,"text":"เว้นแต่ผู้ที่อัลลอฮฺทรงมีเมตตา แท้จริงพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงเมตตาเสมอ"},{"number":43,"text":"แท้จริงต้นซักกูม"},{"number":44,"text":"จะเป็นอาหารของผู้ทำบาปมาก"},{"number":45,"text":"เช่นทองแดงที่ถูกหลอมเดือด มันจะต้มเดือดอยู่ในท้อง"},{"number":46,"text":"เช่นการเดือดพล่านของน้ำร้อน"},{"number":47,"text":"(มีเสียงกล่าวแก่ยามเฝ้านรกว่า) จงจับเขาไปและลากเขาไปสู่กลางไฟที่ลุกโชน"},{"number":48,"text":"แล้วจงราดลงบนหัวของเป็นการลงโทษแห่งน้ำเดือด"},{"number":49,"text":"จงลิ้มรสการลงโทษซิ แท้จริงเจ้า (เคยพูดว่า) เป็นผู้มีอำนาจ ผู้มีเกียรติ"},{"number":50,"text":"แท้จริง นี้คือสิ่งที่พวกเจ้าเคยสงสัยไว้"},{"number":51,"text":"แท้จริงบรรดาผู้ยำเกรงจะอยู่ในสถานที่อันสงบปลอดภัย"},{"number":52,"text":"ท่ามกลางสวนสวรรค์หลากหลาย และน้ำพุหลายแห่ง"},{"number":53,"text":"พวกเขาจะสวมอาภรณ์ทำด้วยผ้าไหมละเอียด และผ้าไหมหยาบ หันหน้าเข้าหากัน"},{"number":54,"text":"เช่นนั้นแหละ และเราจะให้พวกเขามีคู่ครองเป็นหญิงสาววัยรุ่นมีดวงตาสวยงาม"},{"number":55,"text":"พวกเขาจะเรียกเอาผลไม้ทุกชนิดที่อยู่ในสวนสวรรค์นั้นอย่างปลอดภัย"},{"number":56,"text":"ในสวนสวรรค์นั้น พวกเขาจะไม่ได้ลิ้มรสความตาย นอกจากความตายครั้งแรก (ในโลกดุนยา) และพระองค์จะทรงคุ้มครองพวกเขาให้พ้นจากการลงโทษแห่งไฟนรก"},{"number":57,"text":"เป็นความโปรดปรานจากพระเจ้าของเจ้า นั่นคือความสำเร็จอันใหญ่หลวง"},{"number":58,"text":"ดังนั้นแท้จริงเราได้ทำให้อัลกุรอานเป็นที่ง่ายดายในภาษาของเจ้า (อาหรับ) เพื่อพวกเขาจะได้ใคร่ครวญ"},{"number":59,"text":"ฉะนั้น จงคอยดูเถิด แท้จริงพวกเขาก็จะเป็นผู้คอยเช่นกัน"}]}