{"number":55,"edition":"th.thai","ayahs":[{"number":1,"text":"พระผู้ทรงกรุณาปรานี"},{"number":2,"text":"พระองค์ทรงสอนอัลกุรอาน"},{"number":3,"text":"พระองค์ทรงสร้างมนุษย์"},{"number":4,"text":"พระองค์ทรงสอนเขาให้เปล่งเสียงพูด"},{"number":5,"text":"ดวงอาทิตย์ และดวงจันทร์โคจรตามวิถีที่แน่นอน"},{"number":6,"text":"และผักหญ้า และต้นไม้จะกราบสุญูด"},{"number":7,"text":"และชั้นฟ้านั้นพระองค์ทรงยกมันไว้สูง และทรงวางความสมดุลไว้"},{"number":8,"text":"เพื่อพวกเจ้าจะได้ไม่ฝ่าฝืนในเรื่องการชั่งตวงวัด"},{"number":9,"text":"และจงธำรงไว้ซึ่งการชั่งด้วยความเที่ยงธรรม และอย่าให้ขาดหรือหย่อนตาชั่ง"},{"number":10,"text":"และแผ่นดินนั้น พระองค์ทรงจัดเตรียมมันไว้ เพื่อสรรพสิ่งที่สร้างขึ้น"},{"number":11,"text":"ในแผ่นดินนั้นมีผลไม้ และต้นอินทผลัมที่มีผลซ้อนกันหลายชั้น"},{"number":12,"text":"และเมล็ดที่มีเปลือกและรำ และมีกลิ่นหอม"},{"number":13,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าของพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":14,"text":"พระองค์ทรงสร้างมนุษย์จากดินเหนียวมีเสียงเช่นเครื่องปั้นดินเผา"},{"number":15,"text":"และพระองค์ทรงสร้างญินจากเปลงไฟ"},{"number":16,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":17,"text":"พระเจ้าแห่งทิศตะวันออกทั้งสองและพระเจ้าแห่งทิศตะวันตกทั้งสอง"},{"number":18,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":19,"text":"พระองค์ทรงทำให้น่านน้ำทั้งสอง (ทะเลและแม่น้ำ) ไหลมาบรรจบกัน"},{"number":20,"text":"ระหว่างมันทั้งสองมีที่กั้นกีดขวาง มันจะไม่ล้ำเขตต่อกัน"},{"number":21,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":22,"text":"มีไข่มุกและหินปะการังออกมาจากมันทั้งสอง"},{"number":23,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":24,"text":"และเป็นของพระองค์คือ เรือขนาดใหญ่ลอยเด่นอยู่ในทะเลคล้ายกับภูเขา (บนบก)"},{"number":25,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":26,"text":"ทุก ๆ สิ่งที่อยู่บนแผ่นดินย่อมแตกดับ"},{"number":27,"text":"และพระพักตร์ของพระเจ้าของเจ้าผู้ทรงยิ่งใหญ่ ผู้ทรงโปรดปรานเท่านั้นที่จะยังคงเหลืออยู่"},{"number":28,"text":"ดังนั้น ด้วยบุญอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":29,"text":"ผู้ที่อยู่ในชั้นฟ้าทั้งหลาย และแผ่นดินจะขอพระองค์ทุก ๆ ขณะ พระองค์ทรงมีภาระกิจ"},{"number":30,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":31,"text":"อีกไม่ช้าเราจะจักการกับพวกเจ้า (ในกิจการต่าง ๆ) โอ้มนุษย์และญินเอ๋ย"},{"number":32,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":33,"text":"โอ้ชุมนุมแห่งญินและมนุษย์ทั้งหลาย เอ๋ย! หากพวกเจ้ามีความสามารถที่จะผ่านไปให้พ้นขอบฟ้าทั้งหลายและแผ่นดินนี้ได้ ก็จงผ่านไปให้พ้นเถิด แต่ว่าพวกเจ้าไม่สามารถที่จะผ่านไปให้พ้นได้เว้นแต่ด้วยพลัง (พระบัญชาและพระประสงค์ของอัลลอฮ)"},{"number":34,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":35,"text":"เปลวไฟ และทองเหลือง จะถูกส่งมายังเจ้าทั้งสองแล้วเจ้าทั้งสองก็ไม่อาจจะป้องกันตนเองได้"},{"number":36,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":37,"text":"ครั้นเมื่อชั้นฟ้าแตกกระจายออก มันจะกลายเป็นสีแดงคล้ายขี้ผึ้ง"},{"number":38,"text":"ดังนั้น ด้วยบุญอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสอง ที่เจ้าทั้งสองปฏิเสธ"},{"number":39,"text":"แล้วในวันนั้น มนุษย์และญินจะไม่ถูกถามถึงความผิดของเขา"},{"number":40,"text":"ดังนั้นด้วยบุญคุณอันใดเล่า แห่งพระเจ้าของเจ้าทั้งสอง ที่เจ้าทั้งสองปฏิเสธ"},{"number":41,"text":"บรรดาผู้ที่มีความผิดจะเป็นที่รู้จักกันได้ที่เครื่องหมายของพวกเขา แล้วจะถูกจับตรงผมที่ปีกหน้าผาก คือขมับและเท้า (แล้วลากลงนรก)"},{"number":42,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสอง ที่เจ้าทั้งสองปฏิเสธ"},{"number":43,"text":"นี่คือนรก ซึ่งบรรดาผู้ที่มีความผิดปฏิเสธไม่ยอมเชื่อ"},{"number":44,"text":"พวกเขาจะเดินวกเวียนอยู่รอบ ๆ ระหว่างมันกับน้ำร้อนที่เดือด"},{"number":45,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":46,"text":"และสำหรับผู้ที่ยำเกรง ต่อการยืนหน้าพระพักตร์แห่งพระเจ้าของเขา (เขาจะได้) สวนสวรรค์สองแห่ง"},{"number":47,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสอง ที่เจ้าทั้งสองปฏิเสธ"},{"number":48,"text":"(สวนสวรรค์สองแห่งนั้น) แผ่กิ่งก้านเขียวชอุ่ม และผลไม้หลายชนิด"},{"number":49,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":50,"text":"ในสวนสวรรค์ทั้งสองแห่งนั้นมีตาน้ำสองแห่งไหลพรั่งพรู"},{"number":51,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":52,"text":"ในสวนสวรรค์ทั้งสองแห่งนั้นมีผลไม้ทุกชนิดเป็นสองประเภท"},{"number":53,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":54,"text":"พวกเขานอนเอกเขนกอยู่บนฟูกนอนซึ่งซับในของมันทำด้วยไหมพรมอย่างดี ผลไม้ของสวนทั้งสองแห่งนั้นอยู่ใกล้แค่มือเอื้อม"},{"number":55,"text":"ดังนั้นด้วยบุญอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":56,"text":"ในสวนสวรรค์เหล่านั้นมีหญิงสาวพรหมจารี ผู้ลดสายตาลง (เฉพาะสามีของนางเท่านั้นป ซึ่งไม่มีมนุษย์ และไม่มีญินแตะต้องพวกนางมาก่อนเลย)"},{"number":57,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":58,"text":"คล้ายกับว่าพวกนางเป็นทับทิม และปะการัง"},{"number":59,"text":"ดังนั้นบุญคุณอันใดเล่า แห่งพระเจ้าของเจ้าทั้งสอง ที่เจ้าทั้งสองปฏิเสธ"},{"number":60,"text":"จะมีการตอบแทนความดีอันใดเล่านอกจากความดี"},{"number":61,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":62,"text":"และอื่นจากสวนสวรรค์ทั้งสองแห่งนั้นแล้ว ยังมีสวนสวรรค์อีกสองแห่ง"},{"number":63,"text":"ดังนั้นบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":64,"text":"(สวนสวรรค์) ทั้งสองนั้น เขียวชอุ่ม"},{"number":65,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":66,"text":"ในสวนสวรรค์ทั้งสองแห่งนั้น มีตาน้ำสองแห่งที่พวยพุ่งออกมาอย่างไม่ขาดสาย"},{"number":67,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":68,"text":"ในสวนสวรรค์ทั้งสองแห่งนั้นมีผลไม้และอินทผลัม และผลทับทิม"},{"number":69,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแหงพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":70,"text":"ในสวนสวรรค์เหล่านั้น มีหญิงสาวที่มีมารยาทดีสวย"},{"number":71,"text":"ดังนั้นด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":72,"text":"หญิงสาวผิวพรรณขาวผ่อง นัยตาคม (ที่เก็บตัวเฉพาะสามีของนางเท่านั้น) อยู่ในกระโจม"},{"number":73,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสอง ที่เจ้าทั้งสองปฏิเสธ"},{"number":74,"text":"ซึ่งไม่มีมนุษย์และไม่มีญิน แตะต้องพวกนางมาก่อนเลย"},{"number":75,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่า แห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":76,"text":"พวกเขาจะนอนเอกเขนกบนหมอนอิงสีเขียว และพรมที่มีลวดลายอย่างสวยงาม"},{"number":77,"text":"ดังนั้น ด้วยบุญคุณอันใดเล่าแห่งพระเจ้าของเจ้าทั้งสองที่เจ้าทั้งสองปฏิเสธ"},{"number":78,"text":"พระนามแห่งพระเจ้าของเจ้าผู้ทรงยิ่งใหญ่ ผู้ทรงโปรดปราน ทรงจำเริญยิ่ง"}]}