{"number":75,"edition":"th.thai","ayahs":[{"number":1,"text":"ข้าสาบานต่อวันกิยามะฮฺ"},{"number":2,"text":"และข้าขอสาบานต่อชีวิตที่ประณามตนเอง"},{"number":3,"text":"มนุษย์คิดหรือว่า เราจะไม่รวบรวมกระดูกของเขากระนั้นหรือ"},{"number":4,"text":"แน่นอนทีเดียวเราสามารถที่จะทำให้ปลายนิ้วมือของเขาอยู่ในสภาพที่สมบูรณ์"},{"number":5,"text":"แต่ว่ามนุษย์นั้นประสงค์ที่จะทำความชั่ว"},{"number":6,"text":"เขาถามว่า เมื่อใดเถ่าวันแห่งการฟื้นคืนชีพ (จะเกิดขึ้น)"},{"number":7,"text":"แต่เมื่อสายตามืดมัว"},{"number":8,"text":"และเมื่อดวงจันทร์ถูกบดบังอยู่ในความมืด"},{"number":9,"text":"และเมื่อดวงอาทิตย์และดวงจันทร์ถูกนำมารวมกัน"},{"number":10,"text":"วันนั้นมนุษย์จะกล่าวขึ้นว่าไหนเล่าทางหนี"},{"number":11,"text":"เปล่าเลย ! ไม่มีที่พึ่งพิงดอก"},{"number":12,"text":"ในวันนั้น ยังพระเจ้าของเจ้าเท่านั้น คือที่พักอันสงบสุข"},{"number":13,"text":"วันนั้นมนุษย์จะถูกแจ้งให้ทราบถึงสิ่งที่ได้กระทำไว้ล่วงหน้าและภายหลัง"},{"number":14,"text":"เปล่าเลย ! มนุษย์นั้นเป็นพยานต่อตัวของเขาเอง"},{"number":15,"text":"ถึงแม้ว่าเขาจะเสนอข้อแก้ตัวของเขาก็ตาม"},{"number":16,"text":"เจ้าอย่ากระดิกลิ้นของเจ้าเนื่องด้วยอัลกุรอานเพื่อเจ้าจะรีบเร่งจดจำ"},{"number":17,"text":"แท้จริง หน้าที่ของเราคือการรวบรวมอัลกุรอาน (ให้อยู่ในทรวงอกของเจ้า) และการอ่านเพื่อให้จดจำ"},{"number":18,"text":"ดังนั้นเมื่อเราอ่านอัลกุรอาน เจ้าก็จงติดตามการอ่านนั้น"},{"number":19,"text":"แล้วแท้จริงหน้าที่ของเราคือ การอธิบายอัลกุรอาน"},{"number":20,"text":"เปล่าเลย ! แต่ว่าพวกเจ้ารักการมีชีวิตอยู่ในโลกนี้"},{"number":21,"text":"และพวกเจ้าจะทิ้งปรโลก"},{"number":22,"text":"ในวันนั้นหลาย ๆ ใบหน้าจะเบิกบาน"},{"number":23,"text":"จ้องมองไปยังพระเจ้าของมัน"},{"number":24,"text":"และในวันนั้นหลาย ๆ ใบหน้าจะเศร้าสลด"},{"number":25,"text":"มันคิดว่าความหายนะอันใหญ่หลวงจะเกิดขึ้นแก่มัน"},{"number":26,"text":"เปล่าเลย ! เมื่อวิญญาณขึ้นมาถึงคอหอย"},{"number":27,"text":"และมีผู้กล่าวว่า ใครเล่าเป็นผู้ทำให้เขาฟื้นขึ้นเหมือนเดิม"},{"number":28,"text":"และเขามั่นใจว่า แท้จริงเขาต้องจากไป"},{"number":29,"text":"และขาข้างหนึ่งทับขาอีกข้างหนึ่ง (เพราะความกลัว)"},{"number":30,"text":"วันนั้น จะมีการนำพาไปยังพระเจ้าของเจ้า"},{"number":31,"text":"เพราะว่าเขาไม่เชื่อมั่น และไม่ละหมาด"},{"number":32,"text":"แต่เขาปฏิเสธและผินหลังกลับ"},{"number":33,"text":"แล้วเขาก็เดินอย่างองอาจไปหาพรรคพวกของเขาอย่างหยิ่งยะโส"},{"number":34,"text":"ความวิบัติจงมีแด่เจ้าเถิด แล้วก็ความวิบัติจงมีแด่เจ้าเถิด"},{"number":35,"text":"แล้วก็ความวิบัติจงมีแด่เจ้าเถิด แล้วก็ความวิบัติจงมีแด่เจ้าเถิด"},{"number":36,"text":"มนุษย์คิดหรือว่า เขาจะถูกปล่อยไว้โดยไร้จุดหมายกระนั้นหรือ"},{"number":37,"text":"เขามิได้เป็นน้ำกามหยดหนึ่งจากน้ำอสุจิที่ถูกพุ่งออกมากระนั้นหรือ"},{"number":38,"text":"แล้วเขาได้เป็นก้อนเลือดก้อนหนึ่งแล้วพระองค์ทรงบังเกิดแล้วก็ทรงทำให้ได้สัดส่วนสมบูรณ์"},{"number":39,"text":"แล้วพระองค์ทรงทำให้เขาเป็นคู่ เป็นเพศชายและเพศหญิง"},{"number":40,"text":"ดังนั้น พระองค์จะไม่สามารถที่จะให้คนตายมีชีวิตขึ้นมาอีกกระนั้นหรือ"}]}