{"number":44,"edition":"es.cortes","ayahs":[{"number":1,"text":"hm"},{"number":2,"text":"¡Por la Escritura clara"},{"number":3,"text":"¡La hemos revelado en una noche bendita! ¡Hemos advertido"},{"number":4,"text":"En ella se decide todo asunto sabiamente"},{"number":5,"text":"como cosa venida de Nosotros. Mandamos a enviados"},{"number":6,"text":"como misericordia venida de tu Señor. Él es Quien todo lo oye, Quien todo lo sabe"},{"number":7,"text":"Señor de los cielos, de la tierra y de lo que entre ellos está. Si estuvierais convencidos"},{"number":8,"text":"No hay más dios que Él. Él da la vida y da la muerte. Vuestro Señor y Señor de vuestros antepasados"},{"number":9,"text":"Pero ¡no! Ellos dudan y no lo toman en serio"},{"number":10,"text":"¡Espera, pues, el día que el cielo traiga un humo visible"},{"number":11,"text":"que cubra a los hombres! Será un castigo doloroso"},{"number":12,"text":"«¡Señor! ¡Aparta de nosotros el castigo! ¡Creemos!»"},{"number":13,"text":"¿De qué les servirá la amonestación, si ha venido a ellos un Enviado que habla claro"},{"number":14,"text":"y se han apartado de él y dicho: «¡Es uno a quien se ha instruido, un poseso!»"},{"number":15,"text":"«Vamos a apartar de vosotros el castigo por algún tiempo. Pero reincidiréis»"},{"number":16,"text":"El día que hagamos uso del máximo rigor, Nos vengaremos"},{"number":17,"text":"Antes que a ellos, habíamos probado al pueblo de Faraón. Un enviado noble vino a ellos"},{"number":18,"text":"«¡Entregadme a los siervos de Alá! Tenéis en mí a un enviado digno de confianza"},{"number":19,"text":"¡No os mostréis altivos con Alá! Vengo a vosotros con autoridad manifiesta"},{"number":20,"text":"Me refugio en mi Señor y Señor vuestro contra vuestro intento de lapidarme"},{"number":21,"text":"Si no os fiáis de mí, ¡dejadme!»"},{"number":22,"text":"Entonces, invocó a su Señor. «¡Ésta es gente pecadora!»"},{"number":23,"text":"«¡Sal de noche con Mis siervos! Os perseguirán"},{"number":24,"text":"¡Deja el mar en calma! Son un ejército que será anegado»"},{"number":25,"text":"¡Cuántos jardines y fuentes abandonaron"},{"number":26,"text":"cuántos campos cultivados, cuántas suntuosas residencias"},{"number":27,"text":"cuánto bienestar, en el que vivían felices"},{"number":28,"text":"Así fue y se lo dimos en herencia a otro pueblo"},{"number":29,"text":"Ni el cielo ni la tierra les lloraron. No se les concedió prórroga"},{"number":30,"text":"Y salvamos a los Hijos de Israel del humillante castigo"},{"number":31,"text":"de Faraón. Era altivo, de los inmoderados"},{"number":32,"text":"Les elegimos conscientemente de entre todos los pueblos"},{"number":33,"text":"Les dimos signos con los que les pusimos claramente a prueba"},{"number":34,"text":"Éstos dicen, sí"},{"number":35,"text":"«No moriremos más que una sola vez y no seremos resucitados"},{"number":36,"text":"¡Haced, pues, volver a nuestros padres, si es verdad lo que decís!»"},{"number":37,"text":"¿Eran mejores ellos que el pueblo de Tubba y que sus antecesores? Les hicimos perecer, eran pecadores"},{"number":38,"text":"No hemos creado los cielos, la tierra y lo que entre ellos está por puro juego"},{"number":39,"text":"No los creamos sino con un fin, pero la mayoría no saben"},{"number":40,"text":"El día del Fallo se darán todos cita"},{"number":41,"text":"Día en que nadie podrá proteger nada a nadie, nadie será auxiliado"},{"number":42,"text":"salvo aquél de quien Alá se apiade. Él es el Poderoso, el Misericordioso"},{"number":43,"text":"El árbol de Zaqqum"},{"number":44,"text":"es el alimento del pecador"},{"number":45,"text":"Es como metal fundido, hierve en las entrañas"},{"number":46,"text":"como agua hirviente"},{"number":47,"text":"«¡Cogedle y llevadle en medio del fuego de la gehena"},{"number":48,"text":"¡Castigadle, luego, derramando en su cabeza agua muy caliente!»"},{"number":49,"text":"«¡Gusta! ¡Tú eres 'el poderoso', 'el generoso'!»"},{"number":50,"text":"¡Esto es aquello de que dudabais"},{"number":51,"text":"Los que teman a Alá estarán, en cambio, en lugar seguro"},{"number":52,"text":"entre jardines y fuentes"},{"number":53,"text":"vestidos de satén y de brocado, unos enfrente de otros"},{"number":54,"text":"Así será. Y les daremos por esposas a huríes de grandes ojos"},{"number":55,"text":"Pedirán allí en seguridad, toda clase de frutas"},{"number":56,"text":"No gustarán alli otra muerte que la primera y Él les preservará del castigo del fuego de la gehena"},{"number":57,"text":"como favor de tu Señor. ¡Ése es el éxito grandioso"},{"number":58,"text":"En verdad, lo hemos hecho fácil en tu lengua. Quizás, así, se dejen amonestar"},{"number":59,"text":"¡Observa, pues! Ellos observan"}]}