{"number":78,"edition":"en.sarwar","ayahs":[{"number":1,"text":"What do they quarrel about"},{"number":2,"text":"They quarrel about the great news"},{"number":3,"text":"concerning which they have disputes"},{"number":4,"text":"(What they think is certainly despicable!). They will soon come to know (the reality)"},{"number":5,"text":"Yes, indeed, before long they will learn all about it"},{"number":6,"text":"Have We not made the earth as a place to rest"},{"number":7,"text":"and the mountains as pegs (to anchor the earth)"},{"number":8,"text":"Have We not created you in pairs"},{"number":9,"text":"made sleep for you to rest"},{"number":10,"text":"made the night as a covering"},{"number":11,"text":"and the day as time for you to make a living"},{"number":12,"text":"Have We not made seven strong heavens above you"},{"number":13,"text":"(the sun) as a shining torch"},{"number":14,"text":"and sent down heavy rains from the clouds"},{"number":15,"text":"to make the seeds, plants"},{"number":16,"text":"and thick gardens grow"},{"number":17,"text":"The Day of Judgment will certainly be the final appointment"},{"number":18,"text":"On that day the trumpet will be sounded and you will come (to Us) in huge groups"},{"number":19,"text":"The heavens will have openings like doors"},{"number":20,"text":"The mountains will be driven away and become like mirages"},{"number":21,"text":"Hell will lie in wait (for its prey)"},{"number":22,"text":"It will be a place of return"},{"number":23,"text":"for the rebellious ones and they will live therein for ages"},{"number":24,"text":"They will not feel cold nor taste any drink"},{"number":25,"text":"except boiling water and pus"},{"number":26,"text":"as a fitting recompense for their deeds"},{"number":27,"text":"They did not expect such a Judgment"},{"number":28,"text":"and persistently rejected Our revelations"},{"number":29,"text":"However, We have recorded everything in a book"},{"number":30,"text":"(They will be told), \"Suffer, We shall only increase the torment for you"},{"number":31,"text":"The pious ones will be triumphant"},{"number":32,"text":"They will have gardens and vineyards"},{"number":33,"text":"maidens with pears-shaped breasts who are of equal age (to their spouses)"},{"number":34,"text":"and cups full of wine"},{"number":35,"text":"They will not hear therein any unnecessary words or lies"},{"number":36,"text":"This will be their reward from your Lord, a favor from Him and a recompense for their deeds"},{"number":37,"text":"He is the Lord of the heavens and the earth and all that is between them. He is the Beneficent God and no one will be able to address Him"},{"number":38,"text":"On that day, the Spirit and the angels who stand in lines will not speak except those whom the Beneficent God has permitted, and he will speak the right words"},{"number":39,"text":"That will be the Day of the Truth. So let those who want seek refuge from their Lord"},{"number":40,"text":"We have warned you of the approaching torment. On that day, a person will see what his hands have committed. A disbeliever will say, \"Would that I had been dust"}]}