{"number":72,"edition":"fa.ayati","ayahs":[{"number":1,"text":"بگو: به من وحى شده است كه گروهى از جن گوش فرا دادند، و گفتند كه ما قرآنى شگفت شنيديم؛"},{"number":2,"text":"به راه راست هدايت مى‌كند. پس ما بدان ايمان آورديم و هرگز كسى را شريك پروردگارمان نمى‌سازيم"},{"number":3,"text":"عظمت پروردگار ما متعالى است. نه همسرى گيرد و نه فرزندى دارد"},{"number":4,"text":"و سفيه ما در باره خدا سخنانى به ناحق مى‌گفت"},{"number":5,"text":"و ما مى‌پنداشتيم كه آدمى و جن در باره خدا دروغ نمى‌گويند"},{"number":6,"text":"و نيز مردانى بودند از آدميان كه به مردانى از جن پناه مى‌بردند و بر طغيانشان مى‌افزودند"},{"number":7,"text":"همچنان كه شما مى‌پنداشتيد آنها هم مى‌پنداشتند كه خدا هيچ كس را دوباره زنده نمى‌سازد"},{"number":8,"text":"ما به آسمان رسيديم و آن را پر از نگهبانان قدرتمند و شهابها يافتيم"},{"number":9,"text":"ما در آنجايها كه مى‌توان گوش فرا داد مى‌نشستيم. اما هر كه اكنون گوش نشيند، شهابى را در كمين خود يابد"},{"number":10,"text":"از اين روى نمى‌دانيم كه آيا براى كسانى كه در روى زمين هستند بدى مقدر مى‌شود، يا پروردگارشان مى‌خواهد به راه راستشان ببرد"},{"number":11,"text":"برخى از ما صالحند و برخى جز آن، و ما فرقه‌هايى گوناگونيم"},{"number":12,"text":"ما مى‌دانيم كه خدا را در زمين ناتوان نمى‌كنيم و با گريختن نيز ناتوانش نسازيم"},{"number":13,"text":"و چون سخن هدايت شنيديم، بدان ايمان آورديم. و هر كه به پروردگارش ايمان آورد نه از نقصان مى‌ترسد و نه از ستم"},{"number":14,"text":"و بعضى از ما مسلمانند و بعضى از حق دور. و آنان كه اسلام آورده‌اند در جست و جوى راه راست بوده‌اند"},{"number":15,"text":"اما آنان كه از حق دورند هيزم جهنم خواهند بود"},{"number":16,"text":"و اگر بر طريقه راست پايدارى كنند، از آبى فراوان سيرابشان كنيم"},{"number":17,"text":"تا آنها را بيازماييم. و هر كه از ذكر پروردگارش اعراض كند او را به عذابى دشوار دراندازد"},{"number":18,"text":"و مسجدها از آنِ خداست. و با وجود خداى يكتا كسى را به خدايى مخوانيد"},{"number":19,"text":"چون بنده خدا براى پرستش او بر پاى ايستاد، گرد او را گرفتند"},{"number":20,"text":"بگو: تنها پروردگارم را مى‌خوانم و هيچ كس را شريك او نمى‌سازم"},{"number":21,"text":"بگو: من نمى‌توانم به شما زيانى برسانم يا شما را به صلاح آورم"},{"number":22,"text":"بگو: هيچ كس مرا از عقوبت خدا پناه ندهد و من جز او پناهگاهى نمى‌يابم"},{"number":23,"text":"آنچه مى‌توانم جز رساندن پيام او و انجام دادن رسالتهاى او نيست. و هر كه خدا و پيامبرش را نافرمانى كند، نصيب او آتش جهنم است كه همواره در آن خواهند بود،"},{"number":24,"text":"تا آنگاه كه آنچه را به آنها وعده داده بودند بنگرند. پس خواهند دانست چه كسى را ياران ناتوان‌تر و شمار كمتر بوده است"},{"number":25,"text":"بگو: من نمى‌دانم كه آيا آن وعده‌اى كه به شما داده‌اند نزديك است، يا پروردگار من براى آن زمانى نهاده است؟"},{"number":26,"text":"او داناى غيب است و غيب خود را بر هيچ كس آشكار نمى‌سازد،"},{"number":27,"text":"مگر بر آن پيامبرى كه از او خشنود باشد كه براى نگهبانى از او پيش روى و پشت سرش نگهبانى مى‌گمارد،"},{"number":28,"text":"تا بداند كه آنها پيامهاى پروردگارشان را رسانيده‌اند و خدا به آنچه در نزد آنهاست احاطه دارد و همه چيز را به عدد شمار كرده است"}]}