{"number":76,"edition":"fa.ayati","ayahs":[{"number":1,"text":"هرآينه بر انسان مدتى از زمان گذشت و او چيزى در خور ذكر نبود"},{"number":2,"text":"ما آدمى را از نطفه‌اى آميخته بيافريده‌ايم، تا او را امتحان كنيم. و شنوا و بينايش ساخته‌ايم"},{"number":3,"text":"راه را به او نشان داده‌ايم. يا سپاسگزار باشد يا ناسپاس"},{"number":4,"text":"ما براى كافران زنجيرها و غلها و آتش افروخته آماده كرده‌ايم"},{"number":5,"text":"نيكان از جامهايى مى‌نوشند كه آميخته به كافور است"},{"number":6,"text":"چشمه‌اى كه بندگان خدا از آن مى‌نوشند و آن را به هر جاى كه خواهند روان مى‌سازند"},{"number":7,"text":"به نذر وفا مى‌كنند و از روزى كه شر آن همه جا را گرفته است مى‌ترسند"},{"number":8,"text":"و طعام را در حالى كه خود دوستش دارند به مسكين و يتيم و اسير مى‌خورانند"},{"number":9,"text":"جز اين نيست كه شما را براى خدا اطعام مى‌كنيم و از شما نه پاداشى مى‌خواهيم نه سپاسى"},{"number":10,"text":"ما از پروردگار خود مى‌ترسيم، در روزى كه آن روز عبوس و سخت و هولناك است"},{"number":11,"text":"خدا ايشان را از شر آن روز نگه داشت و آنان را طراوت و شادمانى بخشيد"},{"number":12,"text":"به پاداش صبرى كه كرده‌اند پاداششان را بهشت و حرير داد"},{"number":13,"text":"در آنجا بر تختها تكيه زده‌اند نه هيچ آفتابى مى‌بينند و نه سرمايى"},{"number":14,"text":"سايه‌هاى درختانش بر سرشان افتاده و ميوه‌هايش به فرمانشان باشد"},{"number":15,"text":"كاسه‌هاى سيمين و كوزه‌هاى شراب ميانشان به گردش در مى‌آيد"},{"number":16,"text":"كوزه‌هايى از سيم كه آنها را به اندازه پُر كرده‌اند"},{"number":17,"text":"در آنجا جامى بنوشانندشان كه آميخته با زنجبيل باشد،"},{"number":18,"text":"از چشمه‌اى كه آن را سلسبيل مى‌گويند"},{"number":19,"text":"همواره پسرانى به گردشان مى‌چرخند كه چون آنها را ببينى، پندارى مرواريد پراكنده‌اند"},{"number":20,"text":"چون بنگرى، هر چه بنگرى نعمت فراوان است و فرمانروايى بزرگ"},{"number":21,"text":"بر تنشان جامه‌هايى است از سُندس سبز و استبرق. و به دستبندهايى از سيم زينت شده‌اند. و پروردگارشان از شرابى پاكيزه سيرابشان سازد"},{"number":22,"text":"اين پاداش شماست و از كوششتان سپاسگزارى شده است"},{"number":23,"text":"ما قرآن را بر تو نازل كرديم، نازل‌كردنى نيكو"},{"number":24,"text":"در برابر فرمان پروردگارت صابر باش و از هيچ گناهكار يا ناسپاسى اطاعت مكن"},{"number":25,"text":"و بامدادان و شامگاهان نام پروردگارت را بر زبان بياور"},{"number":26,"text":"در پاره‌اى از شب سجده‌اش كن و در همه درازناى شب تسبيحش گوى"},{"number":27,"text":"اينان اين دنياى زودگذر را دوست دارند و آن روز دشوار را پس پشت مى‌افكنند"},{"number":28,"text":"ما آدميان را آفريديم و اعضا و مفاصلشان را نيرومند گردانيديم و اگر خواهيم، به جاى آنها قومى همانندشان بياوريم"},{"number":29,"text":"اين اندرزى است. پس هر كه خواهد، راهى به سوى پروردگار خويش برگزيند"},{"number":30,"text":"و شما جز آن نمى‌خواهيد كه خدا خواسته باشد، زيرا خدا دانا و حكيم است"},{"number":31,"text":"هر كس را كه بخواهد مشمول رحمت خود سازد، و براى ستمكاران عذابى دردآور آماده كرده است"}]}