{"number":37,"edition":"ha.gumi","ayahs":[{"number":1,"text":"Inã rantsuwa da mãsu yin sahu-sahu (a cikin salla kõ yãƙi)"},{"number":2,"text":"Sa'an nan mãsu yin tsãwa dõmin gargaɗi"},{"number":3,"text":"Sa'an nan da mãsu karãtun abin tunãtarwa"},{"number":4,"text":"Lalle Abin bautawarku haƙĩƙa ¦aya ne"},{"number":5,"text":"Ubangijin sammai da ƙasã da abin da ke tsakãninsu, kuma Ubangijin wurãren fitar rãnã"},{"number":6,"text":"Lalle Mũ, Mun ƙãwatãr da sama ta kusa da wata ƙawa, watau taurãri"},{"number":7,"text":"Kuma sunã tsari daga dukan Shaiɗan mai tsaurin kai"},{"number":8,"text":"Bã zã su iya saurãre zuwa ga jama'a mafi ɗaukaka (Malã'iku) ba, kuma anã jĩfar su daga kõwane gẽfe"},{"number":9,"text":"Dõmin tunkuɗẽwa kuma sunã da wata azãba tabbatacciya"},{"number":10,"text":"Fãce wanda ya fizgi wata kalma, sai yũla mai haske ta bĩ shi"},{"number":11,"text":"Ka tambaye su: \"Shin sũ ne mafi wuya ga halittawa, kõ, kuwa waɗanda Muka halitta?\" Lalle Mũ, Mun halitta su daga lãkã mai ɗauri"},{"number":12,"text":"Ã'a, kã yi mãmãki, alhãli kuwa sunã ta yin izgili"},{"number":13,"text":"Kuma idan aka tunãtar da su, bã su tunãwa"},{"number":14,"text":"Idan suka ga wata ãyã, sai su dinga yin izgili"},{"number":15,"text":"Kuma su ce, \"Wannnan bã kõme ba, fãce sihiri, ne bayyananne"},{"number":16,"text":"Shin, idan mun mutu, kuma muka kasance turɓaya da kasũsuwa, ashe, lalle mũ tabbas waɗandaake tãyarwa ne"},{"number":17,"text":"Ashe kõ da ubanninmu na farko"},{"number":18,"text":"Ka ce: \"Na'am alhãli kuwa kunã ƙasƙantattu"},{"number":19,"text":"Tsãwa guda kawai ce, sai gã su, sunã dũbi"},{"number":20,"text":"Kuma su ce: \"Yã bonenmu! Wannan ita ce rãnar sakamako"},{"number":21,"text":"Wannan ita ce rãnar rarrabẽwa wadda kuka kasance kuna ƙaryatãwa"},{"number":22,"text":"Ku tãra waɗanda suka yi zãlunci, da abõkan haɗinsu, da abin da suka kasance sunã bautãwa"},{"number":23,"text":"Wanin Allah, sabõda haka ku shiryar da su zuwa ga hanyar Jahĩm"},{"number":24,"text":"Kuma ku tsayar da su, lalle su, waɗanda ake yi wa tambaya ne"},{"number":25,"text":"Me ya sãme ku, bã ku taimakon jũna"},{"number":26,"text":"Ã'a, sũ a yau, mãsu sallamãwa ne"},{"number":27,"text":"Kuma sãshensu ya fuskanta ga sãshe, sunã tambayar jũna"},{"number":28,"text":"Suka ce: \"Lalle kũ, kun kasance kunã jẽ mana daga wajen dãma (inda muka amince)"},{"number":29,"text":"Suka ce: \"Ã'a, ba ku kasance mũminai ba"},{"number":30,"text":"Kuma wani dalĩli bai kasance ba gare mu a kanku. Ã'a, kun kasance mutãne ne mãsu kẽtare iyãka"},{"number":31,"text":"Sabõda haka maganar Ubangijinmu ta wajaba a kanmu. Lalle mũ, mãsu ɗanɗanãwa ne"},{"number":32,"text":"Sabõda haka muka ɓatar da ku. Lalle mũ, mun kasance ɓatattu"},{"number":33,"text":"To lalle sũ a rãnar nan, mãsu tãrayya ne a cikin azãbar"},{"number":34,"text":"Lalle Mũ, kamar haka Muke aikatãwa game, da mãsu laifi"},{"number":35,"text":"Lalle sũ, sun kasance idan an ce musu: \"Bãbu abin bautãwa, fãce Allah,\" sai su dõra girman kai"},{"number":36,"text":"Kuma sunã cẽwa, \"Shin, mũ lalle mãsu barin gumãkanmu ne, sabõda maganar wani mawãƙi mahaukaci"},{"number":37,"text":"Ã'a, yã zo da gaskiya kuma ya gaskata Manzanni"},{"number":38,"text":"Lalle kũ, haƙĩƙa mãsu ɗanɗana azãba mai raɗaɗi ne"},{"number":39,"text":"Kuma bã zã a sãka muku ba fãce da abin da kuka kasance kunã aikatãwa"},{"number":40,"text":"Fãce bãyin Allah waɗanda aka tsarkake"},{"number":41,"text":"Waɗannan sunã da abinci sananne"},{"number":42,"text":"Ya'yan itãcen marmari, kuma sunã waɗanda ake girmamãwa"},{"number":43,"text":"A cikin gidãjen Aljannar ni'ima"},{"number":44,"text":"A kan karagu, sunã mãsu fuskantar jũna"},{"number":45,"text":"Anã kẽwayãwa a kansu da hinjãlan giya, ta daga waɗansu marẽmari"},{"number":46,"text":"Farã mai dãɗi ga mashãyan"},{"number":47,"text":"A cikinta bãbu jirĩ kuma ba su zama mãsu mãye daga gare ta ba"},{"number":48,"text":"Kuma a wurinsu, akwai mãtan aure mãsu taƙaita kallonsu, mãsu manyan idãnu"},{"number":49,"text":"Kamar dai su ƙwai ne ɓõyayye"},{"number":50,"text":"Sai sãshensu ya fuskanta a kan sãshe, sunã tambayar jũna"},{"number":51,"text":"Wani mai magana daga cikinsu ya ce: \"Lalle ni wani abõki ya kasance a gare ni (a dũniya)"},{"number":52,"text":"Yanã cewa, \"Shin, kai lalle, kanã daga mãsu gaskatãwa ne"},{"number":53,"text":"Ashe, idan muka mutu, kuma muka, kasance turɓaya da kasũsuwa, ashe, lalle, mũ tabbas waɗanda ake sãka wa ne"},{"number":54,"text":"(Mai maganar) ya ce: \"Shin, kõ ku, mãsu tsinkãya ne (mu gan shi)"},{"number":55,"text":"Sai ya tsinkãya, sai ya gan shi a cikin tsakar Jahim"},{"number":56,"text":"Ya ce (masa), \"Wallahi, lalle, kã yi kusa, haƙĩƙã, ka halakãni"},{"number":57,"text":"Kuma bã dõmin ni'imar Ubangijĩna ba, lalle, dã na kasance daga waɗanda ake halartarwa (tãre da kai a cikin wutã)"},{"number":58,"text":"Shin fa, ba mu zama mãsu mutuwa ba"},{"number":59,"text":"Sai mutuwarmu ta farko, kuma ba mu zama waɗanda ake azabtarwa ba"},{"number":60,"text":"Lalle, wannan shĩ ne babban rabo mai girma"},{"number":61,"text":"Sabõda irin wannan, sai mãsu aiki su yi ta aikatãwa"},{"number":62,"text":"Shin wancan shĩ ne mafi zama alhẽri ga liyafa kõ itãciyar zaƙƙũm"},{"number":63,"text":"Lalle, Mũ, Mun sanya ta fitina ga. azzãlumai"},{"number":64,"text":"Lalle ita wata itãciya ce wadda take fita daga asalin Jahĩm"},{"number":65,"text":"Gundarta, kamar dai shi kãnun Shaiɗan ne"},{"number":66,"text":"To, lalle sũ haƙĩƙa mãsu ci ne daga gare ta. Sa'an nan mãsu cika cikuna ne daga gare ta"},{"number":67,"text":"Sa'an nan lalle sunã da wani garwaye a kanta, daga ruwan zãfi"},{"number":68,"text":"Sa'an nan lalle makomarsu, haƙĩƙa, zuwa ga Jãhĩm take"},{"number":69,"text":"Lalle sũ, sun iske ubanninsu batattu"},{"number":70,"text":"Sabõda haka sũ, a kan gurãbunsu, suke gaggãwa"},{"number":71,"text":"Kuma tabbas haƙĩƙa mafi yawan mutãnen farko sun ɓace a gabãninsu"},{"number":72,"text":"Kuma tabbas haƙĩƙa, Mun aika mãsu gargaɗi a cikinsu"},{"number":73,"text":"Sai ka dũba yadda ãƙibar waɗanda aka yi wa gargaɗi ta kasance"},{"number":74,"text":"Fãce bãyin Allah waɗanda aka tsarkake"},{"number":75,"text":"Kuma lalle, haƙĩƙa' Nũhu ya kira Mu. To, madalla da mãsu karɓãwa, Mu"},{"number":76,"text":"Kuma Mun tsĩrar da shi da mutãnensa daga bakin ciki babba"},{"number":77,"text":"Muka sanya zurriyarsa sunã mãsu wanzuwa"},{"number":78,"text":"Kuma Muka bar masa (yabo) a cikin jama'ar ƙarshe"},{"number":79,"text":"Aminci ya tabbata ga Nũhu, a cikin halittu"},{"number":80,"text":"Lalle Mũ kamar haka Muke sãka wa mãsu kyautatãwa"},{"number":81,"text":"Lalle shi, yanã daga bãyinMu mũminai"},{"number":82,"text":"Sã'an nan Muka nutsar da waɗansunsu"},{"number":83,"text":"Kuma lalle daga ƙungiyarsa, haƙĩƙa, Ibrahĩm yake"},{"number":84,"text":"A lõkacin da ya je wa dangijinsa da zũciya kuɓutacciya"},{"number":85,"text":"A lõkacin da ya ce wa ubansa da mutãnensa, \"Mẽne ne kuke bautãwa"},{"number":86,"text":"Shin, ƙiren ƙarya (wãtau) gumãka, wanin Allah, kuke bautãwa"},{"number":87,"text":"To, mẽne ne zatonku game da Ubangijin halittu"},{"number":88,"text":"Sai ya yi dũbi, dũba ta sõsai, a cikin taurãri"},{"number":89,"text":"Sã'an nan ya ce: \"Nĩ mai rashin lãfiya ne"},{"number":90,"text":"Sai suka jũya ga barinsa, sunã mãsu jũyãwa da bãya"},{"number":91,"text":"Sai ya karkata zuwa ga gumãkansu, sa'an nan ya ce: \"Ashe bã zã ku ci ba"},{"number":92,"text":"Me ya sãme ku, bã ku magana"},{"number":93,"text":"Sai ya zuba dũka a kansu da hannun dãma"},{"number":94,"text":"Sai suka fuskanto zuwa gare shi, sunã gaggãwa"},{"number":95,"text":"Ya ce, \"Kunã bauta wa abin da kuke sassaƙawa"},{"number":96,"text":"Alhãli, Allah ne Ya halitta ku game da abin da kuke aikatãwa"},{"number":97,"text":"Suka ce: \"Ku gina wani gini sabõda shi, sa'an nan ku jẽfa shi a cikin Jahĩm"},{"number":98,"text":"Sabõda haka suka yi nufin makĩda game da shi. Sai Muka sanya su, sũ ne mafi ƙasƙanci"},{"number":99,"text":"Kuma (Ibrahĩm] ya ce: \"Lalle, nĩ mai tafiya ne zuwa ga Ubangijĩna, zai shiryar da ni"},{"number":100,"text":"Ya Ubangijĩna! Ka bã ni (abõkin zama) daga sãlihan mutãne"},{"number":101,"text":"Sai Muka yi masa bushãra da wani yãro mai haƙuri"},{"number":102,"text":"To, a lõkacin da ya isa aiki tãre da shi, ya ce: \"Ya ƙaramin ɗãna! Lalle ne inã gani, a ciki barci, lalle inã yanka ka. To, ka dũba mẽ ka gani?\" (Yãron) ya ce: \"Ya, Bãbãna! Ka aikata abin da aka umurce ka, zã ka sãme ni, in Allah Ya so, daga mãsu haƙuri"},{"number":103,"text":"To, a lõkacin da suka yi sallama, (Ibrahĩm) ya kãyar da shi ga gẽfen gõshinsa"},{"number":104,"text":"Kuma Muka kira shi cẽwa \"Ya Ibrahĩm"},{"number":105,"text":"Haƙĩƙa kã gaskata mafarkin.\" Lalle kamar haka Muke sãka wa mãsu kyautatãwa"},{"number":106,"text":"Lalle wannan ita ce jarrabãwa bayyananna"},{"number":107,"text":"Kuma Muka yi fansar yãron da wani abin yanka, mai girma"},{"number":108,"text":"Kuma Muka bar (yabo) a kansa a cikin mutãnen ƙarshe"},{"number":109,"text":"Aminci ya tabbata ga Ibrãhĩm"},{"number":110,"text":"Kamar haka Muke sãka wa mãsu kyautatãwa"},{"number":111,"text":"Lalle shĩ, yanã daga bãyinMu mũminai"},{"number":112,"text":"Kuma Muka yi masa bushãra Da Is'hãƙa ya zama Annabi daga sãlihan mutãne"},{"number":113,"text":"Kuma Muka yi albarka a gare shi, kuma ga Is'hãka. Kuma daga cikin zurriyarsu akwai mai kyautatãwa da kuma maizãlunci dõmin kansa, mai bayyanãwa (ga zãluncin)"},{"number":114,"text":"Kuma lalle, Mun yi ni'ima ga Mũsã da Hãrũna"},{"number":115,"text":"Kuma Muka tsĩrar da su da mutãnensu daga bakin ciki mai girma"},{"number":116,"text":"Kuma Muka taimake su, sabõda haka suka kasance mãsu rinjãya"},{"number":117,"text":"Kuma Muka ba su Littãfi mai iyãkar bayãni"},{"number":118,"text":"Kuma Muka shiryar da su ga hanya mĩƙaƙƙiya"},{"number":119,"text":"Kuma Muka bar (yabo) a gare su a cikin mutãnen karshe"},{"number":120,"text":"Aminci ya tabbata ga Mũsã da Hãruna"},{"number":121,"text":"Lalle kamar haka Muke sãka wa mãsu kyautatãwa"},{"number":122,"text":"Lalle, sunã daga bãyinMu mũminai"},{"number":123,"text":"Kuma lalle Ilyãs, haƙĩƙa, yanã daga Manzanni"},{"number":124,"text":"A lõkacin da yake ce wa mutãnensa, \"Ashe, bã zã ku yi taƙawa ba"},{"number":125,"text":"Shin, kunã bauta wa Ba'al ne, kuma kunã barin Mafi kyautatãwar mãsu halitta"},{"number":126,"text":"Allah Ubangijinku, kuma Ubangijin ubanninku farko"},{"number":127,"text":"Sai suka ƙaryata shi. Sabõda haka sũ lalle waɗanda zã a halartãwa ne (a wutã)"},{"number":128,"text":"Sai bãyin Allah waɗanda aka tsarkake"},{"number":129,"text":"Kuma Muka bar (yabo) a gare shi, a cikin mutãnen ƙarshe"},{"number":130,"text":"Aminci ya tabbata ga Ilyãs"},{"number":131,"text":"Lalle Mũ kamar haka Muke sãka wa mãsu kyautatãwa"},{"number":132,"text":"Lalle shĩ, yanã daga bãyinMu mũminai"},{"number":133,"text":"Kuma lalle Lũdu, haƙĩƙa, yanã daga Manzanni"},{"number":134,"text":"A lõkacin da Muka tsĩrar da shi, da mutãnensa gabã ɗaya"},{"number":135,"text":"Sai wata tsõhuwa tanã a cikin mãsu wanzuwa (a cikin azãba)"},{"number":136,"text":"Sã'an nan Muka darkãke waɗansu mutãnen"},{"number":137,"text":"Kuma lalle kũ, haƙĩƙa, kunã shũɗewa a kansu, kunã mãsu asubanci"},{"number":138,"text":"Kuma da dare. Shin fa, bã zã ku hankalta ba"},{"number":139,"text":"Kuma lalle Yũnusa, haƙĩƙa, yanã daga Manzanni"},{"number":140,"text":"A lõkacin da ya gudu zuwa ga jirgin ruwa wanda aka yi wa lõdi"},{"number":141,"text":"Sã'an nan ya yi ƙuri'a, sai ya kasance a cikin waɗanda aka rinjaya"},{"number":142,"text":"Sai kĩfi ya yi lõma da shi, alhãli kuwa yanã wanda ake zargi"},{"number":143,"text":"To, ba dõmin lalle shi ya kasance daga mãsu tasbĩhi ba"},{"number":144,"text":"Lalle dã ya zauna a cikin cikinsa har ya zuwa rãnar da zã a tãyar da su"},{"number":145,"text":"Sai Muka jẽfa shi ga wani fĩli alhãli kuwa yanã mai raunin rashin lãfiya"},{"number":146,"text":"Kuma Muka tsirar da wata itãciya ta kankana a kusa da shi"},{"number":147,"text":"Kuma Muka aika shi zuwa ga waɗansu mutãne dubuɗari, kõ sunã ƙaruwa (a kan haka)"},{"number":148,"text":"Sai suka yi ĩmãni sabõda haka Muka jiyar da su dãdi har wani lõkaci"},{"number":149,"text":"Sabõda haka, ka tambaye su, \"Shin, Ubangijinka ne da 'ya'ya mãtã, kuma su da ɗiya maza"},{"number":150,"text":"Kõ kuma Mun halitta malã'iku mãtã ne, alhãli kuwa sũ sunãhalarce"},{"number":151,"text":"To! Lalle sũ, daga ƙiren ƙaryarsu sunã cẽwa"},{"number":152,"text":"Allah Yã haihu,\" alhãli kuwa lalle sũ, haƙĩƙa maƙaryata ne"},{"number":153,"text":"Shin, Yã zãɓi 'yã'ya mãtã ne a kan ɗiya maza"},{"number":154,"text":"Mẽ ya same ku? Yãya kuke hukuntãwa (wannanhukunci)"},{"number":155,"text":"Shin, bã ku tunãni"},{"number":156,"text":"Ko kuma kunã da wani dalĩli bayyananne ne"},{"number":157,"text":"To, ku zo da littãfinku idan kun kasance mãsu gaskiya"},{"number":158,"text":"Kuma suka sanya nasaba a tsakãninSa da tsakãnin aljannu. Alhãli kuwa Lalle aljannu sun sani, \"Lalle sũ, haƙĩƙa waɗanda ake halartarwa ne (a cikin wutã)"},{"number":159,"text":"Tsarki ya tabbata ga Allah daga abin da suke siffantãwa"},{"number":160,"text":"Sai bãyin Allah waɗanda aka tsarkake"},{"number":161,"text":"To, lalle, ku da abin da kuke bautãwa"},{"number":162,"text":"Ba ku zama mãsu buwãya ba a gare Shi"},{"number":163,"text":"Sai wanda yake mai shiga babbar wutã Jahĩm"},{"number":164,"text":"Kuma bãbu kõwa daga cikinmu, fãce yanã da matsayi sananne"},{"number":165,"text":"Kuma lalle mu, haƙĩƙa, mũ ne mãsu yin sahu-sahu (dõmin ibãda)"},{"number":166,"text":"Kuma lalle mũ haƙĩƙa, mũ ne mãsu yin tasbĩhi"},{"number":167,"text":"Kuma lalle sũ, sun kasance sunã cẽwa"},{"number":168,"text":"Dã lalle munã da wani littãfi irin na mutãnen farko"},{"number":169,"text":"Lalle dã mun kasance bãyin Allah waɗanda aka tsarkake"},{"number":170,"text":"Sai suka kãfirta da shi. Sabõda haka zã su sani"},{"number":171,"text":"Kuma lalle, haƙĩƙa kalmarMu ta gabãta ga bãyinMu, Manzanni"},{"number":172,"text":"Lalle sũ, haƙĩƙa, sũ ne waɗanda ake taimako"},{"number":173,"text":"Kuma lalle rundunarMu, haƙĩƙa, sũ ne marinjaya"},{"number":174,"text":"Sabõda haka juya daga barinsu, har a wani lõkaci"},{"number":175,"text":"Ka nũna musu (gaskiya), da haka zã su dinga gani"},{"number":176,"text":"Shin fa, da azabarMu suke nẽman gaggãwa"},{"number":177,"text":"To, idan ta sauka ga farfãjiyarsu, to, sãfiyar wadanda ake yi wa gargaɗi ta mũnana"},{"number":178,"text":"Kuma ka jũya daga barinsu har a wani lõkaci"},{"number":179,"text":"Ka nũna (musu gaskiya), da haka zã su dinga nũnãwa"},{"number":180,"text":"Tsarki ya tabbata ga Ubangijinka, Ubangijin rinjãye, daga barin abin da suke siffantãwa"},{"number":181,"text":"Kuma aminci ya tabbata ga Manzanni"},{"number":182,"text":"Kuma gõdiya ta tabbata ga Allah Ubangijin halittu"}]}