{"number":74,"edition":"ha.gumi","ayahs":[{"number":1,"text":"Yã wanda ya lulluɓa da mayãfi"},{"number":2,"text":"Ka tãshi dõmin ka yi gargaɗi"},{"number":3,"text":"Kuma Ubangijinka, sai ka girmama Shi"},{"number":4,"text":"Kuma tutãfinka, sai ka tsarkake su"},{"number":5,"text":"Kuma gumãka, sai ka ƙaurace musu"},{"number":6,"text":"Kada ka yi kyauta kana nẽman ƙãri"},{"number":7,"text":"Kuma sabõda Ubangijinka? Sai ka yi haƙure"},{"number":8,"text":"To, idan aka yi bũsa a cikin ƙaho"},{"number":9,"text":"To, wannan, a rãnar nan, yini ne mai wuya"},{"number":10,"text":"A kan kãfirai, bã mai sauƙi ba ne"},{"number":11,"text":"Ka bar Ni da wanda Na halitta, yana shi kaɗai"},{"number":12,"text":"Kuma Na sanya masa dũkiya shimfiɗaɗɗiya"},{"number":13,"text":"Da ɗiyã halartattu"},{"number":14,"text":"Kuma Na shimfiɗa? masa kõme shimfiɗãwa"},{"number":15,"text":"Sa'an nan, yanã kwaɗayin in yi masa ƙãri"},{"number":16,"text":"Faufau! Lalle ne, shĩ yã kasance, ga ãyõyinMu, mai tsaurin kai"},{"number":17,"text":"Zã Ni kallafa masa wahala mai hauhawa"},{"number":18,"text":"Lalle ne, Shi, yã yi tunãni, kuma yã ƙaddara (abin da zai faɗã game da Alƙur'ãni)"},{"number":19,"text":"Sabõda haka, aka la'ane shi, kamar yadda ya ƙaddara"},{"number":20,"text":"Sa'an nan, aka la'ane shi kamar yadda ya ƙaddara"},{"number":21,"text":"Sa'an nan, ya yi tunãni"},{"number":22,"text":"Sa'an nan, ya gintse huska? kuma ya yi murtuk"},{"number":23,"text":"Sa'an nan, ya jũya bãya, kuma ya bunƙãsa"},{"number":24,"text":"Sai ya ce: \"Wannan abu dai bã kõme ba ne fãce wani sihiri, wanda aka ruwaito"},{"number":25,"text":"Wannan maganar mutum dai ce"},{"number":26,"text":"Zã Ni ƙõna shi da Saƙar"},{"number":27,"text":"Kuma mẽ ya sanar da kai abin da akẽ cẽwa Saƙar"},{"number":28,"text":"Bã ta ragẽwa, kuma bã ta bari"},{"number":29,"text":"Mai nãcẽwa ga jiki ce (da (ƙũna)"},{"number":30,"text":"A kanta akwai (matsara) gõma shã tara"},{"number":31,"text":"Kuma ba Mu sanya ma'abũta wutã (wãto matsaranta) ba, fãce malã'iku, kuma ba Mu sanya adadinsu (gõma sha tara) ba, fãce dõmin fitina ga waɗanda suka kãfirta domin waɗanda aka bai wa littãfi su sãmi yaƙĩni kuma waɗanda suka yi ĩmãni su ƙãra ĩmãni, kuma waɗanda aka bai wa littãfi da mũminai bã zã su yi shakka ba, kuma domin wa ɗanda a cikin zukatansu akwai wata cuta da kãfirai su ce: \"Mẽ Allah Yake nufi da wannan, ya kasance misãli?\" Haka dai Allah ke ɓatar da wanda Ya so, kuma Ya shiryar da wanda ya so. Kuma bãbu wanda ya san mayãƙan Ubangijinka fãce Shi, kuma ita (wutar) ba ta kasance ba fãce wata tunãtarwa ce ga mutum"},{"number":32,"text":"A'aha! Ina rantsuwa da watã"},{"number":33,"text":"Da dare a lõkacin da ya jũyar da baya"},{"number":34,"text":"Da sãfiya idan ta wãye"},{"number":35,"text":"Ita (wutar) ɗayan manyan masĩfũ? ce"},{"number":36,"text":"Mai gargaɗĩ ce ga mutum"},{"number":37,"text":"Ga wanda ya so, daga cikinku, ya gabãta ko ya jinkirta"},{"number":38,"text":"Kõwane rai ga abin da ya aikata jingina ce"},{"number":39,"text":"Fãce mutãnen dãma"},{"number":40,"text":"A cikin Aljanna suna tambayar jũna"},{"number":41,"text":"Game da mãsu laifi"},{"number":42,"text":"(Su ce musu) \"Me ya shigar da ku a cikin Saƙar"},{"number":43,"text":"Suka ce: \"Ba mu kasance munã a cikin mãsu salla ba"},{"number":44,"text":"Kuma ba mu kasance muna ciyar da matalautã ba"},{"number":45,"text":"Kuma mun kasance muna kũtsãwa tãre da mãsu kũtsãwa"},{"number":46,"text":"Mun kasance munã ƙaryata rãnar sãkamako"},{"number":47,"text":"Har gaskiya (wãto mutuwa) ta zo mana"},{"number":48,"text":"Sabõda haka cẽton mãsu cẽto bã zai amfãne su ba"},{"number":49,"text":"Haba! Me ya same su, suka zama mãsu bijirewa daga wa'azin gaskiya"},{"number":50,"text":"Kamar dai sũ, jãkuna firgitattu ne"},{"number":51,"text":"Sun gudu daga zãki"},{"number":52,"text":"A'aha! Kõwãne mutum daga cikinsu yanã son a zo masa da takardu (da sũnansa) ana wãtsãwa"},{"number":53,"text":"A'aha! Kai dai, bã su jin tsõron Lãhira"},{"number":54,"text":"A'aha! Lalle ne, shi (Alƙur'ãni) tunãtarwa ce"},{"number":55,"text":"Dõmin wanda ya so, ya tuna"},{"number":56,"text":"Kuma bã zã su tuna ba fãce idan Allah Ya so, Shi ne Ya cancanta a bi Shi da taƙawa kuma Ya cancanta ga Ya yi gãfara"}]}