{"number":15,"edition":"tg.ayati","ayahs":[{"number":1,"text":"Алиф, лом, ро. Ин аст-оёти китоб ва Қуръони равшангар"},{"number":2,"text":"Бисёр вақт кофирон орзу кунанд, ки эй кош мусалмон мебуданд"},{"number":3,"text":"Бигузорашон, то бихӯранд ва баҳравар шаванд ва орзу ба худ машғулашон дорад, ба зуди хоҳанд донист"},{"number":4,"text":"Ҳар деҳаеро ҳалок кардем, албатта замоне маълум дошт"},{"number":5,"text":"Ҳеҷ уммате аз аҷали худ на пеш меафтад ва на пас мемонад"},{"number":6,"text":"Ва гуфтанд: «Эй марде, ки Қуръон ба ту нозил шуда, ҳаққо, ки ту девонаӣ"},{"number":7,"text":"Агар рост мегӯӣ, чаро фариштагонро барои мо намеоварӣ?»"},{"number":8,"text":"Мо фариштагонро ғайри ба ҳақ нозил намекунем ва дар он ҳангом дигар мӯҳлаташон надиҳанд"},{"number":9,"text":"Мо Қуръонро худ нозил кардаем ва худ нигаҳбонаш ҳастем"},{"number":10,"text":"Ва Мо расулони худро пеш аз ту ба миёни қавмҳои пешин фиристодаем"},{"number":11,"text":"Ҳар паёмбаре бар онҳо фиристода шуд, албатта масхарааш карданд"},{"number":12,"text":"Роҳашро дар дили гунаҳгорон инчунин мекушоем"},{"number":13,"text":"Ба он имон намеоваранд ва суннати пешиниён чунин будааст"},{"number":14,"text":"Агар барояшон аз осмон даре бикушоем, ки аз он боло раванд"},{"number":15,"text":"гӯянд: «Чашмони моро ҷоду кардаанд, балки мо мардуме ҷодузада ҳастем!»"},{"number":16,"text":"Ва албатта дар осмон бурҷҳое офаридем ва барон бинандагонашон биёростем"},{"number":17,"text":"Ва аз ҳар шайтони раҷиме ҳифзашон кардем"},{"number":18,"text":"Ғайри он ки дуздона гӯш медод ва шарорае равшан таъқибаш кард"},{"number":19,"text":"Ва заминро густурдем ва дар он кӯҳҳое азим афкандем. Ва аз ҳар чиз ба шевае санҷида дар он рӯёнидем"},{"number":20,"text":"Ва маъишати шумо ва касонеро, ки шумо рӯзидеҳашон нестед, дар он ҷо қарор додем"},{"number":21,"text":"Ҳар чӣ ҳаст, хазинаҳои он назди Мост ва Мо ҷуз ба андозае муъайян онро намефиристем"},{"number":22,"text":"Ва бодҳои обистанкунандаро фиристодем ва аз осмон обе нозил кардем ва шуморо ба он сероб сохтем ва шуморо нарасад, ки хазинадори он, бошед"},{"number":23,"text":"Албатта Мо ҳастем, ки зинда мекунем ва мемиронем ва баъд аз ҳама боқӣ мемонем"},{"number":24,"text":"Ва медонем чӣ касоне аз шумо аз ин пеш рафтаанд ва чӣ касоне боқӣ мондаанд"},{"number":25,"text":"Ва Парвардигори ту ҳамаро зинда карда ҷамъ мегардонад, зеро Ӯст, ки ҳакиму доност"},{"number":26,"text":"Мо одамиро аз гили хушк, аз лаҷани (лойи) бӯйнок офаридем"},{"number":27,"text":"Ва ҷинро пеш аз он аз оташи сӯзандаи бедуд офарида будем"},{"number":28,"text":"Ва Парвардигорат ба фариштагон гуфт: «Мехоҳам башаре аз гили хушк, аз лои бӯйнок биёфаринам"},{"number":29,"text":"Чун офаринишамро ба поён бурдам ва аз рӯҳи Худ дар он дамидам, дар баробари ӯ ба саҷда бияфтед»"},{"number":30,"text":"Фариштагон ҳамагӣ саҷда карданд"},{"number":31,"text":"ғайри Иблис, ки сар боззад, ки бо саҷдакунандагон бошад"},{"number":32,"text":"Гуфт: «Эй Иблис, чаро ту аз саҷдакунандагон Набудӣ?»"},{"number":33,"text":"Гуфт: «Ман барои башаре, ки аз гили хушк, аз лойи бӯйнок офаридаӣ, саҷда намекунам»"},{"number":34,"text":"Гуфт: «Аз он ҷо берун шав, ки рондашуда ҳастӣ"},{"number":35,"text":"То рӯзи қиёмат бар ту лаънат аст!»"},{"number":36,"text":"Гуфт: «Эй Парвардигори ман, маро то рӯзе, ки дубора зинда мешаванд, мӯҳлат деҳ»"},{"number":37,"text":"Гуфт: «Ту дар шумори мӯҳлатёфтагонӣ"},{"number":38,"text":"то он рӯзе, ки вақташ маълум аст»"},{"number":39,"text":"Гуфт: «Эй Парвардигори ман, чун маро ноумед кардӣ, дар рӯи замин бадиҳоро дар назарашон биёроям ва ҳамагонро гумроҳ кунам"},{"number":40,"text":"ғайри онҳо, ки бандагони боихлоси Ту бошанд»"},{"number":41,"text":"Гуфт: «Роҳи ихлос роҳи ростест, ки ба Ман мерасад"},{"number":42,"text":"Туро бар бандагони Ман ғолибияте нест, магар бар он гумроҳоне, ки туро пайравӣ кунанд"},{"number":43,"text":"Ва ҷаҳаннам ваъдагоҳи ҳама аст"},{"number":44,"text":"Ҳафт дар дорад ва барои хар дар гурӯҳе аз онон муъайян шудаанд"},{"number":45,"text":"Парҳезгорон дар биҳиштҳо, канори чашмасоронанд"},{"number":46,"text":"Ба саломату эминӣ дохил шавед»"},{"number":47,"text":"Ҳар кинаеро аз дилашон баркандаем, ҳама бародаранд, бар тахтҳо рӯбарӯи ҳаманд"},{"number":48,"text":"Ҳеҷ ранҷе ба онҳо намерасад ва аз он ҷо берунашон наронанд"},{"number":49,"text":"Ба бандагонам хабар деҳ, ки ман бахшояндаву меҳрубонам"},{"number":50,"text":"Ва азоби Ман азобе дардовар аст"},{"number":51,"text":"Ва аз меҳмонони Иброҳим хабардорашон кун»"},{"number":52,"text":"Он гоҳ, ки бар ӯ дохил шуданд ва гуфтанд: «Салом!» Иброҳим гуфт: «Мо аз шумо метарсем!»"},{"number":53,"text":"Гуфтанд: «Матарс, мо туро ба писаре доно мужда (хушхабар) медиҳем»"},{"number":54,"text":"Гуфт: «Оё маро мужда медиҳед, бо он ки пир шудаам? Ба чӣ чиз муждаам медиҳед?»"},{"number":55,"text":"Гуфтанд: «Ба ҳақ хушхабарат додем, аз ноумедон мабош!»"},{"number":56,"text":"Гуфт: «Ҷуз гумроҳон чӣ касе аз раҳмати Парвардигораш ноумед мешавад?»"},{"number":57,"text":"Гуфт: «Эй расулон, кори шумо чист?»"},{"number":58,"text":"Гуфтанд: «Мо ба сари мардуме гунаҳкор фиристода шудаем"},{"number":59,"text":"ғайри хонадони Лут, ки ҳамаро наҷот медиҳем"},{"number":60,"text":"ҷуз занашро, ки муқаррар кардаем, ки аз боқимондагон бошад»"},{"number":61,"text":"Чун расулон назди хонадони Лут омаданд"},{"number":62,"text":"Лут гуфт: «Шумо бегонаед»"},{"number":63,"text":"Гуфтанд: «На, чизеро, ки дар он шак мекарданд, овардаем"},{"number":64,"text":"Мо туро хабари рост овардаем ва мо ростгӯёнем"},{"number":65,"text":"Чун посе аз шаб бигзарад, хонадони худро берун бубар ва худ аз паи онҳо рав ва набояд ҳеҷ як аз шумо ба ақиб бингарад. Ва ҳар ҷо, ки фармонатон додаанд, биравед»"},{"number":66,"text":"Ва барои ӯ ҳодисаро ҳикоят кардем, ки чун субҳ фаро расад, решаи онҳо барканда шавад"},{"number":67,"text":"Аҳли шаҳр шодикунон омаданд"},{"number":68,"text":"Гуфт: «Инҳо меҳмонони мананд, маро расво макунед"},{"number":69,"text":"Аз Худованд битарсед ва маро шармсор масозед»"},{"number":70,"text":"Гуфтанд: «Магар туро аз мардум манъ накарда будем?»"},{"number":71,"text":"Гуфт: «Агар қасде доред, инак духтарони ман ҳастанд»"},{"number":72,"text":"Ба ҷони ту савганд, ки онҳо дар мастии худ саргашта буданд"},{"number":73,"text":"Чун субҳ бидамид, ононро фарёд фурӯ гирифт"},{"number":74,"text":"Шаҳрро зеру забар кардем ва бороне аз сиҷҷил бар онон боронидем"},{"number":75,"text":"Дар ин ибратҳост барои ибратгирандагон"},{"number":76,"text":"Ва он шаҳр акнун дар сари роҳи корвониён аст"},{"number":77,"text":"Ва мӯъминонро дар он ибратест"},{"number":78,"text":"Ва мардуми Айка низ ситамкор буданд"},{"number":79,"text":"Аз онҳо интиқом гирифтем ва шаҳрҳои он ду қавм ошкоро бар сари роҳанд"},{"number":80,"text":"Мардуми Ҳиҷр низ паёмбаронро ба дурӯғ нисбат доданд"},{"number":81,"text":"Оёти Худро бар онон расонидем, вале аз он рӯй мегардонданд"},{"number":82,"text":"Хонаҳои худро, то тинҷ бошанд, дар куҳҳо меканданд"},{"number":83,"text":"Субҳгоҳон ононро фарёд фурӯ гирифт"},{"number":84,"text":"Кирдорашон аз онҳо дафъи бало накард"},{"number":85,"text":"Осмонҳову замин ва он чиро, ки миёни онҳост, ба ғайри ҳақ наёфаридаем. Ва бешак қиёмат фаро мерасад. Пас гузашт кун, гузаште некӯ"},{"number":86,"text":"Албатта Парвардигори ту офаринандае доност"},{"number":87,"text":"Мо сабъаммасонӣ ва Қуръони бузургро ба ту додем"},{"number":88,"text":"Агар баъзе аз мардону занонашонро ба чизе баҳравар сохтаем, ту ба он нигоҳ макун. Ва ғами онҳоро махӯр. Ва дар баробари мӯъминон фурӯтан (хоксор) бош"},{"number":89,"text":"Ва бигӯ: «Ман бимдиҳандае равшангарам»"},{"number":90,"text":"Ҳамонанди азобе, ки бар тақсимкунандагон нозил кардем"},{"number":91,"text":"онол, ки Қуръонрю ба қисмҳо тақсим карда буданд"},{"number":92,"text":"Ба Парвардигорат савганд, ки ҳамаро бозхост кунем"},{"number":93,"text":"ба хотири корҳое, ки мекардаанд"},{"number":94,"text":"Ба ҳар чӣ амр шудаӣ, сареҳу баланд бигӯ ва аз мушрикон рӯйгардон бош"},{"number":95,"text":"Мо масхаракунандагонро аз ту бозмедорем"},{"number":96,"text":"онҳо, ки бо Оллоҳ худое дигар қоил мешаванд. Пас ба зудӣ хоҳанд донист"},{"number":97,"text":"Ва медонем, ки ту аз гуфторашон дилтанг мешавӣ"},{"number":98,"text":"Ба ситоиши Парвардигорат тасбеҳ кун ва аз саҷдакунандагон бош"},{"number":99,"text":"Ва Парвардигоратро бипараст, то лаҳзаи маргат фаро расад"}]}