{"number":26,"edition":"tg.ayati","ayahs":[{"number":1,"text":"То, син, мим"},{"number":2,"text":"Инҳост оёти ин китоби равшан(-у фаҳмо)"},{"number":3,"text":"Шояд аз ин, ки имон намеоваранд, худро ҳалок созӣ"},{"number":4,"text":"Агар бихоҳем, аз осмон барояшон мӯъҷизае нозил мекунем, ки дар баробари он ба фармонбарӣ сар фуруд оваранд"},{"number":5,"text":"Барояшон ҳар сухани тозае аз Худои раҳмон нозил шавад, албатта аз он рӯгардонӣ мекунанд"},{"number":6,"text":"Пас дурӯғ бароварданд. Ба зуди хабари он чизҳое, ки масхарааш мекарданд, ба онҳо бирасад"},{"number":7,"text":"Оё ба замин нанигаристаанд, ки чӣ қадар аз ҳар гуна гиёҳони некӯ дар он рӯёнидаем"},{"number":8,"text":"Дар ин ибратест, вале бештарашон мӯъмин набудаанд"},{"number":9,"text":"Ба ростӣ Парвардигори ту пирӯзманду меҳрубон аст"},{"number":10,"text":"Ва Парвардигорат Мӯсоро нидо до, д, ки: эй Мӯсо, ба сӯи он мардуми ситамгор бирав"},{"number":11,"text":"қавми Фиръавн. Оё намехоҳанд парҳезгор шаванд"},{"number":12,"text":"Гуфт: «Эй Парвардигори ман, метарсам, ки дурӯғгӯям хонанд"},{"number":13,"text":"Ва дили ман танг гардад ва забонам кушода нашавад. Ҳорунро пайғамбарӣ деҳ"},{"number":14,"text":"Ва бар ман ба гуноҳе даъвое доранд, метарсам, ки маро бикушанд»"},{"number":15,"text":"Гуфт: «Ҳаргиз, оёти Маро ҳар ду назди онҳо бибаред, Мо низ бо шумо ҳастем ва гӯшкунандаем"},{"number":16,"text":"Пас назди Фиръавн равед ва бигӯед: «Мо расули Парвардигори ҷаҳониён ҳастем"},{"number":17,"text":"ки банӣ-Исроилро бо мо бифиристӣ»"},{"number":18,"text":"Гуфт: «Оё ба ҳангоми кӯдакӣ назди худ парваришат надодем ва ту чанд сол аз умратро дар миёни мо нагузаронидӣ"},{"number":19,"text":"Ва он корро, ки аз ту оар зад, накардаӣ? Пас ту кофири неъматӣ»"},{"number":20,"text":"Гуфт: «Он вақт, ки чунон кардам, аз хатокорон будам"},{"number":21,"text":"Ва чун аз шумо тарсидам, гурехтам. Вале Парвардигори мам ба ман паёмбарӣ дод ва маро дар шумори паёмбарон овард"},{"number":22,"text":"Ва миннати ин неъматро бар ман мекунӣ, ки банӣ-Исроилро ғулом сохтаӣ?»"},{"number":23,"text":"Фиръавн гуфт: «Парвардигори ҷаҳониён чист?»"},{"number":24,"text":"Гуфт: «Агар ба яқин мепазиред, Парвардигори осмонҳову замин ва ҳар чӣ миёни онҳост»"},{"number":25,"text":"Ба онон, ки дар атрофаш буданд, гуфт: «Оё нашунидед?»"},{"number":26,"text":"Гуфт; «Парвардпгори шумо ва Парвардигори падарони аввалини шумо»"},{"number":27,"text":"Фиръазн гуфт: «Ин паёмбаре, ки бар шумо фиристода шуда, девона аст»"},{"number":28,"text":"Гуфт: «Ӯст Парвардигори машрику мағриб ва ҳар чӣ миёни он дӯст, агар ақл кунед»"},{"number":29,"text":"Фиръавн гуфт: «Агар ба ҷои ман каси дигареро ба худои гири, ба зиндонат меафканам»"},{"number":30,"text":"Гуфт: «Ҳатто агар мӯъҷизае равшан барои ту оварда бошам?»"},{"number":31,"text":"Гуфт; Агар рост мегӯӣ, онро биёвар»"},{"number":32,"text":"Асояшро партофт. Ба ошкоро аждаҳое шуд"},{"number":33,"text":"Ва дасташро берун овард. Дар назари бинандагон сафед менамуд"},{"number":34,"text":"Ба бузургони қавмаш, ки канораш буданд, гуфт: «Ин мард ҷодугаре доност"},{"number":35,"text":"Мехоҳад ба ҷодуи. худ шуморо аз сарзаминатон берун кунад. Чӣ раъй медиҳед?»"},{"number":36,"text":"Гуфтанд: «Аз ӯ ва ба бародараш мӯҳлат бихоҳ ва касон ба шаҳрҳо бифирист"},{"number":37,"text":"то ҳар ҷодугари доноеро, ки ҳаёт, назди ту биёранд»"},{"number":38,"text":"Ҷодугаронро дар рӯзе муъайян ба ваъдагоҳ оварданд"},{"number":39,"text":"Ва мардумро гуфтанд: «Оё шумо низ ҷамъ меоед"},{"number":40,"text":"То агар ҷодугарон пирӯз омаданд, ҳама ба онҳо пайравӣ кунем!»"},{"number":41,"text":"Чун ҷодугарон омаданд, ба Фиръавн гуфтанд: «Оё агар мо пирӯз шавем, моро музде хоҳад буд?»"},{"number":42,"text":"Гуфт: «Оре, ҳама аз наздиконам хоҳед буд»"},{"number":43,"text":"Мӯсо ба онҳо гуфт: «Ҳар чӣ мехоҳед, партофтан, бипартоед!»"},{"number":44,"text":"Онон ресмонҳову чубҳои худ бияфканданд ва гуфтанд: «Ба иззати Фиръавн, ки мо пирӯз шудем!»"},{"number":45,"text":"Ва Мӯсо асояшро партофт. Ногоҳ ҳамаи он дурӯғҳоеро, ки сохта буданд, фурӯ бурд"},{"number":46,"text":"Ҷодугарон ба саҷда афтоданд"},{"number":47,"text":"Гуфтанд: «Ба Парвардигори ҷаҳониён имон овардем"},{"number":48,"text":"Парвардигори Мӯсо ва Ҳорун!»"},{"number":49,"text":"Гуфт: «Оё пеш аз он, ки шуморо рухсат диҳам, имон овардед? Албатта он мард бузурги шумост, ки шуморо ҷоду омӯхтааст. Хоҳед дид. Акнун дастҳову поҳоятонро аз чапу рост хоҳам бурид ва ҳамаатонро бар дор хоҳам кард!»"},{"number":50,"text":"Гуфтанд: «Боке нест, мо назди Парвардигорамон бозмегардем"},{"number":51,"text":"Мо умед медорем, ки Парвардигорамон хатоҳои моро бубахшад, ки мо нахустин касоне ҳастем, ки имон овардем»"},{"number":52,"text":"Ва ба Мӯсо ваҳй кардем, ки шабҳангом бандагони Маро берун бибар, ки аз паи шумо биёянд"},{"number":53,"text":"Ва Фиръавн ҷамъоварандагони сипоҳро ба шаҳрҳо фиристод"},{"number":54,"text":"ки инҳо гурӯҳе андаканд"},{"number":55,"text":"ва моро ба хашм овардаанд"},{"number":56,"text":"ва мо ҳамагӣ омодаи ҷангем"},{"number":57,"text":"Пас онҳоро аз борҳову чашмасорҳо берун кардем"},{"number":58,"text":"ва аз ганҷҳову хонаҳои некӯ"},{"number":59,"text":"ба ин тарз ҳамаро ба банӣ-Исроил вогузоштем"},{"number":60,"text":"Фиръавниён ба ҳангоми баромадани офтоб аз паи онҳо рафтанд"},{"number":61,"text":"Чун он ду гурӯҳ якдигарро диданд, ёрони Мӯсо гуфтанд: «Гирифтор омадем!»"},{"number":62,"text":"Гуфт: «Ҳаргиз, Парвардигори ман бо ман аст ва маро роҳ хоҳад нишон дод»"},{"number":63,"text":"Пас ба Мӯсо ваҳй кардем, ки асоятро ба дарё бизан. Дарё бишикофт ва ҳар пора чун кӯҳе азим гашт"},{"number":64,"text":"Ва он гурӯҳи дигарро низ ба дарё расонидем"},{"number":65,"text":"Мӯсо ва ҳамаи ҳамроҳонашро наҷот додем"},{"number":66,"text":"Ва он дигаронро ғарк сохтем"},{"number":67,"text":"Албатта дар ин ибратест ва бештаринашон имон наоварданд"},{"number":68,"text":"Албатта Парвардигори ту пирӯзманду бахшанда аст"},{"number":69,"text":"Ва достони Иброҳимро барояшон тиловат кун"},{"number":70,"text":"Он гоҳ ки ба падару қавми худ гуфт: «Чӣ мепарастед?»"},{"number":71,"text":"Гуфтачкд: «Бутонеро мепарастем ва муқими остонашон ҳастем»"},{"number":72,"text":"Гуфт: «Оё вақте онҳоро мехонед, садоятонро мешунаванд"},{"number":73,"text":"Ё барои шумо фоидаву зиёне доранд?»"},{"number":74,"text":"Гуфтанд: «На, падаронамонро дидаем, ки чунин мекардаанд»"},{"number":75,"text":"Гуфт: Оё медонед, ки чӣ мепарастидаед"},{"number":76,"text":"шумо ва падаронатон"},{"number":77,"text":"Онҳо душманони мананд, вале Парвардигори ҷаҳониён дӯсти ман аст"},{"number":78,"text":"Он, ки маро биёфарида, сипас роҳнамоиям мекунад"},{"number":79,"text":"ва он, ки ба ман таъом медиҳад ва маро об медиҳад"},{"number":80,"text":"ва чун бемор шавам, шифоям мебахшад"},{"number":81,"text":"ва он, ки маро мемиронад ва сипас зинда мекунад"},{"number":82,"text":"ва он, ки умед медорам, ки дар рӯзи қиёмат хатоямро бибахшояд"},{"number":83,"text":"Эй Парвардигори ман, маро ҳикмат бахш ва маро ба шоистагон бипайванд"},{"number":84,"text":"Ва зикри неки маро дар даҳони ояндагон андоз"},{"number":85,"text":"ва маро аз ворисони биҳишти пурнеъмат қарор деҳ"},{"number":86,"text":"ва падарамро биёмурз, ки аз гумроҳон аст"},{"number":87,"text":"ва дар рӯзи қиёмат маро расво масоз"},{"number":88,"text":"рӯзе, ки на мол нафъ медиҳад ва на фарзандон"},{"number":89,"text":"ғайри он кас, ки бо қалбе покиза аз ширк ба назди Худо биёяд!»"},{"number":90,"text":"Ва биҳиштро барои парҳезгорон наздик оранд"},{"number":91,"text":"Ва ҷаҳаннамро дар назари кофирон ошкор кунанд"},{"number":92,"text":"Ба онҳо гӯянд: Чизҳое, ки ба ҷои Худои якто мепарастидед, куҷоянд"},{"number":93,"text":"Оё ёриатон мекунанд, ё худ ёрӣ меҷӯянд?»"},{"number":94,"text":"Онҳо ва кофиронро сармагун дар ҷаҳаннам андозанд"},{"number":95,"text":"ва ҳамаи лашкари Иблисро"},{"number":96,"text":"Ва дар ҳоле, ки дар ҷаҳаннам бо якдигар ҳусумат мекунанду, мегӯянд"},{"number":97,"text":"«Ба Худо савганд, ки мо дар гумроҳии ошкор будем"},{"number":98,"text":"он гоҳ ки шуморо бо Парвардигори ҷаҳониён баробар медонистем"},{"number":99,"text":"Ва моро бадкорон гумроҳ сохтанд"},{"number":100,"text":"ва акнун моро шафеъоне (халоскунандаҳое) нест"},{"number":101,"text":"ва моро дӯсти меҳрубоне нест"},{"number":102,"text":"Кош бори дигар ба дунё бозгардем, то аз мӯъминон гардем»"},{"number":103,"text":"Дар ин ибратест ва бештаринашон имон наёварданд"},{"number":104,"text":"Албатта Парвардигори ту ғолибу меҳрубон аст"},{"number":105,"text":"Қавми Нӯҳ паёмбаронро дурӯғ барозарданд"},{"number":106,"text":"Он гоҳ ки бародарашон Нӯҳ ба онҳо гуфт: «Оё наметарсед"},{"number":107,"text":"Ман барои шумо паёмбаре ростгӯ ҳастам"},{"number":108,"text":"Аз Худо битарсед ва ба ман итоъат кунед"},{"number":109,"text":"Ман аз шумо дар баробари ҳидояти худ музде наметалабам. Музди ман танҳо бар ӯҳдаи Парвардигори ҷаҳониён аст"},{"number":110,"text":"Пас аз Худо битарсед ва ба ман итоъат кунед!»"},{"number":111,"text":"Гуфтанд: «Оё ба ту имон биёварем ва ҳол он ки камбағалон пайрави ту ҳастанд?»"},{"number":112,"text":"Гуфт: «Дониши ман ба корҳое, ки мекунанд, намерасад"},{"number":113,"text":"Агар мефаҳмед, ҳисобаш танҳо бо Парвардигори ман аст"},{"number":114,"text":"Ва ман мӯъминонро дур намекунам"},{"number":115,"text":"Бимдиҳандае ошкор ҳастам»"},{"number":116,"text":"Гуфтанд: «Эй Нӯҳ агар бас накунӣ, сангсор мешавӣ»"},{"number":117,"text":"Гуфт: «Эй Парвардигори ман, қавми ман маро дурӯғ мебароранд"},{"number":118,"text":"Миёни ману онҳо роҳе баркушой ва марову мӯъминони ҳамроҳи маро наҷот бидеҳ»"},{"number":119,"text":"Ӯ ва ҳамроҳонашро дар он киштии пур наҷот додем"},{"number":120,"text":"Ва боқиро ғарк, кардем"},{"number":121,"text":"Албатта дар ин ибратест ва бештаринашон имон наёварданд"},{"number":122,"text":"Албатта Парвардигори ту ғолибу меҳрубон аст"},{"number":123,"text":"Қавми Од паёмбаронро такзиб карданд (дурӯғ бароварданд)"},{"number":124,"text":"Он гоҳ, ки бародарашон Ҳуд гуфт: «Оё наметарсед"},{"number":125,"text":"Ман барои шумо паёмбаре ростгӯ ҳастам"},{"number":126,"text":"Аз Худо битарсед ва ба ман итоъат кунед"},{"number":127,"text":"Ман аз шумо дар баробари ҳидояти худ музде наметалабам. Музди ман танҳо бар ӯҳдаи Парвардигори ҷаҳониён аст"},{"number":128,"text":"Оё бар сари ҳар баландӣ ба беҳудагӣ биное баланд месозед"},{"number":129,"text":"Ва бад-ин пиндор, ки ҳамеша зиндаед, қасрхое бино мекунед"},{"number":130,"text":"Ва ҳар гоҳ интиқом гиред, чун бераҳмон интиқом мегиред"},{"number":131,"text":"Пас аз Худо битарсед ва аз ман итоъат кунед"},{"number":132,"text":"Ва битарсед аз он Худое, ки он чиро, ки медонед, ба шумо ато кардааст"},{"number":133,"text":"Ва ба шумо чорпоёну фарзандон ато кардааст"},{"number":134,"text":"ва боғҳову чашмасорон"},{"number":135,"text":"Ман аз азоби рӯзе бузург бар шумо бимнокам»"},{"number":136,"text":"Гуфтанд: «Барюй мо яксон аст, ки моро панд диҳӣ ё панд надиҳӣ"},{"number":137,"text":"Инҳо ҷуз ҳамон дурӯғу найранги пешиниён нест"},{"number":138,"text":"Ва мо азоб нахоҳем шуд»"},{"number":139,"text":"Пас дурӯғаш бароварданд ва Мо ононро ҳалок кардем. Албатта дар ин ибратест ва бештаринашон имон наёварданд"},{"number":140,"text":"Албатта Парвардигори ту ғолибу меҳрубон аст"},{"number":141,"text":"Қавми Самуд паёмбаронро дурӯғ бароварданд"},{"number":142,"text":"Он гоҳ ки бародарашон Солеҳ гуфт: «Оё наметарсед"},{"number":143,"text":"Ман барои шумо паёмбаре ростгӯ ҳастам"},{"number":144,"text":"Аз Худо битарсед ва ба ман итоъат кунед"},{"number":145,"text":"Ман аз шумо дар баробари ҳидояти худ музде наметалабам. Музди ман танҳо бар ӯҳдаи Парвардигори ҷаҳониён аст"},{"number":146,"text":"Оё пиндоред, ки шуморо дар ин неъматҳо эмин раҳо мекунанд"},{"number":147,"text":"Дар боғҳову чашмасорҳо"},{"number":148,"text":"Ва киштзорҳову наҳлҳо (хурмозорҳо) бо он шукуфаҳои нарму латиф"},{"number":149,"text":"Ва шодмон дар кӯҳҳо хонаҳое метарошед"},{"number":150,"text":"Пас аз Худо битарсед ва ба ман итоъат кунед"},{"number":151,"text":"Ва фармони ин исрофкоронро қабул накунед"},{"number":152,"text":"Инҳо, ки дар замин фасод мекунанд ва ислоҳ намекунанд»"},{"number":153,"text":"Гуфтанд: «Ғайри ин нест, ки туро ҷоду кардаанд"},{"number":154,"text":"Ту низ башаре монанди мо ҳастӣ. Агар рост мегӯӣ, нишонае биёвар»"},{"number":155,"text":"Гуфт: «Ин модашутури ман аст. Як рӯз об хӯрдан ҳаққи ӯ бошад ва як рӯз ҳаққи шумо"},{"number":156,"text":"Ба он осебе нарасонед, ки азоби рӯзе бузург шуморо фурӯ мегирад»"},{"number":157,"text":"Онро куштанд ва пушаймон шуданд"},{"number":158,"text":"Пас азоб онҳоро фурӯ гирифт., Албатта дар ин ибратест ва бештаринашон имон наёварданд"},{"number":159,"text":"Албатта Парвардигори ту ғолибу меҳрубон аст"},{"number":160,"text":"Қавми Лут паёмбаронро дурӯғ бароварданд"},{"number":161,"text":"Он гоҳ, ки бародарашон Лут гуфт: «Оё наметарсед"},{"number":162,"text":"Мам барои шумо паёмбаре ростгӯ ҳастам"},{"number":163,"text":"Аз Худо битарсед ва ба ман итоъат кунед"},{"number":164,"text":"Ман аз шумо дар баробари ҳидояти худ музде наметалабам. Музди ман танҳо бар ӯхдаи Парвардигори ҷаҳониён аст"},{"number":165,"text":"Чаро аз миёни мардуми ҷаҳон бо мардон меомезед"},{"number":166,"text":"Ва ҳамсаронеро, ки Парвардигоратон бароятон офаридааст, тарк мегӯед? На, шумо мардуме таҷовузкор ҳастед!»"},{"number":167,"text":"Гуфтанд: «Эй Лут, агар бас накунӣ, аз шаҳр берунат мекунем»"},{"number":168,"text":"Гуфт: «Ман бо кори шумо душманам"},{"number":169,"text":"Эй Парвардигори ман, маро ва касонамро аз оқибати амале, ки мекунанд, наҷот бахш!»"},{"number":170,"text":"Ӯ ва ҳамаи касонашро наҷот додем"},{"number":171,"text":"ғайри пиразане, ки хост бимонад"},{"number":172,"text":"Сипас дигаронро ҳалок кардем"},{"number":173,"text":"бар онҳо бороне боронидем ва чӣ бад буд борони таҳдидшудагон"},{"number":174,"text":"Албатта дар ин ибратест ва бештаринашон имон наёварданд"},{"number":175,"text":"Албатта Парвардигори ту ғолибу меҳрубон аст"},{"number":176,"text":"Мардуми Айка паёмбаронро дурӯғ бароварданд"},{"number":177,"text":"Он гоҳ ки Шуъайб ба онҳо гуфт: «Оё аз Худо наметарсед"},{"number":178,"text":"Ман барои шумо паёмбаре ростгӯ ҳастам"},{"number":179,"text":"Аз Худо битарсед ва ба ман итоъат кунед"},{"number":180,"text":"Ман аз шумо дар баробари ҳидояти худ музде наметалабам. Музди ман танҳо бар ӯҳдаи Парвардигори ҷаҳониён аст"},{"number":181,"text":"Паймонаро (зарфи ченкуниро) тамом бипардозед ва камфурӯшӣ макунед"},{"number":182,"text":"Ва бо тарозуи дуруст вазн кунед"},{"number":183,"text":"Ба мардум кам мадиҳед ва бебокона дар замин фасод макунед"},{"number":184,"text":"Аз он кас, ки шумо ва офаридагони пеш аз шуморо офаридааст, битарсед»"},{"number":185,"text":"Гуфтанд: «Ғайри ин нест, ки туро ҷоду кардаанд"},{"number":186,"text":"Ту низ инсоне монанди мо ҳастӣ ва мепиндорем, ки дурӯғ мегӯӣ"},{"number":187,"text":"Агар рост мегӯӣ, порае аз осмонро бар сари мо андоз»"},{"number":188,"text":"Гуфт: «Парвардигори ман ба коро, ки мекунед, донотар аст»"},{"number":189,"text":"Пас дурӯғаш бароварданд ва дар он рӯзи абрӣ азоб ононро фурӯ гирифг. Ва он азоби рӯзе бузург буд"},{"number":190,"text":"Албатта дар ин ибратест ва бештаринашон имон наёварданд"},{"number":191,"text":"Албатта Парвардигори ту ғолибу меҳрубон аст"},{"number":192,"text":"Ва ин китоб нозилшуда аз ҷониби Парвардигори ҷаҳониён аст"},{"number":193,"text":"Онро рӯҳуламин нозил кардааст"},{"number":194,"text":"бар дили ту, то аз бимдиҳандагон бошӣ"},{"number":195,"text":"ба забони арабии равшан"},{"number":196,"text":"Ва он дар навиштаҳои пешиниён низ ҳаст"},{"number":197,"text":"Оё ин нишона бар онҳо басанда нест, ки уламои банӣ-Исроил аз он огоҳанд"},{"number":198,"text":"Агар онро бар яке аз аҷамон (ғайри арабҳо) нозил карда будем"},{"number":199,"text":"ва барояшон онро мехонд, ба он имон намеоварданд"},{"number":200,"text":"Ба ин тарз Қуръонро дар дилҳои гунаҳкорон роҳ додем"},{"number":201,"text":"Ба он имон намеоваранд то азоби дардоварро бубинанд"},{"number":202,"text":"Ва он азоб ногаҳон ва бехабар бар онон фурӯд меояд"},{"number":203,"text":"Мегӯянд: «Оё моро мӯҳлате хоҳанд дод?»"},{"number":204,"text":"Оё ба азоби мо мешитобанд"},{"number":205,"text":"Дидӣ, ки ҳарчанд солҳо баҳрамандашон сохтем"},{"number":206,"text":"боз ҳам азобе, ки ба онҳо ваъда шуда буд, бар сарашон омад"},{"number":207,"text":"Он баҳрамандиҳо ба ҳолашон нафъ накард"},{"number":208,"text":"Мо ҳеҷ деҳаеро ҳалок накардем, ҷуз он, ки барояшон бимдиҳандагоне буданд"},{"number":209,"text":"то пандашон диҳанд. Зеро мо ситамкор нестем"},{"number":210,"text":"Ва ин Қуръонро шайтонҳо нозил накардаанд"},{"number":211,"text":"Онон на лоиқи ин коранд ва на тавони он доранд"},{"number":212,"text":"Шайтонҳоро аз шунидани ваҳй дур доштаанд"},{"number":213,"text":"Пас бо Худои якто худои дигареро махон, то мабод дар шумори азобшавандагон дароӣ"},{"number":214,"text":"Хешовандони наздикатро битарсон"},{"number":215,"text":"Дар баробари ҳар як аз мӯъминон, ки ба ту пайравӣ мекунад, хоксору нарм бош"},{"number":216,"text":"Ва агар бар ту нофармони карданд, бигӯ: «Ман аз корҳои шумо безорам!»"},{"number":217,"text":"Ва бар Худои пирӯзманду меҳрубон таваккал кун"},{"number":218,"text":"Он, ки туро мебинад, он гоҳ, ки бармехезӣ"},{"number":219,"text":"ва намоз хонданатро бо дигар намозгузорон мебинад"},{"number":220,"text":"Албатта Ӯст шунавои доно"},{"number":221,"text":"Оё шуморо огоҳ кунам, ки шайтонҳо ба назди киҳо меоянд"},{"number":222,"text":"Бар ҳар дурӯғгӯи гунаҳкор меоянд"},{"number":223,"text":"Гӯш медиҳанд ва бештаринашон дурӯғгӯёнанд"},{"number":224,"text":"Ва гумроҳон аз паи шоирон мераванд"},{"number":225,"text":"Оё надидаӣ, ки шоирон дар ҳар водие саргаштаанд"},{"number":226,"text":"Ва чизҳо мегӯянд, ки худ амал намекунанд"},{"number":227,"text":"Ғайри онҳо, ки имон оварданд ва корҳои шоиста карданд ва Худоро фаровон ёд карданд ва чун мавриди ситам воқеъ шуданд, интиқом гирифтанд. Ва ситамкорон ба зуди хоҳанд донист, ки ба чӣ маконе бозмегарданд"}]}