{"number":50,"edition":"tg.ayati","ayahs":[{"number":1,"text":"Қоф. Қасам ба ин Қуръони арҷманд"},{"number":2,"text":"Ки дар тааҷҷуб шуданд, аз ин ки аз миёни худашон бимдиҳандае сӯяшон омад, ва кофирон гуфтанд: «Ин чизе аҷиб аст"},{"number":3,"text":"Оё замоне, ки мурдему хок шудем, дигар бор зинда мешавем? Ин бозгаште мухол (номумкин) аст!»"},{"number":4,"text":"Мо медонем, ки хок чӣ гуна аз (ҷасадҳои) онҳо кам мекунад. Ва китобе, ки ҳама чиз дар он нигаҳдорӣ шуда, назди Мост"},{"number":5,"text":"Оре, онҳо сухани ростеро, ки бар онҳо омада буд, дурӯғ шумурданд. Пас дар коре шӯрида афтоданд"},{"number":6,"text":"Оё ба ин осмон бар болои сарашон назар намекунашд, ки чӣ гуна онро бино кардаем ва оростаем ва ҳеҷ шикофе дар он нест"},{"number":7,"text":"Ва заминро густурдем ва дар он кӯҳҳои баланд афкандем ва аз ҳар гуна набототи хушманзар дар он рӯёнидем"},{"number":8,"text":"Бинише ва пандест барои ҳар бандае, ки ба Худо бозгардад"},{"number":9,"text":"Ва аз осмои обе пурбаракат фиристодем ва бо он боғҳову донаҳои даравшуданӣ рӯёнидем"},{"number":10,"text":"ва нахлҳои баланд бо хушаҳои барҳам чида"},{"number":11,"text":"то ризқи баидагон бошад ва бо он об сарзамини мурдаро зинда кардем. Баромадан аз гӯр низ чунин аст"},{"number":12,"text":"Пеш аз онҳо қавми Нӯҳ ва асҳоби Рас ва Самуд такзиб карда (дурӯғ бароварда) буданд"},{"number":13,"text":"ва қавми Оду Фиръавн ва қавми Лут"},{"number":14,"text":"ва асҳоби Айка ва қавми Туббаъ ҳама паёмбаронро дурӯғ шумурданд ва сазовори ваъдаи азоби Ман шуданд"},{"number":15,"text":"Оё аз офариниши нахустин оҷиз шуда будем? На онҳо дар офариниши тоза дар шакканд"},{"number":16,"text":"Мо одамиро офаридаем ва аз васвасаҳои нафси ӯ огоҳ ҳастем, зеро аз раги гарданаш ба ӯ наздиктарем"},{"number":17,"text":"Ҳангоме ки он ду фариштаи фарогиранда дар ҷониби росту ҷониби чапи ӯ нишастаанд, ҳар чизро фаро мегиранд"},{"number":18,"text":"Ҳар каломе ки мегӯяд, албатта дар канори ӯ нозиру нависандае ҳозир аст"},{"number":19,"text":"Ба ростӣ, ки беҳушии марг фаро мерасад. Ин аст он чӣ аз он мегурехтӣ"},{"number":20,"text":"Ва дар сур дамида мешавад, Ин аст, рӯзи ваъдаҳои азоб"},{"number":21,"text":"Ҳар касе меояд ва бо ӯ касест, ки меронадаш ва касест, ки барояш шоҳидӣ медиҳад"},{"number":22,"text":"Ту аз ин ғофил будӣ. Мо парда аз баробарат бардоштем ва имрӯз чашмонат тезбин шудааст"},{"number":23,"text":"Фариштаи (муваккали) ӯ гӯяд: «Ин аст он чӣ ман омода кардаам»"},{"number":24,"text":"Ҳар ношукри саркашро ба ҷаҳаннам бияндозед"},{"number":25,"text":"он ки аз бахшиш бахилӣ кард ва таҷовузкор буд ва шак меовард"},{"number":26,"text":"он ки бо Худои як то худои дигаре қарор дод. Пас ба азоби сахташ бипартоед"},{"number":27,"text":"Ҳамнишини ӯ гӯяд: «Эй Парвардигори мо, ман ӯро ба саркашӣ водор накардам, балки ӯ худ, сахт дар гумроҳӣ буд»"},{"number":28,"text":"Мегӯяд: «Назди Ман муҷодала накунед. Ман пеш аз ин бо шумо сухан аз азоб гуфта будам"},{"number":29,"text":"Ваъдаи Ман дигаргун намешавад ва Ман ба бандагон зулм намекунам»"},{"number":30,"text":"Рӯзе, ки ҷаҳаннамро мегӯем: «Оё пур шудаӣ?» Мегӯяд: «Оё ҳеҷ зиёдатӣ ҳаст?»"},{"number":31,"text":"Ва биҳиштро барои парҳезгорон наздик биёваранд, то аз он дур набошанд"},{"number":32,"text":"Ин ҳамон чизест, ки ба ҳар тавбакунащдаи парҳезгоре ваъдааш дода буданд"},{"number":33,"text":"Онҳоеро, ки дар ниҳон аз Худои раҳмон метарсанд ва бо диле тавбакор омадаанд"},{"number":34,"text":"Гӯянд: «Дар амон аз ҳар азобе ба биҳишт дохил шавед. Ин рӯз рӯзи ҷовидонист»"},{"number":35,"text":"Дар он ҷо ҳар чӣ бихоҳанд, ҳаст ва бештар аз он назди Мо ҳаст"},{"number":36,"text":"Пеш аз онҳо чӣ бисёр мардумеро, ки боқувваттар буданд ва дар шаҳрҳо сайру ҷустуҷӯ мекарданд, ба ҳалокат овардаем. Оё роҳи гурезе ҳаст"},{"number":37,"text":"Дар ин сухан барои соҳибдилон ё онон, ки бо ҳузур гӯш меандозанд, андарзест (пандест)"},{"number":38,"text":"Мо осмонҳову замин, ва он чиро миёни онҳост, дар шаш рӯз офаридем ва ҳеҷ хастагӣ ба Мо нарасид"},{"number":39,"text":"Дар баробари он чӣ мегӯянд, пойдорӣ кун ва дар ситоиши Парвардигорат пеш аз баромадани офтоб ва пеш аз фаромадани он тасбеҳ гӯй"},{"number":40,"text":"Ва низ дар порае аз шаб ва баъд аз ҳар саҷда ӯро тасбеҳ гӯй"},{"number":41,"text":"Ва он гоҳ ки мунодӣ (нидокунанда, Исрофил) аз маконе наздик нидо медиҳад, гӯш фаро дор"},{"number":42,"text":"Рӯзе, ки он овози сахтро ба ҳақ мешунаванд, он рӯз рӯзи берун шудан аз гӯр аст"},{"number":43,"text":"Мо зинда мекунем ва мемиронем ва бозгашт назди Мост"},{"number":44,"text":"Рӯзе, ки замин бишкофад ва онҳо ба шитоб берун оянд ва ин ҷамъоварӣ барои Мо осон аст"},{"number":45,"text":"Мо ба он чӣ мегӯянд, донотарем ва ту ба онҳо зӯр намегӯӣ. Пас ҳар киро аз ваъдаи азоби Ман метарсад, ба Қуръон панд деҳ"}]}