{"number":69,"edition":"tg.ayati","ayahs":[{"number":1,"text":"Он рӯзи барҳақ"},{"number":2,"text":"Чист он рӯзи барҳақ"},{"number":3,"text":"Ва чӣ донӣ, ки он рӯзи барҳақ чист"},{"number":4,"text":"Қавми Самуду Од рӯзи қиёматро дурӯғ бароварданд"},{"number":5,"text":"Аммо қавми Самуд ба он бонги сахт ҳалок шуданд"},{"number":6,"text":"Ва аммо қавми Од бо вазиши боли сар-сяр (сахт) ба ҳалокат расиданд"},{"number":7,"text":"Он азобро ҳафт шабу ҳашт рӯз пай дар пай бар онон фиристод. Он қавмро чун танаҳои пӯсидаи хурмо медидӣ, ки афтодаанду мурдаанд"},{"number":8,"text":"Оё касеро мебинӣ, ки аз онҳо бар ҷой монда бошад"},{"number":9,"text":"Ва Фиръявну мардуме, ки пеш аз ӯ буданд ва низ мардуми Мӯътафиқа гунаҳкор омаданд"},{"number":10,"text":"Фиристодаи Парвардигорашонро нофармонӣ карданд ва Худо низ ононро ба сахтӣ фуру гирифт"},{"number":11,"text":"Чун об туғён кард, шуморо ба киштӣ савор кардем"},{"number":12,"text":"то онро мояи пандатон гардонем ва гӯшнигаҳдорандаи панд онро фаро гирад"},{"number":13,"text":"Чун як бор дар сур дамида шавая"},{"number":14,"text":"ва замину кӯҳҳоро баргиранд ва якбора дар ҳам кӯбанд"},{"number":15,"text":"он рӯз он ҳодиса ба вуқӯъ пайваста бошад"},{"number":16,"text":"ва осмон, ки дар он рӯз суст шудааст, бишикофад"},{"number":17,"text":"Ва фариштагон дар атрофи осмон бошанд, Ва дар он рӯз ҳашт тан аз онҳо арши Парвардигоратро бар болои сарашон мебардоранд"},{"number":18,"text":"Он рӯз шуморо пеш оваранд ва ҳеҷ чизи шумо ниҳон намонад"},{"number":19,"text":"Аммо ҳар кас, ки номаи аъмолашро ба дасти росташ диҳанд, мегӯяд: «Ном'аи маро бигиреду бихонед"},{"number":20,"text":"Ман яқин доштам, ки ҳисоби худро хоҳам дид»"},{"number":21,"text":"Пас ӯ дар як зиндагии писандидаву хуш хоҳад буд"},{"number":22,"text":"дар биҳиште олӣ"},{"number":23,"text":"ки меваҳояш наздикшаванда бошад"},{"number":24,"text":"Бихӯреду биёшомед, гуворо бод шуморо. Инҳо мукофоти амалҳоест, ки дар айёми гузашта ба ҷой меовардаед!»"},{"number":25,"text":"Аммо он кас, ки номаи аъмолашро ба дасти чапаш диҳанд, мегӯяд: «Эй кош,, номаи маро ба дасти ман намедоданд"},{"number":26,"text":"ва надониста будам, ки ҳисоби ман чист"},{"number":27,"text":"Эй кош, ҳамон марг мебуду бас"},{"number":28,"text":"Дороии ман маро фоида набахшид"},{"number":29,"text":"қудрати ман аз дасти ман бирафт!»"},{"number":30,"text":"«Бигиредаш, занҷираш кунед"},{"number":31,"text":"Ва ба ҷаҳаннамаш дараред"},{"number":32,"text":"Ва ӯро бо занҷире ба дарозии ҳафтод зироъ (аз оринҷ то ангушт) бикашед"},{"number":33,"text":"Зеро ба Худои бузург имон надошт"},{"number":34,"text":"ва ба таъом додан ба мискинон касеро тарғиб намекард"},{"number":35,"text":"Дар он рӯз дар он ҷо ҳеҷ дӯсте нахоҳад дошт"},{"number":36,"text":"Таъомаш чизе ғайри чирку хуни аҳли дӯзах нест"},{"number":37,"text":"Танҳо хатокорон аз он таъом мехӯранд"},{"number":38,"text":"Пас савганд ба он чи мебинед"},{"number":39,"text":"ва он чӣ намебинед"},{"number":40,"text":"ки ин сухани фиристодае бузургвор аст"},{"number":41,"text":"на сухани шоире. Чӣ андак имон меоварад"},{"number":42,"text":"Ва низ сухани коҳине (фолбин, ҷодугар) нест. Чӣ андак панд мегиред"},{"number":43,"text":"Аз ҷониби Парвардигри ҷаҳониён нозил шуда аст"},{"number":44,"text":"Агар паёмбар баъзе суханонро бофта бар мо мебаст, («аз ҷониби худост» — мегуфт)"},{"number":45,"text":"бо қудрат ӯро фурӯ мегирифтем"},{"number":46,"text":"сипас раги дилашро пора, мекардем"},{"number":47,"text":"ва ҳеҷ як аз шуморо тавони он набувад, ки монеъ шавад"},{"number":48,"text":"Ва Қуръон барои парҳезгорон пандест"},{"number":49,"text":"Мо медонем, ки аз миёни шумо касоне ҳастанд, ки такзиб мекунанд, (дурӯғ мешумуранд)"},{"number":50,"text":"Ва Қуръон кофиронро мояи пушаймонӣ аст"},{"number":51,"text":"Ва он сухани ҳақ ва яқин аст"},{"number":52,"text":"Пас ба номи Парвардигори бузургат тасбеҳ (бигӯй)"}]}