{"number":70,"edition":"hi.farooq","ayahs":[{"number":1,"text":"एक माँगनेवाले ने घटित होनेवाली यातना माँगी"},{"number":2,"text":"जो इनकार करनेवालो के लिए होगी, उसे कोई टालनेवाला नहीं"},{"number":3,"text":"वह अल्लाह की ओर से होगी, जो चढ़ाव के सोपानों का स्वामी है"},{"number":4,"text":"फ़रिश्ते और रूह (जिबरील) उसकी ओर चढ़ते है, उस दिन में जिसकी अवधि पचास हज़ार वर्ष है"},{"number":5,"text":"अतः धैर्य से काम लो, उत्तम धैर्य"},{"number":6,"text":"वे उसे बहुत दूर देख रहे है"},{"number":7,"text":"किन्तु हम उसे निकट देख रहे है"},{"number":8,"text":"जिस दिन आकाश तेल की तलछट जैसा काला हो जाएगा"},{"number":9,"text":"और पर्वत रंग-बिरंगे ऊन के सदृश हो जाएँगे"},{"number":10,"text":"कोई मित्र किसी मित्र को न पूछेगा"},{"number":11,"text":"हालाँकि वे एक-दूसरे को दिखाए जाएँगे। अपराधी चाहेगा कि किसी प्रकार वह उस दिन की यातना से छूटने के लिए अपने बेटों"},{"number":12,"text":"अपनी पत्नी , अपने भाई"},{"number":13,"text":"और अपने उस परिवार को जो उसको आश्रय देता है"},{"number":14,"text":"और उन सभी लोगों को जो धरती में रहते है, फ़िदया (मुक्ति-प्रतिदान) के रूप में दे डाले फिर वह उसको छुटकारा दिला दे"},{"number":15,"text":"कदापि नहीं! वह लपट मारती हुई आग है"},{"number":16,"text":"जो मांस और त्वचा को चाट जाएगी"},{"number":17,"text":"उस व्यक्ति को बुलाती है जिसने पीठ फेरी और मुँह मोड़ा"},{"number":18,"text":"और (धन) एकत्र किया और सैंत कर रखा"},{"number":19,"text":"निस्संदेह मनुष्य अधीर पैदा हुआ है"},{"number":20,"text":"जि उसे तकलीफ़ पहुँचती है तो घबरा उठता है"},{"number":21,"text":"किन्तु जब उसे सम्पन्नता प्राप्त होती ही तो वह कृपणता दिखाता है"},{"number":22,"text":"किन्तु नमाज़ अदा करनेवालों की बात और है"},{"number":23,"text":"जो अपनी नमाज़ पर सदैव जमें रहते है"},{"number":24,"text":"और जिनके मालों में"},{"number":25,"text":"माँगनेवालों और वंचित का एक ज्ञात और निश्चित हक़ होता है"},{"number":26,"text":"जो बदले के दिन को सत्य मानते है"},{"number":27,"text":"जो अपने रब की यातना से डरते है"},{"number":28,"text":"उनके रब की यातना है ही ऐसी जिससे निश्चिन्त न रहा जाए"},{"number":29,"text":"जो अपने गुप्तांगों की रक्षा करते है।"},{"number":30,"text":"अपनी पत्नि यों या जो उनकी मिल्क में हो उनके अतिरिक्त दूसरों से तो इस बात पर उनकी कोई भर्त्सना नही।"},{"number":31,"text":"किन्तु जिस किसी ने इसके अतिरिक्त कुछ और चाहा तो ऐसे ही लोग सीमा का उल्लंघन करनेवाले है।"},{"number":32,"text":"जो अपने पास रखी गई अमानतों और अपनी प्रतिज्ञा का निर्वाह करते है"},{"number":33,"text":"जो अपनी गवाहियों पर क़़ायम रहते है"},{"number":34,"text":"और जो अपनी नमाज़ की रक्षा करते है"},{"number":35,"text":"वही लोग जन्नतों में सम्मानपूर्वक रहेंगे"},{"number":36,"text":"फिर उन इनकार करनेवालो को क्या हुआ है कि वे तुम्हारी ओर दौड़े चले आ रहे है"},{"number":37,"text":"दाएँ और बाएँ से गिरोह के गिरोह"},{"number":38,"text":"क्या उनमें से प्रत्येक व्यक्ति इसकी लालसा रखता है कि वह अनुकम्पा से परिपूर्ण जन्नत में प्रविष्ट हो"},{"number":39,"text":"कदापि नहीं, हमने उन्हें उस चीज़ से पैदा किया है, जिसे वे भली-भाँति जानते है"},{"number":40,"text":"अतः कुछ नहीं, मैं क़सम खाता हूँ पूर्वों और पश्चिमों के रब की, हमे इसकी सामर्थ्य प्राप्त है"},{"number":41,"text":"कि उनकी उनसे अच्छे ले आएँ और हम पिछड़ जानेवाले नहीं है"},{"number":42,"text":"अतः उन्हें छोड़ो कि वे व्यर्थ बातों में पड़े रहें और खेलते रहे, यहाँ तक कि वे अपने उस दिन से मिलें, जिसका उनसे वादा किया जा रहा है"},{"number":43,"text":"जिस दिन वे क़ब्रों से तेज़ी के साथ निकलेंगे जैसे किसी निशान की ओर दौड़े जा रहे है"},{"number":44,"text":"उनकी निगाहें झुकी होंगी, ज़िल्लत उनपर छा रही होगी। यह है वह दिन जिससे वह डराए जाते रहे है"}]}