{"number":22,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"O lidé ty váit si ty Magnát chvet se z Doba jsem neco horrendous"},{"number":2,"text":"Cas ty svedcit to práve pestovat ujmout se jako matka prosit znehodnotit jí mladistvý bohatý ena zrušit jí fetus. Ty prijmout lidé uvést v pochybnost protoe oni opít práve oni ne opít. Tento byl buh odškodnení jsem e desivý"},{"number":3,"text":"Among a národ, v tom jsem ty diskutovat BUH vedomí následující naprostý odbojný souit"},{"number":4,"text":"To rozhodnout kadý spojený jemu on zavést jemu usmernovat jemu zápas Peklo"},{"number":5,"text":"(O lidé jestlie ty mel kadý pochybovat zmrtvýchvstání vzpomínat si onen) my tvorit ty oprášit subsequently malý napsat obeh v význam (zárodek) pak ono slušet fetus odevzdat doivotní povaovat mdlý! My tím procistit potreby ty. My domluvit luno cokoliv my prosit pro dopredu daný doba! My pak privést ty out mladistvý pak ty sahat zralost. i kdy trochu o ty poslední mláde others havý s škoda stárí jen s najít out onen nic vedomí dosáhnout nejaký vrchol! Také ty pohled získat byl naprostý pak ackoliv brzo ackoliv my lít to rozvodnit ono otrásat doivotní dospelý úplne druh o krásný opustit"},{"number":6,"text":"Tento overit onen BUH jsem Vernost onen On obnovit naprosto onen On jsem Všemohoucí"},{"number":7,"text":"A onen Doba podlehnout nikoliv obava u to a onen BUH vzkrísit ty jsem váný"},{"number":8,"text":"Among a národ v tom jsem jednotka který diskutovat BUH vedomí rízení informovat bible"},{"number":9,"text":"Arrogantly on závodit odvrátit lidé dráha BUH! On tím privodit si pokorení za tohleto doivotní my predloit jemu Cas Zmrtvýchvstání zápas z svítit"},{"number":10,"text":"Tento jsem co svuj písmo odeslat dopredu ty. BUH jsem NIKDY NESPRAVEDLIVÝ towards LIDÉ"},{"number":11,"text":"Among a národ v tom jsem jednotka zbonovat BUH conditionally. Potreby odchod svém ráz on byl objem. Trochu neštestí postihnout jemu on útocit about-face Tím on pozbýt oba tento doivotní Dále. recený jsem pravý škoda"},{"number":12,"text":"On zbonovat koho BUH co ne mít moc poškození jemu beneficní jemu; recený jsem pravý zabehlé dobytce"},{"number":13,"text":"On zbonovat koho krome toho schopný poškození jemu than beneficní jemu! Který bídný magnát! Který bídný druhý"},{"number":14,"text":"BUH UZNAT TY domnívat se PRIMET SPRAVEDLIVÝ DOIVOTNÍ DO ZAHRADNÍ PRÍLIV PRAMEN! Všechno jsem proto buh prosit"},{"number":15,"text":"Kadý myšlen onen BUH ne snést jemu za tohleto doivotní Dále pripustit jemu zapnout naprosto (svém tvurce nebe roztrhnout (svém závislost u kadý jinam)! On pak prijmout tento postup vypustit všechno onen zlobit koho jemu"},{"number":16,"text":"My tím odhalit vyrovnat zjevení sem pak BUH usmernovat whoever prosit usmernovat"},{"number":17,"text":"Ty verit ty jsem Idovský premenit Kresan Zoroastrians obraz worshipers BUH jsem Jednotka kritizovat ti Cas Zmrtvýchvstání. BUH SVEDCIT ÚPLNE POTREBY"},{"number":18,"text":"Ty ne nahromadit onen BUH premoct kadý nebe zahrabat slunit se mesíc vystupovat hora strom zvíre mnoho lidé? Mnoho others among a národ predloit smrt. Whomever BUH ostuda ádný honor jemu. Všechno jsem proto buh prosit"},{"number":19,"text":"Sem jsem 2 úcastník krevní msta pohled jejich Magnát! Ohledne Ceho ty pochybovat oni mel prádlo z povzbudit prizpusobit pro ti! Pekelný kolísavý prosit proudit jejich pristrihnout"},{"number":20,"text":"To zpusobit jejich duverný dojmout také moný jejich okrást"},{"number":21,"text":"Oni omezit tvrdý zajistit"},{"number":22,"text":"Whenever oni vyzkoušet opustit tak bída oni vnutit stranou za Chutnat zápas z svítit"},{"number":23,"text":"BUH prosit UZNAT TY domnívat se PRIMET SPRAVEDLIVÝ DOIVOTNÍ DO ZAHRADNÍ PRÍLIV PRAMEN! Oni zdobit therein náramek zlatý perlit se jejich šaty therein byl hedvábný šat"},{"number":24,"text":"Oni usmernovat poslušný slovo; oni usmernovat dráha z nejvetší Velebit"},{"number":25,"text":"Prece ty pochybovat odrazit others dráha BUH podle Církevní Masjid my urcit úplne lidé! - jsem oni tuzemský návštevník! - Ádat znecistit to podplatit to my souit ti trapný odškodnení"},{"number":26,"text":"My sjednat Abraham dosadit Skrín S Ostatky Ty ne zbonovat koho kadý jiný buh Mi cistit Muj skrín s ostatky ty navštevovat to ty ivý ono ty sklánet premoct"},{"number":27,"text":"A vyhlásit lidé slavit Hajj pou Oni podlehnout ty dráha jízdní mnohostranný odvod (strední doprava)! Oni podlehnout druhý zjištení"},{"number":28,"text":"Oni ádat obchodní uitek oni slavit buh uvést specifikovat cas pro stanovit ti ivý inventár! Strávit proto zásobovat melancholický chatrný"},{"number":29,"text":"Oni naprostý jejich úpis fulfill jejich slib prohlédnout starý skrín s ostatky"},{"number":30,"text":"Ty váit si obrad rozhodnout BUH zaslouilý poslušný odmenit jejich Magnát. Úplne ivý inventár zpusobit zákonný svuj jídlo a na nebo ty zvlášte zakázat ty. Ty zabránit opovrení obraz zbonovat zabránit loisko falešný svedcit"},{"number":31,"text":"Ty udrovat svuj modlitby úplne BUH jen. Kadý spolecnost kadý obraz BUH jsem jednotka kue lye pak vzít si ulovit ukoristit oddechnout si ovinout široký str"},{"number":32,"text":"Vskutku ty váit si obrad rozhodnout BUH znázornit spravedlnost jejich jádro"},{"number":33,"text":"(Ivý) (Inventár) stanovit ty mnoho uitek nebo a doba, dopredu venovat darem starý skrín s ostatky"},{"number":34,"text":"Kadý sbor my rozhodnout obrad whereby oni slavit uvést BUH pro stanovit ti ivý inventár! Svuj buh jsem 1 i kdy a spolu buh; ty jsem povinen úplne nabídnout Jemu. Odevzdat poslušný zpráva s a poslušný"},{"number":35,"text":"Oni jsem jednotka jádro trást se na uvedený BUH oni steadfastly vytrvat neštestí oni slavit Spojení Prosba (Salat) podle náš obstarání s ti oni odevzdat milodar"},{"number":36,"text":"Zvíre nabídka jsem obrad rozhodnout BUH tvuj uznat plný Ty uvedený buh uvést ti i kdy oni kozlík za sortiment. Dríve oni prednést zasvetit ty strávit proto zásobovat chatrný potrebný! Tento why my zmírnit ti ty onen ty beet svuj porozumení"},{"number":37,"text":"Vubec jejich maso nor jejich krevní sahat BUH. Který prijít Jemu jsem svuj spravedlnost. On zmírnit ti ty ty beet ty porozumení oslavovat BUH pro usmernovat ty! Odevzdat poslušný zpráva s a dobrocinný"},{"number":38,"text":"BUH CHRÁNIT TY VERIT. BUH NE MILOVAT KADÝ betrayer unappreciative"},{"number":39,"text":"Povolení pripustit ty ar pronásledovat protoe nespravedlnost postihnout ti BUH jsem prosím dovedný podle snášet ti"},{"number":40,"text":"Oni vystehovat násilne jejich tesne unjustly nebo nikoliv soud jinam than odríkávat Náš Magnát jsem BUH. to ne jsem buh podpora z trochu lidé others klášter církevní synagoga masjids! - Tam uvést BUH slavit frequently - Pobít! Úplne BUH snést ty snést Jemu. BUH jsem VÝKONNÝ Všemohoucí"},{"number":41,"text":"Oni jsem ty my sjednat ti vladar zahrabat oni dosadit Spojení Prosba (Salat) povinný milodar (Zakat) obhajovat spravedlnost odporný odporný! BUH jsem POSLEDNÍ VLADAR"},{"number":42,"text":"Jestlie oni vyradit ty lidé Noe ‘Aad Thamoud také pochybovat ti"},{"number":43,"text":"Také lidé Abraham lidé Moc"},{"number":44,"text":"Obyvatel Midyan. Moses také vyradit. Já primet úplne ty lidé pak já prijít ti odpovídat se jak (znicit) jsem Muj náhrada"},{"number":45,"text":"Mnoho spolecnost my zrušit jejich wickedness. Oni znicit znicit utišit lázne prima hladový príbytek"},{"number":46,"text":"Oni ne chodit zahrabat pak jednat jejich dbát zpusobit dorozumení jednat jejich záves naslouchat? Vskutku pravý slepota ne jsem slepota otvor slepota jádro skrín"},{"number":47,"text":"Oni upírat ty privést odškodnení BUH nikdy selhání fulfill Svém veštba! Cas svuj Magnát jsem 1000 z svuj roky"},{"number":48,"text":"Mnoho spolecnost za a nad predloit odporný já primet ti u chvilku pak já potrestat ti. S Mne jsem poslední urcení"},{"number":49,"text":"ríct O lidé já byl poslal podle ty protoe dukladný warner"},{"number":50,"text":"Ty domnívat se primet spravedlivý doivotní zaslouilý odpuštení štedrý odmenit"},{"number":51,"text":"Ohledne Ceho ty závodit upírat náš zjevení oni privodit si Peklo"},{"number":52,"text":"My ne odeslat ty kadý hlasatel nor prorok mel souit vadit svém chtít! BUH PAK ZRUŠIT KTERÝ SOUIT UCINIL. BUH NAPROSTÝ SVÉM ZJEVENÍ. BUH jsem VŠEVEDOUCÍ ODBORNÝ"},{"number":53,"text":"On tím spolecnost souit navrhovat vyzkoušet ty harbor pochybovat jejich srdce ty jádro zatvrdit. Prostopášný muset trvat odpor"},{"number":54,"text":"Ty štestí vedomí pripustit vernost svuj Magnát pak domnívat se za ono jejich srdce snadno uznat to! mnoství jiste BUH usmernovat verící vzprímit dráha"},{"number":55,"text":"Ohledne Ceho ty pochybovat oni zustat harbor pochybovat Doba podlehnout ti náraz odškodnení strašný cas podlehnout ti"},{"number":56,"text":"Úplne svrchovanost onen cas náleet podle BUH On kritizovat ti. Ohledne Ceho ty domnívat se primet spravedlivý doivotní oni zaslouilý zahradní bliss"},{"number":57,"text":"Doba ty pochybovat vyradit náš zjevení privodit si hanebný odškodnení"},{"number":58,"text":"Ty vystehovat BUH pak dosáhnout znemonit poslední BUH prosit prece lít ti poslušný obstarání BUH jsem PROSÍM ZCELA SPRÁVCE"},{"number":59,"text":"mnoství jiste On uznat ti vstup spokojený ti. BUH jsem VŠEVEDOUCÍ MÍRNÝ"},{"number":60,"text":"To rozhodnout 1 pomstít nespravedlnost vnucovat jemu equitably pak on pronásledovat tento BUH prosit prece snést jemu! BUH jsem Pardoner OMLUVIT"},{"number":61,"text":"jsem pravda BUH pripojit vecer cas pripojit cas vecer a onen BUH jsem Posluchac Veštec"},{"number":62,"text":"jsem pravda BUH jsem Vernost doba spolecnost kadý obraz Jemu zaloit prolhanost a onen BUH jsem nejvetší Nejvyšší Nejvyšší"},{"number":63,"text":"Ty ne prijmout BUH odeslat lye rozvodnit zpusobit onen zapnout získat nový? BUH BYL POVZNÉST Príslušný"},{"number":64,"text":"S Jemu patrit všechno nebe všechno u zahrabat! Úplne BUH jsem nejvetší Drahý Chvalitebný"},{"number":65,"text":"Ty ne prijmout BUH predloit od zpusobit svuj krýt všechno zahrabat? Poslat vrazit oceán Svém ovládání. On prekazit nebesky lod zrícení zahrabat proto Svém ovládání. BUH jsem HODNÝ towards LIDÉ MILOSRDNÝ"},{"number":66,"text":"On jsem 1 který pripustit ty doivotní pak On pripojit ty smrt pak On privést ty operadlo doivotní! Prece lidská bytost jsem jsem unappreciative"},{"number":67,"text":"Pro kadý sbor my rozhodnout spolecnost obrad oni udrovat. Proto oni ne debatovat ty. Ty zustat lákat kadý svuj Magnát. mnoství jiste ty jsem vzprímit dráha"},{"number":68,"text":"Oni diskutovat ty pak ríct BUH byl celkem vedomý si o všechno ty ucinil"},{"number":69,"text":"BUH prosit KRITIZOVAT among TY CAS ZMRTVÝCHVSTÁNÍ úplne SVUJ POPÍRAT"},{"number":70,"text":"Ty ne nahromadit onen BUH zkušený všechno od nebe všechno u zahrabat? úplne tento zaznamenat zápis. Tento jsem lehký BUH ucinil"},{"number":71,"text":"Oni zbonovat koho BUH obraz wherein On ne umístení moc oni módní nic ti! Prestupník ne mel pomocník"},{"number":72,"text":"When náš zjevení prednášet ti samozrejme ty pripustit wickedness celo z ty pochybovat. Oni témer napadnout ty uvést ve výctu náš zjevení ti. ríct já informovat ty z neco skoro špatný Peklo slibný BUH ty pochybovat; který bídný urcení"},{"number":73,"text":"O lidé sem byl podobenství onen ty uvaovat starostlive obraz ty spolecnost BUH nikdy tvorit vyletet i oni shromádit dohromady vyloucit co z ceho aby! Krome Toho jestlie vyletet kradl všechno podle ti oni ne objevit to; slabý jsem pronásledovatel a pokracovat"},{"number":74,"text":"Oni ne cenit BUH protoe On cenit. BUH jsem NEJVETŠÍ VÝKONNÝ Všemohoucí"},{"number":75,"text":"BUH CHTÍT PODLE ANDEL HLASATEL TAKÉ JAKO PODLE LIDÉ. BUH jsem POSLUCHAC VEŠTEC"},{"number":76,"text":"On módní jejich po jejich budoucí. S BUH patrit poslední rízení úplne duvod"},{"number":77,"text":"O ty verit ty sehnout premoct zbonovat svuj Magnát rízení spravedlnost onen ty mít úspech"},{"number":78,"text":"Ty závodit dát BUH ty závodit Svém dát. On chtít ty ne umístení útrapa ty"}]}