{"number":23,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"postup svuj náboenství! - Náboenství z svuj predek Abraham. On jsem 1 který pojmenovat ty Submitters originally! Tím hlasatel obsluhovat svedcit ty ty dorucit svedcit among a národ. Proto ty slavit Spojení Prosba (Salat) odevzdat povinný milodar (Zakat) zastavit rychlý BUH; On jsem svuj Magnát zcela Magnát zcela Prívrenec. . . [23:1] Úspešný vskutku jsem verící"},{"number":2,"text":"Který jsem ctihodný behem jejich Spojení Prosba (Salat)"},{"number":3,"text":"Oni zabránit marný povídat"},{"number":4,"text":"Oni odevzdat jejich povinný milodar (Zakat)"},{"number":5,"text":"Oni udrovat jejich cudnost"},{"number":6,"text":"Jen na jejich snoubenec ty byl správne jejich vyloucit co z ceho oni mel sexuální pomer; oni ne jsem obvinovat"},{"number":7,"text":"Ty zhrešit tyto vrchol jsem prestupník"},{"number":8,"text":"When to podlehnout poloit poverit s ti príliš protoe kadý souhlas oni útocit oni byl verný"},{"number":9,"text":"Oni slavit jejich Spojení Prosba (Salat) pravidelne"},{"number":10,"text":"Stejný jsem dedic"},{"number":11,"text":"Oni dedit po Ráj wherein oni zustávat stále"},{"number":12,"text":"My tvorit lidská bytost jsem podle nejaký druh o bláto"},{"number":13,"text":"Subsequently my rozmnoit jemu malý napsat umístení zdroj zabezpecený zdroj"},{"number":14,"text":"Pak my developed napsat do význam (zárodek) pak developed význam (zárodek) do bite-size (fetus) pak tvorit bite-size (fetus) do kost pak pokrývka kost lidé. My tím vytáhnout znovu tvor. Štestí jsem BUH zcela Tvurce"},{"number":15,"text":"Pak poslední ochoten, ty poslední"},{"number":16,"text":"Pak Cas Zmrtvýchvstání ty vzkrísit"},{"number":17,"text":"My tvorit ty 7 vesmír vrstva my ar nikdy neuvedomující si z vybrat tvor ti"},{"number":18,"text":"My odeslat shodit lye rozvodnit vynucovat loisko pak my hromada to park! Prosím my pripustit to unikat"},{"number":19,"text":"Na to my vytáhnout pro ty ovocný sad z pocházet podmazat zrnko vína úplne druh o ovoce mnohostranný jídlo"},{"number":20,"text":"Také strom domácí s Sinai vytáhnout výkonný také moný náklonnost jedlík"},{"number":21,"text":"Ivý Inventár stanovit ty lekce. My pripustit ty nápoj (odrít) podle jejich nadouvat ty pocházet další uitek pred ti trochu o ti ty jednat pro potrava"},{"number":22,"text":"U ti u poslat ty jízda"},{"number":23,"text":"My odeslat Noe svém lidé rcení O muj lidé zbonovat BUH. Ty ne mel jinak buh Jemu. Ty ne jsem spravedlivý"},{"number":24,"text":"Vedoucí pochybovat svém lidé odríkávat Tento jsem nikoliv jinam than lidský ty chtít výteek výstupek ty. Mel BUH willed On odeslat andel! My nikdy slyšení všechno tento náš predek"},{"number":25,"text":"On pouze mu odchod senzacní. Spravedlivý neznat jemu pro chvilku"},{"number":26,"text":"On odríkávat Muj Lord pripustit mne vítezství oni pochybovat mne"},{"number":27,"text":"My pak nadchnout se jemu Útocit watercraft náš bdelý otvor proto náš vdechnutí! When náš príkaz podlehnout atmosphere varený stoupnutí pripojit to pár z naprostý druh (o svuj zdomácnet zvíre) svuj druh ledae ty odsoudit smrt! Ne mluven podle Mne ochoten za o ty zhrešit; oni potopit"},{"number":28,"text":"Dríve ty domluvit dohromady ty jsem ty watercraft ty odríkávat ‘Velebit BUH pro krome nás podle odporný lidé"},{"number":29,"text":"Odríkávat ‘Muj Lord pripustit mne vylodit zpropadený zjištení; Ty byl nejlepší vysvoboditel"},{"number":30,"text":"Tyto postarat se sufficient zkouška ty! My prosím pripojit ty vyzkoušet"},{"number":31,"text":"Subsequently my dosadit jiný buzení pozdeji Ti"},{"number":32,"text":"My poslal podle ti hlasatel podle ti odríkávat Ty zbonovat BUH! Ty ne mel jinak buh Jemu. Ty ne jsem spravedlivý"},{"number":33,"text":"Vedoucí svém lidé pochybovat vyradit plán Dále - Trebae my postarat se nebo ti generously za tohleto doivotní - Odríkávat Tento jsem nikoliv jinam than lidská bytost jsem ty! On strávit podle co ty strávit nápoj ackoliv ty nápoj"},{"number":34,"text":"Jestlie ty poslouchat lidská bytost jsem ty pak ty jsem skutecne kdo neco ztratí"},{"number":35,"text":"On slibný ty ty poslední obeh v poprášit kost ty delat se znovu"},{"number":36,"text":"Nemoný nemoný vskutku byl co slibný ty"},{"number":37,"text":"My jen bydlit tento doivotní - My bydlit poslední! - A my nikdy vzkrísit"},{"number":38,"text":"On jsem presne mu vymýšlet svetský znak ti BUH! My nikdy verit jemu"},{"number":39,"text":"On odríkávat Muj Lord pripustit mne vítezství oni pochybovat mne"},{"number":40,"text":"On odríkávat Dríve oni jsem lítost"},{"number":41,"text":"Odškodnení praštit ti equitably tím my zapnout ti znicit. Prostopášný lidé hynout"},{"number":42,"text":"Subsequently my dosadit jinak výroba ti"},{"number":43,"text":"Nikoliv spolecnost podporovat svuj dopredu daný smrt nor zdret to"},{"number":44,"text":"Pak my odeslat náš hlasatel za postup. Všechen cas hlasatel odchod svém spolecnost oni pochybovat jemu. Proto my zrušit ti 1 další útocit ti dejiny! Lidé pochybovat hynout"},{"number":45,"text":"Pak my odeslat Moses svém kamarád Aaron náš zjevení dukladný zkouška"},{"number":46,"text":"S Pharaoh svém starší oni zapnout nadutý! Oni jsem utiskující lidé"},{"number":47,"text":"Oni odríkávat my verit 2 mu kterého lidé byl náš pomocný"},{"number":48,"text":"Oni vyradit 2 a proto oni zrušit"},{"number":49,"text":"My odevzdat Moses bible oni usmernovat"},{"number":50,"text":"My zpusobit syn Marie svém ujmout se jako matka známka my odevzdat ti útocište mesa jídlo pít"},{"number":51,"text":"O ty hlasatel strávit poslušný zajištení rízení spravedlnost! Já byl celkem vedomý si o všechno ty ucinil"},{"number":52,"text":"recený jsem svuj sbor - 1 sbor - Já jsem svuj Lord; ty váit si Mne"},{"number":53,"text":"Oni trhal do debatovat frakce; kadý úcastník nejšastnejší co oni mel"},{"number":54,"text":"Proto presne odkázat ti jejich záhuba pro chvilku"},{"number":55,"text":"Znicit oni myšlen protoe my stanovit ti peníze detský"},{"number":56,"text":"My lít ti štestí? Vskutku oni ne mel plán"},{"number":57,"text":"Prece ty jsem reverently vedomý z jejich Magnát"},{"number":58,"text":"Který domnívat se za zjevení jejich Magnát"},{"number":59,"text":"A který nikdy spolecnost kadý obraz jejich Magnát"},{"number":60,"text":"Moný oni odevzdat jejich milodar jejich srdce jsem celkem ctihodný. Oni pripustit onen oni predvolat jejich Magnát"},{"number":61,"text":"Oni jsem netrpelivý ucinil spravedlivý spravovat; oni obstát od ucinil ti"},{"number":62,"text":"My nikdy zatíit kadý duše svuj zpusoby, my zadret zápis vyjádrit vernost. Nikdo snést nespravedlnost"},{"number":63,"text":"Jejich dbát jsem zapomnevší s tento oni predloit spravovat vyloucit co z ceho ne podrídit tento; jejich spravovat jsem odporný"},{"number":64,"text":"Pak when my odmenit se jejich vedoucí odškodnení oni naríkat"},{"number":65,"text":"Ne naríkat tak; ty ustoupit úplne prispet podle nás"},{"number":66,"text":"Muj zkouška podat ty ty povaha svuj opatrit patou"},{"number":67,"text":"Ty byl príliš nadutý uznat ti ty defiantly nedbat ti"},{"number":68,"text":"Why oni ne zrcadlit tento bible? Oni ne nahromadit onen oni zpusobit dostat neco dret nikdy dosáhnout jejich predek"},{"number":69,"text":"Oni selhání pripustit jejich hlasatel? Tento oni byl nedbat jemu"},{"number":70,"text":"Oni rozhodný onen on dret jsem senzacní? Vskutku on privést vernost ti mnoství z ti protivit si vernost"},{"number":71,"text":"Vskutku jestlie vernost podrídit jejich chtít v tom jsem chaos nebe zahrabat; všechno ti podplatit! My odevzdat ti jejich pevný oni nedbat jejich zkouška"},{"number":72,"text":"Ty poadovat ti probíhat? Svuj Magnát probíhat jsem druhý zcela. On byl zcela Správce"},{"number":73,"text":"mnoství jiste ty lákat ti váný dráha"},{"number":74,"text":"Ty pochybovat Dále prece zmenit smer ceho vzprímit dráha"},{"number":75,"text":"Práve when my lít ti ke soucit, pomoct jejich problémy oni ponorit nadmerne prestupek zustat chyba"},{"number":76,"text":"Pravidelný when my souit ti odškodnení oni nikdy zapnout jejich Magnát vzývat"},{"number":77,"text":"Subsequently when my odmenit se ti drsný odškodnení oni privodit si oni otrást"},{"number":78,"text":"On byl 1 který pripustit ty výslech zrak mozek! Zrídka jsem ty uznalý"},{"number":79,"text":"On byl Jednotka dosadit ty zahrabat a Jemu ty predvolat"},{"number":80,"text":"On jsem Jednotka rízený doivotní smrt On jsem 1 který alternates vecer cas. Ty ne porozumení"},{"number":81,"text":"Oni odríkávat co jejich predek odríkávat"},{"number":82,"text":"Oni odríkávat Zadní my poslední slušet poprášit kost my dosáhnout vzkrísit"},{"number":83,"text":"Stejný slib odevzdat nás náš zdroj za a nad. Tyto byl nikoliv jinam than pocet podle pres"},{"number":84,"text":"Ríct, \"Podle koho patrit zahrabat kadý to jestlie ty módní"},{"number":85,"text":"Oni ríct, \"Podle BUH. Odríkávat pak ty ne pokládat pozornost"},{"number":86,"text":"Odríkávat Kterí jsem Magnát z 7 vesmír; Magnát prima navláda"},{"number":87,"text":"Oni odríkávat BUH. Odríkávat pak ty ne zapnout spravedlivý"},{"number":88,"text":"Odríkávat Od kterého písmo byl úplne svrchovanost úplne potreby On ale jednotka stanovit porce muset nic porce ty byl módní"},{"number":89,"text":"Oni odríkávat BUH. Odríkávat Kde? prosit ty odjezd krivda"},{"number":90,"text":"My odevzdat ti vernost i kdy oni jsem lhárka"},{"number":91,"text":"BUH NIKDY ZPLODIT SYN. Nor jsem v tom vubec kadý jinak buh Jemu. Jinak kadý buh prohlásit nezávislost svém stvorení oni obstát kadý jinam pro nadvláda! BUH OSLAVOVAT; DRUHÝ JEJICH POADOVAT"},{"number":92,"text":"Knower z úplne ochrana prezidenta popis; On povýšit druhý mel spojit"},{"number":93,"text":"Odríkávat Muj Lord Ty beet mne (odškodnení) oni privodit si"},{"number":94,"text":"Muj Lord pripustit mne ne byl jednotka z zhrešit lidé"},{"number":95,"text":"S beet ty (odškodnení) my zachovat ti byl neco my docela dobre ucinil"},{"number":96,"text":"Proto opacný jejich odporný spravovat chu; my jsem celkem vedomý si o jejich poadovat"},{"number":97,"text":"Odríkávat Muj Magnát já ádat útocište Ty podle šeptat souit"},{"number":98,"text":"Já ádat útocište za Ty muj Magnát lest oni podlehnout mne"},{"number":99,"text":"When smrt podlehnout 1 z ti on odríkávat Muj Lord poslal mne"},{"number":100,"text":"Já pak rízení spravedlnost všechno já odkázat. Ne skutecný! Tento jsem falešný poadovat on útocit. Ohrada rozloucit svém duše tento spolecnost zmrtvýchvstání"},{"number":101,"text":"When roh ne kvet pomer ti být onen cas nor prosit oni pecovat 1 jiný"},{"number":102,"text":"Ohledne Ceho ty váha jsem váný oni jsem vítez"},{"number":103,"text":"Ty váha jsem lehce byl jednotka pozbýt jejich duše; oni zustávat Peklo stále"},{"number":104,"text":"Povzbudit zaplavit jejich celo oni vydret miserably therein"},{"number":105,"text":"Ne jsem Muj zjevení uvést ve výctu ty ty zadret vyradit ti"},{"number":106,"text":"Oni odríkávat Náš Magnát náš wickedness zaplavit nás my lidé odchod z cesty"},{"number":107,"text":"(Náš Lord pokládat nás out o tento; jestlie my vrátit náš starší behavior) pak my jsem skutecne prostopášný"},{"number":108,"text":"On odríkávat Zustávat therein poníit ne mluven podle Mne"},{"number":109,"text":"Seskupit Muj sluha uívaný odríkávat ‘Náš Magnát my verit e omluvit nás lít nás ke soucit! Z úplne milosrdný jednotka Ty jsem nejvetší Milosrdný"},{"number":110,"text":"Ty fraška zesmešnit ti stupen onen ty nepamatovat si Mne! Ty jednat smát se ti"},{"number":111,"text":"Já odmenit ti dnes operadlo jejich steadfastness vývoj ti vítez"},{"number":112,"text":"On odríkávat \"E dlouze ty vydret zahrabat? E mnoství roky"},{"number":113,"text":"Oni odríkávat My vydret cas part z cas! Poadovat ty pocet"},{"number":114,"text":"On odríkávat skutecne ty utišit výtah interval ty jen módní"},{"number":115,"text":"Ty myšlen my Zpusobit tvorit ty za zbytecný ty ne jsem navrácení nás"},{"number":116,"text":"Povýšit jsem BUH správný Nejvyšší! v tom ne jsem jinak buh Jemu; nejvetší Honorable Magnát vlastník úplne moc"},{"number":117,"text":"Kadý zbonovat koho BUH kadý jiný buh nejaký druh o zkouška on vypocítat utišit svém Magnát. disbelievers nikdy mít úspech"},{"number":118,"text":"Odríkávat Muj Lord lít nás odpuštení soucit! Z úplne milosrdný jednotka Ty jsem nejvetší Milosrdný"}]}