{"number":44,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"M"},{"number":2,"text":"Tento informovat bible"},{"number":3,"text":"My odeslat to srazit zpropadený vecer my byl vypovedet"},{"number":4,"text":"Od to (bible) naprostý duvod moudrost procistit"},{"number":5,"text":"To dopredu daný ovládání podle nás onen my odeslat hlasatel"},{"number":6,"text":"Tento jsem soucit svuj Magnát. On jsem Posluchac Vševedoucí"},{"number":7,"text":"Magnát z nebe zahrabat všechno ti. Jestlie jen ty jsem nejaký"},{"number":8,"text":"v tom ne jsem jinak buh Jemu. On rízený doivotní smrt; svuj Magnát Magnát svuj predek"},{"number":9,"text":"Vskutku oni jsem nerozhodný nepozorný"},{"number":10,"text":"Proto stát na strái cas when lye privést dukladný podkurovat"},{"number":11,"text":"To povlak lidé; tento jsem trapný odškodnení"},{"number":12,"text":"Náš Lord pomoct tento odškodnení nás; my jsem verící"},{"number":13,"text":"Vedle onen ono jsem príliš poslední oni pamatovat! informovat hlasatel podlehnout ti"},{"number":14,"text":"Oni povaha jemu rcení Zdroj civilizovat potreštený"},{"number":15,"text":"My pomoct odškodnení chvilku; ty dríve odvrátit"},{"number":16,"text":"Cas my postihnout porádne zdvih my pomstít"},{"number":17,"text":"My zkoušet ti lidé Pharaoh; honorable hlasatel odchod ti"},{"number":18,"text":"Vyhlásit Naslouchat podle mne sluha BUH! Já jsem cestný hlasatel ty"},{"number":19,"text":"A ne zhrešit BUH. Já privést ty výkonný zkouška"},{"number":20,"text":"Já ádat útocište muj Magnát svuj Lord ty odpírat mne"},{"number":21,"text":"Ty ne ádat verit pak proste opustit mne"},{"number":22,"text":"Subsequently on vzývat svém Magnát Tyto jsem prostopášný lidé"},{"number":23,"text":"(Buh odríkávat) Cestovat Muj sluha vecer; ty pokracovat"},{"number":24,"text":"Vzájemný more rychle; jejich houf potopit"},{"number":25,"text":"Tím oni opustit mnoho zahradní skákal"},{"number":26,"text":"Osít bujný doivotní"},{"number":27,"text":"Štestí oni trávit"},{"number":28,"text":"úplne tyto my zpusobit dedit po jiný lidé"},{"number":29,"text":"Vubec nebe nor zahrabat plakal ti oni ne odrocit"},{"number":30,"text":"Meanwhile my uchovat Detský Izrael poníit perzekuce"},{"number":31,"text":"Podle Pharaoh; on jsem tyran"},{"number":32,"text":"My chtít ti úplne lidé znalecky"},{"number":33,"text":"My beet ti mnoho zkouška který zaloit prima vyzkoušet"},{"number":34,"text":"Poskytovat výroba odríkávat"},{"number":35,"text":"My jen poslední 1 smrt; my nikdy vzkrísit"},{"number":36,"text":"Privést podporovat náš predek jestlie ty jsem pravý"},{"number":37,"text":"Oni byl zcela than lidé z Tubba others ti? My zrušit ti jejich zlocin"},{"number":38,"text":"My ne tvorit nebe zahrabat všechno ti proste hraní"},{"number":39,"text":"My tvorit ti typický smysl mnoství z ti ne módní"},{"number":40,"text":"Cas Rozhodnutí awaits ti úplne"},{"number":41,"text":"Onen byl cas when nikoliv stoupenec porce svém stoupenec za ádný ráz nikdo porce"},{"number":42,"text":"Jen ty dosáhnout soucit BUH. On jsem Všemohoucí Milosrdný"},{"number":43,"text":"Prece strom z bitterness"},{"number":44,"text":"Stanovit jídlo pro a hríšný"},{"number":45,"text":"Jako louit to varený strávit"},{"number":46,"text":"Stejný vred pekelný pít"},{"number":47,"text":"absorbovat jemu házet jemu do soustredit Peklo"},{"number":48,"text":"Pak proudit na svém pristrihnout odškodnení Peklo"},{"number":49,"text":"Chutnat tento; ty jsem e výkonný e honorable"},{"number":50,"text":"Tento jsem co ty jednat pochybovat"},{"number":51,"text":"Spravedlivý prosit jsem poskytnout místo"},{"number":52,"text":"Trávit zahradní skákal"},{"number":53,"text":"Trvat samet satén; pred kadý jinam"},{"number":54,"text":"My pripustit ti výtecný snoubenec"},{"number":55,"text":"Oni trávit to úplne druh o ovoce doplnit pokoj"},{"number":56,"text":"Oni ne chutnat smrt therein - Krome 1 smrt - On ušetrit ti odškodnení Peklo"},{"number":57,"text":"recený jsem štestí svuj Magnát. recený jsem veliciny radost z vítezství"},{"number":58,"text":"My tím procistit to svuj rec onen oni pokládat pozornost"},{"number":59,"text":"Proto cekat; oni príliš cekat"}]}