{"number":47,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"ackoliv oni vydret 1 doba cas. Tento výzva byl to ne prostopášný který byl systematicky zrušit? . . [47:1] Ty pochybovat zahnat dráha BUH On zrušit jejich spravovat"},{"number":2,"text":"Ty domnívat se rízení spravedlnost domnívat se za co odeslat shodit Muhammad! - Který jsem vernost jejich Magnát - On podrobit jejich hrích štestí ti spokojenost"},{"number":3,"text":"Tento byl ty pochybovat následující prolhanost doba ty verit následující vernost jejich Magnát. BUH TÍM UVÉST LIDÉ JEJICH PRÍKLAD"},{"number":4,"text":"Ty potkat (od bojovat) ty pochybovat ty postihnout krkovicka! Ty pokládat ti zajatec ty urcit ti volný vykoupit ti bojovat znicit! Mel BUH willed On pripustit ty vítezství bojovat! On tím zkoušet ty 1 jiný. Ohledne Ceho ty vzít si znemonit dát BUH On nikdy pripojit jejich zasvetit odpadový"},{"number":5,"text":"On usmernovat ti štestí ti spokojenost"},{"number":6,"text":"On uznat ti Ráj On popisovat ti"},{"number":7,"text":"O ty verit ty snést BUH On snést ty upevnit svuj foothold"},{"number":8,"text":"Ty pochybovat privodit si bída; On zpusobit jejich spravovat jsem zcela za zbytecný"},{"number":9,"text":"Onen because oni protivit si který BUH odhalit proto On zrušit jejich spravovat"},{"number":10,"text":"Oni ne chodit zahrabat zpusobit prijmout dusledek pro ty neli ti? BUH zkosit JEJICH SPRAVOVAT; ÚPLNE disbelievers SNÉST STEJNE SMRT"},{"number":11,"text":"Tento byl BUH jsem Magnát z ty verit i kdy disbelievers ne mel magnát"},{"number":12,"text":"BUH UZNAT TY domnívat se PRIMET SPRAVEDLIVÝ DOIVOTNÍ DO ZAHRADNÍ PRÍLIV PRAMEN! Ohledne Ceho ty pochybovat oni bydlit strávit mít rád zvíre jezený pak skoncit hellfire"},{"number":13,"text":"Mnoho spolecnost jsem skoro silný than spolecnost onen vystehovat násilne ty svuj mesto; when my zrušit ti nikdo porce ti"},{"number":14,"text":"Byl ty informovat jejich Magnát spolu ackoliv ty zlý rízení zdobit jejich otvor oni následující jejich uznat mínení"},{"number":15,"text":"(Alegorie Ráj slibný spravedlivý byl tento ono mel proud unpolluted rozvodnit proud z veselý odrít proud z víno! - Výtecný pro drinkers - Proud natáhnout med. Oni mel úplne druh o ovoce therein odpuštení podle jejich Magnát. Oni lepší) ty (byl zustávat stále thehellfire pít pekelný rozvodnit trhal jejich domácí)"},{"number":16,"text":"Trochu o ti naslouchat podle ty pak ackoliv brzo ackoliv oni odkázat oni poadovat ty informovat Co ucinil on pred ríct BUH tím vtisknout jejich srdce proto oni následující jen jejich mínení"},{"number":17,"text":"Ohledne Ceho ty usmernovat On rozšírit jejich rízení pripustit ti jejich spravedlnost"},{"number":18,"text":"Oni cekat Doba byl podlehnout ti náraz? Úplne známka o tom ji podlehnout. Dríve Doba podlehnout ti jak oni ucinil to uitek pred jejich poslání"},{"number":19,"text":"Ty módní onen V tom ne jsem jinak buh BUH poadovat odpuštení z svuj hrích hrích z úplne domnívat se mu ena. BUH jsem CELKEM vedomý si o SVUJ ROZHODNUTÍ SVUJ POSLEDNÍ URCENÍ"},{"number":20,"text":"Ty verit odríkávat When prosit znovu sura odhalit when cestný sura odhalit wherein boj uvedený ty prijmout ty harbored pochybovat jejich jádro pohled ty smrt ji podlehnout ti! Oni tím ukázat"},{"number":21,"text":"Poslušnost spravedlivý projev myslit z ti. Jen oni beet duverné sdelení BUH when mobilizace jsem prijít to byl lepší ti"},{"number":22,"text":"Byl to také svuj úcel ty odkázat ty predloit odporný týrat svuj vztané zájmeno"},{"number":23,"text":"jsem ty privodit si klít BUH whereby On prevod ti hluchý slepý"},{"number":24,"text":"Why oni ne usilovat Quran starostlive? Oni mel premoct jejich dbát"},{"number":25,"text":"Prece ty klouzat operadlo rízení zaznamenat ti souit lákat ti primet ti u"},{"number":26,"text":"Tento byl oni ríct podle ty protivit si který BUH odeslat shodit My poslouchat ty nejaký duvod. BUH celkem módní jejich ochrana prezidenta spiknutí"},{"number":27,"text":"Jak to ucinil to pro ti when andel byl pripojit ti s smrt? Oni obvod ti jejich celo jejich vzdelávat skoncit"},{"number":28,"text":"Tento because oni rídili se který angered BUH protivit si potreby spokojený Jemu! Proto On zrušit jejich spravovat"},{"number":29,"text":"Ty harbor pochybovat jejich jádro pamatovat onen zpusobit BUH prosit ne nosit out jejich odporný thoughts"},{"number":30,"text":"My prosit my ukázat ti ty e kdy ty pripustit ti spravedlivý pohled ti. Ty pripustit ti mimo a ráz oni povídat. BUH jsem CELKEM vedomý si o úplne SVUJ SPRAVOVAT"},{"number":31,"text":"My prosím pripojit ty vyzkoušet za rozkazovat vyznamenat ty ty který snail se steadfastly vytrvat My ukázat svuj správný prednost"},{"number":32,"text":"Ty pochybovat zahnat dráha BUH postavit se proti hlasatel rízení zaznamenat pro ti nikdy škoda BUH za a nejméne Místo On zrušit jejich spravovat"},{"number":33,"text":"O ty verit ty poslouchat BUH uposlechnout hlasatel. Jinak úplne svuj spravovat jsem za zbytecný"},{"number":34,"text":"Ty pochybovat zahnat dráha BUH pak hrát v kostky disbelievers BUH prosit nikdy omluvit ti"},{"number":35,"text":"Proto ty ne waver vzdát pronásledování pokoj ty rucit vítezství BUH jsem ty. On nikdy obnosit svuj program"},{"number":36,"text":"Tento svetový doivotní jsem nikoliv jinam than hra marnost. Ty domnívat se primet spravedlivý doivotní On odmenit ty poadovat ty kadý peníze"},{"number":37,"text":"Jestlie On poadovat ty peníze s stupen tvorit útrapa ty ty slušet skoupý svuj skrytý odporný moc ukázat"},{"number":38,"text":"Ty lákat vycerpat dát BUH trochu o ty zapnout skoupý! Skoupý ar skoupý towards jejich uznat duše. BUH jsem DRAHÝ DOBA TY jsem ŠPATNÝ. Ty obeh On zástupce jiný lidé svuj zaúctovat oni ne jsem ty"}]}