{"number":50,"edition":"cs.hrbek","ayahs":[{"number":1,"text":"a nádherný Quran"},{"number":2,"text":"Oni rozhodnutí to zvláštní onen warner podle ti podlehnout ti! disbelievers odríkávat Tento jsem skutecne zvláštní"},{"number":3,"text":"Za my poslední slušet oprášit; tento jsem nemoný"},{"number":4,"text":"My byl celkem vedomý si o kadý z ti vzít si stravovat zahrabat; my mel správný zápis"},{"number":5,"text":"Oni vyradit vernost when to podlehnout ti; oni zcela zmást"},{"number":6,"text":"Oni ne pohled lye shora ti jak my postavit ono zdobit ono poškodit"},{"number":7,"text":"My tvorit zahrabat rozloení to hora dospelý to úplne druh o krásný opustit"},{"number":8,"text":"Tento jsem osvícení pripomínka naprostý oddaný worshiper"},{"number":9,"text":"My odeslat lye zpropadený rozvodnit dospelý ono zahradní jádro sklízet"},{"number":10,"text":"Velký pocházet podmazat shluk ovoce"},{"number":11,"text":"Zajištení lidé. My obnovit to naprostý získat; ty similarly vzkrísit"},{"number":12,"text":"Pochybovat ti jsem lidé Noe obyvatel Russ Thamoud"},{"number":13,"text":"‘Aad Pharaoh bratri Moc"},{"number":14,"text":"Obyvatel les lidé Tubba. Úplne o ti pochybovat hlasatel proto Muj odškodnení postihnout ti"},{"number":15,"text":"My príliš zatíit 1 stvorení? Tento why oni byl pochybovat zmrtvýchvstání"},{"number":16,"text":"My tvorit lidský my módní co on šeptat sobe. My jsem konec s jemu than svém krcní rys"},{"number":17,"text":"zaznamenat (andel) na právo na opustit porád zaznamenat"},{"number":18,"text":"Ne projev vyloucit co z ceho on vyjádrit cilý svedcit"},{"number":19,"text":"Posléze nevyhnutelný ohon smrt podlehnout; tento jsem co ty zkoušel obejít"},{"number":20,"text":"Roh kvet; tento jsem slíbit cas"},{"number":21,"text":"Naprostý duše delat se ke pasák svedcit"},{"number":22,"text":"Ty jednat jsem zapomnevší s tento. My okamite odstranující svuj zahalit; dnes svuj zjevení byl (jako silný ackoliv zocelit)"},{"number":23,"text":"Druhý odríkávat Sem jsem muj strašný potvrzení"},{"number":24,"text":"Házet do Gehenna naprostý nepovolný disbeliever"},{"number":25,"text":"Forbidder milodar agresor vrchol z pochybovat"},{"number":26,"text":"On spolecnost BUH jiný buh. Házet jemu do drsný odškodnení"},{"number":27,"text":"Svém druhý odríkávat Náš Magnát já ne zavést jemu; on jsem druhý z cesty"},{"number":28,"text":"On odríkávat ne krevní msta Mne; já dost vypovedet ty"},{"number":29,"text":"Nic vymenit tak. Já jsem nikdy nespravedlivý towards lidé"},{"number":30,"text":"Byl cas when my poadovat Peklo Mel ty mel dost ceho To odríkávat Odevzdat mne jinam"},{"number":31,"text":"Ráj prednést spravedlivý snadno"},{"number":32,"text":"Tento jsem který slibný naprostý repenter pevný"},{"number":33,"text":"Oni váit si nejvetší Blahosklonný za jejich zachování tajemství podlehnout wholeheartedly"},{"number":34,"text":"Napsat to pokoj; tento jsem Cas Vecné Pravdy"},{"number":35,"text":"Oni dosáhnout všechno oni ádat therein my mel ješte jinam"},{"number":36,"text":"Mnoho výroba ti jsem výkonný my zrušit. Oni hledat získat; oni rozhodnutí utéct"},{"number":37,"text":"Tento jsem lekce kadý mít dbát jsem dovedný podle naslouchat svedcit"},{"number":38,"text":"My tvorit nebe zahrabat všechno ti 6 cas nic unavit tah ve tvári nás"},{"number":39,"text":"Proto byl trpelivý za a omítka z jejich projev pochvala oslavovat svuj Magnát dopredu východ slunce dopredu západ slunce"},{"number":40,"text":"Vecer ty premýšlet Svém uvést za premoct"},{"number":41,"text":"nacvicit si cas when volající prijít zaúctovat byl pred"},{"number":42,"text":"When oni naslouchat nevyhnutelný vyvolávat; byl cas ty delat se"},{"number":43,"text":"My jsem jednotka rízený doivotní smrt; nás jsem rozhodný urcení"},{"number":44,"text":"Cas podlehnout when zahrabat rána za a pospíchat odevzdat stoupnout ti! Tak predvolat byl lehký pro nás ucinil"},{"number":45,"text":"My byl celkem vedomý si o všechno oni vyjádrit i kdy ty ne mel moc ti. Proto upomenout tento Quran ty váit si Muj výstraný"}]}