{"number":56,"edition":"nl.keyzer","ayahs":[{"number":1,"text":"Als de onvermijdelijke dag des oordeels plotseling zal komen"},{"number":2,"text":"Zal geene ziel de voorspelling zijner komst van valschheid beschuldigen"},{"number":3,"text":"Sommigen zullen daardoor vernederd, en anderen verheven worden"},{"number":4,"text":"Als de aarde door een hevigen schok zal geschud worden"},{"number":5,"text":"En de bergen in stukken zullen springen"},{"number":6,"text":"En als weggeblazen stof zullen worden"},{"number":7,"text":"En gij, menschen, in drie duidelijke klassen zult verdeeld worden"},{"number":8,"text":"De makkers van de rechterhand (hoe gelukkig zullen de makkers der rechterhand wezen)"},{"number":9,"text":"En de makkers der linkerhand, (hoe ellendig zullen de makkers der linkerhand zijn)"},{"number":10,"text":"En zij, die anderen in het geloof zijn voorgegaan, zullen hen in het paradijs voorafgaan"},{"number":11,"text":"Dat zijn zij, die God zullen naderen"},{"number":12,"text":"Zij zullen in tuinen van vermaak wonen"},{"number":13,"text":"Daar zullen velen van de vroegere godsdiensten"},{"number":14,"text":"En enkelen van den lateren zijn"},{"number":15,"text":"Rustende op zetels met goud en edelgesteenten versierd"},{"number":16,"text":"En tegenover elkander daarop zittende"},{"number":17,"text":"Jonge lieden, die eeuwig jong zullen blijven, zullen om hen heen gaan, om hen te bedienen"},{"number":18,"text":"Met bekers, kroezen en schalen met vloeienden wijn"},{"number":19,"text":"Hunne hoofden zullen geen pijn gevoelen, door dien te drinken, en hun verstand zal niet beneveld worden"},{"number":20,"text":"En met vruchten, van de soorten, welke zij zullen kiezen"},{"number":21,"text":"En het vleesch van de vogelsoort, welke zij zullen begeeren"},{"number":22,"text":"Daar zullen zij door schoone maagden worden vergezeld"},{"number":23,"text":"Met groote, zwarte oogen, gelijkende op paarlen, die in hare schelpen verborgen zijn"},{"number":24,"text":"Dit zal een belooning wezen, voor hetgeen zij zullen hebben verricht"},{"number":25,"text":"Daar zullen zij geene ijdele gesprekken hooren of eenige aansporing tot zonde"},{"number":26,"text":"Maar alleen de begroeting: Vrede! vrede"},{"number":27,"text":"En de makkers der rechterhand (hoe gelukkig zullen de makkers der rechterhand wezen)"},{"number":28,"text":"Zullen hun verblijf houden onder lotusboomen, vrij van doornen"},{"number":29,"text":"En banaan-boomen, geregeld beladen met hunne voortbrengselen, van den top tot den stam"},{"number":30,"text":"In de uitgebreide schaduw"},{"number":31,"text":"Nabij een stroomend water"},{"number":32,"text":"En te midden van een overvloed van vruchten"},{"number":33,"text":"Welke niemand zal afsnijden, en waarvan de inzameling niet zal verboden zijn"},{"number":34,"text":"En zij zullen op verheven bedden uitrusten"},{"number":35,"text":"Waarlijk, wij hebben de maagden van het paradijs door eene bijzondere schepping gevormd"},{"number":36,"text":"En wij hebben haar tot maagden gemaakt"},{"number":37,"text":"Bemind door hare echtgenooten, die van gelijken ouderdom met haar zijn"},{"number":38,"text":"Tot de geneugten der makkers van de rechterhand"},{"number":39,"text":"Daar zullen velen van de vroegere godsdiensten"},{"number":40,"text":"En velen van den lateren zijn"},{"number":41,"text":"En de makkers van de linkerhand (hoe ellendig zullen de makkers der linkerhand zijn)"},{"number":42,"text":"Zullen wonen te midden van brandende, verpestende winden en kokend water"},{"number":43,"text":"Onder de schaduw van zwarten rook"},{"number":44,"text":"Die noch koel, noch aangenaam zal wezen"},{"number":45,"text":"Want zij genoten de genoegens van het leven, vóór dit, terwijl zij op de aarde waren"},{"number":46,"text":"En zij volhardden stijfhoofdig in eene hatelijke zondigheid"},{"number":47,"text":"En zij zeiden: Nadat wij zullen gestorven, en tot stof en beenderen geworden zijn, zullen wij dan zekerlijk tot het leven worden opgewekt"},{"number":48,"text":"Zullen onze vaderen ook met ons worden opgewekt"},{"number":49,"text":"Zeg: waarlijk, zoowel de vroegeren als de lateren"},{"number":50,"text":"Zullen zekerlijk op den vooraf bepaalden tijd van een bekenden dag worden bijeen verzameld, om geoordeeld te worden"},{"number":51,"text":"En gij, o menschen! die gedwaald, en de opstanding als eene valschheid geloochend hebt"},{"number":52,"text":"Gij zult zekerlijk eten van de vrucht des booms van al Zakkoem"},{"number":53,"text":"Gij zult uwen buik daarmede vullen"},{"number":54,"text":"En gij zult daar kokend water drinken"},{"number":55,"text":"Gij zult drinken, zooals een dorstige kameel drinkt"},{"number":56,"text":"Dit zal hunne uitspanning op den dag des oordeels zijn"},{"number":57,"text":"Wij hebben u geschapen; wilt gij dus niet gelooven, dat wij u van den dood kunnen opwekken? Wat denkt gij"},{"number":58,"text":"Het zaad dat gij uitwerpt"},{"number":59,"text":"Schept gij dat, of zijn wij er de schepper van"},{"number":60,"text":"Wij hebben voor u allen den dood bepaald, en wij zullen daarin door niemand worden belet"},{"number":61,"text":"Wij zijn in staat anderen, gelijk gij in uw plaats te stellen, en u terug te brengen in den toestand of den vorm, dien gij niet kent"},{"number":62,"text":"Gij kent de schepping; wilt gij dus niet overwegen, dat wij u, door u op te wekken, weder kunnen voortbrengen"},{"number":63,"text":"Wat denkt gij? Het graan dat gij zaait"},{"number":64,"text":"Doet gij dat uitbotten, of doen wij dat voortspruiten"},{"number":65,"text":"Indien het ons behaagde, waarlijk, wij konden het droog en onvruchtbaar maken, zoodat gij niet zoudt ophouden u te verwonderen, zeggende"},{"number":66,"text":"Waarlijk, wij hebben verbintenissen aangegaan voor zaad en arbeid"},{"number":67,"text":"Maar het is ons niet geoorloofd, de vruchten daarvan te oogsten"},{"number":68,"text":"Wat denkt gij? Het water dat gij drinkt"},{"number":69,"text":"Zendt gij dat uit de wolken neder, of zenden wij het"},{"number":70,"text":"Indien het ons behaagde, zouden wij het brak kunnen maken. Zult gij dus niet dankbaar wezen"},{"number":71,"text":"Wat denkt gij? Het vuur, dat gij door wrijving verkrijgt"},{"number":72,"text":"Brengt gij den boom voort, waardoor gij dat doet ontstaan? Of brengen wij dien voort"},{"number":73,"text":"Wij hebben dit als eene vermaning bevolen en tot een voordeel voor hen, die door de woestijnen reizen"},{"number":74,"text":"Prijst dus den naam van uwen Heer, den grooten God"},{"number":75,"text":"Ik zweer echter, bij het ondergaan der sterren"},{"number":76,"text":"En waarlijk, dit is een groote eed, indien gij het slechts wist"},{"number":77,"text":"Dat dit de uitmuntende Koran is"},{"number":78,"text":"Waarvan het oorspronkelijke in het welbewaarde boek is geschreven"},{"number":79,"text":"Niemand zal het aanraken, behalve zij, die rein zijn"},{"number":80,"text":"Het is eene openbaring van den Heer van alle schepselen"},{"number":81,"text":"Zult gij dus deze nieuwe openbaring verachten"},{"number":82,"text":"En is dit uwe vergelding voor uw voedsel, hetwelk gij van God ontvangt, dat gij u zelven loochent, hem daarvoor verplicht te zijn"},{"number":83,"text":"Als de ziel van een stervend mensch tot zijne keel opstijgt"},{"number":84,"text":"En gij op hetzelfde oogenblik rond ziet"},{"number":85,"text":"En wij zijn hem nader dan gij; maar gij ziet zijn waren toestand niet"},{"number":86,"text":"Zoudt gij dan niet, indien gij hier namaals niet voor uwe daden werdt vergolden"},{"number":87,"text":"Die in het lichaam doen terugkeeren, indien gij de waarheid spreekt"},{"number":88,"text":"En voor hem die tot degenen behoort, welke God zullen naderen"},{"number":89,"text":"Zal de belooning zijn, rust, genade en een tuin van vermaak"},{"number":90,"text":"En behoort hij tot de makkers der rechterhand"},{"number":91,"text":"Dan zal hij gegroet worden met de begroeting: Vrede zij over u! door de makkers der rechterhand, zijne broeders"},{"number":92,"text":"Of, indien hij tot hen behoort, die het ware geloof (den profeet) verworpen hebben. En afgedwaald zijn"},{"number":93,"text":"Zijn voedsel zal kokend water wezen"},{"number":94,"text":"En de verbranding door het hellevuur"},{"number":95,"text":"Waarlijk, dit is een zekere waarheid"},{"number":96,"text":"Daarom prijst den naam van uwen Heer, den grooten God"}]}