{"number":71,"edition":"nl.keyzer","ayahs":[{"number":1,"text":"Waarlijk, wij zonden Noach tot zijn volk, zeggende: Waarschuw uw volk, alvorens hen eene vreeselijke straf overvalt"},{"number":2,"text":"Noach zeide: O mijn volk! waarlijk, ik ben een openbaar prediker voor u"},{"number":3,"text":"Daarom, dient den eenigen God, vreest hem en gehoorzaamt mij"},{"number":4,"text":"Hij zal u een gedeelte uwer zonden vergeven, en zal u uitstel verleenen tot een bepaalden tijd; want als de door God bepaalde tijd komt, zal die niet worden uitgesteld; indien gij lieden van verstand waart, zoudt gij dit weten"},{"number":5,"text":"Hij zeide: O Heer! waarlijk, ik heb mijn volk nacht en dag geroepen"},{"number":6,"text":"Maar mijne stem heeft hunnen tegenzin slechts vermeerderd"},{"number":7,"text":"En wanneer ik hen tot het ware geloof riep, opdat gij hun zoudt vergeven, staken zij hunne vingers in hunne ooren, en bedekten zich met hunne kleederen; zij volhardden in hunne ongeloovigheid, en versmaadden mijn raad hoovaardig"},{"number":8,"text":"Daarop heb ik hen in het openbaar uitgenoodigd"},{"number":9,"text":"En ik sprak tot hen in het openbaar. Ik vermaande hen ook in het geheim"},{"number":10,"text":"En ik zeide: vraagt vergiffenis van uwen Heer; want hij is vergevensgezind"},{"number":11,"text":"Hij zal rijkelijk regen van den hemel op u doen nederstroomen"},{"number":12,"text":"Hij zal u vermeerdering van welvaart en van kinderen schenken, en hij zal u tuinen geven en u met rivieren voorzien"},{"number":13,"text":"Wat scheelt u, dat gij niet op Gods goedheid vertrouwt"},{"number":14,"text":"Hij heeft u toch in verschillende vormen geschapen"},{"number":15,"text":"Ziet gij niet, hoe God de zeven hemelen boven elkander heeft geschapen"},{"number":16,"text":"En hoe hij de maan ter verlichting daarin heeft geplaatst, en dat hij de zon als tot een fakkel heeft bestemd"},{"number":17,"text":"God heeft ook u voortgebracht, en u uit de aarde doen voortspruiten"},{"number":18,"text":"Hierna zal hij u weder daarin doen terugkeeren, en hij zal u daaruit weder wegnemen, door u uit uwe graven te doen verrijzen"},{"number":19,"text":"God heeft de aarde als een voetkleed voor u uitgespreid"},{"number":20,"text":"Opdat gij langs ruime paden daar zoudt mogen wandelen"},{"number":21,"text":"Noach zeide: Heer! waarlijk, zij zijn mij ongehoorzaam, en zij volgen hen, wier rijkdommen en kinderen hun verderf slechts vermeerderen"},{"number":22,"text":"Zij smeedden eene gevaarlijke samenspanning tegen Noach"},{"number":23,"text":"Hun opperhoofd zeide tot de anderen: Gij zult uwe goden volstrekt niet verlaten, en gij zult Wedd noch Sowa verzaken, Noch Jaghoeth en Yaoek en Nesr"},{"number":24,"text":"En zij verleidden velen (want gij zult slechts de dwaling der zondaren vermeerderen)"},{"number":25,"text":"Zij werden verdronken om hunne zonden, en in het hellevuur geworpen. Zij vonden niemand die hen tegen God ondersteunde"},{"number":26,"text":"En Noach zeide: Heer, laat geen gezin der ongeloovigen op de aarde"},{"number":27,"text":"Want indien gij hen daar laat, zullen zij uwe dienaren verleiden, en slechts eene zondige en ongeloovige nakomelingschap voortbrengen"},{"number":28,"text":"Heer! vergeef mij en mijnen bloedverwanten, en ieder die mijn huis zal binnen gaan, en die een waar geloovige is, en de ware geloovigen van beiderlei kunne, en geef den onrechtvaardigen niets dan verdelging"}]}