{"number":74,"edition":"nl.keyzer","ayahs":[{"number":1,"text":"O gij die met een mantel bedekt zijt"},{"number":2,"text":"Rijs op en predik"},{"number":3,"text":"Verheerlijk uwen Heer"},{"number":4,"text":"Reinig uwe kleederen"},{"number":5,"text":"Ontvlucht iedere schande"},{"number":6,"text":"Geef niet in de hoop, daarvoor meer terug te ontvangen"},{"number":7,"text":"En wacht geduldig op uwen Heer"},{"number":8,"text":"Als de trompet zal klinken"},{"number":9,"text":"Waarlijk die dag zal een dag der droefheid wezen"},{"number":10,"text":"En pijnlijk voor de ongeloovigen"},{"number":11,"text":"Laat mij alleen met hem dien ik geschonken heb"},{"number":12,"text":"Wien ik overvloedige rijkdommen heb geschapen"},{"number":13,"text":"En kinderen die in zijne tegenwoordigheid wonen"},{"number":14,"text":"Voor wien ik de zaken gemakkelijk en gebaand heb gemaakt"},{"number":15,"text":"En die begeert, dat ik hem nog andere zegeningen zal zenden"},{"number":16,"text":"Volstrekt niet; want hij is een tegenstander onzer wonderteekens"},{"number":17,"text":"Ik zal hem met ernstige rampen bedroeven"},{"number":18,"text":"Want hij heeft honende uitdrukkingen uitgedacht en gereed gemaakt, om den Koran belachelijk te maken"},{"number":19,"text":"Gevloekt zij hij. Hoe kwaadwillig heeft hij die gereed gemaakt"},{"number":20,"text":"En hij moge nog eens gevloekt zijn. Hoe kwaadwillig heeft hij die gereed gemaakt"},{"number":21,"text":"Hij heeft zijne blikken om zich heen geworpen"},{"number":22,"text":"Daarop heeft hij zijn voorhoofd gefronsd en een ernstig gelaat aangenomen"},{"number":23,"text":"Vervolgens keerde hij zich van de waarheid en hij was opgeblazen van trotschheid"},{"number":24,"text":"En hij zeide: Dit is slechts een goochelstuk, aan anderen ontleend"},{"number":25,"text":"Dit zijn slechts de woorden van een mensch"},{"number":26,"text":"Ik zal hem in de hel nederwerpen, om verbrand te worden"},{"number":27,"text":"En wat zal u doen verstaan, wat de hel is"},{"number":28,"text":"Zij laat geen ding onverteerd, noch laat eenige zaak ontsnappen"},{"number":29,"text":"Zij verbrandt des menschen vleesch"},{"number":30,"text":"Negentien engelen zijn daarover geplaatst"},{"number":31,"text":"Wij hebben niemand buiten de engelen aangewezen, om het toezicht over het hellevuur te houden, en wij hebben hun getal slechts uitgedrukt als eene aanleiding tot tweedracht onder de ongeloovigen; opdat zij, aan wie de schriften werden gegeven, zeker mogen zijn van de waarachtigheid van dit boek, en dat de ware geloovigen in geloof mogen vermeerderen. En dat zij, aan wie de schriften werden gegeven en de ware geloovigen, daaraan niet twijfelen; En dat zij, in wier harten een gebrek schuilt, alsmede de ongeloovigen, mogen zeggen: Welke verborgenheid bedoelt God met dit getal? Zoo doet God dwalen naar zijn welbehagen, en hij richt naar zijn welbehagen. Niemand kent de legers van uwen Heer, buiten hem. Dit is slechts eene waarschuwing voor den mensch"},{"number":32,"text":"Zekerlijk. Bij de maan"},{"number":33,"text":"En den nacht, als die zich verwijdert"},{"number":34,"text":"En den ochtend, als die zich roodkleurt"},{"number":35,"text":"(Zweer ik) dat dit eene der vreeselijkste rampen is"},{"number":36,"text":"Strekkende tot waarschuwing voor den mensch"},{"number":37,"text":"Zoowel voor diegenen uwer, welke vooruit loopen, als voor hen die achterblijven"},{"number":38,"text":"Iedere ziel wordt in pand gegeven, voor hetgeen zij zal hebben verricht"},{"number":39,"text":"Behalve de makkers van de rechterhand"},{"number":40,"text":"Die in tuinen zullen wonen, en vragen tot elkander zullen"},{"number":41,"text":"Richten nopens de zondaars, (en de snoodaards zelven zullen ondervragen, zeggende)"},{"number":42,"text":"Wat heeft u in de hel gebracht"},{"number":43,"text":"Zij zullen antwoorden: Wij behooren niet tot hen die standvastig in het gebed waren"},{"number":44,"text":"Nimmer laafden wij de armen"},{"number":45,"text":"Wij baadden ons in lichtvaardige gesprekken met degenen, die zich daartoe leenden"},{"number":46,"text":"Wij loochenden den dag des oordeels"},{"number":47,"text":"Tot de dood ons overviel"},{"number":48,"text":"De tusschentreding der tusschenpersonen zal hen niet helpen"},{"number":49,"text":"Wat scheelde hun dus, dat zij zich van de vermaning des Korans afwendden"},{"number":50,"text":"Als waren zij verschrikte ezels"},{"number":51,"text":"Die den leeuw ontvluchten"},{"number":52,"text":"Maar ieder van hen wilde, dat hem een bijzonder besluit van God zou toekomen"},{"number":53,"text":"Volstrekt niet. Zij vreezen het volgende leven niet"},{"number":54,"text":"Volstrekt niet. Waarlijk, dit is eene toereikende waarschuwing"},{"number":55,"text":"En wie geneigd is, gewaarschuwd te worden, dien zal hij (de Koran) waarschuwen"},{"number":56,"text":"Doch zij zullen niet gewaarschuwd worden tenzij het Gode zal behagen. Hij is waardig gevreesd te worden, en hij is geneigd te vergeven"}]}