{"number":10,"edition":"tr.golpinarli","ayahs":[{"number":1,"text":"Elif lam ra, işte hükmü kesin ve gerçek olan kitabın ayetleri"},{"number":2,"text":"İnsanları korkutmak ve inananlara, gerçek bir güzel mükafat, inançlarına karşılık yücelik ve nimet verileceğini, şefaate mazhar olacaklarını müjdelemek için içlerinden bir ere vahyetmemiz, insanlara tuhaf mı geldi de kafirler, şüphe yok ki dediler, bu, apaçık bir büyücü"},{"number":3,"text":"Şüphe yok Rabbiniz, öyle bir Allah'tır ki gökleri ve yeryüzünü altı günde yarattı da sonra arşında kudret ve tedbiriyle her şeye hakim oldu. Her işi o, takdir ve gereğince tedbir eder. Onun izni olmadıkça hiçbir şefaatçi, şefaatte bulunamaz. İşte Rabbiniz olan Allah budur, artık kulluk edin ona. Düşünmez, ibret almaz mısınız"},{"number":4,"text":"Hepinizin dönüp varacağı yer, onun tapısıdır, gerçek olarak bunu vaadetmiştir Allah. Hiç şüphe yok ki o, halkı önce yaratır, sonra da inanıp iyi işlerde bulunanları, adalet üzere ve tam karşılığıyla mükafatlandırmak için ölümden sonra tekrar diriltir; kafir olanlaraysa, inkarlarından dolayı, içmek üzere kaynar su ve elemli bir azap vardır"},{"number":5,"text":"Öyle bir mabuttur o ki güneşi parlak ziyalı, ayı aydın ışıklı yarattı ve yılların sayısını ve hesabı bilmeniz için ona menziller tayin etti. Allah bunları boş yere değil, gerçek bir fayda için halketti. Bilen topluluğa delillerini açıklayıp bildirmededir"},{"number":6,"text":"Geceyle gündüzün, birbiri ardınca gelip gitmesinde ve Allah'ın, göklerde ve yeryüzünde halkettiği şeyler de, çekinen topluluğa elbette deliller var"},{"number":7,"text":"Şüphe yok ki bize kavuşacaklarını ummayanlar ve dünya yaşayışına razı olup yürekleri onunla yatışanlar ve delillerimizden gaflet edenler"},{"number":8,"text":"Öyle kişilerdir ki onların yurtları, kazançlarına karşılık ateştir"},{"number":9,"text":"İnanıp iyi işlerde bulunanlaraysa Rableri, nimetlerle dolu olan ve kıyılarından ırmaklar akan cennetlerin yolunu gösterir"},{"number":10,"text":"Orada duaları, seni tenzih ederiz, noksan sıfatlardan arısın ey Allah'ım sözüdür, birbirlerine iltifatları, esenlik sana sözü ve dualarının, senalarının sonu da hamd, alemlerin Rabbi Allah'a cümlesi"},{"number":11,"text":"Allah, insanların, hayrın çarçabuk oluvermesini istedikleri gibi şerri çarçabuk veriverseydi ecellerinin gelip çatmasına çoktan hükmedilmiş olurdu. Fakat biz, bize kavuşmayı ummayanları, azgınlıklarında sersem bir halde bırakırız"},{"number":12,"text":"İnsana bir zarar gelince yanüstü yatarak, yahut oturduğu halde, yahut da ayakta dua eder bize; o zararı ondan giderdik mi sanki o zarara uğramamış da o yüzden bize dua etmemiştir, öylece dönergider. İşte aşkın hareketlerde bulunanlara, yaptıkları işler, böylece hoş görünmededir"},{"number":13,"text":"Andolsun ki sizden önce gelip geçen nice toplulukları zulmettikleri için helak ettik. Peygamberleri, onlara apaçık delillerle gelseydi gene de inanmazlardı. İşte mücrim topluluğu böyle cezalandırırız biz"},{"number":14,"text":"Onlardan sonra da bakalım nasıl hareket edeceksiniz diye yeryüzünde sizi hüküm ve kudret sahibi kıldık"},{"number":15,"text":"Onlara apaçık delilleri muhtevi olan ayetlerimiz okunduğu zaman bize kavuşmayı ummayanlar, bize bundan başka bir Kur'an getir, yahut da değiştir onu dediler. De ki: Ben onu kendiliğimden değiştiremem, ben, ancak bana vahyedilene uyarım ve şüphe yok ki ben, isyan ettiğim takdirde o pek büyük günün azabından korkarım"},{"number":16,"text":"De ki: Allah isteseydi okumazdım onu size ve o da, onda ne olduğunu bildirmez, anlatmazdı size. O inmeden önce de aranızda ömür sürmüştüm, hala mı aklınızı başınıza almıyorsunuz"},{"number":17,"text":"Yalan yere Allah'a iftira edenden, yahut onun ayetlerini inkar edenden daha zalim kimdir ki? Şüphe yok ki suçlular, asla kurtulmazlar, muratlarına ermezler"},{"number":18,"text":"Ve Allah'ı bırakırlar da kendilerine ne bir zarar edebilecek, ne bir fayda verebilecek şeylere taparlar ve bunlar derler, Allah katında şefaatçilerimiz bizim. De ki: Allah'a, göklerde ve yeryüzünde bilmediği birşeyi mi haber vermedesiniz? O, müşriklerin şirk koştukları şeylerden tamamıyla münezzehtir ve çok yücedir"},{"number":19,"text":"İnsanlar, ancak tek bir ümmetti, sonradan ayrılıklara düştüler. Rabbinin ezeli takdiri olmasaydı ayrılıklara düştükleri şeyler hakkında çoktan aralarında bir hüküm verilirdi, mücrimler, çoktan helak olup giderdi"},{"number":20,"text":"Ve derler ki: Ona Rabbinden bir mucize indirilse ya. De ki: Gaip, ancak ve ancak Allah katında, hemen bekleyin siz ve şüphe yok ki ben de sizinle beraber beklemekteyim"},{"number":21,"text":"Uğradıkları sıkıntıdan sonra insanlara bir rahmet tattırdık mı bir de bakarsın ki çabucak ayetlerimizle alaya girişirler. De ki: Allah'ın cezası daha çabuk gelip çatar. Şüphesiz ki elçilerimiz de sizin düzenlerinizi, alaylarınızı yazmada"},{"number":22,"text":"Öyle bir mabuttur ki sizi karada ve denizde gezdirir. Hatta gemide bulunduğunuz ve güzel, temiz bir yel, gemileri sürüp akıttığı ve içindekiler ferahlayıp sevindiği sırada birden şiddetli bir fırtınadır kopar, denizin her yanından dalgalar köpürüp saldırır, gemidekiler, çepçevre o dalgalarla kuşatılmış sanırlar kendilerini. İhlasla Allah'a dua ederler, bizi bundan kurtarırsan şükredenlerden olacağız derler"},{"number":23,"text":"Onları kurtarınca da görürsün ki gene yeryüzünde haksız yere azgınlığa girişmişler. Ey insanlar, azgınlığınız, ancak kendinize, dünya menfaatlerinin sonucudur bu, sonra dönüp geleceğiniz yer, bizim tapımızdır ve biz, neler yaptıysanız hepsini haber vereceğiz size"},{"number":24,"text":"Dünya yaşayışı, gökten yağdırdığımız yağmura benzer ancak; insanların ve hayvanların yiyecekleri nebatların bünyelerine girer, karışır onlara, yeşertir, yetiştirir onları ve sonucu, yeryüzü güzelleşip bezenince ve tarlaların, bağların sahipleri, kendilerini, onlardan faydalanmaya güçleri yeter sanınca bir gece, yahut gündüz, apansızın emrimiz gelip çatar, her şeyi öylesine kökünden kesip biçer, kurutup gider ki sanki dün, hiçbiri yokmuş. İşte biz, düşünce sahibi olan topluluğa delillerimizi böyle açıklar, böyle bildiririz"},{"number":25,"text":"Ve Allah, esenlik yurduna çağırmadadır ve dilediğini doğru yola sevketmededir"},{"number":26,"text":"İyilik edenleri iyilikle mükafatlandırırız, daha da fazlasını veririz ve yüzleri kararmaz, zillete düşmez onlar. Onlardır cennet ehli, orada ebedi kalırlar"},{"number":27,"text":"Kötülük kazananların cezasıysa yapılan kötülüğe karşılık onun kadar bir suçtur ve kötülükte bulunanlar zillete düşerler; onları Allah'tan kurtaracak hiç kimse yoktur; yüzleri, kapkaranlık gecenin bir parçasına bürünmüştür sanki. Onlardır cehennem ehli, orada ebedi kalırlar"},{"number":28,"text":"O gün hepsini toplayacağız, sonra da şirk koşanlara siz de diyeceğiz, yerinizde durun, şirk koştuğunuz şeyler de yerlerinde dursun; aralarını tamamıyla ayırmışızdır ve şirk koştukları şeyler, siz zaten bize tapmıyordunuz ki demişlerdir"},{"number":29,"text":"Şüphe yok, bizimle sizin aranızda Allah tanıktır ki sizin kulluğunuzdan haberimiz bile yoktu"},{"number":30,"text":"Herkes, evvelce yaptığını bulur, cezasını çeker orada ve hepsi de gerçek mevlalarının tapısına döndürülmüştür ve iftira ettikleri şeyler de gözlerinden kaybolmuş, helak olup gitmiştir"},{"number":31,"text":"De ki: Size gökten, yerden rızık veren kimdir, kulaklarla gözlere malik olan kim ve ölüden diriyi izhar eden, diriden ölüyü meydana getiren kim ve işleri tedbir eden kim? Diyecekler ki Allah. O vakit de ki: Neden çekinmezsiniz öyleyse"},{"number":32,"text":"İşte gerçek Rabbiniz Allah, budur, gerçekten sonra sapıklıktan başka ne kalır ki? Artık nereye dönmedesiniz"},{"number":33,"text":"Buyruktan çıkanlar, Rabbinin şu sözünü haketmişlerdir: Onlar, inanmazlar"},{"number":34,"text":"De ki: Ona eş saydıklarınızın içinde halkı önce yaratıp sonra öldüren, sonra da yeniden hayata getiren var mı? De ki: Allah, her şeyi ve herkesi yaratır, öldürür de sonra gene hayata getirir artık nasıl oluyor da gerçeği bırakıp batıla dönersiniz"},{"number":35,"text":"De ki: Ona eş saydıklarınız içinde hangisi halkı gerçeğe sevkedip yol gösterir? De ki: Allah, gerçek yola sevk eder, doğru yolu gösterir. Halkı gerçeğe sevk eden mi uyulmaya daha layıktır, doğru yola sevkedilmedikçe o yolu bulamayan mı? Nasıl hükmediyorsunuz"},{"number":36,"text":"Onların çoğu, ancak zanna kapılmışlardır. Şüphe yok ki zan, gerçek karşısında hiçbir şeye yaramaz. Şüphe yok ki Allah, onlar ne yapıyorlarsa hepsini bilir"},{"number":37,"text":"Bu Kur'an, Allah'tan başkasına izafe edilemez, ancak önceki kitapları gerçeklemede, onlardaki şeyleri açıklayıp ayanbeyan bildirmededir, hiçbir şüphe yoktur ki o, alemlerin Rabbi Allah tarafından indirilmiştir"},{"number":38,"text":"Yoksa onu Peygamber uydurdu mu diyorlar? De ki: Eğer öyle diyorsanız ve gerçekseniz Allah'tan başka gücünüz yettiği kim varsa yardıma çağırın da hep beraber onun bir suresine benzer bir sure meydana getirin"},{"number":39,"text":"Hayır, onlar bilgileriyle kavrayamadıkları ve henüz zuhur etmeyen vaitleri yalanladılar. Tıpkı bunun gibi evvelce gelip geçen ümmetler de peygamberlerini yalanlamışlardı. Bak da gör, zulmedenlerin sonları neye varmış, nice olmuş"},{"number":40,"text":"Onlardan inanan da var, inanmayan da ve Rabbin bozguncuları daha iyi bilir"},{"number":41,"text":"Seni yalanlarlarsa sen de de ki: Benim yaptığım iş bana ait, sizin yaptıklarınız size. Siz, benim yaptığımdan uzaksınız, ben de sizin yaptıklarınızdan uzağım"},{"number":42,"text":"İçlerinde seni dinleyen de var, fakat sen, üstelik bir de akılları olmayan sağırlara söz duyurabilir misin hiç"},{"number":43,"text":"Onlardan sana bakan da var, fakat sen, üstelik bir de kör olanlara doğru yolu gösterebilir misin hiç"},{"number":44,"text":"Şüphe yok ki Allah, insanlara hiçbir suretle zulmetmez, fakat insanlar, kendi kendilerine zulmederler"},{"number":45,"text":"O gün onları tapısında öyle bir toplar ki kendilerini, dünyada sanki bir günün bir saati kadar eğlenmişler sanırlar. Aralarında tanışırlar, birbirlerini tanırlar. Allah'a kavuşacaklarını inkar edenler, şüphe yok ki zarara uğrarlar ve doğru yolu da bulamazlar"},{"number":46,"text":"Onlara vaadettiğimiz azabın bir kısmını sana göstersek de onların dönüp gelecekleri yer, bizim tapımızdır, seni öldürsek ve sana göstermesek de; sonra da Allah, yaptıklarına tanıktır onların"},{"number":47,"text":"Her ümmetin bir peygamberi var. Peygamberleri geldi mi aralarında adaletle hükmedilir ve onlara zulmedilmez"},{"number":48,"text":"Ve derler ki: Gerçekseniz bu vait ne zaman yerine gelecek"},{"number":49,"text":"De ki: Allah dilemedikçe kendimden bile bir zararı gidermeye, bir hayrı elde etmeye gücüm yetmez. Her ümmetin mukadder bir zamanı var. Mukadder zamanları geldi mi ne bir an geri kalırlar, ne bir an önce helak olurlar"},{"number":50,"text":"De ki: Azabı geceleyin, yahut gündüzün birdenbire gelip çatarsa ne yaparsınız, söyleyin bakalım. Suçlular, azabın çabucak gelmesini ne diye isterler ki"},{"number":51,"text":"Ona, azap gelip çattıktan sonra mı iman edeceksiniz, halbuki böyle bir şeyin olmayacağını sanıp alay ederek çabucak gelmesini istiyordunuz hani"},{"number":52,"text":"Sonra da zulmedenlere, tadın ebedi azabı denecek, kazandığınızın karşılığı neyse ondan başka bir şeyle mi cezaya uğrayacaktınız"},{"number":53,"text":"O gerçek mi diye soruyorlar senden; de ki: Evet, andolsun Rabbime ki gerçektir ve siz de ondan kurtulmayacaksınız"},{"number":54,"text":"Zulmeden kişi, yeryüzünde ne varsa hepsine sahip olsaydı kurtulmak için hepsini de bağışlardı. Azabı görünce nadim olurlar ve aralarında adaletle hükmedilir. Zulüm görmez onlar"},{"number":55,"text":"Bilin ki hiç şüphe yok, göklerde ve yeryüzünde ne varsa Allah'ındır. Bilin ki Allah'ın vaadi, hiç şüphe yok gerçektir, fakat çokları bilmez"},{"number":56,"text":"Odur dirilten ve öldüren ve hepiniz de dönüp onun tapısına varacaksınız"},{"number":57,"text":"Ey insanlar, Rabbinizden size bir öğüt, gönüllerdeki dertlere şifa, inananlara hidayet ve rahmet geldi"},{"number":58,"text":"De ki: Allah'ın ihsanıyla, rahmetiyle, yalnız bunlarla ferahlanıp sevinsinler. Bu, onların derleyip topladıklarından daha hayırlıdır"},{"number":59,"text":"De ki: Allah'ın, size verdiği rızıklardan bir kısmını haram, bir kısmını helal saymanıza ne dersiniz? De ki: Allah mı izin verdi size, yoksa Allah'a iftira mı ediyorsunuz"},{"number":60,"text":"Allah'a yalan yere iftirada bulunanların kıyamet günü hakkındaki zanları nedir? Şüphe yok ki Allah, insanlara lütuf ve ihsanda bulunmadadır ama çokları şükretmez"},{"number":61,"text":"Hiçbir işe girişmezsin, onun vahyettiği Kur'an'dan hiçbir ayet okumazsın ve siz hiçbir iş işlemezsiniz ki o işe koyulduğunuz zaman biz, sizi görmeyelim, tanık olmayalım ve yeryüzünde ve gökte zerre miktarı bir şey bile yoktur ki Rabbinden gizli kalsın; bundan daha da küçük, daha da büyük hiçbir şey yoktur ki apaçık kitapta tespit edilmiş olmasın"},{"number":62,"text":"Bilin, haberdar olun ki şüphe yok Allah dostlarına ne korku vardır, ne de mahzun olur onlar"},{"number":63,"text":"Onlar öyle kişilerdir ki inanmışlardır ve çekinir onlar"},{"number":64,"text":"Onlara müjde var dünya yaşayışında da, ahirette de. Allah'ın sözlerinin değişmesine imkan yok. Budur en büyük kurtuluş ve saadet"},{"number":65,"text":"Onların sözü mahzun etmesin seni. Şüphe yok ki üstünlük, yücelik Allah'ındır. Odur duyan, bilen"},{"number":66,"text":"Bilin, haberdar olun ki Allah'ındır ne varsa göklerde ve ne varsa yeryüzünde ve ondan başka ona eş saydıkları şeylere tapanlar, onlara uymuyorlar, ancak kuru bir zanna uyuyorlar ve ancak yalan söylüyorlar"},{"number":67,"text":"Öyle bir mabuttur ki geceyi dinlenmeniz için yaratmış, gündüzü de ışıklı halketmiştir. Şüphe yok ki bunda, duyan topluluğa deliller var"},{"number":68,"text":"Allah, kendisine evlat edinmiştir dediler, münezzehtir o, müstağnidir. Onundur ne varsa göklerde ve yeryüzünde: Şu iddianıza dair bir deliliniz var mı? Allah hakkında bilmediğiniz birşeyi mi söylüyorsunuz"},{"number":69,"text":"De ki: Allah'a yalan isnat edip iftira edenler kurtulmazlar, muratlarına ermezler"},{"number":70,"text":"Dünyada değersiz menfaatler elde ettikten sonra dönüp tapımıza gelirler, sonra da kafir oldukları, inkar ettikleri şeyler yüzünden biz, onlara şiddetli bir azap tattırırız"},{"number":71,"text":"Oku onlara Nuh kıssasını. Hani kavmine, ey kavmim demişti, aranızda bulunmam ve Allah'ın ayetleriyle öğüt vermem ağır geliyorsa size, ben Allah'a dayanmışım, siz de, ortaklarınız da toplanın, ne yapacağınızı kararlaştırın, sonradan da yaptığınız şey, sizi kederlendirmesin, sonra kararınızı bildirin bana ve hiç mühlet de vermeyin"},{"number":72,"text":"Yüz çevirirseniz zaten sizden bir mükafat istemem, benim mükafatım, ancak Allah'a ait ve Müslümanlardan olmam emredildi bana"},{"number":73,"text":"Derken onu yalanladılar da onu ve onunla beraber gemide bulunanları kurtardık ve onları hükümdar ettik ve delillerimizi yalanlayanları sulara boğduk, bak da gör, korkutulanların sonları ne oldu"},{"number":74,"text":"Ondan sonra da insan topluluklarına peygamberler gönderdik, apaçık delillerle geldikleri halde önceden yalanladıkları şeylere bir türlü inanmadılar. İşte biz, haddini aşanların gönüllerini böyle mühürleriz"},{"number":75,"text":"Onlardan sonra da Musa ve Harun'u, delillerimizle Firavun'a ve ona uyan ileri gelenlere gönderdik, fakat ona uymayı kibirlerine yediremediler ve zaten de mücrim bir topluluktu onlar"},{"number":76,"text":"Gerçek olan şey, katımızdan onlara gelince bu dediler, şüphe yok ki apaçık bir büyü"},{"number":77,"text":"Musa, size gerçek, gelince böyle mi dersiniz dedi, büyü mü bu? Ve büyücüler, kurtulmazlar, muratlarına erişmez onlar"},{"number":78,"text":"Bizi atalarımızdan bulup gördüğümüz şeylerden çevirip yeryüzünde bize hakim olmak için mi geldiniz ve biz, ikinize de inanmıyoruz dediler"},{"number":79,"text":"Ve Firavun, ne kadar bilgin büyücü varsa dedi, hepsini çağırın huzuruma"},{"number":80,"text":"Büyücüler gelince Musa, ne atacaksanız atın bakalım dedi"},{"number":81,"text":"Onlar atınca Musa, bu yaptığınız büyüdür dedi, ve şüphe yok ki Allah, onu bozacak, boşa çıkaracak, şüphe yok ki Allah, bozguncuların işlerini düzene sokmaz"},{"number":82,"text":"Suçluların zoruna gitse de Allah, sözleriyle gerçeğin gerçek olduğunu izhar eder"},{"number":83,"text":"Firavun'un, kendilerini bir musibete uğratmasından korktukları için Musa'ya, kavminden bir soy inandı ancak, başkaları inanmadı ve gerçekten de Firavun, yeryüzünde pek yüceydi ve gerçekten o, buyruktan çıkmış kişilerdendi"},{"number":84,"text":"Musa, ey kavmim dedi, Allah'a inandıysanız ve ona teslim olduysanız güvenin, dayanın ona"},{"number":85,"text":"Dediler ki: Dayandık, Rabbimiz, sen bizi zalim toplulukla sınama"},{"number":86,"text":"Ve bizi, rahmetinle kurtar kafirler topluluğundan"},{"number":87,"text":"Ve Musa'ya ve kardeşine, kavminize Mısır'da barınacak evler kurun, evlerinizi kıble yapın ve namaz kılın ve müjdele inananları diye vahyettik"},{"number":88,"text":"Ve Musa, Rabbimiz dedi, sen Firavun'a ve ona uyanlardan ileri gelenlere gerçekten de dünya yaşayışına ait ziynetler ve mallar verdin. Rabbimiz, onlar bu yüzden halkı doğru yoldan çıkarmada, saptırmadalar. Rabbimiz, mallarını mahvet, yurtlarında kendi sefaletlerini göster onlara da yüreklerini sık, çünkü onlar, o elemli azabı görünceye dek inanmayacaklar"},{"number":89,"text":"Tanrı, ikinizin de duası kabul edilmiştir dedi, artık doğru hareket etmekte devam edin ve sakın ha bilmezlerin yoluna gitmeyin"},{"number":90,"text":"İsrailoğullarını denizden geçirdik, derken Firavun'la askeri de azgınlıkla, düşmanlıkla peşlerine düştü onların, sonucu su boğazına girince boğulurken inandım, gerçekten de İsrailoğullarının inandığı Tanrıdan başka tapacak yok ve ben Müslümanlardanım dedi"},{"number":91,"text":"Fakat şimdi mi? Halbuki bundan evvel isyan etmiştin, bozgunculardan olmuştun"},{"number":92,"text":"O halde bugün biz de, senden sonra gelenlere ibret olasın diye yalnız cesedini kurtaracağız ve şüphe yok ki insanların çoğu, bizim delillerimizden gaflettedir"},{"number":93,"text":"Andolsun ki biz İsrailoğullarını güzel bir yere yerleştirdik ve onları, tertemiz şeylerle rızıklandırdık. Kendilerine bilgi gelinceye dek de ayrılığa düşmediler. Şüphe yok ki Rabbin, ayrılığa düştükleri şeyler hakkında kıyamet günü, aralarında hükmedecek"},{"number":94,"text":"Sana indirdiğimiz şeyde şüpheye düşersen (imkan yok ya), senden önce kitap okuyanlara sor. Andolsun ki gerçek, Rabbinden gelmiştir sana, artık şüphelenenlerden olma"},{"number":95,"text":"Ve Allah'ın delillerini yalanlayanlardan olma sakın, yoksa ziyankarlara katılırsın"},{"number":96,"text":"Öyle kişilerdir onlar ki Rabinin, onlara söylediği sözü haketmiştir onlar, inanmaz onlar"},{"number":97,"text":"Kendilerine her çeşit deliller, mucizeler gösterilse de elemli azabı görmedikçe"},{"number":98,"text":"İnanıp da inançlarından fayda gören şehir halkı, ancak Yunus'un kavmidir. İnandıkları zaman, dünya yaşayışında onlardan zillet azabını giderdik ve bir zamanadek faydalandırdık onları"},{"number":99,"text":"Rabbin dileseydi yeryüzünde bulunanların hepsi de inanırdı. Artık inansınlar diye insanları zorlayıp duracak mısın"},{"number":100,"text":"Allah'ın izni olmadıkça hiç kimse inanamaz. Düşünüp akıl etmeyenlere de azap eder"},{"number":101,"text":"De ki: Bir bakın da görün, neler var göklerde ve yeryüzünde. Fakat bunca deliller, bunca korkutan peygamberler, inanmayan topluluğa ne fayda eder"},{"number":102,"text":"Onlar, kendilerinden önce gelip geçenlerin uğradıkları felaket günlerine benzer günlerden başka bir şey mi bekliyorlar? De ki: Bekleyin bakalım, şüphe yok ki ben de sizinle beraber bekleyenlerdenim"},{"number":103,"text":"Sonra peygamberlerimizi ve inananları böylece kurtarırız biz ve inananları kurtarmak, bir haktır bize"},{"number":104,"text":"De ki: Ey insanlar, dinimde bir şüpheniz varsa bilin ki ben, Allah'ı bırakıp taptıklarınıza tapamam ve ancak sizi öldüren Allah'a kulluk ederim ve inananlardan olmam emredildi bana"},{"number":105,"text":"Ve doğru dine yüz çevir, sakın müşriklerden olma dendi bana"},{"number":106,"text":"Ve Allah'ı bırakıp da sana ne bir faydası dokunan, ne bir zarar veren şeylere tapma, bunu yaparsan şüphe yok ki zalimlerden olursun dendi"},{"number":107,"text":"Allah, sana bir zarar verirse o zararı, ondan başka giderecek yoktur ve hayır etmek dilerse de ihsanını reddeden bulunmaz; bunu, kullarından dilediğine verir ve odur suçları örten rahim"},{"number":108,"text":"De ki: Ey insanlar, gerçekten de Rabbinizden hak ve hakikat gelmiştir size. Artık kim doğru yola giderse faydası kendisinedir ve kim saparsa zararı kendine ve ben, sizi koruyucu değilim"},{"number":109,"text":"Sana ne vahyedilirse ona uy ve Allah hükmedinceye dek sabret ve odur hükmedenlerin en hayırlısı"}]}