{"number":55,"edition":"ur.junagarhi","ayahs":[{"number":1,"text":"رحمٰن نے"},{"number":2,"text":"قرآن سکھایا"},{"number":3,"text":"اسی نے انسان کو پیدا کیا"},{"number":4,"text":"اور اسے بولنا سکھایا"},{"number":5,"text":"آفتاب اور ماہتاب (مقرره) حساب سے ہیں"},{"number":6,"text":"اور ستارے اور درخت دونوں سجده کرتے ہیں"},{"number":7,"text":"اسی نے آسمان کو بلند کیا اور اسی نے ترازو رکھی"},{"number":8,"text":"تاکہ تم تولنے میں تجاوز نہ کرو"},{"number":9,"text":"انصاف کے ساتھ وزن کو ٹھیک رکھو اور تول میں کم نہ دو"},{"number":10,"text":"اور اسی نے مخلوق کے لیے زمین بچھا دی"},{"number":11,"text":"جس میں میوے ہیں اور خوشے والے کھجور کے درخت ہیں"},{"number":12,"text":"اور بھس واﻻ اناج ہے۔ اور خوشبودار پھول ہیں"},{"number":13,"text":"پس (اے انسانو اور جنو!) تم اپنے پروردگار کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":14,"text":"اس نےانسان کو بجنے والی مٹی سے پیدا کیا جو ٹھیکری کی طرح تھی"},{"number":15,"text":"اور جنات کو آگ کے شعلے سے پیدا کیا"},{"number":16,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":17,"text":"وه رب ہے دونوں مشرقوں اور دونوں مغربوں کا"},{"number":18,"text":"تو (اے جنو اورانسانو!) تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":19,"text":"اس نے دو دریا جاری کر دیے جو ایک دوسرے سے مل جاتے ہیں"},{"number":20,"text":"ان دونوں میں ایک آڑ ہے کہ اس سے بڑھ نہیں سکتے"},{"number":21,"text":"پس اپنے پروردگار کی کون کون سی نعمت کو جھٹلاؤ گے؟"},{"number":22,"text":"ان دونوں میں سے موتی اور مونگے برآمد ہوتے ہیں"},{"number":23,"text":"پھر تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":24,"text":"اور اللہ ہی کی (ملکیت میں) ہیں وه جہاز جو سمندروں میں پہاڑ کی طرح بلند (چل پھر رہے) ہیں"},{"number":25,"text":"پس (اے انسانو اور جنو!) تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":26,"text":"زمین پر جو ہیں سب فنا ہونے والے ہیں"},{"number":27,"text":"صرف تیرے رب کی ذات جو عظمت اور عزت والی ہے باقی ره جائے گی"},{"number":28,"text":"پھرتم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":29,"text":"سب آسمان وزمین والے اسی سے مانگتے ہیں۔ ہر روز وه ایک شان میں ہے"},{"number":30,"text":"پھر تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":31,"text":"(جنوں اور انسانوں کے گروہو!) عنقریب ہم تمہاری طرف پوری طرح متوجہ ہو جائیں گے"},{"number":32,"text":"پھر تم اپنے رب کی کس کس نعمت کو جھٹلاؤگے؟"},{"number":33,"text":"اے گروه جنات و انسان! اگر تم میں آسمانوں اور زمین کے کناروں سے باہر نکل جانے کی طاقت ہے تو نکل بھاگو! بغیر غلبہ اور طاقت کے تم نہیں نکل سکتے"},{"number":34,"text":"پھر تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":35,"text":"تم پر آگ کے شعلے اور دھواں چھوڑا جائے گا پھر تم مقابلہ نہ کر سکو گے"},{"number":36,"text":"پھر اپنے رب کی نعمتوں میں سے کس کس نعمت کو جھٹلاؤ گے؟"},{"number":37,"text":"پس جب کہ آسمان پھٹ کر سرخ ہو جائے جیسے کہ سرخ چمڑه"},{"number":38,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":39,"text":"اس دن کسی انسان اورکسی جن سے اس کے گناہوں کی پرسش نہ کی جائے گی"},{"number":40,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":41,"text":"گناه گار صرف حلیہ ہی سے پہچان لیے جائیں گے اور ان کی پیشانیوں کے بال اور قدم پکڑ لیے جائیں گے"},{"number":42,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":43,"text":"یہ ہے وه جہنم جسے مجرم جھوٹا جانتے تھے"},{"number":44,"text":"اس کے اور کھولتے ہوئے گرم پانی کے درمیان چکر کھائیں گے"},{"number":45,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":46,"text":"اور اس شخص کے لیے جو اپنے رب کے سامنے کھڑا ہونے سے ڈرا دو جنتیں ہیں"},{"number":47,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":48,"text":"(دونوں جنتیں) بہت سی ٹہنیوں اور شاخوں والی ہیں"},{"number":49,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":50,"text":"ان دونوں (جنتوں) میں دو بہتے ہوئے چشمے ہیں"},{"number":51,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":52,"text":"ان دونوں جنتوں میں ہر قسم کے میوؤں کی دو قسمیں ہوگی"},{"number":53,"text":"پھر تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":54,"text":"جنتی ایسے فرشوں پر تکیہ لگائے ہوئے ہوں گے جن کے استر دبیز ریشم کے ہوں گے، اور ان دونوں جنتوں کے میوے بالکل قریب ہوں گے"},{"number":55,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":56,"text":"وہاں (شرمیلی) نیچی نگاه والی حوریں ہیں جنہیں ان سے پہلے کسی جن وانس نے ہاتھ نہیں لگایا"},{"number":57,"text":"پس اپنے پالنے والے کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":58,"text":"وه حوریں مثل یاقوت اور مونگے کے ہوں گی"},{"number":59,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":60,"text":"احسان کا بدلہ احسان کے سوا کیا ہے"},{"number":61,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":62,"text":"اور ان کے سوا دو جنتیں اور ہیں"},{"number":63,"text":"پس تم اپنے پرورش کرنے والے کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":64,"text":"جو دونوں گہری سبز سیاہی مائل ہیں"},{"number":65,"text":"بتاؤ اب اپنے پروردگار کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":66,"text":"ان میں دو (جوش سے) ابلنے والے چشمے ہیں"},{"number":67,"text":"پھر تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":68,"text":"ان دونوں میں میوے اور کھجور اور انار ہوں گے"},{"number":69,"text":"کیا اب بھی رب کی کسی نعمت کی تکذیب تم کرو گے؟"},{"number":70,"text":"ان میں نیک سیرت خوبصورت عورتیں ہیں"},{"number":71,"text":"پس تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":72,"text":"(گوری رنگت کی) حوریں جنتی خیموں میں رہنے والیاں ہیں"},{"number":73,"text":"پس (اے انسانو اور جنو!) تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":74,"text":"ان کو ہاتھ نہیں لگایا کسی انسان یا جن نے اس سے قبل"},{"number":75,"text":"پس اپنے پروردگار کی کون کون سی نعمت کے ساتھ تم تکذیب کرتے ہو؟"},{"number":76,"text":"سبز مسندوں اور عمده فرشوں پر تکیہ لگائے ہوئے ہوں گے"},{"number":77,"text":"پس (اے جنو اور انسانو!) تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"},{"number":78,"text":"تیرے پروردگار کا نام بابرکت ہے جو عزت وجلال واﻻ ہے"}]}