{"number":75,"edition":"sq.ahmeti","ayahs":[{"number":1,"text":"Betohem në ditën e kijametit"},{"number":2,"text":"Betohem në shpirtin që është shumë qortues"},{"number":3,"text":"A mendon njeriu se nuk do t’i tubojmë eshtrat e tij"},{"number":4,"text":"Po, do t’ia tubojmë! Duke qenë se Ne jemi të zotët t’ia rikrijojmë si kanë qenë edhe majat e gishtave të tij"},{"number":5,"text":"Por, njeriu dëshiron të vazhdojë edhe mëtej në mëkate"},{"number":6,"text":"Andaj edhe pyet: “Kur është dita e kijametit?”"},{"number":7,"text":"E, kur të merren sytë (të parët)"},{"number":8,"text":"E të zëhet hëna (errësohet)"},{"number":9,"text":"Dhe të bashkohet dielli e hëna"},{"number":10,"text":"Atë ditë njeriu do të thotë: “Nga të iket!”"},{"number":11,"text":"Jo, nuk ka strehim"},{"number":12,"text":"Atë ditë vetëm te Zoti yt është caku"},{"number":13,"text":"Atë ditë njeriu do të njihet me atë që çoi para dhe me atë që la prapa"},{"number":14,"text":"Po njeriu është dëshmitar i vetvetes"},{"number":15,"text":"Edhe nëse i paraqet arsyetimet e veta"},{"number":16,"text":"Ti (Muhammed) mos shqipto atë (Kur’anin) me gjuhën tënde për ta nxënë atë me të shpejtë"},{"number":17,"text":"Sepse Ne e kemi për detyrë tubimin dhe leximin e tij"},{"number":18,"text":"E kur ta lexojnë atë ty, ti përcille me të dëgjuar leximin e tij"},{"number":19,"text":"Dhe pastaj është obligim i yni që ta shkoqisim atë"},{"number":20,"text":"Jo, nuk është ashtu! Por ju jeni që e doni të ngutshmen (dynjanë)"},{"number":21,"text":"Dhe e lini pas shpine atë të ardhmen (ahiretin)"},{"number":22,"text":"Atë ditë do të ketë fytyra të shkëlqyera (të gëzuara)"},{"number":23,"text":"Që Zotin e tyre e shikojnë"},{"number":24,"text":"Atë ditë ka fytyra edhe të vrazhda"},{"number":25,"text":"Që presin t’u thyhet kurrizi (të shkatërrohen)"},{"number":26,"text":"Jo dhe Jo! Po kur të arrijë (shpirti) në gropë të fytit (të gjoksit)"},{"number":27,"text":"Dhe thuhet (nga familja e të afërmit): “Kush do ta shërojë?”"},{"number":28,"text":"Dhe ai bindet se ai po ndahet"},{"number":29,"text":"E t’i puqet kofsha për kofshe (t’i vështirësohet gjendja)"},{"number":30,"text":"Atë ditë vetëm te Zoti yt shkohet"},{"number":31,"text":"E ai as nuk vërtetoi atë që duhej, as nuk u falë"},{"number":32,"text":"Por përgënjeshtroi dhe ktheu shpinën"},{"number":33,"text":"Dhe shkonte te familja e tij me fodullëk"},{"number":34,"text":"Të është afruar ty e keqja e t’u afroftë! (ose i mjeri ti i mjeri)"},{"number":35,"text":"Edhe nje herë t’u afrua ty e keqja; t’u afroftë"},{"number":36,"text":"A mos mendon njeriu se do të lihet duke mos zënë asgjë (pa kurrfarë përgjegjësie)"},{"number":37,"text":"A nuk ka qenë ai në një pikë ujë që derdhet"},{"number":38,"text":"E pastaj u bë gjak i trashë, e Ai e krijoi dhe e përsosi"},{"number":39,"text":"Dhe prej tij Ai i bëri dy lloje: mashkullin dhe femrën"},{"number":40,"text":"A nuk është Ai (Zot) i fuqishëm që i ngjall të vdekurit"}]}