{"number":89,"edition":"sq.ahmeti","ayahs":[{"number":1,"text":"Pasha agimin"},{"number":2,"text":"Pasha dhjetë netët"},{"number":3,"text":"Pasha çiftin dhe pasha tekun"},{"number":4,"text":"Pasha natën që shkon"},{"number":5,"text":"A janë këto betime për të mençurin"},{"number":6,"text":"A nuk e i ti se ç’bëri Zoti yt me Ad-in"},{"number":7,"text":"Me banorët e Iremit me ndërtesa të larta"},{"number":8,"text":"Që si ata (populli Ad) nuk është krijuar askush në tokë"},{"number":9,"text":"Dhe me Themudin, të cilët shpuan shkëmbinj në luginën (kura)"},{"number":10,"text":"Dhe me faraonin i fortifikuar me tenda (ushtarake)"},{"number":11,"text":"Të cilët e tepruan me krime në tokë"},{"number":12,"text":"Dhe në të shtuan shkatërrimin"},{"number":13,"text":"E All-llahu kundër tyre lëshoi lloj-lloj dënimesh"},{"number":14,"text":"Pse Zoti yt është që përcjell (u rri në pritë)"},{"number":15,"text":"E njeriu, kur e sprovon Zoti i tij, e nderon dhe e begaton, ai thotë: “Zoti im më ka nderuar!”"},{"number":16,"text":"Por, kur për ta sprovuar ia pakëson furnizimin (e varfëron), ai thotë: “Zoti im më ka nënçmuar!”"},{"number":17,"text":"Jo, nuk është ashtu! Por (punoni edhe më zi) ju nuk përfillnit bonjakun"},{"number":18,"text":"Nuk cytni njëri-tjetrin për ta ushqyer të varfërin"},{"number":19,"text":"Dhe ju e hani me të madhe trashëgimin (padrejtë)"},{"number":20,"text":"Dhe pasurinë e doni së tepërmi"},{"number":21,"text":"Jo, mosni ashtu! Kur të dridhet toka njëpasnjëshëm"},{"number":22,"text":"Dhe kur të vijë Zoti yt dhe engjëjt qëndrojnë rradhë-rradhë"},{"number":23,"text":"Dhe atë ditë sillet Xhehennemi, ditën kur përkujtohet njeriu, e ç’dobi i bën atij përkujtimi"},{"number":24,"text":"Thotë: “O, i gjori unë, sikur të isha i parapërgatitur për jetën time!”"},{"number":25,"text":"Pra, ditën kur nuk dënon si Ai askush"},{"number":26,"text":"Dhe nuk do të farkojë pranga si Ai askush"},{"number":27,"text":"O shpirt i qetësuar"},{"number":28,"text":"Kthehu te Zoti yt i kënaqur (për vehte) e kënaqës (për Zotin)"},{"number":29,"text":"Hyr mes robërve të Mi"},{"number":30,"text":"Dhe hyr në Xhennetin Tim"}]}