{"number":23,"edition":"en.yusufali","ayahs":[{"number":1,"text":"The believers must (eventually) win through"},{"number":2,"text":"Those who humble themselves in their prayers"},{"number":3,"text":"Who avoid vain talk"},{"number":4,"text":"Who are active in deeds of charity"},{"number":5,"text":"Who abstain from sex"},{"number":6,"text":"Except with those joined to them in the marriage bond, or (the captives) whom their right hands possess,- for (in their case) they are free from blame"},{"number":7,"text":"But those whose desires exceed those limits are transgressors"},{"number":8,"text":"Those who faithfully observe their trusts and their covenants"},{"number":9,"text":"And who (strictly) guard their prayers"},{"number":10,"text":"These will be the heirs"},{"number":11,"text":"Who will inherit Paradise: they will dwell therein (for ever)"},{"number":12,"text":"Man We did create from a quintessence (of clay)"},{"number":13,"text":"Then We placed him as (a drop of) sperm in a place of rest, firmly fixed"},{"number":14,"text":"Then We made the sperm into a clot of congealed blood; then of that clot We made a (foetus) lump; then we made out of that lump bones and clothed the bones with flesh; then we developed out of it another creature. So blessed be Allah, the best to create"},{"number":15,"text":"After that, at length ye will die"},{"number":16,"text":"Again, on the Day of Judgment, will ye be raised up"},{"number":17,"text":"And We have made, above you, seven tracts; and We are never unmindful of (our) Creation"},{"number":18,"text":"And We send down water from the sky according to (due) measure, and We cause it to soak in the soil; and We certainly are able to drain it off (with ease)"},{"number":19,"text":"With it We grow for you gardens of date-palms and vines: in them have ye abundant fruits: and of them ye eat (and have enjoyment)"},{"number":20,"text":"Also a tree springing out of Mount Sinai, which produces oil, and relish for those who use it for food"},{"number":21,"text":"And in cattle (too) ye have an instructive example: from within their bodies We produce (milk) for you to drink; there are, in them, (besides), numerous (other) benefits for you; and of their (meat) ye eat"},{"number":22,"text":"And on them, as well as in ships, ye ride"},{"number":23,"text":"(Further, We sent a long line of prophets for your instruction). We sent Noah to his people: He said, \"O my people! worship Allah! Ye have no other god but Him. Will ye not fear (Him)"},{"number":24,"text":"The chiefs of the Unbelievers among his people said: \"He is no more than a man like yourselves: his wish is to assert his superiority over you: if Allah had wished (to send messengers), He could have sent down angels; never did we hear such a thing (as he says), among our ancestors of old"},{"number":25,"text":"(And some said): \"He is only a man possessed: wait (and have patience) with him for a time"},{"number":26,"text":"(Noah) said: \"O my Lord! help me: for that they accuse me of falsehood"},{"number":27,"text":"So We inspired him (with this message): \"Construct the Ark within Our sight and under Our guidance: then when comes Our Command, and the fountains of the earth gush forth, take thou on board pairs of every species, male and female, and thy family- except those of them against whom the Word has already gone forth: And address Me not in favour of the wrong-doers; for they shall be drowned (in the Flood)"},{"number":28,"text":"And when thou hast embarked on the Ark - thou and those with thee,- say: \"Praise be to Allah, Who has saved us from the people who do wrong"},{"number":29,"text":"And say: \"O my Lord! enable me to disembark with thy blessing: for Thou art the Best to enable (us) to disembark"},{"number":30,"text":"Verily in this there are Signs (for men to understand); (thus) do We try (men)"},{"number":31,"text":"Then We raised after them another generation"},{"number":32,"text":"And We sent to them a messenger from among themselves, (saying), \"Worship Allah! ye have no other god but Him. Will ye not fear (Him)"},{"number":33,"text":"And the chiefs of his people, who disbelieved and denied the Meeting in the Hereafter, and on whom We had bestowed the good things of this life, said: \"He is no more than a man like yourselves: he eats of that of which ye eat, and drinks of what ye drink"},{"number":34,"text":"If ye obey a man like yourselves, behold, it is certain ye will be lost"},{"number":35,"text":"Does he promise that when ye die and become dust and bones, ye shall be brought forth (again)"},{"number":36,"text":"Far, very far is that which ye are promised"},{"number":37,"text":"There is nothing but our life in this world! We shall die and we live! But we shall never be raised up again"},{"number":38,"text":"He is only a man who invents a lie against Allah, but we are not the ones to believe in him"},{"number":39,"text":"(The prophet) said: \"O my Lord! help me: for that they accuse me of falsehood"},{"number":40,"text":"(Allah) said: \"In but a little while, they are sure to be sorry"},{"number":41,"text":"Then the Blast overtook them with justice, and We made them as rubbish of dead leaves (floating on the stream of Time)! So away with the people who do wrong"},{"number":42,"text":"Then We raised after them other generations"},{"number":43,"text":"No people can hasten their term, nor can they delay (it)"},{"number":44,"text":"Then sent We our messengers in succession: every time there came to a people their messenger, they accused him of falsehood: so We made them follow each other (in punishment): We made them as a tale (that is told): So away with a people that will not believe"},{"number":45,"text":"Then We sent Moses and his brother Aaron, with Our Signs and authority manifest"},{"number":46,"text":"To Pharaoh and his Chiefs: But these behaved insolently: they were an arrogant people"},{"number":47,"text":"They said: \"Shall we believe in two men like ourselves? And their people are subject to us"},{"number":48,"text":"So they accused them of falsehood, and they became of those who were destroyed"},{"number":49,"text":"And We gave Moses the Book, in order that they might receive guidance"},{"number":50,"text":"And We made the son of Mary and his mother as a Sign: We gave them both shelter on high ground, affording rest and security and furnished with springs"},{"number":51,"text":"O ye messengers! enjoy (all) things good and pure, and work righteousness: for I am well-acquainted with (all) that ye do"},{"number":52,"text":"And verily this Brotherhood of yours is a single Brotherhood, and I am your Lord and Cherisher: therefore fear Me (and no other)"},{"number":53,"text":"But people have cut off their affair (of unity), between them, into sects: each party rejoices in that which is with itself"},{"number":54,"text":"But leave them in their confused ignorance for a time"},{"number":55,"text":"Do they think that because We have granted them abundance of wealth and sons"},{"number":56,"text":"We would hasten them on in every good? Nay, they do not understand"},{"number":57,"text":"Verily those who live in awe for fear of their Lord"},{"number":58,"text":"Those who believe in the Signs of their Lord"},{"number":59,"text":"Those who join not (in worship) partners with their Lord"},{"number":60,"text":"And those who dispense their charity with their hearts full of fear, because they will return to their Lord"},{"number":61,"text":"It is these who hasten in every good work, and these who are foremost in them"},{"number":62,"text":"On no soul do We place a burden greater than it can bear: before Us is a record which clearly shows the truth: they will never be wronged"},{"number":63,"text":"But their hearts are in confused ignorance of this; and there are, besides that, deeds of theirs, which they will (continue) to do"},{"number":64,"text":"Until, when We seize in Punishment those of them who received the good things of this world, behold, they will groan in supplication"},{"number":65,"text":"(It will be said): \"Groan not in supplication this day: for ye shall certainly not be helped by Us"},{"number":66,"text":"My Signs used to be rehearsed to you, but ye used to turn back on your heels"},{"number":67,"text":"In arrogance: talking nonsense about the (Qur'an), like one telling fables by night"},{"number":68,"text":"Do they not ponder over the Word (of Allah), or has anything (new) come to them that did not come to their fathers of old"},{"number":69,"text":"Or do they not recognise their Messenger, that they deny him"},{"number":70,"text":"Or do they say, \"He is possessed\"? Nay, he has brought them the Truth, but most of them hate the Truth"},{"number":71,"text":"If the Truth had been in accord with their desires, truly the heavens and the earth, and all beings therein would have been in confusion and corruption! Nay, We have sent them their admonition, but they turn away from their admonition"},{"number":72,"text":"Or is it that thou askest them for some recompense? But the recompense of thy Lord is best: He is the Best of those who give sustenance"},{"number":73,"text":"But verily thou callest them to the Straight Way"},{"number":74,"text":"And verily those who believe not in the Hereafter are deviating from that Way"},{"number":75,"text":"If We had mercy on them and removed the distress which is on them, they would obstinately persist in their transgression, wandering in distraction to and fro"},{"number":76,"text":"We inflicted Punishment on them, but they humbled not themselves to their Lord, nor do they submissively entreat (Him)"},{"number":77,"text":"Until We open on them a gate leading to a severe Punishment: then Lo! they will be plunged in despair therein"},{"number":78,"text":"It is He Who has created for you (the faculties of) hearing, sight, feeling and understanding: little thanks it is ye give"},{"number":79,"text":"And He has multiplied you through the earth, and to Him shall ye be gathered back"},{"number":80,"text":"It is He Who gives life and death, and to Him (is due) the alternation of Night and Day: will ye not then understand"},{"number":81,"text":"On the contrary they say things similar to what the ancients said"},{"number":82,"text":"They say: \"What! when we die and become dust and bones, could we really be raised up again"},{"number":83,"text":"Such things have been promised to us and to our fathers before! they are nothing but tales of the ancients"},{"number":84,"text":"Say: \"To whom belong the earth and all beings therein? (say) if ye know"},{"number":85,"text":"They will say, \"To Allah!\" say: \"Yet will ye not receive admonition"},{"number":86,"text":"Say: \"Who is the Lord of the seven heavens, and the Lord of the Throne (of Glory) Supreme"},{"number":87,"text":"They will say, \"(They belong) to Allah.\" Say: \"Will ye not then be filled with awe"},{"number":88,"text":"Say: \"Who is it in whose hands is the governance of all things,- who protects (all), but is not protected (of any)? (say) if ye know"},{"number":89,"text":"They will say, \"(It belongs) to Allah.\" Say: \"Then how are ye deluded"},{"number":90,"text":"We have sent them the Truth: but they indeed practise falsehood"},{"number":91,"text":"No son did Allah beget, nor is there any god along with Him: (if there were many gods), behold, each god would have taken away what he had created, and some would have lorded it over others! Glory to Allah! (He is free) from the (sort of) things they attribute to Him"},{"number":92,"text":"He knows what is hidden and what is open: too high is He for the partners they attribute to Him"},{"number":93,"text":"Say: \"O my Lord! if Thou wilt show me (in my lifetime) that which they are warned against"},{"number":94,"text":"Then, O my Lord! put me not amongst the people who do wrong"},{"number":95,"text":"And We are certainly able to show thee (in fulfilment) that against which they are warned"},{"number":96,"text":"Repel evil with that which is best: We are well acquainted with the things they say"},{"number":97,"text":"And say \"O my Lord! I seek refuge with Thee from the suggestions of the Evil Ones"},{"number":98,"text":"And I seek refuge with Thee O my Lord! lest they should come near me"},{"number":99,"text":"(In Falsehood will they be) Until, when death comes to one of them, he says: \"O my Lord! send me back (to life)"},{"number":100,"text":"In order that I may work righteousness in the things I neglected.\" - \"By no means! It is but a word he says.\"- Before them is a Partition till the Day they are raised up"},{"number":101,"text":"Then when the Trumpet is blown, there will be no more relationships between them that Day, nor will one ask after another"},{"number":102,"text":"Then those whose balance (of good deeds) is heavy,- they will attain salvation"},{"number":103,"text":"But those whose balance is light, will be those who have lost their souls, in Hell will they abide"},{"number":104,"text":"The Fire will burn their faces, and they will therein grin, with their lips displaced"},{"number":105,"text":"Were not My Signs rehearsed to you, and ye did but treat them as falsehood"},{"number":106,"text":"They will say: \"our Lord! Our misfortune overwhelmed us, and we became a people astray"},{"number":107,"text":"Our Lord! bring us out of this: if ever we return (to Evil), then shall we be wrong-doers indeed"},{"number":108,"text":"He will say: \"Be ye driven into it (with ignominy)! And speak ye not to Me"},{"number":109,"text":"A part of My servants there was, who used to pray 'our Lord! we believe; then do Thou forgive us, and have mercy upon us: For Thou art the Best of those who show mercy"},{"number":110,"text":"But ye treated them with ridicule, so much so that (ridicule of) them made you forget My Message while ye were laughing at them"},{"number":111,"text":"I have rewarded them this Day for their patience and constancy: they are indeed the ones that have achieved Bliss"},{"number":112,"text":"He will say: \"What number of years did ye stay on earth"},{"number":113,"text":"They will say: \"We stayed a day or part of a day: but ask those who keep account"},{"number":114,"text":"He will say: \"Ye stayed not but a little,- if ye had only known"},{"number":115,"text":"Did ye then think that We had created you in jest, and that ye would not be brought back to Us (for account)"},{"number":116,"text":"Therefore exalted be Allah, the King, the Reality: there is no god but He, the Lord of the Throne of Honour"},{"number":117,"text":"If anyone invokes, besides Allah, Any other god, he has no authority therefor; and his reckoning will be only with his Lord! and verily the Unbelievers will fail to win through"},{"number":118,"text":"So say: \"O my Lord! grant Thou forgiveness and mercy for Thou art the Best of those who show mercy"}]}