{
  "number": 67,
  "name": "سُورَةُ المُلۡكِ",
  "englishName": "Al-Mulk",
  "ayahs": [
    {
      "number": 1,
      "text": "Blessed be He in Whose hands is Dominion; and He over all things hath Power;-",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 2,
      "text": "He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 3,
      "text": "He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (Allah) Most Gracious. So turn thy vision again: seest thou any flaw?",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 4,
      "text": "Again turn thy vision a second time: (thy) vision will come back to thee dull and discomfited, in a state worn out.",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 5,
      "text": "And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire.",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 6,
      "text": "For those who reject their Lord (and Cherisher) is the Penalty of Hell: and evil is (such), Destination.",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 7,
      "text": "When they are cast therein, they will hear the (terrible) drawing in of its breath even as it blazes forth,",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 8,
      "text": "Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\"",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 9,
      "text": "They will say: \"Yes indeed; a Warner did come to us, but we rejected him and said, 'Allah never sent down any (Message): ye are nothing but an egregious delusion!'\"",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 10,
      "text": "They will further say: \"Had we but listened or used our intelligence, we should not (now) be among the Companions of the Blazing Fire!\"",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 11,
      "text": "They will then confess their sins: but far will be (Forgiveness) from the Companions of the Blazing Fire!",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 12,
      "text": "As for those who fear their Lord unseen, for them is Forgiveness and a great Reward.",
      "juz": 29,
      "manzil": 7,
      "page": 562,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 13,
      "text": "And whether ye hide your word or publish it, He certainly has (full) knowledge, of the secrets of (all) hearts.",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 14,
      "text": "Should He not know,- He that created? and He is the One that understands the finest mysteries (and) is well-acquainted (with them).",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 496,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 15,
      "text": "It is He Who has made the earth manageable for you, so traverse ye through its tracts and enjoy of the Sustenance which He furnishes: but unto Him is the Resurrection.",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 16,
      "text": "Do ye feel secure that He Who is in heaven will not cause you to be swallowed up by the earth when it shakes (as in an earthquake)?",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 17,
      "text": "Or do ye feel secure that He Who is in Heaven will not send against you a violent tornado (with showers of stones), so that ye shall know how (terrible) was My warning?",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 18,
      "text": "But indeed men before them rejected (My warning): then how (terrible) was My rejection (of them)?",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 19,
      "text": "Do they not observe the birds above them, spreading their wings and folding them in? None can uphold them except (Allah) Most Gracious: Truly (Allah) Most Gracious: Truly it is He that watches over all things.",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 20,
      "text": "Nay, who is there that can help you, (even as) an army, besides (Allah) Most Merciful? In nothing but delusion are the Unbelievers.",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 21,
      "text": "Or who is there that can provide you with Sustenance if He were to withhold His provision? Nay, they obstinately persist in insolent impiety and flight (from the Truth).",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 22,
      "text": "Is then one who walks headlong, with his face grovelling, better guided,- or one who walks evenly on a Straight Way?",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 23,
      "text": "Say: \"It is He Who has created you (and made you grow), and made for you the faculties of hearing, seeing, feeling and understanding: little thanks it is ye give.",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 24,
      "text": "Say: \"It is He Who has multiplied you through the earth, and to Him shall ye be gathered together.\"",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 25,
      "text": "They ask: When will this promise be (fulfilled)? - If ye are telling the truth.",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 26,
      "text": "Say: \"As to the knowledge of the time, it is with Allah alone: I am (sent) only to warn plainly in public.\"",
      "juz": 29,
      "manzil": 7,
      "page": 563,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 27,
      "text": "At length, when they see it close at hand, grieved will be the faces of the Unbelievers, and it will be said (to them): \"This is (the promise fulfilled), which ye were calling for!\"",
      "juz": 29,
      "manzil": 7,
      "page": 564,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 28,
      "text": "Say: \"See ye?- If Allah were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\"",
      "juz": 29,
      "manzil": 7,
      "page": 564,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 29,
      "text": "Say: \"He is (Allah) Most Gracious: We have believed in Him, and on Him have we put our trust: So, soon will ye know which (of us) it is that is in manifest error.\"",
      "juz": 29,
      "manzil": 7,
      "page": 564,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    },
    {
      "number": 30,
      "text": "Say: \"See ye?- If your stream be some morning lost (in the underground earth), who then can supply you with clear-flowing water?\"",
      "juz": 29,
      "manzil": 7,
      "page": 564,
      "ruku": 497,
      "hizbQuarter": 225,
      "sajda": false
    }
  ]
}