{"number":56,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"Qiyamət vaqe olacağı (qopacağı) vaxt"},{"number":2,"text":"Onun vaqe olmasını heç kəs təkzib edə (dana) bilməz"},{"number":3,"text":"O (kimini) alçaldacaq, (kimini də) ucaldacaqdır"},{"number":4,"text":"Yer hərəkətə gəlib şiddətlə titrədiyi"},{"number":5,"text":"Dağlar parça-parça olub ovxalandığı"},{"number":6,"text":"Və toz kimi səpələndiyi zaman"},{"number":7,"text":"Siz (ey insanlar!) üç zümrəyə ayrılacaqsınız"},{"number":8,"text":"Sağ tərəf sahibləri (əməl dətərləri sağ əllərinə verilənlər). Kimdir o sağ tərəf sahibləri? (Nə uğurludur onlar)"},{"number":9,"text":"Sol tərəf sahibləri (əməl dətərləri sol əllərinə verilənlər). Kimdir o sol tərəf sahibləri? (Nə uğursuzdur onlar)"},{"number":10,"text":"Və öndə olanlar. Onlar (dünyada Allah yolunda, imanda, əməldə, xeyirdə öndə olduqları kimi, axirətdə də) öndədirlər! (Nə xoşbəxtdir onlar)"},{"number":11,"text":"Onlar (Allah dərgahına, Allahın lütfünə) yaxınlaşdırılmış kimsələrdir"},{"number":12,"text":"Onlar Nəim cənnətlərində olacaqlar"},{"number":13,"text":"(Öndə olanların) çoxu əvvəlkilərdən (keçmiş peyğəmbərlərin ümmətlərindən)"},{"number":14,"text":"Biz azı da axırıncılardandır (Muhəmməd əleyhissəlamın ümmətindəndir)"},{"number":15,"text":"(Onlar qızıl-gümüş, lə’l-cavahiratla) bəzənmiş taxtlar üstündə qərar tutacaq"},{"number":16,"text":"Onlara (o taxtlara) söykənib bir-biri ilə qarşı-qarşıya əyləşəcəklər"},{"number":17,"text":"Onların dövrəsində həmişəcavan xidmətçi oğlanlar dolanacaqlar"},{"number":18,"text":"(Cənnət bulağından axan) məin (şərab) dolu piyalələr, kuzələr və qədəhlərlə"},{"number":19,"text":"(Dünyadakı şərabdan fərqli olaraq) ondan başları ağrımaz və keflənməzlər"},{"number":20,"text":"(O cavan xidmətçilər Cənnətdə olanların) bəyənib seçdikləri meyvələr"},{"number":21,"text":"Və istədikləri hər cür quş əti ilə (onların dövrəsində fırlanacaqlar)"},{"number":22,"text":"(Onlar üçün orada) iri (ahu) gözlü, qəşəng hurilər də vardır"},{"number":23,"text":"(O hurilər rəng və gözəllikcə) sanki sədəf içində gizlənmiş (qorunub-saxlanmış) incidirlər"},{"number":24,"text":"Onlar (bu ne’mətlərə dünyada) etdikləri (yaxşı) əməllər müqabilində nail olacaqlar"},{"number":25,"text":"Onlar orada (Cənnətdə) nə boş söz, nə də günaha bais olan bir şey eşidəcəklər"},{"number":26,"text":"Eşitdikləri söz ancaq “salam” olacaqdır"},{"number":27,"text":"Sağ tərəf sahibləri! (Əməl dəftərləri sağ əllərində olanlar!) Kimdir o sağ tərəf sahibləri"},{"number":28,"text":"(Onlar) tikansız sidr ağacları"},{"number":29,"text":"Salxım-salxım sallanmış möüz (banan) ağacları altında"},{"number":30,"text":"Çəkilməyən (daimi) kölgəliklərdə"},{"number":31,"text":"Axar su kənarında"},{"number":32,"text":"Bol meyvələr –"},{"number":33,"text":"Tükənməz və qadağan edilməyən (meyvələr) içində"},{"number":34,"text":"Və (bir-birinin üstünə yığılmış) hündür döşəklər üstündə (yaxud yüksək əxlaq və qeyri-adi gözəllik sahibi olan qadınlar yanında) olacaqlar"},{"number":35,"text":"Şübhəsiz ki, Biz onları (huriləri) başqa cür (yeni bir yaradılışla, doğulmadan) yaradacağıq"},{"number":36,"text":"Onları bakirə qızlar"},{"number":37,"text":"Ərlərini sevən, həmyaşıdlar edəcəyik"},{"number":38,"text":"Sağ tərəf sahibləri (əməl dəftəri sağ əllərinə verilənlər) üçündür onlar"},{"number":39,"text":"(Onların) bir çoxu əvvəlkilərdən (keçmiş peyğəmbərlərin ümmətlərindən)"},{"number":40,"text":"Bir çoxu da axırıncılardandır (bu ümmətdəndir)"},{"number":41,"text":"Sol tərəf sahibləri! (Əməl dəftərləri sol əllərinə verilənlər!) Kimdir o sol tərəf sahibləri"},{"number":42,"text":"(Onlar) səmum yeli (qızmar atəş) və qaynar su içində"},{"number":43,"text":"Qapqara duman kölgəsində olacaqlar"},{"number":44,"text":"(O kölgə başqa kölgələrdən fərqli olaraq) nə sərin, nə də xoşagələndir"},{"number":45,"text":"Onlar bundan əvvəl (dünyada) naz-ne’mət içində idilər"},{"number":46,"text":"Özləri də böyük günah içində (Allaha şərik qoşmaqla) israr edib dururdular"},{"number":47,"text":"Və belə deyirdilər: “Əcaba, biz öldükdən, toz-torpaq və sür-sümük olduqdan sonra, həqiqətən, yenidən dirildiləcəyikmi"},{"number":48,"text":"Yaxud bizdən əvvəl gəlib-getmiş atalarımız da dirildiləcəklərmi?!”"},{"number":49,"text":"(Ya Peyğəmbər!) De: “(Sizdən) əvvəlkilər də, sonrakılar da"},{"number":50,"text":"Mə’lum bir günün (qiyamət gününün) müəyyən bir vaxtında mütləq (məhşərə) cəm ediləcəklər"},{"number":51,"text":"Sonra, siz ey (haqq) yoldan azanlar, (haqqı) dananlar"},{"number":52,"text":"Şübhəsiz ki, zəqqum ağacından (onun meyvəsindən) yeyəcəksiniz"},{"number":53,"text":"Qarınlarınızı onunla dolduracaqsınız"},{"number":54,"text":"Üstündən də (sizə bərk yanğı gəldiyi üçün) qaynar su içəcəksiniz"},{"number":55,"text":"Özü də onu susuzluq xəstəliyinə tutulmuş (dəvə) kimi içəcəksiniz"},{"number":56,"text":"Bu onların haqq-hesab günündəki ziyafətidir"},{"number":57,"text":"(Ey kafirlər!) Biz sizi (yoxdan) yaratdıq. Məgər (qiyamət günü yenidən dirildiləcəyinizi) təsdiq etməzmisiniz"},{"number":58,"text":"Bəs (bətnlərə) axıtdığınız nütfəyə nə deyirsiniz"},{"number":59,"text":"Ondan (insan) yaradan sizsiniz, yoxsa Biz"},{"number":60,"text":"Sizin aranızda ölüm (kimin nə vaxt öləcəyini) əvvəlcədən Biz müəyyən etdik. Və Biz əsla aciz (önünə keçilməsi mümkün olan) deyilik"},{"number":61,"text":"(Sizi yox edib) yerinizə sizin kimiləri gətirməkdən (sizi başqaları ilə əvəz etməkdən) və sizi özünüz də bilmədiyiniz başqa bir şəkildə yaratmaqdan"},{"number":62,"text":"And olsun ki, siz ilk yaradılış (dünyaya necə gəldiyinizi) bilirsiniz. Elə isə (sizi yenidən diriltməyə qadir olduğumuz barədə) heç düşünmürsünüz"},{"number":63,"text":"Bəs əkdiyiniz (toxuma) nə deyirsiniz"},{"number":64,"text":"Onu bitirən sizsiniz, yoxsa Biz"},{"number":65,"text":"Əgər Biz istəsəydik, onu bir saman çöpünə döndərər, siz də mat-məətəl qalıb"},{"number":66,"text":"“Biz ziyana uğramış"},{"number":67,"text":"Bəlkə, (hələ ruzidən də) məhrum olmuş kimsələrik!” (deyərdiniz)"},{"number":68,"text":"Bəs içdiyiniz suya nə deyirsiniz"},{"number":69,"text":"Onu buluddan endirən sizsiniz, yoxsa Biz"},{"number":70,"text":"Əgər istəsəydik, onu acı (bir su) edərdik. Elə isə niyə (Allahın ne’mətlərinə) şükür etmirsiniz"},{"number":71,"text":"Bəs (yaş ağacdan) yandırdığınız oda nə deyirsiniz"},{"number":72,"text":"Onun ağacını yaradan sizsiniz, yoxsa Biz"},{"number":73,"text":"Biz onu (sizi cəhənnəm odu ilə qorxutmaqdan ötrü) ibrət dərsi və səhrada olan müsafirlərin faydalanması üçün yaratdıq"},{"number":74,"text":"Belə olduqda (ya Peyğəmbər!) sən ulu olan Rəbbinin adını müqəddəs tutub zikr et"},{"number":75,"text":"Ulduzların (bürclərdəki) mənzillərinə (yaxud doğub-batdığı yerlərə) and olsun ki –"},{"number":76,"text":"Kaş bunun nə qədər böyük bir and olduğunu biləydiniz –"},{"number":77,"text":"(Sizə oxunan) bu (kəlam) çox qiymətli Qur’andır"},{"number":78,"text":"(O, Allah dərgahında) qorunub saxlanılan bir Kitabdadır (lövhi-məhfuzdadır, yaxud lülələnib bükülmüş kağızlardadır)"},{"number":79,"text":"Ona yalnız pak olanlar toxuna bilər"},{"number":80,"text":"Aləmlərin Rəbbi tərəfindən nazil edilmişdir"},{"number":81,"text":"İndi siz bu kəlamı yalan sayırsınız? (Bu sözümə məhəl qoymursunuz)"},{"number":82,"text":"Ruzinizə şükür etməli olduğunuz halda, onu yalanmı hesab edirsiniz"},{"number":83,"text":"(Can) boğaza yetişdiyi (ölüm gəlib çatdığı) zaman"},{"number":84,"text":"Siz (ona) baxıb durursunuz (əlinizdən heç bir şey gəlmir)"},{"number":85,"text":"Biz ona sizdən daha yaxınıq, amma siz (bunu) görmürsünüz"},{"number":86,"text":"Əgər sizdən (dediyiniz kimi, qiyamət günü əməllərinizə görə) haqq-hesab çəkilməyəcəksə"},{"number":87,"text":"Və əgər (“öləndən sonra heç bir dirilmə, haqq-hesab yoxdur” sözünü) doğru deyirsinizsə, bəlkə, (o çıxan canı) geri (bədənə) qaytarasınız"},{"number":88,"text":"Amma əgər (ölən kimsə Allah dərgahına, Allahın lütf və mərhəmətinə) yaxın olanlardandırsa"},{"number":89,"text":"(Onu) rəhmət, gözəl ruzi (yaxud xoş ətirli çiçəklər) və Nəim cənnəti gözləyir"},{"number":90,"text":"Əgər o, sağ tərəf sahiblərindəndirsə (əməl dəftəri sağ əlinə verilənlərdəndirsə)"},{"number":91,"text":"(Ona özü kimi olan yoldaşlarının dili ilə:) “Sağ tərəf sahiblərindən sənə salam olsun!” (deyiləcəkdir)"},{"number":92,"text":"Əgər (ölən kimsə Allahın ayələrini, mö’cüzələrini) yalan sayanlardan və yoldan azanlardandırsa"},{"number":93,"text":"(Ona) qaynar su ziyafəti veriləcək"},{"number":94,"text":"Və özü də Cəhənnəmə atılacaqdır"},{"number":95,"text":"Şübhəsiz ki, bu, təkzibolunmaz həqiqətdir"},{"number":96,"text":"Elə isə (ya Peyğəmbər!) sən ulu olan Rəbbinin adını təsbih (müqəddəs turub zikr) et! (Və ya: Sən Rəbbini o böyük adı ilə təsbih et)"}]}