{"number":78,"edition":"az.mammadaliyev","ayahs":[{"number":1,"text":"(Bu müşriklər) bir-birindən nə haqqında soruşurlar"},{"number":2,"text":"Böyük bir xəbər (qiyamət günü) haqqında"},{"number":3,"text":"Elə bir xəbər ki, onun barəsində ixtilafdadırlar"},{"number":4,"text":"Xeyr, onlar (qiyamətin haqq olduğunu) mütləq biləcəklər"},{"number":5,"text":"Bir də (deyirəm) xeyr, onlar (qiyamətin haqq olduğunu) mütləq biləcəklər"},{"number":6,"text":"Məgər Biz yeri döşək etmədikmi"},{"number":7,"text":"Dağları da dirək"},{"number":8,"text":"Biz sizləri (erkək və dişi olmaqla) cüt-cüt yaratdıq"},{"number":9,"text":"Yuxunuzu da istirahət etdik"},{"number":10,"text":"Biz gecəni (hər şeyi bürüyən) örtük etdik"},{"number":11,"text":"Gündüzü isə dolanışlıq (ruzi qazanmaq) vaxtı etdik"},{"number":12,"text":"Üstünüzdə yeddi (qat) möhkəm (göy) qurduq"},{"number":13,"text":"Sizin üçün çox parlaq bir çıxar (günəş) yaratdıq"},{"number":14,"text":"(Küləklərin sıxdığı) buludlardan şırıl-şırıl tökülən yağmur endirdik ki"},{"number":15,"text":"Onunla dən və bitki yetişdirək"},{"number":16,"text":"Eləcə də (ağacları bir-birinə) sarmaşan bağlar"},{"number":17,"text":"Həqiqətən, (haqla batili) ayırd etmə günü (əzəldən müəyyən edilmiş) bir vaxtdır"},{"number":18,"text":"Sur çalınacağı gün (qəbirlərinizdən çıxıb) dəstə-dəstə (məhşərə) gələcəksiniz"},{"number":19,"text":"(O gün) göy qapı-qapı (mələklərin yerə enməsi üçün göydə yarıqlar) açılacaqdır"},{"number":20,"text":"Dağlar yerindən qopardılıb (havada toz kimi uçaraq) ilğıma dönəcəkdir"},{"number":21,"text":"Həqiqətən, Cəhənnəm (mələklərin hazır durub kafirləri gözlədiyi) pusqudur"},{"number":22,"text":"O, azğınların məskənidir"},{"number":23,"text":"Onlar orada sonsuz müddət qalacaqlar"},{"number":24,"text":"Onlar orada nə bir sərinlik (görəcək), nə də içməyə bir şey tapacaqlar"},{"number":25,"text":"Qaynar sudan və irindən başqa"},{"number":26,"text":"(Dünyadakı əmələrinə) uyğun cəza olaraq"},{"number":27,"text":"Çünki onlar haqq-hesab çəkiləcəyinə ümid bəsləmirdilər (qiyamət gününə inanmır, onun əzabından qorxmurdular)"},{"number":28,"text":"Ayələrimizi də elə hey təkzib edirdilər"},{"number":29,"text":"Biz hər şeyi (bir-bir) sayıb (lövhi-məhfuzda) yazmışıq (və ya: əməl dəftərində yazıb təsbit etmişik)"},{"number":30,"text":"İndi (ey kafirlər!) dadın əzabı. Biz sizə əzabdan başqa bir şey artırmayacağıq"},{"number":31,"text":"Həqiqətən, müttəqilərin nicat yeri (Cənnət)"},{"number":32,"text":"Bağçalar və üzüm bağları"},{"number":33,"text":"Sinələri yenicə qabarmış (dolmuş, tumurcuqlanmış, gözəllikdə və məlahətdə bir-birinə bənzər) həmyaşıd qızlar"},{"number":34,"text":"(Cənnət şərabı ilə) dolu qədəhlər gözləyir"},{"number":35,"text":"Onlar orada (Cənnətdə) nə boş söz, nə də yalan eşidəcəklər"},{"number":36,"text":"(Bu, müttəqilərə) Rəbbindən olan mükafat, artıqlaması ilə verilən bəxşişdir"},{"number":37,"text":"Göylərin, yerin və onların arasındakıların Rəhman olan Rəbbindən (göndərilən bəxşişdir). Onlar (məxluqat) Onun hüzurunda heç bir söz deməyə qadir olmazlar"},{"number":38,"text":"Ruhun (Cəbrailin) və mələklərin səf-səf duracağı gün Rəhmanın izin verdiyi kimsələrdən başqa heç kəs danışmayacaq, danışan da doğrunu deyəcəkdir"},{"number":39,"text":"Bu, haqq olan gündür. Kim dilərsə, (iman gətirib ibadət və itaət etməklə) Rəbbinə tərəf qayıdan bir yol tutar"},{"number":40,"text":"Həqiqətən, Biz sizi yaxın bir əzabla (qiyamət gününün əzabı ilə) qorxutduq. O gün insan öz əlləri ilə etdiyi (yaxşı, pis) əməlləri görəcək, kafir isə: “Kaş (bu əzabı görməmək üçün) torpaq olaydım!” – deyəcəkdir"}]}