{"number":52,"edition":"en.shakir","ayahs":[{"number":1,"text":"I swear by the Mountain"},{"number":2,"text":"And the Book written"},{"number":3,"text":"In an outstretched fine parchment"},{"number":4,"text":"And the House (Kaaba) that is visited"},{"number":5,"text":"And the elevated canopy"},{"number":6,"text":"And the swollen sea"},{"number":7,"text":"Most surely the punishment of your Lord will come to pass"},{"number":8,"text":"There shall be none to avert it"},{"number":9,"text":"On the day when the heaven shall move from side to side"},{"number":10,"text":"And the mountains shall pass away passing away (altogether)"},{"number":11,"text":"So woe on that day to those who reject (the truth)"},{"number":12,"text":"Those who sport entering into vain discourses"},{"number":13,"text":"The day on which they shall be driven away to the fire of hell with violence"},{"number":14,"text":"This is the fire which you used to give the lie to"},{"number":15,"text":"Is it magic then or do you not see"},{"number":16,"text":"Enter into it, then bear (it) patiently, or do not bear (it) patiently, it is the same to you; you shall be requited only (for) what you did"},{"number":17,"text":"Surely those who guard (against evil) shall be in gardens and bliss"},{"number":18,"text":"Rejoicing because of what their Lord gave them, and their Lord saved them from the punishment of the burning fire"},{"number":19,"text":"Eat and drink pleasantly for what you did"},{"number":20,"text":"Reclining on thrones set in lines, and We will unite them to large-eyed beautiful ones"},{"number":21,"text":"And (as for) those who believe and their offspring follow them in faith, We will unite with them their offspring and We will not diminish to them aught of their work; every man is responsible for what he shall have wrought"},{"number":22,"text":"And We will aid them with fruit and flesh such as they desire"},{"number":23,"text":"They shall pass therein from one to another a cup wherein there shall be nothing vain nor any sin"},{"number":24,"text":"And round them shall go boys of theirs as if they were hidden pearls"},{"number":25,"text":"And some of them shall advance towards others questioning each other"},{"number":26,"text":"Saying: Surely we feared before on account of our families"},{"number":27,"text":"But Allah has been gracious to us and He has saved us from the punishment of the hot wind"},{"number":28,"text":"Surely we called upon Him before: Surely He is the Benign, the Merciful"},{"number":29,"text":"Therefore continue to remind, for by the grace of your Lord, you are not a soothsayer, or a madman"},{"number":30,"text":"Or do they say: A poet, we wait for him the evil accidents of time"},{"number":31,"text":"Say: Wait, for surely I too with you am of those who wait"},{"number":32,"text":"Nay! do their understandings bid them this? Or are they an inordinate people"},{"number":33,"text":"Or do they say: He has forged it. Nay! they do not believe"},{"number":34,"text":"Then let them bring an announcement like it if they are truthful"},{"number":35,"text":"Or were they created without there being anything, or are they the creators"},{"number":36,"text":"Or did they create the heavens and the earth? Nay! they have no certainty"},{"number":37,"text":"Or have they the treasures of your Lord with them? Or have they been set in absolute authority"},{"number":38,"text":"Or have they the means by which they listen? Then let their listener bring a clear authority"},{"number":39,"text":"Or has He daughters while you have sons"},{"number":40,"text":"Or do you ask them for a reward, so that they are overburdened by a debt"},{"number":41,"text":"Or have they the unseen so that they write (it) down"},{"number":42,"text":"Or do they desire a war? But those who disbelieve shall be the vanquished ones in war"},{"number":43,"text":"Or have they a god other than Allah? Glory be to Allah from what they set up (with Him)"},{"number":44,"text":"And if they should see a portion of the heaven coming down, they would say: Piled up clouds"},{"number":45,"text":"Leave them then till they meet that day of theirs wherein they shall be made to swoon (with terror)"},{"number":46,"text":"The day on which their struggle shall not avail them aught, nor shall they be helped"},{"number":47,"text":"And surely those who are unjust shall have a punishment besides that (in the world), but most of them do not know"},{"number":48,"text":"And wait patiently for the judgment of your Lord, for surely you are before Our eyes, and sing the praise of your Lord when you rise"},{"number":49,"text":"And in the night, give Him glory too, and at the setting of the stars"}]}