{"number":79,"edition":"en.shakir","ayahs":[{"number":1,"text":"I swear by the angels who violently pull out the souls of the wicked"},{"number":2,"text":"And by those who gently draw out the souls of the blessed"},{"number":3,"text":"And by those who float in space"},{"number":4,"text":"Then those who are foremost going ahead"},{"number":5,"text":"Then those who regulate the affair"},{"number":6,"text":"The day on which the quaking one shall quake"},{"number":7,"text":"What must happen afterwards shall follow it"},{"number":8,"text":"Hearts on that day shall palpitate"},{"number":9,"text":"Their eyes cast down"},{"number":10,"text":"They say: Shall we indeed be restored to (our) first state"},{"number":11,"text":"What! when we are rotten bones"},{"number":12,"text":"They said: That then would be a return occasioning loss"},{"number":13,"text":"But it shall be only a single cry"},{"number":14,"text":"When lo! they shall be wakeful"},{"number":15,"text":"Has not there come to you the story of Musa"},{"number":16,"text":"When his Lord called upon him in the holy valley, twice"},{"number":17,"text":"Go to Firon, surely he has become inordinate"},{"number":18,"text":"Then say: Have you (a desire) to purify yourself"},{"number":19,"text":"And I will guide you to your Lord so that you should fear"},{"number":20,"text":"So he showed him the mighty sign"},{"number":21,"text":"But he rejected (the truth) and disobeyed"},{"number":22,"text":"Then he went back hastily"},{"number":23,"text":"Then he gathered (men) and called out"},{"number":24,"text":"Then he said: I am your lord, the most high"},{"number":25,"text":"So Allah seized him with the punishment of the hereafter and the former life"},{"number":26,"text":"Most surely there is in this a lesson to him who fears"},{"number":27,"text":"Are you the harder to create or the heaven? He made it"},{"number":28,"text":"He raised high its height, then put it into a right good state"},{"number":29,"text":"And He made dark its night and brought out its light"},{"number":30,"text":"And the earth, He expanded it after that"},{"number":31,"text":"He brought forth from it its water and its pasturage"},{"number":32,"text":"And the mountains, He made them firm"},{"number":33,"text":"A provision for you and for your cattle"},{"number":34,"text":"But when the great predominating calamity comes"},{"number":35,"text":"The day on which man shall recollect what he strove after"},{"number":36,"text":"And the hell shall be made manifest to him who sees"},{"number":37,"text":"Then as for him who is inordinate"},{"number":38,"text":"And prefers the life of this world"},{"number":39,"text":"Then surely the hell, that is the abode"},{"number":40,"text":"And as for him who fears to stand in the presence of his Lord and forbids the soul from low desires"},{"number":41,"text":"Then surely the garden-- that is the abode"},{"number":42,"text":"They ask you about the hour, when it will come"},{"number":43,"text":"About what! You are one to remind of it"},{"number":44,"text":"To your Lord is the goal of it"},{"number":45,"text":"You are only a warner to him who would fear it"},{"number":46,"text":"On the day that they see it, it will be as though they had not tarried but the latter part of a day or the early part of it"}]}