{"number":25,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Binecuvântat fie Cel ce a pogorât Legea asupra robului Său ca să fie lumilor predicator"},{"number":2,"text":"Cel ce are împărăţia cerurilor şi pământului, Cel ce nu şi-a dăruit Sie însuşi copii, Cel ce nu are părtaş întru împărăţia Sa, Cel ce a creat fiece lucru hotărându-i soarta"},{"number":3,"text":"Ei şi-au luat în locul Lui alţi dumnezei ce nu au creat nimic, ci ei înşişi sunt creaţi, care nu păgubesc şi nu folosesc, care nu stăpânesc nici viaţa, nici moartea şi nici învierea"},{"number":4,"text":"Cei care tăgăduiesc au spus: “Aceasta nu este decât o minciună născocită de el şi un alţi oameni care îl ajută întru aceasta.” Ei vin cu nedreptate şi minciună"},{"number":5,"text":"Ei spuseră: “Acestea sunt poveşti ale celor dintâi pe care le-a scris, fiindu-i dictate dimineaţa şi seara.”"},{"number":6,"text":"Spune: “Cel ce cunoaşte Taina din ceruri şi de pe pământ l-a pogorât. El este Iertător, Milostiv”"},{"number":7,"text":"Ei spuseră: “Ce are, aşadar, acest trimis? El mănâncă bucate şi umblă pe la târguri. Dacă ar fi pogorât la el un Înger care să fie cu el predicator"},{"number":8,"text":"ori i-ar fi fost aruncată vreo comoară, ori ar fi avut vreo grădină din care să mănânce...! Nedrepţii spuseră: “Voi nu urmaţi decât un om vrăjit.”"},{"number":9,"text":"Vezi asemănările pe care ţi le dau?! Ei se rătăcesc şi nu îşi mai pot afla nici o cale"},{"number":10,"text":"Binecuvântat fie Cel ce, dacă voieşte, îţi dăruieşte mai bine decât acestea: grădini pe sub care curg râuri şi unde îţi face palate"},{"number":11,"text":"Ei socot Ceasul o minciună. Noi le-am pregătit o flacără arzătoare lor, celor care socot Ceasul minciună"},{"number":12,"text":"Când îi va vedea ea de departe, ei îi vor auzi furia şi şuieratul"},{"number":13,"text":"Când, legaţi împreună, vor fi aruncaţi acolo într-un loc strâmt, îşi vor chema pierirea"},{"number":14,"text":"“Nu chemaţi astăzi o singură pierire, ci chemaţi mai multe pieiri!”"},{"number":15,"text":"Spune: “Aceasta este mai bun, ori Grădina veşniciei ce le-a fost făgăduită celor temători ca răsplată lor şi devenire?”"},{"number":16,"text":"Ei vor avea ceea ce îşi doresc acolo, unde vor veşnici. Aceasta este o făgăduială de la Dumnezeu pe care El o va ţine"},{"number":17,"text":"În Ziua când El vă va aduna cu cei cărora vă închinaţi în locul lui Dumnezeu, vă va spune: “Voi mi-aţi rătăcit robii aceştia? Ori ei înşişi au rătăcit Calea?”"},{"number":18,"text":"Ei vor spune: “Mărire Ţie! N-ar fi trebuit să ne luăm alţi oblăduitori în afara Ta, însă Tu le-ai dăruit bucurii vremelnice lor şi taţilor lor, încât au uitat amintirea Numele Tău şi astfel au fost sortiţi pieirii.”"},{"number":19,"text":"“Ei vă socotesc mincinoşi în ceea ce spuneţi. Voi nu veţi putea îndepărta pedeapsa şi nici nu vă veţi putea ajuta. Celui nedrept dintre voi îi vom da să guste o mare osândă.”"},{"number":20,"text":"Noi n-am trimis înaintea ta decât trimişi ce mâncau bucate şi umblau prin pieţe. I-am făcut pe unii o încercare pentru alţii. Veţi fi oare răbdători? Domnul tău este Văzător"},{"number":21,"text":"Cei care nu nădăjduiesc în întâlnirea Noastră spun: “Dacă ar pogorî la noi îngerii ori l-am vedea pe Domnul nostru!” Ei se îngâmfează şi sunt prea-plini de ei"},{"number":22,"text":"În Ziua când cei nelegiuiţi vor vedea îngerii, în Ziua aceea nu vor avea o veste bună şi vor spune: “Este un prag de netrecut!”"},{"number":23,"text":"Noi ne vom apropia de faptele pe care le-au săvârşit şi le vom face praf şi pulbere"},{"number":24,"text":"În Ziua aceea, locuitorii Grădinii vor avea o şedere plăcută şi un popas minunat"},{"number":25,"text":"În Ziua când cerul se va fărâmiţa în nori şi îngerii vor fi pogorâţi în grabă"},{"number":26,"text":"în Ziua aceea, adevărata împărăţie va fi a Milostivului. Aceasta va fi o Zi grozavă pentru tăgăduitori"},{"number":27,"text":"În Ziua aceea cel nedrept îşi va muşca mâinile spunând: “Vai mie! Dacă aş fi urmat calea cu trimisul"},{"number":28,"text":"Vai mie! Dacă nu mi-aş fi luat “un oarecare” drept prieten"},{"number":29,"text":"căci el m-a rătăcit de la amintirea ce deja venise la mine! Diavolul este omului trădător.”"},{"number":30,"text":"Trimisul spuse: “O, Domnul meu! Poporul meu a luat acest Coran ca pe ceva de aruncat!”"},{"number":31,"text":"Astfel Noi am făcut fiecărui profet un vrăjmaş printre nelegiuiţi. Domnul tău este de ajuns ca ajutor şi călăuzitor"},{"number":32,"text":"Cei care tăgăduiesc spun: “Dacă ar fi fost pogorât asupra lui Coranul deodată!” Noi l-am pogorât astfel ca să-ţi întărim cu el inima şi să-l facem să fie recitat cu grijă"},{"number":33,"text":"Ei nu-ţi dau nici o pildă fără ca Noi să nu aducem adevărul cu o tâlcuire şi mai frumoasă"},{"number":34,"text":"Cei care vor fi puşi faţă în faţă în Gheena vor fi în cel mai rău loc şi cei mai departe rătăciţi de Cale"},{"number":35,"text":"Noi i-am dăruit Cartea lui Moise şi l-am pus lângă el pe fratele său Aaron ca sfetnic"},{"number":36,"text":"Apoi Noi le-am spus: “Mergeţi amândoi la poporul care a socotit semnele Noastre minciuni.” Şi Noi l-am stârpit apoi întru totul"},{"number":37,"text":"Şi poporul Noe! Când îi socoteau pe trimişi mincinoşi, Noi i-am înecat, făcând, astfel, din ei un semn pentru oameni. Celor nedrepţi le-am pregătit o dureroasă osândă"},{"number":38,"text":"Şi astfel a fost şi cu adiţii, cu tamudiţii, cu locuitorii din Ar-Rass şi cu multe alte leaturi aflătoare între ei"},{"number":39,"text":"Tuturor le-am dat întâi pilde, apoi i-am dat pierzaniei"},{"number":40,"text":"Ei au trecut pe lângă cetatea asupra căreia a fost trimisă o ploaie a urgiei. Oare nu or fi văzut-o? Ei nu nădăjduiesc însă într-o înviere"},{"number":41,"text":"Când te văd, nu fac decât să râdă de tine: “Acesta să fie cel pe care Dumnezeu l-a trimis ca profet"},{"number":42,"text":"El ne-ar fi îndepărtat de dumnezeii noştri, dacă n-am fi fost atât de strâns legaţi de ei.” Când vor vedea osânda, vor şti cine este cel mai rătăcit de Cale"},{"number":43,"text":"Nu l-ai văzut pe cel care îşi ia pofta sa drept dumnezeu? Tu îi vei fi oare sprijin"},{"number":44,"text":"Socoţi că cei mai mulţi dintre ei aud ori pricep? Ei sunt, asemenea dobitoacelor, ba chiar mai rătăciţi de la Cale"},{"number":45,"text":"Nu vezi cum Domnul tău întinde umbra? Şi dacă ar fi vrut, ar fi ţinut-o locului. Am făcut soarele arătătorul ei"},{"number":46,"text":"şi apoi cu uşurinţă o luăm la Noi"},{"number":47,"text":"El este Cel ce v-a făcut vouă noaptea veşmânt şi somnul odihnă. El v-a făcut vouă ziua pentru trezire"},{"number":48,"text":"El este Cel ce trimite vânturile ca o vestire înainte-mergătoare a milostiveniei Sale. Noi trimitem din cer apă curată"},{"number":49,"text":"cu care înviem ţinutul mort şi cu care adăpăm mulţimea de dobitoace şi oameni pe care i-am creat"},{"number":50,"text":"Aceasta le-am înfăţişat-o ca ei să-şi amintească, însă cei mai mulţi oameni se leapădă. Însă nu şi de tăgadă"},{"number":51,"text":"Dacă am fi voit, am fi trimis în fiece cetate un predicator"},{"number":52,"text":"Nu da ascultare tăgăduitorilor, ci luptă împotriva lor cu tărie"},{"number":53,"text":"El este Cel ce a slobozit cele două mări: una dulce, plăcută la gust, cealaltă sărată, amară. El a făcut între ele un stăvilar şi un prag de netrecut"},{"number":54,"text":"El este Cel ce l-a creat pe om din apă, iar apoi i-a făcut înrudire şi încuscrire. Domnul său asupra tuturor are putere"},{"number":55,"text":"Ei se închină în locul lui Dumnezeu celor care nici nu le folosesc, nici nu îi păgubesc. Tăgăduitorul este sprijin vrăjmaşilor lui Dumnezeu"},{"number":56,"text":"Noi te-am trimis vestitor şi predicator"},{"number":57,"text":"Spune: “Eu nu vă cer răsplată, ci numai îndreptarea către Domnul său a celui care voieşte.”"},{"number":58,"text":"Încrede-te în Viul, ce nu moare! Preamăreşte-L cu laude! El este îndeajuns de Cunoscător al păcatelor robilor Săi"},{"number":59,"text":"El este Cel ce a creat în şase zile cerurile, pământul şi ceea ce se află între ele, apoi s-a aşezat pe Tron, El, Milostivul. Întreabă-l pe cel cunoscător despre El"},{"number":60,"text":"Când li se spune: “Prosternaţi-vă înaintea Milostivului”, ei spun: “Cine este Milostivul? Să ne prosternăm, când ne porunceşti tu?” Şi ei sporesc întru îndărătnicie"},{"number":61,"text":"Binecuvântat fie Cel ce a făcut zodiile pe cer, precum şi o candelă şi o lună luminoasă"},{"number":62,"text":"El este Cel ce face ca noaptea şi ziua să-şi urmeze pentru cel care voieşte să-şi amintească de El ori voieşte să mulţumească"},{"number":63,"text":"Robii lui Dumnezeu sunt cei care merg cu smerenie pe pământ, iar când le vorbesc neştiutorii, ei spun: “Pace!”"},{"number":64,"text":"cei care petrec noaptea înaintea Domnului lor, prosternaţi ori în picioare"},{"number":65,"text":"cei care spun: “Domnul nostru! Îndepărtează de noi osânda Gheenei, căci osânda ei este un chin necurmat”"},{"number":66,"text":"— Rea este Gheena ca locuinţă şi loc de şedere! —"},{"number":67,"text":"cei care cheltuiesc fără să fie nici risipitori, nici zgârciţi, căci cumpătarea este calea de mijoc"},{"number":68,"text":"cei care nu cheamă alt dumnezeu în afară de Dumnezeu, cei care nu ucid pe nimeni, căci Dumnezeu a oprit acest lucru dacă nu este după dreptate, cei care nu preacurvesc..., iar cei care vor face altminterea vor păcătui"},{"number":69,"text":"şi în Ziua Învierii osânda lor va fi îndoită şi necurmat vor fi umiliţi"},{"number":70,"text":"însă nu şi pentru cel care se căieşte, care crede şi face binele. Aceştia sunt cei cărora Dumnezeu le va schimba faptele rele în fapte bune, căci Dumnezeu este Iertător, Milostiv"},{"number":71,"text":"Cel care se căieşte şi care săvârşeşte fapte bune se întoarce la Dumnezeu cu mare căinţă"},{"number":72,"text":"Ei sunt cei care nu mărturisesc strâmb şi când trec pe lângă vorbe deşarte, trec cu demnitate"},{"number":73,"text":"Ei nu sunt nici surzi, nici orbi când li se amintesc semnele Domnului lor"},{"number":74,"text":"Ei sunt cei care spun: “Domnul nostru! Dăruieşte-ne soţii şi urmaşi care să ne bucure ochii! Fă-ne celor temători pildă de urmat"},{"number":75,"text":"Căci au fost răbdători, ei toţi vor avea drept răsplată Casa Raiului, unde vor afla bună primire şi pace"},{"number":76,"text":"şi acolo vor veşnici. Ce loc de şedere minunat"},{"number":77,"text":"Spune: “Domnul meu nu se îngrijeşte de voi fiindcă huliţi şi nu-L chemaţi. Curând veţi fi fără scăpare.”"}]}