{"number":83,"edition":"ro.grigore","ayahs":[{"number":1,"text":"Vai celor înşelători"},{"number":2,"text":"Când cumpără, cer oamenilor să le umple măsura"},{"number":3,"text":"însă când ei măsoară ori cântăresc, îi înşală"},{"number":4,"text":"Nu-şi dau seama că vor fi sculaţi"},{"number":5,"text":"într-o Zi mare"},{"number":6,"text":"într-o Zi când oamenii vor sta drepţi înaintea Domnului lumilor"},{"number":7,"text":"Nu! Cartea celor desfrânaţi este Siggin"},{"number":8,"text":"Cum vei şti tu oare ce este Siggin"},{"number":9,"text":"Este o carte scrisă"},{"number":10,"text":"Vai celor care hulesc, în Ziua aceea"},{"number":11,"text":"vai celor care socot Ziua Judecăţii de Apoi minciună"},{"number":12,"text":"Doar cel care încalcă Legea şi este plin de păcate o socoate minciună"},{"number":13,"text":"Când i se recită în faţă din versetele Noastre, el spune: “Sunt doar poveşti ale celor dintâi!”"},{"number":14,"text":"Nu! Inimile le-au fost pecetluite de ceea ce au dobândit"},{"number":15,"text":"Nu! În Ziua aceea, vor fi despărţiţi de Domnul lor"},{"number":16,"text":"şi aruncaţi în Iad"},{"number":17,"text":"Li se va spune atunci: “Iată cea ce voi socoteaţi minciună!”"},{"number":18,"text":"Nu! Cartea celor curaţi este Illiyun"},{"number":19,"text":"Şi cum vei şti tu oare ce este Illiyun"},{"number":20,"text":"Este o carte scrisă"},{"number":21,"text":"Cei care sunt aproape de Dumnezeu o pot mărturisi"},{"number":22,"text":"Da! Cei curaţi vor trăi în Plăcere"},{"number":23,"text":"întinşi pe paturi, vor privi în jurul lor"},{"number":24,"text":"Vei vedea pe chipurile lor strălucirea prea-fericirii"},{"number":25,"text":"Li se va da să bea nectar pecetluit"},{"number":26,"text":"cu pecete de mosc — pentru aceasta să se întreacă cei care se iau la întrecere! —"},{"number":27,"text":"amestecat cu apă din Tasmin"},{"number":28,"text":"un izvor din care beau doar cei apropiaţi de Dumnezeu"},{"number":29,"text":"Nelegiuiţii râdeau de credincioşi"},{"number":30,"text":"făcându-şi unii altora cu ochiul, când treceau pe lângă ei"},{"number":31,"text":"iar când se întorceau la ai lor, se întorceau chicotind"},{"number":32,"text":"Când îi vedeau, spuneau: “Aceştia sunt cei rătăciţi!”"},{"number":33,"text":"Ei nu au fost trimişi însă să fie asupra lor păzitori"},{"number":34,"text":"Astăzi, credincioşii râd însă de tăgăduitori"},{"number":35,"text":"Întinşi pe paturi de nuntă, privesc"},{"number":36,"text":"cum sunt răsplătiţi tăgăduitorii pentru ceea ce-au făcut"}]}