{"number":56,"edition":"ur.junagarhi","ayahs":[{"number":1,"text":"جب قیامت قائم ہو جائے گی"},{"number":2,"text":"جس کے واقع ہونے میں کوئی جھوٹ نہیں"},{"number":3,"text":"وه پست کرنے والی اور بلند کرنے والی ہوگی"},{"number":4,"text":"جبکہ زمین زلزلہ کے ساتھ ہلا دی جائے گی"},{"number":5,"text":"اور پہاڑ بالکل ریزه ریزه کر دیے جائیں گے"},{"number":6,"text":"پھر وه مثل پراگنده غبار کے ہو جائیں گے"},{"number":7,"text":"اور تم تین جماعتوں میں ہو جاؤ گے"},{"number":8,"text":"پس داہنے ہاتھ والے کیسے اچھے ہیں داہنے ہاتھ والے"},{"number":9,"text":"اور بائیں ہاتھ والے کیا حال ہے بائیں ہاتھ والوں کا"},{"number":10,"text":"اور جو آگے والے ہیں وه تو آگے والے ہی ہیں"},{"number":11,"text":"وه بالکل نزدیکی حاصل کیے ہوئے ہیں"},{"number":12,"text":"نعمتوں والی جنتوں میں ہیں"},{"number":13,"text":"(بہت بڑا) گروه تو اگلے لوگوں میں سے ہوگا"},{"number":14,"text":"اور تھوڑے سے پچھلے لوگوں میں سے"},{"number":15,"text":"یہ لوگ سونے کے تاروں سے بنے ہوئے تختوں پر"},{"number":16,"text":"ایک دوسرے کےسامنے تکیہ لگائے بیٹھے ہوں گے"},{"number":17,"text":"ان کے پاس ایسے لڑکے جو ہمیشہ (لڑکے ہی) رہیں گے آمدورفت کریں گے"},{"number":18,"text":"آبخورے اور جگ لے کر اور ایسا جام لے کر جو بہتی ہوئی شراب سے پر ہو"},{"number":19,"text":"جس سے نہ سر میں درد ہو نہ عقل میں فتور آئے"},{"number":20,"text":"اور ایسے میوے لیے ہوئے جو ان کی پسند کے ہوں"},{"number":21,"text":"اور پرندوں کے گوشت جو انہیں مرغوب ہوں"},{"number":22,"text":"اور بڑی بڑی آنکھوں والی حوریں"},{"number":23,"text":"جو چھپے ہوئے موتیوں کی طرح ہیں"},{"number":24,"text":"یہ صلہ ہے ان کے اعمال کا"},{"number":25,"text":"نہ وہاں بکواس سنیں گے اور نہ گناه کی بات"},{"number":26,"text":"صرف سلام ہی سلام کی آواز ہوگی"},{"number":27,"text":"اور داہنے ہاتھ والے کیا ہی اچھے ہیں داہنے ہاتھ والے"},{"number":28,"text":"وه بغیرکانٹوں کی بیریوں"},{"number":29,"text":"اور تہ بہ تہ کیلوں"},{"number":30,"text":"اور لمبے لمبے سایوں"},{"number":31,"text":"اور بہتے ہوئے پانیوں"},{"number":32,"text":"اور بکثرت پھلوں میں"},{"number":33,"text":"جو نہ ختم ہوں نہ روک لیے جائیں"},{"number":34,"text":"اور اونچے اونچے فرشوں میں ہوں گے"},{"number":35,"text":"ہم نے ان کی (بیویوں کو) خاص طور پر بنایا ہے"},{"number":36,"text":"اور ہم نے انہیں کنواریاں بنا دیا ہے"},{"number":37,"text":"محبت والیاں اور ہم عمر ہیں"},{"number":38,"text":"دائیں ہاتھ والوں کے لیے ہیں"},{"number":39,"text":"جم غفیر ہے اگلوں میں سے"},{"number":40,"text":"اور بہت بڑی جماعت ہے پچھلوں میں سے"},{"number":41,"text":"اور بائیں ہاتھ والے کیا ہیں بائیں ہاتھ والے"},{"number":42,"text":"گرم ہوا اور گرم پانی میں (ہوں گے)"},{"number":43,"text":"اورسیاه دھوئیں کے سائے میں"},{"number":44,"text":"جو نہ ٹھنڈا ہے نہ فرحت بخش"},{"number":45,"text":"بیشک یہ لوگ اس سے پہلے بہت نازوں میں پلے ہوئے تھے"},{"number":46,"text":"اور بڑے بڑے گناہوں پر اصرار کرتے تھے"},{"number":47,"text":"اور کہتے تھے کہ کیا جب ہم مر جائیں گے اور مٹی اور ہڈی ہو جائیں گے تو کیا ہم پھر دوباره اٹھا کھڑے کیے جائیں گے"},{"number":48,"text":"اور کیا ہمارے اگلے باپ دادا بھی؟"},{"number":49,"text":"آپ کہہ دیجئے کہ یقیناً سب اگلے اور پچھلے"},{"number":50,"text":"ضرور جمع کئے جائیں گے ایک مقرر دن کے وقت"},{"number":51,"text":"پھر تم اے گمراہو جھٹلانے والو"},{"number":52,"text":"البتہ کھانے والے ہو تھوہر کا درخت"},{"number":53,"text":"اور اسی سے پیٹ بھرنے والے ہو"},{"number":54,"text":"پھر اس پر گرم کھولتا پانی پینے والے ہو"},{"number":55,"text":"پھر پینے والے بھی پیاسے اونٹوں کی طرح"},{"number":56,"text":"قیامت کے دن ان کی مہمانی یہ ہے"},{"number":57,"text":"ہم ہی نے تم سب کو پیدا کیا ہے پھر تم کیوں باور نہیں کرتے؟"},{"number":58,"text":"اچھا پھر یہ تو بتلاؤ کہ جو منی تم ٹپکاتے ہو"},{"number":59,"text":"کیا اس کا (انسان) تم بناتے ہو یا پیدا کرنے والے ہم ہی ہیں؟"},{"number":60,"text":"ہم ہی نے تم میں موت کو متعین کر دیا ہے اور ہم اس سے ہارے ہوئے نہیں ہیں"},{"number":61,"text":"کہ تمہاری جگہ تم جیسے اور پیدا کر دیں اور تمہیں نئے سرے سے اس عالم میں پیدا کریں جس سے تم (بالکل) بےخبر ہو"},{"number":62,"text":"تمہیں یقینی طور پر پہلی دفعہ کی پیدائش معلوم ہی ہے پھر کیوں عبرت حاصل نہیں کرتے؟"},{"number":63,"text":"اچھا پھر یہ بھی بتلاؤ کہ تم جو کچھ بوتے ہو"},{"number":64,"text":"اسے تم ہی اگاتے ہو یا ہم اگانے والے ہیں"},{"number":65,"text":"اگر ہم چاہیں تواسے ریزه ریزه کر ڈالیں اور تم حیرت کے ساتھ باتیں بناتے ہی ره جاؤ"},{"number":66,"text":"کہ ہم پر تو تاوان ہی پڑ گیا"},{"number":67,"text":"بلکہ ہم بالکل محروم ہی ره گئے"},{"number":68,"text":"اچھا یہ بتاؤ کہ جس پانی کو تم پیتے ہو"},{"number":69,"text":"اسے بادلوں سے بھی تم ہی اتارتے ہو یا ہم برساتے ہیں؟"},{"number":70,"text":"اگر ہماری منشا ہو تو ہم اسے کڑوا زہر کردیں پھر تم ہماری شکرگزاری کیوں نہیں کرتے؟"},{"number":71,"text":"اچھا ذرا یہ بھی بتاؤ کہ جو آگ تم سلگاتے ہو"},{"number":72,"text":"اس کے درخت کو تم نے پیدا کیا ہے یا ہم اس کے پیدا کرنے والے ہیں؟"},{"number":73,"text":"ہم نے اسے سبب نصیحت اور مسافروں کے فائدے کی چیز بنایا ہے"},{"number":74,"text":"پس اپنے بہت بڑے رب کے نام کی تسبیح کیا کرو"},{"number":75,"text":"پس میں قسم کھاتا ہوں ستاروں کے گرنے کی"},{"number":76,"text":"اور اگرتمہیں علم ہو تو یہ بہت بڑی قسم ہے"},{"number":77,"text":"کہ بیشک یہ قرآن بہت بڑی عزت واﻻ ہے"},{"number":78,"text":"جو ایک محفوظ کتاب میں درج ہے"},{"number":79,"text":"جسے صرف پاک لوگ ہی چھو سکتے ہیں"},{"number":80,"text":"یہ رب العالمین کی طرف سےاترا ہوا ہے"},{"number":81,"text":"پس کیا تم ایسی بات کو سرسری (اور معمولی) سمجھ رہے ہو؟"},{"number":82,"text":"اور اپنے حصے میں یہی لیتے ہو کہ جھٹلاتے پھرو"},{"number":83,"text":"پس جبکہ روح نرخرے تک پہنچ جائے"},{"number":84,"text":"اور تم اس وقت آنکھوں سے دیکھتے رہو"},{"number":85,"text":"ہم اس شخص سے بہ نسبت تمہارے بہت زیاده قریب ہوتے ہیں لیکن تم نہیں دیکھ سکتے"},{"number":86,"text":"پس اگر تم کسی کے زیرفرمان نہیں"},{"number":87,"text":"اور اس قول میں سچے ہو تو (ذرا) اس روح کو تو لوٹاؤ"},{"number":88,"text":"پس جو کوئی بارگاه الٰہی سے قریب کیا ہوا ہوگا"},{"number":89,"text":"اسے تو راحت ہے اور غذائیں ہیں اور آرام والی جنت ہے"},{"number":90,"text":"اور جو شحص داہنے (ہاتھ) والوں میں سے ہے"},{"number":91,"text":"تو بھی سلامتی ہے تیرے لیے کہ تو داہنے والوں میں سے ہے"},{"number":92,"text":"لیکن اگر کوئی جھٹلانے والوں گمراہوں میں سے ہے"},{"number":93,"text":"تو کھولتے ہوئے گرم پانی کی مہمانی ہے"},{"number":94,"text":"اور دوزخ میں جانا ہے"},{"number":95,"text":"یہ خبر سراسر حق اور قطعاً یقینی ہے"},{"number":96,"text":"پس تواپنے عظیم الشان پروردگار کی تسبیح کر"}]}