{"number":70,"edition":"ur.junagarhi","ayahs":[{"number":1,"text":"ایک سوال کرنے والے نے اس عذاب کا سوال کیا جو واضح ہونے واﻻ ہے"},{"number":2,"text":"کافروں پر، جسے کوئی ہٹانے واﻻ نہیں"},{"number":3,"text":"اس اللہ کی طرف سے جو سیڑھیوں واﻻ ہے"},{"number":4,"text":"جس کی طرف فرشتے اور روح چڑھتے ہیں ایک دن میں جس کی مقدار پچاس ہزار سال کی ہے"},{"number":5,"text":"پس تو اچھی طرح صبر کر"},{"number":6,"text":"بیشک یہ اس (عذاب) کو دور سمجھ رہے ہیں"},{"number":7,"text":"اور ہم اسے قریب ہی دیکھتے ہیں"},{"number":8,"text":"جس دن آسمان مثل تیل کی تلچھٹ کے ہو جائے گا"},{"number":9,"text":"اور پہاڑ مثل رنگین اون کے ہو جائیں گے"},{"number":10,"text":"اور کوئی دوست کسی دوست کو نہ پوچھے گا"},{"number":11,"text":"(حاﻻنکہ) ایک دوسرے کو دکھا دیئے جائیں گے، گناهگار اس دن کے عذاب کے بدلے فدیے میں اپنے بیٹوں کو"},{"number":12,"text":"اپنی بیوی کو اور اپنے بھائی کو"},{"number":13,"text":"اور اپنے کنبے کو جو اسے پناه دیتا تھا"},{"number":14,"text":"اور روئے زمین کے سب لوگوں کو دینا چاہے گا تاکہ یہ اسے نجات دﻻ دے"},{"number":15,"text":"(مگر) ہرگز یہ نہ ہوگا، یقیناً وه شعلہ والی (آگ) ہے"},{"number":16,"text":"جو منھ اور سر کی کھال کھینچ ﻻنے والی ہے"},{"number":17,"text":"وه ہر اس شخص کو پکارے گی جو پیچھے ہٹتا اور منھ موڑتا ہے"},{"number":18,"text":"اور جمع کرکے سنبھال رکھتا ہے"},{"number":19,"text":"بیشک انسان بڑے کچے دل واﻻ بنایا گیا ہے"},{"number":20,"text":"جب اسے مصیبت پہنچتی ہے تو ہڑبڑا اٹھتا ہے"},{"number":21,"text":"اور جب راحت ملتی ہے تو بخل کرنے لگتا ہے"},{"number":22,"text":"مگر وه نمازی"},{"number":23,"text":"جو اپنی نماز پر ہمیشگی کرنے والے ہیں"},{"number":24,"text":"اور جن کے مالوں میں مقرره حصہ ہے"},{"number":25,"text":"مانگنے والوں کا بھی اور سوال سے بچنے والوں کا بھی"},{"number":26,"text":"اور جو انصاف کے دن پر یقین رکھتے ہیں"},{"number":27,"text":"اور جو اپنے رب کے عذاب سے ڈرتے رہتے ہیں"},{"number":28,"text":"بیشک ان کے رب کا عذاب بے خوف ہونے کی چیز نہیں"},{"number":29,"text":"اور جو لوگ اپنی شرم گاہوں کی (حرام سے) حفاﻇت کرتے ہیں"},{"number":30,"text":"ہاں ان کی بیویوں اور لونڈیوں کے بارے میں جن کے وه مالک ہیں انہیں کوئی ملامت نہیں"},{"number":31,"text":"اب جو کوئی اس کے علاوه (راه) ڈھونڈے گا توایسے لوگ حد سے گزر جانے والے ہوں گے"},{"number":32,"text":"اور جو اپنی امانتوں کا اور اپنے قول و قرار کا پاس رکھتے ہیں"},{"number":33,"text":"اور جو اپنی گواہیوں پر سیدھے اور قائم رہتے ہیں"},{"number":34,"text":"اور جو اپنی نمازوں کی حفاﻇت کرتے ہیں"},{"number":35,"text":"یہی لوگ جنتوں میں عزت والے ہوں گے"},{"number":36,"text":"پس کافروں کو کیاہو گیا ہے کہ وه تیری طرف دوڑتے آتے ہیں"},{"number":37,"text":"دائیں اور بائیں سے گروه کے گروه"},{"number":38,"text":"کیا ان میں سے ہر ایک کی توقع یہ ہے کہ وه نعمتوں والی جنت میں داخل کیا جائے گا؟"},{"number":39,"text":"(ایسا) ہرگز نہ ہوگا۔ ہم نے انہیں اس (چیز) سے پیدا کیا ہے جسے وه جانتے ہیں"},{"number":40,"text":"پس مجھے قسم ہے مشرقوں اور مغربوں کے رب کی (کہ) ہم یقیناً قادر ہیں"},{"number":41,"text":"اس پر کہ ان کے عوض ان سے اچھے لوگ لے آئیں اور ہم عاجز نہیں ہیں"},{"number":42,"text":"پس تو انہیں جھگڑتا کھیلتا چھوڑ دے یہاں تک کہ یہ اپنے اس دن سے جاملیں جس کا ان سے وعده کیا جاتا ہے"},{"number":43,"text":"جس دن یہ قبروں سے دوڑتے ہوئے نکلیں گے، گویا کہ وه کسی جگہ کی طرف تیز تیز جا رہے ہیں"},{"number":44,"text":"ان کی آنکھیں جھکی ہوئی ہوں گی، ان پر ذلت چھا رہی ہوگی، یہ ہے وه دن جس کا ان سے وعده کیا جاتا تھا"}]}