{"number":79,"edition":"ur.junagarhi","ayahs":[{"number":1,"text":"ڈوب کر سختی سے کھینچنے والوں کی قسم"},{"number":2,"text":"بند کھول کر چھڑا دینے والوں کی قسم"},{"number":3,"text":"اور تیرنے پھرنے والوں کی قسم"},{"number":4,"text":"پھر دوڑ کر آگے بڑھنے والوں کی قسم"},{"number":5,"text":"پھر کام کی تدبیر کرنے والوں کی قسم"},{"number":6,"text":"جس دن کانپنے والی کانپے گی"},{"number":7,"text":"اس کے بعد ایک پیچھے آنے والی (پیچھے پیچھے) آئے گی"},{"number":8,"text":"(بہت سے) دل اس دن دھڑکتے ہوں گے"},{"number":9,"text":"جن کی نگاہیں نیچی ہوں گی"},{"number":10,"text":"کہتے ہیں کہ کیا ہم پہلی کی سی حالت کی طرف پھر لوٹائے جائیں گے؟"},{"number":11,"text":"کیا اس وقت جب کہ ہم بوسیده ہڈیاں ہو جائیں گے؟"},{"number":12,"text":"کہتے ہیں کہ پھر تو یہ لوٹنا نقصان ده ہے"},{"number":13,"text":"(معلوم ہونا چاہئے) وه تو صرف ایک (خوفناک) ڈانٹ ہے"},{"number":14,"text":"کہ (جس کے ﻇاہر ہوتے ہی) وه ایک دم میدان میں جمع ہو جائیں گے"},{"number":15,"text":"کیا موسیٰ (علیہ السلام) کی خبر تمہیں پہنچی ہے؟"},{"number":16,"text":"جب کہ انہیں ان کے رب نے پاک میدان طویٰ میں پکارا"},{"number":17,"text":"(کہ) تم فرعون کے پاس جاؤ اس نے سرکشی اختیار کر لی ہے"},{"number":18,"text":"اس سے کہو کہ کیا تو اپنی درستگی اور اصلاح چاہتا ہے"},{"number":19,"text":"اور یہ کہ میں تجھے تیرے رب کی راه دکھاؤں تاکہ تو (اس سے) ڈرنے لگے"},{"number":20,"text":"پس اسے بڑی نشانی دکھائی"},{"number":21,"text":"تو اس نے جھٹلایا اور نافرمانی کی"},{"number":22,"text":"پھر پلٹا دوڑ دھوپ کرتے ہوئے"},{"number":23,"text":"پھر سب کو جمع کرکے پکارا"},{"number":24,"text":"تم سب کا رب میں ہی ہوں"},{"number":25,"text":"تو (سب سے بلند وباﻻ) اللہ نے بھی اسے آخرت کے اور دنیا کے عذاب میں گرفتار کرلیا"},{"number":26,"text":"بیشک اس میں اس شخص کے لئے عبرت ہے جو ڈرے"},{"number":27,"text":"کیا تمہارا پیدا کرنا زیاده دشوار ہے یا آسمان کا؟ اللہ تعالیٰ نے اسے بنایا"},{"number":28,"text":"اس کی بلندی اونچی کی پھر اسے ٹھیک ٹھاک کر دیا"},{"number":29,"text":"اسکی رات کو تاریک بنایا اور اس کے دن کو نکالا"},{"number":30,"text":"اور اس کے بعد زمین کو (ہموار) بچھا دیا"},{"number":31,"text":"اس میں سے پانی اور چاره نکالا"},{"number":32,"text":"اور پہاڑوں کو (مضبوط) گاڑ دیا"},{"number":33,"text":"یہ سب تمہارے اور تمہارے جانوروں کے فائدے کے لئے (ہیں)"},{"number":34,"text":"پس جب وه بڑی آفت (قیامت) آجائے گی"},{"number":35,"text":"جس دن کہ انسان اپنے کیے ہوئے کاموں کو یاد کرے گا"},{"number":36,"text":"اور (ہر) دیکھنے والے کے سامنے جہنم ﻇاہر کی جائے گی"},{"number":37,"text":"تو جس (شخص) نے سرکشی کی (ہوگی)"},{"number":38,"text":"اور دنیوی زندگی کو ترجیح دی (ہوگی)"},{"number":39,"text":"اس کا ٹھکانا جہنم ہی ہے"},{"number":40,"text":"ہاں جو شخص اپنے رب کے سامنے کھڑے ہونے سے ڈرتا رہا ہوگا اور اپنے نفس کو خواہش سے روکا ہوگا"},{"number":41,"text":"تو اس کا ٹھکانا جنت ہی ہے"},{"number":42,"text":"لوگ آپ سے قیامت کے واقع ہونے کا وقت دریافت کرتے ہیں"},{"number":43,"text":"آپ کو اس کے بیان کرنے سے کیا تعلق؟"},{"number":44,"text":"اس کے علم کی انتہا تو اللہ کی جانب ہے"},{"number":45,"text":"آپ تو صرف اس سے ڈرتے رہنے والوں کو آگاه کرنے والے ہیں"},{"number":46,"text":"جس روز یہ اسے دیکھ لیں گے تو ایسا معلوم ہوگا کہ صرف دن کا آخری حصہ یا اول حصہ ہی (دنیا میں) رہے ہیں"}]}