{"number":68,"edition":"hi.farooq","ayahs":[{"number":1,"text":"नून॰। गवाह है क़लम और वह चीज़ जो वे लिखते है"},{"number":2,"text":"तुम अपने रब की अनुकम्पा से कोई दीवाने नहीं हो"},{"number":3,"text":"निश्चय ही तुम्हारे लिए ऐसा प्रतिदान है जिसका क्रम कभी टूटनेवाला नहीं"},{"number":4,"text":"निस्संदेह तुम एक महान नैतिकता के शिखर पर हो"},{"number":5,"text":"अतः शीघ्र ही तुम भी देख लोगे और वे भी देख लेंगे"},{"number":6,"text":"कि तुममें से कौन विभ्रमित है"},{"number":7,"text":"निस्संदेह तुम्हारा रब उसे भली-भाँति जानता है जो उसके मार्ग से भटक गया है, और वही उन लोगों को भी जानता है जो सीधे मार्ग पर हैं"},{"number":8,"text":"अतः तुम झुठलानेवालों को कहना न मानना"},{"number":9,"text":"वे चाहते है कि तुम ढीले पड़ो, इस कारण वे चिकनी-चुपड़ी बातें करते है"},{"number":10,"text":"तुम किसी भी ऐसे व्यक्ति की बात न मानना जो बहुत क़समें खानेवाला, हीन है"},{"number":11,"text":"कचोके लगाता, चुग़लियाँ खाता फिरता हैं"},{"number":12,"text":"भलाई से रोकता है, सीमा का उल्लंघन करनेवाला, हक़ मारनेवाला है"},{"number":13,"text":"क्रूर है फिर अधम भी।"},{"number":14,"text":"इस कारण कि वह धन और बेटोंवाला है"},{"number":15,"text":"जब उसे हमारी आयतें सुनाई जाती है तो कहता है, \"ये तो पहले लोगों की कहानियाँ हैं"},{"number":16,"text":"शीघ्र ही हम उसकी सूँड पर दाग़ लगाएँगे"},{"number":17,"text":"हमने उन्हें परीक्षा में डाला है जैसे बाग़वालों को परीक्षा में डाला था, जबकि उन्होंने क़सम खाई कि वे प्रातःकाल अवश्य उस (बाग़) के फल तोड़ लेंगे"},{"number":18,"text":"और वे इसमें छूट की कोई गुंजाइश नहीं रख रहे थे"},{"number":19,"text":"अभी वे सो ही रहे थे कि तुम्हारे रब की ओर से गर्दिश का एक झोंका आया"},{"number":20,"text":"और वह ऐसा हो गया जैसे कटी हुई फ़सल"},{"number":21,"text":"फिर प्रातःकाल होते ही उन्होंने एक-दूसरे को आवाज़ दी"},{"number":22,"text":"कि \"यदि तुम्हें फल तोड़ना है तो अपनी खेती पर सवेरे ही पहुँचो।"},{"number":23,"text":"अतएव वे चुपके-चुपके बातें करते हुए चल पड़े"},{"number":24,"text":"कि आज वहाँ कोई मुहताज तुम्हारे पास न पहुँचने पाए"},{"number":25,"text":"और वे आज तेज़ी के साथ चले मानो (मुहताजों को) रोक देने की उन्हें सामर्थ्य प्राप्त है"},{"number":26,"text":"किन्तु जब उन्होंने उसको देखा, कहने लगे, \"निश्चय ही हम भटक गए है।"},{"number":27,"text":"नहीं, बल्कि हम वंचित होकर रह गए।"},{"number":28,"text":"उनमें जो सबसे अच्छा था कहने लगा, \"क्या मैंने तुमसे कहा नहीं था? तुम तसबीह क्यों नहीं करते"},{"number":29,"text":"वे पुकार उठे, \"महान और उच्च है हमारा रब! निश्चय ही हम ज़ालिम थे।"},{"number":30,"text":"फिर वे परस्पर एक-दूसरे की ओर रुख़ करके लगे एक-दूसरे को मलामत करने।"},{"number":31,"text":"उन्होंने कहा, \"अफ़सोस हम पर! निश्चय ही हम सरकश थे।"},{"number":32,"text":"आशा है कि हमारा रब बदले में हमें इससे अच्छा प्रदान करे। हम अपने रब की ओर उन्मुख है।"},{"number":33,"text":"यातना ऐसी ही होती है, और आख़िरत की यातना तो निश्चय ही इससे भी बड़ी है, काश वे जानते"},{"number":34,"text":"निश्चय ही डर रखनेवालों के लिए उनके रब के यहाँ नेमत भरी जन्नतें है"},{"number":35,"text":"तो क्या हम मुस्लिमों (आज्ञाकारियों) को अपराधियों जैसा कर देंगे"},{"number":36,"text":"तुम्हें क्या हो गया है, कैसा फ़ैसला करते हो"},{"number":37,"text":"क्या तुम्हारे पास कोई किताब है जिसमें तुम पढ़ते हो"},{"number":38,"text":"कि उसमें तुम्हारे लिए वह कुछ है जो तुम पसन्द करो"},{"number":39,"text":"या तुमने हमसे क़समें ले रखी है जो क़ियामत के दिन तक बाक़ी रहनेवाली है कि तुम्हारे लिए वही कुछ है जो तुम फ़ैसला करो"},{"number":40,"text":"उनसे पूछो, \"उनमें से कौन इसकी ज़मानत लेता है"},{"number":41,"text":"या उनके ठहराए हुए कुछ साझीदार है? फिर तो यह चाहिए कि वे अपने साझीदारों को ले आएँ, यदि वे सच्चे है"},{"number":42,"text":"जिस दिन पिंडली खुल जाएगी और वे सजदे के लिए बुलाए जाएँगे, तो वे (सजदा) न कर सकेंगे"},{"number":43,"text":"उनकी निगाहें झुकी हुई होंगी, ज़िल्लत (अपमान) उनपर छा रही होगी। उन्हें उस समय भी सजदा करने के लिए बुलाया जाता था जब वे भले-चंगे थे"},{"number":44,"text":"अतः तुम मुझे छोड़ दो और उसको जो इस वाणी को झुठलाता है। हम ऐसों को क्रमशः (विनाश की ओर) ले जाएँगे, ऐसे तरीक़े से कि वे नहीं जानते"},{"number":45,"text":"मैं उन्हें ढील दे रहा हूँ। निश्चय ही मेरी चाल बड़ी मज़बूत है"},{"number":46,"text":"(क्या वे यातना ही चाहते हैं) या तुम उनसे कोई बदला माँग रहे हो कि वे तावान के बोझ से दबे जाते हों"},{"number":47,"text":"या उनके पास परोक्ष का ज्ञान है तो वे लिख रहे हैं"},{"number":48,"text":"तो अपने रब के आदेश हेतु धैर्य से काम लो और मछलीवाले (यूनुस अलै॰) की तरह न हो जाना, जबकि उसने पुकारा था इस दशा में कि वह ग़म में घुट रहा था।"},{"number":49,"text":"यदि उसके रब की अनुकम्पा उसके साथ न हो जाती तो वह अवश्य ही चटियल मैदान में बुरे हाल में डाल दिया जाता।"},{"number":50,"text":"अन्ततः उसके रब ने उसे चुन लिया और उसे अच्छे लोगों में सम्मिलित कर दिया"},{"number":51,"text":"जब वे लोग, जिन्होंने इनकार किया, ज़िक्र (क़ुरआन) सुनते है और कहते है, \"वह तो दीवाना है!\" तो ऐसा लगता है कि वे अपनी निगाहों के ज़ोर से तुम्हें फिसला देंगे"},{"number":52,"text":"हालाँकि वह सारे संसार के लिए एक अनुस्मृति है"}]}