{"number":79,"edition":"hi.farooq","ayahs":[{"number":1,"text":"गवाह है वे (हवाएँ) जो ज़ोर से उखाड़ फैंके"},{"number":2,"text":"और गवाह है वे (हवाएँ) जो नर्मी के साथ चलें"},{"number":3,"text":"और गवाह है वे जो वायुमंडल में तैरें"},{"number":4,"text":"फिर एक-दूसरे से अग्रसर हों"},{"number":5,"text":"और मामले की तदबीर करें"},{"number":6,"text":"जिस दिन हिला डालेगी हिला डालनेवाले घटना"},{"number":7,"text":"उसके पीछ घटित होगी दूसरी (घटना)"},{"number":8,"text":"कितने ही दिल उस दिन काँप रहे होंगे"},{"number":9,"text":"उनकी निगाहें झुकी होंगी"},{"number":10,"text":"वे कहते है, \"क्या वास्तव में हम पहली हालत में फिर लौटाए जाएँगे"},{"number":11,"text":"क्या जब हम खोखली गलित हड्डियाँ हो चुके होंगे"},{"number":12,"text":"वे कहते है, \"तब तो लौटना बड़े ही घाटे का होगा।"},{"number":13,"text":"वह तो बस एक ही झिड़की होगी"},{"number":14,"text":"फिर क्या देखेंगे कि वे एक समतल मैदान में उपस्थित है"},{"number":15,"text":"क्या तुम्हें मूसा की ख़बर पहुँची है"},{"number":16,"text":"जबकि उसके रब ने पवित्र घाटी 'तुवा' में उसे पुकारा था"},{"number":17,"text":"कि \"फ़िरऔन के पास जाओ, उसने बहुत सिर उठा रखा है"},{"number":18,"text":"और कहो, क्या तू यह चाहता है कि स्वयं को पाक-साफ़ कर ले"},{"number":19,"text":"और मैं तेरे रब की ओर तेरा मार्गदर्शन करूँ कि तु (उससे) डरे"},{"number":20,"text":"फिर उसने (मूसा ने) उसको बड़ी निशानी दिखाई"},{"number":21,"text":"किन्तु उसने झुठला दिया और कहा न माना"},{"number":22,"text":"फिर सक्रियता दिखाते हुए पलटा"},{"number":23,"text":"फिर (लोगों को) एकत्र किया और पुकारकर कहा"},{"number":24,"text":"मैं तुम्हारा उच्चकोटि का स्वामी हूँ"},{"number":25,"text":"अन्ततः अल्लाह ने उसे आख़िरत और दुनिया की शिक्षाप्रद यातना में पकड़ लिया"},{"number":26,"text":"निस्संदेह इसमें उस व्यक्ति के लिए बड़ी शिक्षा है जो डरे"},{"number":27,"text":"क्या तुम्हें पैदा करना अधिक कठिन कार्य है या आकाश को? अल्लाह ने उसे बनाया"},{"number":28,"text":"उसकी ऊँचाई को ख़ूब ऊँचा करके उसे ठीक-ठाक किया"},{"number":29,"text":"और उसकी रात को अन्धकारमय बनाया और उसका दिवस-प्रकाश प्रकट किया"},{"number":30,"text":"और धरती को देखो! इसके पश्चात उसे फैलाया"},{"number":31,"text":"उसमें से उसका पानी और उसका चारा निकाला"},{"number":32,"text":"और पहाड़ो को देखो! उन्हें उस (धरती) में जमा दिया"},{"number":33,"text":"तुम्हारे लिए और तुम्हारे मवेशियों के लिए जीवन-सामग्री के रूप में"},{"number":34,"text":"फिर जब वह महाविपदा आएगी"},{"number":35,"text":"उस दिन मनुष्य जो कुछ भी उसने प्रयास किया होगा उसे याद करेगा"},{"number":36,"text":"और भड़कती आग (जहन्नम) देखने वालों के लिए खोल दी जाएगी"},{"number":37,"text":"तो जिस किसी ने सरकशी की"},{"number":38,"text":"और सांसारिक जीवन को प्राथमिकता दो होगी"},{"number":39,"text":"तो निस्संदेह भड़कती आग ही उसका ठिकाना है"},{"number":40,"text":"और रहा वह व्यक्ति जिसने अपने रब के सामने खड़े होने का भय रखा और अपने जी को बुरी इच्छा से रोका"},{"number":41,"text":"तो जन्नत ही उसका ठिकाना है"},{"number":42,"text":"वे तुमसे उस घड़ी के विषय में पूछते है कि वह कब आकर ठहरेगी"},{"number":43,"text":"उसके बयान करने से तुम्हारा क्या सम्बन्ध"},{"number":44,"text":"उसकी अन्तिम पहुँच तो तेरे से ही सम्बन्ध रखती है"},{"number":45,"text":"तुम तो बस उस व्यक्ति को सावधान करनेवाले हो जो उससे डरे"},{"number":46,"text":"जिस दिन वे उसे देखेंगे तो (ऐसा लगेगा) मानो वे (दुनिया में) बस एक शाम या उसकी सुबह ही ठहरे है"}]}