{"number":69,"edition":"tr.vakfi","ayahs":[{"number":1,"text":"Gerçekleşecek olan"},{"number":2,"text":"(Evet) nedir o gerçekleşecek olan"},{"number":3,"text":"Gerçekleşecek olanın (kıyametin) ne olduğunu sen nereden bileceksin"},{"number":4,"text":"Semud ve Ad kavimleri, kapılarını çalacak felaketi (kıyameti) yalan saymışlardı"},{"number":5,"text":"Semud'a gelince: Onlar pek zorlu (bir sarsıntı) ile helak edildiler"},{"number":6,"text":"Ad kavmi ise, uğultulu, kasıp kavuran bir fırtına ile mahvedildiler"},{"number":7,"text":"Allah onu, ardarda yedi gece, sekiz gün onların üzerine musallat etti. Öyle ki (eğer orada olsaydın), o kavmi, içi boş hurma kütükleri gibi oracıkta yere serilmiş halde görürdün"},{"number":8,"text":"Şimdi onlardan arda kalan bir şey görüyor musun"},{"number":9,"text":"Firavun, ondan öncekiler ve altı üstüne getirilen beldeler halkı (Lut kavmi) hep o günahı (şirki) işlediler"},{"number":10,"text":"Böylece Rablerinin peygamberlerine karşı geldiler, O da onları pek şiddetli bir şekilde yakalayıverdi"},{"number":11,"text":"Şüphesiz, su bastığı vakit sizi gemide biz taşıdık"},{"number":12,"text":"Onu sizin için bir ibret ve öğüt yapalım ve belleyici kulaklar onu bellesin diye"},{"number":13,"text":"Artık Sur'a bir tek defa üflendiği"},{"number":14,"text":"Yeryüzü ve dağlar kaldırılıp birbirine tek çarpışla çarpılıp darmadağın edildiği zaman"},{"number":15,"text":"işte o gün olacak olur (kıyamet kopar)"},{"number":16,"text":"Gök de yarılır ve artık o gün o, çökmeye yüz tutar"},{"number":17,"text":"Melekler onun (göğün) etrafındadır. O gün Rabbinin arşını, bunların da üstünde sekiz (melek) yüklenir"},{"number":18,"text":"(Ey insanlar! ) O gün (hesap için) huzura alınırsınız; size ait hiçbir sır gizli kalmaz"},{"number":19,"text":"Kitabı sağ tarafından verilen:\" Alın, kitabımı okuyun\" der"},{"number":20,"text":"Doğrusu ben, hesabımla karşılaşacağımı zaten biliyordum"},{"number":21,"text":"Artık o, hoşnut kalacağı bir hayat içindedir"},{"number":22,"text":"Yüce bir cennette"},{"number":23,"text":"Meyveleri sarkmış halde"},{"number":24,"text":"(Onlara denir ki:) Geçmiş günlerde işlediklerinize (iyi amellerinize) karşılık, afiyetle yeyin, için"},{"number":25,"text":"Kitabı sol tarafından verilene gelince, der ki:\" Keşke, bana kitabım verilmeseydi"},{"number":26,"text":"Şu hesabımın ne olduğunu bilmeseydim"},{"number":27,"text":"Keşke onunla (ölümümle) her iş olup bitseydi"},{"number":28,"text":"Malım bana hiç fayda sağlamadı"},{"number":29,"text":"Saltanatım da benden (koptu), yok olup gitti"},{"number":30,"text":"Onu yakalayın da, (ellerini boynuna) bağlayın"},{"number":31,"text":"Sonra alevli ateşe atın onu"},{"number":32,"text":"Sonra da onu yetmiş arşın uzunluğunda bir zincir içinde oraya sokun"},{"number":33,"text":"Çünkü o, ulu Allah'a iman etmezdi"},{"number":34,"text":"Yoksulu doyurmaya teşvik etmezdi"},{"number":35,"text":"Bu sebeple, bugün burada onun candan bir dostu yoktur"},{"number":36,"text":"İrinden başka yiyecek de yoktur"},{"number":37,"text":"Onu (bile bile )hata işleyenlerden başkası yemez"},{"number":38,"text":"Görebildikleriniz üzerine yemin ederim"},{"number":39,"text":"Ve göremediklerinize ki"},{"number":40,"text":"Hiç şüphesiz o (Kur'an), çok şerefli bir elçinin sözüdür"},{"number":41,"text":"Ve o, bir şair sözü değildir. Ne de az iman ediyorsunuz"},{"number":42,"text":"Bir kahin sözü de değildir (o). Ne de az düşünüyorsunuz"},{"number":43,"text":"alemlerin Rabbi tarafından indirilmiştir"},{"number":44,"text":"Eğer (Peygamber) bize atfen bazı sözler uydurmuş olsaydı"},{"number":45,"text":"Elbette onu kıskıvrak yakalardık"},{"number":46,"text":"Sonra onun can damarını koparırdık (onu yaşatmazdık)"},{"number":47,"text":"Hiçbiriniz buna mani de olamazdınız"},{"number":48,"text":"Doğrusu o (Kur'an), takva sahipleri için bir öğüttür"},{"number":49,"text":"İçinizde (onu) yalan sayanlar bulunduğunu şüphesiz bilmekteyiz"},{"number":50,"text":"Muhakkak o, kafirler için bir iç yarasıdır"},{"number":51,"text":"Ve o, gerçekten kat'i bilginin ta kendisidir"},{"number":52,"text":"O halde, ulu Rabbinin adını yüceltip noksanlıklardan tenzih et"}]}