[{"hadith-eng":"The Messenger of Allah said: \"The believer is not afflicted by the prick of a thorn or what is worse (or greater) than that, except that by it Allah raises him in rank and removes sin from him.\"","reference":"Jami` at-Tirmidhi 965, Book 10, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does enduring hardships and afflictions benefit a believer in terms of spiritual growth?","id":"tirmidhi-10-1"},{"hadith-eng":"The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"","reference":"Jami` at-Tirmidhi 966, Book 10, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does experiencing fatigue or grief benefit a believer in terms of their spiritual journey?","id":"tirmidhi-10-2"},{"hadith-eng":"the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"","reference":"Jami` at-Tirmidhi 967, Book 10, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of visiting fellow Muslims in Islam?","id":"tirmidhi-10-3"},{"hadith-eng":"The Prophet said similarly, but he added in it: \"They said: 'What is the Khurfah of Paradise?' And he said: \"Its harvest.\"","reference":"Jami` at-Tirmidhi 968, Book 10, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is meant by the term 'Khurfah of Paradise' in Islamic teachings?","id":"tirmidhi-10-4"},{"hadith-eng":"His father said: \"Ali took me by the hand and said: 'Come with us to pay a visit to Al-Hasan.' So we found that Abu Musa was with him.' Ali - peace be upon him - said: 'O Abu Musa! Did you come to visit (the sick) or merely (stop by to) visit?' He said: 'No, to visit (the sick).' So Ali said: 'I heard the Messenger of Allah saying: \"No Muslim visits (the sick) Muslims in the morning, except that sevety-thousand angels, sent Salat upon him until the evening, and he does not visit at night except that seventy thousand angels sent Salat upon him until the morning, and there will be a garden for him in Paradise.\"","reference":"Jami` at-Tirmidhi 969, Book 10, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of visiting the sick in Islam according to the teachings of the Prophet Muhammad (peace be upon him)?","id":"tirmidhi-10-5"},{"hadith-eng":"\"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"","reference":"Jami` at-Tirmidhi 970, Book 10, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What challenges and trials did the companions of the Prophet face during their lives?","id":"tirmidhi-10-6"},{"hadith-eng":"The Prophet said that (a Hadith similar to no. 970).","reference":"Jami` at-Tirmidhi 971, Book 10, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Anas bin Malik in the context of hadith narration?","id":"tirmidhi-10-7"},{"hadith-eng":"Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"","reference":"Jami` at-Tirmidhi 972, Book 10, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking divine protection from evil influences in Islam?","id":"tirmidhi-10-8"},{"hadith-eng":"\"Thabit Al-Bunani and I entered upon Anas bin Malik, and Thabit said: 'O Abu Hamzah! I am suffering from an illness. So Anas said: 'Shall I not recite the Ruqyah of the Messenger of Allah over you?' He said: 'Why, yes.' He said: 'O Allah! Lord of mankind, removed the harm, and cure (him). Indeed You are the One Who cures, there is none who cures except you, a cure that leaves no disease.'\"","reference":"Jami` at-Tirmidhi 973, Book 10, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of using Ruqyah in Islamic healing practices?","id":"tirmidhi-10-9"},{"hadith-eng":"The Messenger of Allah said: \"A Muslim man has no right to spend two nights while he has something to will, except while his will is recorded with him.\"","reference":"Jami` at-Tirmidhi 974, Book 10, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having a will prepared according to Islamic teachings?","id":"tirmidhi-10-10"},{"hadith-eng":"\"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"","reference":"Jami` at-Tirmidhi 975, Book 10, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of making a will in Islam, especially when one is sick?","id":"tirmidhi-10-11"},{"hadith-eng":"The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'","reference":"Jami` at-Tirmidhi 976, Book 10, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the phrase 'La illaha illallah' in Islam?","id":"tirmidhi-10-12"},{"hadith-eng":"\"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 977, Book 10, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of speaking good words in the presence of the sick or dying?","id":"tirmidhi-10-13"},{"hadith-eng":"\"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"","reference":"Jami` at-Tirmidhi 978, Book 10, Hadith 14","grade":"Hasan(Darussalam)","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take during his final moments according to this narration?","id":"tirmidhi-10-14"},{"hadith-eng":"\"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 979, Book 10, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #1","question":"What can be learned about the experience of death from the perspective of those who witnessed the Prophet's passing?","id":"tirmidhi-10-15"},{"hadith-eng":"\"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]","reference":"Jami` at-Tirmidhi 980, Book 10, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of a believer's soul seeping out at the time of death?","id":"tirmidhi-10-16"},{"hadith-eng":"The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"","reference":"Jami` at-Tirmidhi 981, Book 10, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the two Guardian Angels in Islamic belief?","id":"tirmidhi-10-17"},{"hadith-eng":"The Prophet said:  \"The believer dies with sweat on his brow.\"","reference":"Jami` at-Tirmidhi 982, Book 10, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a believer's state at the time of death in Islamic teachings?","id":"tirmidhi-10-18"},{"hadith-eng":"The Prophet entered upon a young man while he was dying. So he said: \"How do you feel?\" He said: \"By Allah! O Messenger of Allah! Indeed I hope in Allah and I fear from my sins.\" So the Messenger of Allah said: \"These two will not be gathered in a worshipper's heart at a time such as this, except that Allah will grant him what he hopes and make him safe from what he fears.\"","reference":"Jami` at-Tirmidhi 983, Book 10, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #1","question":"What emotions should a believer have when facing death according to Islamic teachings?","id":"tirmidhi-10-19"},{"hadith-eng":"The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"","reference":"Jami` at-Tirmidhi 984, Book 10, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of avoiding the practice of announcing one's death in Islam?","id":"tirmidhi-10-20"},{"hadith-eng":"(from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"","reference":"Jami` at-Tirmidhi 985, Book 10, Hadith 21","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of narrating hadiths in different forms, such as Marfu and non-Marfu?","id":"tirmidhi-10-21"},{"hadith-eng":"Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"","reference":"Jami` at-Tirmidhi 986, Book 10, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of avoiding self-announcement or self-promotion in Islamic teachings?","id":"tirmidhi-10-22"},{"hadith-eng":"The Messenger of Allah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 987, Book 10, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of patience in the face of adversity?","id":"tirmidhi-10-23"},{"hadith-eng":"The Messenger of Alllah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 988, Book 10, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of patience in the face of adversity?","id":"tirmidhi-10-24"},{"hadith-eng":"\"The Prophet kissed Uthman bin Maz'un when he died, and he was crying.\" Or, he (one of the narrators) said: \"His eyes were brimming with tears.\"","reference":"Jami` at-Tirmidhi 989, Book 10, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #1","question":"What does the Prophet's emotional response to the death of a companion indicate about his character?","id":"tirmidhi-10-25"},{"hadith-eng":"\"One of the daughters of the Prophet died, so he said: 'Wash her an odd number of times, three, or five, or more than that as you see fit. Wash her with water and Sidr, and in the last (washing) add camphor, or something from camphor. When you are finished then inform me.' When we finished we informed him so he gave us his waist-sheet and said 'Wrap her in it.'\"","reference":"Jami` at-Tirmidhi 990, Book 10, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of washing the deceased an odd number of times in Islamic funeral rites?","id":"tirmidhi-10-26"},{"hadith-eng":"The Messenger of Allah said: \"The best scent is the perfume of musk.\"","reference":"Jami` at-Tirmidhi 991, Book 10, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is considered the best type of perfume in Islamic tradition?","id":"tirmidhi-10-27"},{"hadith-eng":"The Prophet was asked about musk and he said: \"It is the best of your perfumes.\"","reference":"Jami` at-Tirmidhi 992, Book 10, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is considered the best type of perfume according to Islamic teachings?","id":"tirmidhi-10-28"},{"hadith-eng":"The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"","reference":"Jami` at-Tirmidhi 993, Book 10, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl after washing a deceased person in Islamic tradition?","id":"tirmidhi-10-29"},{"hadith-eng":"The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"","reference":"Jami` at-Tirmidhi 994, Book 10, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of wearing white garments in Islamic tradition?","id":"tirmidhi-10-30"},{"hadith-eng":"The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"","reference":"Jami` at-Tirmidhi 995, Book 10, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of using the best shroud for a deceased person in Islamic tradition?","id":"tirmidhi-10-31"},{"hadith-eng":"Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"","reference":"Jami` at-Tirmidhi 996, Book 10, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What were the materials used for the Prophet's shroud according to Aishah?","id":"tirmidhi-10-32"},{"hadith-eng":"\"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"","reference":"Jami` at-Tirmidhi 997, Book 10, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of shrouding in Islamic funeral practices?","id":"tirmidhi-10-33"},{"hadith-eng":"\"When the news of the death of Ja'far came, the Prophet said: 'Prepare some food for the family of Ja'far, for indeed something has happened to them that will keep them busy.'\"","reference":"Jami` at-Tirmidhi 998, Book 10, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of providing support to a grieving family in Islam?","id":"tirmidhi-10-34"},{"hadith-eng":"The Prophet said: \"He who slaps (his) cheeks, tears (his) clothes and calls with the call of the Jahliyyah is not one of us.\"","reference":"Jami` at-Tirmidhi 999, Book 10, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions are considered inappropriate during times of grief according to Islamic teachings?","id":"tirmidhi-10-35"},{"hadith-eng":"\"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"","reference":"Jami` at-Tirmidhi 1000, Book 10, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on wailing over the deceased?","id":"tirmidhi-10-36"},{"hadith-eng":"\"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"","reference":"Jami` at-Tirmidhi 1001, Book 10, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are some practices from the pre-Islamic period of ignorance that are discouraged in Islam?","id":"tirmidhi-10-37"},{"hadith-eng":"The Messenger of Allah said: \"The deceased is punished for the crying of his family over him.\"","reference":"Jami` at-Tirmidhi 1002, Book 10, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on mourning and its impact on the deceased?","id":"tirmidhi-10-38"},{"hadith-eng":"The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"","reference":"Jami` at-Tirmidhi 1003, Book 10, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of people's praises after someone's death in Islamic teachings?","id":"tirmidhi-10-39"},{"hadith-eng":"The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"","reference":"Jami` at-Tirmidhi 1004, Book 10, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of understanding the context when interpreting statements attributed to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-10-40"},{"hadith-eng":"\"The Prophet took Abdur-Rahman bin Awf by the hand and went with him to his son Ibrahim. He found him in his last breaths, so he took him and put him on his lap and cried. Abdur-Rahman said to him: 'You cry? Didn't you prohibit (your followers) from crying?' He said: 'No. But I prohibited two foolish immoral voices: A voice during a calamity while clawing at one's face and tearing one's clothes, and Shaitan's scream.'\" And there is more that is stated in the Hadith.","reference":"Jami` at-Tirmidhi 1005, Book 10, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the two types of voices that are considered foolish and immoral during a calamity?","id":"tirmidhi-10-41"},{"hadith-eng":"Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"","reference":"Jami` at-Tirmidhi 1006, Book 10, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of understanding the context and interpretation of hadiths in Islamic teachings?","id":"tirmidhi-10-42"},{"hadith-eng":"His father said: \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1007, Book 10, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of walking in front of a funeral procession in Islamic tradition?","id":"tirmidhi-10-43"},{"hadith-eng":"\"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1008, Book 10, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of walking in front of a funeral procession in Islamic tradition?","id":"tirmidhi-10-44"},{"hadith-eng":"\"The Prophet, Abu Bakr, and Umar would walk in front of the funeral.\" Az-Zuhri said: \"Salim informed me that his father would walk in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1009, Book 10, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of walking in front of a funeral procession in Islamic tradition?","id":"tirmidhi-10-45"},{"hadith-eng":"\"The Messenger of Allah would walk in front of the funeral, as did Abu Bakr, Umar and Uthman.\"","reference":"Jami` at-Tirmidhi 1010, Book 10, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of walking in front of a funeral procession in Islamic tradition?","id":"tirmidhi-10-46"},{"hadith-eng":"From Abdullah bin Mas'ud who said: \"We asked the Messenger of Allah about walking behind the funeral. He said: 'Less than a trot. For if he was good, then you will be hastening him to it (goodness), and if he was evil, then it id only an inhabitant of the Fire that is being taken away.\"  The funeral is (to be) followed. The one who precedes it shall not have the reward of those who follow it.'\"","reference":"Jami` at-Tirmidhi 1011, Book 10, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the recommended pace for walking behind a funeral procession in Islam?","id":"tirmidhi-10-47"},{"hadith-eng":"\"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"","reference":"Jami` at-Tirmidhi 1012, Book 10, Hadith 48","grade":"","question #":"question #1","question":"What is the significance of showing respect during a funeral procession in Islam?","id":"tirmidhi-10-48"},{"hadith-eng":"\"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"","reference":"Jami` at-Tirmidhi 1013, Book 10, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet's participation in funeral processions from this narration?","id":"tirmidhi-10-49"},{"hadith-eng":"\"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"","reference":"Jami` at-Tirmidhi 1014, Book 10, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions did the Prophet take during the funeral procession of Ibn Ad-Dahdah?","id":"tirmidhi-10-50"},{"hadith-eng":"The Prophet said: \"Hurry up with the funeral (procession) for if it was good, you are advancing it to good, and if it was evil, then you are taking it off your necks.\"","reference":"Jami` at-Tirmidhi 1015, Book 10, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of hastening the funeral procession in Islamic tradition?","id":"tirmidhi-10-51"},{"hadith-eng":"\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"","reference":"Jami` at-Tirmidhi 1016, Book 10, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #1","question":"What considerations did the Prophet Muhammad have regarding the burial of martyrs after the Battle of Uhud?","id":"tirmidhi-10-52"},{"hadith-eng":"\"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"","reference":"Jami` at-Tirmidhi 1017, Book 10, Hadith 53","grade":"Da'if(Darussalam)","question #":"question #1","question":"What actions did the Prophet Muhammad (ﷺ) take to demonstrate humility and simplicity in his daily life?","id":"tirmidhi-10-53"},{"hadith-eng":"\"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"","reference":"Jami` at-Tirmidhi 1018, Book 10, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of the location where the Prophet Muhammad was buried?","id":"tirmidhi-10-54"},{"hadith-eng":"\"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"","reference":"Jami` at-Tirmidhi 1020, Book 10, Hadith 56","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of differing from the practices of other religious communities in Islam?","id":"tirmidhi-10-55"},{"hadith-eng":"\"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"","reference":"Jami` at-Tirmidhi 1021, Book 10, Hadith 57","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of patience and praise in the face of personal loss according to Islamic teachings?","id":"tirmidhi-10-56"},{"hadith-eng":"\"The Prophet prayed and in the funeral prayer he for An-Najashi, said four Takbir.\"","reference":"Jami` at-Tirmidhi 1022, Book 10, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing a funeral prayer for someone who is not physically present?","id":"tirmidhi-10-57"},{"hadith-eng":"\"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"","reference":"Jami` at-Tirmidhi 1023, Book 10, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the number of Takbirs in funeral prayers in Islamic tradition?","id":"tirmidhi-10-58"},{"hadith-eng":"from his father who said: \"When the Messenger of Allah would perform  the Salat for the funeral he would said: (Allahammaghfir li-hayyina wa mayyittina, wa shahidina wa gha'ibina, wa saghirina wa kabirina, wa dhakarina wa unthana) 'O Allah! Forgive our living and our deceased, our present and our absent, our young and our old, our male and our female.'\"","reference":"Jami` at-Tirmidhi 1024, Book 10, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking forgiveness for both the living and the deceased in Islamic prayers?","id":"tirmidhi-10-59"},{"hadith-eng":"\"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"","reference":"Jami` at-Tirmidhi 1025, Book 10, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the supplications made by the Prophet Muhammad during the funeral prayer?","id":"tirmidhi-10-60"},{"hadith-eng":"\"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1026, Book 10, Hadith 62","grade":"","question #":"question #1","question":"What is the significance of reciting Surah Al-Fatiha in Islamic funeral prayers?","id":"tirmidhi-10-61"},{"hadith-eng":"\"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"","reference":"Jami` at-Tirmidhi 1027, Book 10, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reciting Surah Al-Fatiha during a funeral prayer?","id":"tirmidhi-10-62"},{"hadith-eng":"\"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"","reference":"Jami` at-Tirmidhi 1028, Book 10, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of forming rows during a funeral prayer in Islam?","id":"tirmidhi-10-63"},{"hadith-eng":"The Prophet said: \"No one among the Muslim dies, and Salat is performed for him by a community of Muslims reaching one hundred, and they intercede (supplicate) for him, except that their intercession for him is accepted.\" In his narration, 'Ali bin Hujr said: \"One hundred or more than that.\"","reference":"Jami` at-Tirmidhi 1029, Book 10, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a community of Muslims performing Salat for a deceased individual?","id":"tirmidhi-10-64"},{"hadith-eng":"\"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"","reference":"Jami` at-Tirmidhi 1030, Book 10, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the specific times during the day when performing Salat is prohibited?","id":"tirmidhi-10-65"},{"hadith-eng":"The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"","reference":"Jami` at-Tirmidhi 1031, Book 10, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the proper position for a rider during a funeral procession?","id":"tirmidhi-10-66"},{"hadith-eng":"The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"","reference":"Jami` at-Tirmidhi 1032, Book 10, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the conditions for a child to be eligible for inheritance in Islamic law?","id":"tirmidhi-10-67"},{"hadith-eng":"\"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"","reference":"Jami` at-Tirmidhi 1034, Book 10, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the position in which one stands during a funeral prayer?","id":"tirmidhi-10-68"},{"hadith-eng":"\"The Prophet prayed over a woman, so he stood at her middle.\"","reference":"Jami` at-Tirmidhi 1035, Book 10, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's position during the funeral prayer for a woman?","id":"tirmidhi-10-69"},{"hadith-eng":"Jabir bin Abdullah informed him that the Prophet had put two men together in one cloth from those who were killed at (the battle of) Uhud, then he said: \"Which of them memorized the more of the Qur'an?\" When one of them was indicated to him, he put him in the Lahd (first) and said: \"I am a witness for those people on the Day of Judgment.\" And he ordered that they be buried in their blood, and that they not be prayed over, nor washed.","reference":"Jami` at-Tirmidhi 1036, Book 10, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #1","question":"What criteria did the Prophet use to determine the order of burial for those who died in battle?","id":"tirmidhi-10-70"},{"hadith-eng":"Ash-Sha'bi said: \"I was informed by one who saw the Prophet: He (pbuh) saw a solitary grave, s he lined his Companions (behind him) to pray over it.\" It was said to him (Ash-Sha'bi): \"Who informed you?\" He said: \"Ibn Abbas.\"","reference":"Jami` at-Tirmidhi 1037, Book 10, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of praying over a solitary grave in Islamic tradition?","id":"tirmidhi-10-71"},{"hadith-eng":"\"Umm Sa'd died while the Prophet was absent. So when he arrived he performed Salat over her, and a month had already passed.\"","reference":"Jami` at-Tirmidhi 1038, Book 10, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of performing Salat over someone who has passed away?","id":"tirmidhi-10-72"},{"hadith-eng":"the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"","reference":"Jami` at-Tirmidhi 1039, Book 10, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Salat for a deceased person in Islam?","id":"tirmidhi-10-73"},{"hadith-eng":"The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"","reference":"Jami` at-Tirmidhi 1040, Book 10, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing the funeral prayer in Islam?","id":"tirmidhi-10-74"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up until it goes ahead of you or it is put down.\"","reference":"Jami` at-Tirmidhi 1042, Book 10, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of standing up when a funeral procession passes by?","id":"tirmidhi-10-75"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up (for it). Whoever follows it, then do not sit down until it is put down.\"","reference":"Jami` at-Tirmidhi 1043, Book 10, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of standing up when witnessing a funeral procession?","id":"tirmidhi-10-76"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas.Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).","reference":"Jami` at-Tirmidhi 1044, Book 10, Hadith 80","grade":"","question #":"question #1","question":"What is the significance of standing for a funeral procession in Islamic tradition?","id":"tirmidhi-10-77"},{"hadith-eng":"The Prophet said: \"The Lahd is for us and the hole is for other than us.\"","reference":"Jami` at-Tirmidhi 1045, Book 10, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Lahd in Islamic burial practices?","id":"tirmidhi-10-78"},{"hadith-eng":"\"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1046, Book 10, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the phrases recommended to say when placing a deceased person in the grave?","id":"tirmidhi-10-79"},{"hadith-eng":"His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1047, Book 10, Hadith 83","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who was responsible for making the Lahd in the grave of the Prophet Muhammad?","id":"tirmidhi-10-80"},{"hadith-eng":"\"A red velvet cloth was placed in the grave of the Prophet.\"","reference":"Jami` at-Tirmidhi 1048, Book 10, Hadith 84","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the use of a red velvet cloth in a grave hold in Islamic tradition?","id":"tirmidhi-10-81"},{"hadith-eng":"\"Ali said to Abu Al-Hayyaj Al-Asadi: 'I am dispatching you with what the Prophet dispatched me: \"That you not leave an elevated grave without leveling it, nor an image without erasing it.\"","reference":"Jami` at-Tirmidhi 1049, Book 10, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #1","question":"What instructions did the Prophet give regarding elevated graves?","id":"tirmidhi-10-82"},{"hadith-eng":"The Prophet said: \"Do not sit on the graves nor perform Salat towards them.\"","reference":"Jami` at-Tirmidhi 1050, Book 10, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on sitting on graves?","id":"tirmidhi-10-83"},{"hadith-eng":"from the Prophet, similar (to no. 1050), but it does not contain \"From Abu Idris\" and this is what is correct.","reference":"Jami` at-Tirmidhi 1051, Book 10, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of verifying the chain of narrators in hadith transmission?","id":"tirmidhi-10-84"},{"hadith-eng":"\"The Messenger of Allah prohibited plastering graves, writing on them, building over them, and treading on them.\"","reference":"Jami` at-Tirmidhi 1052, Book 10, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #1","question":"What actions are discouraged regarding the treatment of graves in Islamic teachings?","id":"tirmidhi-10-85"},{"hadith-eng":"\"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"","reference":"Jami` at-Tirmidhi 1053, Book 10, Hadith 89","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of greeting the inhabitants of the graves in Islam?","id":"tirmidhi-10-86"},{"hadith-eng":"The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"","reference":"Jami` at-Tirmidhi 1054, Book 10, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of visiting graves in Islam?","id":"tirmidhi-10-87"},{"hadith-eng":"\"Abdur-Rahman bin Abi Bakr died in Al-Hubshi\" He said: \"He was carried to Makkah to be buried there. So when Aishah arrived she went to the grave of Abdur-Rahman bin Abi Bakr and she said: \"We were like two drinking companions of Jadhimah for such a long time that they would say: 'They will never part.' So when we were separated it was as if I and Malik - due to the length of unity - never spent a night together.\"","reference":"Jami` at-Tirmidhi 1055, Book 10, Hadith 91","grade":"Da'if(Darussalam)","question #":"question #1","question":"What can be inferred about the bond between siblings from the relationship between Aishah and Abdur-Rahman bin Abi Bakr?","id":"tirmidhi-10-88"},{"hadith-eng":"\"Indeed the Messenger of Allah cursed the women who visit the graves.\"","reference":"Jami` at-Tirmidhi 1056, Book 10, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on women visiting graves?","id":"tirmidhi-10-89"},{"hadith-eng":"\"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"","reference":"Jami` at-Tirmidhi 1057, Book 10, Hadith 93","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of lighting a torch during a burial at night in Islamic tradition?","id":"tirmidhi-10-90"},{"hadith-eng":"\"A funeral (procession) passed by the Messenger of Allah and they were praising him with good statements. So the Messenger of Allah said: 'Granted.' Then he said: 'You are Allah's witnesses on the earth.'\"","reference":"Jami` at-Tirmidhi 1058, Book 10, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of community testimony in Islam regarding a person's character?","id":"tirmidhi-10-91"},{"hadith-eng":"\"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"","reference":"Jami` at-Tirmidhi 1059, Book 10, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of community testimony in determining a person's fate in the afterlife?","id":"tirmidhi-10-92"},{"hadith-eng":"The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"","reference":"Jami` at-Tirmidhi 1060, Book 10, Hadith 96","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of losing children in Islam in relation to the afterlife?","id":"tirmidhi-10-93"},{"hadith-eng":"The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"","reference":"Jami` at-Tirmidhi 1061, Book 10, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of children who pass away before reaching puberty in Islamic teachings?","id":"tirmidhi-10-94"},{"hadith-eng":"\"I heard my grandfather, the father of my mother, Simak bin Al-Walid Al-Hanadi narrating, that he heard Ibn Abbas narrated, that he heard the Messenger of Allah saying: \"Whoever has two predecessors (in death) among my Ummah, then Allah will admit them into Paradise.\"So Aishah said to him: \"What about one from your Ummar who has one precessor?\" He (pbuh) said: \"And whoever has one predecessor O Muwaffaqqah!\" So she said: \"What about one who does not have a predecessor from your Ummah?\" He said: \"I am the predecessor for my Ummah: you will never suffer (in grief) for (the loss of) anyone similar to me.\"","reference":"Jami` at-Tirmidhi 1062, Book 10, Hadith 98","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of having predecessors in death among the Ummah in Islam?","id":"tirmidhi-10-95"},{"hadith-eng":"The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"","reference":"Jami` at-Tirmidhi 1063, Book 10, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who are considered martyrs in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-10-96"},{"hadith-eng":"\"Sulaiman bin Surad said to Khalid bin Urfutah - or, Khalid said to Sulaiman - 'Did you hear the Messenger of Allah saying: \"Whoever is killed by his stomach then he will not be punished in the grave\"?' One of them said to the other: \"Yes.\"","reference":"Jami` at-Tirmidhi 1064, Book 10, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of being killed by one's stomach in Islamic teachings?","id":"tirmidhi-10-97"},{"hadith-eng":"The Prophet mentioned the plague and said: \"It is an abiding punishment or chastisement that was sent upon a group of the children of Isra'il. So when it occurs in a land while you are in it, then do not leave it. And when it occurs in a land while you are not in it, then do not enter it.\"","reference":"Jami` at-Tirmidhi 1065, Book 10, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance is provided for dealing with a plague in terms of movement and travel?","id":"tirmidhi-10-98"},{"hadith-eng":"The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1066, Book 10, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of loving to meet Allah in Islamic teachings?","id":"tirmidhi-10-99"},{"hadith-eng":"Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1067, Book 10, Hadith 103","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of loving to meet Allah in Islamic belief?","id":"tirmidhi-10-100"},{"hadith-eng":"\"A man killed himself, so the Prophet did not perform Salat over him.\"","reference":"Jami` at-Tirmidhi 1068, Book 10, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on performing funeral prayers for someone who has committed suicide?","id":"tirmidhi-10-101"},{"hadith-eng":"The Prophet was brought a (deceased) man to perform Salat over. So the Prophet said: \"Pray for your companion; for indeed he had a debt upon him.\" Abu Qatadah said: \"It shall be upon me.\" So the Messenger of Allah said: \"To pay it off?\" (He said: \"To pay it off.\") So he performed the prayer for him.","reference":"Jami` at-Tirmidhi 1069, Book 10, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fulfilling debts in Islam before performing funeral prayers?","id":"tirmidhi-10-102"},{"hadith-eng":"\"A deceased man would be brought to the Messenger of Allah while a debt was due upon him. So he would say: 'Has he left anything to pay off his debt?' If he was told that he had left something to pay it then he would pray (the funeral prayer) for him. Otherwise he would tell the Muslims: 'Pray for your companion.' So when Allah granted him the victories, he stood and said: 'I am more worthy in the case of the believers than they themselves are. So whoever among the believers dies and leaves a debt behind, then it is up to me to fulfill it. And whoever leaves wealth behind, then it is for his heirs.'\"","reference":"Jami` at-Tirmidhi 1070, Book 10, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the Prophet's approach to praying for a deceased person who had outstanding debts?","id":"tirmidhi-10-103"},{"hadith-eng":"The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"","reference":"Jami` at-Tirmidhi 1071, Book 10, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the questioning by the angels Munkar and Nakir in the grave?","id":"tirmidhi-10-104"},{"hadith-eng":"The Messenger of Allah said: \"When a person dies, he is shown his place [both in the morning and the evening]. If he is one of the people of Paradise; he is shown his place among the people of Paradise, and if he one of the people of the Fire; he is shown his place among the people of the Fire. Then it is said to him: 'This is your place until Allah resurrects you on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 1072, Book 10, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #1","question":"What happens to a person after death according to Islamic teachings?","id":"tirmidhi-10-105"},{"hadith-eng":"The Prophet said: \"Whoever consoles a person with an affliction, then he gets the same reward as him.\"","reference":"Jami` at-Tirmidhi 1073, Book 10, Hadith 109","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of offering consolation to someone who is afflicted?","id":"tirmidhi-10-106"},{"hadith-eng":"The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"","reference":"Jami` at-Tirmidhi 1074, Book 10, Hadith 110","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does the day of Friday hold in Islam regarding the afterlife?","id":"tirmidhi-10-107"},{"hadith-eng":"The Messenger of Allah said to him: \"O Ali! Three are not to be delayed: Salat when it is due, the funeral when it is presented, and (marriage) for the single woman when someone compatible is found.\"","reference":"Jami` at-Tirmidhi 1075, Book 10, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the actions that should not be delayed according to Islamic teachings?","id":"tirmidhi-10-108"},{"hadith-eng":"The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"","reference":"Jami` at-Tirmidhi 1076, Book 10, Hadith 112","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of consoling a bereaved mother in Islam?","id":"tirmidhi-10-109"},{"hadith-eng":"\"The Messenger of Allah said, 'Allahu Akbar' over the deceased, so he raised his hands with the first Takbir, and he placed his right (hand) over his left.\"","reference":"Jami` at-Tirmidhi 1077, Book 10, Hadith 113","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of saying 'Allahu Akbar' during the funeral prayer?","id":"tirmidhi-10-110"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1078, Book 10, Hadith 114","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of settling debts in Islam?","id":"tirmidhi-10-111"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1079, Book 10, Hadith 115","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of settling debts in Islam for a believer's soul?","id":"tirmidhi-10-112"},{"hadith-eng":"The Messenger of Allah said: \"The believer is not afflicted by the prick of a thorn or what is worse (or greater) than that, except that by it Allah raises him in rank and removes sin from him.\"","reference":"Jami` at-Tirmidhi 965, Book 10, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of minor afflictions, like the prick of a thorn, in a believer's life?","id":"tirmidhi-10-113"},{"hadith-eng":"The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"","reference":"Jami` at-Tirmidhi 966, Book 10, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of enduring diseases or worries in the life of a believer?","id":"tirmidhi-10-114"},{"hadith-eng":"the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"","reference":"Jami` at-Tirmidhi 967, Book 10, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does visiting a fellow Muslim relate to the concept of Paradise in Islamic teachings?","id":"tirmidhi-10-115"},{"hadith-eng":"The Prophet said similarly, but he added in it: \"They said: 'What is the Khurfah of Paradise?' And he said: \"Its harvest.\"","reference":"Jami` at-Tirmidhi 968, Book 10, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the concept of 'harvest' related to the rewards in Paradise?","id":"tirmidhi-10-116"},{"hadith-eng":"His father said: \"Ali took me by the hand and said: 'Come with us to pay a visit to Al-Hasan.' So we found that Abu Musa was with him.' Ali - peace be upon him - said: 'O Abu Musa! Did you come to visit (the sick) or merely (stop by to) visit?' He said: 'No, to visit (the sick).' So Ali said: 'I heard the Messenger of Allah saying: \"No Muslim visits (the sick) Muslims in the morning, except that sevety-thousand angels, sent Salat upon him until the evening, and he does not visit at night except that seventy thousand angels sent Salat upon him until the morning, and there will be a garden for him in Paradise.\"","reference":"Jami` at-Tirmidhi 969, Book 10, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #2","question":"How are angels involved when a Muslim visits a sick person, and what blessings do they bestow?","id":"tirmidhi-10-117"},{"hadith-eng":"\"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"","reference":"Jami` at-Tirmidhi 970, Book 10, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the financial status of some companions change after the time of the Prophet?","id":"tirmidhi-10-118"},{"hadith-eng":"The Prophet said that (a Hadith similar to no. 970).","reference":"Jami` at-Tirmidhi 971, Book 10, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the repetition of a hadith in different sources affect its authenticity and understanding?","id":"tirmidhi-10-119"},{"hadith-eng":"Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"","reference":"Jami` at-Tirmidhi 972, Book 10, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of Ruqyah play a role in Islamic healing practices?","id":"tirmidhi-10-120"},{"hadith-eng":"\"Thabit Al-Bunani and I entered upon Anas bin Malik, and Thabit said: 'O Abu Hamzah! I am suffering from an illness. So Anas said: 'Shall I not recite the Ruqyah of the Messenger of Allah over you?' He said: 'Why, yes.' He said: 'O Allah! Lord of mankind, removed the harm, and cure (him). Indeed You are the One Who cures, there is none who cures except you, a cure that leaves no disease.'\"","reference":"Jami` at-Tirmidhi 973, Book 10, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the invocation to Allah for healing reflect the belief in His power to cure?","id":"tirmidhi-10-121"},{"hadith-eng":"The Messenger of Allah said: \"A Muslim man has no right to spend two nights while he has something to will, except while his will is recorded with him.\"","reference":"Jami` at-Tirmidhi 974, Book 10, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important for a Muslim to not delay in writing their will?","id":"tirmidhi-10-122"},{"hadith-eng":"\"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"","reference":"Jami` at-Tirmidhi 975, Book 10, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam guide the distribution of wealth in a will, particularly concerning the welfare of one's children?","id":"tirmidhi-10-123"},{"hadith-eng":"The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'","reference":"Jami` at-Tirmidhi 976, Book 10, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to instruct the dying to say 'None has the right to be worshipped but Allah'?","id":"tirmidhi-10-124"},{"hadith-eng":"\"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 977, Book 10, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do angels respond to the words spoken by people around the sick or dying?","id":"tirmidhi-10-125"},{"hadith-eng":"\"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"","reference":"Jami` at-Tirmidhi 978, Book 10, Hadith 14","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) seek assistance from Allah during the throes of death?","id":"tirmidhi-10-126"},{"hadith-eng":"\"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 979, Book 10, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does witnessing the death of a loved one impact one's perception of death?","id":"tirmidhi-10-127"},{"hadith-eng":"\"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]","reference":"Jami` at-Tirmidhi 980, Book 10, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is sudden death compared to the death of a donkey in this narration?","id":"tirmidhi-10-128"},{"hadith-eng":"The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"","reference":"Jami` at-Tirmidhi 981, Book 10, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Allah respond to the deeds recorded by the Guardian Angels?","id":"tirmidhi-10-129"},{"hadith-eng":"The Prophet said:  \"The believer dies with sweat on his brow.\"","reference":"Jami` at-Tirmidhi 982, Book 10, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the concept of a believer's death portrayed in Islamic tradition?","id":"tirmidhi-10-130"},{"hadith-eng":"The Prophet entered upon a young man while he was dying. So he said: \"How do you feel?\" He said: \"By Allah! O Messenger of Allah! Indeed I hope in Allah and I fear from my sins.\" So the Messenger of Allah said: \"These two will not be gathered in a worshipper's heart at a time such as this, except that Allah will grant him what he hopes and make him safe from what he fears.\"","reference":"Jami` at-Tirmidhi 983, Book 10, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does hope in Allah and fear of one's sins influence a believer's state of mind during critical moments?","id":"tirmidhi-10-131"},{"hadith-eng":"The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"","reference":"Jami` at-Tirmidhi 984, Book 10, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the practice of announcing death related to the customs of Jahiliyyah?","id":"tirmidhi-10-132"},{"hadith-eng":"(from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"","reference":"Jami` at-Tirmidhi 985, Book 10, Hadith 21","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the omission of certain details, like 'An-Na'i is announcing of one's death,' affect the understanding of a hadith?","id":"tirmidhi-10-133"},{"hadith-eng":"Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"","reference":"Jami` at-Tirmidhi 986, Book 10, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is An-Na'i and why is it prohibited in Islam?","id":"tirmidhi-10-134"},{"hadith-eng":"The Messenger of Allah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 987, Book 10, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the timing of one's response to a calamity reflect their level of patience?","id":"tirmidhi-10-135"},{"hadith-eng":"The Messenger of Alllah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 988, Book 10, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does one's initial reaction to a calamity reflect their level of patience?","id":"tirmidhi-10-136"},{"hadith-eng":"\"The Prophet kissed Uthman bin Maz'un when he died, and he was crying.\" Or, he (one of the narrators) said: \"His eyes were brimming with tears.\"","reference":"Jami` at-Tirmidhi 989, Book 10, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the Prophet's reaction to the death of Uthman bin Maz'un reflect the Islamic perspective on expressing grief?","id":"tirmidhi-10-137"},{"hadith-eng":"\"One of the daughters of the Prophet died, so he said: 'Wash her an odd number of times, three, or five, or more than that as you see fit. Wash her with water and Sidr, and in the last (washing) add camphor, or something from camphor. When you are finished then inform me.' When we finished we informed him so he gave us his waist-sheet and said 'Wrap her in it.'\"","reference":"Jami` at-Tirmidhi 990, Book 10, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"What substances are recommended for use in the washing of a deceased body according to Islamic tradition?","id":"tirmidhi-10-138"},{"hadith-eng":"The Messenger of Allah said: \"The best scent is the perfume of musk.\"","reference":"Jami` at-Tirmidhi 991, Book 10, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is musk regarded in terms of its scent in Islamic teachings?","id":"tirmidhi-10-139"},{"hadith-eng":"The Prophet was asked about musk and he said: \"It is the best of your perfumes.\"","reference":"Jami` at-Tirmidhi 992, Book 10, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is musk regarded in the context of Islamic tradition and culture?","id":"tirmidhi-10-140"},{"hadith-eng":"The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"","reference":"Jami` at-Tirmidhi 993, Book 10, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is Wudu recommended for someone who carries a deceased person?","id":"tirmidhi-10-141"},{"hadith-eng":"The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"","reference":"Jami` at-Tirmidhi 994, Book 10, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why are white garments considered among the best according to Islamic teachings?","id":"tirmidhi-10-142"},{"hadith-eng":"The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"","reference":"Jami` at-Tirmidhi 995, Book 10, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the choice of shroud reflect one's respect and honor for the deceased?","id":"tirmidhi-10-143"},{"hadith-eng":"Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"","reference":"Jami` at-Tirmidhi 996, Book 10, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of using Yemeni cloths for shrouding in Islamic tradition?","id":"tirmidhi-10-144"},{"hadith-eng":"\"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"","reference":"Jami` at-Tirmidhi 997, Book 10, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was Hamzah bin Abdul-Muttalib and what is his importance in Islamic history?","id":"tirmidhi-10-145"},{"hadith-eng":"\"When the news of the death of Ja'far came, the Prophet said: 'Prepare some food for the family of Ja'far, for indeed something has happened to them that will keep them busy.'\"","reference":"Jami` at-Tirmidhi 998, Book 10, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does preparing food for a bereaved family reflect Islamic values of compassion and community support?","id":"tirmidhi-10-146"},{"hadith-eng":"The Prophet said: \"He who slaps (his) cheeks, tears (his) clothes and calls with the call of the Jahliyyah is not one of us.\"","reference":"Jami` at-Tirmidhi 999, Book 10, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the expression of excessive mourning and lamentation?","id":"tirmidhi-10-147"},{"hadith-eng":"\"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"","reference":"Jami` at-Tirmidhi 1000, Book 10, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does wailing affect the deceased according to Islamic teachings?","id":"tirmidhi-10-148"},{"hadith-eng":"\"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"","reference":"Jami` at-Tirmidhi 1001, Book 10, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the act of wailing and mourning excessively?","id":"tirmidhi-10-149"},{"hadith-eng":"The Messenger of Allah said: \"The deceased is punished for the crying of his family over him.\"","reference":"Jami` at-Tirmidhi 1002, Book 10, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the behavior of family members affect the deceased according to Islamic teachings?","id":"tirmidhi-10-150"},{"hadith-eng":"The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"","reference":"Jami` at-Tirmidhi 1003, Book 10, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do angels interact with the deceased according to Islamic beliefs?","id":"tirmidhi-10-151"},{"hadith-eng":"The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"","reference":"Jami` at-Tirmidhi 1004, Book 10, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #2","question":"How can misunderstandings arise in the transmission of hadiths, and what can be done to address them?","id":"tirmidhi-10-152"},{"hadith-eng":"\"The Prophet took Abdur-Rahman bin Awf by the hand and went with him to his son Ibrahim. He found him in his last breaths, so he took him and put him on his lap and cried. Abdur-Rahman said to him: 'You cry? Didn't you prohibit (your followers) from crying?' He said: 'No. But I prohibited two foolish immoral voices: A voice during a calamity while clawing at one's face and tearing one's clothes, and Shaitan's scream.'\" And there is more that is stated in the Hadith.","reference":"Jami` at-Tirmidhi 1005, Book 10, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad express his emotions upon seeing his son in his last breaths?","id":"tirmidhi-10-153"},{"hadith-eng":"Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"","reference":"Jami` at-Tirmidhi 1006, Book 10, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can misunderstandings occur in the transmission of hadiths, and what impact might they have?","id":"tirmidhi-10-154"},{"hadith-eng":"His father said: \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1007, Book 10, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad and his companions participate in funeral processions?","id":"tirmidhi-10-155"},{"hadith-eng":"\"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1008, Book 10, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad and his companions participate in funeral processions?","id":"tirmidhi-10-156"},{"hadith-eng":"\"The Prophet, Abu Bakr, and Umar would walk in front of the funeral.\" Az-Zuhri said: \"Salim informed me that his father would walk in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1009, Book 10, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad and his companions participate in funeral processions?","id":"tirmidhi-10-157"},{"hadith-eng":"\"The Messenger of Allah would walk in front of the funeral, as did Abu Bakr, Umar and Uthman.\"","reference":"Jami` at-Tirmidhi 1010, Book 10, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the early caliphs, such as Abu Bakr, Umar, and Uthman, participate in funeral processions?","id":"tirmidhi-10-158"},{"hadith-eng":"From Abdullah bin Mas'ud who said: \"We asked the Messenger of Allah about walking behind the funeral. He said: 'Less than a trot. For if he was good, then you will be hastening him to it (goodness), and if he was evil, then it id only an inhabitant of the Fire that is being taken away.\"  The funeral is (to be) followed. The one who precedes it shall not have the reward of those who follow it.'\"","reference":"Jami` at-Tirmidhi 1011, Book 10, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of following a funeral procession according to Islamic teachings?","id":"tirmidhi-10-159"},{"hadith-eng":"\"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"","reference":"Jami` at-Tirmidhi 1012, Book 10, Hadith 48","grade":"","question #":"question #2","question":"How do Islamic teachings view the behavior of riding animals during a funeral procession?","id":"tirmidhi-10-160"},{"hadith-eng":"\"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"","reference":"Jami` at-Tirmidhi 1013, Book 10, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet's mode of transportation during the funeral procession reflect his approach to such events?","id":"tirmidhi-10-161"},{"hadith-eng":"\"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"","reference":"Jami` at-Tirmidhi 1014, Book 10, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #2","question":"What modes of transportation did the Prophet use during the funeral of Ibn Ad-Dahdah?","id":"tirmidhi-10-162"},{"hadith-eng":"The Prophet said: \"Hurry up with the funeral (procession) for if it was good, you are advancing it to good, and if it was evil, then you are taking it off your necks.\"","reference":"Jami` at-Tirmidhi 1015, Book 10, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does advancing a good person to their reward relate to the concept of a funeral procession?","id":"tirmidhi-10-163"},{"hadith-eng":"\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"","reference":"Jami` at-Tirmidhi 1016, Book 10, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the scarcity of resources affect the burial process during the Battle of Uhud?","id":"tirmidhi-10-164"},{"hadith-eng":"\"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"","reference":"Jami` at-Tirmidhi 1017, Book 10, Hadith 53","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) show compassion and care for the sick and deceased?","id":"tirmidhi-10-165"},{"hadith-eng":"\"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"","reference":"Jami` at-Tirmidhi 1018, Book 10, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Abu Bakr contribute to the decision-making process regarding the Prophet's burial place?","id":"tirmidhi-10-166"},{"hadith-eng":"\"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"","reference":"Jami` at-Tirmidhi 1020, Book 10, Hadith 56","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the customs of other religious groups during funeral rites?","id":"tirmidhi-10-167"},{"hadith-eng":"\"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"","reference":"Jami` at-Tirmidhi 1021, Book 10, Hadith 57","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the death of a child in terms of spiritual reward for the parents?","id":"tirmidhi-10-168"},{"hadith-eng":"\"The Prophet prayed and in the funeral prayer he for An-Najashi, said four Takbir.\"","reference":"Jami` at-Tirmidhi 1022, Book 10, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many Takbirs are recited in the funeral prayer according to this practice?","id":"tirmidhi-10-169"},{"hadith-eng":"\"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"","reference":"Jami` at-Tirmidhi 1023, Book 10, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet ensure the accuracy of religious practices?","id":"tirmidhi-10-170"},{"hadith-eng":"from his father who said: \"When the Messenger of Allah would perform  the Salat for the funeral he would said: (Allahammaghfir li-hayyina wa mayyittina, wa shahidina wa gha'ibina, wa saghirina wa kabirina, wa dhakarina wa unthana) 'O Allah! Forgive our living and our deceased, our present and our absent, our young and our old, our male and our female.'\"","reference":"Jami` at-Tirmidhi 1024, Book 10, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the prayer for forgiveness encompass different groups of people, such as the present and absent, in Islamic tradition?","id":"tirmidhi-10-171"},{"hadith-eng":"\"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"","reference":"Jami` at-Tirmidhi 1025, Book 10, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad pray for the forgiveness and purification of the deceased?","id":"tirmidhi-10-172"},{"hadith-eng":"\"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1026, Book 10, Hadith 62","grade":"","question #":"question #2","question":"How does the recitation of Surah Al-Fatiha relate to the rituals of a funeral prayer?","id":"tirmidhi-10-173"},{"hadith-eng":"\"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"","reference":"Jami` at-Tirmidhi 1027, Book 10, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of reciting Surah Al-Fatiha in funeral prayers relate to the Sunnah?","id":"tirmidhi-10-174"},{"hadith-eng":"\"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"","reference":"Jami` at-Tirmidhi 1028, Book 10, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the number of rows in a funeral prayer affect its acceptance according to Islamic teachings?","id":"tirmidhi-10-175"},{"hadith-eng":"The Prophet said: \"No one among the Muslim dies, and Salat is performed for him by a community of Muslims reaching one hundred, and they intercede (supplicate) for him, except that their intercession for him is accepted.\" In his narration, 'Ali bin Hujr said: \"One hundred or more than that.\"","reference":"Jami` at-Tirmidhi 1029, Book 10, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the intercession of a group of Muslims affect the forgiveness of a deceased person?","id":"tirmidhi-10-176"},{"hadith-eng":"\"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"","reference":"Jami` at-Tirmidhi 1030, Book 10, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it discouraged to bury the dead during certain times of the day?","id":"tirmidhi-10-177"},{"hadith-eng":"The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"","reference":"Jami` at-Tirmidhi 1031, Book 10, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #2","question":"Where is a walker allowed to position themselves in a funeral procession?","id":"tirmidhi-10-178"},{"hadith-eng":"The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"","reference":"Jami` at-Tirmidhi 1032, Book 10, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of confirming a child's life at birth in Islamic rulings?","id":"tirmidhi-10-179"},{"hadith-eng":"\"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"","reference":"Jami` at-Tirmidhi 1034, Book 10, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did Anas bin Malik demonstrate the practice of the Prophet in funeral prayers?","id":"tirmidhi-10-180"},{"hadith-eng":"\"The Prophet prayed over a woman, so he stood at her middle.\"","reference":"Jami` at-Tirmidhi 1035, Book 10, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet's practice during funeral prayers reflect Islamic teachings on gender?","id":"tirmidhi-10-181"},{"hadith-eng":"Jabir bin Abdullah informed him that the Prophet had put two men together in one cloth from those who were killed at (the battle of) Uhud, then he said: \"Which of them memorized the more of the Qur'an?\" When one of them was indicated to him, he put him in the Lahd (first) and said: \"I am a witness for those people on the Day of Judgment.\" And he ordered that they be buried in their blood, and that they not be prayed over, nor washed.","reference":"Jami` at-Tirmidhi 1036, Book 10, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance does memorization of the Qur'an hold in Islamic tradition, especially in the context of this event?","id":"tirmidhi-10-182"},{"hadith-eng":"Ash-Sha'bi said: \"I was informed by one who saw the Prophet: He (pbuh) saw a solitary grave, s he lined his Companions (behind him) to pray over it.\" It was said to him (Ash-Sha'bi): \"Who informed you?\" He said: \"Ibn Abbas.\"","reference":"Jami` at-Tirmidhi 1037, Book 10, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (pbuh) demonstrate the importance of communal prayer in this context?","id":"tirmidhi-10-183"},{"hadith-eng":"\"Umm Sa'd died while the Prophet was absent. So when he arrived he performed Salat over her, and a month had already passed.\"","reference":"Jami` at-Tirmidhi 1038, Book 10, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #2","question":"How long after a person's death can Salat be performed according to Islamic teachings?","id":"tirmidhi-10-184"},{"hadith-eng":"the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"","reference":"Jami` at-Tirmidhi 1039, Book 10, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad instruct his companions to pray for someone who has passed away?","id":"tirmidhi-10-185"},{"hadith-eng":"The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"","reference":"Jami` at-Tirmidhi 1040, Book 10, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the reward for participating in a funeral prayer quantified in Islamic teachings?","id":"tirmidhi-10-186"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up until it goes ahead of you or it is put down.\"","reference":"Jami` at-Tirmidhi 1042, Book 10, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one behave when encountering a funeral procession according to Islamic teachings?","id":"tirmidhi-10-187"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up (for it). Whoever follows it, then do not sit down until it is put down.\"","reference":"Jami` at-Tirmidhi 1043, Book 10, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #2","question":"What etiquette should be observed by those following a funeral procession?","id":"tirmidhi-10-188"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas.Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).","reference":"Jami` at-Tirmidhi 1044, Book 10, Hadith 80","grade":"","question #":"question #2","question":"How did the practice of standing for a funeral procession change over time according to Islamic teachings?","id":"tirmidhi-10-189"},{"hadith-eng":"The Prophet said: \"The Lahd is for us and the hole is for other than us.\"","reference":"Jami` at-Tirmidhi 1045, Book 10, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the burial method differ between Muslims and others according to Islamic tradition?","id":"tirmidhi-10-190"},{"hadith-eng":"\"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1046, Book 10, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of mentioning Allah's name and command during the burial process?","id":"tirmidhi-10-191"},{"hadith-eng":"His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1047, Book 10, Hadith 83","grade":"Hasan(Darussalam)","question #":"question #2","question":"What role did Shuqran, the freed slave of the Prophet, play during the burial?","id":"tirmidhi-10-192"},{"hadith-eng":"\"A red velvet cloth was placed in the grave of the Prophet.\"","reference":"Jami` at-Tirmidhi 1048, Book 10, Hadith 84","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are burial practices for significant Islamic figures different from those of ordinary individuals?","id":"tirmidhi-10-193"},{"hadith-eng":"\"Ali said to Abu Al-Hayyaj Al-Asadi: 'I am dispatching you with what the Prophet dispatched me: \"That you not leave an elevated grave without leveling it, nor an image without erasing it.\"","reference":"Jami` at-Tirmidhi 1049, Book 10, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #2","question":"What actions are recommended concerning images according to the Prophet's guidance?","id":"tirmidhi-10-194"},{"hadith-eng":"The Prophet said: \"Do not sit on the graves nor perform Salat towards them.\"","reference":"Jami` at-Tirmidhi 1050, Book 10, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it discouraged to perform Salat towards graves in Islam?","id":"tirmidhi-10-195"},{"hadith-eng":"from the Prophet, similar (to no. 1050), but it does not contain \"From Abu Idris\" and this is what is correct.","reference":"Jami` at-Tirmidhi 1051, Book 10, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the accuracy of a hadith's chain of narration affect its authenticity?","id":"tirmidhi-10-196"},{"hadith-eng":"\"The Messenger of Allah prohibited plastering graves, writing on them, building over them, and treading on them.\"","reference":"Jami` at-Tirmidhi 1052, Book 10, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to avoid building structures over graves in Islam?","id":"tirmidhi-10-197"},{"hadith-eng":"\"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"","reference":"Jami` at-Tirmidhi 1053, Book 10, Hadith 89","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the relationship between the living and the deceased?","id":"tirmidhi-10-198"},{"hadith-eng":"The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"","reference":"Jami` at-Tirmidhi 1054, Book 10, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does visiting graves serve as a reminder of the Hereafter?","id":"tirmidhi-10-199"},{"hadith-eng":"\"Abdur-Rahman bin Abi Bakr died in Al-Hubshi\" He said: \"He was carried to Makkah to be buried there. So when Aishah arrived she went to the grave of Abdur-Rahman bin Abi Bakr and she said: \"We were like two drinking companions of Jadhimah for such a long time that they would say: 'They will never part.' So when we were separated it was as if I and Malik - due to the length of unity - never spent a night together.\"","reference":"Jami` at-Tirmidhi 1055, Book 10, Hadith 91","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the expression of grief and separation reflect in the words of Aishah at the grave of her brother?","id":"tirmidhi-10-200"},{"hadith-eng":"\"Indeed the Messenger of Allah cursed the women who visit the graves.\"","reference":"Jami` at-Tirmidhi 1056, Book 10, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the implications of a curse in Islamic teachings?","id":"tirmidhi-10-201"},{"hadith-eng":"\"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"","reference":"Jami` at-Tirmidhi 1057, Book 10, Hadith 93","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the direction of the Qiblah play a role in Islamic burial practices?","id":"tirmidhi-10-202"},{"hadith-eng":"\"A funeral (procession) passed by the Messenger of Allah and they were praising him with good statements. So the Messenger of Allah said: 'Granted.' Then he said: 'You are Allah's witnesses on the earth.'\"","reference":"Jami` at-Tirmidhi 1058, Book 10, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the praise of people at a funeral reflect on the deceased's life according to Islamic teachings?","id":"tirmidhi-10-203"},{"hadith-eng":"\"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"","reference":"Jami` at-Tirmidhi 1059, Book 10, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the testimony of others impact a Muslim's entry into Paradise?","id":"tirmidhi-10-204"},{"hadith-eng":"The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"","reference":"Jami` at-Tirmidhi 1060, Book 10, Hadith 96","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the loss of children affect a Muslim's experience in the Hereafter according to Islamic teachings?","id":"tirmidhi-10-205"},{"hadith-eng":"The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"","reference":"Jami` at-Tirmidhi 1061, Book 10, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the death of young children serve as a protection for their parents in the afterlife?","id":"tirmidhi-10-206"},{"hadith-eng":"\"I heard my grandfather, the father of my mother, Simak bin Al-Walid Al-Hanadi narrating, that he heard Ibn Abbas narrated, that he heard the Messenger of Allah saying: \"Whoever has two predecessors (in death) among my Ummah, then Allah will admit them into Paradise.\"So Aishah said to him: \"What about one from your Ummar who has one precessor?\" He (pbuh) said: \"And whoever has one predecessor O Muwaffaqqah!\" So she said: \"What about one who does not have a predecessor from your Ummah?\" He said: \"I am the predecessor for my Ummah: you will never suffer (in grief) for (the loss of) anyone similar to me.\"","reference":"Jami` at-Tirmidhi 1062, Book 10, Hadith 98","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of predecessors relate to the admission into Paradise?","id":"tirmidhi-10-207"},{"hadith-eng":"The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"","reference":"Jami` at-Tirmidhi 1063, Book 10, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the different causes of death that are regarded as martyrdom in Islamic tradition?","id":"tirmidhi-10-208"},{"hadith-eng":"\"Sulaiman bin Surad said to Khalid bin Urfutah - or, Khalid said to Sulaiman - 'Did you hear the Messenger of Allah saying: \"Whoever is killed by his stomach then he will not be punished in the grave\"?' One of them said to the other: \"Yes.\"","reference":"Jami` at-Tirmidhi 1064, Book 10, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #2","question":"What does Islamic tradition say about punishment in the grave for those who die due to stomach-related issues?","id":"tirmidhi-10-209"},{"hadith-eng":"The Prophet mentioned the plague and said: \"It is an abiding punishment or chastisement that was sent upon a group of the children of Isra'il. So when it occurs in a land while you are in it, then do not leave it. And when it occurs in a land while you are not in it, then do not enter it.\"","reference":"Jami` at-Tirmidhi 1065, Book 10, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the hadith describe the origin of the plague as a form of punishment?","id":"tirmidhi-10-210"},{"hadith-eng":"The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1066, Book 10, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does one's attitude towards meeting Allah reflect their relationship with Him?","id":"tirmidhi-10-211"},{"hadith-eng":"Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1067, Book 10, Hadith 103","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the anticipation of Allah's mercy and paradise affect a believer's attitude towards death?","id":"tirmidhi-10-212"},{"hadith-eng":"\"A man killed himself, so the Prophet did not perform Salat over him.\"","reference":"Jami` at-Tirmidhi 1068, Book 10, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the act of suicide affect the Islamic funeral rites for the deceased?","id":"tirmidhi-10-213"},{"hadith-eng":"The Prophet was brought a (deceased) man to perform Salat over. So the Prophet said: \"Pray for your companion; for indeed he had a debt upon him.\" Abu Qatadah said: \"It shall be upon me.\" So the Messenger of Allah said: \"To pay it off?\" (He said: \"To pay it off.\") So he performed the prayer for him.","reference":"Jami` at-Tirmidhi 1069, Book 10, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does taking responsibility for someone else's debt impact the community in Islamic teachings?","id":"tirmidhi-10-214"},{"hadith-eng":"\"A deceased man would be brought to the Messenger of Allah while a debt was due upon him. So he would say: 'Has he left anything to pay off his debt?' If he was told that he had left something to pay it then he would pray (the funeral prayer) for him. Otherwise he would tell the Muslims: 'Pray for your companion.' So when Allah granted him the victories, he stood and said: 'I am more worthy in the case of the believers than they themselves are. So whoever among the believers dies and leaves a debt behind, then it is up to me to fulfill it. And whoever leaves wealth behind, then it is for his heirs.'\"","reference":"Jami` at-Tirmidhi 1070, Book 10, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet handle the debts of deceased believers after the victories granted by Allah?","id":"tirmidhi-10-215"},{"hadith-eng":"The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"","reference":"Jami` at-Tirmidhi 1071, Book 10, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does one's belief and testimony about the Prophet Muhammad affect their experience in the grave?","id":"tirmidhi-10-216"},{"hadith-eng":"The Messenger of Allah said: \"When a person dies, he is shown his place [both in the morning and the evening]. If he is one of the people of Paradise; he is shown his place among the people of Paradise, and if he one of the people of the Fire; he is shown his place among the people of the Fire. Then it is said to him: 'This is your place until Allah resurrects you on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 1072, Book 10, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are the places of Paradise and Hell shown to individuals after they die?","id":"tirmidhi-10-217"},{"hadith-eng":"The Prophet said: \"Whoever consoles a person with an affliction, then he gets the same reward as him.\"","reference":"Jami` at-Tirmidhi 1073, Book 10, Hadith 109","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does consoling someone in distress benefit the consoler in terms of reward?","id":"tirmidhi-10-218"},{"hadith-eng":"The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"","reference":"Jami` at-Tirmidhi 1074, Book 10, Hadith 110","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does passing away on a specific day relate to protection from the trials of the grave?","id":"tirmidhi-10-219"},{"hadith-eng":"The Messenger of Allah said to him: \"O Ali! Three are not to be delayed: Salat when it is due, the funeral when it is presented, and (marriage) for the single woman when someone compatible is found.\"","reference":"Jami` at-Tirmidhi 1075, Book 10, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to perform Salat on time in Islam?","id":"tirmidhi-10-220"},{"hadith-eng":"The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"","reference":"Jami` at-Tirmidhi 1076, Book 10, Hadith 112","grade":"Da'if(Darussalam)","question #":"question #2","question":"What reward is promised for those who console someone in grief according to Islamic teachings?","id":"tirmidhi-10-221"},{"hadith-eng":"\"The Messenger of Allah said, 'Allahu Akbar' over the deceased, so he raised his hands with the first Takbir, and he placed his right (hand) over his left.\"","reference":"Jami` at-Tirmidhi 1077, Book 10, Hadith 113","grade":"Da'if(Darussalam)","question #":"question #2","question":"How should one position their hands during the funeral prayer according to the Prophet's practice?","id":"tirmidhi-10-222"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1078, Book 10, Hadith 114","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does debt affect a believer's soul according to Islamic teachings?","id":"tirmidhi-10-223"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1079, Book 10, Hadith 115","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does debt affect a believer's spiritual state according to Islamic teachings?","id":"tirmidhi-10-224"},{"hadith-eng":"The Messenger of Allah said: \"The believer is not afflicted by the prick of a thorn or what is worse (or greater) than that, except that by it Allah raises him in rank and removes sin from him.\"","reference":"Jami` at-Tirmidhi 965, Book 10, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"In what ways can suffering and challenges lead to the removal of sins for a believer?","id":"tirmidhi-10-225"},{"hadith-eng":"The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"","reference":"Jami` at-Tirmidhi 966, Book 10, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"In what ways can personal hardships lead to the removal of bad deeds for a believer?","id":"tirmidhi-10-226"},{"hadith-eng":"the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"","reference":"Jami` at-Tirmidhi 967, Book 10, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the spiritual benefits of maintaining brotherhood among Muslims?","id":"tirmidhi-10-227"},{"hadith-eng":"The Prophet said similarly, but he added in it: \"They said: 'What is the Khurfah of Paradise?' And he said: \"Its harvest.\"","reference":"Jami` at-Tirmidhi 968, Book 10, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance does the metaphor of 'harvest' hold in the context of Paradise?","id":"tirmidhi-10-228"},{"hadith-eng":"His father said: \"Ali took me by the hand and said: 'Come with us to pay a visit to Al-Hasan.' So we found that Abu Musa was with him.' Ali - peace be upon him - said: 'O Abu Musa! Did you come to visit (the sick) or merely (stop by to) visit?' He said: 'No, to visit (the sick).' So Ali said: 'I heard the Messenger of Allah saying: \"No Muslim visits (the sick) Muslims in the morning, except that sevety-thousand angels, sent Salat upon him until the evening, and he does not visit at night except that seventy thousand angels sent Salat upon him until the morning, and there will be a garden for him in Paradise.\"","reference":"Jami` at-Tirmidhi 969, Book 10, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the spiritual rewards for visiting a sick Muslim during the day or night?","id":"tirmidhi-10-229"},{"hadith-eng":"\"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"","reference":"Jami` at-Tirmidhi 970, Book 10, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on wishing for death during times of hardship?","id":"tirmidhi-10-230"},{"hadith-eng":"The Prophet said that (a Hadith similar to no. 970).","reference":"Jami` at-Tirmidhi 971, Book 10, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of Jami` at-Tirmidhi in the compilation of hadith literature?","id":"tirmidhi-10-231"},{"hadith-eng":"Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"","reference":"Jami` at-Tirmidhi 972, Book 10, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of invoking Allah's name in seeking protection and healing?","id":"tirmidhi-10-232"},{"hadith-eng":"\"Thabit Al-Bunani and I entered upon Anas bin Malik, and Thabit said: 'O Abu Hamzah! I am suffering from an illness. So Anas said: 'Shall I not recite the Ruqyah of the Messenger of Allah over you?' He said: 'Why, yes.' He said: 'O Allah! Lord of mankind, removed the harm, and cure (him). Indeed You are the One Who cures, there is none who cures except you, a cure that leaves no disease.'\"","reference":"Jami` at-Tirmidhi 973, Book 10, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does Anas bin Malik play in the transmission of prophetic practices related to healing?","id":"tirmidhi-10-233"},{"hadith-eng":"The Messenger of Allah said: \"A Muslim man has no right to spend two nights while he has something to will, except while his will is recorded with him.\"","reference":"Jami` at-Tirmidhi 974, Book 10, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam view the responsibility of managing one's affairs before death?","id":"tirmidhi-10-234"},{"hadith-eng":"\"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"","reference":"Jami` at-Tirmidhi 975, Book 10, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the recommended portion of wealth to be allocated in a will for charitable causes according to Islamic teachings?","id":"tirmidhi-10-235"},{"hadith-eng":"The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'","reference":"Jami` at-Tirmidhi 976, Book 10, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the declaration of faith impact a person's state at the time of death?","id":"tirmidhi-10-236"},{"hadith-eng":"\"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 977, Book 10, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What supplication did the Prophet Muhammad recommend when someone passes away?","id":"tirmidhi-10-237"},{"hadith-eng":"\"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"","reference":"Jami` at-Tirmidhi 978, Book 10, Hadith 14","grade":"Hasan(Darussalam)","question #":"question #3","question":"What does this narration indicate about the Prophet Muhammad's (ﷺ) experience with the agony of death?","id":"tirmidhi-10-238"},{"hadith-eng":"\"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 979, Book 10, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #3","question":"What insights does this narration provide about the Prophet's final moments?","id":"tirmidhi-10-239"},{"hadith-eng":"\"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]","reference":"Jami` at-Tirmidhi 980, Book 10, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the concept of sudden death relate to the understanding of a believer's passing?","id":"tirmidhi-10-240"},{"hadith-eng":"The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"","reference":"Jami` at-Tirmidhi 981, Book 10, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does it mean for Allah to find good in the beginning and end of a person's scroll?","id":"tirmidhi-10-241"},{"hadith-eng":"The Prophet said:  \"The believer dies with sweat on his brow.\"","reference":"Jami` at-Tirmidhi 982, Book 10, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the presence of sweat on a believer's brow at the time of death symbolize?","id":"tirmidhi-10-242"},{"hadith-eng":"The Prophet entered upon a young man while he was dying. So he said: \"How do you feel?\" He said: \"By Allah! O Messenger of Allah! Indeed I hope in Allah and I fear from my sins.\" So the Messenger of Allah said: \"These two will not be gathered in a worshipper's heart at a time such as this, except that Allah will grant him what he hopes and make him safe from what he fears.\"","reference":"Jami` at-Tirmidhi 983, Book 10, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of balancing hope and fear in a believer's heart?","id":"tirmidhi-10-243"},{"hadith-eng":"The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"","reference":"Jami` at-Tirmidhi 984, Book 10, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of following practices from the period of Jahiliyyah in Islam?","id":"tirmidhi-10-244"},{"hadith-eng":"(from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"","reference":"Jami` at-Tirmidhi 985, Book 10, Hadith 21","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of having multiple chains of narration for a single hadith?","id":"tirmidhi-10-245"},{"hadith-eng":"Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"","reference":"Jami` at-Tirmidhi 986, Book 10, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the fear of An-Na'i influence a person's behavior according to Islamic principles?","id":"tirmidhi-10-246"},{"hadith-eng":"The Messenger of Allah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 987, Book 10, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why is the initial reaction to a calamity considered crucial in demonstrating patience?","id":"tirmidhi-10-247"},{"hadith-eng":"The Messenger of Alllah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 988, Book 10, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is the first response to a calamity considered crucial in demonstrating patience?","id":"tirmidhi-10-248"},{"hadith-eng":"\"The Prophet kissed Uthman bin Maz'un when he died, and he was crying.\" Or, he (one of the narrators) said: \"His eyes were brimming with tears.\"","reference":"Jami` at-Tirmidhi 989, Book 10, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the relationship between the Prophet and his companions from his actions at the time of their death?","id":"tirmidhi-10-249"},{"hadith-eng":"\"One of the daughters of the Prophet died, so he said: 'Wash her an odd number of times, three, or five, or more than that as you see fit. Wash her with water and Sidr, and in the last (washing) add camphor, or something from camphor. When you are finished then inform me.' When we finished we informed him so he gave us his waist-sheet and said 'Wrap her in it.'\"","reference":"Jami` at-Tirmidhi 990, Book 10, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is camphor used in the final washing of a deceased person in Islamic practices?","id":"tirmidhi-10-250"},{"hadith-eng":"The Messenger of Allah said: \"The best scent is the perfume of musk.\"","reference":"Jami` at-Tirmidhi 991, Book 10, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance does fragrance hold in Islamic culture?","id":"tirmidhi-10-251"},{"hadith-eng":"The Prophet was asked about musk and he said: \"It is the best of your perfumes.\"","reference":"Jami` at-Tirmidhi 992, Book 10, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the characteristics of musk that make it highly valued in Islamic society?","id":"tirmidhi-10-252"},{"hadith-eng":"The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"","reference":"Jami` at-Tirmidhi 993, Book 10, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic jurisprudence address the purification rituals related to handling the deceased?","id":"tirmidhi-10-253"},{"hadith-eng":"The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"","reference":"Jami` at-Tirmidhi 994, Book 10, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the recommended attire for shrouding the deceased in Islam?","id":"tirmidhi-10-254"},{"hadith-eng":"The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"","reference":"Jami` at-Tirmidhi 995, Book 10, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the guidelines for shrouding a deceased person in Islam?","id":"tirmidhi-10-255"},{"hadith-eng":"Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"","reference":"Jami` at-Tirmidhi 996, Book 10, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did Aishah respond to the claims about the Prophet's shrouding garments?","id":"tirmidhi-10-256"},{"hadith-eng":"\"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"","reference":"Jami` at-Tirmidhi 997, Book 10, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is a Namirah cloth and what role does it play in Islamic burial customs?","id":"tirmidhi-10-257"},{"hadith-eng":"\"When the news of the death of Ja'far came, the Prophet said: 'Prepare some food for the family of Ja'far, for indeed something has happened to them that will keep them busy.'\"","reference":"Jami` at-Tirmidhi 998, Book 10, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions are recommended in Islam when a family experiences a loss?","id":"tirmidhi-10-258"},{"hadith-eng":"The Prophet said: \"He who slaps (his) cheeks, tears (his) clothes and calls with the call of the Jahliyyah is not one of us.\"","reference":"Jami` at-Tirmidhi 999, Book 10, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of avoiding pre-Islamic practices in expressing sorrow?","id":"tirmidhi-10-259"},{"hadith-eng":"\"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"","reference":"Jami` at-Tirmidhi 1000, Book 10, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What did the Prophet Muhammad (ﷺ) say about the consequences of wailing for the deceased?","id":"tirmidhi-10-260"},{"hadith-eng":"\"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"","reference":"Jami` at-Tirmidhi 1001, Book 10, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on attributing natural phenomena to celestial positions?","id":"tirmidhi-10-261"},{"hadith-eng":"The Messenger of Allah said: \"The deceased is punished for the crying of his family over him.\"","reference":"Jami` at-Tirmidhi 1002, Book 10, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of excessive lamentation for the deceased in Islam?","id":"tirmidhi-10-262"},{"hadith-eng":"The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"","reference":"Jami` at-Tirmidhi 1003, Book 10, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of angels in questioning the deceased?","id":"tirmidhi-10-263"},{"hadith-eng":"The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"","reference":"Jami` at-Tirmidhi 1004, Book 10, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role does Aishah play in clarifying misunderstandings related to the sayings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-10-264"},{"hadith-eng":"\"The Prophet took Abdur-Rahman bin Awf by the hand and went with him to his son Ibrahim. He found him in his last breaths, so he took him and put him on his lap and cried. Abdur-Rahman said to him: 'You cry? Didn't you prohibit (your followers) from crying?' He said: 'No. But I prohibited two foolish immoral voices: A voice during a calamity while clawing at one's face and tearing one's clothes, and Shaitan's scream.'\" And there is more that is stated in the Hadith.","reference":"Jami` at-Tirmidhi 1005, Book 10, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on expressing grief and sorrow during a calamity?","id":"tirmidhi-10-265"},{"hadith-eng":"Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"","reference":"Jami` at-Tirmidhi 1006, Book 10, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on the consequences faced by the deceased due to the actions of the living?","id":"tirmidhi-10-266"},{"hadith-eng":"His father said: \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1007, Book 10, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned from the actions of the Prophet, Abu Bakr, and Umar during a funeral?","id":"tirmidhi-10-267"},{"hadith-eng":"\"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1008, Book 10, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned from the actions of the Prophet, Abu Bakr, and Umar regarding funerals?","id":"tirmidhi-10-268"},{"hadith-eng":"\"The Prophet, Abu Bakr, and Umar would walk in front of the funeral.\" Az-Zuhri said: \"Salim informed me that his father would walk in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1009, Book 10, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned from the actions of Abu Bakr and Umar regarding funeral rites?","id":"tirmidhi-10-269"},{"hadith-eng":"\"The Messenger of Allah would walk in front of the funeral, as did Abu Bakr, Umar and Uthman.\"","reference":"Jami` at-Tirmidhi 1010, Book 10, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #3","question":"What practices did the Prophet Muhammad and his companions follow during funerals?","id":"tirmidhi-10-270"},{"hadith-eng":"From Abdullah bin Mas'ud who said: \"We asked the Messenger of Allah about walking behind the funeral. He said: 'Less than a trot. For if he was good, then you will be hastening him to it (goodness), and if he was evil, then it id only an inhabitant of the Fire that is being taken away.\"  The funeral is (to be) followed. The one who precedes it shall not have the reward of those who follow it.'\"","reference":"Jami` at-Tirmidhi 1011, Book 10, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the behavior of the deceased influence the urgency of the funeral procession?","id":"tirmidhi-10-271"},{"hadith-eng":"\"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"","reference":"Jami` at-Tirmidhi 1012, Book 10, Hadith 48","grade":"","question #":"question #3","question":"What role do angels play during a funeral according to Islamic beliefs?","id":"tirmidhi-10-272"},{"hadith-eng":"\"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"","reference":"Jami` at-Tirmidhi 1013, Book 10, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the Prophet's choice of a horse and its pace during the funeral procession signify?","id":"tirmidhi-10-273"},{"hadith-eng":"\"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"","reference":"Jami` at-Tirmidhi 1014, Book 10, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet demonstrate his participation in funeral rites?","id":"tirmidhi-10-274"},{"hadith-eng":"The Prophet said: \"Hurry up with the funeral (procession) for if it was good, you are advancing it to good, and if it was evil, then you are taking it off your necks.\"","reference":"Jami` at-Tirmidhi 1015, Book 10, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the implication of removing an evil person from the community through the funeral process?","id":"tirmidhi-10-275"},{"hadith-eng":"\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"","reference":"Jami` at-Tirmidhi 1016, Book 10, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #3","question":"What was the significance of determining who knew the most Quran in the burial process?","id":"tirmidhi-10-276"},{"hadith-eng":"\"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"","reference":"Jami` at-Tirmidhi 1017, Book 10, Hadith 53","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the acceptance of invitations from slaves by the Prophet Muhammad (ﷺ) signify about social equality in Islam?","id":"tirmidhi-10-277"},{"hadith-eng":"\"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"","reference":"Jami` at-Tirmidhi 1018, Book 10, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration suggest about the divine will in the burial of prophets?","id":"tirmidhi-10-278"},{"hadith-eng":"\"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"","reference":"Jami` at-Tirmidhi 1020, Book 10, Hadith 56","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions did the Prophet Muhammad (ﷺ) take when accompanying a funeral procession?","id":"tirmidhi-10-279"},{"hadith-eng":"\"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"","reference":"Jami` at-Tirmidhi 1021, Book 10, Hadith 57","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role do angels play in conveying the actions and words of believers to Allah?","id":"tirmidhi-10-280"},{"hadith-eng":"\"The Prophet prayed and in the funeral prayer he for An-Najashi, said four Takbir.\"","reference":"Jami` at-Tirmidhi 1022, Book 10, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #3","question":"Who was An-Najashi and why was a funeral prayer performed for him?","id":"tirmidhi-10-281"},{"hadith-eng":"\"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"","reference":"Jami` at-Tirmidhi 1023, Book 10, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"What might be the reasons for variations in the number of Takbirs during funeral prayers?","id":"tirmidhi-10-282"},{"hadith-eng":"from his father who said: \"When the Messenger of Allah would perform  the Salat for the funeral he would said: (Allahammaghfir li-hayyina wa mayyittina, wa shahidina wa gha'ibina, wa saghirina wa kabirina, wa dhakarina wa unthana) 'O Allah! Forgive our living and our deceased, our present and our absent, our young and our old, our male and our female.'\"","reference":"Jami` at-Tirmidhi 1024, Book 10, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it important to include both young and old, male and female, in prayers for forgiveness?","id":"tirmidhi-10-283"},{"hadith-eng":"\"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"","reference":"Jami` at-Tirmidhi 1025, Book 10, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of using metaphors like washing with snow or ice in prayers for the deceased?","id":"tirmidhi-10-284"},{"hadith-eng":"\"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1026, Book 10, Hadith 62","grade":"","question #":"question #3","question":"What are the components of a funeral prayer in Islam?","id":"tirmidhi-10-285"},{"hadith-eng":"\"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"","reference":"Jami` at-Tirmidhi 1027, Book 10, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the term 'completeness of the Sunnah' imply in the context of funeral prayers?","id":"tirmidhi-10-286"},{"hadith-eng":"\"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"","reference":"Jami` at-Tirmidhi 1028, Book 10, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions did Malik bin Hubairah take when there were few people at a funeral prayer?","id":"tirmidhi-10-287"},{"hadith-eng":"The Prophet said: \"No one among the Muslim dies, and Salat is performed for him by a community of Muslims reaching one hundred, and they intercede (supplicate) for him, except that their intercession for him is accepted.\" In his narration, 'Ali bin Hujr said: \"One hundred or more than that.\"","reference":"Jami` at-Tirmidhi 1029, Book 10, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the minimum number of Muslims required to perform Salat for their intercession to be accepted for a deceased?","id":"tirmidhi-10-288"},{"hadith-eng":"\"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"","reference":"Jami` at-Tirmidhi 1030, Book 10, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the sun's position in determining the permissibility of performing Salat?","id":"tirmidhi-10-289"},{"hadith-eng":"The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"","reference":"Jami` at-Tirmidhi 1031, Book 10, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #3","question":"Is it necessary to perform the funeral prayer for a child?","id":"tirmidhi-10-290"},{"hadith-eng":"The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"","reference":"Jami` at-Tirmidhi 1032, Book 10, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #3","question":"Under what circumstances is a funeral prayer not performed for a child in Islam?","id":"tirmidhi-10-291"},{"hadith-eng":"\"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"","reference":"Jami` at-Tirmidhi 1034, Book 10, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #3","question":"What differences are observed in the funeral prayer positions for men and women?","id":"tirmidhi-10-292"},{"hadith-eng":"\"The Prophet prayed over a woman, so he stood at her middle.\"","reference":"Jami` at-Tirmidhi 1035, Book 10, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's actions regarding the conduct of funeral prayers?","id":"tirmidhi-10-293"},{"hadith-eng":"Jabir bin Abdullah informed him that the Prophet had put two men together in one cloth from those who were killed at (the battle of) Uhud, then he said: \"Which of them memorized the more of the Qur'an?\" When one of them was indicated to him, he put him in the Lahd (first) and said: \"I am a witness for those people on the Day of Judgment.\" And he ordered that they be buried in their blood, and that they not be prayed over, nor washed.","reference":"Jami` at-Tirmidhi 1036, Book 10, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the practice of burying martyrs in their blood signify in Islamic teachings?","id":"tirmidhi-10-294"},{"hadith-eng":"Ash-Sha'bi said: \"I was informed by one who saw the Prophet: He (pbuh) saw a solitary grave, s he lined his Companions (behind him) to pray over it.\" It was said to him (Ash-Sha'bi): \"Who informed you?\" He said: \"Ibn Abbas.\"","reference":"Jami` at-Tirmidhi 1037, Book 10, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did Ibn Abbas play in conveying this particular event involving the Prophet?","id":"tirmidhi-10-295"},{"hadith-eng":"\"Umm Sa'd died while the Prophet was absent. So when he arrived he performed Salat over her, and a month had already passed.\"","reference":"Jami` at-Tirmidhi 1038, Book 10, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions did the Prophet take upon returning to find someone had passed away in his absence?","id":"tirmidhi-10-296"},{"hadith-eng":"the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"","reference":"Jami` at-Tirmidhi 1039, Book 10, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the procedure for lining up during the funeral prayer in Islamic tradition?","id":"tirmidhi-10-297"},{"hadith-eng":"The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"","reference":"Jami` at-Tirmidhi 1040, Book 10, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #3","question":"What additional reward is mentioned for following a funeral procession until burial?","id":"tirmidhi-10-298"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up until it goes ahead of you or it is put down.\"","reference":"Jami` at-Tirmidhi 1042, Book 10, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the etiquettes related to funeral processions in Islam?","id":"tirmidhi-10-299"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up (for it). Whoever follows it, then do not sit down until it is put down.\"","reference":"Jami` at-Tirmidhi 1043, Book 10, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it important not to sit down until the funeral is put down?","id":"tirmidhi-10-300"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas.Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).","reference":"Jami` at-Tirmidhi 1044, Book 10, Hadith 80","grade":"","question #":"question #3","question":"What are the views of different Islamic scholars on standing for a funeral procession?","id":"tirmidhi-10-301"},{"hadith-eng":"The Prophet said: \"The Lahd is for us and the hole is for other than us.\"","reference":"Jami` at-Tirmidhi 1045, Book 10, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the different types of graves mentioned in Islamic teachings?","id":"tirmidhi-10-302"},{"hadith-eng":"\"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1046, Book 10, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the burial practice reflect adherence to the teachings of the Prophet Muhammad?","id":"tirmidhi-10-303"},{"hadith-eng":"His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1047, Book 10, Hadith 83","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the velvet cloth placed under the Prophet in his grave?","id":"tirmidhi-10-304"},{"hadith-eng":"\"A red velvet cloth was placed in the grave of the Prophet.\"","reference":"Jami` at-Tirmidhi 1048, Book 10, Hadith 84","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the cultural or historical reasons for placing specific items in graves in Islamic history?","id":"tirmidhi-10-305"},{"hadith-eng":"\"Ali said to Abu Al-Hayyaj Al-Asadi: 'I am dispatching you with what the Prophet dispatched me: \"That you not leave an elevated grave without leveling it, nor an image without erasing it.\"","reference":"Jami` at-Tirmidhi 1049, Book 10, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #3","question":"Who was tasked with carrying out the Prophet's instructions in this narration?","id":"tirmidhi-10-306"},{"hadith-eng":"The Prophet said: \"Do not sit on the graves nor perform Salat towards them.\"","reference":"Jami` at-Tirmidhi 1050, Book 10, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the etiquettes of visiting graves according to Islamic teachings?","id":"tirmidhi-10-307"},{"hadith-eng":"from the Prophet, similar (to no. 1050), but it does not contain \"From Abu Idris\" and this is what is correct.","reference":"Jami` at-Tirmidhi 1051, Book 10, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it important to identify the correct narrators in a hadith?","id":"tirmidhi-10-308"},{"hadith-eng":"\"The Messenger of Allah prohibited plastering graves, writing on them, building over them, and treading on them.\"","reference":"Jami` at-Tirmidhi 1052, Book 10, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of not writing on graves according to Islamic tradition?","id":"tirmidhi-10-309"},{"hadith-eng":"\"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"","reference":"Jami` at-Tirmidhi 1053, Book 10, Hadith 89","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the importance of seeking forgiveness for both the living and the deceased?","id":"tirmidhi-10-310"},{"hadith-eng":"The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"","reference":"Jami` at-Tirmidhi 1054, Book 10, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why was there a prohibition on visiting graves initially in Islam?","id":"tirmidhi-10-311"},{"hadith-eng":"\"Abdur-Rahman bin Abi Bakr died in Al-Hubshi\" He said: \"He was carried to Makkah to be buried there. So when Aishah arrived she went to the grave of Abdur-Rahman bin Abi Bakr and she said: \"We were like two drinking companions of Jadhimah for such a long time that they would say: 'They will never part.' So when we were separated it was as if I and Malik - due to the length of unity - never spent a night together.\"","reference":"Jami` at-Tirmidhi 1055, Book 10, Hadith 91","grade":"Da'if(Darussalam)","question #":"question #3","question":"What cultural or historical significance might be attached to the reference of 'two drinking companions of Jadhimah' in expressing closeness?","id":"tirmidhi-10-312"},{"hadith-eng":"\"Indeed the Messenger of Allah cursed the women who visit the graves.\"","reference":"Jami` at-Tirmidhi 1056, Book 10, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islamic tradition view the act of visiting graves?","id":"tirmidhi-10-313"},{"hadith-eng":"\"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"","reference":"Jami` at-Tirmidhi 1057, Book 10, Hadith 93","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the importance of reciting the Qur'an in one's life according to Islamic teachings?","id":"tirmidhi-10-314"},{"hadith-eng":"\"A funeral (procession) passed by the Messenger of Allah and they were praising him with good statements. So the Messenger of Allah said: 'Granted.' Then he said: 'You are Allah's witnesses on the earth.'\"","reference":"Jami` at-Tirmidhi 1058, Book 10, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do witnesses play on earth in the context of Islamic beliefs about the afterlife?","id":"tirmidhi-10-315"},{"hadith-eng":"\"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"","reference":"Jami` at-Tirmidhi 1059, Book 10, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #3","question":"What did Umar bin Al-Khattab learn from the Prophet regarding the testimony of two or three people?","id":"tirmidhi-10-316"},{"hadith-eng":"The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"","reference":"Jami` at-Tirmidhi 1060, Book 10, Hadith 96","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the phrase 'except for what will fulfill the oath' imply in the context of a Muslim's afterlife?","id":"tirmidhi-10-317"},{"hadith-eng":"The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"","reference":"Jami` at-Tirmidhi 1061, Book 10, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the spiritual benefits mentioned for parents who lose children before they reach puberty?","id":"tirmidhi-10-318"},{"hadith-eng":"\"I heard my grandfather, the father of my mother, Simak bin Al-Walid Al-Hanadi narrating, that he heard Ibn Abbas narrated, that he heard the Messenger of Allah saying: \"Whoever has two predecessors (in death) among my Ummah, then Allah will admit them into Paradise.\"So Aishah said to him: \"What about one from your Ummar who has one precessor?\" He (pbuh) said: \"And whoever has one predecessor O Muwaffaqqah!\" So she said: \"What about one who does not have a predecessor from your Ummah?\" He said: \"I am the predecessor for my Ummah: you will never suffer (in grief) for (the loss of) anyone similar to me.\"","reference":"Jami` at-Tirmidhi 1062, Book 10, Hadith 98","grade":"Hasan(Darussalam)","question #":"question #3","question":"What reassurance does the Prophet Muhammad provide to those who have lost loved ones?","id":"tirmidhi-10-319"},{"hadith-eng":"The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"","reference":"Jami` at-Tirmidhi 1063, Book 10, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is dying from a plague viewed in terms of martyrdom in Islam?","id":"tirmidhi-10-320"},{"hadith-eng":"\"Sulaiman bin Surad said to Khalid bin Urfutah - or, Khalid said to Sulaiman - 'Did you hear the Messenger of Allah saying: \"Whoever is killed by his stomach then he will not be punished in the grave\"?' One of them said to the other: \"Yes.\"","reference":"Jami` at-Tirmidhi 1064, Book 10, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of punishment in the grave relate to the cause of death in Islamic belief?","id":"tirmidhi-10-321"},{"hadith-eng":"The Prophet mentioned the plague and said: \"It is an abiding punishment or chastisement that was sent upon a group of the children of Isra'il. So when it occurs in a land while you are in it, then do not leave it. And when it occurs in a land while you are not in it, then do not enter it.\"","reference":"Jami` at-Tirmidhi 1065, Book 10, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #3","question":"What historical context is given about the plague affecting the children of Isra'il?","id":"tirmidhi-10-322"},{"hadith-eng":"The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1066, Book 10, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of disliking the meeting with Allah according to Islamic beliefs?","id":"tirmidhi-10-323"},{"hadith-eng":"Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1067, Book 10, Hadith 103","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reaction of a believer when they receive the good news of Allah's mercy and pleasure?","id":"tirmidhi-10-324"},{"hadith-eng":"\"A man killed himself, so the Prophet did not perform Salat over him.\"","reference":"Jami` at-Tirmidhi 1068, Book 10, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of a religious leader choosing not to perform a funeral prayer for a particular individual?","id":"tirmidhi-10-325"},{"hadith-eng":"The Prophet was brought a (deceased) man to perform Salat over. So the Prophet said: \"Pray for your companion; for indeed he had a debt upon him.\" Abu Qatadah said: \"It shall be upon me.\" So the Messenger of Allah said: \"To pay it off?\" (He said: \"To pay it off.\") So he performed the prayer for him.","reference":"Jami` at-Tirmidhi 1069, Book 10, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which a deceased person may not have the funeral prayer performed for them?","id":"tirmidhi-10-326"},{"hadith-eng":"\"A deceased man would be brought to the Messenger of Allah while a debt was due upon him. So he would say: 'Has he left anything to pay off his debt?' If he was told that he had left something to pay it then he would pray (the funeral prayer) for him. Otherwise he would tell the Muslims: 'Pray for your companion.' So when Allah granted him the victories, he stood and said: 'I am more worthy in the case of the believers than they themselves are. So whoever among the believers dies and leaves a debt behind, then it is up to me to fulfill it. And whoever leaves wealth behind, then it is for his heirs.'\"","reference":"Jami` at-Tirmidhi 1070, Book 10, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #3","question":"What responsibility did the Prophet take upon himself regarding the debts of deceased believers?","id":"tirmidhi-10-327"},{"hadith-eng":"The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"","reference":"Jami` at-Tirmidhi 1071, Book 10, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences for a hypocrite when questioned in the grave according to Islamic teachings?","id":"tirmidhi-10-328"},{"hadith-eng":"The Messenger of Allah said: \"When a person dies, he is shown his place [both in the morning and the evening]. If he is one of the people of Paradise; he is shown his place among the people of Paradise, and if he one of the people of the Fire; he is shown his place among the people of the Fire. Then it is said to him: 'This is your place until Allah resurrects you on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 1072, Book 10, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of being shown one's place in the afterlife before the Day of Judgment?","id":"tirmidhi-10-329"},{"hadith-eng":"The Prophet said: \"Whoever consoles a person with an affliction, then he gets the same reward as him.\"","reference":"Jami` at-Tirmidhi 1073, Book 10, Hadith 109","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the spiritual benefits of supporting someone during their time of affliction?","id":"tirmidhi-10-330"},{"hadith-eng":"The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"","reference":"Jami` at-Tirmidhi 1074, Book 10, Hadith 110","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the trials of the grave that a Muslim seeks protection from?","id":"tirmidhi-10-331"},{"hadith-eng":"The Messenger of Allah said to him: \"O Ali! Three are not to be delayed: Salat when it is due, the funeral when it is presented, and (marriage) for the single woman when someone compatible is found.\"","reference":"Jami` at-Tirmidhi 1075, Book 10, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of promptly conducting a funeral in Islamic tradition?","id":"tirmidhi-10-332"},{"hadith-eng":"The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"","reference":"Jami` at-Tirmidhi 1076, Book 10, Hadith 112","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islam view the act of providing comfort to those who have lost a loved one?","id":"tirmidhi-10-333"},{"hadith-eng":"\"The Messenger of Allah said, 'Allahu Akbar' over the deceased, so he raised his hands with the first Takbir, and he placed his right (hand) over his left.\"","reference":"Jami` at-Tirmidhi 1077, Book 10, Hadith 113","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the importance of raising hands with the first Takbir in Islamic prayer rituals?","id":"tirmidhi-10-334"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1078, Book 10, Hadith 114","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the spiritual implications of leaving debts unsettled in Islam?","id":"tirmidhi-10-335"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1079, Book 10, Hadith 115","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of leaving debts unsettled for a Muslim after death?","id":"tirmidhi-10-336"},{"hadith-eng":"The Messenger of Allah said: \"The believer is not afflicted by the prick of a thorn or what is worse (or greater) than that, except that by it Allah raises him in rank and removes sin from him.\"","reference":"Jami` at-Tirmidhi 965, Book 10, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Allah use trials and tribulations to elevate the rank of a believer?","id":"tirmidhi-10-337"},{"hadith-eng":"The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"","reference":"Jami` at-Tirmidhi 966, Book 10, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of divine wisdom manifest in the trials faced by believers?","id":"tirmidhi-10-338"},{"hadith-eng":"the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"","reference":"Jami` at-Tirmidhi 967, Book 10, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the act of visiting a Muslim brother reflect on one's faith and character?","id":"tirmidhi-10-339"},{"hadith-eng":"The Prophet said similarly, but he added in it: \"They said: 'What is the Khurfah of Paradise?' And he said: \"Its harvest.\"","reference":"Jami` at-Tirmidhi 968, Book 10, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do metaphors enhance the understanding of spiritual concepts in Islam?","id":"tirmidhi-10-340"},{"hadith-eng":"His father said: \"Ali took me by the hand and said: 'Come with us to pay a visit to Al-Hasan.' So we found that Abu Musa was with him.' Ali - peace be upon him - said: 'O Abu Musa! Did you come to visit (the sick) or merely (stop by to) visit?' He said: 'No, to visit (the sick).' So Ali said: 'I heard the Messenger of Allah saying: \"No Muslim visits (the sick) Muslims in the morning, except that sevety-thousand angels, sent Salat upon him until the evening, and he does not visit at night except that seventy thousand angels sent Salat upon him until the morning, and there will be a garden for him in Paradise.\"","reference":"Jami` at-Tirmidhi 969, Book 10, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does visiting the sick relate to the concept of earning a place in Paradise?","id":"tirmidhi-10-341"},{"hadith-eng":"\"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"","reference":"Jami` at-Tirmidhi 970, Book 10, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does cauterization signify in the context of the trials faced by early Muslims?","id":"tirmidhi-10-342"},{"hadith-eng":"The Prophet said that (a Hadith similar to no. 970).","reference":"Jami` at-Tirmidhi 971, Book 10, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do scholars verify the authenticity of a hadith when it is mentioned in multiple narrations?","id":"tirmidhi-10-343"},{"hadith-eng":"Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"","reference":"Jami` at-Tirmidhi 972, Book 10, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the interaction between Jibril and the Prophet highlight the importance of spiritual care in Islam?","id":"tirmidhi-10-344"},{"hadith-eng":"\"Thabit Al-Bunani and I entered upon Anas bin Malik, and Thabit said: 'O Abu Hamzah! I am suffering from an illness. So Anas said: 'Shall I not recite the Ruqyah of the Messenger of Allah over you?' He said: 'Why, yes.' He said: 'O Allah! Lord of mankind, removed the harm, and cure (him). Indeed You are the One Who cures, there is none who cures except you, a cure that leaves no disease.'\"","reference":"Jami` at-Tirmidhi 973, Book 10, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the importance of seeking a cure that leaves no disease in Islamic supplications?","id":"tirmidhi-10-345"},{"hadith-eng":"The Messenger of Allah said: \"A Muslim man has no right to spend two nights while he has something to will, except while his will is recorded with him.\"","reference":"Jami` at-Tirmidhi 974, Book 10, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the potential consequences of not having a will documented in Islam?","id":"tirmidhi-10-346"},{"hadith-eng":"\"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"","reference":"Jami` at-Tirmidhi 975, Book 10, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to consider the financial well-being of one's heirs when drafting a will in Islam?","id":"tirmidhi-10-347"},{"hadith-eng":"The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'","reference":"Jami` at-Tirmidhi 976, Book 10, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the spiritual benefits of reciting 'La illaha illallah' during one's final moments?","id":"tirmidhi-10-348"},{"hadith-eng":"\"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 977, Book 10, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can one seek a good replacement after the loss of a loved one according to Islamic teachings?","id":"tirmidhi-10-349"},{"hadith-eng":"\"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"","reference":"Jami` at-Tirmidhi 978, Book 10, Hadith 14","grade":"Hasan(Darussalam)","question #":"question #4","question":"What significance does water have in the actions of the Prophet Muhammad (ﷺ) during his last moments?","id":"tirmidhi-10-350"},{"hadith-eng":"\"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 979, Book 10, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #4","question":"How might the severity of a person's death influence the feelings of those around them?","id":"tirmidhi-10-351"},{"hadith-eng":"\"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]","reference":"Jami` at-Tirmidhi 980, Book 10, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #4","question":"What can be inferred about the nature of death for a believer from this narration?","id":"tirmidhi-10-352"},{"hadith-eng":"The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"","reference":"Jami` at-Tirmidhi 981, Book 10, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #4","question":"What assurance does Allah give regarding the forgiveness of a servant's deeds?","id":"tirmidhi-10-353"},{"hadith-eng":"The Prophet said:  \"The believer dies with sweat on his brow.\"","reference":"Jami` at-Tirmidhi 982, Book 10, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic tradition describe the physical signs of a believer's passing?","id":"tirmidhi-10-354"},{"hadith-eng":"The Prophet entered upon a young man while he was dying. So he said: \"How do you feel?\" He said: \"By Allah! O Messenger of Allah! Indeed I hope in Allah and I fear from my sins.\" So the Messenger of Allah said: \"These two will not be gathered in a worshipper's heart at a time such as this, except that Allah will grant him what he hopes and make him safe from what he fears.\"","reference":"Jami` at-Tirmidhi 983, Book 10, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Allah respond to a believer who hopes in Him and fears his sins at the time of death?","id":"tirmidhi-10-355"},{"hadith-eng":"The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"","reference":"Jami` at-Tirmidhi 984, Book 10, Hadith 20","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to be cautious about certain cultural practices in light of Islamic teachings?","id":"tirmidhi-10-356"},{"hadith-eng":"(from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"","reference":"Jami` at-Tirmidhi 985, Book 10, Hadith 21","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might a narrator choose to omit certain elements when recounting a hadith?","id":"tirmidhi-10-357"},{"hadith-eng":"Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"","reference":"Jami` at-Tirmidhi 986, Book 10, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the potential consequences of engaging in An-Na'i in a Muslim community?","id":"tirmidhi-10-358"},{"hadith-eng":"The Messenger of Allah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 987, Book 10, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"What can be learned about the nature of true patience from one's immediate response to difficulties?","id":"tirmidhi-10-359"},{"hadith-eng":"The Messenger of Alllah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 988, Book 10, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does it mean to have 'real' patience during difficult times?","id":"tirmidhi-10-360"},{"hadith-eng":"\"The Prophet kissed Uthman bin Maz'un when he died, and he was crying.\" Or, he (one of the narrators) said: \"His eyes were brimming with tears.\"","reference":"Jami` at-Tirmidhi 989, Book 10, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the Prophet's behavior at the death of a companion illustrate the human aspect of his personality?","id":"tirmidhi-10-361"},{"hadith-eng":"\"One of the daughters of the Prophet died, so he said: 'Wash her an odd number of times, three, or five, or more than that as you see fit. Wash her with water and Sidr, and in the last (washing) add camphor, or something from camphor. When you are finished then inform me.' When we finished we informed him so he gave us his waist-sheet and said 'Wrap her in it.'\"","reference":"Jami` at-Tirmidhi 990, Book 10, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the importance of informing the family or responsible person after completing the washing of the deceased?","id":"tirmidhi-10-362"},{"hadith-eng":"The Prophet was asked about musk and he said: \"It is the best of your perfumes.\"","reference":"Jami` at-Tirmidhi 992, Book 10, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the use of perfumes?","id":"tirmidhi-10-363"},{"hadith-eng":"The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"","reference":"Jami` at-Tirmidhi 993, Book 10, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the different purification practices required when dealing with a deceased body in Islam?","id":"tirmidhi-10-364"},{"hadith-eng":"The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"","reference":"Jami` at-Tirmidhi 994, Book 10, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the choice of garment color relate to Islamic practices for the living and the deceased?","id":"tirmidhi-10-365"},{"hadith-eng":"The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"","reference":"Jami` at-Tirmidhi 995, Book 10, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to consider the quality of the shroud in Islamic burial practices?","id":"tirmidhi-10-366"},{"hadith-eng":"Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"","reference":"Jami` at-Tirmidhi 996, Book 10, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the refusal to use a Burd in the Prophet's shroud indicate about the companions' choices?","id":"tirmidhi-10-367"},{"hadith-eng":"\"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"","reference":"Jami` at-Tirmidhi 997, Book 10, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (ﷺ) conduct funeral rites for his companions?","id":"tirmidhi-10-368"},{"hadith-eng":"\"When the news of the death of Ja'far came, the Prophet said: 'Prepare some food for the family of Ja'far, for indeed something has happened to them that will keep them busy.'\"","reference":"Jami` at-Tirmidhi 998, Book 10, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #4","question":"How can the community assist a family that is dealing with a significant event or loss?","id":"tirmidhi-10-369"},{"hadith-eng":"The Prophet said: \"He who slaps (his) cheeks, tears (his) clothes and calls with the call of the Jahliyyah is not one of us.\"","reference":"Jami` at-Tirmidhi 999, Book 10, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"What behaviors are discouraged in Islam when dealing with loss or tragedy?","id":"tirmidhi-10-370"},{"hadith-eng":"\"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"","reference":"Jami` at-Tirmidhi 1000, Book 10, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions did Al-Mughirah bin Shu'bah take to address the issue of wailing in the community?","id":"tirmidhi-10-371"},{"hadith-eng":"\"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"","reference":"Jami` at-Tirmidhi 1001, Book 10, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is slandering one's lineage considered a negative practice in Islam?","id":"tirmidhi-10-372"},{"hadith-eng":"The Messenger of Allah said: \"The deceased is punished for the crying of his family over him.\"","reference":"Jami` at-Tirmidhi 1002, Book 10, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"How should Muslims conduct themselves during the mourning period to avoid causing harm to the deceased?","id":"tirmidhi-10-373"},{"hadith-eng":"The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"","reference":"Jami` at-Tirmidhi 1003, Book 10, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does public perception of a person's character affect their afterlife in Islam?","id":"tirmidhi-10-374"},{"hadith-eng":"The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"","reference":"Jami` at-Tirmidhi 1004, Book 10, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the cultural or religious background of individuals mentioned in hadiths affect their interpretation?","id":"tirmidhi-10-375"},{"hadith-eng":"\"The Prophet took Abdur-Rahman bin Awf by the hand and went with him to his son Ibrahim. He found him in his last breaths, so he took him and put him on his lap and cried. Abdur-Rahman said to him: 'You cry? Didn't you prohibit (your followers) from crying?' He said: 'No. But I prohibited two foolish immoral voices: A voice during a calamity while clawing at one's face and tearing one's clothes, and Shaitan's scream.'\" And there is more that is stated in the Hadith.","reference":"Jami` at-Tirmidhi 1005, Book 10, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #4","question":"What actions are discouraged in Islam when facing a calamity or loss?","id":"tirmidhi-10-376"},{"hadith-eng":"Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"","reference":"Jami` at-Tirmidhi 1006, Book 10, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the example of the Jewish woman illustrate the concept of punishment in the grave?","id":"tirmidhi-10-377"},{"hadith-eng":"His father said: \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1007, Book 10, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of community leaders in funeral rites according to Islamic teachings?","id":"tirmidhi-10-378"},{"hadith-eng":"\"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1008, Book 10, Hadith 44","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of community leaders in funeral rites according to Islamic teachings?","id":"tirmidhi-10-379"},{"hadith-eng":"\"The Prophet, Abu Bakr, and Umar would walk in front of the funeral.\" Az-Zuhri said: \"Salim informed me that his father would walk in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1009, Book 10, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role does following the example of the Prophet and his companions play in Islamic funeral practices?","id":"tirmidhi-10-380"},{"hadith-eng":"\"The Messenger of Allah would walk in front of the funeral, as did Abu Bakr, Umar and Uthman.\"","reference":"Jami` at-Tirmidhi 1010, Book 10, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #4","question":"What can be learned from the actions of the Prophet and his companions regarding funeral rites?","id":"tirmidhi-10-381"},{"hadith-eng":"From Abdullah bin Mas'ud who said: \"We asked the Messenger of Allah about walking behind the funeral. He said: 'Less than a trot. For if he was good, then you will be hastening him to it (goodness), and if he was evil, then it id only an inhabitant of the Fire that is being taken away.\"  The funeral is (to be) followed. The one who precedes it shall not have the reward of those who follow it.'\"","reference":"Jami` at-Tirmidhi 1011, Book 10, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the consequence of preceding a funeral procession in terms of spiritual reward?","id":"tirmidhi-10-382"},{"hadith-eng":"\"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"","reference":"Jami` at-Tirmidhi 1012, Book 10, Hadith 48","grade":"","question #":"question #4","question":"Why might it be considered disrespectful to ride on animals during a funeral procession?","id":"tirmidhi-10-383"},{"hadith-eng":"\"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"","reference":"Jami` at-Tirmidhi 1013, Book 10, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet behave during the funeral procession according to this account?","id":"tirmidhi-10-384"},{"hadith-eng":"\"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"","reference":"Jami` at-Tirmidhi 1014, Book 10, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's behavior during funerals from his actions?","id":"tirmidhi-10-385"},{"hadith-eng":"The Prophet said: \"Hurry up with the funeral (procession) for if it was good, you are advancing it to good, and if it was evil, then you are taking it off your necks.\"","reference":"Jami` at-Tirmidhi 1015, Book 10, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of good and evil influence the handling of a deceased person's funeral?","id":"tirmidhi-10-386"},{"hadith-eng":"\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"","reference":"Jami` at-Tirmidhi 1016, Book 10, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the hadith imply about the Prophet's concern for the feelings of the bereaved, such as Safiyyah?","id":"tirmidhi-10-387"},{"hadith-eng":"\"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"","reference":"Jami` at-Tirmidhi 1017, Book 10, Hadith 53","grade":"Da'if(Darussalam)","question #":"question #4","question":"What can be learned from the Prophet Muhammad's (ﷺ) choice of transportation regarding his lifestyle?","id":"tirmidhi-10-388"},{"hadith-eng":"\"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"","reference":"Jami` at-Tirmidhi 1018, Book 10, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role did the companions play in the burial of the Prophet Muhammad?","id":"tirmidhi-10-389"},{"hadith-eng":"\"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"","reference":"Jami` at-Tirmidhi 1020, Book 10, Hadith 56","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the importance of the Lahd in Islamic burial practices?","id":"tirmidhi-10-390"},{"hadith-eng":"\"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"","reference":"Jami` at-Tirmidhi 1021, Book 10, Hadith 57","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the concept of 'the house of praise' in Paradise and how is it earned?","id":"tirmidhi-10-391"},{"hadith-eng":"\"The Prophet prayed and in the funeral prayer he for An-Najashi, said four Takbir.\"","reference":"Jami` at-Tirmidhi 1022, Book 10, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this practice indicate about the inclusivity of funeral prayers in Islam?","id":"tirmidhi-10-392"},{"hadith-eng":"\"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"","reference":"Jami` at-Tirmidhi 1023, Book 10, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do the actions of the Prophet influence Islamic funeral rites?","id":"tirmidhi-10-393"},{"hadith-eng":"from his father who said: \"When the Messenger of Allah would perform  the Salat for the funeral he would said: (Allahammaghfir li-hayyina wa mayyittina, wa shahidina wa gha'ibina, wa saghirina wa kabirina, wa dhakarina wa unthana) 'O Allah! Forgive our living and our deceased, our present and our absent, our young and our old, our male and our female.'\"","reference":"Jami` at-Tirmidhi 1024, Book 10, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this supplication indicate about the inclusivity of Islamic prayers for the community?","id":"tirmidhi-10-394"},{"hadith-eng":"\"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"","reference":"Jami` at-Tirmidhi 1025, Book 10, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's compassion and concern for the deceased from his prayers?","id":"tirmidhi-10-395"},{"hadith-eng":"\"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1026, Book 10, Hadith 62","grade":"","question #":"question #4","question":"What is the role of Surah Al-Fatiha in Islamic prayers?","id":"tirmidhi-10-396"},{"hadith-eng":"\"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"","reference":"Jami` at-Tirmidhi 1027, Book 10, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might Ibn Abbas have emphasized the recitation of Surah Al-Fatiha in funeral prayers?","id":"tirmidhi-10-397"},{"hadith-eng":"\"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"","reference":"Jami` at-Tirmidhi 1028, Book 10, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #4","question":"What did the Prophet Muhammad (ﷺ) say about the reward for having three rows in a funeral prayer?","id":"tirmidhi-10-398"},{"hadith-eng":"The Prophet said: \"No one among the Muslim dies, and Salat is performed for him by a community of Muslims reaching one hundred, and they intercede (supplicate) for him, except that their intercession for him is accepted.\" In his narration, 'Ali bin Hujr said: \"One hundred or more than that.\"","reference":"Jami` at-Tirmidhi 1029, Book 10, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does supplication play in the acceptance of intercession for a deceased Muslim?","id":"tirmidhi-10-399"},{"hadith-eng":"\"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"","reference":"Jami` at-Tirmidhi 1030, Book 10, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the prohibition of Salat at certain times reflect on the daily routine of a Muslim?","id":"tirmidhi-10-400"},{"hadith-eng":"The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"","reference":"Jami` at-Tirmidhi 1031, Book 10, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the etiquettes of participating in a funeral procession?","id":"tirmidhi-10-401"},{"hadith-eng":"The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"","reference":"Jami` at-Tirmidhi 1032, Book 10, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic law determine the inheritance rights of a newborn?","id":"tirmidhi-10-402"},{"hadith-eng":"\"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"","reference":"Jami` at-Tirmidhi 1034, Book 10, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to remember the practices of the Prophet in religious rituals?","id":"tirmidhi-10-403"},{"hadith-eng":"\"The Prophet prayed over a woman, so he stood at her middle.\"","reference":"Jami` at-Tirmidhi 1035, Book 10, Hadith 71","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the position of the imam during a funeral prayer vary based on the deceased's gender?","id":"tirmidhi-10-404"},{"hadith-eng":"Jabir bin Abdullah informed him that the Prophet had put two men together in one cloth from those who were killed at (the battle of) Uhud, then he said: \"Which of them memorized the more of the Qur'an?\" When one of them was indicated to him, he put him in the Lahd (first) and said: \"I am a witness for those people on the Day of Judgment.\" And he ordered that they be buried in their blood, and that they not be prayed over, nor washed.","reference":"Jami` at-Tirmidhi 1036, Book 10, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why were the martyrs of the battle not prayed over or washed before burial according to Islamic tradition?","id":"tirmidhi-10-405"},{"hadith-eng":"Ash-Sha'bi said: \"I was informed by one who saw the Prophet: He (pbuh) saw a solitary grave, s he lined his Companions (behind him) to pray over it.\" It was said to him (Ash-Sha'bi): \"Who informed you?\" He said: \"Ibn Abbas.\"","reference":"Jami` at-Tirmidhi 1037, Book 10, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might it be important to know who informed Ash-Sha'bi about the event involving the Prophet?","id":"tirmidhi-10-406"},{"hadith-eng":"\"Umm Sa'd died while the Prophet was absent. So when he arrived he performed Salat over her, and a month had already passed.\"","reference":"Jami` at-Tirmidhi 1038, Book 10, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does this narration imply about the timing and permissibility of funeral prayers in Islam?","id":"tirmidhi-10-407"},{"hadith-eng":"the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"","reference":"Jami` at-Tirmidhi 1039, Book 10, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the practice of praying for a deceased person indicate about the Islamic view on community and brotherhood?","id":"tirmidhi-10-408"},{"hadith-eng":"The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"","reference":"Jami` at-Tirmidhi 1040, Book 10, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of Qirat relate to the rewards for funeral prayers?","id":"tirmidhi-10-409"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up until it goes ahead of you or it is put down.\"","reference":"Jami` at-Tirmidhi 1042, Book 10, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to show respect during a funeral procession?","id":"tirmidhi-10-410"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up (for it). Whoever follows it, then do not sit down until it is put down.\"","reference":"Jami` at-Tirmidhi 1043, Book 10, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does standing for a funeral procession reflect respect for the deceased?","id":"tirmidhi-10-411"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas.Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).","reference":"Jami` at-Tirmidhi 1044, Book 10, Hadith 80","grade":"","question #":"question #4","question":"How does abrogation play a role in the practice of standing for a funeral procession?","id":"tirmidhi-10-412"},{"hadith-eng":"The Prophet said: \"The Lahd is for us and the hole is for other than us.\"","reference":"Jami` at-Tirmidhi 1045, Book 10, Hadith 81","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might the Prophet have specified different burial methods for Muslims and others?","id":"tirmidhi-10-413"},{"hadith-eng":"\"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1046, Book 10, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the difference between using the terms 'Millah' and 'Sunnah' in the context of burial?","id":"tirmidhi-10-414"},{"hadith-eng":"His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1047, Book 10, Hadith 83","grade":"Hasan(Darussalam)","question #":"question #4","question":"Who was Abu Talhah in the context of the Prophet's burial?","id":"tirmidhi-10-415"},{"hadith-eng":"\"A red velvet cloth was placed in the grave of the Prophet.\"","reference":"Jami` at-Tirmidhi 1048, Book 10, Hadith 84","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the burial of the Prophet Muhammad reflect the customs and practices of his time?","id":"tirmidhi-10-416"},{"hadith-eng":"\"Ali said to Abu Al-Hayyaj Al-Asadi: 'I am dispatching you with what the Prophet dispatched me: \"That you not leave an elevated grave without leveling it, nor an image without erasing it.\"","reference":"Jami` at-Tirmidhi 1049, Book 10, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of leveling graves in Islamic tradition?","id":"tirmidhi-10-417"},{"hadith-eng":"The Prophet said: \"Do not sit on the graves nor perform Salat towards them.\"","reference":"Jami` at-Tirmidhi 1050, Book 10, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the sanctity of graves and burial sites?","id":"tirmidhi-10-418"},{"hadith-eng":"\"The Messenger of Allah prohibited plastering graves, writing on them, building over them, and treading on them.\"","reference":"Jami` at-Tirmidhi 1052, Book 10, Hadith 88","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the practice of treading on graves?","id":"tirmidhi-10-419"},{"hadith-eng":"\"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"","reference":"Jami` at-Tirmidhi 1053, Book 10, Hadith 89","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the phrase 'you are our predecessors and we are to follow you' imply about the cycle of life and death in Islam?","id":"tirmidhi-10-420"},{"hadith-eng":"The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"","reference":"Jami` at-Tirmidhi 1054, Book 10, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #4","question":"What change in practice regarding visiting graves is mentioned in the hadith?","id":"tirmidhi-10-421"},{"hadith-eng":"\"Abdur-Rahman bin Abi Bakr died in Al-Hubshi\" He said: \"He was carried to Makkah to be buried there. So when Aishah arrived she went to the grave of Abdur-Rahman bin Abi Bakr and she said: \"We were like two drinking companions of Jadhimah for such a long time that they would say: 'They will never part.' So when we were separated it was as if I and Malik - due to the length of unity - never spent a night together.\"","reference":"Jami` at-Tirmidhi 1055, Book 10, Hadith 91","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the act of carrying Abdur-Rahman bin Abi Bakr to Makkah for burial signify in terms of Islamic burial practices?","id":"tirmidhi-10-422"},{"hadith-eng":"\"Indeed the Messenger of Allah cursed the women who visit the graves.\"","reference":"Jami` at-Tirmidhi 1056, Book 10, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the cultural and religious reasons behind prohibiting certain actions in Islam?","id":"tirmidhi-10-423"},{"hadith-eng":"\"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"","reference":"Jami` at-Tirmidhi 1057, Book 10, Hadith 93","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the meaning and significance of saying 'Allahu Akbar' during a burial?","id":"tirmidhi-10-424"},{"hadith-eng":"\"A funeral (procession) passed by the Messenger of Allah and they were praising him with good statements. So the Messenger of Allah said: 'Granted.' Then he said: 'You are Allah's witnesses on the earth.'\"","reference":"Jami` at-Tirmidhi 1058, Book 10, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of being Allah's witnesses on earth influence Muslim behavior and accountability?","id":"tirmidhi-10-425"},{"hadith-eng":"\"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"","reference":"Jami` at-Tirmidhi 1059, Book 10, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is the number of people bearing witness important in Islamic teachings about the afterlife?","id":"tirmidhi-10-426"},{"hadith-eng":"The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"","reference":"Jami` at-Tirmidhi 1060, Book 10, Hadith 96","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the spiritual implications for a Muslim who has lost three children?","id":"tirmidhi-10-427"},{"hadith-eng":"The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"","reference":"Jami` at-Tirmidhi 1061, Book 10, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of a 'well-fortified fortress' relate to the afterlife in Islamic belief?","id":"tirmidhi-10-428"},{"hadith-eng":"\"I heard my grandfather, the father of my mother, Simak bin Al-Walid Al-Hanadi narrating, that he heard Ibn Abbas narrated, that he heard the Messenger of Allah saying: \"Whoever has two predecessors (in death) among my Ummah, then Allah will admit them into Paradise.\"So Aishah said to him: \"What about one from your Ummar who has one precessor?\" He (pbuh) said: \"And whoever has one predecessor O Muwaffaqqah!\" So she said: \"What about one who does not have a predecessor from your Ummah?\" He said: \"I am the predecessor for my Ummah: you will never suffer (in grief) for (the loss of) anyone similar to me.\"","reference":"Jami` at-Tirmidhi 1062, Book 10, Hadith 98","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad serve as a predecessor for his Ummah?","id":"tirmidhi-10-429"},{"hadith-eng":"The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"","reference":"Jami` at-Tirmidhi 1063, Book 10, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #4","question":"What significance does dying from a stomach illness hold in the context of martyrdom?","id":"tirmidhi-10-430"},{"hadith-eng":"\"Sulaiman bin Surad said to Khalid bin Urfutah - or, Khalid said to Sulaiman - 'Did you hear the Messenger of Allah saying: \"Whoever is killed by his stomach then he will not be punished in the grave\"?' One of them said to the other: \"Yes.\"","reference":"Jami` at-Tirmidhi 1064, Book 10, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of a person's cause of death on their afterlife according to Islamic teachings?","id":"tirmidhi-10-431"},{"hadith-eng":"The Prophet mentioned the plague and said: \"It is an abiding punishment or chastisement that was sent upon a group of the children of Isra'il. So when it occurs in a land while you are in it, then do not leave it. And when it occurs in a land while you are not in it, then do not enter it.\"","reference":"Jami` at-Tirmidhi 1065, Book 10, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of staying in a land affected by a plague according to the hadith?","id":"tirmidhi-10-432"},{"hadith-eng":"The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1066, Book 10, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of meeting Allah influence a believer's actions and mindset?","id":"tirmidhi-10-433"},{"hadith-eng":"Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1067, Book 10, Hadith 103","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of meeting Allah differ for believers and disbelievers?","id":"tirmidhi-10-434"},{"hadith-eng":"\"A man killed himself, so the Prophet did not perform Salat over him.\"","reference":"Jami` at-Tirmidhi 1068, Book 10, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the community's response to suicide reflect Islamic teachings on life and death?","id":"tirmidhi-10-435"},{"hadith-eng":"The Prophet was brought a (deceased) man to perform Salat over. So the Prophet said: \"Pray for your companion; for indeed he had a debt upon him.\" Abu Qatadah said: \"It shall be upon me.\" So the Messenger of Allah said: \"To pay it off?\" (He said: \"To pay it off.\") So he performed the prayer for him.","reference":"Jami` at-Tirmidhi 1069, Book 10, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the assurance of debt repayment play in Islamic funeral rites?","id":"tirmidhi-10-436"},{"hadith-eng":"\"A deceased man would be brought to the Messenger of Allah while a debt was due upon him. So he would say: 'Has he left anything to pay off his debt?' If he was told that he had left something to pay it then he would pray (the funeral prayer) for him. Otherwise he would tell the Muslims: 'Pray for your companion.' So when Allah granted him the victories, he stood and said: 'I am more worthy in the case of the believers than they themselves are. So whoever among the believers dies and leaves a debt behind, then it is up to me to fulfill it. And whoever leaves wealth behind, then it is for his heirs.'\"","reference":"Jami` at-Tirmidhi 1070, Book 10, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #4","question":"What happens to the wealth left behind by a deceased believer according to the Prophet's statement?","id":"tirmidhi-10-437"},{"hadith-eng":"The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"","reference":"Jami` at-Tirmidhi 1071, Book 10, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of one's testimony in determining the condition of their grave?","id":"tirmidhi-10-438"},{"hadith-eng":"The Messenger of Allah said: \"When a person dies, he is shown his place [both in the morning and the evening]. If he is one of the people of Paradise; he is shown his place among the people of Paradise, and if he one of the people of the Fire; he is shown his place among the people of the Fire. Then it is said to him: 'This is your place until Allah resurrects you on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 1072, Book 10, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of resurrection relate to the afterlife in Islam?","id":"tirmidhi-10-439"},{"hadith-eng":"The Prophet said: \"Whoever consoles a person with an affliction, then he gets the same reward as him.\"","reference":"Jami` at-Tirmidhi 1073, Book 10, Hadith 109","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islam view the act of comforting those who are suffering?","id":"tirmidhi-10-440"},{"hadith-eng":"The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"","reference":"Jami` at-Tirmidhi 1074, Book 10, Hadith 110","grade":"Hasan(Darussalam)","question #":"question #4","question":"What beliefs do Muslims hold about the spiritual benefits associated with the day of Friday?","id":"tirmidhi-10-441"},{"hadith-eng":"The Messenger of Allah said to him: \"O Ali! Three are not to be delayed: Salat when it is due, the funeral when it is presented, and (marriage) for the single woman when someone compatible is found.\"","reference":"Jami` at-Tirmidhi 1075, Book 10, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the timing of marriage for a single woman when a compatible partner is found?","id":"tirmidhi-10-442"},{"hadith-eng":"The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"","reference":"Jami` at-Tirmidhi 1076, Book 10, Hadith 112","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is a Burd and what does it symbolize in the context of Paradise?","id":"tirmidhi-10-443"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1078, Book 10, Hadith 114","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important for a believer to ensure their debts are paid off?","id":"tirmidhi-10-444"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1079, Book 10, Hadith 115","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important for a believer to ensure their debts are paid off?","id":"tirmidhi-10-445"},{"hadith-eng":"The Messenger of Allah said: \"The believer is not afflicted by the prick of a thorn or what is worse (or greater) than that, except that by it Allah raises him in rank and removes sin from him.\"","reference":"Jami` at-Tirmidhi 965, Book 10, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the relationship between patience in adversity and the purification of sins in Islam?","id":"tirmidhi-10-446"},{"hadith-eng":"The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"","reference":"Jami` at-Tirmidhi 966, Book 10, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do minor afflictions play in the purification of a believer's soul?","id":"tirmidhi-10-447"},{"hadith-eng":"the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"","reference":"Jami` at-Tirmidhi 967, Book 10, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'Khurfah of Paradise' imply in the context of Islamic brotherhood?","id":"tirmidhi-10-448"},{"hadith-eng":"His father said: \"Ali took me by the hand and said: 'Come with us to pay a visit to Al-Hasan.' So we found that Abu Musa was with him.' Ali - peace be upon him - said: 'O Abu Musa! Did you come to visit (the sick) or merely (stop by to) visit?' He said: 'No, to visit (the sick).' So Ali said: 'I heard the Messenger of Allah saying: \"No Muslim visits (the sick) Muslims in the morning, except that sevety-thousand angels, sent Salat upon him until the evening, and he does not visit at night except that seventy thousand angels sent Salat upon him until the morning, and there will be a garden for him in Paradise.\"","reference":"Jami` at-Tirmidhi 969, Book 10, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the role of intention when visiting someone who is ill in Islam?","id":"tirmidhi-10-449"},{"hadith-eng":"\"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"","reference":"Jami` at-Tirmidhi 970, Book 10, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the prohibition of wishing for death reflect on the attitude towards life in Islam?","id":"tirmidhi-10-450"},{"hadith-eng":"Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"","reference":"Jami` at-Tirmidhi 972, Book 10, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the Islamic teachings on dealing with physical and spiritual ailments?","id":"tirmidhi-10-451"},{"hadith-eng":"\"Thabit Al-Bunani and I entered upon Anas bin Malik, and Thabit said: 'O Abu Hamzah! I am suffering from an illness. So Anas said: 'Shall I not recite the Ruqyah of the Messenger of Allah over you?' He said: 'Why, yes.' He said: 'O Allah! Lord of mankind, removed the harm, and cure (him). Indeed You are the One Who cures, there is none who cures except you, a cure that leaves no disease.'\"","reference":"Jami` at-Tirmidhi 973, Book 10, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of Allah being the sole healer influence Islamic medical practices?","id":"tirmidhi-10-452"},{"hadith-eng":"The Messenger of Allah said: \"A Muslim man has no right to spend two nights while he has something to will, except while his will is recorded with him.\"","reference":"Jami` at-Tirmidhi 974, Book 10, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of a will relate to the broader principles of accountability and preparedness in Islam?","id":"tirmidhi-10-453"},{"hadith-eng":"\"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"","reference":"Jami` at-Tirmidhi 975, Book 10, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the hadith suggest about the balance between personal charity and family responsibility in Islamic inheritance laws?","id":"tirmidhi-10-454"},{"hadith-eng":"The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'","reference":"Jami` at-Tirmidhi 976, Book 10, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the testimony of faith play in the Islamic concept of salvation?","id":"tirmidhi-10-455"},{"hadith-eng":"\"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 977, Book 10, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"What was the outcome for Umm Salamah after she followed the Prophet's advice upon her husband's death?","id":"tirmidhi-10-456"},{"hadith-eng":"\"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"","reference":"Jami` at-Tirmidhi 978, Book 10, Hadith 14","grade":"Hasan(Darussalam)","question #":"question #5","question":"How can this narration provide insight into the Prophet Muhammad's (ﷺ) approach to facing death?","id":"tirmidhi-10-457"},{"hadith-eng":"\"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 979, Book 10, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does empathy play in understanding the experiences of others during their final moments?","id":"tirmidhi-10-458"},{"hadith-eng":"\"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]","reference":"Jami` at-Tirmidhi 980, Book 10, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #5","question":"What might be the implications of disliking a sudden death according to this narration?","id":"tirmidhi-10-459"},{"hadith-eng":"The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"","reference":"Jami` at-Tirmidhi 981, Book 10, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of divine forgiveness manifest in daily actions according to Islamic teachings?","id":"tirmidhi-10-460"},{"hadith-eng":"The Prophet said:  \"The believer dies with sweat on his brow.\"","reference":"Jami` at-Tirmidhi 982, Book 10, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the spiritual condition of a believer at the time of death from this narration?","id":"tirmidhi-10-461"},{"hadith-eng":"The Prophet entered upon a young man while he was dying. So he said: \"How do you feel?\" He said: \"By Allah! O Messenger of Allah! Indeed I hope in Allah and I fear from my sins.\" So the Messenger of Allah said: \"These two will not be gathered in a worshipper's heart at a time such as this, except that Allah will grant him what he hopes and make him safe from what he fears.\"","reference":"Jami` at-Tirmidhi 983, Book 10, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned about the mercy of Allah from the interaction between the Prophet and the dying young man?","id":"tirmidhi-10-462"},{"hadith-eng":"(from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"","reference":"Jami` at-Tirmidhi 985, Book 10, Hadith 21","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the presence of different narrators impact the authenticity and interpretation of a hadith?","id":"tirmidhi-10-463"},{"hadith-eng":"Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"","reference":"Jami` at-Tirmidhi 986, Book 10, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of humility relate to the prohibition of An-Na'i in Islam?","id":"tirmidhi-10-464"},{"hadith-eng":"The Messenger of Allah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 987, Book 10, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of patience relate to the teachings of the Prophet Muhammad (peace be upon him)?","id":"tirmidhi-10-465"},{"hadith-eng":"The Messenger of Alllah said: \"(Real) Patience is at the first stroke of the calamity.\"","reference":"Jami` at-Tirmidhi 988, Book 10, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can one cultivate patience when faced with sudden challenges?","id":"tirmidhi-10-466"},{"hadith-eng":"\"The Prophet kissed Uthman bin Maz'un when he died, and he was crying.\" Or, he (one of the narrators) said: \"His eyes were brimming with tears.\"","reference":"Jami` at-Tirmidhi 989, Book 10, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #5","question":"What significance does the act of kissing a deceased person hold in Islamic tradition, as demonstrated by the Prophet?","id":"tirmidhi-10-467"},{"hadith-eng":"\"One of the daughters of the Prophet died, so he said: 'Wash her an odd number of times, three, or five, or more than that as you see fit. Wash her with water and Sidr, and in the last (washing) add camphor, or something from camphor. When you are finished then inform me.' When we finished we informed him so he gave us his waist-sheet and said 'Wrap her in it.'\"","reference":"Jami` at-Tirmidhi 990, Book 10, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of using the Prophet's waist-sheet for wrapping the deceased?","id":"tirmidhi-10-468"},{"hadith-eng":"The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"","reference":"Jami` at-Tirmidhi 993, Book 10, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of cleanliness and purification in Islamic funeral rites?","id":"tirmidhi-10-469"},{"hadith-eng":"The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"","reference":"Jami` at-Tirmidhi 994, Book 10, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding the clothing of the deceased?","id":"tirmidhi-10-470"},{"hadith-eng":"The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"","reference":"Jami` at-Tirmidhi 995, Book 10, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the use of a good shroud symbolize in the context of Islamic funerals?","id":"tirmidhi-10-471"},{"hadith-eng":"Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"","reference":"Jami` at-Tirmidhi 996, Book 10, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the differences in opinion regarding the Prophet's shrouding garments?","id":"tirmidhi-10-472"},{"hadith-eng":"\"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"","reference":"Jami` at-Tirmidhi 997, Book 10, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the guidelines for shrouding the deceased in Islam?","id":"tirmidhi-10-473"},{"hadith-eng":"\"When the news of the death of Ja'far came, the Prophet said: 'Prepare some food for the family of Ja'far, for indeed something has happened to them that will keep them busy.'\"","reference":"Jami` at-Tirmidhi 998, Book 10, Hadith 34","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does food play in offering comfort to those who are mourning in Islamic tradition?","id":"tirmidhi-10-474"},{"hadith-eng":"The Prophet said: \"He who slaps (his) cheeks, tears (his) clothes and calls with the call of the Jahliyyah is not one of us.\"","reference":"Jami` at-Tirmidhi 999, Book 10, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of Jahiliyyah relate to inappropriate mourning practices?","id":"tirmidhi-10-475"},{"hadith-eng":"\"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"","reference":"Jami` at-Tirmidhi 1000, Book 10, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of delivering a sermon on the gravity of wailing in Islam?","id":"tirmidhi-10-476"},{"hadith-eng":"\"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"","reference":"Jami` at-Tirmidhi 1001, Book 10, Hadith 37","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of understanding the concept of Al-Adwa in Islamic teachings?","id":"tirmidhi-10-477"},{"hadith-eng":"The Messenger of Allah said: \"The deceased is punished for the crying of his family over him.\"","reference":"Jami` at-Tirmidhi 1002, Book 10, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding the expression of grief for a deceased family member?","id":"tirmidhi-10-478"},{"hadith-eng":"The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"","reference":"Jami` at-Tirmidhi 1003, Book 10, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the authenticity of praises given to a deceased person?","id":"tirmidhi-10-479"},{"hadith-eng":"The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"","reference":"Jami` at-Tirmidhi 1004, Book 10, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of attributing statements to the Prophet Muhammad (ﷺ) without proper verification?","id":"tirmidhi-10-480"},{"hadith-eng":"\"The Prophet took Abdur-Rahman bin Awf by the hand and went with him to his son Ibrahim. He found him in his last breaths, so he took him and put him on his lap and cried. Abdur-Rahman said to him: 'You cry? Didn't you prohibit (your followers) from crying?' He said: 'No. But I prohibited two foolish immoral voices: A voice during a calamity while clawing at one's face and tearing one's clothes, and Shaitan's scream.'\" And there is more that is stated in the Hadith.","reference":"Jami` at-Tirmidhi 1005, Book 10, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the hadith differentiate between permissible and impermissible expressions of grief?","id":"tirmidhi-10-481"},{"hadith-eng":"Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"","reference":"Jami` at-Tirmidhi 1006, Book 10, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does forgiveness play in addressing misunderstandings or errors in religious teachings?","id":"tirmidhi-10-482"},{"hadith-eng":"\"The Prophet, Abu Bakr, and Umar would walk in front of the funeral.\" Az-Zuhri said: \"Salim informed me that his father would walk in front of the funeral.\"","reference":"Jami` at-Tirmidhi 1009, Book 10, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the practice of walking in front of a funeral reflect respect and honor for the deceased in Islam?","id":"tirmidhi-10-483"},{"hadith-eng":"From Abdullah bin Mas'ud who said: \"We asked the Messenger of Allah about walking behind the funeral. He said: 'Less than a trot. For if he was good, then you will be hastening him to it (goodness), and if he was evil, then it id only an inhabitant of the Fire that is being taken away.\"  The funeral is (to be) followed. The one who precedes it shall not have the reward of those who follow it.'\"","reference":"Jami` at-Tirmidhi 1011, Book 10, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the fate of a person who was evil in life during their funeral procession?","id":"tirmidhi-10-484"},{"hadith-eng":"\"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"","reference":"Jami` at-Tirmidhi 1012, Book 10, Hadith 48","grade":"","question #":"question #5","question":"What lessons can be learned about humility and respect from funeral processions in Islam?","id":"tirmidhi-10-485"},{"hadith-eng":"\"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"","reference":"Jami` at-Tirmidhi 1013, Book 10, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #5","question":"What insights can be drawn about the Prophet's leadership style during communal activities from this event?","id":"tirmidhi-10-486"},{"hadith-eng":"The Prophet said: \"Hurry up with the funeral (procession) for if it was good, you are advancing it to good, and if it was evil, then you are taking it off your necks.\"","reference":"Jami` at-Tirmidhi 1015, Book 10, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the spiritual benefits of conducting a funeral procession promptly?","id":"tirmidhi-10-487"},{"hadith-eng":"\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"","reference":"Jami` at-Tirmidhi 1016, Book 10, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does the hadith suggest about the practice of performing funeral prayers for martyrs?","id":"tirmidhi-10-488"},{"hadith-eng":"\"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"","reference":"Jami` at-Tirmidhi 1017, Book 10, Hadith 53","grade":"Da'if(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad (ﷺ) exemplify leadership during the events of Banu Quraizah?","id":"tirmidhi-10-489"},{"hadith-eng":"\"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"","reference":"Jami` at-Tirmidhi 1018, Book 10, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the importance of remembering the sayings of the Prophet?","id":"tirmidhi-10-490"},{"hadith-eng":"\"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"","reference":"Jami` at-Tirmidhi 1020, Book 10, Hadith 56","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic tradition emphasize the uniqueness of its rituals compared to other faiths?","id":"tirmidhi-10-491"},{"hadith-eng":"\"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"","reference":"Jami` at-Tirmidhi 1021, Book 10, Hadith 57","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the act of praising Allah during times of grief reflect on a believer's faith?","id":"tirmidhi-10-492"},{"hadith-eng":"\"The Prophet prayed and in the funeral prayer he for An-Najashi, said four Takbir.\"","reference":"Jami` at-Tirmidhi 1022, Book 10, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the components of a funeral prayer in Islamic tradition?","id":"tirmidhi-10-493"},{"hadith-eng":"\"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"","reference":"Jami` at-Tirmidhi 1023, Book 10, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of companions in preserving the practices of the Prophet?","id":"tirmidhi-10-494"},{"hadith-eng":"from his father who said: \"When the Messenger of Allah would perform  the Salat for the funeral he would said: (Allahammaghfir li-hayyina wa mayyittina, wa shahidina wa gha'ibina, wa saghirina wa kabirina, wa dhakarina wa unthana) 'O Allah! Forgive our living and our deceased, our present and our absent, our young and our old, our male and our female.'\"","reference":"Jami` at-Tirmidhi 1024, Book 10, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this prayer reflect the comprehensive nature of seeking forgiveness in Islam?","id":"tirmidhi-10-495"},{"hadith-eng":"\"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"","reference":"Jami` at-Tirmidhi 1025, Book 10, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet Muhammad's prayer reflect the Islamic view on the afterlife and purification?","id":"tirmidhi-10-496"},{"hadith-eng":"\"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"","reference":"Jami` at-Tirmidhi 1027, Book 10, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the recitation of Surah Al-Fatiha play in the context of Islamic funeral rites?","id":"tirmidhi-10-497"},{"hadith-eng":"\"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"","reference":"Jami` at-Tirmidhi 1028, Book 10, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #5","question":"How can the arrangement of people in a funeral prayer impact its spiritual benefits?","id":"tirmidhi-10-498"},{"hadith-eng":"The Prophet said: \"No one among the Muslim dies, and Salat is performed for him by a community of Muslims reaching one hundred, and they intercede (supplicate) for him, except that their intercession for him is accepted.\" In his narration, 'Ali bin Hujr said: \"One hundred or more than that.\"","reference":"Jami` at-Tirmidhi 1029, Book 10, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the number of people participating in Salat influence the acceptance of their prayers for the deceased?","id":"tirmidhi-10-499"},{"hadith-eng":"\"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"","reference":"Jami` at-Tirmidhi 1030, Book 10, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of performing religious rituals at prohibited times?","id":"tirmidhi-10-500"},{"hadith-eng":"The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"","reference":"Jami` at-Tirmidhi 1032, Book 10, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of a child being alive at birth in terms of inheritance and funeral rites?","id":"tirmidhi-10-501"},{"hadith-eng":"\"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"","reference":"Jami` at-Tirmidhi 1034, Book 10, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does a companion's testimony play in preserving the Sunnah of the Prophet?","id":"tirmidhi-10-502"},{"hadith-eng":"Jabir bin Abdullah informed him that the Prophet had put two men together in one cloth from those who were killed at (the battle of) Uhud, then he said: \"Which of them memorized the more of the Qur'an?\" When one of them was indicated to him, he put him in the Lahd (first) and said: \"I am a witness for those people on the Day of Judgment.\" And he ordered that they be buried in their blood, and that they not be prayed over, nor washed.","reference":"Jami` at-Tirmidhi 1036, Book 10, Hadith 72","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the Prophet's statement about being a witness for the martyrs on the Day of Judgment imply about their status?","id":"tirmidhi-10-503"},{"hadith-eng":"Ash-Sha'bi said: \"I was informed by one who saw the Prophet: He (pbuh) saw a solitary grave, s he lined his Companions (behind him) to pray over it.\" It was said to him (Ash-Sha'bi): \"Who informed you?\" He said: \"Ibn Abbas.\"","reference":"Jami` at-Tirmidhi 1037, Book 10, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the practices of the Prophet (pbuh) from this narration?","id":"tirmidhi-10-504"},{"hadith-eng":"\"Umm Sa'd died while the Prophet was absent. So when he arrived he performed Salat over her, and a month had already passed.\"","reference":"Jami` at-Tirmidhi 1038, Book 10, Hadith 74","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the Prophet's action reflect on the importance of offering prayers for the deceased?","id":"tirmidhi-10-505"},{"hadith-eng":"the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"","reference":"Jami` at-Tirmidhi 1039, Book 10, Hadith 75","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the death of a prominent figure like An-Najashi impact the Muslim community's practices?","id":"tirmidhi-10-506"},{"hadith-eng":"The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"","reference":"Jami` at-Tirmidhi 1040, Book 10, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the comparison to Mount Uhud signify in terms of reward for funeral rites?","id":"tirmidhi-10-507"},{"hadith-eng":"The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up (for it). Whoever follows it, then do not sit down until it is put down.\"","reference":"Jami` at-Tirmidhi 1043, Book 10, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of this practice on community solidarity and respect for life?","id":"tirmidhi-10-508"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas.Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).","reference":"Jami` at-Tirmidhi 1044, Book 10, Hadith 80","grade":"","question #":"question #5","question":"What is the importance of following the actions of the Prophet Muhammad (ﷺ) in Islamic practices?","id":"tirmidhi-10-509"},{"hadith-eng":"\"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1046, Book 10, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is it important to follow the Prophet's example in burial rituals?","id":"tirmidhi-10-510"},{"hadith-eng":"His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"","reference":"Jami` at-Tirmidhi 1047, Book 10, Hadith 83","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this narration tell us about the companions involved in the Prophet's burial?","id":"tirmidhi-10-511"},{"hadith-eng":"\"Ali said to Abu Al-Hayyaj Al-Asadi: 'I am dispatching you with what the Prophet dispatched me: \"That you not leave an elevated grave without leveling it, nor an image without erasing it.\"","reference":"Jami` at-Tirmidhi 1049, Book 10, Hadith 85","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's stance on images?","id":"tirmidhi-10-512"},{"hadith-eng":"\"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"","reference":"Jami` at-Tirmidhi 1053, Book 10, Hadith 89","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the practice of visiting graves reflect on the Islamic understanding of mortality?","id":"tirmidhi-10-513"},{"hadith-eng":"The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"","reference":"Jami` at-Tirmidhi 1054, Book 10, Hadith 90","grade":"Sahih(Darussalam)","question #":"question #5","question":"What personal experience of the Prophet Muhammad is related to the practice of visiting graves?","id":"tirmidhi-10-514"},{"hadith-eng":"\"Abdur-Rahman bin Abi Bakr died in Al-Hubshi\" He said: \"He was carried to Makkah to be buried there. So when Aishah arrived she went to the grave of Abdur-Rahman bin Abi Bakr and she said: \"We were like two drinking companions of Jadhimah for such a long time that they would say: 'They will never part.' So when we were separated it was as if I and Malik - due to the length of unity - never spent a night together.\"","reference":"Jami` at-Tirmidhi 1055, Book 10, Hadith 91","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the hadith illustrate the emotional impact of losing a loved one?","id":"tirmidhi-10-515"},{"hadith-eng":"\"Indeed the Messenger of Allah cursed the women who visit the graves.\"","reference":"Jami` at-Tirmidhi 1056, Book 10, Hadith 92","grade":"Hasan(Darussalam)","question #":"question #5","question":"How do Islamic teachings address the roles and behaviors of women in religious practices?","id":"tirmidhi-10-516"},{"hadith-eng":"\"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"","reference":"Jami` at-Tirmidhi 1057, Book 10, Hadith 93","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does invoking Allah through Qur'anic recitation impact a person's spiritual life?","id":"tirmidhi-10-517"},{"hadith-eng":"\"A funeral (procession) passed by the Messenger of Allah and they were praising him with good statements. So the Messenger of Allah said: 'Granted.' Then he said: 'You are Allah's witnesses on the earth.'\"","reference":"Jami` at-Tirmidhi 1058, Book 10, Hadith 94","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the impact of public opinion on a person's reputation in Islamic tradition?","id":"tirmidhi-10-518"},{"hadith-eng":"\"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"","reference":"Jami` at-Tirmidhi 1059, Book 10, Hadith 95","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration suggest about the role of good reputation in Islam?","id":"tirmidhi-10-519"},{"hadith-eng":"The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"","reference":"Jami` at-Tirmidhi 1060, Book 10, Hadith 96","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the concept of divine mercy reflected in the trials faced by Muslims, such as losing children?","id":"tirmidhi-10-520"},{"hadith-eng":"The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"","reference":"Jami` at-Tirmidhi 1061, Book 10, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the age of accountability for children?","id":"tirmidhi-10-521"},{"hadith-eng":"\"I heard my grandfather, the father of my mother, Simak bin Al-Walid Al-Hanadi narrating, that he heard Ibn Abbas narrated, that he heard the Messenger of Allah saying: \"Whoever has two predecessors (in death) among my Ummah, then Allah will admit them into Paradise.\"So Aishah said to him: \"What about one from your Ummar who has one precessor?\" He (pbuh) said: \"And whoever has one predecessor O Muwaffaqqah!\" So she said: \"What about one who does not have a predecessor from your Ummah?\" He said: \"I am the predecessor for my Ummah: you will never suffer (in grief) for (the loss of) anyone similar to me.\"","reference":"Jami` at-Tirmidhi 1062, Book 10, Hadith 98","grade":"Hasan(Darussalam)","question #":"question #5","question":"What comfort is offered to those who have not lost any predecessors from the Ummah?","id":"tirmidhi-10-522"},{"hadith-eng":"The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"","reference":"Jami` at-Tirmidhi 1063, Book 10, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #5","question":"In what circumstances is drowning considered a form of martyrdom?","id":"tirmidhi-10-523"},{"hadith-eng":"\"Sulaiman bin Surad said to Khalid bin Urfutah - or, Khalid said to Sulaiman - 'Did you hear the Messenger of Allah saying: \"Whoever is killed by his stomach then he will not be punished in the grave\"?' One of them said to the other: \"Yes.\"","reference":"Jami` at-Tirmidhi 1064, Book 10, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the testimony of companions used to verify sayings of the Prophet in Islamic tradition?","id":"tirmidhi-10-524"},{"hadith-eng":"The Prophet mentioned the plague and said: \"It is an abiding punishment or chastisement that was sent upon a group of the children of Isra'il. So when it occurs in a land while you are in it, then do not leave it. And when it occurs in a land while you are not in it, then do not enter it.\"","reference":"Jami` at-Tirmidhi 1065, Book 10, Hadith 101","grade":"Sahih(Darussalam)","question #":"question #5","question":"What advice is given for those who are not in a land affected by a plague?","id":"tirmidhi-10-525"},{"hadith-eng":"The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1066, Book 10, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does it mean for Allah to love or dislike meeting someone?","id":"tirmidhi-10-526"},{"hadith-eng":"Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1067, Book 10, Hadith 103","grade":"Sahih(Darussalam)","question #":"question #5","question":"What emotions are associated with the news of Allah's punishment for disbelievers?","id":"tirmidhi-10-527"},{"hadith-eng":"\"A man killed himself, so the Prophet did not perform Salat over him.\"","reference":"Jami` at-Tirmidhi 1068, Book 10, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the responsibilities of a Muslim community when dealing with cases of suicide?","id":"tirmidhi-10-528"},{"hadith-eng":"The Prophet was brought a (deceased) man to perform Salat over. So the Prophet said: \"Pray for your companion; for indeed he had a debt upon him.\" Abu Qatadah said: \"It shall be upon me.\" So the Messenger of Allah said: \"To pay it off?\" (He said: \"To pay it off.\") So he performed the prayer for him.","reference":"Jami` at-Tirmidhi 1069, Book 10, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of communal responsibility manifest in Islamic practices related to debt?","id":"tirmidhi-10-529"},{"hadith-eng":"\"A deceased man would be brought to the Messenger of Allah while a debt was due upon him. So he would say: 'Has he left anything to pay off his debt?' If he was told that he had left something to pay it then he would pray (the funeral prayer) for him. Otherwise he would tell the Muslims: 'Pray for your companion.' So when Allah granted him the victories, he stood and said: 'I am more worthy in the case of the believers than they themselves are. So whoever among the believers dies and leaves a debt behind, then it is up to me to fulfill it. And whoever leaves wealth behind, then it is for his heirs.'\"","reference":"Jami` at-Tirmidhi 1070, Book 10, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet's statement reflect his concern for the financial obligations of the believers?","id":"tirmidhi-10-530"},{"hadith-eng":"The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"","reference":"Jami` at-Tirmidhi 1071, Book 10, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the grave experience differ for a believer and a hypocrite?","id":"tirmidhi-10-531"},{"hadith-eng":"The Messenger of Allah said: \"When a person dies, he is shown his place [both in the morning and the evening]. If he is one of the people of Paradise; he is shown his place among the people of Paradise, and if he one of the people of the Fire; he is shown his place among the people of the Fire. Then it is said to him: 'This is your place until Allah resurrects you on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 1072, Book 10, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does Islamic eschatology say about the interim period between death and the Day of Judgment?","id":"tirmidhi-10-532"},{"hadith-eng":"The Prophet said: \"Whoever consoles a person with an affliction, then he gets the same reward as him.\"","reference":"Jami` at-Tirmidhi 1073, Book 10, Hadith 109","grade":"Da'if(Darussalam)","question #":"question #5","question":"What kind of reward can one expect for consoling a person facing hardship?","id":"tirmidhi-10-533"},{"hadith-eng":"The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"","reference":"Jami` at-Tirmidhi 1074, Book 10, Hadith 110","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the timing of a person's death influence their spiritual state according to Islamic teachings?","id":"tirmidhi-10-534"},{"hadith-eng":"The Messenger of Allah said to him: \"O Ali! Three are not to be delayed: Salat when it is due, the funeral when it is presented, and (marriage) for the single woman when someone compatible is found.\"","reference":"Jami` at-Tirmidhi 1075, Book 10, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of delaying important obligations in Islam?","id":"tirmidhi-10-535"},{"hadith-eng":"The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"","reference":"Jami` at-Tirmidhi 1076, Book 10, Hadith 112","grade":"Da'if(Darussalam)","question #":"question #5","question":"What actions can lead to being clothed with a Burd in Paradise?","id":"tirmidhi-10-536"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1078, Book 10, Hadith 114","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the relationship between a believer's soul and their financial obligations?","id":"tirmidhi-10-537"},{"hadith-eng":"The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"","reference":"Jami` at-Tirmidhi 1079, Book 10, Hadith 115","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the relationship between a believer's soul and their financial obligations?","id":"tirmidhi-10-538"},{"hadith-eng":"\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"","reference":"Jami` at-Tirmidhi 1016, Book 10, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #6","question":"How does the hadith reflect the Prophet's respect for the deceased despite the challenging circumstances?","id":"tirmidhi-10-539"},{"hadith-eng":"The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"","reference":"Jami` at-Tirmidhi 1040, Book 10, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #6","question":"How did Ibn Umar verify the authenticity of the hadith regarding funeral prayer rewards?","id":"tirmidhi-10-540"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas.Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).","reference":"Jami` at-Tirmidhi 1044, Book 10, Hadith 80","grade":"","question #":"question #6","question":"How do different narrations contribute to understanding the practice of standing for a funeral procession?","id":"tirmidhi-10-541"},{"hadith-eng":"The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"","reference":"Jami` at-Tirmidhi 1063, Book 10, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does being crushed relate to the concept of martyrdom in Islamic teachings?","id":"tirmidhi-10-542"},{"hadith-eng":"Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"","reference":"Jami` at-Tirmidhi 1067, Book 10, Hadith 103","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does one's perception of death relate to their faith and expectations of the afterlife in Islam?","id":"tirmidhi-10-543"},{"hadith-eng":"The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"","reference":"Jami` at-Tirmidhi 1071, Book 10, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #6","question":"What does the expansion and illumination of the grave signify for a believer?","id":"tirmidhi-10-544"}]