[{"hadith-eng":"The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"","reference":"Jami` at-Tirmidhi 1080, Book 11, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the practices considered as Sunan of the Messengers?","id":"tirmidhi-11-1"},{"hadith-eng":"\"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"","reference":"Jami` at-Tirmidhi 1081, Book 11, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What advice is given to young men regarding marriage and its benefits?","id":"tirmidhi-11-2"},{"hadith-eng":"The Prophet prohibited celibacy.","reference":"Jami` at-Tirmidhi 1082, Book 11, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on celibacy?","id":"tirmidhi-11-3"},{"hadith-eng":"\"The Messenger of Allah refused Uthman bin Ma'zun (when he asked) regarding celibacy, and if he had permitted it for him, then we would have castrated ourselves.\"","reference":"Jami` at-Tirmidhi 1083, Book 11, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic stance on celibacy and abstaining from marriage?","id":"tirmidhi-11-4"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with proposes to (someone under the care) of one of you, then marry to him. If you do not do so, then there will be turmoil (Fitnah) in the land and abounding discord (Fasad).\"","reference":"Jami` at-Tirmidhi 1084, Book 11, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #1","question":"What criteria should be considered when accepting a marriage proposal in Islam?","id":"tirmidhi-11-5"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"\nHe said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.","reference":"Jami` at-Tirmidhi 1085, Book 11, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #1","question":"What criteria should be considered when choosing a spouse according to Islamic teachings?","id":"tirmidhi-11-6"},{"hadith-eng":"The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"","reference":"Jami` at-Tirmidhi 1086, Book 11, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different criteria mentioned for choosing a spouse in Islam?","id":"tirmidhi-11-7"},{"hadith-eng":"Al-Mughirah bin Shu'bah proposed to a woman, so the Prophet said: \"Look at her, for indeed that is more likely to make things better between the two of you.\"","reference":"Jami` at-Tirmidhi 1087, Book 11, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeing a potential spouse before marriage in Islam?","id":"tirmidhi-11-8"},{"hadith-eng":"The Messenger of Allah said: \"The distinction between the lawful and the unlawful  is the Duff and the voice.\"","reference":"Jami` at-Tirmidhi 1088, Book 11, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the Duff in distinguishing between lawful and unlawful activities in Islam?","id":"tirmidhi-11-9"},{"hadith-eng":"The Messenger of Allah said: \"Publicize this marriage, and hold it in the Masjid, and beat the Duff for it.\"","reference":"Jami` at-Tirmidhi 1089, Book 11, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of publicizing a marriage in Islam?","id":"tirmidhi-11-10"},{"hadith-eng":"\"The morning after the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the Duff and reciting verses mourning my father who had been killed in the battle of Badr. One of them said: 'Among us is a Prophet who knows what will happen tomorrow.' On that the Prophet said: 'Stop saying this, and keep on saying what you were saying before.'\"","reference":"Jami` at-Tirmidhi 1090, Book 11, Hadith 11","grade":"","question #":"question #1","question":"What is the significance of the Prophet's presence at a wedding celebration in Islamic tradition?","id":"tirmidhi-11-11"},{"hadith-eng":"When supplicating for the newlywed, the Prophet would say: (Barak Allahu laka wa baraka alaik, wa jama'a bainakuma fi khair.) \"May Allah bless you and send blessings upon you, and bring goodness between you.\"","reference":"Jami` at-Tirmidhi 1091, Book 11, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of supplicating for blessings in a marriage?","id":"tirmidhi-11-12"},{"hadith-eng":"The Messenger of Allah said: \"If anyone of you, when having sexual intercourse with his wife, says: (Bismillah, Allahumma jannibnash-Shaitana wa jannibish-Shaitana ma razaqtana) 'In the Name of Allah, O Allah! Protect me from Shaitan and protect what you bestow upon us from Shaitan' - then if Allah decrees that they should have a child, Shaitan will not be able to harm him.'\"","reference":"Jami` at-Tirmidhi 1092, Book 11, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of invoking Allah's name before engaging in marital relations?","id":"tirmidhi-11-13"},{"hadith-eng":"\"The Messenger of Allah married me in Shawwal, and he took up residence with me in Shawwal.\"","reference":"Jami` at-Tirmidhi 1093, Book 11, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the month of Shawwal in the context of marriage in Islamic tradition?","id":"tirmidhi-11-14"},{"hadith-eng":"The Messenger of Allah saw some traces of saffron on `Abdur-Rahman bin `Awf so he said: 'What is this?' He said: 'I married a woman for the amount of gold equal to a date stone.' So he said: 'May Allah bless you. Have a banquet, even if with only one sheep.'\"","reference":"Jami` at-Tirmidhi 1094, Book 11, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having a wedding banquet in Islam?","id":"tirmidhi-11-15"},{"hadith-eng":"\"The Prophet had a banquet for Safiyyah bint Huyayy with Sawiq and dates.\"","reference":"Jami` at-Tirmidhi 1095, Book 11, Hadith 16","grade":"","question #":"question #1","question":"What types of food were served at the Prophet's banquet for Safiyyah bint Huyayy?","id":"tirmidhi-11-16"},{"hadith-eng":"Others have reported this Hadith from Ibn Uyainah, from Az-Zuhri, from Anas, and they did not mention \"from Wa'il, from his son Nawf\" in it.","reference":"Jami` at-Tirmidhi 1096, Book 11, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of accurately preserving the chain of narrators in hadith transmission?","id":"tirmidhi-11-17"},{"hadith-eng":"The Messenger of Allah said: \"Having food on the first day is was is obligatory, and having food on the second day is Sunnah, and having food on the third day is to be heard of, and whoever wants to be heard of, Allah will make him heard of.\"","reference":"Jami` at-Tirmidhi 1097, Book 11, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of having food on the first day according to Islamic teachings?","id":"tirmidhi-11-18"},{"hadith-eng":"The Messenger of Allah said: \"Accept the invitation when you are offered.\"","reference":"Jami` at-Tirmidhi 1098, Book 11, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of accepting invitations in Islam?","id":"tirmidhi-11-19"},{"hadith-eng":"\"A man named Abu Shu'aib came to a slave of his, who was a butcher, and said: 'Prepare some food for me that will be sufficient for five, for I have seen hunger in the face of the Messenger of Allah.' So he prepared some food. Then he sent a message to the Prophet inviting him and those who were sitting with him. When the Prophet stood, he was followed by a man who was not with them when they were invited. When the Messenger of Allah arrive at the door he said to the owner of the house: 'A man who was not with us when you invited us followed us, if you permit him, he will enter.'\" He said: We have permitted him, let him enter.\"","reference":"Jami` at-Tirmidhi 1099, Book 11, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before allowing someone to join a gathering?","id":"tirmidhi-11-20"},{"hadith-eng":"\"I married a woman and went to the Prophet, he said: 'O Jabir! Have you married?' I said: 'Yes.' He said: 'A virgin or a matron?' I said: 'A matron.' He said: 'Why didn't you marry a young girl, so that you may play with her and she with you?' I said: 'O Messenger of Allah! Abdullah (his father) died and left behind seven - or nine - daughter, so I have brought someone who can look after them.'\" (He said:) \"So he supplicated for me.\"","reference":"Jami` at-Tirmidhi 1100, Book 11, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What considerations might influence a person's choice between marrying a virgin or a matron?","id":"tirmidhi-11-21"},{"hadith-eng":"the Messenger of Allah said: \"There is no marriage except with a Wali.\"","reference":"Jami` at-Tirmidhi 1101, Book 11, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the role of a Wali in the context of marriage in Islam?","id":"tirmidhi-11-22"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman married without the permission of her Wali her marriage is invalid, her marriage is invalid, her marriage is invalid. If he entered into her, then the Mahr is for her in lieu of what he enjoyed from her private part. If they disagree, then the Sultan is the Wali for one who has no Wali.\"","reference":"Jami` at-Tirmidhi 1102, Book 11, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the role of a Wali in a woman's marriage according to Islamic teachings?","id":"tirmidhi-11-23"},{"hadith-eng":"the Prophet said: \"The adulteresses are the ones who marry themselves without Bayyinah (proof).\"","reference":"Jami` at-Tirmidhi 1103, Book 11, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of having proof or witnesses in Islamic marriage?","id":"tirmidhi-11-24"},{"hadith-eng":"And he did not narrate it in Marfu form, and this is more correct.","reference":"Jami` at-Tirmidhi 1104, Book 11, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of verifying the authenticity of a narration in Islamic tradition?","id":"tirmidhi-11-25"},{"hadith-eng":"\"The Messenger of Allah taught us the Tashah-hud for Salat and the Tashah-hud for Al-Hajjah.\" He said: \"The Tashah-hud for Salat is: (At-Tahiyyatulilah, was-walawtu wat-tayyibatu. As-Salamu alaika ayyuhan-Nabiyyu wa rahmatullilahi wa barakatuhu, As-Salamu alina wa ala ibadillahis-salihin. Ashahadu an la ilaha illallah, wa ashhadu anna Muhammadan abduha wa Raduluh.) 'All greetings, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that none has the right to be worshiped but Allah. and I testify that Muhammad is His slave and His Messenger.\"And the Tashah-hud for Al-Hajjah is: 'Indeed all praise is due to Allah, we seek His aid, and we seek His forgiveness, and we seek refuge with Allah from the evils of our souls and the mischief of our deeds. (Innal-Hamdlillahi nasta'inuhu, wa nastaghfirhu, wa na'udhu billahi min sharuri anfusina, wa sayy'ita a'malina, man yahdihi, sala mudilla lahu, wa manyudlil, fala Hadiya lahu, wa ashadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh) 'Whoever He guides - meaning Allah - then here is none to lead him astray, and whomever He misleads, then there is no guide for him. I testify that none has the right to be worshipped but Allah, and I testify that Muhammad is His worshipper and Messenger.'\"\nHe said: \"And he recited three Ayat.\"","reference":"Jami` at-Tirmidhi 1105, Book 11, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of Tashah-hud in Salat and how is it recited?","id":"tirmidhi-11-26"},{"hadith-eng":"The Messenger of Allah said: \"Every Khutbah that does not have the Tashah-hud in it, then it is like a severed hand.\"","reference":"Jami` at-Tirmidhi 1106, Book 11, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of including Tashah-hud in a Khutbah?","id":"tirmidhi-11-27"},{"hadith-eng":"The Prophet said: \"A matron should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1107, Book 11, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of consulting a matron before her marriage in Islamic teachings?","id":"tirmidhi-11-28"},{"hadith-eng":"The Messenger of Allah said: \"The matron has more right to herself than her Wali, and the virgin is to give permission for herself, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1108, Book 11, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What rights does a matron have in making decisions about her marriage?","id":"tirmidhi-11-29"},{"hadith-eng":"The Messenger of Allah said: \"An orphan is to be consulted about herself, then if she is silent that is her permission, and if she refuses, then do not authorize it (the marriage) for her\" (meaning: when she attains the age of puberty and refuses it.)","reference":"Jami` at-Tirmidhi 1109, Book 11, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of consulting an orphan about her marriage in Islamic teachings?","id":"tirmidhi-11-30"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman is given in marriage by two Wali, then her case is in accordance with the first of them, and whoever sells something to two men, then it is for the first of them.\"","reference":"Jami` at-Tirmidhi 1110, Book 11, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the role of a Wali in a woman's marriage according to Islamic teachings?","id":"tirmidhi-11-31"},{"hadith-eng":"The Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1111, Book 11, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of obtaining permission from an owner for a slave to get married in Islamic teachings?","id":"tirmidhi-11-32"},{"hadith-eng":"Abdullah narrated that the Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1112, Book 11, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of obtaining permission from an owner for a slave's marriage in Islamic teachings?","id":"tirmidhi-11-33"},{"hadith-eng":"\"A woman from Banu Fazarah was married for (the dowry of) two sandals. So the Messenger of Allah said to her: 'Do you approve of (exchanging) yourself and your wealth for two sandals?' She said: 'Yes.'\" He said: \"So he permitted it.\"","reference":"Jami` at-Tirmidhi 1113, Book 11, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of a woman's consent in marriage according to Islamic teachings?","id":"tirmidhi-11-34"},{"hadith-eng":"A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"","reference":"Jami` at-Tirmidhi 1114, Book 11, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of offering a dowry in an Islamic marriage?","id":"tirmidhi-11-35"},{"hadith-eng":"\"The Messenger of Allah emancipated Safiyyah and he made her emancipation her dowry.\"","reference":"Jami` at-Tirmidhi 1115, Book 11, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of emancipation in Islamic marriage customs?","id":"tirmidhi-11-36"},{"hadith-eng":"\"Three will receive their reward twice: A slave who fulfills the rights of Allah and the rights of his owners, then he will be given his reward twice. And a man who has a beautiful slave girl, so he teaches her good manners, then he frees her, then he married her seeking the Face of Allah by that; then he will be given his reward twice. And a man who believed in an earlier Book, then another Book came to him and he believed in it; then he will be given his reward twice.\"","reference":"Jami` at-Tirmidhi 1116, Book 11, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the conditions under which a person can receive their reward twice according to Islamic teachings?","id":"tirmidhi-11-37"},{"hadith-eng":"The Prophet said: \"Whichever man married a woman and entered into her, then it is not lawful for him to marry her daughter. If he did not enter into her then he may marry her daughter. And whichever man married a woman and he entered into her, or he did  not enter into her, then it is not lawful for him to marry her mother.\"","reference":"Jami` at-Tirmidhi 1117, Book 11, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the marital restrictions regarding marrying a woman's daughter in Islamic law?","id":"tirmidhi-11-38"},{"hadith-eng":"\"The wife of Rifa'ah Al-Qurzi came to the Messenger of Allah and said: 'I was with Rifa'ah and he divorced me irrevocably. Then I married Abdur-Rahman bin Az-Zubair, but he only has the likes of the fringe of a garment.' So he said: 'Perhaps you want me to return to Rifa'ah? No, not until you taste his sweetness, and he tastes your sweetness.'\"","reference":"Jami` at-Tirmidhi 1118, Book 11, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of irrevocable divorce in Islamic law?","id":"tirmidhi-11-39"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1119, Book 11, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the curse mentioned by the Prophet in relation to certain marital practices?","id":"tirmidhi-11-40"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1120, Book 11, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the curse mentioned by the Prophet in relation to certain marital practices?","id":"tirmidhi-11-41"},{"hadith-eng":"\"The Prophet prohibited the Mut'ah with women, and the meat of domestic donkeys during (the campaign of) Khaibar.\"","reference":"Jami` at-Tirmidhi 1121, Book 11, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the prohibition of Mut'ah in Islamic teachings?","id":"tirmidhi-11-42"},{"hadith-eng":"Ibn Abbas said: \"Mut'ah was only during the beginning of Islam. A man would arrive in a land that he was not familiar with so he would marry a woman for the extent of time that he thought he would remain there. So his Mut'ah was upheld and his case was fine until the (following) Ayah was revealed: Except their wives or what their right hands possess. Then every private part other than those became unlawful.\"","reference":"Jami` at-Tirmidhi 1122, Book 11, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #1","question":"What was the practice of Mut'ah during the early period of Islam?","id":"tirmidhi-11-43"},{"hadith-eng":"The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"","reference":"Jami` at-Tirmidhi 1123, Book 11, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the prohibited practices mentioned in Islam regarding property and marriage?","id":"tirmidhi-11-44"},{"hadith-eng":"\"The Prophet prohibited Shighar.\"","reference":"Jami` at-Tirmidhi 1124, Book 11, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is Shighar and why is it prohibited in Islam?","id":"tirmidhi-11-45"},{"hadith-eng":"\"The Prophet prohibited marrying a woman along with her paternal aunt or along with her maternal aunt.\"","reference":"Jami` at-Tirmidhi 1125, Book 11, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the restrictions on marrying close relatives in Islam?","id":"tirmidhi-11-46"},{"hadith-eng":"\"The Messenger of Allah prohibited that a woman be married along with her paternal aunt, or the paternal aunt along with her brother's daughter, or a woman with her maternal aunt, or the maternal aunt along with her sister's daughter, and the younger is not to be married with the older, nor the older with the younger.\"","reference":"Jami` at-Tirmidhi 1126, Book 11, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the restrictions on marrying relatives in Islamic law?","id":"tirmidhi-11-47"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"","reference":"Jami` at-Tirmidhi 1127, Book 11, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fulfilling conditions related to marital relations in Islam?","id":"tirmidhi-11-48"},{"hadith-eng":"\"Ghilan bin Salamah Ath-Thaqafi accepted Islam and he had ten wives in Jahiliyyah who accepted Islam along with him. So the Prophet ordered (him) to chose four (of them).\"","reference":"Jami` at-Tirmidhi 1128, Book 11, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding the number of wives a man can have?","id":"tirmidhi-11-49"},{"hadith-eng":"He heard Ibn Fairuz Ad-Dhailami narrating from his father: \"I went to the Prophet and said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So the Messenger of Allah said: 'Chose whichever of them you will.'\"","reference":"Jami` at-Tirmidhi 1129, Book 11, Hadith 51","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding marrying close relatives?","id":"tirmidhi-11-50"},{"hadith-eng":"\"I said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So Messenger of Allah said: 'Chose whichever of them you will.'\"]","reference":"Jami` at-Tirmidhi 1130, Book 11, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding marrying close relatives?","id":"tirmidhi-11-51"},{"hadith-eng":"the Prophet said: \"Whoever believes in Allah and the Last Day, then he does not levy his water on someone else's child.\"","reference":"Jami` at-Tirmidhi 1131, Book 11, Hadith 53","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of belief in Allah and the Last Day in guiding ethical behavior?","id":"tirmidhi-11-52"},{"hadith-eng":"\"We got some captives on the day of Awtas, and they had husbands among their peopled. They mentioned that to the Messenger of Allah, so the following was revealed: And women who are already married, except those whom your right hands posses.","reference":"Jami` at-Tirmidhi 1132, Book 11, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the revelation regarding women who are already married in the context of captives?","id":"tirmidhi-11-53"},{"hadith-eng":"\"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 1133, Book 11, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of prohibiting the price of a dog in Islamic teachings?","id":"tirmidhi-11-54"},{"hadith-eng":"The Messenger of Allah said: \"A man is not to sell over his brother's sale, nor is he to propose to whom his brother has proposed.\"","reference":"Jami` at-Tirmidhi 1134, Book 11, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #1","question":"What ethical considerations should be taken into account when engaging in business transactions with others?","id":"tirmidhi-11-55"},{"hadith-eng":"\"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"","reference":"Jami` at-Tirmidhi 1135, Book 11, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the living arrangements for a woman during her Iddah period?","id":"tirmidhi-11-56"},{"hadith-eng":"\"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"","reference":"Jami` at-Tirmidhi 1136, Book 11, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on the practice of Azl (coitus interruptus)?","id":"tirmidhi-11-57"},{"hadith-eng":"\"We practiced Azl while the Qur'an was being revealed.\"","reference":"Jami` at-Tirmidhi 1137, Book 11, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the practice of Azl and how was it viewed during the time of the Prophet?","id":"tirmidhi-11-58"},{"hadith-eng":"\"Azl was mentined before the Messenger of Allah and he said: 'Why would one of you do that?'\"","reference":"Jami` at-Tirmidhi 1138, Book 11, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the practice of 'Azl and why might it be questioned in Islamic teachings?","id":"tirmidhi-11-59"},{"hadith-eng":"He (Abu Qilabah) said: \"If I wish, I could say: 'The Messenger of Allah said'\" but he said: \"The Sunnah when a man married a virgin after he already has a wife, is that he stays with her seven (nights). And when he married a matron when he already has a wife, he stays with her three (nights).\"","reference":"Jami` at-Tirmidhi 1139, Book 11, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the prescribed practice for a man who marries a virgin while already having a wife?","id":"tirmidhi-11-60"},{"hadith-eng":"The Prophet would divide (his time) equally between his wives and said: \"O Allah! This is my division in what I have control over, so do not punish me for what You have control over which I do not have control over.\"","reference":"Jami` at-Tirmidhi 1140, Book 11, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet Muhammad demonstrate fairness in his relationships with his wives?","id":"tirmidhi-11-61"},{"hadith-eng":"The Messenger of Allah said: \"When a man has two wives and he is not just between them, he will come on the Day of Judgment with one side drooping.\"","reference":"Jami` at-Tirmidhi 1141, Book 11, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of not being just between multiple wives in Islam?","id":"tirmidhi-11-62"},{"hadith-eng":"\"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"","reference":"Jami` at-Tirmidhi 1142, Book 11, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of a new dowry in the context of remarriage in Islamic tradition?","id":"tirmidhi-11-63"},{"hadith-eng":"\"The Prophet returned his daughter Zainab to Abul-As bin Ar-Rabi after six years in the first marriage without renewing the marriage.\"","reference":"Jami` at-Tirmidhi 1143, Book 11, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's decision to return his daughter to her husband without renewing the marriage contract?","id":"tirmidhi-11-64"},{"hadith-eng":"\"A man became a Muslim during the time of the Prophet, then his wife became a Muslim, so he said: 'O Messenger of Allah! She accepted Islam along with me, so return her to me.' So he returned her to him.\"","reference":"Jami` at-Tirmidhi 1144, Book 11, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of a spouse accepting Islam in relation to their marital status?","id":"tirmidhi-11-65"},{"hadith-eng":"Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.","reference":"Jami` at-Tirmidhi 1145, Book 11, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on dowry if it was not stipulated before the marriage and the husband dies before consummation?","id":"tirmidhi-11-66"},{"hadith-eng":"The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"","reference":"Jami` at-Tirmidhi 1080, Book 11, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is modesty viewed in the teachings of the Prophets?","id":"tirmidhi-11-67"},{"hadith-eng":"\"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"","reference":"Jami` at-Tirmidhi 1081, Book 11, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does marriage help in lowering the gaze and protecting one's chastity?","id":"tirmidhi-11-68"},{"hadith-eng":"The Prophet prohibited celibacy.","reference":"Jami` at-Tirmidhi 1082, Book 11, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might celibacy be discouraged in Islam?","id":"tirmidhi-11-69"},{"hadith-eng":"\"The Messenger of Allah refused Uthman bin Ma'zun (when he asked) regarding celibacy, and if he had permitted it for him, then we would have castrated ourselves.\"","reference":"Jami` at-Tirmidhi 1083, Book 11, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad respond to requests for celibacy among his companions?","id":"tirmidhi-11-70"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with proposes to (someone under the care) of one of you, then marry to him. If you do not do so, then there will be turmoil (Fitnah) in the land and abounding discord (Fasad).\"","reference":"Jami` at-Tirmidhi 1084, Book 11, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can neglecting proper criteria in marriage proposals lead to societal issues?","id":"tirmidhi-11-71"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"\nHe said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.","reference":"Jami` at-Tirmidhi 1085, Book 11, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the potential consequences of not marrying someone with good religion and character?","id":"tirmidhi-11-72"},{"hadith-eng":"The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"","reference":"Jami` at-Tirmidhi 1086, Book 11, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is religious commitment emphasized as an important factor in selecting a spouse?","id":"tirmidhi-11-73"},{"hadith-eng":"Al-Mughirah bin Shu'bah proposed to a woman, so the Prophet said: \"Look at her, for indeed that is more likely to make things better between the two of you.\"","reference":"Jami` at-Tirmidhi 1087, Book 11, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can looking at a prospective partner contribute to a successful marriage?","id":"tirmidhi-11-74"},{"hadith-eng":"The Messenger of Allah said: \"The distinction between the lawful and the unlawful  is the Duff and the voice.\"","reference":"Jami` at-Tirmidhi 1088, Book 11, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the voice play a role in differentiating between what is permissible and impermissible in Islamic teachings?","id":"tirmidhi-11-75"},{"hadith-eng":"The Messenger of Allah said: \"Publicize this marriage, and hold it in the Masjid, and beat the Duff for it.\"","reference":"Jami` at-Tirmidhi 1089, Book 11, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is it recommended to hold a marriage ceremony in the Masjid?","id":"tirmidhi-11-76"},{"hadith-eng":"\"The morning after the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the Duff and reciting verses mourning my father who had been killed in the battle of Badr. One of them said: 'Among us is a Prophet who knows what will happen tomorrow.' On that the Prophet said: 'Stop saying this, and keep on saying what you were saying before.'\"","reference":"Jami` at-Tirmidhi 1090, Book 11, Hadith 11","grade":"","question #":"question #2","question":"How does Islam view the use of musical instruments like the Duff during celebrations?","id":"tirmidhi-11-77"},{"hadith-eng":"When supplicating for the newlywed, the Prophet would say: (Barak Allahu laka wa baraka alaik, wa jama'a bainakuma fi khair.) \"May Allah bless you and send blessings upon you, and bring goodness between you.\"","reference":"Jami` at-Tirmidhi 1091, Book 11, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet's supplication reflect the importance of seeking goodness in marital relationships?","id":"tirmidhi-11-78"},{"hadith-eng":"The Messenger of Allah said: \"If anyone of you, when having sexual intercourse with his wife, says: (Bismillah, Allahumma jannibnash-Shaitana wa jannibish-Shaitana ma razaqtana) 'In the Name of Allah, O Allah! Protect me from Shaitan and protect what you bestow upon us from Shaitan' - then if Allah decrees that they should have a child, Shaitan will not be able to harm him.'\"","reference":"Jami` at-Tirmidhi 1092, Book 11, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can a couple seek protection from Shaitan during intimate moments?","id":"tirmidhi-11-79"},{"hadith-eng":"\"The Messenger of Allah married me in Shawwal, and he took up residence with me in Shawwal.\"","reference":"Jami` at-Tirmidhi 1093, Book 11, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of marriage relate to cultural or religious practices in Islam?","id":"tirmidhi-11-80"},{"hadith-eng":"The Messenger of Allah saw some traces of saffron on `Abdur-Rahman bin `Awf so he said: 'What is this?' He said: 'I married a woman for the amount of gold equal to a date stone.' So he said: 'May Allah bless you. Have a banquet, even if with only one sheep.'\"","reference":"Jami` at-Tirmidhi 1094, Book 11, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view simplicity in marriage ceremonies?","id":"tirmidhi-11-81"},{"hadith-eng":"\"The Prophet had a banquet for Safiyyah bint Huyayy with Sawiq and dates.\"","reference":"Jami` at-Tirmidhi 1095, Book 11, Hadith 16","grade":"","question #":"question #2","question":"Who was the guest of honor at the Prophet's banquet mentioned in the narration?","id":"tirmidhi-11-82"},{"hadith-eng":"Others have reported this Hadith from Ibn Uyainah, from Az-Zuhri, from Anas, and they did not mention \"from Wa'il, from his son Nawf\" in it.","reference":"Jami` at-Tirmidhi 1096, Book 11, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #2","question":"How do variations in the chain of narrators affect the authenticity of a hadith?","id":"tirmidhi-11-83"},{"hadith-eng":"The Messenger of Allah said: \"Having food on the first day is was is obligatory, and having food on the second day is Sunnah, and having food on the third day is to be heard of, and whoever wants to be heard of, Allah will make him heard of.\"","reference":"Jami` at-Tirmidhi 1097, Book 11, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the act of having food on the second day viewed in terms of Sunnah?","id":"tirmidhi-11-84"},{"hadith-eng":"The Messenger of Allah said: \"Accept the invitation when you are offered.\"","reference":"Jami` at-Tirmidhi 1098, Book 11, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does accepting invitations relate to social obligations in Islamic teachings?","id":"tirmidhi-11-85"},{"hadith-eng":"\"A man named Abu Shu'aib came to a slave of his, who was a butcher, and said: 'Prepare some food for me that will be sufficient for five, for I have seen hunger in the face of the Messenger of Allah.' So he prepared some food. Then he sent a message to the Prophet inviting him and those who were sitting with him. When the Prophet stood, he was followed by a man who was not with them when they were invited. When the Messenger of Allah arrive at the door he said to the owner of the house: 'A man who was not with us when you invited us followed us, if you permit him, he will enter.'\" He said: We have permitted him, let him enter.\"","reference":"Jami` at-Tirmidhi 1099, Book 11, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet show hospitality towards unexpected guests?","id":"tirmidhi-11-86"},{"hadith-eng":"\"I married a woman and went to the Prophet, he said: 'O Jabir! Have you married?' I said: 'Yes.' He said: 'A virgin or a matron?' I said: 'A matron.' He said: 'Why didn't you marry a young girl, so that you may play with her and she with you?' I said: 'O Messenger of Allah! Abdullah (his father) died and left behind seven - or nine - daughter, so I have brought someone who can look after them.'\" (He said:) \"So he supplicated for me.\"","reference":"Jami` at-Tirmidhi 1100, Book 11, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can marriage decisions be influenced by family responsibilities?","id":"tirmidhi-11-87"},{"hadith-eng":"the Messenger of Allah said: \"There is no marriage except with a Wali.\"","reference":"Jami` at-Tirmidhi 1101, Book 11, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the presence of a Wali considered essential for a valid marriage?","id":"tirmidhi-11-88"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman married without the permission of her Wali her marriage is invalid, her marriage is invalid, her marriage is invalid. If he entered into her, then the Mahr is for her in lieu of what he enjoyed from her private part. If they disagree, then the Sultan is the Wali for one who has no Wali.\"","reference":"Jami` at-Tirmidhi 1102, Book 11, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the consequences of a woman marrying without the permission of her Wali?","id":"tirmidhi-11-89"},{"hadith-eng":"the Prophet said: \"The adulteresses are the ones who marry themselves without Bayyinah (proof).\"","reference":"Jami` at-Tirmidhi 1103, Book 11, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view self-marriage without proper evidence or witnesses?","id":"tirmidhi-11-90"},{"hadith-eng":"And he did not narrate it in Marfu form, and this is more correct.","reference":"Jami` at-Tirmidhi 1104, Book 11, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the classification of a hadith as Marfu affect its acceptance and application?","id":"tirmidhi-11-91"},{"hadith-eng":"\"The Messenger of Allah taught us the Tashah-hud for Salat and the Tashah-hud for Al-Hajjah.\" He said: \"The Tashah-hud for Salat is: (At-Tahiyyatulilah, was-walawtu wat-tayyibatu. As-Salamu alaika ayyuhan-Nabiyyu wa rahmatullilahi wa barakatuhu, As-Salamu alina wa ala ibadillahis-salihin. Ashahadu an la ilaha illallah, wa ashhadu anna Muhammadan abduha wa Raduluh.) 'All greetings, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that none has the right to be worshiped but Allah. and I testify that Muhammad is His slave and His Messenger.\"And the Tashah-hud for Al-Hajjah is: 'Indeed all praise is due to Allah, we seek His aid, and we seek His forgiveness, and we seek refuge with Allah from the evils of our souls and the mischief of our deeds. (Innal-Hamdlillahi nasta'inuhu, wa nastaghfirhu, wa na'udhu billahi min sharuri anfusina, wa sayy'ita a'malina, man yahdihi, sala mudilla lahu, wa manyudlil, fala Hadiya lahu, wa ashadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh) 'Whoever He guides - meaning Allah - then here is none to lead him astray, and whomever He misleads, then there is no guide for him. I testify that none has the right to be worshipped but Allah, and I testify that Muhammad is His worshipper and Messenger.'\"\nHe said: \"And he recited three Ayat.\"","reference":"Jami` at-Tirmidhi 1105, Book 11, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the components of the Tashah-hud for Al-Hajjah and its purpose?","id":"tirmidhi-11-92"},{"hadith-eng":"The Messenger of Allah said: \"Every Khutbah that does not have the Tashah-hud in it, then it is like a severed hand.\"","reference":"Jami` at-Tirmidhi 1106, Book 11, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is a Khutbah without Tashah-hud compared to a severed hand?","id":"tirmidhi-11-93"},{"hadith-eng":"The Prophet said: \"A matron should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1107, Book 11, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is a virgin's consent for marriage determined according to Islamic principles?","id":"tirmidhi-11-94"},{"hadith-eng":"The Messenger of Allah said: \"The matron has more right to herself than her Wali, and the virgin is to give permission for herself, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1108, Book 11, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is a virgin's consent for marriage determined in Islamic teachings?","id":"tirmidhi-11-95"},{"hadith-eng":"The Messenger of Allah said: \"An orphan is to be consulted about herself, then if she is silent that is her permission, and if she refuses, then do not authorize it (the marriage) for her\" (meaning: when she attains the age of puberty and refuses it.)","reference":"Jami` at-Tirmidhi 1109, Book 11, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does silence from an orphan girl signify her consent in the context of marriage?","id":"tirmidhi-11-96"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman is given in marriage by two Wali, then her case is in accordance with the first of them, and whoever sells something to two men, then it is for the first of them.\"","reference":"Jami` at-Tirmidhi 1110, Book 11, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic law prioritize claims in cases of multiple agreements, such as marriage or sales?","id":"tirmidhi-11-97"},{"hadith-eng":"The Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1111, Book 11, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law view the marriage of a slave without the owner's consent?","id":"tirmidhi-11-98"},{"hadith-eng":"Abdullah narrated that the Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1112, Book 11, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law view the marriage of a slave without the owner's consent?","id":"tirmidhi-11-99"},{"hadith-eng":"\"A woman from Banu Fazarah was married for (the dowry of) two sandals. So the Messenger of Allah said to her: 'Do you approve of (exchanging) yourself and your wealth for two sandals?' She said: 'Yes.'\" He said: \"So he permitted it.\"","reference":"Jami` at-Tirmidhi 1113, Book 11, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the concept of dowry in marriage contracts?","id":"tirmidhi-11-100"},{"hadith-eng":"A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"","reference":"Jami` at-Tirmidhi 1114, Book 11, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the memorization of the Qur'an play a role in marriage proposals?","id":"tirmidhi-11-101"},{"hadith-eng":"\"The Messenger of Allah emancipated Safiyyah and he made her emancipation her dowry.\"","reference":"Jami` at-Tirmidhi 1115, Book 11, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can a dowry be fulfilled in an Islamic marriage?","id":"tirmidhi-11-102"},{"hadith-eng":"\"Three will receive their reward twice: A slave who fulfills the rights of Allah and the rights of his owners, then he will be given his reward twice. And a man who has a beautiful slave girl, so he teaches her good manners, then he frees her, then he married her seeking the Face of Allah by that; then he will be given his reward twice. And a man who believed in an earlier Book, then another Book came to him and he believed in it; then he will be given his reward twice.\"","reference":"Jami` at-Tirmidhi 1116, Book 11, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does fulfilling the rights of Allah and one's owners impact a slave's reward in Islam?","id":"tirmidhi-11-103"},{"hadith-eng":"The Prophet said: \"Whichever man married a woman and entered into her, then it is not lawful for him to marry her daughter. If he did not enter into her then he may marry her daughter. And whichever man married a woman and he entered into her, or he did  not enter into her, then it is not lawful for him to marry her mother.\"","reference":"Jami` at-Tirmidhi 1117, Book 11, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #2","question":"Under what conditions is it permissible for a man to marry the daughter of a woman he has married?","id":"tirmidhi-11-104"},{"hadith-eng":"\"The wife of Rifa'ah Al-Qurzi came to the Messenger of Allah and said: 'I was with Rifa'ah and he divorced me irrevocably. Then I married Abdur-Rahman bin Az-Zubair, but he only has the likes of the fringe of a garment.' So he said: 'Perhaps you want me to return to Rifa'ah? No, not until you taste his sweetness, and he tastes your sweetness.'\"","reference":"Jami` at-Tirmidhi 1118, Book 11, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the conditions for a woman to remarry her previous husband after an irrevocable divorce?","id":"tirmidhi-11-105"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1119, Book 11, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #2","question":"Who are the individuals involved in the practice that the Prophet cursed?","id":"tirmidhi-11-106"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1120, Book 11, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the implications of engaging in practices that are cursed by the Prophet in Islamic teachings?","id":"tirmidhi-11-107"},{"hadith-eng":"\"The Prophet prohibited the Mut'ah with women, and the meat of domestic donkeys during (the campaign of) Khaibar.\"","reference":"Jami` at-Tirmidhi 1121, Book 11, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why was the consumption of domestic donkey meat prohibited during the campaign of Khaibar?","id":"tirmidhi-11-108"},{"hadith-eng":"Ibn Abbas said: \"Mut'ah was only during the beginning of Islam. A man would arrive in a land that he was not familiar with so he would marry a woman for the extent of time that he thought he would remain there. So his Mut'ah was upheld and his case was fine until the (following) Ayah was revealed: Except their wives or what their right hands possess. Then every private part other than those became unlawful.\"","reference":"Jami` at-Tirmidhi 1122, Book 11, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the revelation of a specific Ayah change the permissibility of Mut'ah?","id":"tirmidhi-11-109"},{"hadith-eng":"The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"","reference":"Jami` at-Tirmidhi 1123, Book 11, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of condemning forceful acquisition of property in Islamic teachings?","id":"tirmidhi-11-110"},{"hadith-eng":"\"The Prophet prohibited Shighar.\"","reference":"Jami` at-Tirmidhi 1124, Book 11, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the implications of prohibiting certain marriage practices in Islamic law?","id":"tirmidhi-11-111"},{"hadith-eng":"\"The Prophet prohibited marrying a woman along with her paternal aunt or along with her maternal aunt.\"","reference":"Jami` at-Tirmidhi 1125, Book 11, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it prohibited to marry a woman along with her paternal or maternal aunt?","id":"tirmidhi-11-112"},{"hadith-eng":"\"The Messenger of Allah prohibited that a woman be married along with her paternal aunt, or the paternal aunt along with her brother's daughter, or a woman with her maternal aunt, or the maternal aunt along with her sister's daughter, and the younger is not to be married with the older, nor the older with the younger.\"","reference":"Jami` at-Tirmidhi 1126, Book 11, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it prohibited to marry a woman along with her paternal or maternal aunt?","id":"tirmidhi-11-113"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"","reference":"Jami` at-Tirmidhi 1127, Book 11, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why are certain conditions considered most deserving of fulfillment in Islamic teachings?","id":"tirmidhi-11-114"},{"hadith-eng":"\"Ghilan bin Salamah Ath-Thaqafi accepted Islam and he had ten wives in Jahiliyyah who accepted Islam along with him. So the Prophet ordered (him) to chose four (of them).\"","reference":"Jami` at-Tirmidhi 1128, Book 11, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) address the issue of polygamy when someone converted to Islam with multiple wives?","id":"tirmidhi-11-115"},{"hadith-eng":"He heard Ibn Fairuz Ad-Dhailami narrating from his father: \"I went to the Prophet and said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So the Messenger of Allah said: 'Chose whichever of them you will.'\"","reference":"Jami` at-Tirmidhi 1129, Book 11, Hadith 51","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam address the issue of having multiple wives who are closely related?","id":"tirmidhi-11-116"},{"hadith-eng":"\"I said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So Messenger of Allah said: 'Chose whichever of them you will.'\"]","reference":"Jami` at-Tirmidhi 1130, Book 11, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam address the issue of having multiple wives who are closely related?","id":"tirmidhi-11-117"},{"hadith-eng":"the Prophet said: \"Whoever believes in Allah and the Last Day, then he does not levy his water on someone else's child.\"","reference":"Jami` at-Tirmidhi 1131, Book 11, Hadith 53","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic teaching address the issue of personal responsibility in relationships?","id":"tirmidhi-11-118"},{"hadith-eng":"\"We got some captives on the day of Awtas, and they had husbands among their peopled. They mentioned that to the Messenger of Allah, so the following was revealed: And women who are already married, except those whom your right hands posses.","reference":"Jami` at-Tirmidhi 1132, Book 11, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic law address the issue of captives who have existing marriages?","id":"tirmidhi-11-119"},{"hadith-eng":"\"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 1133, Book 11, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the dowry of a fornicator considered impermissible in Islam?","id":"tirmidhi-11-120"},{"hadith-eng":"The Messenger of Allah said: \"A man is not to sell over his brother's sale, nor is he to propose to whom his brother has proposed.\"","reference":"Jami` at-Tirmidhi 1134, Book 11, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam guide individuals in maintaining fairness and respect in marriage proposals?","id":"tirmidhi-11-121"},{"hadith-eng":"\"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"","reference":"Jami` at-Tirmidhi 1135, Book 11, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) advise Fatimah bint Qais regarding her suitors after her Iddah period?","id":"tirmidhi-11-122"},{"hadith-eng":"\"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"","reference":"Jami` at-Tirmidhi 1136, Book 11, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic teaching address claims made by other religious groups regarding family planning practices?","id":"tirmidhi-11-123"},{"hadith-eng":"\"We practiced Azl while the Qur'an was being revealed.\"","reference":"Jami` at-Tirmidhi 1137, Book 11, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the revelation of the Qur'an relate to the practice of Azl?","id":"tirmidhi-11-124"},{"hadith-eng":"\"Azl was mentined before the Messenger of Allah and he said: 'Why would one of you do that?'\"","reference":"Jami` at-Tirmidhi 1138, Book 11, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) respond to the mention of 'Azl?","id":"tirmidhi-11-125"},{"hadith-eng":"He (Abu Qilabah) said: \"If I wish, I could say: 'The Messenger of Allah said'\" but he said: \"The Sunnah when a man married a virgin after he already has a wife, is that he stays with her seven (nights). And when he married a matron when he already has a wife, he stays with her three (nights).\"","reference":"Jami` at-Tirmidhi 1139, Book 11, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many nights should a man stay with a new wife if she is a matron and he already has another wife?","id":"tirmidhi-11-126"},{"hadith-eng":"The Prophet would divide (his time) equally between his wives and said: \"O Allah! This is my division in what I have control over, so do not punish me for what You have control over which I do not have control over.\"","reference":"Jami` at-Tirmidhi 1140, Book 11, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of seeking Allah's guidance in matters beyond human control?","id":"tirmidhi-11-127"},{"hadith-eng":"The Messenger of Allah said: \"When a man has two wives and he is not just between them, he will come on the Day of Judgment with one side drooping.\"","reference":"Jami` at-Tirmidhi 1141, Book 11, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam emphasize fairness in marital relationships?","id":"tirmidhi-11-128"},{"hadith-eng":"\"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"","reference":"Jami` at-Tirmidhi 1142, Book 11, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of dowry play a role in Islamic marriages?","id":"tirmidhi-11-129"},{"hadith-eng":"\"The Prophet returned his daughter Zainab to Abul-As bin Ar-Rabi after six years in the first marriage without renewing the marriage.\"","reference":"Jami` at-Tirmidhi 1143, Book 11, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does this event reflect the Islamic perspective on marriage and reconciliation?","id":"tirmidhi-11-130"},{"hadith-eng":"\"A man became a Muslim during the time of the Prophet, then his wife became a Muslim, so he said: 'O Messenger of Allah! She accepted Islam along with me, so return her to me.' So he returned her to him.\"","reference":"Jami` at-Tirmidhi 1144, Book 11, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the acceptance of Islam by both spouses affect their marriage according to Islamic teachings?","id":"tirmidhi-11-131"},{"hadith-eng":"Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.","reference":"Jami` at-Tirmidhi 1145, Book 11, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the dowry determined for a woman if it was not specified in the marriage contract?","id":"tirmidhi-11-132"},{"hadith-eng":"The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"","reference":"Jami` at-Tirmidhi 1080, Book 11, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of using fragrance in Islamic tradition?","id":"tirmidhi-11-133"},{"hadith-eng":"\"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"","reference":"Jami` at-Tirmidhi 1081, Book 11, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"What alternative is suggested for those who are unable to marry?","id":"tirmidhi-11-134"},{"hadith-eng":"The Prophet prohibited celibacy.","reference":"Jami` at-Tirmidhi 1082, Book 11, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does marriage play a role in Islamic teachings?","id":"tirmidhi-11-135"},{"hadith-eng":"\"The Messenger of Allah refused Uthman bin Ma'zun (when he asked) regarding celibacy, and if he had permitted it for him, then we would have castrated ourselves.\"","reference":"Jami` at-Tirmidhi 1083, Book 11, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What might have been the consequences if celibacy was permitted in Islam according to this narration?","id":"tirmidhi-11-136"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with proposes to (someone under the care) of one of you, then marry to him. If you do not do so, then there will be turmoil (Fitnah) in the land and abounding discord (Fasad).\"","reference":"Jami` at-Tirmidhi 1084, Book 11, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of religion and character in choosing a spouse?","id":"tirmidhi-11-137"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"\nHe said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.","reference":"Jami` at-Tirmidhi 1085, Book 11, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islam view the importance of character and religion in marriage proposals?","id":"tirmidhi-11-138"},{"hadith-eng":"The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"","reference":"Jami` at-Tirmidhi 1086, Book 11, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does wealth influence the decision of marriage according to Islamic teachings?","id":"tirmidhi-11-139"},{"hadith-eng":"Al-Mughirah bin Shu'bah proposed to a woman, so the Prophet said: \"Look at her, for indeed that is more likely to make things better between the two of you.\"","reference":"Jami` at-Tirmidhi 1087, Book 11, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does Islam provide regarding proposals and marriage compatibility?","id":"tirmidhi-11-140"},{"hadith-eng":"The Messenger of Allah said: \"The distinction between the lawful and the unlawful  is the Duff and the voice.\"","reference":"Jami` at-Tirmidhi 1088, Book 11, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of using musical instruments like the Duff in Islamic law?","id":"tirmidhi-11-141"},{"hadith-eng":"The Messenger of Allah said: \"Publicize this marriage, and hold it in the Masjid, and beat the Duff for it.\"","reference":"Jami` at-Tirmidhi 1089, Book 11, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the role of music or instruments like the Duff in Islamic marriage celebrations?","id":"tirmidhi-11-142"},{"hadith-eng":"\"The morning after the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the Duff and reciting verses mourning my father who had been killed in the battle of Badr. One of them said: 'Among us is a Prophet who knows what will happen tomorrow.' On that the Prophet said: 'Stop saying this, and keep on saying what you were saying before.'\"","reference":"Jami` at-Tirmidhi 1090, Book 11, Hadith 11","grade":"","question #":"question #3","question":"What is the Islamic perspective on predicting future events?","id":"tirmidhi-11-143"},{"hadith-eng":"When supplicating for the newlywed, the Prophet would say: (Barak Allahu laka wa baraka alaik, wa jama'a bainakuma fi khair.) \"May Allah bless you and send blessings upon you, and bring goodness between you.\"","reference":"Jami` at-Tirmidhi 1091, Book 11, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the key elements of the supplication made by the Prophet for newlyweds?","id":"tirmidhi-11-144"},{"hadith-eng":"The Messenger of Allah said: \"If anyone of you, when having sexual intercourse with his wife, says: (Bismillah, Allahumma jannibnash-Shaitana wa jannibish-Shaitana ma razaqtana) 'In the Name of Allah, O Allah! Protect me from Shaitan and protect what you bestow upon us from Shaitan' - then if Allah decrees that they should have a child, Shaitan will not be able to harm him.'\"","reference":"Jami` at-Tirmidhi 1092, Book 11, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the potential impact of reciting a specific supplication on the offspring conceived during marital relations?","id":"tirmidhi-11-145"},{"hadith-eng":"\"The Messenger of Allah married me in Shawwal, and he took up residence with me in Shawwal.\"","reference":"Jami` at-Tirmidhi 1093, Book 11, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the personal life of the Prophet Muhammad from his marriage to Aishah?","id":"tirmidhi-11-146"},{"hadith-eng":"The Messenger of Allah saw some traces of saffron on `Abdur-Rahman bin `Awf so he said: 'What is this?' He said: 'I married a woman for the amount of gold equal to a date stone.' So he said: 'May Allah bless you. Have a banquet, even if with only one sheep.'\"","reference":"Jami` at-Tirmidhi 1094, Book 11, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of giving a dowry in an Islamic marriage?","id":"tirmidhi-11-147"},{"hadith-eng":"\"The Prophet had a banquet for Safiyyah bint Huyayy with Sawiq and dates.\"","reference":"Jami` at-Tirmidhi 1095, Book 11, Hadith 16","grade":"","question #":"question #3","question":"What significance do dates and Sawiq hold in Islamic tradition or culture?","id":"tirmidhi-11-148"},{"hadith-eng":"Others have reported this Hadith from Ibn Uyainah, from Az-Zuhri, from Anas, and they did not mention \"from Wa'il, from his son Nawf\" in it.","reference":"Jami` at-Tirmidhi 1096, Book 11, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why is it important to identify each narrator in the chain of a hadith?","id":"tirmidhi-11-149"},{"hadith-eng":"The Messenger of Allah said: \"Having food on the first day is was is obligatory, and having food on the second day is Sunnah, and having food on the third day is to be heard of, and whoever wants to be heard of, Allah will make him heard of.\"","reference":"Jami` at-Tirmidhi 1097, Book 11, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does it mean to be 'heard of' in the context of this teaching?","id":"tirmidhi-11-150"},{"hadith-eng":"The Messenger of Allah said: \"Accept the invitation when you are offered.\"","reference":"Jami` at-Tirmidhi 1098, Book 11, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential benefits of accepting invitations according to Islamic principles?","id":"tirmidhi-11-151"},{"hadith-eng":"\"A man named Abu Shu'aib came to a slave of his, who was a butcher, and said: 'Prepare some food for me that will be sufficient for five, for I have seen hunger in the face of the Messenger of Allah.' So he prepared some food. Then he sent a message to the Prophet inviting him and those who were sitting with him. When the Prophet stood, he was followed by a man who was not with them when they were invited. When the Messenger of Allah arrive at the door he said to the owner of the house: 'A man who was not with us when you invited us followed us, if you permit him, he will enter.'\" He said: We have permitted him, let him enter.\"","reference":"Jami` at-Tirmidhi 1099, Book 11, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the etiquette of inviting guests from this incident?","id":"tirmidhi-11-152"},{"hadith-eng":"\"I married a woman and went to the Prophet, he said: 'O Jabir! Have you married?' I said: 'Yes.' He said: 'A virgin or a matron?' I said: 'A matron.' He said: 'Why didn't you marry a young girl, so that you may play with her and she with you?' I said: 'O Messenger of Allah! Abdullah (his father) died and left behind seven - or nine - daughter, so I have brought someone who can look after them.'\" (He said:) \"So he supplicated for me.\"","reference":"Jami` at-Tirmidhi 1100, Book 11, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the potential benefits of marrying a matron according to Islamic teachings?","id":"tirmidhi-11-153"},{"hadith-eng":"the Messenger of Allah said: \"There is no marriage except with a Wali.\"","reference":"Jami` at-Tirmidhi 1101, Book 11, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic law view marriages conducted without a Wali?","id":"tirmidhi-11-154"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman married without the permission of her Wali her marriage is invalid, her marriage is invalid, her marriage is invalid. If he entered into her, then the Mahr is for her in lieu of what he enjoyed from her private part. If they disagree, then the Sultan is the Wali for one who has no Wali.\"","reference":"Jami` at-Tirmidhi 1102, Book 11, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What happens to the Mahr if a marriage is conducted without a Wali's permission but consummated?","id":"tirmidhi-11-155"},{"hadith-eng":"the Prophet said: \"The adulteresses are the ones who marry themselves without Bayyinah (proof).\"","reference":"Jami` at-Tirmidhi 1103, Book 11, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences of marrying without Bayyinah in Islamic teachings?","id":"tirmidhi-11-156"},{"hadith-eng":"And he did not narrate it in Marfu form, and this is more correct.","reference":"Jami` at-Tirmidhi 1104, Book 11, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of a hadith being narrated in a non-Marfu form?","id":"tirmidhi-11-157"},{"hadith-eng":"\"The Messenger of Allah taught us the Tashah-hud for Salat and the Tashah-hud for Al-Hajjah.\" He said: \"The Tashah-hud for Salat is: (At-Tahiyyatulilah, was-walawtu wat-tayyibatu. As-Salamu alaika ayyuhan-Nabiyyu wa rahmatullilahi wa barakatuhu, As-Salamu alina wa ala ibadillahis-salihin. Ashahadu an la ilaha illallah, wa ashhadu anna Muhammadan abduha wa Raduluh.) 'All greetings, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that none has the right to be worshiped but Allah. and I testify that Muhammad is His slave and His Messenger.\"And the Tashah-hud for Al-Hajjah is: 'Indeed all praise is due to Allah, we seek His aid, and we seek His forgiveness, and we seek refuge with Allah from the evils of our souls and the mischief of our deeds. (Innal-Hamdlillahi nasta'inuhu, wa nastaghfirhu, wa na'udhu billahi min sharuri anfusina, wa sayy'ita a'malina, man yahdihi, sala mudilla lahu, wa manyudlil, fala Hadiya lahu, wa ashadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh) 'Whoever He guides - meaning Allah - then here is none to lead him astray, and whomever He misleads, then there is no guide for him. I testify that none has the right to be worshipped but Allah, and I testify that Muhammad is His worshipper and Messenger.'\"\nHe said: \"And he recited three Ayat.\"","reference":"Jami` at-Tirmidhi 1105, Book 11, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the Tashah-hud emphasize the concept of monotheism in Islam?","id":"tirmidhi-11-158"},{"hadith-eng":"The Messenger of Allah said: \"Every Khutbah that does not have the Tashah-hud in it, then it is like a severed hand.\"","reference":"Jami` at-Tirmidhi 1106, Book 11, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the essential components of a Khutbah in Islamic tradition?","id":"tirmidhi-11-159"},{"hadith-eng":"The Prophet said: \"A matron should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1107, Book 11, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the concept of silence imply in the context of a virgin's consent to marriage?","id":"tirmidhi-11-160"},{"hadith-eng":"The Messenger of Allah said: \"The matron has more right to herself than her Wali, and the virgin is to give permission for herself, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1108, Book 11, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of a virgin's silence in the context of giving permission for marriage?","id":"tirmidhi-11-161"},{"hadith-eng":"The Messenger of Allah said: \"An orphan is to be consulted about herself, then if she is silent that is her permission, and if she refuses, then do not authorize it (the marriage) for her\" (meaning: when she attains the age of puberty and refuses it.)","reference":"Jami` at-Tirmidhi 1109, Book 11, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #3","question":"What should be done if an orphan girl refuses a marriage proposal upon reaching puberty?","id":"tirmidhi-11-162"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman is given in marriage by two Wali, then her case is in accordance with the first of them, and whoever sells something to two men, then it is for the first of them.\"","reference":"Jami` at-Tirmidhi 1110, Book 11, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of having multiple Walis in a marriage contract?","id":"tirmidhi-11-163"},{"hadith-eng":"The Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1111, Book 11, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences of a slave marrying without the owner's permission according to Islamic jurisprudence?","id":"tirmidhi-11-164"},{"hadith-eng":"Abdullah narrated that the Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1112, Book 11, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences of a slave marrying without the owner's permission according to Islamic jurisprudence?","id":"tirmidhi-11-165"},{"hadith-eng":"\"A woman from Banu Fazarah was married for (the dowry of) two sandals. So the Messenger of Allah said to her: 'Do you approve of (exchanging) yourself and your wealth for two sandals?' She said: 'Yes.'\" He said: \"So he permitted it.\"","reference":"Jami` at-Tirmidhi 1113, Book 11, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role does the approval of both parties play in the validity of a marriage in Islam?","id":"tirmidhi-11-166"},{"hadith-eng":"A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"","reference":"Jami` at-Tirmidhi 1114, Book 11, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What alternatives can be considered if a person cannot afford a traditional dowry?","id":"tirmidhi-11-167"},{"hadith-eng":"\"The Messenger of Allah emancipated Safiyyah and he made her emancipation her dowry.\"","reference":"Jami` at-Tirmidhi 1115, Book 11, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of setting a person's freedom as a dowry in Islam?","id":"tirmidhi-11-168"},{"hadith-eng":"\"Three will receive their reward twice: A slave who fulfills the rights of Allah and the rights of his owners, then he will be given his reward twice. And a man who has a beautiful slave girl, so he teaches her good manners, then he frees her, then he married her seeking the Face of Allah by that; then he will be given his reward twice. And a man who believed in an earlier Book, then another Book came to him and he believed in it; then he will be given his reward twice.\"","reference":"Jami` at-Tirmidhi 1116, Book 11, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of teaching good manners to a slave girl and then marrying her in terms of spiritual reward?","id":"tirmidhi-11-169"},{"hadith-eng":"The Prophet said: \"Whichever man married a woman and entered into her, then it is not lawful for him to marry her daughter. If he did not enter into her then he may marry her daughter. And whichever man married a woman and he entered into her, or he did  not enter into her, then it is not lawful for him to marry her mother.\"","reference":"Jami` at-Tirmidhi 1117, Book 11, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of entering into a marriage in terms of prohibitions on marrying certain relatives?","id":"tirmidhi-11-170"},{"hadith-eng":"\"The wife of Rifa'ah Al-Qurzi came to the Messenger of Allah and said: 'I was with Rifa'ah and he divorced me irrevocably. Then I married Abdur-Rahman bin Az-Zubair, but he only has the likes of the fringe of a garment.' So he said: 'Perhaps you want me to return to Rifa'ah? No, not until you taste his sweetness, and he tastes your sweetness.'\"","reference":"Jami` at-Tirmidhi 1118, Book 11, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic law address issues related to marital intimacy and compatibility?","id":"tirmidhi-11-171"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1119, Book 11, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of the Prophet's curse on the practice of Muhill and Muhallal?","id":"tirmidhi-11-172"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1120, Book 11, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islamic law view the practice of Muhill and Muhallal in the context of marriage?","id":"tirmidhi-11-173"},{"hadith-eng":"\"The Prophet prohibited the Mut'ah with women, and the meat of domestic donkeys during (the campaign of) Khaibar.\"","reference":"Jami` at-Tirmidhi 1121, Book 11, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #3","question":"How do specific prohibitions reflect the ethical and moral guidelines in Islam?","id":"tirmidhi-11-174"},{"hadith-eng":"Ibn Abbas said: \"Mut'ah was only during the beginning of Islam. A man would arrive in a land that he was not familiar with so he would marry a woman for the extent of time that he thought he would remain there. So his Mut'ah was upheld and his case was fine until the (following) Ayah was revealed: Except their wives or what their right hands possess. Then every private part other than those became unlawful.\"","reference":"Jami` at-Tirmidhi 1122, Book 11, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of the Ayah that mentions 'Except their wives or what their right hands possess' in Islamic law?","id":"tirmidhi-11-175"},{"hadith-eng":"The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"","reference":"Jami` at-Tirmidhi 1123, Book 11, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam view the practice of Shighar in marriage arrangements?","id":"tirmidhi-11-176"},{"hadith-eng":"\"The Prophet prohibited Shighar.\"","reference":"Jami` at-Tirmidhi 1124, Book 11, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the prohibition of Shighar reflect on the importance of consent in marriage?","id":"tirmidhi-11-177"},{"hadith-eng":"\"The Prophet prohibited marrying a woman along with her paternal aunt or along with her maternal aunt.\"","reference":"Jami` at-Tirmidhi 1125, Book 11, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic law address the issue of marrying within the family?","id":"tirmidhi-11-178"},{"hadith-eng":"\"The Messenger of Allah prohibited that a woman be married along with her paternal aunt, or the paternal aunt along with her brother's daughter, or a woman with her maternal aunt, or the maternal aunt along with her sister's daughter, and the younger is not to be married with the older, nor the older with the younger.\"","reference":"Jami` at-Tirmidhi 1126, Book 11, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of maintaining family harmony in marriage according to Islamic teachings?","id":"tirmidhi-11-179"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"","reference":"Jami` at-Tirmidhi 1127, Book 11, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam view the importance of agreements that pertain to lawful marital relations?","id":"tirmidhi-11-180"},{"hadith-eng":"\"Ghilan bin Salamah Ath-Thaqafi accepted Islam and he had ten wives in Jahiliyyah who accepted Islam along with him. So the Prophet ordered (him) to chose four (of them).\"","reference":"Jami` at-Tirmidhi 1128, Book 11, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions are required from a person who has more than the permissible number of wives upon accepting Islam?","id":"tirmidhi-11-181"},{"hadith-eng":"He heard Ibn Fairuz Ad-Dhailami narrating from his father: \"I went to the Prophet and said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So the Messenger of Allah said: 'Chose whichever of them you will.'\"","reference":"Jami` at-Tirmidhi 1129, Book 11, Hadith 51","grade":"Hasan(Darussalam)","question #":"question #3","question":"What steps should a new Muslim take if their previous marital practices conflict with Islamic teachings?","id":"tirmidhi-11-182"},{"hadith-eng":"\"I said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So Messenger of Allah said: 'Chose whichever of them you will.'\"]","reference":"Jami` at-Tirmidhi 1130, Book 11, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #3","question":"What steps should a new Muslim take if their previous marital practices conflict with Islamic teachings?","id":"tirmidhi-11-183"},{"hadith-eng":"the Prophet said: \"Whoever believes in Allah and the Last Day, then he does not levy his water on someone else's child.\"","reference":"Jami` at-Tirmidhi 1131, Book 11, Hadith 53","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the moral implications of respecting the rights of others in Islam?","id":"tirmidhi-11-184"},{"hadith-eng":"\"We got some captives on the day of Awtas, and they had husbands among their peopled. They mentioned that to the Messenger of Allah, so the following was revealed: And women who are already married, except those whom your right hands posses.","reference":"Jami` at-Tirmidhi 1132, Book 11, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #3","question":"What guidance does the Quran provide concerning the treatment of captives in war?","id":"tirmidhi-11-185"},{"hadith-eng":"\"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 1133, Book 11, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic stance on payments made to fortune-tellers?","id":"tirmidhi-11-186"},{"hadith-eng":"The Messenger of Allah said: \"A man is not to sell over his brother's sale, nor is he to propose to whom his brother has proposed.\"","reference":"Jami` at-Tirmidhi 1134, Book 11, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of interfering in another person's business dealings or marriage proposals?","id":"tirmidhi-11-187"},{"hadith-eng":"\"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"","reference":"Jami` at-Tirmidhi 1135, Book 11, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"What considerations did the Prophet Muhammad (ﷺ) take into account when advising on marriage proposals?","id":"tirmidhi-11-188"},{"hadith-eng":"\"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"","reference":"Jami` at-Tirmidhi 1136, Book 11, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does this narration suggest about Allah's will in the creation of life?","id":"tirmidhi-11-189"},{"hadith-eng":"\"We practiced Azl while the Qur'an was being revealed.\"","reference":"Jami` at-Tirmidhi 1137, Book 11, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of practicing Azl while the Qur'an was being revealed?","id":"tirmidhi-11-190"},{"hadith-eng":"\"Azl was mentined before the Messenger of Allah and he said: 'Why would one of you do that?'\"","reference":"Jami` at-Tirmidhi 1138, Book 11, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the ethical considerations in family planning according to Islamic teachings?","id":"tirmidhi-11-191"},{"hadith-eng":"He (Abu Qilabah) said: \"If I wish, I could say: 'The Messenger of Allah said'\" but he said: \"The Sunnah when a man married a virgin after he already has a wife, is that he stays with her seven (nights). And when he married a matron when he already has a wife, he stays with her three (nights).\"","reference":"Jami` at-Tirmidhi 1139, Book 11, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration suggest about the treatment of new wives in terms of time spent with them?","id":"tirmidhi-11-192"},{"hadith-eng":"The Prophet would divide (his time) equally between his wives and said: \"O Allah! This is my division in what I have control over, so do not punish me for what You have control over which I do not have control over.\"","reference":"Jami` at-Tirmidhi 1140, Book 11, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this narration reflect the balance between human effort and divine will?","id":"tirmidhi-11-193"},{"hadith-eng":"The Messenger of Allah said: \"When a man has two wives and he is not just between them, he will come on the Day of Judgment with one side drooping.\"","reference":"Jami` at-Tirmidhi 1141, Book 11, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of justice in polygamous marriages according to Islamic teachings?","id":"tirmidhi-11-194"},{"hadith-eng":"\"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"","reference":"Jami` at-Tirmidhi 1142, Book 11, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of remarriage in Islam, particularly concerning previous marital ties?","id":"tirmidhi-11-195"},{"hadith-eng":"\"The Prophet returned his daughter Zainab to Abul-As bin Ar-Rabi after six years in the first marriage without renewing the marriage.\"","reference":"Jami` at-Tirmidhi 1143, Book 11, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the continuity of marriage in Islam from this historical event?","id":"tirmidhi-11-196"},{"hadith-eng":"\"A man became a Muslim during the time of the Prophet, then his wife became a Muslim, so he said: 'O Messenger of Allah! She accepted Islam along with me, so return her to me.' So he returned her to him.\"","reference":"Jami` at-Tirmidhi 1144, Book 11, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role does the Prophet play in resolving marital issues when both spouses accept Islam?","id":"tirmidhi-11-197"},{"hadith-eng":"Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.","reference":"Jami` at-Tirmidhi 1145, Book 11, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the rights of a woman in terms of inheritance and dowry if her husband dies before consummation of the marriage?","id":"tirmidhi-11-198"},{"hadith-eng":"The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"","reference":"Jami` at-Tirmidhi 1080, Book 11, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is the use of Siwak emphasized in the practices of the Prophets?","id":"tirmidhi-11-199"},{"hadith-eng":"\"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"","reference":"Jami` at-Tirmidhi 1081, Book 11, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does fasting affect one's sexual desires according to the teachings?","id":"tirmidhi-11-200"},{"hadith-eng":"The Prophet prohibited celibacy.","reference":"Jami` at-Tirmidhi 1082, Book 11, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the potential benefits of marriage according to Islamic principles?","id":"tirmidhi-11-201"},{"hadith-eng":"\"The Messenger of Allah refused Uthman bin Ma'zun (when he asked) regarding celibacy, and if he had permitted it for him, then we would have castrated ourselves.\"","reference":"Jami` at-Tirmidhi 1083, Book 11, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is marriage considered important in Islam?","id":"tirmidhi-11-202"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with proposes to (someone under the care) of one of you, then marry to him. If you do not do so, then there will be turmoil (Fitnah) in the land and abounding discord (Fasad).\"","reference":"Jami` at-Tirmidhi 1084, Book 11, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the potential consequences of rejecting suitable marriage proposals?","id":"tirmidhi-11-203"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"\nHe said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.","reference":"Jami` at-Tirmidhi 1085, Book 11, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #4","question":"What advice did the Prophet Muhammad give regarding marriage and societal harmony?","id":"tirmidhi-11-204"},{"hadith-eng":"The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"","reference":"Jami` at-Tirmidhi 1086, Book 11, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does beauty play in the selection of a marriage partner in Islamic tradition?","id":"tirmidhi-11-205"},{"hadith-eng":"Al-Mughirah bin Shu'bah proposed to a woman, so the Prophet said: \"Look at her, for indeed that is more likely to make things better between the two of you.\"","reference":"Jami` at-Tirmidhi 1087, Book 11, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might visual acquaintance be important in the context of marriage proposals?","id":"tirmidhi-11-206"},{"hadith-eng":"The Messenger of Allah said: \"The distinction between the lawful and the unlawful  is the Duff and the voice.\"","reference":"Jami` at-Tirmidhi 1088, Book 11, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #4","question":"How can one determine the boundaries between lawful and unlawful actions in Islamic practices?","id":"tirmidhi-11-207"},{"hadith-eng":"The Messenger of Allah said: \"Publicize this marriage, and hold it in the Masjid, and beat the Duff for it.\"","reference":"Jami` at-Tirmidhi 1089, Book 11, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does publicizing a marriage contribute to the community in Islam?","id":"tirmidhi-11-208"},{"hadith-eng":"\"The morning after the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the Duff and reciting verses mourning my father who had been killed in the battle of Badr. One of them said: 'Among us is a Prophet who knows what will happen tomorrow.' On that the Prophet said: 'Stop saying this, and keep on saying what you were saying before.'\"","reference":"Jami` at-Tirmidhi 1090, Book 11, Hadith 11","grade":"","question #":"question #4","question":"How did the Prophet Muhammad respond to statements attributing knowledge of the unseen to him?","id":"tirmidhi-11-209"},{"hadith-eng":"When supplicating for the newlywed, the Prophet would say: (Barak Allahu laka wa baraka alaik, wa jama'a bainakuma fi khair.) \"May Allah bless you and send blessings upon you, and bring goodness between you.\"","reference":"Jami` at-Tirmidhi 1091, Book 11, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to invoke Allah's blessings in the context of marriage?","id":"tirmidhi-11-210"},{"hadith-eng":"The Messenger of Allah said: \"If anyone of you, when having sexual intercourse with his wife, says: (Bismillah, Allahumma jannibnash-Shaitana wa jannibish-Shaitana ma razaqtana) 'In the Name of Allah, O Allah! Protect me from Shaitan and protect what you bestow upon us from Shaitan' - then if Allah decrees that they should have a child, Shaitan will not be able to harm him.'\"","reference":"Jami` at-Tirmidhi 1092, Book 11, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does supplication play in safeguarding children from Shaitan's harm?","id":"tirmidhi-11-211"},{"hadith-eng":"\"The Messenger of Allah married me in Shawwal, and he took up residence with me in Shawwal.\"","reference":"Jami` at-Tirmidhi 1093, Book 11, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the marriage of the Prophet Muhammad to Aishah reflect on the customs of marriage in early Islamic society?","id":"tirmidhi-11-212"},{"hadith-eng":"The Messenger of Allah saw some traces of saffron on `Abdur-Rahman bin `Awf so he said: 'What is this?' He said: 'I married a woman for the amount of gold equal to a date stone.' So he said: 'May Allah bless you. Have a banquet, even if with only one sheep.'\"","reference":"Jami` at-Tirmidhi 1094, Book 11, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad (ﷺ) encourage generosity in celebrations?","id":"tirmidhi-11-213"},{"hadith-eng":"\"The Prophet had a banquet for Safiyyah bint Huyayy with Sawiq and dates.\"","reference":"Jami` at-Tirmidhi 1095, Book 11, Hadith 16","grade":"","question #":"question #4","question":"How were social gatherings or banquets conducted during the time of the Prophet?","id":"tirmidhi-11-214"},{"hadith-eng":"Others have reported this Hadith from Ibn Uyainah, from Az-Zuhri, from Anas, and they did not mention \"from Wa'il, from his son Nawf\" in it.","reference":"Jami` at-Tirmidhi 1096, Book 11, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #4","question":"What challenges arise in verifying the sources of hadith narrations?","id":"tirmidhi-11-215"},{"hadith-eng":"The Messenger of Allah said: \"Having food on the first day is was is obligatory, and having food on the second day is Sunnah, and having food on the third day is to be heard of, and whoever wants to be heard of, Allah will make him heard of.\"","reference":"Jami` at-Tirmidhi 1097, Book 11, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the consequences of seeking to be 'heard of' according to this teaching?","id":"tirmidhi-11-216"},{"hadith-eng":"The Messenger of Allah said: \"Accept the invitation when you are offered.\"","reference":"Jami` at-Tirmidhi 1098, Book 11, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does accepting invitations contribute to community building in Islam?","id":"tirmidhi-11-217"},{"hadith-eng":"\"A man named Abu Shu'aib came to a slave of his, who was a butcher, and said: 'Prepare some food for me that will be sufficient for five, for I have seen hunger in the face of the Messenger of Allah.' So he prepared some food. Then he sent a message to the Prophet inviting him and those who were sitting with him. When the Prophet stood, he was followed by a man who was not with them when they were invited. When the Messenger of Allah arrive at the door he said to the owner of the house: 'A man who was not with us when you invited us followed us, if you permit him, he will enter.'\" He said: We have permitted him, let him enter.\"","reference":"Jami` at-Tirmidhi 1099, Book 11, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad handle situations where uninvited individuals wanted to join a gathering?","id":"tirmidhi-11-218"},{"hadith-eng":"\"I married a woman and went to the Prophet, he said: 'O Jabir! Have you married?' I said: 'Yes.' He said: 'A virgin or a matron?' I said: 'A matron.' He said: 'Why didn't you marry a young girl, so that you may play with her and she with you?' I said: 'O Messenger of Allah! Abdullah (his father) died and left behind seven - or nine - daughter, so I have brought someone who can look after them.'\" (He said:) \"So he supplicated for me.\"","reference":"Jami` at-Tirmidhi 1100, Book 11, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad (ﷺ) view the role of a spouse in caring for family members?","id":"tirmidhi-11-219"},{"hadith-eng":"the Messenger of Allah said: \"There is no marriage except with a Wali.\"","reference":"Jami` at-Tirmidhi 1101, Book 11, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the responsibilities of a Wali in an Islamic marriage?","id":"tirmidhi-11-220"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman married without the permission of her Wali her marriage is invalid, her marriage is invalid, her marriage is invalid. If he entered into her, then the Mahr is for her in lieu of what he enjoyed from her private part. If they disagree, then the Sultan is the Wali for one who has no Wali.\"","reference":"Jami` at-Tirmidhi 1102, Book 11, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"Who acts as a Wali if a woman does not have one or if there is a disagreement?","id":"tirmidhi-11-221"},{"hadith-eng":"the Prophet said: \"The adulteresses are the ones who marry themselves without Bayyinah (proof).\"","reference":"Jami` at-Tirmidhi 1103, Book 11, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to have a formal process in marriage according to Islamic law?","id":"tirmidhi-11-222"},{"hadith-eng":"\"The Messenger of Allah taught us the Tashah-hud for Salat and the Tashah-hud for Al-Hajjah.\" He said: \"The Tashah-hud for Salat is: (At-Tahiyyatulilah, was-walawtu wat-tayyibatu. As-Salamu alaika ayyuhan-Nabiyyu wa rahmatullilahi wa barakatuhu, As-Salamu alina wa ala ibadillahis-salihin. Ashahadu an la ilaha illallah, wa ashhadu anna Muhammadan abduha wa Raduluh.) 'All greetings, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that none has the right to be worshiped but Allah. and I testify that Muhammad is His slave and His Messenger.\"And the Tashah-hud for Al-Hajjah is: 'Indeed all praise is due to Allah, we seek His aid, and we seek His forgiveness, and we seek refuge with Allah from the evils of our souls and the mischief of our deeds. (Innal-Hamdlillahi nasta'inuhu, wa nastaghfirhu, wa na'udhu billahi min sharuri anfusina, wa sayy'ita a'malina, man yahdihi, sala mudilla lahu, wa manyudlil, fala Hadiya lahu, wa ashadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh) 'Whoever He guides - meaning Allah - then here is none to lead him astray, and whomever He misleads, then there is no guide for him. I testify that none has the right to be worshipped but Allah, and I testify that Muhammad is His worshipper and Messenger.'\"\nHe said: \"And he recited three Ayat.\"","reference":"Jami` at-Tirmidhi 1105, Book 11, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the importance of seeking Allah's aid and forgiveness in Islamic prayers?","id":"tirmidhi-11-223"},{"hadith-eng":"The Messenger of Allah said: \"Every Khutbah that does not have the Tashah-hud in it, then it is like a severed hand.\"","reference":"Jami` at-Tirmidhi 1106, Book 11, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the omission of Tashah-hud in a Khutbah be considered a deficiency?","id":"tirmidhi-11-224"},{"hadith-eng":"The Prophet said: \"A matron should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1107, Book 11, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to seek a woman's permission before marriage in Islam?","id":"tirmidhi-11-225"},{"hadith-eng":"The Messenger of Allah said: \"The matron has more right to herself than her Wali, and the virgin is to give permission for herself, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1108, Book 11, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does a Wali play in the marriage decisions of a matron and a virgin?","id":"tirmidhi-11-226"},{"hadith-eng":"The Messenger of Allah said: \"An orphan is to be consulted about herself, then if she is silent that is her permission, and if she refuses, then do not authorize it (the marriage) for her\" (meaning: when she attains the age of puberty and refuses it.)","reference":"Jami` at-Tirmidhi 1109, Book 11, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to seek the permission of an orphan girl before authorizing her marriage?","id":"tirmidhi-11-227"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman is given in marriage by two Wali, then her case is in accordance with the first of them, and whoever sells something to two men, then it is for the first of them.\"","reference":"Jami` at-Tirmidhi 1110, Book 11, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islamic jurisprudence resolve conflicts in transactions involving multiple parties?","id":"tirmidhi-11-228"},{"hadith-eng":"The Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1111, Book 11, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of ownership affect the marital rights of slaves in Islam?","id":"tirmidhi-11-229"},{"hadith-eng":"Abdullah narrated that the Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1112, Book 11, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of ownership affect the marital rights of slaves in Islam?","id":"tirmidhi-11-230"},{"hadith-eng":"\"A woman from Banu Fazarah was married for (the dowry of) two sandals. So the Messenger of Allah said to her: 'Do you approve of (exchanging) yourself and your wealth for two sandals?' She said: 'Yes.'\" He said: \"So he permitted it.\"","reference":"Jami` at-Tirmidhi 1113, Book 11, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad's (ﷺ) response reflect the flexibility of dowry in Islamic marriages?","id":"tirmidhi-11-231"},{"hadith-eng":"A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"","reference":"Jami` at-Tirmidhi 1114, Book 11, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration teach about the flexibility of marriage requirements in Islam?","id":"tirmidhi-11-232"},{"hadith-eng":"\"The Messenger of Allah emancipated Safiyyah and he made her emancipation her dowry.\"","reference":"Jami` at-Tirmidhi 1115, Book 11, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of dowry differ in various Islamic traditions?","id":"tirmidhi-11-233"},{"hadith-eng":"\"Three will receive their reward twice: A slave who fulfills the rights of Allah and the rights of his owners, then he will be given his reward twice. And a man who has a beautiful slave girl, so he teaches her good manners, then he frees her, then he married her seeking the Face of Allah by that; then he will be given his reward twice. And a man who believed in an earlier Book, then another Book came to him and he believed in it; then he will be given his reward twice.\"","reference":"Jami` at-Tirmidhi 1116, Book 11, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does belief in multiple revealed books affect a person's reward in Islamic belief?","id":"tirmidhi-11-234"},{"hadith-eng":"The Prophet said: \"Whichever man married a woman and entered into her, then it is not lawful for him to marry her daughter. If he did not enter into her then he may marry her daughter. And whichever man married a woman and he entered into her, or he did  not enter into her, then it is not lawful for him to marry her mother.\"","reference":"Jami` at-Tirmidhi 1117, Book 11, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the act of consummation affect the permissibility of marrying a woman's daughter or mother?","id":"tirmidhi-11-235"},{"hadith-eng":"\"The wife of Rifa'ah Al-Qurzi came to the Messenger of Allah and said: 'I was with Rifa'ah and he divorced me irrevocably. Then I married Abdur-Rahman bin Az-Zubair, but he only has the likes of the fringe of a garment.' So he said: 'Perhaps you want me to return to Rifa'ah? No, not until you taste his sweetness, and he tastes your sweetness.'\"","reference":"Jami` at-Tirmidhi 1118, Book 11, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of a husband's inability to fulfill marital obligations in Islam?","id":"tirmidhi-11-236"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1119, Book 11, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic law view the practice of Muhill and Muhallal?","id":"tirmidhi-11-237"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1120, Book 11, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the ethical considerations in Islamic jurisprudence regarding the practices mentioned in the hadith?","id":"tirmidhi-11-238"},{"hadith-eng":"\"The Prophet prohibited the Mut'ah with women, and the meat of domestic donkeys during (the campaign of) Khaibar.\"","reference":"Jami` at-Tirmidhi 1121, Book 11, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #4","question":"What historical events are associated with the prohibition of certain practices in Islam?","id":"tirmidhi-11-239"},{"hadith-eng":"Ibn Abbas said: \"Mut'ah was only during the beginning of Islam. A man would arrive in a land that he was not familiar with so he would marry a woman for the extent of time that he thought he would remain there. So his Mut'ah was upheld and his case was fine until the (following) Ayah was revealed: Except their wives or what their right hands possess. Then every private part other than those became unlawful.\"","reference":"Jami` at-Tirmidhi 1122, Book 11, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #4","question":"How did the practice of temporary marriage adapt to the needs of travelers in unfamiliar lands during early Islam?","id":"tirmidhi-11-240"},{"hadith-eng":"The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"","reference":"Jami` at-Tirmidhi 1123, Book 11, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the phrase 'he is not from us' imply about the seriousness of certain actions in Islam?","id":"tirmidhi-11-241"},{"hadith-eng":"\"The Prophet prohibited Shighar.\"","reference":"Jami` at-Tirmidhi 1124, Book 11, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the potential social consequences of allowing Shighar in a community?","id":"tirmidhi-11-242"},{"hadith-eng":"\"The Prophet prohibited marrying a woman along with her paternal aunt or along with her maternal aunt.\"","reference":"Jami` at-Tirmidhi 1125, Book 11, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of marrying two women who are closely related to each other?","id":"tirmidhi-11-243"},{"hadith-eng":"\"The Messenger of Allah prohibited that a woman be married along with her paternal aunt, or the paternal aunt along with her brother's daughter, or a woman with her maternal aunt, or the maternal aunt along with her sister's daughter, and the younger is not to be married with the older, nor the older with the younger.\"","reference":"Jami` at-Tirmidhi 1126, Book 11, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic law address potential conflicts in family relationships through marriage restrictions?","id":"tirmidhi-11-244"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"","reference":"Jami` at-Tirmidhi 1127, Book 11, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role do conditions play in making marital relations lawful according to Islamic teachings?","id":"tirmidhi-11-245"},{"hadith-eng":"\"Ghilan bin Salamah Ath-Thaqafi accepted Islam and he had ten wives in Jahiliyyah who accepted Islam along with him. So the Prophet ordered (him) to chose four (of them).\"","reference":"Jami` at-Tirmidhi 1128, Book 11, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does this narration indicate about the transition from pre-Islamic practices to Islamic teachings?","id":"tirmidhi-11-246"},{"hadith-eng":"He heard Ibn Fairuz Ad-Dhailami narrating from his father: \"I went to the Prophet and said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So the Messenger of Allah said: 'Chose whichever of them you will.'\"","reference":"Jami` at-Tirmidhi 1129, Book 11, Hadith 51","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of seeking the Prophet's advice in personal matters according to Islamic tradition?","id":"tirmidhi-11-247"},{"hadith-eng":"\"I said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So Messenger of Allah said: 'Chose whichever of them you will.'\"]","reference":"Jami` at-Tirmidhi 1130, Book 11, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of seeking the Prophet's advice in personal matters according to Islamic tradition?","id":"tirmidhi-11-248"},{"hadith-eng":"the Prophet said: \"Whoever believes in Allah and the Last Day, then he does not levy his water on someone else's child.\"","reference":"Jami` at-Tirmidhi 1131, Book 11, Hadith 53","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does faith influence one's actions towards others according to Islamic principles?","id":"tirmidhi-11-249"},{"hadith-eng":"\"We got some captives on the day of Awtas, and they had husbands among their peopled. They mentioned that to the Messenger of Allah, so the following was revealed: And women who are already married, except those whom your right hands posses.","reference":"Jami` at-Tirmidhi 1132, Book 11, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the ethical considerations in Islam regarding captives and their marital status?","id":"tirmidhi-11-250"},{"hadith-eng":"\"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 1133, Book 11, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view transactions involving unethical or immoral activities?","id":"tirmidhi-11-251"},{"hadith-eng":"The Messenger of Allah said: \"A man is not to sell over his brother's sale, nor is he to propose to whom his brother has proposed.\"","reference":"Jami` at-Tirmidhi 1134, Book 11, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this teaching promote brotherhood and harmony within the Muslim community?","id":"tirmidhi-11-252"},{"hadith-eng":"\"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"","reference":"Jami` at-Tirmidhi 1135, Book 11, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does financial stability play in the Prophet Muhammad's (ﷺ) advice on choosing a spouse?","id":"tirmidhi-11-253"},{"hadith-eng":"\"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"","reference":"Jami` at-Tirmidhi 1136, Book 11, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does this narration reflect the belief in divine decree in Islam?","id":"tirmidhi-11-254"},{"hadith-eng":"\"We practiced Azl while the Qur'an was being revealed.\"","reference":"Jami` at-Tirmidhi 1137, Book 11, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the practice of Azl indicate about family planning in early Islamic society?","id":"tirmidhi-11-255"},{"hadith-eng":"\"Azl was mentined before the Messenger of Allah and he said: 'Why would one of you do that?'\"","reference":"Jami` at-Tirmidhi 1138, Book 11, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance does Islam provide regarding natural methods of contraception?","id":"tirmidhi-11-256"},{"hadith-eng":"He (Abu Qilabah) said: \"If I wish, I could say: 'The Messenger of Allah said'\" but he said: \"The Sunnah when a man married a virgin after he already has a wife, is that he stays with her seven (nights). And when he married a matron when he already has a wife, he stays with her three (nights).\"","reference":"Jami` at-Tirmidhi 1139, Book 11, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the marital status of a new wife (virgin or matron) affect the time a husband should spend with her according to Islamic tradition?","id":"tirmidhi-11-257"},{"hadith-eng":"The Prophet would divide (his time) equally between his wives and said: \"O Allah! This is my division in what I have control over, so do not punish me for what You have control over which I do not have control over.\"","reference":"Jami` at-Tirmidhi 1140, Book 11, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's approach to justice and equity in personal relationships?","id":"tirmidhi-11-258"},{"hadith-eng":"The Messenger of Allah said: \"When a man has two wives and he is not just between them, he will come on the Day of Judgment with one side drooping.\"","reference":"Jami` at-Tirmidhi 1141, Book 11, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does Islamic tradition say about the treatment of wives in a polygamous marriage?","id":"tirmidhi-11-259"},{"hadith-eng":"\"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"","reference":"Jami` at-Tirmidhi 1142, Book 11, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic law view the return of a wife to her former husband?","id":"tirmidhi-11-260"},{"hadith-eng":"\"The Prophet returned his daughter Zainab to Abul-As bin Ar-Rabi after six years in the first marriage without renewing the marriage.\"","reference":"Jami` at-Tirmidhi 1143, Book 11, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does this incident illustrate the Prophet's approach to family matters and marital disputes?","id":"tirmidhi-11-261"},{"hadith-eng":"\"A man became a Muslim during the time of the Prophet, then his wife became a Muslim, so he said: 'O Messenger of Allah! She accepted Islam along with me, so return her to me.' So he returned her to him.\"","reference":"Jami` at-Tirmidhi 1144, Book 11, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications for a marriage when one spouse converts to Islam and the other follows?","id":"tirmidhi-11-262"},{"hadith-eng":"Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.","reference":"Jami` at-Tirmidhi 1145, Book 11, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of observing Iddah for a woman whose husband dies before consummation of the marriage?","id":"tirmidhi-11-263"},{"hadith-eng":"The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"","reference":"Jami` at-Tirmidhi 1080, Book 11, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the importance of marriage in the traditions of the Messengers?","id":"tirmidhi-11-264"},{"hadith-eng":"\"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"","reference":"Jami` at-Tirmidhi 1081, Book 11, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of addressing young men specifically in this guidance?","id":"tirmidhi-11-265"},{"hadith-eng":"The Prophet prohibited celibacy.","reference":"Jami` at-Tirmidhi 1082, Book 11, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam view the balance between personal desires and religious obligations?","id":"tirmidhi-11-266"},{"hadith-eng":"\"The Messenger of Allah refused Uthman bin Ma'zun (when he asked) regarding celibacy, and if he had permitted it for him, then we would have castrated ourselves.\"","reference":"Jami` at-Tirmidhi 1083, Book 11, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration imply about the balance between religious devotion and natural human needs?","id":"tirmidhi-11-267"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with proposes to (someone under the care) of one of you, then marry to him. If you do not do so, then there will be turmoil (Fitnah) in the land and abounding discord (Fasad).\"","reference":"Jami` at-Tirmidhi 1084, Book 11, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islam address the prevention of societal discord through marriage?","id":"tirmidhi-11-268"},{"hadith-eng":"The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"\nHe said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.","reference":"Jami` at-Tirmidhi 1085, Book 11, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #5","question":"Why might the Prophet Muhammad have emphasized the importance of marrying someone with good character multiple times?","id":"tirmidhi-11-269"},{"hadith-eng":"The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"","reference":"Jami` at-Tirmidhi 1086, Book 11, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the phrase 'may your hands be dusty' imply in the context of choosing a spouse?","id":"tirmidhi-11-270"},{"hadith-eng":"Al-Mughirah bin Shu'bah proposed to a woman, so the Prophet said: \"Look at her, for indeed that is more likely to make things better between the two of you.\"","reference":"Jami` at-Tirmidhi 1087, Book 11, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the benefits of mutual understanding before marriage according to Islamic teachings?","id":"tirmidhi-11-271"},{"hadith-eng":"The Messenger of Allah said: \"The distinction between the lawful and the unlawful  is the Duff and the voice.\"","reference":"Jami` at-Tirmidhi 1088, Book 11, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the role of cultural expressions such as music and voice in Islamic jurisprudence?","id":"tirmidhi-11-272"},{"hadith-eng":"The Messenger of Allah said: \"Publicize this marriage, and hold it in the Masjid, and beat the Duff for it.\"","reference":"Jami` at-Tirmidhi 1089, Book 11, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the cultural practices associated with Islamic weddings?","id":"tirmidhi-11-273"},{"hadith-eng":"\"The morning after the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the Duff and reciting verses mourning my father who had been killed in the battle of Badr. One of them said: 'Among us is a Prophet who knows what will happen tomorrow.' On that the Prophet said: 'Stop saying this, and keep on saying what you were saying before.'\"","reference":"Jami` at-Tirmidhi 1090, Book 11, Hadith 11","grade":"","question #":"question #5","question":"What role do cultural practices play in Islamic celebrations according to this narration?","id":"tirmidhi-11-274"},{"hadith-eng":"When supplicating for the newlywed, the Prophet would say: (Barak Allahu laka wa baraka alaik, wa jama'a bainakuma fi khair.) \"May Allah bless you and send blessings upon you, and bring goodness between you.\"","reference":"Jami` at-Tirmidhi 1091, Book 11, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can supplications contribute to the success and harmony of a marriage?","id":"tirmidhi-11-275"},{"hadith-eng":"The Messenger of Allah said: \"If anyone of you, when having sexual intercourse with his wife, says: (Bismillah, Allahumma jannibnash-Shaitana wa jannibish-Shaitana ma razaqtana) 'In the Name of Allah, O Allah! Protect me from Shaitan and protect what you bestow upon us from Shaitan' - then if Allah decrees that they should have a child, Shaitan will not be able to harm him.'\"","reference":"Jami` at-Tirmidhi 1092, Book 11, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the invocation of Allah's protection influence the spiritual well-being of a family?","id":"tirmidhi-11-276"},{"hadith-eng":"The Messenger of Allah saw some traces of saffron on `Abdur-Rahman bin `Awf so he said: 'What is this?' He said: 'I married a woman for the amount of gold equal to a date stone.' So he said: 'May Allah bless you. Have a banquet, even if with only one sheep.'\"","reference":"Jami` at-Tirmidhi 1094, Book 11, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the Prophet (ﷺ) play in guiding companions on marital matters?","id":"tirmidhi-11-277"},{"hadith-eng":"Others have reported this Hadith from Ibn Uyainah, from Az-Zuhri, from Anas, and they did not mention \"from Wa'il, from his son Nawf\" in it.","reference":"Jami` at-Tirmidhi 1096, Book 11, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the inclusion or exclusion of certain narrators impact the understanding of a hadith?","id":"tirmidhi-11-278"},{"hadith-eng":"The Messenger of Allah said: \"Having food on the first day is was is obligatory, and having food on the second day is Sunnah, and having food on the third day is to be heard of, and whoever wants to be heard of, Allah will make him heard of.\"","reference":"Jami` at-Tirmidhi 1097, Book 11, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this teaching differentiate between obligatory acts and Sunnah?","id":"tirmidhi-11-279"},{"hadith-eng":"The Messenger of Allah said: \"Accept the invitation when you are offered.\"","reference":"Jami` at-Tirmidhi 1098, Book 11, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"What might be the consequences of refusing invitations in an Islamic context?","id":"tirmidhi-11-280"},{"hadith-eng":"\"A man named Abu Shu'aib came to a slave of his, who was a butcher, and said: 'Prepare some food for me that will be sufficient for five, for I have seen hunger in the face of the Messenger of Allah.' So he prepared some food. Then he sent a message to the Prophet inviting him and those who were sitting with him. When the Prophet stood, he was followed by a man who was not with them when they were invited. When the Messenger of Allah arrive at the door he said to the owner of the house: 'A man who was not with us when you invited us followed us, if you permit him, he will enter.'\" He said: We have permitted him, let him enter.\"","reference":"Jami` at-Tirmidhi 1099, Book 11, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration teach about the importance of communication and consent in social gatherings?","id":"tirmidhi-11-281"},{"hadith-eng":"\"I married a woman and went to the Prophet, he said: 'O Jabir! Have you married?' I said: 'Yes.' He said: 'A virgin or a matron?' I said: 'A matron.' He said: 'Why didn't you marry a young girl, so that you may play with her and she with you?' I said: 'O Messenger of Allah! Abdullah (his father) died and left behind seven - or nine - daughter, so I have brought someone who can look after them.'\" (He said:) \"So he supplicated for me.\"","reference":"Jami` at-Tirmidhi 1100, Book 11, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the Prophet's supplication for Jabir in this context?","id":"tirmidhi-11-282"},{"hadith-eng":"the Messenger of Allah said: \"There is no marriage except with a Wali.\"","reference":"Jami` at-Tirmidhi 1101, Book 11, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"Who can be considered a Wali in an Islamic marriage?","id":"tirmidhi-11-283"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman married without the permission of her Wali her marriage is invalid, her marriage is invalid, her marriage is invalid. If he entered into her, then the Mahr is for her in lieu of what he enjoyed from her private part. If they disagree, then the Sultan is the Wali for one who has no Wali.\"","reference":"Jami` at-Tirmidhi 1102, Book 11, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic law address disputes regarding the validity of a marriage without a Wali?","id":"tirmidhi-11-284"},{"hadith-eng":"the Prophet said: \"The adulteresses are the ones who marry themselves without Bayyinah (proof).\"","reference":"Jami` at-Tirmidhi 1103, Book 11, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role does Bayyinah play in validating a marriage in Islam?","id":"tirmidhi-11-285"},{"hadith-eng":"\"The Messenger of Allah taught us the Tashah-hud for Salat and the Tashah-hud for Al-Hajjah.\" He said: \"The Tashah-hud for Salat is: (At-Tahiyyatulilah, was-walawtu wat-tayyibatu. As-Salamu alaika ayyuhan-Nabiyyu wa rahmatullilahi wa barakatuhu, As-Salamu alina wa ala ibadillahis-salihin. Ashahadu an la ilaha illallah, wa ashhadu anna Muhammadan abduha wa Raduluh.) 'All greetings, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that none has the right to be worshiped but Allah. and I testify that Muhammad is His slave and His Messenger.\"And the Tashah-hud for Al-Hajjah is: 'Indeed all praise is due to Allah, we seek His aid, and we seek His forgiveness, and we seek refuge with Allah from the evils of our souls and the mischief of our deeds. (Innal-Hamdlillahi nasta'inuhu, wa nastaghfirhu, wa na'udhu billahi min sharuri anfusina, wa sayy'ita a'malina, man yahdihi, sala mudilla lahu, wa manyudlil, fala Hadiya lahu, wa ashadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh) 'Whoever He guides - meaning Allah - then here is none to lead him astray, and whomever He misleads, then there is no guide for him. I testify that none has the right to be worshipped but Allah, and I testify that Muhammad is His worshipper and Messenger.'\"\nHe said: \"And he recited three Ayat.\"","reference":"Jami` at-Tirmidhi 1105, Book 11, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the Tashah-hud address the guidance and misguidance of individuals?","id":"tirmidhi-11-286"},{"hadith-eng":"The Prophet said: \"A matron should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1107, Book 11, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching reflect the respect for women's autonomy in marriage decisions?","id":"tirmidhi-11-287"},{"hadith-eng":"The Messenger of Allah said: \"The matron has more right to herself than her Wali, and the virgin is to give permission for herself, and her silence is her permission.\"","reference":"Jami` at-Tirmidhi 1108, Book 11, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic law ensure the autonomy of women in marriage decisions?","id":"tirmidhi-11-288"},{"hadith-eng":"The Messenger of Allah said: \"An orphan is to be consulted about herself, then if she is silent that is her permission, and if she refuses, then do not authorize it (the marriage) for her\" (meaning: when she attains the age of puberty and refuses it.)","reference":"Jami` at-Tirmidhi 1109, Book 11, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic law protect the rights of orphan girls in matters of marriage?","id":"tirmidhi-11-289"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman is given in marriage by two Wali, then her case is in accordance with the first of them, and whoever sells something to two men, then it is for the first of them.\"","reference":"Jami` at-Tirmidhi 1110, Book 11, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the importance of the first agreement in Islamic transactions and contracts?","id":"tirmidhi-11-290"},{"hadith-eng":"The Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1111, Book 11, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the relationship between a slave's marital status and their owner's authority?","id":"tirmidhi-11-291"},{"hadith-eng":"Abdullah narrated that the Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"","reference":"Jami` at-Tirmidhi 1112, Book 11, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the moral implications of a slave marrying without consent?","id":"tirmidhi-11-292"},{"hadith-eng":"\"A woman from Banu Fazarah was married for (the dowry of) two sandals. So the Messenger of Allah said to her: 'Do you approve of (exchanging) yourself and your wealth for two sandals?' She said: 'Yes.'\" He said: \"So he permitted it.\"","reference":"Jami` at-Tirmidhi 1113, Book 11, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be inferred about the cultural practices of dowry during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-11-293"},{"hadith-eng":"A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"","reference":"Jami` at-Tirmidhi 1114, Book 11, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this story illustrate the Prophet's approach to facilitating marriage?","id":"tirmidhi-11-294"},{"hadith-eng":"\"The Messenger of Allah emancipated Safiyyah and he made her emancipation her dowry.\"","reference":"Jami` at-Tirmidhi 1115, Book 11, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the rights of a woman in an Islamic marriage concerning dowry?","id":"tirmidhi-11-295"},{"hadith-eng":"\"Three will receive their reward twice: A slave who fulfills the rights of Allah and the rights of his owners, then he will be given his reward twice. And a man who has a beautiful slave girl, so he teaches her good manners, then he frees her, then he married her seeking the Face of Allah by that; then he will be given his reward twice. And a man who believed in an earlier Book, then another Book came to him and he believed in it; then he will be given his reward twice.\"","reference":"Jami` at-Tirmidhi 1116, Book 11, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #5","question":"What actions can lead to receiving a double reward in the context of Islamic teachings?","id":"tirmidhi-11-296"},{"hadith-eng":"The Prophet said: \"Whichever man married a woman and entered into her, then it is not lawful for him to marry her daughter. If he did not enter into her then he may marry her daughter. And whichever man married a woman and he entered into her, or he did  not enter into her, then it is not lawful for him to marry her mother.\"","reference":"Jami` at-Tirmidhi 1117, Book 11, Hadith 39","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the rules regarding marrying a woman's mother in Islamic jurisprudence?","id":"tirmidhi-11-297"},{"hadith-eng":"\"The wife of Rifa'ah Al-Qurzi came to the Messenger of Allah and said: 'I was with Rifa'ah and he divorced me irrevocably. Then I married Abdur-Rahman bin Az-Zubair, but he only has the likes of the fringe of a garment.' So he said: 'Perhaps you want me to return to Rifa'ah? No, not until you taste his sweetness, and he tastes your sweetness.'\"","reference":"Jami` at-Tirmidhi 1118, Book 11, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic jurisprudence handle cases of remarriage after divorce?","id":"tirmidhi-11-298"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1119, Book 11, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #5","question":"What ethical considerations are highlighted by the Prophet's curse on certain marital practices?","id":"tirmidhi-11-299"},{"hadith-eng":"\"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"","reference":"Jami` at-Tirmidhi 1120, Book 11, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of curse in Islam affect the actions and decisions of Muslims in their daily lives?","id":"tirmidhi-11-300"},{"hadith-eng":"\"The Prophet prohibited the Mut'ah with women, and the meat of domestic donkeys during (the campaign of) Khaibar.\"","reference":"Jami` at-Tirmidhi 1121, Book 11, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do prohibitions in Islam relate to the well-being and social order of the community?","id":"tirmidhi-11-301"},{"hadith-eng":"Ibn Abbas said: \"Mut'ah was only during the beginning of Islam. A man would arrive in a land that he was not familiar with so he would marry a woman for the extent of time that he thought he would remain there. So his Mut'ah was upheld and his case was fine until the (following) Ayah was revealed: Except their wives or what their right hands possess. Then every private part other than those became unlawful.\"","reference":"Jami` at-Tirmidhi 1122, Book 11, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of the prohibition of Mut'ah on Islamic marital laws?","id":"tirmidhi-11-302"},{"hadith-eng":"The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"","reference":"Jami` at-Tirmidhi 1123, Book 11, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the ethical implications of taking property by force according to Islamic principles?","id":"tirmidhi-11-303"},{"hadith-eng":"\"The Prophet prohibited Shighar.\"","reference":"Jami` at-Tirmidhi 1124, Book 11, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic jurisprudence address unconventional marriage practices?","id":"tirmidhi-11-304"},{"hadith-eng":"\"The Prophet prohibited marrying a woman along with her paternal aunt or along with her maternal aunt.\"","reference":"Jami` at-Tirmidhi 1125, Book 11, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding familial relationships in marriage?","id":"tirmidhi-11-305"},{"hadith-eng":"\"The Messenger of Allah prohibited that a woman be married along with her paternal aunt, or the paternal aunt along with her brother's daughter, or a woman with her maternal aunt, or the maternal aunt along with her sister's daughter, and the younger is not to be married with the older, nor the older with the younger.\"","reference":"Jami` at-Tirmidhi 1126, Book 11, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of marrying a younger woman with an older woman in the same family?","id":"tirmidhi-11-306"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"","reference":"Jami` at-Tirmidhi 1127, Book 11, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is it important to honor agreements that involve personal and private matters in Islam?","id":"tirmidhi-11-307"},{"hadith-eng":"\"Ghilan bin Salamah Ath-Thaqafi accepted Islam and he had ten wives in Jahiliyyah who accepted Islam along with him. So the Prophet ordered (him) to chose four (of them).\"","reference":"Jami` at-Tirmidhi 1128, Book 11, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's role in guiding new converts in their personal affairs?","id":"tirmidhi-11-308"},{"hadith-eng":"He heard Ibn Fairuz Ad-Dhailami narrating from his father: \"I went to the Prophet and said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So the Messenger of Allah said: 'Chose whichever of them you will.'\"","reference":"Jami` at-Tirmidhi 1129, Book 11, Hadith 51","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic law prioritize the choice between two closely related spouses?","id":"tirmidhi-11-309"},{"hadith-eng":"\"I said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So Messenger of Allah said: 'Chose whichever of them you will.'\"]","reference":"Jami` at-Tirmidhi 1130, Book 11, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic law prioritize choices in marital relationships when conflicts arise?","id":"tirmidhi-11-310"},{"hadith-eng":"the Prophet said: \"Whoever believes in Allah and the Last Day, then he does not levy his water on someone else's child.\"","reference":"Jami` at-Tirmidhi 1131, Book 11, Hadith 53","grade":"Hasan(Darussalam)","question #":"question #5","question":"What ethical guidelines does Islam provide regarding family and social responsibilities?","id":"tirmidhi-11-311"},{"hadith-eng":"\"We got some captives on the day of Awtas, and they had husbands among their peopled. They mentioned that to the Messenger of Allah, so the following was revealed: And women who are already married, except those whom your right hands posses.","reference":"Jami` at-Tirmidhi 1132, Book 11, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the revelation impact the understanding of marital rights in the context of war captives?","id":"tirmidhi-11-312"},{"hadith-eng":"\"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 1133, Book 11, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are some examples of prohibited earnings in Islamic law?","id":"tirmidhi-11-313"},{"hadith-eng":"The Messenger of Allah said: \"A man is not to sell over his brother's sale, nor is he to propose to whom his brother has proposed.\"","reference":"Jami` at-Tirmidhi 1134, Book 11, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the consequences of violating the principles of fairness in sales and proposals according to Islamic teachings?","id":"tirmidhi-11-314"},{"hadith-eng":"\"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"","reference":"Jami` at-Tirmidhi 1135, Book 11, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith illustrate the Prophet Muhammad's (ﷺ) concern for the well-being and safety of women?","id":"tirmidhi-11-315"},{"hadith-eng":"\"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"","reference":"Jami` at-Tirmidhi 1136, Book 11, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of refuting false claims in Islamic teachings?","id":"tirmidhi-11-316"},{"hadith-eng":"\"We practiced Azl while the Qur'an was being revealed.\"","reference":"Jami` at-Tirmidhi 1137, Book 11, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the companions of the Prophet approach the practice of Azl?","id":"tirmidhi-11-317"},{"hadith-eng":"He (Abu Qilabah) said: \"If I wish, I could say: 'The Messenger of Allah said'\" but he said: \"The Sunnah when a man married a virgin after he already has a wife, is that he stays with her seven (nights). And when he married a matron when he already has a wife, he stays with her three (nights).\"","reference":"Jami` at-Tirmidhi 1139, Book 11, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the differences in the time allocation for a husband marrying a virgin versus a matron?","id":"tirmidhi-11-318"},{"hadith-eng":"The Prophet would divide (his time) equally between his wives and said: \"O Allah! This is my division in what I have control over, so do not punish me for what You have control over which I do not have control over.\"","reference":"Jami` at-Tirmidhi 1140, Book 11, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is it important to acknowledge the limits of human control in seeking fairness?","id":"tirmidhi-11-319"},{"hadith-eng":"The Messenger of Allah said: \"When a man has two wives and he is not just between them, he will come on the Day of Judgment with one side drooping.\"","reference":"Jami` at-Tirmidhi 1141, Book 11, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #5","question":"How is the concept of justice between spouses addressed in Islamic eschatology?","id":"tirmidhi-11-320"},{"hadith-eng":"\"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"","reference":"Jami` at-Tirmidhi 1142, Book 11, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be learned about the Prophet Muhammad's (ﷺ) family life from this event?","id":"tirmidhi-11-321"},{"hadith-eng":"\"The Prophet returned his daughter Zainab to Abul-As bin Ar-Rabi after six years in the first marriage without renewing the marriage.\"","reference":"Jami` at-Tirmidhi 1143, Book 11, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of this event for understanding the rules of marriage in Islamic jurisprudence?","id":"tirmidhi-11-322"},{"hadith-eng":"\"A man became a Muslim during the time of the Prophet, then his wife became a Muslim, so he said: 'O Messenger of Allah! She accepted Islam along with me, so return her to me.' So he returned her to him.\"","reference":"Jami` at-Tirmidhi 1144, Book 11, Hadith 66","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic law address the situation when both husband and wife convert to Islam?","id":"tirmidhi-11-323"},{"hadith-eng":"Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.","reference":"Jami` at-Tirmidhi 1145, Book 11, Hadith 67","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the judgment of the Prophet Muhammad (peace be upon him) influence the rulings of the companions in similar cases?","id":"tirmidhi-11-324"},{"hadith-eng":"\"The Messenger of Allah taught us the Tashah-hud for Salat and the Tashah-hud for Al-Hajjah.\" He said: \"The Tashah-hud for Salat is: (At-Tahiyyatulilah, was-walawtu wat-tayyibatu. As-Salamu alaika ayyuhan-Nabiyyu wa rahmatullilahi wa barakatuhu, As-Salamu alina wa ala ibadillahis-salihin. Ashahadu an la ilaha illallah, wa ashhadu anna Muhammadan abduha wa Raduluh.) 'All greetings, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that none has the right to be worshiped but Allah. and I testify that Muhammad is His slave and His Messenger.\"And the Tashah-hud for Al-Hajjah is: 'Indeed all praise is due to Allah, we seek His aid, and we seek His forgiveness, and we seek refuge with Allah from the evils of our souls and the mischief of our deeds. (Innal-Hamdlillahi nasta'inuhu, wa nastaghfirhu, wa na'udhu billahi min sharuri anfusina, wa sayy'ita a'malina, man yahdihi, sala mudilla lahu, wa manyudlil, fala Hadiya lahu, wa ashadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh) 'Whoever He guides - meaning Allah - then here is none to lead him astray, and whomever He misleads, then there is no guide for him. I testify that none has the right to be worshipped but Allah, and I testify that Muhammad is His worshipper and Messenger.'\"\nHe said: \"And he recited three Ayat.\"","reference":"Jami` at-Tirmidhi 1105, Book 11, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #6","question":"What role does the testimony of faith play in the Tashah-hud recitation?","id":"tirmidhi-11-325"},{"hadith-eng":"A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"","reference":"Jami` at-Tirmidhi 1114, Book 11, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #6","question":"What can be learned about the value of knowledge in Islamic marital arrangements?","id":"tirmidhi-11-326"},{"hadith-eng":"\"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"","reference":"Jami` at-Tirmidhi 1135, Book 11, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #6","question":"What does the hadith suggest about the importance of seeking the Prophet's (ﷺ) counsel in personal matters?","id":"tirmidhi-11-327"}]