[{"hadith-eng":"\"I asked Ibn Umar about a man who divorced his wife while she was menstruating. So he said: 'Don't you know Abdullah bin Umar?' Indeed he divorced his wife while she was menstruating, so Umar asked the Prophet about that, and he ordered him to take her back.'\" He said: \"I said: And that divorce is counted? He said: And that divorce is counted? He said: 'What else would you think if he was helpless and foolish?'\"","reference":"Jami` at-Tirmidhi 1175, Book 13, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on divorcing a wife during her menstruation period?","id":"tirmidhi-13-1"},{"hadith-eng":"His father divorced his wife during her menses, so Umar asked the Prophet about that and he said: \"Tell him to take her back, then let him divorce her while she is pure or pregnant.\"","reference":"Jami` at-Tirmidhi 1176, Book 13, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on divorcing a wife during her menstrual period in Islam?","id":"tirmidhi-13-2"},{"hadith-eng":"'O Messenger of Allah! I irrevocably divorced my wife.' So he said: 'What did you intend by that?' I said: 'One (divorce).' He said: '(Do you swear) By Allah?' I said: 'By Allah.' He said: 'Then it is as you intended.'\"","reference":"Jami` at-Tirmidhi 1177, Book 13, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of intention in the context of divorce in Islam?","id":"tirmidhi-13-3"},{"hadith-eng":"\"I said to Abu Ayyub: 'Do you know of anyone who said that: \"Your case is up to you?\" counts as three besides Al-Hasan?' He said: \"No, not besides Al-Hasan.' Then he said: 'O Allah forgive me - except for what has been narrated to me by Qatadah, from Kathir the freed slave of Banu Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.'\"Abu Ayyub said: 'So I met Kathir the freed slave of Banu Samurah and asked him about it, but he was not aware of it. So I returned to Qatadah and informed him about that and he said: \"He forgot.\"","reference":"Jami` at-Tirmidhi 1178, Book 13, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of verifying the authenticity of a narration in Islamic tradition?","id":"tirmidhi-13-4"},{"hadith-eng":"\"The Messenger of Allah gave us the choice, so we chose him. So was that a divorce?\"","reference":"Jami` at-Tirmidhi 1179, Book 13, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of choice in marital decisions in Islam?","id":"tirmidhi-13-5"},{"hadith-eng":"\"My husband divorced me three times during the time of the Prophet. So the Messenger of Allah said: 'There is no housing for you nor maintenance.'\" Al-Mughirah (one of the narrators) said: \"I mentioned that to Ibrahim and he said: Umar said: \"We do not leave the Book of Allah and the Sunnah of our Prophet for the saying of a woman, and we do not know if she remembered or forgot.\" And Umar used to give her (the divorced woman) housing and maintenance.'\"","reference":"Jami` at-Tirmidhi 1180, Book 13, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of a triple divorce in Islamic law regarding housing and maintenance for the divorced woman?","id":"tirmidhi-13-6"},{"hadith-eng":"The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"","reference":"Jami` at-Tirmidhi 1181, Book 13, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the limitations of making vows according to Islamic teachings?","id":"tirmidhi-13-7"},{"hadith-eng":"The Messenger of Allah said: \"The divorce for a slave woman is two divorces, and her Iddah is two menstruations.\"","reference":"Jami` at-Tirmidhi 1182, Book 13, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the prescribed number of divorces for a slave woman in Islamic law?","id":"tirmidhi-13-8"},{"hadith-eng":"The Messenger of Allah said: \"Allah has permitted my Ummah what occurs in their mines, as long as it is not spoken or acted upon.\"","reference":"Jami` at-Tirmidhi 1183, Book 13, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of intentions in Islam according to the teachings of the Prophet?","id":"tirmidhi-13-9"},{"hadith-eng":"The Messenger of Allah said: \"Three are serious when they are serious, and serious when they are in jest: Marriage, divorce, and return.\"","reference":"Jami` at-Tirmidhi 1184, Book 13, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the implications of taking marriage seriously in both jest and earnest?","id":"tirmidhi-13-10"},{"hadith-eng":"that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"","reference":"Jami` at-Tirmidhi 1185, Book 13, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the concept of Khul in Islamic law and how is it practiced?","id":"tirmidhi-13-11"},{"hadith-eng":"The Prophet said: \"The women who seek a Khul are hypocrites.\"","reference":"Jami` at-Tirmidhi 1186, Book 13, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking Khul in Islamic marital relations?","id":"tirmidhi-13-12"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman seeks a Khul from her husband without harm (cause), then the scent of Paradise will be unlawful for her.\"","reference":"Jami` at-Tirmidhi 1187, Book 13, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences for a woman who seeks a Khul without a valid reason?","id":"tirmidhi-13-13"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the woman is like a rib, if you try to straighten her you will break her, and if you leave her, what you enjoy from her will be with the crookedness.\"","reference":"Jami` at-Tirmidhi 1188, Book 13, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What metaphor is used to describe the nature of women in this narration?","id":"tirmidhi-13-14"},{"hadith-eng":"\"I had a wife whom I loved, but my father disliked her, so he ordered me to divorce her but I refused. I mentioned that to the Prophet and he said: 'O Abdullah bin Umar! Divorce your wife.'\"","reference":"Jami` at-Tirmidhi 1189, Book 13, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of obeying parental wishes in marital matters in Islam?","id":"tirmidhi-13-15"},{"hadith-eng":"The Prophet said: \"No woman should ask for the divorce of her sister (in religion) in order to spill what is in her container.\"","reference":"Jami` at-Tirmidhi 1190, Book 13, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What ethical considerations should a woman keep in mind regarding her sister in faith when it comes to marriage and divorce?","id":"tirmidhi-13-16"},{"hadith-eng":"The Messenger of Allah said: \"Every divorce is valid except the divorce of the Ma'tuh person whose reason is overcome.\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1191, Book 13, Hadith 18","grade":"","question #":"question #1","question":"What is the significance of mental capacity in the validity of a divorce in Islamic law?","id":"tirmidhi-13-17"},{"hadith-eng":"\"The people were such that a man would divorce his wife when he wanted to divorce her, and she remained his wife when he wanted to take her back while she was in her Iddah, and he could divorce a hundred times, or even more, such that a man could say to his wife: 'By Allah! I will neither divorce you irrevocably, nor give you residence ever!' She would say: 'And how is that?' He would say: 'I will divorce you, and whenever your Iddah is just about to end I will take you back. So a woman went to Aishah to inform her about that, and Aishah was silent until the Prophet came. So she told him and the Prophet was silent, until the Qur'an was revealed: Divorce is two times, after that, retain her on reasonable terms or release her with kindness.'\" So Aishah said: \"So the people could carry on with divorce in the future, (knowing) who was divorced, and who was not divorced.\"","reference":"Jami` at-Tirmidhi 1192, Book 13, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #1","question":"What was the practice of divorce among people before the revelation of the specific Quranic verse?","id":"tirmidhi-13-18"},{"hadith-eng":"\"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"","reference":"Jami` at-Tirmidhi 1193, Book 13, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the waiting period for a widow in Islam?","id":"tirmidhi-13-19"},{"hadith-eng":"Abu Hurairah, Ibn Abbas and Abu Salamah bin Abdur-Rahman mentioned the pregnant women whose husband died and she gave birth after the death of her husband. So Ibn Abbas said: \"She observes Iddah until the end of the two terms.\" Abu Salamah said: \"Rather, she is allowed when she gives birth.\" Abu Hurairah said: \"I am with my nephew,\" meaning Abu Salamah.So he sent a message to Umm Salamah the wife of the Prophet. She said: \"Subai'ah Al-Aslamiyyah gave birth a short time after her husband died, so she sought the judgment of the Messenger of Allah and he ordered her to get married.\"","reference":"Jami` at-Tirmidhi 1194, Book 13, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on the Iddah period for a pregnant woman whose husband has passed away?","id":"tirmidhi-13-20"},{"hadith-eng":"Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1195, Book 13, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the prescribed mourning period for a woman in Islam when her husband passes away?","id":"tirmidhi-13-21"},{"hadith-eng":"Zainab said: \"So I entered upon Zainab bint Jahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1196, Book 13, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the prescribed mourning period for a woman in Islam when her husband passes away?","id":"tirmidhi-13-22"},{"hadith-eng":"Zainab said: \"And I heard my mother, Umm Salamah said: 'A woman came to the Messenger of Allah and she said: \"O Messenger of Allah! My daughter's husband died, and she is suffering from an eye ailment, so can she use Kohl?\" the Messenger of Allah said: \"No\" two or three time. Each time (she asked) he said \"no.\" Then he said: \"It is just a mater of four months and ten (days). During Jahliyyah one of you would throw a clump of camel dung when one year passed.\"","reference":"Jami` at-Tirmidhi 1197, Book 13, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on a widow using kohl during her waiting period after her husband's death?","id":"tirmidhi-13-23"},{"hadith-eng":"that the Prophet said, about the one who uttered Zihar and had intercourse before the atonement: \"One atonement.\"","reference":"Jami` at-Tirmidhi 1198, Book 13, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on someone who commits Zihar and has intercourse before completing the atonement?","id":"tirmidhi-13-24"},{"hadith-eng":"A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"","reference":"Jami` at-Tirmidhi 1199, Book 13, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the ruling on having intercourse with one's wife after uttering Zihar but before atoning for it?","id":"tirmidhi-13-25"},{"hadith-eng":"Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"","reference":"Jami` at-Tirmidhi 1200, Book 13, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences of breaking an oath during Ramadan according to Islamic teachings?","id":"tirmidhi-13-26"},{"hadith-eng":"\"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"","reference":"Jami` at-Tirmidhi 1201, Book 13, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the concept of 'Ila' in Islamic teachings and how does it relate to marital relations?","id":"tirmidhi-13-27"},{"hadith-eng":"\"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\n\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\n\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"","reference":"Jami` at-Tirmidhi 1202, Book 13, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the process of Li'an and how does it affect the marital status of a couple?","id":"tirmidhi-13-28"},{"hadith-eng":"\"A man pronounced the Li'an on his wife, and the Prophet separated the two of them, and he decide that the child belonged to the mother.\"","reference":"Jami` at-Tirmidhi 1203, Book 13, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the process of Li'an and its implications in Islamic law?","id":"tirmidhi-13-29"},{"hadith-eng":"Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"","reference":"Jami` at-Tirmidhi 1204, Book 13, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of observing the Iddah period for a widow in Islam?","id":"tirmidhi-13-30"},{"hadith-eng":"\"I asked Ibn Umar about a man who divorced his wife while she was menstruating. So he said: 'Don't you know Abdullah bin Umar?' Indeed he divorced his wife while she was menstruating, so Umar asked the Prophet about that, and he ordered him to take her back.'\" He said: \"I said: And that divorce is counted? He said: And that divorce is counted? He said: 'What else would you think if he was helpless and foolish?'\"","reference":"Jami` at-Tirmidhi 1175, Book 13, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) advise handling a divorce that occurred during menstruation?","id":"tirmidhi-13-31"},{"hadith-eng":"His father divorced his wife during her menses, so Umar asked the Prophet about that and he said: \"Tell him to take her back, then let him divorce her while she is pure or pregnant.\"","reference":"Jami` at-Tirmidhi 1176, Book 13, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"What should a husband do if he divorces his wife during her menses according to Islamic teachings?","id":"tirmidhi-13-32"},{"hadith-eng":"'O Messenger of Allah! I irrevocably divorced my wife.' So he said: 'What did you intend by that?' I said: 'One (divorce).' He said: '(Do you swear) By Allah?' I said: 'By Allah.' He said: 'Then it is as you intended.'\"","reference":"Jami` at-Tirmidhi 1177, Book 13, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does swearing by Allah play a role in confirming one's intention in Islamic jurisprudence?","id":"tirmidhi-13-33"},{"hadith-eng":"\"I said to Abu Ayyub: 'Do you know of anyone who said that: \"Your case is up to you?\" counts as three besides Al-Hasan?' He said: \"No, not besides Al-Hasan.' Then he said: 'O Allah forgive me - except for what has been narrated to me by Qatadah, from Kathir the freed slave of Banu Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.'\"Abu Ayyub said: 'So I met Kathir the freed slave of Banu Samurah and asked him about it, but he was not aware of it. So I returned to Qatadah and informed him about that and he said: \"He forgot.\"","reference":"Jami` at-Tirmidhi 1178, Book 13, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #2","question":"How should one handle discrepancies in hadith narrations according to Islamic scholars?","id":"tirmidhi-13-34"},{"hadith-eng":"\"The Messenger of Allah gave us the choice, so we chose him. So was that a divorce?\"","reference":"Jami` at-Tirmidhi 1179, Book 13, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of choice relate to the validity of a divorce in Islamic law?","id":"tirmidhi-13-35"},{"hadith-eng":"\"My husband divorced me three times during the time of the Prophet. So the Messenger of Allah said: 'There is no housing for you nor maintenance.'\" Al-Mughirah (one of the narrators) said: \"I mentioned that to Ibrahim and he said: Umar said: \"We do not leave the Book of Allah and the Sunnah of our Prophet for the saying of a woman, and we do not know if she remembered or forgot.\" And Umar used to give her (the divorced woman) housing and maintenance.'\"","reference":"Jami` at-Tirmidhi 1180, Book 13, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the opinion of Umar differ from the hadith narrated by Fatimah bint Qais regarding the rights of a divorced woman?","id":"tirmidhi-13-36"},{"hadith-eng":"The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"","reference":"Jami` at-Tirmidhi 1181, Book 13, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #2","question":"What does Islam say about emancipating someone whom one does not own?","id":"tirmidhi-13-37"},{"hadith-eng":"The Messenger of Allah said: \"The divorce for a slave woman is two divorces, and her Iddah is two menstruations.\"","reference":"Jami` at-Tirmidhi 1182, Book 13, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the Iddah period for a slave woman differ from that of a free woman?","id":"tirmidhi-13-38"},{"hadith-eng":"The Messenger of Allah said: \"Allah has permitted my Ummah what occurs in their mines, as long as it is not spoken or acted upon.\"","reference":"Jami` at-Tirmidhi 1183, Book 13, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view unspoken thoughts or intentions that are not acted upon?","id":"tirmidhi-13-39"},{"hadith-eng":"The Messenger of Allah said: \"Three are serious when they are serious, and serious when they are in jest: Marriage, divorce, and return.\"","reference":"Jami` at-Tirmidhi 1184, Book 13, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of seriousness apply to the act of divorce in Islamic teachings?","id":"tirmidhi-13-40"},{"hadith-eng":"that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"","reference":"Jami` at-Tirmidhi 1185, Book 13, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of observing an Iddah period after a Khul?","id":"tirmidhi-13-41"},{"hadith-eng":"The Prophet said: \"The women who seek a Khul are hypocrites.\"","reference":"Jami` at-Tirmidhi 1186, Book 13, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of seeking Khul by women?","id":"tirmidhi-13-42"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman seeks a Khul from her husband without harm (cause), then the scent of Paradise will be unlawful for her.\"","reference":"Jami` at-Tirmidhi 1187, Book 13, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic teaching view the act of seeking divorce without harm or cause?","id":"tirmidhi-13-43"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the woman is like a rib, if you try to straighten her you will break her, and if you leave her, what you enjoy from her will be with the crookedness.\"","reference":"Jami` at-Tirmidhi 1188, Book 13, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the implication of trying to change or straighten a woman's nature according to this saying?","id":"tirmidhi-13-44"},{"hadith-eng":"\"I had a wife whom I loved, but my father disliked her, so he ordered me to divorce her but I refused. I mentioned that to the Prophet and he said: 'O Abdullah bin Umar! Divorce your wife.'\"","reference":"Jami` at-Tirmidhi 1189, Book 13, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic teaching address conflicts between personal desires and parental advice?","id":"tirmidhi-13-45"},{"hadith-eng":"The Prophet said: \"No woman should ask for the divorce of her sister (in religion) in order to spill what is in her container.\"","reference":"Jami` at-Tirmidhi 1190, Book 13, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of seeking divorce for selfish reasons that may harm another person?","id":"tirmidhi-13-46"},{"hadith-eng":"The Messenger of Allah said: \"Every divorce is valid except the divorce of the Ma'tuh person whose reason is overcome.\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1191, Book 13, Hadith 18","grade":"","question #":"question #2","question":"How does Islamic jurisprudence address the issue of divorce for individuals with impaired reasoning?","id":"tirmidhi-13-47"},{"hadith-eng":"\"The people were such that a man would divorce his wife when he wanted to divorce her, and she remained his wife when he wanted to take her back while she was in her Iddah, and he could divorce a hundred times, or even more, such that a man could say to his wife: 'By Allah! I will neither divorce you irrevocably, nor give you residence ever!' She would say: 'And how is that?' He would say: 'I will divorce you, and whenever your Iddah is just about to end I will take you back. So a woman went to Aishah to inform her about that, and Aishah was silent until the Prophet came. So she told him and the Prophet was silent, until the Qur'an was revealed: Divorce is two times, after that, retain her on reasonable terms or release her with kindness.'\" So Aishah said: \"So the people could carry on with divorce in the future, (knowing) who was divorced, and who was not divorced.\"","reference":"Jami` at-Tirmidhi 1192, Book 13, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Quranic revelation change the practice of divorce?","id":"tirmidhi-13-48"},{"hadith-eng":"\"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"","reference":"Jami` at-Tirmidhi 1193, Book 13, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the completion of post-natal bleeding affect a widow's readiness for remarriage?","id":"tirmidhi-13-49"},{"hadith-eng":"Abu Hurairah, Ibn Abbas and Abu Salamah bin Abdur-Rahman mentioned the pregnant women whose husband died and she gave birth after the death of her husband. So Ibn Abbas said: \"She observes Iddah until the end of the two terms.\" Abu Salamah said: \"Rather, she is allowed when she gives birth.\" Abu Hurairah said: \"I am with my nephew,\" meaning Abu Salamah.So he sent a message to Umm Salamah the wife of the Prophet. She said: \"Subai'ah Al-Aslamiyyah gave birth a short time after her husband died, so she sought the judgment of the Messenger of Allah and he ordered her to get married.\"","reference":"Jami` at-Tirmidhi 1194, Book 13, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the birth of a child affect the Iddah period for a widow?","id":"tirmidhi-13-50"},{"hadith-eng":"Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1195, Book 13, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long is it permissible for a Muslim woman to mourn for a deceased relative other than her husband?","id":"tirmidhi-13-51"},{"hadith-eng":"Zainab said: \"So I entered upon Zainab bint Jahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1196, Book 13, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long is it permissible for a Muslim woman to mourn for someone other than her husband?","id":"tirmidhi-13-52"},{"hadith-eng":"Zainab said: \"And I heard my mother, Umm Salamah said: 'A woman came to the Messenger of Allah and she said: \"O Messenger of Allah! My daughter's husband died, and she is suffering from an eye ailment, so can she use Kohl?\" the Messenger of Allah said: \"No\" two or three time. Each time (she asked) he said \"no.\" Then he said: \"It is just a mater of four months and ten (days). During Jahliyyah one of you would throw a clump of camel dung when one year passed.\"","reference":"Jami` at-Tirmidhi 1197, Book 13, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long is the waiting period for a widow in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-13-53"},{"hadith-eng":"that the Prophet said, about the one who uttered Zihar and had intercourse before the atonement: \"One atonement.\"","reference":"Jami` at-Tirmidhi 1198, Book 13, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is Zihar and how is it addressed in Islamic teachings?","id":"tirmidhi-13-54"},{"hadith-eng":"A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"","reference":"Jami` at-Tirmidhi 1199, Book 13, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is Zihar and how does it affect marital relations in Islam?","id":"tirmidhi-13-55"},{"hadith-eng":"Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"","reference":"Jami` at-Tirmidhi 1200, Book 13, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the options available for expiation if someone cannot free a slave or fast for two consecutive months?","id":"tirmidhi-13-56"},{"hadith-eng":"\"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"","reference":"Jami` at-Tirmidhi 1201, Book 13, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic law address the situation when someone makes something unlawful for themselves that is originally lawful?","id":"tirmidhi-13-57"},{"hadith-eng":"\"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\n\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\n\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"","reference":"Jami` at-Tirmidhi 1202, Book 13, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the consequences of making false accusations of adultery in Islam?","id":"tirmidhi-13-58"},{"hadith-eng":"\"A man pronounced the Li'an on his wife, and the Prophet separated the two of them, and he decide that the child belonged to the mother.\"","reference":"Jami` at-Tirmidhi 1203, Book 13, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address disputes regarding paternity?","id":"tirmidhi-13-59"},{"hadith-eng":"Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"","reference":"Jami` at-Tirmidhi 1204, Book 13, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad's guidance influence decisions regarding family matters after a spouse's death?","id":"tirmidhi-13-60"},{"hadith-eng":"\"I asked Ibn Umar about a man who divorced his wife while she was menstruating. So he said: 'Don't you know Abdullah bin Umar?' Indeed he divorced his wife while she was menstruating, so Umar asked the Prophet about that, and he ordered him to take her back.'\" He said: \"I said: And that divorce is counted? He said: And that divorce is counted? He said: 'What else would you think if he was helpless and foolish?'\"","reference":"Jami` at-Tirmidhi 1175, Book 13, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of Umar consulting the Prophet regarding his son's divorce?","id":"tirmidhi-13-61"},{"hadith-eng":"His father divorced his wife during her menses, so Umar asked the Prophet about that and he said: \"Tell him to take her back, then let him divorce her while she is pure or pregnant.\"","reference":"Jami` at-Tirmidhi 1176, Book 13, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"When is the appropriate time to pronounce divorce according to Islamic law?","id":"tirmidhi-13-62"},{"hadith-eng":"'O Messenger of Allah! I irrevocably divorced my wife.' So he said: 'What did you intend by that?' I said: 'One (divorce).' He said: '(Do you swear) By Allah?' I said: 'By Allah.' He said: 'Then it is as you intended.'\"","reference":"Jami` at-Tirmidhi 1177, Book 13, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of an irrevocable divorce in Islamic law?","id":"tirmidhi-13-63"},{"hadith-eng":"\"I said to Abu Ayyub: 'Do you know of anyone who said that: \"Your case is up to you?\" counts as three besides Al-Hasan?' He said: \"No, not besides Al-Hasan.' Then he said: 'O Allah forgive me - except for what has been narrated to me by Qatadah, from Kathir the freed slave of Banu Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.'\"Abu Ayyub said: 'So I met Kathir the freed slave of Banu Samurah and asked him about it, but he was not aware of it. So I returned to Qatadah and informed him about that and he said: \"He forgot.\"","reference":"Jami` at-Tirmidhi 1178, Book 13, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the role of memory and forgetfulness in the transmission of hadiths?","id":"tirmidhi-13-64"},{"hadith-eng":"\"The Messenger of Allah gave us the choice, so we chose him. So was that a divorce?\"","reference":"Jami` at-Tirmidhi 1179, Book 13, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does mutual consent play in the context of marriage and divorce in Islam?","id":"tirmidhi-13-65"},{"hadith-eng":"\"My husband divorced me three times during the time of the Prophet. So the Messenger of Allah said: 'There is no housing for you nor maintenance.'\" Al-Mughirah (one of the narrators) said: \"I mentioned that to Ibrahim and he said: Umar said: \"We do not leave the Book of Allah and the Sunnah of our Prophet for the saying of a woman, and we do not know if she remembered or forgot.\" And Umar used to give her (the divorced woman) housing and maintenance.'\"","reference":"Jami` at-Tirmidhi 1180, Book 13, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of adhering to the Quran and Sunnah when there is a conflicting narration from an individual?","id":"tirmidhi-13-66"},{"hadith-eng":"The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"","reference":"Jami` at-Tirmidhi 1181, Book 13, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islamic law view divorce in situations where one has no control?","id":"tirmidhi-13-67"},{"hadith-eng":"The Messenger of Allah said: \"The divorce for a slave woman is two divorces, and her Iddah is two menstruations.\"","reference":"Jami` at-Tirmidhi 1182, Book 13, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of menstruation in determining the Iddah period for a slave woman?","id":"tirmidhi-13-68"},{"hadith-eng":"The Messenger of Allah said: \"Allah has permitted my Ummah what occurs in their mines, as long as it is not spoken or acted upon.\"","reference":"Jami` at-Tirmidhi 1183, Book 13, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this teaching imply about the accountability of actions versus thoughts in Islam?","id":"tirmidhi-13-69"},{"hadith-eng":"The Messenger of Allah said: \"Three are serious when they are serious, and serious when they are in jest: Marriage, divorce, and return.\"","reference":"Jami` at-Tirmidhi 1184, Book 13, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the return in the context of seriousness and jest according to Islamic law?","id":"tirmidhi-13-70"},{"hadith-eng":"that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"","reference":"Jami` at-Tirmidhi 1185, Book 13, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the Iddah period differ for various types of separations in Islam?","id":"tirmidhi-13-71"},{"hadith-eng":"The Prophet said: \"The women who seek a Khul are hypocrites.\"","reference":"Jami` at-Tirmidhi 1186, Book 13, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of labeling certain actions as hypocritical in Islamic teachings?","id":"tirmidhi-13-72"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman seeks a Khul from her husband without harm (cause), then the scent of Paradise will be unlawful for her.\"","reference":"Jami` at-Tirmidhi 1187, Book 13, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the scent of Paradise in Islamic teachings?","id":"tirmidhi-13-73"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the woman is like a rib, if you try to straighten her you will break her, and if you leave her, what you enjoy from her will be with the crookedness.\"","reference":"Jami` at-Tirmidhi 1188, Book 13, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this narration suggest one should approach the imperfections in a partner?","id":"tirmidhi-13-74"},{"hadith-eng":"\"I had a wife whom I loved, but my father disliked her, so he ordered me to divorce her but I refused. I mentioned that to the Prophet and he said: 'O Abdullah bin Umar! Divorce your wife.'\"","reference":"Jami` at-Tirmidhi 1189, Book 13, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role does the Prophet's guidance play in resolving family disputes in Islam?","id":"tirmidhi-13-75"},{"hadith-eng":"The Prophet said: \"No woman should ask for the divorce of her sister (in religion) in order to spill what is in her container.\"","reference":"Jami` at-Tirmidhi 1190, Book 13, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of trying to disrupt another woman's marriage in Islamic teachings?","id":"tirmidhi-13-76"},{"hadith-eng":"The Messenger of Allah said: \"Every divorce is valid except the divorce of the Ma'tuh person whose reason is overcome.\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1191, Book 13, Hadith 18","grade":"","question #":"question #3","question":"What are the conditions under which a divorce is considered invalid in Islam?","id":"tirmidhi-13-77"},{"hadith-eng":"\"The people were such that a man would divorce his wife when he wanted to divorce her, and she remained his wife when he wanted to take her back while she was in her Iddah, and he could divorce a hundred times, or even more, such that a man could say to his wife: 'By Allah! I will neither divorce you irrevocably, nor give you residence ever!' She would say: 'And how is that?' He would say: 'I will divorce you, and whenever your Iddah is just about to end I will take you back. So a woman went to Aishah to inform her about that, and Aishah was silent until the Prophet came. So she told him and the Prophet was silent, until the Qur'an was revealed: Divorce is two times, after that, retain her on reasonable terms or release her with kindness.'\" So Aishah said: \"So the people could carry on with divorce in the future, (knowing) who was divorced, and who was not divorced.\"","reference":"Jami` at-Tirmidhi 1192, Book 13, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role did Aishah play in bringing the issue of divorce practices to the Prophet's attention?","id":"tirmidhi-13-78"},{"hadith-eng":"\"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"","reference":"Jami` at-Tirmidhi 1193, Book 13, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the cultural or religious implications of a widow adorning herself for marriage after her waiting period?","id":"tirmidhi-13-79"},{"hadith-eng":"Abu Hurairah, Ibn Abbas and Abu Salamah bin Abdur-Rahman mentioned the pregnant women whose husband died and she gave birth after the death of her husband. So Ibn Abbas said: \"She observes Iddah until the end of the two terms.\" Abu Salamah said: \"Rather, she is allowed when she gives birth.\" Abu Hurairah said: \"I am with my nephew,\" meaning Abu Salamah.So he sent a message to Umm Salamah the wife of the Prophet. She said: \"Subai'ah Al-Aslamiyyah gave birth a short time after her husband died, so she sought the judgment of the Messenger of Allah and he ordered her to get married.\"","reference":"Jami` at-Tirmidhi 1194, Book 13, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the role of the Prophet Muhammad in resolving disputes regarding the Iddah period?","id":"tirmidhi-13-80"},{"hadith-eng":"Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1195, Book 13, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions did Umm Habibah take after the death of her father according to Islamic teachings?","id":"tirmidhi-13-81"},{"hadith-eng":"Zainab said: \"So I entered upon Zainab bint Jahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1196, Book 13, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions did Zainab bint Jahsh take after her brother's death, and why?","id":"tirmidhi-13-82"},{"hadith-eng":"Zainab said: \"And I heard my mother, Umm Salamah said: 'A woman came to the Messenger of Allah and she said: \"O Messenger of Allah! My daughter's husband died, and she is suffering from an eye ailment, so can she use Kohl?\" the Messenger of Allah said: \"No\" two or three time. Each time (she asked) he said \"no.\" Then he said: \"It is just a mater of four months and ten (days). During Jahliyyah one of you would throw a clump of camel dung when one year passed.\"","reference":"Jami` at-Tirmidhi 1197, Book 13, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What cultural practices during the Jahiliyyah period are contrasted with Islamic teachings in this narration?","id":"tirmidhi-13-83"},{"hadith-eng":"that the Prophet said, about the one who uttered Zihar and had intercourse before the atonement: \"One atonement.\"","reference":"Jami` at-Tirmidhi 1198, Book 13, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the consequences of engaging in intercourse before fulfilling the atonement for Zihar?","id":"tirmidhi-13-84"},{"hadith-eng":"A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"","reference":"Jami` at-Tirmidhi 1199, Book 13, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #3","question":"What steps should be taken to atone for Zihar according to Islamic teachings?","id":"tirmidhi-13-85"},{"hadith-eng":"Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"","reference":"Jami` at-Tirmidhi 1200, Book 13, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does feeding the needy serve as a form of expiation in Islamic law?","id":"tirmidhi-13-86"},{"hadith-eng":"\"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"","reference":"Jami` at-Tirmidhi 1201, Book 13, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of making atonement for an oath in Islam?","id":"tirmidhi-13-87"},{"hadith-eng":"\"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\n\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\n\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"","reference":"Jami` at-Tirmidhi 1202, Book 13, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the Quran address situations where a spouse accuses the other of adultery without witnesses?","id":"tirmidhi-13-88"},{"hadith-eng":"\"A man pronounced the Li'an on his wife, and the Prophet separated the two of them, and he decide that the child belonged to the mother.\"","reference":"Jami` at-Tirmidhi 1203, Book 13, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of Li'an for the marital relationship in Islam?","id":"tirmidhi-13-89"},{"hadith-eng":"Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"","reference":"Jami` at-Tirmidhi 1204, Book 13, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does the Iddah period play in the life of a Muslim widow?","id":"tirmidhi-13-90"},{"hadith-eng":"\"I asked Ibn Umar about a man who divorced his wife while she was menstruating. So he said: 'Don't you know Abdullah bin Umar?' Indeed he divorced his wife while she was menstruating, so Umar asked the Prophet about that, and he ordered him to take her back.'\" He said: \"I said: And that divorce is counted? He said: And that divorce is counted? He said: 'What else would you think if he was helpless and foolish?'\"","reference":"Jami` at-Tirmidhi 1175, Book 13, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"Is a divorce pronounced during menstruation considered valid in Islamic law?","id":"tirmidhi-13-91"},{"hadith-eng":"His father divorced his wife during her menses, so Umar asked the Prophet about that and he said: \"Tell him to take her back, then let him divorce her while she is pure or pregnant.\"","reference":"Jami` at-Tirmidhi 1176, Book 13, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance did the Prophet Muhammad provide regarding divorce during menstruation?","id":"tirmidhi-13-92"},{"hadith-eng":"'O Messenger of Allah! I irrevocably divorced my wife.' So he said: 'What did you intend by that?' I said: 'One (divorce).' He said: '(Do you swear) By Allah?' I said: 'By Allah.' He said: 'Then it is as you intended.'\"","reference":"Jami` at-Tirmidhi 1177, Book 13, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad (ﷺ) address issues of intention in marital matters?","id":"tirmidhi-13-93"},{"hadith-eng":"\"I said to Abu Ayyub: 'Do you know of anyone who said that: \"Your case is up to you?\" counts as three besides Al-Hasan?' He said: \"No, not besides Al-Hasan.' Then he said: 'O Allah forgive me - except for what has been narrated to me by Qatadah, from Kathir the freed slave of Banu Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.'\"Abu Ayyub said: 'So I met Kathir the freed slave of Banu Samurah and asked him about it, but he was not aware of it. So I returned to Qatadah and informed him about that and he said: \"He forgot.\"","reference":"Jami` at-Tirmidhi 1178, Book 13, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the chain of narrators affect the credibility of a hadith?","id":"tirmidhi-13-94"},{"hadith-eng":"\"The Messenger of Allah gave us the choice, so we chose him. So was that a divorce?\"","reference":"Jami` at-Tirmidhi 1179, Book 13, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are decisions regarding marriage and divorce communicated and agreed upon in Islamic teachings?","id":"tirmidhi-13-95"},{"hadith-eng":"\"My husband divorced me three times during the time of the Prophet. So the Messenger of Allah said: 'There is no housing for you nor maintenance.'\" Al-Mughirah (one of the narrators) said: \"I mentioned that to Ibrahim and he said: Umar said: \"We do not leave the Book of Allah and the Sunnah of our Prophet for the saying of a woman, and we do not know if she remembered or forgot.\" And Umar used to give her (the divorced woman) housing and maintenance.'\"","reference":"Jami` at-Tirmidhi 1180, Book 13, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the role of memory and accuracy in narrating hadiths affect Islamic jurisprudence?","id":"tirmidhi-13-96"},{"hadith-eng":"The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"","reference":"Jami` at-Tirmidhi 1181, Book 13, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the conditions under which a vow is considered valid in Islam?","id":"tirmidhi-13-97"},{"hadith-eng":"The Messenger of Allah said: \"The divorce for a slave woman is two divorces, and her Iddah is two menstruations.\"","reference":"Jami` at-Tirmidhi 1182, Book 13, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic law address the issue of divorce for slave women?","id":"tirmidhi-13-98"},{"hadith-eng":"The Messenger of Allah said: \"Allah has permitted my Ummah what occurs in their mines, as long as it is not spoken or acted upon.\"","reference":"Jami` at-Tirmidhi 1183, Book 13, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this teaching reflect on the mercy and forgiveness of Allah towards the believers?","id":"tirmidhi-13-99"},{"hadith-eng":"The Messenger of Allah said: \"Three are serious when they are serious, and serious when they are in jest: Marriage, divorce, and return.\"","reference":"Jami` at-Tirmidhi 1184, Book 13, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to understand the gravity of certain actions like marriage and divorce in Islam?","id":"tirmidhi-13-100"},{"hadith-eng":"that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"","reference":"Jami` at-Tirmidhi 1185, Book 13, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role does menstruation play in determining the Iddah period for a woman?","id":"tirmidhi-13-101"},{"hadith-eng":"The Prophet said: \"The women who seek a Khul are hypocrites.\"","reference":"Jami` at-Tirmidhi 1186, Book 13, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the conditions under which a woman may seek Khul according to Islamic jurisprudence?","id":"tirmidhi-13-102"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman seeks a Khul from her husband without harm (cause), then the scent of Paradise will be unlawful for her.\"","reference":"Jami` at-Tirmidhi 1187, Book 13, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What conditions must be met for a Khul to be considered justified in Islam?","id":"tirmidhi-13-103"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the woman is like a rib, if you try to straighten her you will break her, and if you leave her, what you enjoy from her will be with the crookedness.\"","reference":"Jami` at-Tirmidhi 1188, Book 13, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What lesson can be learned about acceptance and patience in relationships from this saying?","id":"tirmidhi-13-104"},{"hadith-eng":"\"I had a wife whom I loved, but my father disliked her, so he ordered me to divorce her but I refused. I mentioned that to the Prophet and he said: 'O Abdullah bin Umar! Divorce your wife.'\"","reference":"Jami` at-Tirmidhi 1189, Book 13, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #4","question":"How should one balance love for a spouse with respect for parental authority in Islamic teachings?","id":"tirmidhi-13-105"},{"hadith-eng":"The Prophet said: \"No woman should ask for the divorce of her sister (in religion) in order to spill what is in her container.\"","reference":"Jami` at-Tirmidhi 1190, Book 13, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of sisterhood in Islam influence decisions related to marriage and divorce?","id":"tirmidhi-13-106"},{"hadith-eng":"The Messenger of Allah said: \"Every divorce is valid except the divorce of the Ma'tuh person whose reason is overcome.\" (Da'if Jiddan)","reference":"Jami` at-Tirmidhi 1191, Book 13, Hadith 18","grade":"","question #":"question #4","question":"How does the concept of accountability relate to the validity of divorce in Islamic teachings?","id":"tirmidhi-13-107"},{"hadith-eng":"\"The people were such that a man would divorce his wife when he wanted to divorce her, and she remained his wife when he wanted to take her back while she was in her Iddah, and he could divorce a hundred times, or even more, such that a man could say to his wife: 'By Allah! I will neither divorce you irrevocably, nor give you residence ever!' She would say: 'And how is that?' He would say: 'I will divorce you, and whenever your Iddah is just about to end I will take you back. So a woman went to Aishah to inform her about that, and Aishah was silent until the Prophet came. So she told him and the Prophet was silent, until the Qur'an was revealed: Divorce is two times, after that, retain her on reasonable terms or release her with kindness.'\" So Aishah said: \"So the people could carry on with divorce in the future, (knowing) who was divorced, and who was not divorced.\"","reference":"Jami` at-Tirmidhi 1192, Book 13, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the Quranic verse say about the number of times a man can divorce his wife?","id":"tirmidhi-13-108"},{"hadith-eng":"\"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"","reference":"Jami` at-Tirmidhi 1193, Book 13, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islamic law address the issue of remarriage for widows?","id":"tirmidhi-13-109"},{"hadith-eng":"Abu Hurairah, Ibn Abbas and Abu Salamah bin Abdur-Rahman mentioned the pregnant women whose husband died and she gave birth after the death of her husband. So Ibn Abbas said: \"She observes Iddah until the end of the two terms.\" Abu Salamah said: \"Rather, she is allowed when she gives birth.\" Abu Hurairah said: \"I am with my nephew,\" meaning Abu Salamah.So he sent a message to Umm Salamah the wife of the Prophet. She said: \"Subai'ah Al-Aslamiyyah gave birth a short time after her husband died, so she sought the judgment of the Messenger of Allah and he ordered her to get married.\"","reference":"Jami` at-Tirmidhi 1194, Book 13, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet Muhammad differ in their opinions regarding the Iddah period for a pregnant widow?","id":"tirmidhi-13-110"},{"hadith-eng":"Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1195, Book 13, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of using perfume in the context of mourning in Islam?","id":"tirmidhi-13-111"},{"hadith-eng":"Zainab said: \"So I entered upon Zainab bint Jahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1196, Book 13, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of using perfume in the context of mourning according to Islamic teachings?","id":"tirmidhi-13-112"},{"hadith-eng":"Zainab said: \"And I heard my mother, Umm Salamah said: 'A woman came to the Messenger of Allah and she said: \"O Messenger of Allah! My daughter's husband died, and she is suffering from an eye ailment, so can she use Kohl?\" the Messenger of Allah said: \"No\" two or three time. Each time (she asked) he said \"no.\" Then he said: \"It is just a mater of four months and ten (days). During Jahliyyah one of you would throw a clump of camel dung when one year passed.\"","reference":"Jami` at-Tirmidhi 1197, Book 13, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why did the Prophet Muhammad (ﷺ) emphasize the duration of the waiting period for widows?","id":"tirmidhi-13-113"},{"hadith-eng":"that the Prophet said, about the one who uttered Zihar and had intercourse before the atonement: \"One atonement.\"","reference":"Jami` at-Tirmidhi 1198, Book 13, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic law handle cases of Zihar in terms of atonement?","id":"tirmidhi-13-114"},{"hadith-eng":"A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"","reference":"Jami` at-Tirmidhi 1199, Book 13, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad (pbuh) respond to those who seek guidance after committing a mistake?","id":"tirmidhi-13-115"},{"hadith-eng":"Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"","reference":"Jami` at-Tirmidhi 1200, Book 13, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of seeking guidance from the Prophet in resolving personal matters?","id":"tirmidhi-13-116"},{"hadith-eng":"\"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"","reference":"Jami` at-Tirmidhi 1201, Book 13, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of swearing an oath in Islam and how should it be handled if broken?","id":"tirmidhi-13-117"},{"hadith-eng":"\"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\n\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\n\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"","reference":"Jami` at-Tirmidhi 1202, Book 13, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the testimony process in the case of Li'an?","id":"tirmidhi-13-118"},{"hadith-eng":"\"A man pronounced the Li'an on his wife, and the Prophet separated the two of them, and he decide that the child belonged to the mother.\"","reference":"Jami` at-Tirmidhi 1203, Book 13, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the custody of a child determined in cases of Li'an?","id":"tirmidhi-13-119"},{"hadith-eng":"Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"","reference":"Jami` at-Tirmidhi 1204, Book 13, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the practice of Iddah during the time of the Prophet Muhammad affect later Islamic rulings?","id":"tirmidhi-13-120"},{"hadith-eng":"\"I asked Ibn Umar about a man who divorced his wife while she was menstruating. So he said: 'Don't you know Abdullah bin Umar?' Indeed he divorced his wife while she was menstruating, so Umar asked the Prophet about that, and he ordered him to take her back.'\" He said: \"I said: And that divorce is counted? He said: And that divorce is counted? He said: 'What else would you think if he was helpless and foolish?'\"","reference":"Jami` at-Tirmidhi 1175, Book 13, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the consequences of impulsive actions in marital matters from this narration?","id":"tirmidhi-13-121"},{"hadith-eng":"His father divorced his wife during her menses, so Umar asked the Prophet about that and he said: \"Tell him to take her back, then let him divorce her while she is pure or pregnant.\"","reference":"Jami` at-Tirmidhi 1176, Book 13, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the state of purity or pregnancy affect the process of divorce in Islam?","id":"tirmidhi-13-122"},{"hadith-eng":"'O Messenger of Allah! I irrevocably divorced my wife.' So he said: 'What did you intend by that?' I said: 'One (divorce).' He said: '(Do you swear) By Allah?' I said: 'By Allah.' He said: 'Then it is as you intended.'\"","reference":"Jami` at-Tirmidhi 1177, Book 13, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the process for verifying a person's intention in legal matters according to Islamic teachings?","id":"tirmidhi-13-123"},{"hadith-eng":"\"I said to Abu Ayyub: 'Do you know of anyone who said that: \"Your case is up to you?\" counts as three besides Al-Hasan?' He said: \"No, not besides Al-Hasan.' Then he said: 'O Allah forgive me - except for what has been narrated to me by Qatadah, from Kathir the freed slave of Banu Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.'\"Abu Ayyub said: 'So I met Kathir the freed slave of Banu Samurah and asked him about it, but he was not aware of it. So I returned to Qatadah and informed him about that and he said: \"He forgot.\"","reference":"Jami` at-Tirmidhi 1178, Book 13, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #5","question":"What steps can be taken if a narrator is unsure about a hadith they have transmitted?","id":"tirmidhi-13-124"},{"hadith-eng":"\"My husband divorced me three times during the time of the Prophet. So the Messenger of Allah said: 'There is no housing for you nor maintenance.'\" Al-Mughirah (one of the narrators) said: \"I mentioned that to Ibrahim and he said: Umar said: \"We do not leave the Book of Allah and the Sunnah of our Prophet for the saying of a woman, and we do not know if she remembered or forgot.\" And Umar used to give her (the divorced woman) housing and maintenance.'\"","reference":"Jami` at-Tirmidhi 1180, Book 13, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the responsibilities of a husband towards his wife after a triple divorce according to Islamic teachings?","id":"tirmidhi-13-125"},{"hadith-eng":"The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"","reference":"Jami` at-Tirmidhi 1181, Book 13, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of ownership in the context of emancipation in Islamic jurisprudence?","id":"tirmidhi-13-126"},{"hadith-eng":"The Messenger of Allah said: \"The divorce for a slave woman is two divorces, and her Iddah is two menstruations.\"","reference":"Jami` at-Tirmidhi 1182, Book 13, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of the Prophet's teachings on divorce for slave women in Islamic jurisprudence?","id":"tirmidhi-13-127"},{"hadith-eng":"The Messenger of Allah said: \"Allah has permitted my Ummah what occurs in their mines, as long as it is not spoken or acted upon.\"","reference":"Jami` at-Tirmidhi 1183, Book 13, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of this teaching for personal accountability in Islamic jurisprudence?","id":"tirmidhi-13-128"},{"hadith-eng":"The Messenger of Allah said: \"Three are serious when they are serious, and serious when they are in jest: Marriage, divorce, and return.\"","reference":"Jami` at-Tirmidhi 1184, Book 13, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this teaching affect the understanding of commitments in personal relationships?","id":"tirmidhi-13-129"},{"hadith-eng":"that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"","reference":"Jami` at-Tirmidhi 1185, Book 13, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad (ﷺ) guide women regarding the Iddah period after a Khul?","id":"tirmidhi-13-130"},{"hadith-eng":"The Prophet said: \"The women who seek a Khul are hypocrites.\"","reference":"Jami` at-Tirmidhi 1186, Book 13, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of hypocrisy relate to marital disputes in Islam?","id":"tirmidhi-13-131"},{"hadith-eng":"The Messenger of Allah said: \"Whichever woman seeks a Khul from her husband without harm (cause), then the scent of Paradise will be unlawful for her.\"","reference":"Jami` at-Tirmidhi 1187, Book 13, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching emphasize the seriousness of marital commitments in Islam?","id":"tirmidhi-13-132"},{"hadith-eng":"The Messenger of Allah said: \"Indeed the woman is like a rib, if you try to straighten her you will break her, and if you leave her, what you enjoy from her will be with the crookedness.\"","reference":"Jami` at-Tirmidhi 1188, Book 13, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration imply about the balance between acceptance and change in marital relationships?","id":"tirmidhi-13-133"},{"hadith-eng":"\"I had a wife whom I loved, but my father disliked her, so he ordered me to divorce her but I refused. I mentioned that to the Prophet and he said: 'O Abdullah bin Umar! Divorce your wife.'\"","reference":"Jami` at-Tirmidhi 1189, Book 13, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the importance of seeking the Prophet's counsel in personal matters according to Islamic tradition?","id":"tirmidhi-13-134"},{"hadith-eng":"The Prophet said: \"No woman should ask for the divorce of her sister (in religion) in order to spill what is in her container.\"","reference":"Jami` at-Tirmidhi 1190, Book 13, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does Islam provide to women regarding their intentions and actions towards their fellow sisters in faith?","id":"tirmidhi-13-135"},{"hadith-eng":"\"The people were such that a man would divorce his wife when he wanted to divorce her, and she remained his wife when he wanted to take her back while she was in her Iddah, and he could divorce a hundred times, or even more, such that a man could say to his wife: 'By Allah! I will neither divorce you irrevocably, nor give you residence ever!' She would say: 'And how is that?' He would say: 'I will divorce you, and whenever your Iddah is just about to end I will take you back. So a woman went to Aishah to inform her about that, and Aishah was silent until the Prophet came. So she told him and the Prophet was silent, until the Qur'an was revealed: Divorce is two times, after that, retain her on reasonable terms or release her with kindness.'\" So Aishah said: \"So the people could carry on with divorce in the future, (knowing) who was divorced, and who was not divorced.\"","reference":"Jami` at-Tirmidhi 1192, Book 13, Hadith 19","grade":"Hasan(Darussalam)","question #":"question #5","question":"How did the revelation impact the understanding of who was considered divorced?","id":"tirmidhi-13-136"},{"hadith-eng":"\"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"","reference":"Jami` at-Tirmidhi 1193, Book 13, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does the Prophet's guidance play in resolving disputes about widowhood and remarriage?","id":"tirmidhi-13-137"},{"hadith-eng":"Abu Hurairah, Ibn Abbas and Abu Salamah bin Abdur-Rahman mentioned the pregnant women whose husband died and she gave birth after the death of her husband. So Ibn Abbas said: \"She observes Iddah until the end of the two terms.\" Abu Salamah said: \"Rather, she is allowed when she gives birth.\" Abu Hurairah said: \"I am with my nephew,\" meaning Abu Salamah.So he sent a message to Umm Salamah the wife of the Prophet. She said: \"Subai'ah Al-Aslamiyyah gave birth a short time after her husband died, so she sought the judgment of the Messenger of Allah and he ordered her to get married.\"","reference":"Jami` at-Tirmidhi 1194, Book 13, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of consulting the Prophet's wives in matters of Islamic jurisprudence?","id":"tirmidhi-13-138"},{"hadith-eng":"Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1195, Book 13, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"What did the Prophet Muhammad say about the mourning period for women who believe in Allah and the Last Day?","id":"tirmidhi-13-139"},{"hadith-eng":"Zainab said: \"So I entered upon Zainab bint Jahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\"","reference":"Jami` at-Tirmidhi 1196, Book 13, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration indicate about the beliefs of a woman who adheres to the mourning period prescribed by the Prophet?","id":"tirmidhi-13-140"},{"hadith-eng":"Zainab said: \"And I heard my mother, Umm Salamah said: 'A woman came to the Messenger of Allah and she said: \"O Messenger of Allah! My daughter's husband died, and she is suffering from an eye ailment, so can she use Kohl?\" the Messenger of Allah said: \"No\" two or three time. Each time (she asked) he said \"no.\" Then he said: \"It is just a mater of four months and ten (days). During Jahliyyah one of you would throw a clump of camel dung when one year passed.\"","reference":"Jami` at-Tirmidhi 1197, Book 13, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of the Prophet Muhammad (ﷺ) repeatedly saying 'no' to the use of kohl during the waiting period?","id":"tirmidhi-13-141"},{"hadith-eng":"that the Prophet said, about the one who uttered Zihar and had intercourse before the atonement: \"One atonement.\"","reference":"Jami` at-Tirmidhi 1198, Book 13, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #5","question":"What steps must be taken to atone for Zihar according to Islamic jurisprudence?","id":"tirmidhi-13-142"},{"hadith-eng":"A man came to the Prophet, and he had uttered Zihar upon his wife then he had intercourse with her. So he said: 'O Messenger of Allah! I uttered Zihar against my wife, then I had intercourse with her before atoning.' He (pbuh) said: \"What caused you to do that, may Allah have mercy upon you?' He said: 'I saw her anklets in the moonlight.' He said: 'Then do not go near her until you have done what Allah ordered (for it).'\"","reference":"Jami` at-Tirmidhi 1199, Book 13, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned about the importance of following divine commands in marital matters from this incident?","id":"tirmidhi-13-143"},{"hadith-eng":"Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"","reference":"Jami` at-Tirmidhi 1200, Book 13, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic law address the inability to fulfill certain religious obligations due to personal limitations?","id":"tirmidhi-13-144"},{"hadith-eng":"\"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"","reference":"Jami` at-Tirmidhi 1201, Book 13, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the practice of making atonement for an oath reflect on personal accountability in Islam?","id":"tirmidhi-13-145"},{"hadith-eng":"\"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\n\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\n\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"","reference":"Jami` at-Tirmidhi 1202, Book 13, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic law balance between protecting individual honor and ensuring justice in cases of adultery accusations?","id":"tirmidhi-13-146"},{"hadith-eng":"\"A man pronounced the Li'an on his wife, and the Prophet separated the two of them, and he decide that the child belonged to the mother.\"","reference":"Jami` at-Tirmidhi 1203, Book 13, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the Prophet play in resolving marital disputes according to Islamic tradition?","id":"tirmidhi-13-147"},{"hadith-eng":"Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"","reference":"Jami` at-Tirmidhi 1204, Book 13, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of a widow not having a home or maintenance after her husband's death in Islamic law?","id":"tirmidhi-13-148"},{"hadith-eng":"The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"","reference":"Jami` at-Tirmidhi 1181, Book 13, Hadith 7","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does control or lack thereof affect the validity of divorce in Islamic law?","id":"tirmidhi-13-149"},{"hadith-eng":"The Messenger of Allah said: \"Three are serious when they are serious, and serious when they are in jest: Marriage, divorce, and return.\"","reference":"Jami` at-Tirmidhi 1184, Book 13, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #6","question":"What lessons can be drawn about the nature of intentions in serious matters from this teaching?","id":"tirmidhi-13-150"},{"hadith-eng":"\"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\n\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\n\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"","reference":"Jami` at-Tirmidhi 1202, Book 13, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #6","question":"What lessons can be learned about the severity of worldly punishment compared to the Hereafter in the context of Li'an?","id":"tirmidhi-13-151"},{"hadith-eng":"Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"","reference":"Jami` at-Tirmidhi 1204, Book 13, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does the consultation with the Prophet Muhammad reflect the process of seeking religious guidance in personal matters?","id":"tirmidhi-13-152"}]