[{"hadith-eng":"\"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).","reference":"Jami` at-Tirmidhi 1322, Book 15, Hadith 1","grade":"","question #":"question #1","question":"What is the significance of justice in the role of a judge according to Islamic teachings?","id":"tirmidhi-15-1"},{"hadith-eng":"\"Whoever asks for a position as a judge, then he left on his own. And whoever is forced onto it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1323, Book 15, Hadith 3","grade":"","question #":"question #1","question":"What are the implications of seeking a position of authority in Islam?","id":"tirmidhi-15-2"},{"hadith-eng":"\"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1324, Book 15, Hadith 4","grade":"","question #":"question #1","question":"What are the consequences of seeking a position of judgment through intercession?","id":"tirmidhi-15-3"},{"hadith-eng":"\"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"","reference":"Jami` at-Tirmidhi 1325, Book 15, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the challenges and responsibilities associated with being a judge in Islamic jurisprudence?","id":"tirmidhi-15-4"},{"hadith-eng":"\"When the judge passes a judgement in which he strived and was correct, then he receives two rewards. And when he judges and is mistaken, then he receives one reward.\"","reference":"Jami` at-Tirmidhi 1326, Book 15, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of striving for correctness in judicial decisions in Islam?","id":"tirmidhi-15-5"},{"hadith-eng":"\"How will you judge?\" He said: \"I will judge according to what is in Allah's Book.\" He said: \"If it is not in Allah's Book ?\" He said: \"Then with the Sunnah of the Messenger of Allah (ﷺ).\" He said: \"If it is not in the Sunnah of Messenger of Allah (ﷺ)?\" He said: \"I will give in my view.\" He said: \"All praise is due to Allah, the One Who made the messenger of the Messenger of Allah suitable.\"","reference":"Jami` at-Tirmidhi 1327, Book 15, Hadith 7","grade":"Daif(Darussalam)","question #":"question #1","question":"What is the primary source of judgment in Islamic jurisprudence?","id":"tirmidhi-15-6"},{"hadith-eng":"(Another chain of narrators) from some people from the inhabitants of Hims, from Mu'adh, from the Prophet (ﷺ), with similar.","reference":"Jami` at-Tirmidhi 1328, Book 15, Hadith 8","grade":"Daif(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narrators in hadith transmission?","id":"tirmidhi-15-7"},{"hadith-eng":"\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"","reference":"Jami` at-Tirmidhi 1329, Book 15, Hadith 9","grade":"Daif(Darussalam)","question #":"question #1","question":"Who are considered the most beloved people to Allah on the Day of Judgement?","id":"tirmidhi-15-8"},{"hadith-eng":"\"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"","reference":"Jami` at-Tirmidhi 1330, Book 15, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of justice in the role of a judge according to Islamic teachings?","id":"tirmidhi-15-9"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" \n'Ali said: \"I did not err since then.\"","reference":"Jami` at-Tirmidhi 1331, Book 15, Hadith 11","grade":"Daif(Darussalam)","question #":"question #1","question":"What is the significance of listening to both parties before making a judgment?","id":"tirmidhi-15-10"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people.\"","reference":"Jami` at-Tirmidhi 1332, Book 15, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the responsibility of an Imam towards those in need and in poverty?","id":"tirmidhi-15-11"},{"hadith-eng":"\"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"","reference":"Jami` at-Tirmidhi 1334, Book 15, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"Why is it important for a judge to maintain emotional neutrality when making decisions?","id":"tirmidhi-15-12"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"","reference":"Jami` at-Tirmidhi 1335, Book 15, Hadith 15","grade":"Daif(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before taking anything in Islam?","id":"tirmidhi-15-13"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement.\"","reference":"Jami` at-Tirmidhi 1336, Book 15, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic stance on bribery in the context of judicial decisions?","id":"tirmidhi-15-14"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe.\"","reference":"Jami` at-Tirmidhi 1337, Book 15, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic stance on bribery?","id":"tirmidhi-15-15"},{"hadith-eng":"\"If trotter (lacking meat) were given to me I would accept it, and if I was invited to (a meal of) it I would accept.\"","reference":"Jami` at-Tirmidhi 1338, Book 15, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does this narration teach about the Prophet's attitude towards accepting invitations?","id":"tirmidhi-15-16"},{"hadith-eng":"\"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"","reference":"Jami` at-Tirmidhi 1339, Book 15, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does this narration teach about the limitations of human judgment in resolving disputes?","id":"tirmidhi-15-17"},{"hadith-eng":"\"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him.\"","reference":"Jami` at-Tirmidhi 1340, Book 15, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having proof in resolving disputes according to Islamic teachings?","id":"tirmidhi-15-18"},{"hadith-eng":"\"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"","reference":"Jami` at-Tirmidhi 1341, Book 15, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the responsibility of the claimant in a legal dispute according to Islamic teachings?","id":"tirmidhi-15-19"},{"hadith-eng":"Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.","reference":"Jami` at-Tirmidhi 1342, Book 15, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of taking an oath in resolving disputes in Islamic jurisprudence?","id":"tirmidhi-15-20"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"","reference":"Jami` at-Tirmidhi 1343, Book 15, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of an oath in Islamic judicial proceedings?","id":"tirmidhi-15-21"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on oath along with a witness.\"","reference":"Jami` at-Tirmidhi 1344, Book 15, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of taking an oath in Islamic legal proceedings?","id":"tirmidhi-15-22"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on an oath along with one witness.\" He said: \"And 'Ali judged between you based on it.\"","reference":"Jami` at-Tirmidhi 1345, Book 15, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of an oath in Islamic judicial proceedings?","id":"tirmidhi-15-23"},{"hadith-eng":"\"Whoever frees a portion\" or, he said: \"a part\" or he said: \"a share he owns of a slave, then he can afford the remainder of the price according to the reasonable price, then he will be free. Otherwise he has freed as much as he has freed (only).\" Ayyub (one of the narrators) said: \"Perhaps Nafi said in this Hadith: 'Meaning he has freed as much of him as he has freed.'\"","reference":"Jami` at-Tirmidhi 1346, Book 15, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of freeing a portion of a slave in Islamic teachings?","id":"tirmidhi-15-24"},{"hadith-eng":"\"Whoever frees a portion of a slave he owns, then he can afford the remainder of the price, then he should free him with his wealth.\"","reference":"Jami` at-Tirmidhi 1347, Book 15, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of freeing a slave in Islam?","id":"tirmidhi-15-25"},{"hadith-eng":"\"Whoever frees a portion\" or he said: \"a part of a slave, then he should finish paying his price if he can afford it. If he can not afford to pay reasonable price then he should be allowed to work to earn the amount that will free him without overburdening him.\"\n(Another chain) similar, and he said: \"a part\".","reference":"Jami` at-Tirmidhi 1348, Book 15, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of freeing a slave in Islam?","id":"tirmidhi-15-26"},{"hadith-eng":"\"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance.\"","reference":"Jami` at-Tirmidhi 1350, Book 15, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a lifelong gift in Islamic inheritance law?","id":"tirmidhi-15-27"},{"hadith-eng":"\"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant.\"","reference":"Jami` at-Tirmidhi 1351, Book 15, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the concept of lifelong gift in Islamic teachings?","id":"tirmidhi-15-28"},{"hadith-eng":"\"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful.\"","reference":"Jami` at-Tirmidhi 1352, Book 15, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reconciliation among Muslims in Islamic teachings?","id":"tirmidhi-15-29"},{"hadith-eng":"“I heard him saying: ‘the Messenger of Allah (ﷺ) said: “When one of you seeks his neighbor’s permission to affix a wooden beam in his wall, then do not prevent him.\"' When Abu Hurairah narrated it, they tilted their heads, so he said: ‘Why do I see that you are averse to it? By Allah! I will continue to narrate it among you.'\"","reference":"Jami` at-Tirmidhi 1353, Book 15, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking a neighbor's permission in Islam?","id":"tirmidhi-15-30"},{"hadith-eng":"“The oath is based upon what will make your companion believe you.”\n[Qutaibah (one of the narrators) said: “ What will make you believed by your companion”]","reference":"Jami` at-Tirmidhi 1354, Book 15, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of taking an oath in Islam?","id":"tirmidhi-15-31"},{"hadith-eng":"“Make the road seven forearm lengths.”","reference":"Jami` at-Tirmidhi 1355, Book 15, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of specifying a particular measurement for roads in Islamic teachings?","id":"tirmidhi-15-32"},{"hadith-eng":"\"When you disagree over the road, then make it seven forearm lengths.\"","reference":"Jami` at-Tirmidhi 1356, Book 15, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of resolving disputes in Islam?","id":"tirmidhi-15-33"},{"hadith-eng":"\"The Prophet (ﷺ) gave a boy the choice between his father and his mother.\"","reference":"Jami` at-Tirmidhi 1357, Book 15, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of giving a child the choice between parents in Islamic teachings?","id":"tirmidhi-15-34"},{"hadith-eng":"\"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings.\"","reference":"Jami` at-Tirmidhi 1358, Book 15, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is considered the most wholesome source of consumption according to Islamic teachings?","id":"tirmidhi-15-35"},{"hadith-eng":"\"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel.\"","reference":"Jami` at-Tirmidhi 1359, Book 15, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be learned about the Prophet Muhammad's (ﷺ) approach to resolving disputes or conflicts?","id":"tirmidhi-15-36"},{"hadith-eng":"Anas narrated that the Messenger of Allah (ﷺ) borrowed a bowl which broke, so he guaranteed (compensated) it for them.","reference":"Jami` at-Tirmidhi 1360, Book 15, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of compensating for borrowed items in Islam?","id":"tirmidhi-15-37"},{"hadith-eng":"that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" \n(Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers.'\"","reference":"Jami` at-Tirmidhi 1361, Book 15, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #1","question":"What age is considered the transition from childhood to adulthood in Islamic tradition?","id":"tirmidhi-15-38"},{"hadith-eng":"\"My maternal uncle Abu Burdah Ibn Niyar passed  by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head.\"","reference":"Jami` at-Tirmidhi 1362, Book 15, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on marrying a woman who was previously married to one's father?","id":"tirmidhi-15-39"},{"hadith-eng":"\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission.'\"","reference":"Jami` at-Tirmidhi 1363, Book 15, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of resolving disputes through the judgment of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-15-40"},{"hadith-eng":"\"A Man from the Ansar freed six slaves of his upon his death, and he did not have any wealth aside from them. That was conveyed to the Prophet (ﷺ), and he said some harsh words about him.\" He said: \"Then he called for them and he divided them and had them draw lots. So he freed two of them and left four as slaves.\"","reference":"Jami` at-Tirmidhi 1364, Book 15, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fulfilling one's obligations towards slaves in Islam?","id":"tirmidhi-15-41"},{"hadith-eng":"\"Whoever owns a related Mahram, then he is free.\"","reference":"Jami` at-Tirmidhi 1365, Book 15, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the ruling on owning a related Mahram in Islam?","id":"tirmidhi-15-42"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"","reference":"Jami` at-Tirmidhi 1366, Book 15, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of farming land without the owner's permission in Islamic teachings?","id":"tirmidhi-15-43"},{"hadith-eng":"That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you given a gift similar to this one to all of your sons?' He replied: 'No'. So he said: 'Then take him back.'\"","reference":"Jami` at-Tirmidhi 1367, Book 15, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fairness and equality among children in Islam?","id":"tirmidhi-15-44"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor of a home has more right to the home.\"","reference":"Jami` at-Tirmidhi 1368, Book 15, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #1","question":"What rights does a neighbor have in relation to property according to Islamic teachings?","id":"tirmidhi-15-45"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor has more right to his preemption. He is to be waited for even if he is absent, when their paths are the same.\"","reference":"Jami` at-Tirmidhi 1369, Book 15, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #1","question":"What rights does a neighbor have in terms of preemption according to Islamic teachings?","id":"tirmidhi-15-46"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When the boundaries are defined and the streets are fixed, then there is no preemption.\"","reference":"Jami` at-Tirmidhi 1370, Book 15, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of defining boundaries in property transactions?","id":"tirmidhi-15-47"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"","reference":"Jami` at-Tirmidhi 1371, Book 15, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the concept of preemption in Islamic law?","id":"tirmidhi-15-48"},{"hadith-eng":"\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"","reference":"Jami` at-Tirmidhi 1372, Book 15, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the recommended procedure for dealing with lost items according to Islamic teachings?","id":"tirmidhi-15-49"},{"hadith-eng":"\"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"","reference":"Jami` at-Tirmidhi 1373, Book 15, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #1","question":"What steps should be taken when finding a lost item according to Islamic teachings?","id":"tirmidhi-15-50"},{"hadith-eng":"\"I went out with Zaid bin Suhan and Salman bin Rabi'ah, and found a whip.\" In his narration Ibn Numair (one of the narrators) said: \"I found a lost whip and took it. They said: 'Leave it'. I said: 'I will not leave it to be eaten by predators. I will take it to make use of it.' So I met up with Ubayy bin Ka'b and asked him about that. So he narrated the Hadith, he said: 'That is fine. I found a sack containing one hundred Dinar during the lifetime of the Messenger of Allah (ﷺ)' He said: 'So I brought it to him. He said to me: \"Make a public announcement about it for one year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said to me: \"Make a public announcement about it for another year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said: \"Make a public announcement about if for another year.\" And he said: \"Remember its amount, its container and its string. If someone comes seeking it and informs you of its amount and its string, then give it to him, otherwise use it.\"","reference":"Jami` at-Tirmidhi 1374, Book 15, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #1","question":"What should one do upon finding a lost item according to Islamic teachings?","id":"tirmidhi-15-51"},{"hadith-eng":"\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it.\"","reference":"Jami` at-Tirmidhi 1375, Book 15, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the use of wealth obtained from Khaibar?","id":"tirmidhi-15-52"},{"hadith-eng":"\"When a person dies, his deeds are cut off except for three: Continuing charity, knowledge  that others benefited from, and a righteous son who supplicates for him.\"","reference":"Jami` at-Tirmidhi 1376, Book 15, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the deeds that continue to benefit a person after their death?","id":"tirmidhi-15-53"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The injuries caused by the animal are without liability, and wells are without liability, and mines are without liability, and the Khumus is due on Rikaz.\"\n\n(Another Chain) from Abu Hurairah, from the Prophet (ﷺ) with similar meaning.","reference":"Jami` at-Tirmidhi 1377, Book 15, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the concept of liability in Islamic law regarding injuries caused by animals?","id":"tirmidhi-15-54"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land then it is for him, and there is no right for the unjust root.\"","reference":"Jami` at-Tirmidhi 1378, Book 15, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reviving barren land in Islam?","id":"tirmidhi-15-55"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land, then it is for him.\"","reference":"Jami` at-Tirmidhi 1379, Book 15, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reviving barren land in Islam?","id":"tirmidhi-15-56"},{"hadith-eng":"that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"\nSo I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".\n(Another chain) with similar meaning.","reference":"Jami` at-Tirmidhi 1380, Book 15, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #1","question":"What considerations should be taken into account when allocating natural resources like mines?","id":"tirmidhi-15-57"},{"hadith-eng":"from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him.\"","reference":"Jami` at-Tirmidhi 1381, Book 15, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of setting aside land reserves in Islamic tradition?","id":"tirmidhi-15-58"},{"hadith-eng":"that the Prophet (ﷺ) said: \"No Muslim plants a plant or sows a crop, then a person, or a bird, or an animal eats from it, except that it will be charity for him.\"","reference":"Jami` at-Tirmidhi 1382, Book 15, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of planting and agriculture in Islam?","id":"tirmidhi-15-59"},{"hadith-eng":"\"The Prophet (ﷺ) made a deal with the people of Khaibar for half of what was produced from it, whether fruits or crops.\"","reference":"Jami` at-Tirmidhi 1383, Book 15, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #1","question":"What type of agreement did the Prophet Muhammad (ﷺ) establish with the people of Khaibar regarding their produce?","id":"tirmidhi-15-60"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"","reference":"Jami` at-Tirmidhi 1384, Book 15, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding the use of land and its produce?","id":"tirmidhi-15-61"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"","reference":"Jami` at-Tirmidhi 1385, Book 15, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the stance of the Prophet Muhammad (ﷺ) on share-cropping?","id":"tirmidhi-15-62"},{"hadith-eng":"\"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).","reference":"Jami` at-Tirmidhi 1322, Book 15, Hadith 1","grade":"","question #":"question #2","question":"Why might someone be reluctant to take on the role of a judge in an Islamic context?","id":"tirmidhi-15-63"},{"hadith-eng":"\"Whoever asks for a position as a judge, then he left on his own. And whoever is forced onto it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1323, Book 15, Hadith 3","grade":"","question #":"question #2","question":"How does being forced into a position of authority affect one's responsibilities according to Islamic teachings?","id":"tirmidhi-15-64"},{"hadith-eng":"\"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1324, Book 15, Hadith 4","grade":"","question #":"question #2","question":"How does coercion into a position of judgment affect divine assistance?","id":"tirmidhi-15-65"},{"hadith-eng":"\"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"","reference":"Jami` at-Tirmidhi 1325, Book 15, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might the role of a judge be compared to being 'slaughtered without a knife' in terms of its difficulty or danger?","id":"tirmidhi-15-66"},{"hadith-eng":"\"When the judge passes a judgement in which he strived and was correct, then he receives two rewards. And when he judges and is mistaken, then he receives one reward.\"","reference":"Jami` at-Tirmidhi 1326, Book 15, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the efforts of a judge who makes a mistake in their judgement?","id":"tirmidhi-15-67"},{"hadith-eng":"\"How will you judge?\" He said: \"I will judge according to what is in Allah's Book.\" He said: \"If it is not in Allah's Book ?\" He said: \"Then with the Sunnah of the Messenger of Allah (ﷺ).\" He said: \"If it is not in the Sunnah of Messenger of Allah (ﷺ)?\" He said: \"I will give in my view.\" He said: \"All praise is due to Allah, the One Who made the messenger of the Messenger of Allah suitable.\"","reference":"Jami` at-Tirmidhi 1327, Book 15, Hadith 7","grade":"Daif(Darussalam)","question #":"question #2","question":"What should be referred to if a matter is not found in the Quran?","id":"tirmidhi-15-68"},{"hadith-eng":"(Another chain of narrators) from some people from the inhabitants of Hims, from Mu'adh, from the Prophet (ﷺ), with similar.","reference":"Jami` at-Tirmidhi 1328, Book 15, Hadith 8","grade":"Daif(Darussalam)","question #":"question #2","question":"How does the geographical origin of narrators, such as those from Hims, impact the understanding of a hadith?","id":"tirmidhi-15-69"},{"hadith-eng":"\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"","reference":"Jami` at-Tirmidhi 1329, Book 15, Hadith 9","grade":"Daif(Darussalam)","question #":"question #2","question":"What qualities make a leader closest to Allah in status?","id":"tirmidhi-15-70"},{"hadith-eng":"\"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"","reference":"Jami` at-Tirmidhi 1330, Book 15, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the presence of Allah relate to a judge's fairness and justice?","id":"tirmidhi-15-71"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" \n'Ali said: \"I did not err since then.\"","reference":"Jami` at-Tirmidhi 1331, Book 15, Hadith 11","grade":"Daif(Darussalam)","question #":"question #2","question":"How can impartiality be maintained in decision-making according to Islamic teachings?","id":"tirmidhi-15-72"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people.\"","reference":"Jami` at-Tirmidhi 1332, Book 15, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does neglecting the needs of the poor affect an Imam's relationship with Allah?","id":"tirmidhi-15-73"},{"hadith-eng":"\"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"","reference":"Jami` at-Tirmidhi 1334, Book 15, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the potential consequences of a judge making decisions while angry?","id":"tirmidhi-15-74"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"","reference":"Jami` at-Tirmidhi 1335, Book 15, Hadith 15","grade":"Daif(Darussalam)","question #":"question #2","question":"What are the consequences of committing Ghulul according to Islamic teachings?","id":"tirmidhi-15-75"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement.\"","reference":"Jami` at-Tirmidhi 1336, Book 15, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the act of giving or receiving bribes?","id":"tirmidhi-15-76"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe.\"","reference":"Jami` at-Tirmidhi 1337, Book 15, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #2","question":"Who are the individuals mentioned as being cursed in relation to bribery?","id":"tirmidhi-15-77"},{"hadith-eng":"\"If trotter (lacking meat) were given to me I would accept it, and if I was invited to (a meal of) it I would accept.\"","reference":"Jami` at-Tirmidhi 1338, Book 15, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this narration reflect the Prophet's humility and simplicity in accepting food?","id":"tirmidhi-15-78"},{"hadith-eng":"\"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"","reference":"Jami` at-Tirmidhi 1339, Book 15, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does eloquence in argumentation affect the outcome of disputes according to this teaching?","id":"tirmidhi-15-79"},{"hadith-eng":"\"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him.\"","reference":"Jami` at-Tirmidhi 1340, Book 15, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of taking false oaths in legal matters?","id":"tirmidhi-15-80"},{"hadith-eng":"\"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"","reference":"Jami` at-Tirmidhi 1341, Book 15, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is required from the person against whom a claim is made in an Islamic legal context?","id":"tirmidhi-15-81"},{"hadith-eng":"Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.","reference":"Jami` at-Tirmidhi 1342, Book 15, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who is responsible for taking an oath when a claim is made against them in a legal matter?","id":"tirmidhi-15-82"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"","reference":"Jami` at-Tirmidhi 1343, Book 15, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the presence of a witness impact the judgement process in Islamic law?","id":"tirmidhi-15-83"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on oath along with a witness.\"","reference":"Jami` at-Tirmidhi 1344, Book 15, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the presence of a witness impact the judgment process in Islamic law?","id":"tirmidhi-15-84"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on an oath along with one witness.\" He said: \"And 'Ali judged between you based on it.\"","reference":"Jami` at-Tirmidhi 1345, Book 15, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the combination of an oath and a witness contribute to the process of judgment in Islam?","id":"tirmidhi-15-85"},{"hadith-eng":"\"Whoever frees a portion\" or, he said: \"a part\" or he said: \"a share he owns of a slave, then he can afford the remainder of the price according to the reasonable price, then he will be free. Otherwise he has freed as much as he has freed (only).\" Ayyub (one of the narrators) said: \"Perhaps Nafi said in this Hadith: 'Meaning he has freed as much of him as he has freed.'\"","reference":"Jami` at-Tirmidhi 1346, Book 15, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the ability to afford the remainder of a slave's price affect the process of freeing them?","id":"tirmidhi-15-86"},{"hadith-eng":"\"Whoever frees a portion of a slave he owns, then he can afford the remainder of the price, then he should free him with his wealth.\"","reference":"Jami` at-Tirmidhi 1347, Book 15, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam address the issue of partial ownership of a slave?","id":"tirmidhi-15-87"},{"hadith-eng":"\"Whoever frees a portion\" or he said: \"a part of a slave, then he should finish paying his price if he can afford it. If he can not afford to pay reasonable price then he should be allowed to work to earn the amount that will free him without overburdening him.\"\n(Another chain) similar, and he said: \"a part\".","reference":"Jami` at-Tirmidhi 1348, Book 15, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one proceed if they can only afford to free a portion of a slave?","id":"tirmidhi-15-88"},{"hadith-eng":"\"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance.\"","reference":"Jami` at-Tirmidhi 1350, Book 15, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does a lifelong gift affect the distribution of inheritance among offspring?","id":"tirmidhi-15-89"},{"hadith-eng":"\"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant.\"","reference":"Jami` at-Tirmidhi 1351, Book 15, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the Ruqba defined in Islamic jurisprudence?","id":"tirmidhi-15-90"},{"hadith-eng":"\"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful.\"","reference":"Jami` at-Tirmidhi 1352, Book 15, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the limitations on reconciliation agreements in Islam?","id":"tirmidhi-15-91"},{"hadith-eng":"“I heard him saying: ‘the Messenger of Allah (ﷺ) said: “When one of you seeks his neighbor’s permission to affix a wooden beam in his wall, then do not prevent him.\"' When Abu Hurairah narrated it, they tilted their heads, so he said: ‘Why do I see that you are averse to it? By Allah! I will continue to narrate it among you.'\"","reference":"Jami` at-Tirmidhi 1353, Book 15, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam emphasize the rights of neighbors in construction matters?","id":"tirmidhi-15-92"},{"hadith-eng":"“The oath is based upon what will make your companion believe you.”\n[Qutaibah (one of the narrators) said: “ What will make you believed by your companion”]","reference":"Jami` at-Tirmidhi 1354, Book 15, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does an oath influence trust between individuals in Islamic teachings?","id":"tirmidhi-15-93"},{"hadith-eng":"“Make the road seven forearm lengths.”","reference":"Jami` at-Tirmidhi 1355, Book 15, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does urban planning and infrastructure relate to Islamic principles?","id":"tirmidhi-15-94"},{"hadith-eng":"\"When you disagree over the road, then make it seven forearm lengths.\"","reference":"Jami` at-Tirmidhi 1356, Book 15, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam guide individuals to settle disagreements over shared spaces?","id":"tirmidhi-15-95"},{"hadith-eng":"\"The Prophet (ﷺ) gave a boy the choice between his father and his mother.\"","reference":"Jami` at-Tirmidhi 1357, Book 15, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam address the issue of custody and parental rights in the case of separation?","id":"tirmidhi-15-96"},{"hadith-eng":"\"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings.\"","reference":"Jami` at-Tirmidhi 1358, Book 15, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are children related to one's earnings in Islamic perspective?","id":"tirmidhi-15-97"},{"hadith-eng":"\"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel.\"","reference":"Jami` at-Tirmidhi 1359, Book 15, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate fairness and justice in his actions?","id":"tirmidhi-15-98"},{"hadith-eng":"Anas narrated that the Messenger of Allah (ﷺ) borrowed a bowl which broke, so he guaranteed (compensated) it for them.","reference":"Jami` at-Tirmidhi 1360, Book 15, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the responsibility of returning borrowed items in good condition?","id":"tirmidhi-15-99"},{"hadith-eng":"that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" \n(Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers.'\"","reference":"Jami` at-Tirmidhi 1361, Book 15, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) determine eligibility for military service based on age?","id":"tirmidhi-15-100"},{"hadith-eng":"\"My maternal uncle Abu Burdah Ibn Niyar passed  by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head.\"","reference":"Jami` at-Tirmidhi 1362, Book 15, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"What actions did the Prophet Muhammad (ﷺ) take against those who violated Islamic marital laws?","id":"tirmidhi-15-101"},{"hadith-eng":"\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission.'\"","reference":"Jami` at-Tirmidhi 1363, Book 15, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one react when a decision is made by a leader or judge, even if it seems unfavorable?","id":"tirmidhi-15-102"},{"hadith-eng":"\"A Man from the Ansar freed six slaves of his upon his death, and he did not have any wealth aside from them. That was conveyed to the Prophet (ﷺ), and he said some harsh words about him.\" He said: \"Then he called for them and he divided them and had them draw lots. So he freed two of them and left four as slaves.\"","reference":"Jami` at-Tirmidhi 1364, Book 15, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam address the distribution of wealth and property upon a person's death?","id":"tirmidhi-15-103"},{"hadith-eng":"\"Whoever owns a related Mahram, then he is free.\"","reference":"Jami` at-Tirmidhi 1365, Book 15, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam address the issue of freeing slaves who are related Mahrams?","id":"tirmidhi-15-104"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"","reference":"Jami` at-Tirmidhi 1366, Book 15, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the ownership of crops grown on land farmed without permission?","id":"tirmidhi-15-105"},{"hadith-eng":"That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you given a gift similar to this one to all of your sons?' He replied: 'No'. So he said: 'Then take him back.'\"","reference":"Jami` at-Tirmidhi 1367, Book 15, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of giving gifts to children?","id":"tirmidhi-15-106"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor of a home has more right to the home.\"","reference":"Jami` at-Tirmidhi 1368, Book 15, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam emphasize the importance of neighborly relations?","id":"tirmidhi-15-107"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor has more right to his preemption. He is to be waited for even if he is absent, when their paths are the same.\"","reference":"Jami` at-Tirmidhi 1369, Book 15, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should one handle a situation where a neighbor is absent but has a right to preemption?","id":"tirmidhi-15-108"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When the boundaries are defined and the streets are fixed, then there is no preemption.\"","reference":"Jami` at-Tirmidhi 1370, Book 15, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the fixing of streets impact the concept of preemption in Islamic law?","id":"tirmidhi-15-109"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"","reference":"Jami` at-Tirmidhi 1371, Book 15, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does partnership affect the right of preemption in transactions?","id":"tirmidhi-15-110"},{"hadith-eng":"\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"","reference":"Jami` at-Tirmidhi 1372, Book 15, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one handle a stray sheep if found?","id":"tirmidhi-15-111"},{"hadith-eng":"\"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"","reference":"Jami` at-Tirmidhi 1373, Book 15, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long should a public announcement be made for a found item before using it?","id":"tirmidhi-15-112"},{"hadith-eng":"\"I went out with Zaid bin Suhan and Salman bin Rabi'ah, and found a whip.\" In his narration Ibn Numair (one of the narrators) said: \"I found a lost whip and took it. They said: 'Leave it'. I said: 'I will not leave it to be eaten by predators. I will take it to make use of it.' So I met up with Ubayy bin Ka'b and asked him about that. So he narrated the Hadith, he said: 'That is fine. I found a sack containing one hundred Dinar during the lifetime of the Messenger of Allah (ﷺ)' He said: 'So I brought it to him. He said to me: \"Make a public announcement about it for one year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said to me: \"Make a public announcement about it for another year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said: \"Make a public announcement about if for another year.\" And he said: \"Remember its amount, its container and its string. If someone comes seeking it and informs you of its amount and its string, then give it to him, otherwise use it.\"","reference":"Jami` at-Tirmidhi 1374, Book 15, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long should a person announce a found item before they can use it if unclaimed?","id":"tirmidhi-15-113"},{"hadith-eng":"\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it.\"","reference":"Jami` at-Tirmidhi 1375, Book 15, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can wealth be utilized for charitable purposes according to Islamic teachings?","id":"tirmidhi-15-114"},{"hadith-eng":"\"When a person dies, his deeds are cut off except for three: Continuing charity, knowledge  that others benefited from, and a righteous son who supplicates for him.\"","reference":"Jami` at-Tirmidhi 1376, Book 15, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can charity continue to benefit a person after they have passed away?","id":"tirmidhi-15-115"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The injuries caused by the animal are without liability, and wells are without liability, and mines are without liability, and the Khumus is due on Rikaz.\"\n\n(Another Chain) from Abu Hurairah, from the Prophet (ﷺ) with similar meaning.","reference":"Jami` at-Tirmidhi 1377, Book 15, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic jurisprudence address accidents related to wells and mines?","id":"tirmidhi-15-116"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land then it is for him, and there is no right for the unjust root.\"","reference":"Jami` at-Tirmidhi 1378, Book 15, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"What rights does a person have over land they have cultivated?","id":"tirmidhi-15-117"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land, then it is for him.\"","reference":"Jami` at-Tirmidhi 1379, Book 15, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the ownership of land that has been revived?","id":"tirmidhi-15-118"},{"hadith-eng":"that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"\nSo I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".\n(Another chain) with similar meaning.","reference":"Jami` at-Tirmidhi 1380, Book 15, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #2","question":"How can community input influence decisions made by leaders in resource management?","id":"tirmidhi-15-119"},{"hadith-eng":"from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him.\"","reference":"Jami` at-Tirmidhi 1381, Book 15, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was Mu'awiyah and what role did he play in the context of land reserves?","id":"tirmidhi-15-120"},{"hadith-eng":"that the Prophet (ﷺ) said: \"No Muslim plants a plant or sows a crop, then a person, or a bird, or an animal eats from it, except that it will be charity for him.\"","reference":"Jami` at-Tirmidhi 1382, Book 15, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can acts of planting and sowing be considered a form of charity?","id":"tirmidhi-15-121"},{"hadith-eng":"\"The Prophet (ﷺ) made a deal with the people of Khaibar for half of what was produced from it, whether fruits or crops.\"","reference":"Jami` at-Tirmidhi 1383, Book 15, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #2","question":"How were the fruits and crops of Khaibar divided according to the Prophet's agreement?","id":"tirmidhi-15-122"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"","reference":"Jami` at-Tirmidhi 1384, Book 15, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of brotherhood influence economic transactions in Islam?","id":"tirmidhi-15-123"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"","reference":"Jami` at-Tirmidhi 1385, Book 15, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) encourage cooperation among people in agricultural practices?","id":"tirmidhi-15-124"},{"hadith-eng":"\"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).","reference":"Jami` at-Tirmidhi 1322, Book 15, Hadith 1","grade":"","question #":"question #3","question":"How does the example of Ibn 'Umar illustrate the challenges of judicial responsibilities?","id":"tirmidhi-15-125"},{"hadith-eng":"\"Whoever asks for a position as a judge, then he left on his own. And whoever is forced onto it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1323, Book 15, Hadith 3","grade":"","question #":"question #3","question":"What role do angels play in guiding those who are appointed to positions of authority without seeking them?","id":"tirmidhi-15-126"},{"hadith-eng":"\"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1324, Book 15, Hadith 4","grade":"","question #":"question #3","question":"What role does an angel play when someone is coerced into being a judge?","id":"tirmidhi-15-127"},{"hadith-eng":"\"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"","reference":"Jami` at-Tirmidhi 1325, Book 15, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the potential spiritual or ethical risks for someone who takes on the role of a judge?","id":"tirmidhi-15-128"},{"hadith-eng":"\"When the judge passes a judgement in which he strived and was correct, then he receives two rewards. And when he judges and is mistaken, then he receives one reward.\"","reference":"Jami` at-Tirmidhi 1326, Book 15, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What rewards are associated with a judge's correct judgement in Islamic teachings?","id":"tirmidhi-15-129"},{"hadith-eng":"\"How will you judge?\" He said: \"I will judge according to what is in Allah's Book.\" He said: \"If it is not in Allah's Book ?\" He said: \"Then with the Sunnah of the Messenger of Allah (ﷺ).\" He said: \"If it is not in the Sunnah of Messenger of Allah (ﷺ)?\" He said: \"I will give in my view.\" He said: \"All praise is due to Allah, the One Who made the messenger of the Messenger of Allah suitable.\"","reference":"Jami` at-Tirmidhi 1327, Book 15, Hadith 7","grade":"Daif(Darussalam)","question #":"question #3","question":"How should one proceed if guidance is not found in both the Quran and the Sunnah?","id":"tirmidhi-15-130"},{"hadith-eng":"(Another chain of narrators) from some people from the inhabitants of Hims, from Mu'adh, from the Prophet (ﷺ), with similar.","reference":"Jami` at-Tirmidhi 1328, Book 15, Hadith 8","grade":"Daif(Darussalam)","question #":"question #3","question":"What is the role of Mu'adh in the transmission of hadiths?","id":"tirmidhi-15-131"},{"hadith-eng":"\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"","reference":"Jami` at-Tirmidhi 1329, Book 15, Hadith 9","grade":"Daif(Darussalam)","question #":"question #3","question":"How does justice impact a leader's standing with Allah?","id":"tirmidhi-15-132"},{"hadith-eng":"\"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"","reference":"Jami` at-Tirmidhi 1330, Book 15, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences for a judge when they act unjustly?","id":"tirmidhi-15-133"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" \n'Ali said: \"I did not err since then.\"","reference":"Jami` at-Tirmidhi 1331, Book 15, Hadith 11","grade":"Daif(Darussalam)","question #":"question #3","question":"What lessons can be learned about fairness and justice from the advice given by the Prophet (ﷺ)?","id":"tirmidhi-15-134"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people.\"","reference":"Jami` at-Tirmidhi 1332, Book 15, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions can an Imam take to ensure the needs of the community are met?","id":"tirmidhi-15-135"},{"hadith-eng":"\"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"","reference":"Jami` at-Tirmidhi 1334, Book 15, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"How can emotions like anger affect the fairness of a judicial decision?","id":"tirmidhi-15-136"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"","reference":"Jami` at-Tirmidhi 1335, Book 15, Hadith 15","grade":"Daif(Darussalam)","question #":"question #3","question":"How does accountability manifest on the Day of Judgement for those who commit Ghulul?","id":"tirmidhi-15-137"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement.\"","reference":"Jami` at-Tirmidhi 1336, Book 15, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences of engaging in bribery according to Islamic teachings?","id":"tirmidhi-15-138"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe.\"","reference":"Jami` at-Tirmidhi 1337, Book 15, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islam view the act of giving and receiving bribes?","id":"tirmidhi-15-139"},{"hadith-eng":"\"If trotter (lacking meat) were given to me I would accept it, and if I was invited to (a meal of) it I would accept.\"","reference":"Jami` at-Tirmidhi 1338, Book 15, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the importance of accepting hospitality from this narration?","id":"tirmidhi-15-140"},{"hadith-eng":"\"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"","reference":"Jami` at-Tirmidhi 1339, Book 15, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What warning is given about taking something that is not rightfully yours in this narration?","id":"tirmidhi-15-141"},{"hadith-eng":"\"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him.\"","reference":"Jami` at-Tirmidhi 1340, Book 15, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of wrongfully consuming someone else's property in Islam?","id":"tirmidhi-15-142"},{"hadith-eng":"\"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"","reference":"Jami` at-Tirmidhi 1341, Book 15, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic jurisprudence determine the burden of proof in disputes?","id":"tirmidhi-15-143"},{"hadith-eng":"Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.","reference":"Jami` at-Tirmidhi 1342, Book 15, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic law determine the burden of proof in a dispute?","id":"tirmidhi-15-144"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"","reference":"Jami` at-Tirmidhi 1343, Book 15, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does documentation play in preserving historical judicial decisions in Islam?","id":"tirmidhi-15-145"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on oath along with a witness.\"","reference":"Jami` at-Tirmidhi 1344, Book 15, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions required for a valid judgment in Islamic jurisprudence?","id":"tirmidhi-15-146"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on an oath along with one witness.\" He said: \"And 'Ali judged between you based on it.\"","reference":"Jami` at-Tirmidhi 1345, Book 15, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did 'Ali play in implementing the judgment based on an oath and a witness?","id":"tirmidhi-15-147"},{"hadith-eng":"\"Whoever frees a portion\" or, he said: \"a part\" or he said: \"a share he owns of a slave, then he can afford the remainder of the price according to the reasonable price, then he will be free. Otherwise he has freed as much as he has freed (only).\" Ayyub (one of the narrators) said: \"Perhaps Nafi said in this Hadith: 'Meaning he has freed as much of him as he has freed.'\"","reference":"Jami` at-Tirmidhi 1346, Book 15, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does it mean to free as much of a slave as one owns according to Islamic law?","id":"tirmidhi-15-148"},{"hadith-eng":"\"Whoever frees a portion of a slave he owns, then he can afford the remainder of the price, then he should free him with his wealth.\"","reference":"Jami` at-Tirmidhi 1347, Book 15, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"What financial responsibilities does one have when freeing a slave they partially own?","id":"tirmidhi-15-149"},{"hadith-eng":"\"Whoever frees a portion\" or he said: \"a part of a slave, then he should finish paying his price if he can afford it. If he can not afford to pay reasonable price then he should be allowed to work to earn the amount that will free him without overburdening him.\"\n(Another chain) similar, and he said: \"a part\".","reference":"Jami` at-Tirmidhi 1348, Book 15, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the financial responsibilities of someone who partially frees a slave?","id":"tirmidhi-15-150"},{"hadith-eng":"\"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance.\"","reference":"Jami` at-Tirmidhi 1350, Book 15, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of a gift that cannot be returned to the giver in Islamic jurisprudence?","id":"tirmidhi-15-151"},{"hadith-eng":"\"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant.\"","reference":"Jami` at-Tirmidhi 1351, Book 15, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which a lifelong gift is considered permissible?","id":"tirmidhi-15-152"},{"hadith-eng":"\"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful.\"","reference":"Jami` at-Tirmidhi 1352, Book 15, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam view conditions that alter the lawful and unlawful?","id":"tirmidhi-15-153"},{"hadith-eng":"“I heard him saying: ‘the Messenger of Allah (ﷺ) said: “When one of you seeks his neighbor’s permission to affix a wooden beam in his wall, then do not prevent him.\"' When Abu Hurairah narrated it, they tilted their heads, so he said: ‘Why do I see that you are averse to it? By Allah! I will continue to narrate it among you.'\"","reference":"Jami` at-Tirmidhi 1353, Book 15, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the importance of community harmony from this teaching?","id":"tirmidhi-15-154"},{"hadith-eng":"“The oath is based upon what will make your companion believe you.”\n[Qutaibah (one of the narrators) said: “ What will make you believed by your companion”]","reference":"Jami` at-Tirmidhi 1354, Book 15, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions for an oath to be considered valid in Islamic jurisprudence?","id":"tirmidhi-15-155"},{"hadith-eng":"“Make the road seven forearm lengths.”","reference":"Jami` at-Tirmidhi 1355, Book 15, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of ensuring adequate road width in a community?","id":"tirmidhi-15-156"},{"hadith-eng":"\"When you disagree over the road, then make it seven forearm lengths.\"","reference":"Jami` at-Tirmidhi 1356, Book 15, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the recommended measurement for resolving disputes over pathways according to Islamic teachings?","id":"tirmidhi-15-157"},{"hadith-eng":"\"The Prophet (ﷺ) gave a boy the choice between his father and his mother.\"","reference":"Jami` at-Tirmidhi 1357, Book 15, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the considerations for a child's well-being in deciding custody according to Islamic principles?","id":"tirmidhi-15-158"},{"hadith-eng":"\"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings.\"","reference":"Jami` at-Tirmidhi 1358, Book 15, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of earning one's livelihood in Islam?","id":"tirmidhi-15-159"},{"hadith-eng":"\"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel.\"","reference":"Jami` at-Tirmidhi 1359, Book 15, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this incident reveal about the interpersonal dynamics within the Prophet's household?","id":"tirmidhi-15-160"},{"hadith-eng":"Anas narrated that the Messenger of Allah (ﷺ) borrowed a bowl which broke, so he guaranteed (compensated) it for them.","reference":"Jami` at-Tirmidhi 1360, Book 15, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the Prophet Muhammad's (ﷺ) approach to handling borrowed property?","id":"tirmidhi-15-161"},{"hadith-eng":"that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" \n(Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers.'\"","reference":"Jami` at-Tirmidhi 1361, Book 15, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance does the age of fifteen hold in Islamic rulings regarding maturity?","id":"tirmidhi-15-162"},{"hadith-eng":"\"My maternal uncle Abu Burdah Ibn Niyar passed  by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head.\"","reference":"Jami` at-Tirmidhi 1362, Book 15, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"How were violations of marital laws addressed during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-15-163"},{"hadith-eng":"\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission.'\"","reference":"Jami` at-Tirmidhi 1363, Book 15, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this incident teach about the importance of accepting the Prophet's decisions with full submission?","id":"tirmidhi-15-164"},{"hadith-eng":"\"A Man from the Ansar freed six slaves of his upon his death, and he did not have any wealth aside from them. That was conveyed to the Prophet (ﷺ), and he said some harsh words about him.\" He said: \"Then he called for them and he divided them and had them draw lots. So he freed two of them and left four as slaves.\"","reference":"Jami` at-Tirmidhi 1364, Book 15, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on freeing slaves and the conditions surrounding it?","id":"tirmidhi-15-165"},{"hadith-eng":"\"Whoever owns a related Mahram, then he is free.\"","reference":"Jami` at-Tirmidhi 1365, Book 15, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of freeing a related Mahram in Islamic teachings?","id":"tirmidhi-15-166"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"","reference":"Jami` at-Tirmidhi 1366, Book 15, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #3","question":"What financial obligations does a person have if they farm land without permission?","id":"tirmidhi-15-167"},{"hadith-eng":"That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you given a gift similar to this one to all of your sons?' He replied: 'No'. So he said: 'Then take him back.'\"","reference":"Jami` at-Tirmidhi 1367, Book 15, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of the Prophet Muhammad (ﷺ) in resolving family disputes?","id":"tirmidhi-15-168"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor of a home has more right to the home.\"","reference":"Jami` at-Tirmidhi 1368, Book 15, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #3","question":"What considerations should be made when selling or transferring property in relation to neighbors?","id":"tirmidhi-15-169"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor has more right to his preemption. He is to be waited for even if he is absent, when their paths are the same.\"","reference":"Jami` at-Tirmidhi 1369, Book 15, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of shared paths in determining a neighbor's rights?","id":"tirmidhi-15-170"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When the boundaries are defined and the streets are fixed, then there is no preemption.\"","reference":"Jami` at-Tirmidhi 1370, Book 15, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of having no preemption once boundaries and streets are established?","id":"tirmidhi-15-171"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"","reference":"Jami` at-Tirmidhi 1371, Book 15, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #3","question":"In what situations can preemption be applied according to Islamic teachings?","id":"tirmidhi-15-172"},{"hadith-eng":"\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"","reference":"Jami` at-Tirmidhi 1372, Book 15, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the guidance given by the Prophet (ﷺ) regarding stray camels?","id":"tirmidhi-15-173"},{"hadith-eng":"\"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"","reference":"Jami` at-Tirmidhi 1373, Book 15, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #3","question":"What should be done if the owner of a lost item claims it after it has been used?","id":"tirmidhi-15-174"},{"hadith-eng":"\"I went out with Zaid bin Suhan and Salman bin Rabi'ah, and found a whip.\" In his narration Ibn Numair (one of the narrators) said: \"I found a lost whip and took it. They said: 'Leave it'. I said: 'I will not leave it to be eaten by predators. I will take it to make use of it.' So I met up with Ubayy bin Ka'b and asked him about that. So he narrated the Hadith, he said: 'That is fine. I found a sack containing one hundred Dinar during the lifetime of the Messenger of Allah (ﷺ)' He said: 'So I brought it to him. He said to me: \"Make a public announcement about it for one year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said to me: \"Make a public announcement about it for another year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said: \"Make a public announcement about if for another year.\" And he said: \"Remember its amount, its container and its string. If someone comes seeking it and informs you of its amount and its string, then give it to him, otherwise use it.\"","reference":"Jami` at-Tirmidhi 1374, Book 15, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #3","question":"What details should be remembered about a found item to ensure its rightful owner can claim it?","id":"tirmidhi-15-175"},{"hadith-eng":"\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it.\"","reference":"Jami` at-Tirmidhi 1375, Book 15, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the permissible uses of a charitable endowment in Islam?","id":"tirmidhi-15-176"},{"hadith-eng":"\"When a person dies, his deeds are cut off except for three: Continuing charity, knowledge  that others benefited from, and a righteous son who supplicates for him.\"","reference":"Jami` at-Tirmidhi 1376, Book 15, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"In what ways can knowledge benefit others even after the original possessor has died?","id":"tirmidhi-15-177"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The injuries caused by the animal are without liability, and wells are without liability, and mines are without liability, and the Khumus is due on Rikaz.\"\n\n(Another Chain) from Abu Hurairah, from the Prophet (ﷺ) with similar meaning.","reference":"Jami` at-Tirmidhi 1377, Book 15, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of Khumus in Islamic financial obligations?","id":"tirmidhi-15-178"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land then it is for him, and there is no right for the unjust root.\"","reference":"Jami` at-Tirmidhi 1378, Book 15, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam view unjust claims over land?","id":"tirmidhi-15-179"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land, then it is for him.\"","reference":"Jami` at-Tirmidhi 1379, Book 15, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the benefits of cultivating unused land according to Islamic teachings?","id":"tirmidhi-15-180"},{"hadith-eng":"that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"\nSo I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".\n(Another chain) with similar meaning.","reference":"Jami` at-Tirmidhi 1380, Book 15, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the ethical implications of reserving natural resources for individual use?","id":"tirmidhi-15-181"},{"hadith-eng":"from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him.\"","reference":"Jami` at-Tirmidhi 1381, Book 15, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #3","question":"How were land reserves allocated during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-15-182"},{"hadith-eng":"that the Prophet (ﷺ) said: \"No Muslim plants a plant or sows a crop, then a person, or a bird, or an animal eats from it, except that it will be charity for him.\"","reference":"Jami` at-Tirmidhi 1382, Book 15, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #3","question":"What benefits do humans, birds, and animals derive from crops and plants according to Islamic teachings?","id":"tirmidhi-15-183"},{"hadith-eng":"\"The Prophet (ﷺ) made a deal with the people of Khaibar for half of what was produced from it, whether fruits or crops.\"","reference":"Jami` at-Tirmidhi 1383, Book 15, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the Prophet's agreement with the people of Khaibar indicate about Islamic principles of trade and partnership?","id":"tirmidhi-15-184"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"","reference":"Jami` at-Tirmidhi 1384, Book 15, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #3","question":"What alternatives are suggested for utilizing land instead of leasing it for a share of its produce?","id":"tirmidhi-15-185"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"","reference":"Jami` at-Tirmidhi 1385, Book 15, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding mutual assistance in farming?","id":"tirmidhi-15-186"},{"hadith-eng":"\"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).","reference":"Jami` at-Tirmidhi 1322, Book 15, Hadith 1","grade":"","question #":"question #4","question":"What can be learned from the Prophet's statement about the role of a judge and justice?","id":"tirmidhi-15-187"},{"hadith-eng":"\"Whoever asks for a position as a judge, then he left on his own. And whoever is forced onto it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1323, Book 15, Hadith 3","grade":"","question #":"question #4","question":"What are the potential spiritual consequences of desiring a judicial position in Islam?","id":"tirmidhi-15-188"},{"hadith-eng":"\"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1324, Book 15, Hadith 4","grade":"","question #":"question #4","question":"What is the significance of divine assistance in making correct judgments?","id":"tirmidhi-15-189"},{"hadith-eng":"\"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"","reference":"Jami` at-Tirmidhi 1325, Book 15, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islamic teaching view the accountability of those who judge between people?","id":"tirmidhi-15-190"},{"hadith-eng":"\"When the judge passes a judgement in which he strived and was correct, then he receives two rewards. And when he judges and is mistaken, then he receives one reward.\"","reference":"Jami` at-Tirmidhi 1326, Book 15, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic jurisprudence encourage judges to strive for accuracy in their rulings?","id":"tirmidhi-15-191"},{"hadith-eng":"\"How will you judge?\" He said: \"I will judge according to what is in Allah's Book.\" He said: \"If it is not in Allah's Book ?\" He said: \"Then with the Sunnah of the Messenger of Allah (ﷺ).\" He said: \"If it is not in the Sunnah of Messenger of Allah (ﷺ)?\" He said: \"I will give in my view.\" He said: \"All praise is due to Allah, the One Who made the messenger of the Messenger of Allah suitable.\"","reference":"Jami` at-Tirmidhi 1327, Book 15, Hadith 7","grade":"Daif(Darussalam)","question #":"question #4","question":"What qualities made Mu'adh suitable as a messenger of the Messenger of Allah?","id":"tirmidhi-15-192"},{"hadith-eng":"(Another chain of narrators) from some people from the inhabitants of Hims, from Mu'adh, from the Prophet (ﷺ), with similar.","reference":"Jami` at-Tirmidhi 1328, Book 15, Hadith 8","grade":"Daif(Darussalam)","question #":"question #4","question":"How does the consistency of a hadith across different narrations affect its authenticity?","id":"tirmidhi-15-193"},{"hadith-eng":"\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"","reference":"Jami` at-Tirmidhi 1329, Book 15, Hadith 9","grade":"Daif(Darussalam)","question #":"question #4","question":"Who are considered the most hated people to Allah on the Day of Judgement?","id":"tirmidhi-15-194"},{"hadith-eng":"\"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"","reference":"Jami` at-Tirmidhi 1330, Book 15, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Shaitan influence a judge who becomes unjust?","id":"tirmidhi-15-195"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" \n'Ali said: \"I did not err since then.\"","reference":"Jami` at-Tirmidhi 1331, Book 15, Hadith 11","grade":"Daif(Darussalam)","question #":"question #4","question":"Why is it important to hear both sides of a story before reaching a conclusion?","id":"tirmidhi-15-196"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people.\"","reference":"Jami` at-Tirmidhi 1332, Book 15, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the consequences of closing the door on those in dire straits according to Islamic teachings?","id":"tirmidhi-15-197"},{"hadith-eng":"\"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"","reference":"Jami` at-Tirmidhi 1334, Book 15, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance does Islamic teaching provide regarding the state of mind a judge should have?","id":"tirmidhi-15-198"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"","reference":"Jami` at-Tirmidhi 1335, Book 15, Hadith 15","grade":"Daif(Darussalam)","question #":"question #4","question":"What lessons can be learned about responsibility and trust from the instructions given to Mu'adh bin Jabal?","id":"tirmidhi-15-199"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement.\"","reference":"Jami` at-Tirmidhi 1336, Book 15, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is bribery considered a serious offense in Islam?","id":"tirmidhi-15-200"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe.\"","reference":"Jami` at-Tirmidhi 1337, Book 15, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the ethical implications of bribery in Islamic teachings?","id":"tirmidhi-15-201"},{"hadith-eng":"\"If trotter (lacking meat) were given to me I would accept it, and if I was invited to (a meal of) it I would accept.\"","reference":"Jami` at-Tirmidhi 1338, Book 15, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration illustrate the Prophet's approach to social interactions and community?","id":"tirmidhi-15-202"},{"hadith-eng":"\"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"","reference":"Jami` at-Tirmidhi 1339, Book 15, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the consequence of unjustly taking the rights of others as mentioned in this teaching?","id":"tirmidhi-15-203"},{"hadith-eng":"\"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him.\"","reference":"Jami` at-Tirmidhi 1340, Book 15, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the oath play in Islamic legal proceedings when there is a lack of evidence?","id":"tirmidhi-15-204"},{"hadith-eng":"\"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"","reference":"Jami` at-Tirmidhi 1341, Book 15, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does an oath play in resolving claims in Islamic law?","id":"tirmidhi-15-205"},{"hadith-eng":"Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.","reference":"Jami` at-Tirmidhi 1342, Book 15, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does an oath play in the process of adjudication according to Islamic teachings?","id":"tirmidhi-15-206"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"","reference":"Jami` at-Tirmidhi 1343, Book 15, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the combination of an oath and a witness contribute to the credibility of a claim in Islamic jurisprudence?","id":"tirmidhi-15-207"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on oath along with a witness.\"","reference":"Jami` at-Tirmidhi 1344, Book 15, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the combination of an oath and a witness contribute to the establishment of truth in legal matters?","id":"tirmidhi-15-208"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on an oath along with one witness.\" He said: \"And 'Ali judged between you based on it.\"","reference":"Jami` at-Tirmidhi 1345, Book 15, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic jurisprudence view the sufficiency of one witness along with an oath in legal matters?","id":"tirmidhi-15-209"},{"hadith-eng":"\"Whoever frees a portion\" or, he said: \"a part\" or he said: \"a share he owns of a slave, then he can afford the remainder of the price according to the reasonable price, then he will be free. Otherwise he has freed as much as he has freed (only).\" Ayyub (one of the narrators) said: \"Perhaps Nafi said in this Hadith: 'Meaning he has freed as much of him as he has freed.'\"","reference":"Jami` at-Tirmidhi 1346, Book 15, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of reasonable price play a role in the emancipation of slaves?","id":"tirmidhi-15-210"},{"hadith-eng":"\"Whoever frees a portion of a slave he owns, then he can afford the remainder of the price, then he should free him with his wealth.\"","reference":"Jami` at-Tirmidhi 1347, Book 15, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the ethical implications of freeing a slave in Islamic teachings?","id":"tirmidhi-15-211"},{"hadith-eng":"\"Whoever frees a portion\" or he said: \"a part of a slave, then he should finish paying his price if he can afford it. If he can not afford to pay reasonable price then he should be allowed to work to earn the amount that will free him without overburdening him.\"\n(Another chain) similar, and he said: \"a part\".","reference":"Jami` at-Tirmidhi 1348, Book 15, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What provisions are made for a slave to earn their freedom if the owner cannot afford to pay the full price?","id":"tirmidhi-15-212"},{"hadith-eng":"\"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance.\"","reference":"Jami` at-Tirmidhi 1350, Book 15, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of a lifelong gift relate to the rights of heirs in Islam?","id":"tirmidhi-15-213"},{"hadith-eng":"\"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant.\"","reference":"Jami` at-Tirmidhi 1351, Book 15, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the Ruqba in Islamic inheritance laws?","id":"tirmidhi-15-214"},{"hadith-eng":"\"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful.\"","reference":"Jami` at-Tirmidhi 1352, Book 15, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the consequences of making lawful things unlawful or vice versa in Islam?","id":"tirmidhi-15-215"},{"hadith-eng":"“I heard him saying: ‘the Messenger of Allah (ﷺ) said: “When one of you seeks his neighbor’s permission to affix a wooden beam in his wall, then do not prevent him.\"' When Abu Hurairah narrated it, they tilted their heads, so he said: ‘Why do I see that you are averse to it? By Allah! I will continue to narrate it among you.'\"","reference":"Jami` at-Tirmidhi 1353, Book 15, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might people be hesitant to follow certain teachings, and how should they be addressed?","id":"tirmidhi-15-216"},{"hadith-eng":"“The oath is based upon what will make your companion believe you.”\n[Qutaibah (one of the narrators) said: “ What will make you believed by your companion”]","reference":"Jami` at-Tirmidhi 1354, Book 15, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of belief play a role in the acceptance of an oath?","id":"tirmidhi-15-217"},{"hadith-eng":"“Make the road seven forearm lengths.”","reference":"Jami` at-Tirmidhi 1355, Book 15, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this guidance reflect on the importance of public welfare in Islam?","id":"tirmidhi-15-218"},{"hadith-eng":"\"When you disagree over the road, then make it seven forearm lengths.\"","reference":"Jami` at-Tirmidhi 1356, Book 15, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to have clear guidelines for shared spaces in a community?","id":"tirmidhi-15-219"},{"hadith-eng":"\"The Prophet (ﷺ) gave a boy the choice between his father and his mother.\"","reference":"Jami` at-Tirmidhi 1357, Book 15, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of choice for a child reflect on parental responsibilities in Islam?","id":"tirmidhi-15-220"},{"hadith-eng":"\"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings.\"","reference":"Jami` at-Tirmidhi 1358, Book 15, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the relationship between personal earnings and family responsibilities?","id":"tirmidhi-15-221"},{"hadith-eng":"\"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel.\"","reference":"Jami` at-Tirmidhi 1359, Book 15, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration illustrate the concept of compensation or restitution in Islamic teachings?","id":"tirmidhi-15-222"},{"hadith-eng":"Anas narrated that the Messenger of Allah (ﷺ) borrowed a bowl which broke, so he guaranteed (compensated) it for them.","reference":"Jami` at-Tirmidhi 1360, Book 15, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #4","question":"What ethical principles can be derived from the act of guaranteeing compensation for damaged goods?","id":"tirmidhi-15-223"},{"hadith-eng":"that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" \n(Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers.'\"","reference":"Jami` at-Tirmidhi 1361, Book 15, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did 'Umar bin 'Abdul-'Aziz interpret the age of fifteen in terms of military service?","id":"tirmidhi-15-224"},{"hadith-eng":"\"My maternal uncle Abu Burdah Ibn Niyar passed  by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head.\"","reference":"Jami` at-Tirmidhi 1362, Book 15, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role did companions of the Prophet play in enforcing Islamic laws?","id":"tirmidhi-15-225"},{"hadith-eng":"\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission.'\"","reference":"Jami` at-Tirmidhi 1363, Book 15, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration illustrate the concept of justice and fairness in Islam?","id":"tirmidhi-15-226"},{"hadith-eng":"\"A Man from the Ansar freed six slaves of his upon his death, and he did not have any wealth aside from them. That was conveyed to the Prophet (ﷺ), and he said some harsh words about him.\" He said: \"Then he called for them and he divided them and had them draw lots. So he freed two of them and left four as slaves.\"","reference":"Jami` at-Tirmidhi 1364, Book 15, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are decisions made regarding the division of property when there are no other assets?","id":"tirmidhi-15-227"},{"hadith-eng":"\"Whoever owns a related Mahram, then he is free.\"","reference":"Jami` at-Tirmidhi 1365, Book 15, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of this hadith on the treatment of family members in Islam?","id":"tirmidhi-15-228"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"","reference":"Jami` at-Tirmidhi 1366, Book 15, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #4","question":"What ethical considerations are highlighted in the context of using someone else's property without consent?","id":"tirmidhi-15-229"},{"hadith-eng":"That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you given a gift similar to this one to all of your sons?' He replied: 'No'. So he said: 'Then take him back.'\"","reference":"Jami` at-Tirmidhi 1367, Book 15, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to ensure equal treatment of children in Islamic teachings?","id":"tirmidhi-15-230"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor of a home has more right to the home.\"","reference":"Jami` at-Tirmidhi 1368, Book 15, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of neighborly rights impact community harmony in Islam?","id":"tirmidhi-15-231"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor has more right to his preemption. He is to be waited for even if he is absent, when their paths are the same.\"","reference":"Jami` at-Tirmidhi 1369, Book 15, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to consider a neighbor's rights even in their absence?","id":"tirmidhi-15-232"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When the boundaries are defined and the streets are fixed, then there is no preemption.\"","reference":"Jami` at-Tirmidhi 1370, Book 15, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this hadith address the issue of property rights and disputes?","id":"tirmidhi-15-233"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"","reference":"Jami` at-Tirmidhi 1371, Book 15, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of preemption for business partners in Islam?","id":"tirmidhi-15-234"},{"hadith-eng":"\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"","reference":"Jami` at-Tirmidhi 1372, Book 15, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why did the Prophet (ﷺ) express anger when asked about stray camels?","id":"tirmidhi-15-235"},{"hadith-eng":"\"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"","reference":"Jami` at-Tirmidhi 1373, Book 15, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #4","question":"What details should be remembered about a found item before using it?","id":"tirmidhi-15-236"},{"hadith-eng":"\"I went out with Zaid bin Suhan and Salman bin Rabi'ah, and found a whip.\" In his narration Ibn Numair (one of the narrators) said: \"I found a lost whip and took it. They said: 'Leave it'. I said: 'I will not leave it to be eaten by predators. I will take it to make use of it.' So I met up with Ubayy bin Ka'b and asked him about that. So he narrated the Hadith, he said: 'That is fine. I found a sack containing one hundred Dinar during the lifetime of the Messenger of Allah (ﷺ)' He said: 'So I brought it to him. He said to me: \"Make a public announcement about it for one year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said to me: \"Make a public announcement about it for another year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said: \"Make a public announcement about if for another year.\" And he said: \"Remember its amount, its container and its string. If someone comes seeking it and informs you of its amount and its string, then give it to him, otherwise use it.\"","reference":"Jami` at-Tirmidhi 1374, Book 15, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of public announcements in the process of returning lost property?","id":"tirmidhi-15-237"},{"hadith-eng":"\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it.\"","reference":"Jami` at-Tirmidhi 1375, Book 15, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the categories of beneficiaries mentioned for the charity from the land of Khaibar?","id":"tirmidhi-15-238"},{"hadith-eng":"\"When a person dies, his deeds are cut off except for three: Continuing charity, knowledge  that others benefited from, and a righteous son who supplicates for him.\"","reference":"Jami` at-Tirmidhi 1376, Book 15, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of having a righteous child who prays for their deceased parent?","id":"tirmidhi-15-239"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The injuries caused by the animal are without liability, and wells are without liability, and mines are without liability, and the Khumus is due on Rikaz.\"\n\n(Another Chain) from Abu Hurairah, from the Prophet (ﷺ) with similar meaning.","reference":"Jami` at-Tirmidhi 1377, Book 15, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of the term 'Rikaz' in Islamic teachings?","id":"tirmidhi-15-240"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land then it is for him, and there is no right for the unjust root.\"","reference":"Jami` at-Tirmidhi 1378, Book 15, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the ethical considerations in land ownership according to Islamic teachings?","id":"tirmidhi-15-241"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land, then it is for him.\"","reference":"Jami` at-Tirmidhi 1379, Book 15, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #4","question":"What responsibilities come with reviving and owning barren land in Islamic jurisprudence?","id":"tirmidhi-15-242"},{"hadith-eng":"that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"\nSo I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".\n(Another chain) with similar meaning.","reference":"Jami` at-Tirmidhi 1380, Book 15, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the presence of natural resources impact the environment and local wildlife?","id":"tirmidhi-15-243"},{"hadith-eng":"from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him.\"","reference":"Jami` at-Tirmidhi 1381, Book 15, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's (ﷺ) administrative decisions from this event?","id":"tirmidhi-15-244"},{"hadith-eng":"that the Prophet (ﷺ) said: \"No Muslim plants a plant or sows a crop, then a person, or a bird, or an animal eats from it, except that it will be charity for him.\"","reference":"Jami` at-Tirmidhi 1382, Book 15, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the relationship between humans and nature?","id":"tirmidhi-15-245"},{"hadith-eng":"\"The Prophet (ﷺ) made a deal with the people of Khaibar for half of what was produced from it, whether fruits or crops.\"","reference":"Jami` at-Tirmidhi 1383, Book 15, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the economic practices during the time of the Prophet Muhammad (ﷺ) from his deal with the people of Khaibar?","id":"tirmidhi-15-246"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"","reference":"Jami` at-Tirmidhi 1384, Book 15, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the ethical considerations in Islam when it comes to farming and land use?","id":"tirmidhi-15-247"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other.\"","reference":"Jami` at-Tirmidhi 1385, Book 15, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of helping each other in the context of share-cropping?","id":"tirmidhi-15-248"},{"hadith-eng":"\"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).","reference":"Jami` at-Tirmidhi 1322, Book 15, Hadith 1","grade":"","question #":"question #5","question":"How does the hadith reflect on the personal preferences of individuals regarding judicial duties?","id":"tirmidhi-15-249"},{"hadith-eng":"\"Whoever asks for a position as a judge, then he left on his own. And whoever is forced onto it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1323, Book 15, Hadith 3","grade":"","question #":"question #5","question":"How does divine assistance manifest for those who are unwillingly placed in positions of authority?","id":"tirmidhi-15-250"},{"hadith-eng":"\"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)","reference":"Jami` at-Tirmidhi 1324, Book 15, Hadith 4","grade":"","question #":"question #5","question":"How does seeking a position of authority impact one's reliance on divine guidance?","id":"tirmidhi-15-251"},{"hadith-eng":"\"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"","reference":"Jami` at-Tirmidhi 1325, Book 15, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #5","question":"What qualities should a person possess to effectively and justly serve as a judge in an Islamic context?","id":"tirmidhi-15-252"},{"hadith-eng":"\"When the judge passes a judgement in which he strived and was correct, then he receives two rewards. And when he judges and is mistaken, then he receives one reward.\"","reference":"Jami` at-Tirmidhi 1326, Book 15, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this teaching imply about the value of intention and effort in Islamic decision-making?","id":"tirmidhi-15-253"},{"hadith-eng":"\"How will you judge?\" He said: \"I will judge according to what is in Allah's Book.\" He said: \"If it is not in Allah's Book ?\" He said: \"Then with the Sunnah of the Messenger of Allah (ﷺ).\" He said: \"If it is not in the Sunnah of Messenger of Allah (ﷺ)?\" He said: \"I will give in my view.\" He said: \"All praise is due to Allah, the One Who made the messenger of the Messenger of Allah suitable.\"","reference":"Jami` at-Tirmidhi 1327, Book 15, Hadith 7","grade":"Daif(Darussalam)","question #":"question #5","question":"What is the significance of using personal judgment in Islamic decision-making when primary sources are not available?","id":"tirmidhi-15-254"},{"hadith-eng":"\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"","reference":"Jami` at-Tirmidhi 1329, Book 15, Hadith 9","grade":"Daif(Darussalam)","question #":"question #5","question":"What are the consequences of being an oppressive leader in the sight of Allah?","id":"tirmidhi-15-255"},{"hadith-eng":"\"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"","reference":"Jami` at-Tirmidhi 1330, Book 15, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #5","question":"What guidance does Islam provide to judges to maintain justice and fairness?","id":"tirmidhi-15-256"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" \n'Ali said: \"I did not err since then.\"","reference":"Jami` at-Tirmidhi 1331, Book 15, Hadith 11","grade":"Daif(Darussalam)","question #":"question #5","question":"How does this teaching emphasize the importance of careful consideration in judicial matters?","id":"tirmidhi-15-257"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people.\"","reference":"Jami` at-Tirmidhi 1332, Book 15, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does helping those in need impact the spiritual state of a leader in Islam?","id":"tirmidhi-15-258"},{"hadith-eng":"\"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"","reference":"Jami` at-Tirmidhi 1334, Book 15, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"What steps can a judge take to ensure impartiality in their judgments?","id":"tirmidhi-15-259"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"","reference":"Jami` at-Tirmidhi 1335, Book 15, Hadith 15","grade":"Daif(Darussalam)","question #":"question #5","question":"Why is it important to adhere to the commands of a leader or authority in Islamic governance?","id":"tirmidhi-15-260"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement.\"","reference":"Jami` at-Tirmidhi 1336, Book 15, Hadith 16","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does bribery affect justice and fairness in society from an Islamic perspective?","id":"tirmidhi-15-261"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe.\"","reference":"Jami` at-Tirmidhi 1337, Book 15, Hadith 17","grade":"Hasan(Darussalam)","question #":"question #5","question":"What consequences are mentioned for those involved in bribery according to Islamic teachings?","id":"tirmidhi-15-262"},{"hadith-eng":"\"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"","reference":"Jami` at-Tirmidhi 1339, Book 15, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration emphasize the importance of honesty and integrity in legal matters?","id":"tirmidhi-15-263"},{"hadith-eng":"\"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him.\"","reference":"Jami` at-Tirmidhi 1340, Book 15, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the fear of divine accountability influence behavior in disputes over property?","id":"tirmidhi-15-264"},{"hadith-eng":"\"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"","reference":"Jami` at-Tirmidhi 1341, Book 15, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"How are claims and counterclaims addressed in Islamic legal proceedings?","id":"tirmidhi-15-265"},{"hadith-eng":"Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.","reference":"Jami` at-Tirmidhi 1342, Book 15, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"In what situations is an oath required according to Islamic legal principles?","id":"tirmidhi-15-266"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"","reference":"Jami` at-Tirmidhi 1343, Book 15, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the conditions under which an oath can be used as evidence in Islamic courts?","id":"tirmidhi-15-267"},{"hadith-eng":"\"The Prophet (ﷺ) passed judgement based on oath along with a witness.\"","reference":"Jami` at-Tirmidhi 1344, Book 15, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the testimony of a witness play in the Islamic judicial system?","id":"tirmidhi-15-268"},{"hadith-eng":"\"Whoever frees a portion\" or, he said: \"a part\" or he said: \"a share he owns of a slave, then he can afford the remainder of the price according to the reasonable price, then he will be free. Otherwise he has freed as much as he has freed (only).\" Ayyub (one of the narrators) said: \"Perhaps Nafi said in this Hadith: 'Meaning he has freed as much of him as he has freed.'\"","reference":"Jami` at-Tirmidhi 1346, Book 15, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of partial ownership in the context of freeing a slave?","id":"tirmidhi-15-269"},{"hadith-eng":"\"Whoever frees a portion of a slave he owns, then he can afford the remainder of the price, then he should free him with his wealth.\"","reference":"Jami` at-Tirmidhi 1347, Book 15, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of wealth play a role in the process of freeing a slave?","id":"tirmidhi-15-270"},{"hadith-eng":"\"Whoever frees a portion\" or he said: \"a part of a slave, then he should finish paying his price if he can afford it. If he can not afford to pay reasonable price then he should be allowed to work to earn the amount that will free him without overburdening him.\"\n(Another chain) similar, and he said: \"a part\".","reference":"Jami` at-Tirmidhi 1348, Book 15, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam ensure that a slave is not overburdened while working to earn their freedom?","id":"tirmidhi-15-271"},{"hadith-eng":"\"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance.\"","reference":"Jami` at-Tirmidhi 1350, Book 15, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"What conditions must be met for a gift to be considered part of an inheritance?","id":"tirmidhi-15-272"},{"hadith-eng":"\"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant.\"","reference":"Jami` at-Tirmidhi 1351, Book 15, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do lifelong gifts and Ruqba differ from other forms of gifts in Islam?","id":"tirmidhi-15-273"},{"hadith-eng":"\"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful.\"","reference":"Jami` at-Tirmidhi 1352, Book 15, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why are Muslims expected to adhere to their conditions and agreements?","id":"tirmidhi-15-274"},{"hadith-eng":"“I heard him saying: ‘the Messenger of Allah (ﷺ) said: “When one of you seeks his neighbor’s permission to affix a wooden beam in his wall, then do not prevent him.\"' When Abu Hurairah narrated it, they tilted their heads, so he said: ‘Why do I see that you are averse to it? By Allah! I will continue to narrate it among you.'\"","reference":"Jami` at-Tirmidhi 1353, Book 15, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does persistence play in conveying religious teachings?","id":"tirmidhi-15-275"},{"hadith-eng":"“The oath is based upon what will make your companion believe you.”\n[Qutaibah (one of the narrators) said: “ What will make you believed by your companion”]","reference":"Jami` at-Tirmidhi 1354, Book 15, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #5","question":"What ethical considerations should be taken into account when making an oath?","id":"tirmidhi-15-276"},{"hadith-eng":"“Make the road seven forearm lengths.”","reference":"Jami` at-Tirmidhi 1355, Book 15, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does community accessibility play in Islamic teachings?","id":"tirmidhi-15-277"},{"hadith-eng":"\"When you disagree over the road, then make it seven forearm lengths.\"","reference":"Jami` at-Tirmidhi 1356, Book 15, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of fairness manifest in resolving conflicts over roads in Islam?","id":"tirmidhi-15-278"},{"hadith-eng":"\"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings.\"","reference":"Jami` at-Tirmidhi 1358, Book 15, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #5","question":"What ethical considerations are emphasized in Islam regarding consumption and earnings?","id":"tirmidhi-15-279"},{"hadith-eng":"\"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel.\"","reference":"Jami` at-Tirmidhi 1359, Book 15, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be drawn about patience and understanding in marital relationships from this event?","id":"tirmidhi-15-280"},{"hadith-eng":"Anas narrated that the Messenger of Allah (ﷺ) borrowed a bowl which broke, so he guaranteed (compensated) it for them.","reference":"Jami` at-Tirmidhi 1360, Book 15, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this narration reflect the importance of fulfilling obligations in Islamic teachings?","id":"tirmidhi-15-281"},{"hadith-eng":"that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" \n(Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers.'\"","reference":"Jami` at-Tirmidhi 1361, Book 15, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does age play in determining responsibilities and rights in Islamic governance?","id":"tirmidhi-15-282"},{"hadith-eng":"\"My maternal uncle Abu Burdah Ibn Niyar passed  by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head.\"","reference":"Jami` at-Tirmidhi 1362, Book 15, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the flag mentioned in the context of enforcing Islamic rulings?","id":"tirmidhi-15-283"},{"hadith-eng":"\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission.'\"","reference":"Jami` at-Tirmidhi 1363, Book 15, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lesson can be learned about the role of personal relationships in judicial decisions?","id":"tirmidhi-15-284"},{"hadith-eng":"\"A Man from the Ansar freed six slaves of his upon his death, and he did not have any wealth aside from them. That was conveyed to the Prophet (ﷺ), and he said some harsh words about him.\" He said: \"Then he called for them and he divided them and had them draw lots. So he freed two of them and left four as slaves.\"","reference":"Jami` at-Tirmidhi 1364, Book 15, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does the Prophet (ﷺ) play in resolving issues related to inheritance and property distribution?","id":"tirmidhi-15-285"},{"hadith-eng":"\"Whoever owns a related Mahram, then he is free.\"","reference":"Jami` at-Tirmidhi 1365, Book 15, Hadith 45","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this teaching reflect the Islamic perspective on family and kinship?","id":"tirmidhi-15-286"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"","reference":"Jami` at-Tirmidhi 1366, Book 15, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this teaching emphasize the importance of respecting others' property rights?","id":"tirmidhi-15-287"},{"hadith-eng":"That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you given a gift similar to this one to all of your sons?' He replied: 'No'. So he said: 'Then take him back.'\"","reference":"Jami` at-Tirmidhi 1367, Book 15, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about justice in family matters from the actions of the Prophet (ﷺ)?","id":"tirmidhi-15-288"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The neighbor of a home has more right to the home.\"","reference":"Jami` at-Tirmidhi 1368, Book 15, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of prioritizing neighbors in property matters?","id":"tirmidhi-15-289"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When the boundaries are defined and the streets are fixed, then there is no preemption.\"","reference":"Jami` at-Tirmidhi 1370, Book 15, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do defined boundaries play in maintaining social order and justice?","id":"tirmidhi-15-290"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"","reference":"Jami` at-Tirmidhi 1371, Book 15, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the principle of preemption ensure fairness in business dealings?","id":"tirmidhi-15-291"},{"hadith-eng":"\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"","reference":"Jami` at-Tirmidhi 1372, Book 15, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the responsibilities of a person who finds a lost item in terms of public announcement?","id":"tirmidhi-15-292"},{"hadith-eng":"\"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"","reference":"Jami` at-Tirmidhi 1373, Book 15, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of making a public announcement for a lost item in Islam?","id":"tirmidhi-15-293"},{"hadith-eng":"\"I went out with Zaid bin Suhan and Salman bin Rabi'ah, and found a whip.\" In his narration Ibn Numair (one of the narrators) said: \"I found a lost whip and took it. They said: 'Leave it'. I said: 'I will not leave it to be eaten by predators. I will take it to make use of it.' So I met up with Ubayy bin Ka'b and asked him about that. So he narrated the Hadith, he said: 'That is fine. I found a sack containing one hundred Dinar during the lifetime of the Messenger of Allah (ﷺ)' He said: 'So I brought it to him. He said to me: \"Make a public announcement about it for one year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said to me: \"Make a public announcement about it for another year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said: \"Make a public announcement about if for another year.\" And he said: \"Remember its amount, its container and its string. If someone comes seeking it and informs you of its amount and its string, then give it to him, otherwise use it.\"","reference":"Jami` at-Tirmidhi 1374, Book 15, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does one determine the rightful owner of a lost item in Islamic tradition?","id":"tirmidhi-15-294"},{"hadith-eng":"\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it.\"","reference":"Jami` at-Tirmidhi 1375, Book 15, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of a custodian in managing a charitable endowment?","id":"tirmidhi-15-295"},{"hadith-eng":"\"When a person dies, his deeds are cut off except for three: Continuing charity, knowledge  that others benefited from, and a righteous son who supplicates for him.\"","reference":"Jami` at-Tirmidhi 1376, Book 15, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does supplication from a child impact the deceased according to Islamic teachings?","id":"tirmidhi-15-296"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The injuries caused by the animal are without liability, and wells are without liability, and mines are without liability, and the Khumus is due on Rikaz.\"\n\n(Another Chain) from Abu Hurairah, from the Prophet (ﷺ) with similar meaning.","reference":"Jami` at-Tirmidhi 1377, Book 15, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith reflect on the responsibilities of individuals in cases of accidental harm?","id":"tirmidhi-15-297"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land then it is for him, and there is no right for the unjust root.\"","reference":"Jami` at-Tirmidhi 1378, Book 15, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of reviving land relate to environmental stewardship in Islam?","id":"tirmidhi-15-298"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever revives a barren land, then it is for him.\"","reference":"Jami` at-Tirmidhi 1379, Book 15, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the act of reviving barren land contribute to community welfare in Islam?","id":"tirmidhi-15-299"},{"hadith-eng":"that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"\nSo I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".\n(Another chain) with similar meaning.","reference":"Jami` at-Tirmidhi 1380, Book 15, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does consultation play in decision-making processes in Islamic governance?","id":"tirmidhi-15-300"},{"hadith-eng":"from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him.\"","reference":"Jami` at-Tirmidhi 1381, Book 15, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the historical importance of Hadramawt in early Islamic history?","id":"tirmidhi-15-301"},{"hadith-eng":"that the Prophet (ﷺ) said: \"No Muslim plants a plant or sows a crop, then a person, or a bird, or an animal eats from it, except that it will be charity for him.\"","reference":"Jami` at-Tirmidhi 1382, Book 15, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the rewards for a Muslim who contributes to the environment and wildlife?","id":"tirmidhi-15-302"},{"hadith-eng":"\"The Prophet (ﷺ) made a deal with the people of Khaibar for half of what was produced from it, whether fruits or crops.\"","reference":"Jami` at-Tirmidhi 1383, Book 15, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet's agreement with the people of Khaibar reflect on the management of agricultural resources in Islamic history?","id":"tirmidhi-15-303"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"","reference":"Jami` at-Tirmidhi 1384, Book 15, Hadith 65","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic teaching address the issue of benefiting from land ownership?","id":"tirmidhi-15-304"},{"hadith-eng":"\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam.\"","reference":"Jami` at-Tirmidhi 1329, Book 15, Hadith 9","grade":"Daif(Darussalam)","question #":"question #6","question":"How does oppression affect a leader's relationship with Allah?","id":"tirmidhi-15-305"},{"hadith-eng":"\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission.'\"","reference":"Jami` at-Tirmidhi 1363, Book 15, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does this event relate to the Quranic verse about having faith and accepting the Prophet's judgment?","id":"tirmidhi-15-306"},{"hadith-eng":"\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"","reference":"Jami` at-Tirmidhi 1372, Book 15, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #6","question":"What are the potential outcomes for a stray sheep according to the hadith?","id":"tirmidhi-15-307"},{"hadith-eng":"\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it.\"","reference":"Jami` at-Tirmidhi 1375, Book 15, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #6","question":"What are the restrictions placed on the sale, inheritance, or gifting of a charitable endowment in Islam?","id":"tirmidhi-15-308"},{"hadith-eng":"that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"\nSo I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".\n(Another chain) with similar meaning.","reference":"Jami` at-Tirmidhi 1380, Book 15, Hadith 61","grade":"Hasan(Darussalam)","question #":"question #6","question":"How should leaders balance individual requests with community welfare in resource allocation?","id":"tirmidhi-15-309"}]