[{"hadith-eng":"\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"","reference":"Jami` at-Tirmidhi 1548, Book 21, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #1","question":"What approach did Salman Al-Farisi use to invite non-Muslims to Islam during a siege?","id":"tirmidhi-21-1"},{"hadith-eng":"From his father and he was a Companion who said: \"When the Messenger of Allah (ﷺ) dispatched any army or battalion, he would say to them: 'If you see a Masjid, or hear someone calling the Adhan, then do not kill anyone.'\"","reference":"Jami` at-Tirmidhi 1549, Book 21, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #1","question":"What instructions did the Prophet Muhammad (ﷺ) give to the army regarding places of worship during military expeditions?","id":"tirmidhi-21-2"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"","reference":"Jami` at-Tirmidhi 1550, Book 21, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the strategy of the Prophet Muhammad (ﷺ) when approaching a settlement at night?","id":"tirmidhi-21-3"},{"hadith-eng":"\"When the Prophet (ﷺ) overtook a people he would stay at the outskirts of their city for three nights.\"","reference":"Jami` at-Tirmidhi 1551, Book 21, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the Prophet's practice when approaching a new city or community?","id":"tirmidhi-21-4"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) burnt the palm trees of Bani Nadir and cut them down at Al-Buwairah. So Allah revealed: Whatever you cut down of their palm trees, or you left them standing on their trunks, then it was by the permission of Allah, and in the order to disgrace the rebellious.(59:5)\"","reference":"Jami` at-Tirmidhi 1552, Book 21, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of the actions taken by the Prophet (ﷺ) against the palm trees of Bani Nadir?","id":"tirmidhi-21-5"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"","reference":"Jami` at-Tirmidhi 1553, Book 21, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #1","question":"What distinguishes the Prophet Muhammad from other prophets according to Islamic teachings?","id":"tirmidhi-21-6"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"","reference":"Jami` at-Tirmidhi 1554, Book 21, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"How were spoils of war distributed among soldiers and their horses in early Islamic battles?","id":"tirmidhi-21-7"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"This Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.","reference":"Jami` at-Tirmidhi 1555, Book 21, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is considered the ideal number of companions according to Islamic teachings?","id":"tirmidhi-21-8"},{"hadith-eng":"That Najdah Al-Haruri wrote to Ibn 'Abbas asking if the Messenger of Allah (ﷺ) would fight along with women, and if he would fix a share of the spoils of war for them. Ibn 'Abbas wrote to him: \"You wrote to me asking me if the Messenger of Allah (ﷺ) would fight along with women. He did fight along with them, as they would treat the wounded. They received something from the spoils of war, but as for their share, then he did not fix a share for them.\"There is something on this topic from Anas and Umm 'Atiyyah.This Hadith is Hasan Sahih. This is acted upon according to most of the people of knowledge. It is the view of Sufyan Ath-Thawri and Ash-Shafi'i. Some of them said that a share is given to the woman and the boy, and this is the view of Al-Awza'i.Al-Awza'i said: The Prophet (ﷺ) gave a portion to the boys at Khaibar, and the Aimmah of the Muslims gave a portion to every child born in the land of war.\" Al-Awza'i said: \"The Prophet (ﷺ) gave a portion to the women at Khaibar, and that was followed by the Muslims after him.\" This was narrated to us by 'Ali bin Khashram (who said): \"'Eisa bin Yunus narrated this to us from Al-Awza'i.\"The meaning of his saying: \"They received something from the spoils of war\" it is said that he conferred something on them (the women) from the spoils of war.","reference":"Jami` at-Tirmidhi 1556, Book 21, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What roles did women play in battles during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-9"},{"hadith-eng":"\"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.","reference":"Jami` at-Tirmidhi 1557, Book 21, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of granting a portion of war spoils to a slave in Islamic tradition?","id":"tirmidhi-21-10"},{"hadith-eng":"That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.","reference":"Jami` at-Tirmidhi 1558, Book 21, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of belief in Allah and His Messenger in participating in battles according to Islamic teachings?","id":"tirmidhi-21-11"},{"hadith-eng":"\"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.","reference":"Jami` at-Tirmidhi 1559, Book 21, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of distributing shares among those who participate in a conquest?","id":"tirmidhi-21-12"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.","reference":"Jami` at-Tirmidhi 1560, Book 21, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the use of pots belonging to non-Muslims?","id":"tirmidhi-21-13"},{"hadith-eng":"\"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1561, Book 21, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the practice of the Prophet (ﷺ) regarding the distribution of spoils of war during expeditions?","id":"tirmidhi-21-14"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"[Abu 'Eisa said:] There is a story with this Hadith.","reference":"Jami` at-Tirmidhi 1562, Book 21, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the conditions under which a warrior can claim the goods of an enemy killed in battle?","id":"tirmidhi-21-15"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"There is something on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1563, Book 21, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of distributing spoils of war before selling them in Islamic teachings?","id":"tirmidhi-21-16"},{"hadith-eng":"From her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.Al-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"","reference":"Jami` at-Tirmidhi 1564, Book 21, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the ruling on having intercourse with female prisoners according to Islamic teachings?","id":"tirmidhi-21-17"},{"hadith-eng":"From his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"[Abu 'Eisa said:] This Hadith is Hasan","reference":"Jami` at-Tirmidhi 1565, Book 21, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding consuming food from people of other faiths?","id":"tirmidhi-21-18"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"Whoever separates between a mother and her child, then Allah will separate between him and his beloved on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Gharib.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike separating the captives, the mother and her child, the son and the father, and brothers.","reference":"Jami` at-Tirmidhi 1566, Book 21, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences of separating a mother from her child according to Islamic teachings?","id":"tirmidhi-21-19"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.","reference":"Jami` at-Tirmidhi 1567, Book 21, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #1","question":"What choices were given to the Companions regarding the captives of Badr?","id":"tirmidhi-21-20"},{"hadith-eng":"That the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.[Abu 'Eisa said:] This Hadith is Hasan Sahih.The paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)This is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.Al-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"Ishaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"","reference":"Jami` at-Tirmidhi 1568, Book 21, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different options available to an Imam regarding the treatment of captives in Islam?","id":"tirmidhi-21-21"},{"hadith-eng":"That a woman was found killed in one of the expeditions of the Messenger of Allah (ﷺ), so the Messenger of Allah (ﷺ) rebuked that, and he prohibited killing women and children.There are narrations on this topic from Buraidah and Rabah - and they say he was Riyah - bin Ar-Rabi', Al-Aswad bin Sari', Ibn 'Abbas, and As-Sa'b bin Jaththamah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They disliked killing women and children. This is the view of Sufyan Ath-Thawri and Ash-Shafi'i.Some of the people of knowledge made an exception for killing the women who had children with them during night attacks, this is the view of Ahmad and Ishaq, they permitted it in night attacks.","reference":"Jami` at-Tirmidhi 1569, Book 21, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the stance of the Prophet Muhammad (ﷺ) on the killing of women and children during expeditions?","id":"tirmidhi-21-22"},{"hadith-eng":"\"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1570, Book 21, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on collateral damage involving non-combatants during warfare in Islam?","id":"tirmidhi-21-23"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) sent us with an army and said: 'If you see so-and-so, and so-and-so' referring to two men from the Quraish: 'then burn them with fire.' Then, upon our departure, the Messenger of Allah (ﷺ) said: 'I ordered you to burn so-and-so, and so-and-so with fire, and indeed, none punishes with fire except Allah. So if you see them, then kill them.'\"There are narrations on this topic from Ibn 'Abbas and Hamzah bin 'Amr Al-Aslami.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. In this Hadith, Muhammad bin Ishaq mentioned a man (narrating) between Sulaiman bin Yasar and Abu Hurairah. Others reported this Hadith the same as Al-Laith reported it(here, without a man between them). The narration of Al-Laith bin Sa'd is more appropriate and more correct.","reference":"Jami` at-Tirmidhi 1571, Book 21, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's initial command and subsequent retraction regarding punishment by fire?","id":"tirmidhi-21-24"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"There are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-JuhniFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers","reference":"Jami` at-Tirmidhi 1572, Book 21, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the three things a person should be free from to enter paradise according to Islamic teachings?","id":"tirmidhi-21-25"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever's soul departs from his body while he is free of three: Kanz (buried treasure), Ghulul, and debt, then he will enter paradise.\"This is how Sa'eed narrated it: \"Kanz\" while Abu 'Awanah said in his narration: \"Kibr\" and he did not mention \"from Ma'dan\" in it. But the narration of Sa'eed is more correct.","reference":"Jami` at-Tirmidhi 1573, Book 21, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the three things a person should be free from to enter paradise according to Islamic teachings?","id":"tirmidhi-21-26"},{"hadith-eng":"\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1574, Book 21, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of belief in entering paradise according to Islamic teachings?","id":"tirmidhi-21-27"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1575, Book 21, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What roles did women play in supporting the Muslim community during battles in the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-28"},{"hadith-eng":"From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.","reference":"Jami` at-Tirmidhi 1576, Book 21, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of accepting gifts from rulers or kings in Islam?","id":"tirmidhi-21-29"},{"hadith-eng":"That he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.It has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.And the implication is that this was after he used to accept from them, and then he later forbade their gifts.","reference":"Jami` at-Tirmidhi 1577, Book 21, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of accepting gifts from non-Muslims in Islam?","id":"tirmidhi-21-30"},{"hadith-eng":"\"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.This is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1578, Book 21, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of prostration in expressing gratitude in Islam?","id":"tirmidhi-21-31"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1579, Book 21, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of a woman's assurance of protection in Islam?","id":"tirmidhi-21-32"},{"hadith-eng":"\"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1580, Book 21, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fulfilling treaties in Islam?","id":"tirmidhi-21-33"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. \nI asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"","reference":"Jami` at-Tirmidhi 1581, Book 21, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a banner being erected for a betrayer on the Day of Judgement?","id":"tirmidhi-21-34"},{"hadith-eng":"\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1582, Book 21, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #1","question":"What role did Sa'd bin Mu'adh play in the judgment of Banu Quraizah?","id":"tirmidhi-21-35"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Kill the elder men among the idolaters and spare the Sharkh amont them.\"And the Sharkh are the boys who did not begin to grow pubic hair.[Abu 'Eisa said:] This Hadith is Hasan Sahih.Hajjaj bin Artah narrated similarly from Qatadah.","reference":"Jami` at-Tirmidhi 1583, Book 21, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of distinguishing between different groups of people in times of conflict according to Islamic teachings?","id":"tirmidhi-21-36"},{"hadith-eng":"\"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.","reference":"Jami` at-Tirmidhi 1584, Book 21, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #1","question":"What criteria were used to determine the age of responsibility during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-37"},{"hadith-eng":"From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1585, Book 21, Hadith 47","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of fulfilling allegiances made before Islam according to Islamic teachings?","id":"tirmidhi-21-38"},{"hadith-eng":"\"I was a scribe for Jaz' bin Mu'awiyah at Manadhir when 'Umar's letter came to us (saying): 'Inspect the Zoroastrians around you to take the Jizyah from them. For indeed 'Abdur-Rahman bin 'Awf informed me that the Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Hajar.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1586, Book 21, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of collecting Jizyah from non-Muslims in Islamic governance?","id":"tirmidhi-21-39"},{"hadith-eng":"That 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"There is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1587, Book 21, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of consulting knowledgeable companions in making decisions regarding religious rulings?","id":"tirmidhi-21-40"},{"hadith-eng":"From Az-Zuhri, that Sa'ib bin Yazid said: \"The Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Bahrain, and 'Umar took it in Persia, and 'Uthman took it from the Persians.\"I asked Muhammad about this, so he said: \"It is: 'Malik from Az-Zuhri from the Prophet (ﷺ).'\"","reference":"Jami` at-Tirmidhi 1588, Book 21, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of collecting Jizyah from non-Muslims in Islamic governance?","id":"tirmidhi-21-41"},{"hadith-eng":"\"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.This Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.","reference":"Jami` at-Tirmidhi 1589, Book 21, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding the treatment of travelers or guests?","id":"tirmidhi-21-42"},{"hadith-eng":"That on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.","reference":"Jami` at-Tirmidhi 1590, Book 21, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the conquest of Makkah in relation to the concept of Hijrah?","id":"tirmidhi-21-43"},{"hadith-eng":"From Abu Salamah, from Jabir bin Abdullah about the statement of Allah, most High: Allah was pleased with the believers when they gave the pledge to you under the tree (48:18). that Jabir said: \"We pledged to the Messenger of Allah (ﷺ) that we would not flee, and we did not pledge to him for death.\"[He said:] There are narration on this topic from Salamah bin Al-Akwa', Ibn 'Umar, 'Ubadah, and Jarir bin 'Abdullah.[Abu 'Eisa said:] This Hadith is been reported from 'Eisa bin Yunus, from Al-Awza'i, from Yahya bin Abi Kathir who said: \"Jabir bin 'Abdullah said\" and he did not mention Abu Salamah on it.","reference":"Jami` at-Tirmidhi 1591, Book 21, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of the pledge given by the believers under the tree?","id":"tirmidhi-21-44"},{"hadith-eng":"\"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1592, Book 21, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of the pledge made by the companions to the Prophet Muhammad (ﷺ) at Al-Hudaibiyyah?","id":"tirmidhi-21-45"},{"hadith-eng":"\"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1593, Book 21, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of pledging allegiance to a leader in Islam?","id":"tirmidhi-21-46"},{"hadith-eng":"\"We did not pledge to the Messenger of Allah (ﷺ) for death, but only that we would not flee.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, meaning both of the Ahadith are Sahih. Some of his Companions pledged to him for death, they said only: \"We will not leave from in front of you as long as we are not killed.\" While others pledged him by saying: \"We will not flee.\"","reference":"Jami` at-Tirmidhi 1594, Book 21, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of pledging loyalty to a leader in Islam?","id":"tirmidhi-21-47"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Three will not be spoken to by Allah on the Day of Judgement, nor will they be purified, and for them is a painful torment: A man that gave a pledge to an Imam, and if he gives to him he fulfills it, and if he does not give to him he does not fulfill not fulfill it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1595, Book 21, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences for those whom Allah will not speak to or purify on the Day of Judgement?","id":"tirmidhi-21-48"},{"hadith-eng":"\"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came, and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. After this he (ﷺ) would not take the pledge from anyone until he asked him if he was a slave.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Jabir is Hasan Gharib Sahih, we do not know of it except as a narration of Abu Az-Zubair.","reference":"Jami` at-Tirmidhi 1596, Book 21, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #1","question":"What considerations did the Prophet (ﷺ) take into account before accepting a pledge for Hijrah?","id":"tirmidhi-21-49"},{"hadith-eng":"\"I pledged to the Messenger of Allah (ﷺ) along with some women. He said to us: 'In as much as you are able and capable.' I said: 'Allah and His Messenger are more merciful to us than we are to ourselves,' then I said: 'O Messenger of Allah take the pledge from us.'\" - Sufyan (one of the narrators) said: meaning: 'shake (hands) on it with us' - \"so the Messenger of Allah (ﷺ) said: 'My statement to one hundred women is like my statement to one.'\"[He said:] There are narrations on this topic from 'Aishah, from 'Abdullah bin 'Umar, and Asma' bint Yazid.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of Muhammad bin Al-Munkadir.Sufyan Ath-Thawri, Malik bin Anas, and others reported this Hadith from Muhammad bin Al-Munkadir similarly. He said: I asked Muhammad about this Hadith and he said: \"I am not aware of a Hadith other than this from Umaimah bint Ruqaiqah.\" There is another woman named Umaimah who narrated from the Messenger of Allah (ﷺ).","reference":"Jami` at-Tirmidhi 1597, Book 21, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of pledging allegiance to the Prophet Muhammad (ﷺ) for women in Islam?","id":"tirmidhi-21-50"},{"hadith-eng":"\"We used to say that the participants of Badr on the Day of Badr were like the number of companions of Talut, three hundred and thirteen men.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and others reported it from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1598, Book 21, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Battle of Badr in Islamic history?","id":"tirmidhi-21-51"},{"hadith-eng":"That the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"He said: There is a story with this Hadith[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1599, Book 21, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of giving Khumus from the spoils of war in Islam?","id":"tirmidhi-21-52"},{"hadith-eng":"From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.","reference":"Jami` at-Tirmidhi 1600, Book 21, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of equitable distribution in Islamic teachings during a journey?","id":"tirmidhi-21-53"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever plunders then he is not of us.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a Hadith of Anas.","reference":"Jami` at-Tirmidhi 1601, Book 21, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the stance of Islam on the act of plundering?","id":"tirmidhi-21-54"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one you meets one of them in the path, then force him to its narrow portion.\"[He said:] There are narrations on this topic from Ibn 'Umar, Anas, and Abu Basrah Al-Ghifari the Companion of the Prophet (ﷺ).[Abu 'Eisa said:] This Hadith is Hasan Sahih. And regarding the meaning of this Hadith: \"Do not precede the Jews and the Christians\": Some of the poeple of knowledge said that it only means that it is disliked because it would be honoring them, and the Muslims were ordered to humiliate them. For this reason, when one of them is met on the path, then the path is not yielded for him, because doing so would amount to honoring them.","reference":"Jami` at-Tirmidhi 1602, Book 21, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of not preceding Jews and Christians with Salam in Islamic teachings?","id":"tirmidhi-21-55"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1603, Book 21, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #1","question":"How should Muslims respond when greeted with hostility or ill intentions?","id":"tirmidhi-21-56"},{"hadith-eng":"From Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"","reference":"Jami` at-Tirmidhi 1604, Book 21, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's command regarding Muslims living among idolaters?","id":"tirmidhi-21-57"},{"hadith-eng":"Similar to the narration of Abu Mu'aqiyah (no. 1604) but he did not mention in it: \"from Jarir\" in it, and that is more correct.There is something on this topic from Samurah.[Abu 'Eisa said:] Most of the companions of Isma'il said: \"From Isma'il, from Qais bin Abu Hazim, that the Messenger of Allah (ﷺ) sent a military expedition.\" and they did not mention: \"from Jarir\" in it.Hammad bin Salamah reported similar to the narration of Abu Mu'awiyah, from Al-Hajjaj bin Artah, from Isma'il bin Abi Khalid, from Qais from Jarir[He said:] I heard Muhammad saying: \"What is correct is the narration of Qais from the Prophet (ﷺ) in Mursal form.\"Samurah bin Jundab repoted that the Prophet (ﷺ) said: \"Do not live among the idolaters, and do not assemble with them, for whoever lives among them or assembles with them then he is similar to them.\"","reference":"Jami` at-Tirmidhi 1605, Book 21, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding living among or associating with idolaters?","id":"tirmidhi-21-58"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"","reference":"Jami` at-Tirmidhi 1606, Book 21, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the intention of the Prophet Muhammad (ﷺ) regarding the presence of Jews and Christians in the Arabian Peninsula?","id":"tirmidhi-21-59"},{"hadith-eng":"\"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1607, Book 21, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the stance of the Prophet Muhammad (ﷺ) regarding the presence of non-Muslims in the Arabian Peninsula?","id":"tirmidhi-21-60"},{"hadith-eng":"\"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.The Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.I asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1608, Book 21, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic ruling on inheritance for prophets and their families?","id":"tirmidhi-21-61"},{"hadith-eng":"That Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"","reference":"Jami` at-Tirmidhi 1609, Book 21, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #1","question":"What was Fatimah's reaction to the statement about inheritance from the Prophet?","id":"tirmidhi-21-62"},{"hadith-eng":"\"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.","reference":"Jami` at-Tirmidhi 1610, Book 21, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the statement 'We are not inherited from, what we leave is charity' in Islamic inheritance law?","id":"tirmidhi-21-63"},{"hadith-eng":"\"On the day of the Conquest of Makkah, I heard the Prophet (ﷺ) saying: 'This is not to be battled over after today, until the Day of Judgement.'\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas, Sulaiman bin Surad, and Muti'This Hadith is Hasan Sahih, and it is a narration of Zakariyya bin Abi Za'idah from Ash-Sha'bi, we do not know of it except from his narration.","reference":"Jami` at-Tirmidhi 1611, Book 21, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does the Conquest of Makkah hold in Islamic history?","id":"tirmidhi-21-64"},{"hadith-eng":"\"I fought along with the Prophet (ﷺ), and if Fajr had begun he would wait until the sun rose, and when it rose he would fight. And if it was the middle of the daytime, he would wait until the sun passed the zenit, and when it passed the zenith he would fight until 'Asr. Then he would wait until he prayed 'Asr, then he would fight.\" He said: \"And it is used to be said during that (time) the the wind of victory was raging, and the believers would supplicate for their armies in their Salat.\"[Abu 'Eisa said:] This Hadith has been reported from An-Nu'man bin Muqarrin through a chain that is more connected that this. Qatadah did not see An-Nu'man bin Muqarrin. An-Nu'man died during the Khilafah of 'Umar.","reference":"Jami` at-Tirmidhi 1612, Book 21, Hadith 75","grade":"Da'if(Darussalam)","question #":"question #1","question":"What was the Prophet's (ﷺ) strategy regarding the timing of battles during the day?","id":"tirmidhi-21-65"},{"hadith-eng":"\"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.","reference":"Jami` at-Tirmidhi 1613, Book 21, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of timing in initiating battles according to Islamic teachings?","id":"tirmidhi-21-66"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"At-Tiyarah is from Shirk, and none among us (it influences) except that Allah will remove it with Tawakkul (reliance).\"[Abu 'Eisa said:] I heard Muhammad bin Isma'il saying: \"Sulaiman bin Harb used to say about this Hadith: 'And none among us (it influences) except that Allah will remove it with Tawakkul (reliance)' - Sulaiman would say: 'To me, this is a saying of 'Abdullah bin Mas'ud.'\"There are narrations on this topic from Sa'd, Abu Hurairah, Habis At-Tamimi, 'Aishah and Ibn 'Umar.This Hadith is Hasan Sahih, we do not know of it except as a narration of Salamah bin Khuail. Shu'bah also reported this Hadith from Salamah.","reference":"Jami` at-Tirmidhi 1614, Book 21, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the concept of At-Tiyarah and why is it considered a form of Shirk?","id":"tirmidhi-21-67"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There is no 'Adwa and no Tiyarah, and I like Fa'l.\" They said: \"O Messenger of Allah! What is Fa'l?\" He said: \"A good statement.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1615, Book 21, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of rejecting superstitions like 'Adwa and Tiyarah in Islam?","id":"tirmidhi-21-68"},{"hadith-eng":"That the Prophet (ﷺ) used to like it when he set out upon an affair if he heard: \"O directed one, O successful one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1616, Book 21, Hadith 79","grade":"Da'if(Darussalam)","question #":"question #1","question":"What significance does hearing positive phrases have on the Prophet's actions?","id":"tirmidhi-21-69"},{"hadith-eng":"From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith","reference":"Jami` at-Tirmidhi 1617, Book 21, Hadith 80","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the ethical guidelines for a commander of an army in Islam?","id":"tirmidhi-21-70"},{"hadith-eng":"That the Prophet (ﷺ) would not attack except near the time of Fajr, so if he heard the Adhan he would refrain, and if not, then he would attack. So he listened one day and heard a man saying: \"Allahu Akbar, Allahu Akbar,\" so he said: \"Upon the Fitrah.\" Then he said: \"I bear witness that none has the right to be worshipped but Allah.\" So he said: \"You have departed from the Fire.\"","reference":"Jami` at-Tirmidhi 1618, Book 21, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the timing of an attack have in Islamic military ethics?","id":"tirmidhi-21-71"},{"hadith-eng":"\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"","reference":"Jami` at-Tirmidhi 1548, Book 21, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did Salman Al-Farisi demonstrate leadership and diplomacy in dealing with the Persian castle?","id":"tirmidhi-21-72"},{"hadith-eng":"From his father and he was a Companion who said: \"When the Messenger of Allah (ﷺ) dispatched any army or battalion, he would say to them: 'If you see a Masjid, or hear someone calling the Adhan, then do not kill anyone.'\"","reference":"Jami` at-Tirmidhi 1549, Book 21, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the presence of a Masjid or the call to Adhan influence the conduct of Muslim soldiers in battle?","id":"tirmidhi-21-73"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"","reference":"Jami` at-Tirmidhi 1550, Book 21, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the inhabitants of Khaibar react upon seeing the Prophet Muhammad (ﷺ) and his army?","id":"tirmidhi-21-74"},{"hadith-eng":"\"When the Prophet (ﷺ) overtook a people he would stay at the outskirts of their city for three nights.\"","reference":"Jami` at-Tirmidhi 1551, Book 21, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How long did the Prophet typically stay at the outskirts of a city upon arrival?","id":"tirmidhi-21-75"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) burnt the palm trees of Bani Nadir and cut them down at Al-Buwairah. So Allah revealed: Whatever you cut down of their palm trees, or you left them standing on their trunks, then it was by the permission of Allah, and in the order to disgrace the rebellious.(59:5)\"","reference":"Jami` at-Tirmidhi 1552, Book 21, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Quranic verse relate to the actions taken by the Prophet (ﷺ) regarding the palm trees?","id":"tirmidhi-21-76"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"","reference":"Jami` at-Tirmidhi 1553, Book 21, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the Muslim nation considered unique or honored among other nations in Islam?","id":"tirmidhi-21-77"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"","reference":"Jami` at-Tirmidhi 1554, Book 21, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance did horses have in the distribution of war spoils during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-78"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"This Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.","reference":"Jami` at-Tirmidhi 1555, Book 21, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of the number four hundred in the context of a military unit?","id":"tirmidhi-21-79"},{"hadith-eng":"That Najdah Al-Haruri wrote to Ibn 'Abbas asking if the Messenger of Allah (ﷺ) would fight along with women, and if he would fix a share of the spoils of war for them. Ibn 'Abbas wrote to him: \"You wrote to me asking me if the Messenger of Allah (ﷺ) would fight along with women. He did fight along with them, as they would treat the wounded. They received something from the spoils of war, but as for their share, then he did not fix a share for them.\"There is something on this topic from Anas and Umm 'Atiyyah.This Hadith is Hasan Sahih. This is acted upon according to most of the people of knowledge. It is the view of Sufyan Ath-Thawri and Ash-Shafi'i. Some of them said that a share is given to the woman and the boy, and this is the view of Al-Awza'i.Al-Awza'i said: The Prophet (ﷺ) gave a portion to the boys at Khaibar, and the Aimmah of the Muslims gave a portion to every child born in the land of war.\" Al-Awza'i said: \"The Prophet (ﷺ) gave a portion to the women at Khaibar, and that was followed by the Muslims after him.\" This was narrated to us by 'Ali bin Khashram (who said): \"'Eisa bin Yunus narrated this to us from Al-Awza'i.\"The meaning of his saying: \"They received something from the spoils of war\" it is said that he conferred something on them (the women) from the spoils of war.","reference":"Jami` at-Tirmidhi 1556, Book 21, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How were the spoils of war distributed among participants, including women, during the Prophet's time?","id":"tirmidhi-21-80"},{"hadith-eng":"\"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.","reference":"Jami` at-Tirmidhi 1557, Book 21, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the hadith illustrate the Prophet's (ﷺ) approach to slaves participating in battles?","id":"tirmidhi-21-81"},{"hadith-eng":"That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.","reference":"Jami` at-Tirmidhi 1558, Book 21, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do Islamic teachings view the participation of non-believers in Muslim battles?","id":"tirmidhi-21-82"},{"hadith-eng":"\"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.","reference":"Jami` at-Tirmidhi 1559, Book 21, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the trustworthiness of a narrator important in the transmission of hadith?","id":"tirmidhi-21-83"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.","reference":"Jami` at-Tirmidhi 1560, Book 21, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one purify cooking utensils that have been used by followers of other religions according to Islamic teachings?","id":"tirmidhi-21-84"},{"hadith-eng":"\"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1561, Book 21, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet (ﷺ) allocate spoils of war at different stages of an expedition?","id":"tirmidhi-21-85"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"[Abu 'Eisa said:] There is a story with this Hadith.","reference":"Jami` at-Tirmidhi 1562, Book 21, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address the distribution of spoils of war?","id":"tirmidhi-21-86"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"There is something on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1563, Book 21, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might the Prophet Muhammad (ﷺ) have prohibited the sale of spoils of war prior to their distribution?","id":"tirmidhi-21-87"},{"hadith-eng":"From her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.Al-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"","reference":"Jami` at-Tirmidhi 1564, Book 21, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to wait until a pregnant woman delivers before engaging in intercourse with her?","id":"tirmidhi-21-88"},{"hadith-eng":"From his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"[Abu 'Eisa said:] This Hadith is Hasan","reference":"Jami` at-Tirmidhi 1565, Book 21, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should Muslims approach doubts related to the permissibility of food?","id":"tirmidhi-21-89"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"Whoever separates between a mother and her child, then Allah will separate between him and his beloved on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Gharib.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike separating the captives, the mother and her child, the son and the father, and brothers.","reference":"Jami` at-Tirmidhi 1566, Book 21, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the separation of family members, such as parents and children or siblings?","id":"tirmidhi-21-90"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.","reference":"Jami` at-Tirmidhi 1567, Book 21, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #2","question":"What was the role of Jibra'il in conveying messages to the Prophet Muhammad (ﷺ) during the Battle of Badr?","id":"tirmidhi-21-91"},{"hadith-eng":"That the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.[Abu 'Eisa said:] This Hadith is Hasan Sahih.The paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)This is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.Al-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"Ishaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"","reference":"Jami` at-Tirmidhi 1568, Book 21, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do scholars view the preference between killing and ransoming captives?","id":"tirmidhi-21-92"},{"hadith-eng":"That a woman was found killed in one of the expeditions of the Messenger of Allah (ﷺ), so the Messenger of Allah (ﷺ) rebuked that, and he prohibited killing women and children.There are narrations on this topic from Buraidah and Rabah - and they say he was Riyah - bin Ar-Rabi', Al-Aswad bin Sari', Ibn 'Abbas, and As-Sa'b bin Jaththamah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They disliked killing women and children. This is the view of Sufyan Ath-Thawri and Ash-Shafi'i.Some of the people of knowledge made an exception for killing the women who had children with them during night attacks, this is the view of Ahmad and Ishaq, they permitted it in night attacks.","reference":"Jami` at-Tirmidhi 1569, Book 21, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) and later scholars view the prohibition of killing women and children in warfare?","id":"tirmidhi-21-93"},{"hadith-eng":"\"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1570, Book 21, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic jurisprudence address the issue of unintended harm to women and children in conflict?","id":"tirmidhi-21-94"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) sent us with an army and said: 'If you see so-and-so, and so-and-so' referring to two men from the Quraish: 'then burn them with fire.' Then, upon our departure, the Messenger of Allah (ﷺ) said: 'I ordered you to burn so-and-so, and so-and-so with fire, and indeed, none punishes with fire except Allah. So if you see them, then kill them.'\"There are narrations on this topic from Ibn 'Abbas and Hamzah bin 'Amr Al-Aslami.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. In this Hadith, Muhammad bin Ishaq mentioned a man (narrating) between Sulaiman bin Yasar and Abu Hurairah. Others reported this Hadith the same as Al-Laith reported it(here, without a man between them). The narration of Al-Laith bin Sa'd is more appropriate and more correct.","reference":"Jami` at-Tirmidhi 1571, Book 21, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to understand who has the authority to punish with fire in Islamic teachings?","id":"tirmidhi-21-95"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"There are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-JuhniFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers","reference":"Jami` at-Tirmidhi 1572, Book 21, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is pride viewed in Islam and what are its consequences?","id":"tirmidhi-21-96"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever's soul departs from his body while he is free of three: Kanz (buried treasure), Ghulul, and debt, then he will enter paradise.\"This is how Sa'eed narrated it: \"Kanz\" while Abu 'Awanah said in his narration: \"Kibr\" and he did not mention \"from Ma'dan\" in it. But the narration of Sa'eed is more correct.","reference":"Jami` at-Tirmidhi 1573, Book 21, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does being free from debt influence one's spiritual state at the time of death?","id":"tirmidhi-21-97"},{"hadith-eng":"\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1574, Book 21, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of martyrdom relate to one's actions and intentions in Islam?","id":"tirmidhi-21-98"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1575, Book 21, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Ansar women contribute to the efforts of the Muslim army during battles?","id":"tirmidhi-21-99"},{"hadith-eng":"From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.","reference":"Jami` at-Tirmidhi 1576, Book 21, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to gifts from foreign leaders?","id":"tirmidhi-21-100"},{"hadith-eng":"That he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.It has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.And the implication is that this was after he used to accept from them, and then he later forbade their gifts.","reference":"Jami` at-Tirmidhi 1577, Book 21, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might the Prophet Muhammad (ﷺ) have initially accepted gifts from idolaters and later prohibited them?","id":"tirmidhi-21-101"},{"hadith-eng":"\"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.This is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1578, Book 21, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #2","question":"How do scholars view the practice of prostration of gratitude?","id":"tirmidhi-21-102"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1579, Book 21, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should assurances of protection given by women be treated within the Muslim community?","id":"tirmidhi-21-103"},{"hadith-eng":"\"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1580, Book 21, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should Muslims approach agreements with non-Muslim entities according to Islamic teachings?","id":"tirmidhi-21-104"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. \nI asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"","reference":"Jami` at-Tirmidhi 1581, Book 21, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does betrayal impact a person's standing on the Day of Judgement according to Islamic teachings?","id":"tirmidhi-21-105"},{"hadith-eng":"\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1582, Book 21, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) attempt to treat Sa'd bin Mu'adh's injury during the battle of Al-Ahzab?","id":"tirmidhi-21-106"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Kill the elder men among the idolaters and spare the Sharkh amont them.\"And the Sharkh are the boys who did not begin to grow pubic hair.[Abu 'Eisa said:] This Hadith is Hasan Sahih.Hajjaj bin Artah narrated similarly from Qatadah.","reference":"Jami` at-Tirmidhi 1583, Book 21, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic jurisprudence address the treatment of non-combatants during warfare?","id":"tirmidhi-21-107"},{"hadith-eng":"\"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.","reference":"Jami` at-Tirmidhi 1584, Book 21, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #2","question":"How was the presence of pubic hair used as an indicator in Islamic jurisprudence?","id":"tirmidhi-21-108"},{"hadith-eng":"From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1585, Book 21, Hadith 47","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the allegiances sworn during the period of Jahiliyyah?","id":"tirmidhi-21-109"},{"hadith-eng":"\"I was a scribe for Jaz' bin Mu'awiyah at Manadhir when 'Umar's letter came to us (saying): 'Inspect the Zoroastrians around you to take the Jizyah from them. For indeed 'Abdur-Rahman bin 'Awf informed me that the Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Hajar.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1586, Book 21, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who were the Zoroastrians and what was their relationship with early Islamic states?","id":"tirmidhi-21-110"},{"hadith-eng":"That 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"There is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1587, Book 21, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the practice of collecting Jizyah from non-Muslims evolve during the time of the Prophet and his companions?","id":"tirmidhi-21-111"},{"hadith-eng":"From Az-Zuhri, that Sa'ib bin Yazid said: \"The Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Bahrain, and 'Umar took it in Persia, and 'Uthman took it from the Persians.\"I asked Muhammad about this, so he said: \"It is: 'Malik from Az-Zuhri from the Prophet (ﷺ).'\"","reference":"Jami` at-Tirmidhi 1588, Book 21, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the practice of collecting Jizyah differ among the early caliphs?","id":"tirmidhi-21-112"},{"hadith-eng":"\"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.This Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.","reference":"Jami` at-Tirmidhi 1589, Book 21, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one respond if they are denied their rights or hospitality while traveling?","id":"tirmidhi-21-113"},{"hadith-eng":"That on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.","reference":"Jami` at-Tirmidhi 1590, Book 21, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of Jihad relate to intention according to Islamic teachings?","id":"tirmidhi-21-114"},{"hadith-eng":"From Abu Salamah, from Jabir bin Abdullah about the statement of Allah, most High: Allah was pleased with the believers when they gave the pledge to you under the tree (48:18). that Jabir said: \"We pledged to the Messenger of Allah (ﷺ) that we would not flee, and we did not pledge to him for death.\"[He said:] There are narration on this topic from Salamah bin Al-Akwa', Ibn 'Umar, 'Ubadah, and Jarir bin 'Abdullah.[Abu 'Eisa said:] This Hadith is been reported from 'Eisa bin Yunus, from Al-Awza'i, from Yahya bin Abi Kathir who said: \"Jabir bin 'Abdullah said\" and he did not mention Abu Salamah on it.","reference":"Jami` at-Tirmidhi 1591, Book 21, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who were some of the companions mentioned in relation to the pledge under the tree?","id":"tirmidhi-21-115"},{"hadith-eng":"\"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1592, Book 21, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #2","question":"What does pledging for death signify in the context of early Islamic history?","id":"tirmidhi-21-116"},{"hadith-eng":"\"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1593, Book 21, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of obedience relate to Islamic teachings?","id":"tirmidhi-21-117"},{"hadith-eng":"\"We did not pledge to the Messenger of Allah (ﷺ) for death, but only that we would not flee.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, meaning both of the Ahadith are Sahih. Some of his Companions pledged to him for death, they said only: \"We will not leave from in front of you as long as we are not killed.\" While others pledged him by saying: \"We will not flee.\"","reference":"Jami` at-Tirmidhi 1594, Book 21, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) demonstrate their commitment during battles?","id":"tirmidhi-21-118"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Three will not be spoken to by Allah on the Day of Judgement, nor will they be purified, and for them is a painful torment: A man that gave a pledge to an Imam, and if he gives to him he fulfills it, and if he does not give to him he does not fulfill not fulfill it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1595, Book 21, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of fulfilling pledges in Islam, especially when given to a leader or Imam?","id":"tirmidhi-21-119"},{"hadith-eng":"\"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came, and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. After this he (ﷺ) would not take the pledge from anyone until he asked him if he was a slave.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Jabir is Hasan Gharib Sahih, we do not know of it except as a narration of Abu Az-Zubair.","reference":"Jami` at-Tirmidhi 1596, Book 21, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet (ﷺ) handle the situation when he realized a pledge-giver was a slave?","id":"tirmidhi-21-120"},{"hadith-eng":"\"I pledged to the Messenger of Allah (ﷺ) along with some women. He said to us: 'In as much as you are able and capable.' I said: 'Allah and His Messenger are more merciful to us than we are to ourselves,' then I said: 'O Messenger of Allah take the pledge from us.'\" - Sufyan (one of the narrators) said: meaning: 'shake (hands) on it with us' - \"so the Messenger of Allah (ﷺ) said: 'My statement to one hundred women is like my statement to one.'\"[He said:] There are narrations on this topic from 'Aishah, from 'Abdullah bin 'Umar, and Asma' bint Yazid.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of Muhammad bin Al-Munkadir.Sufyan Ath-Thawri, Malik bin Anas, and others reported this Hadith from Muhammad bin Al-Munkadir similarly. He said: I asked Muhammad about this Hadith and he said: \"I am not aware of a Hadith other than this from Umaimah bint Ruqaiqah.\" There is another woman named Umaimah who narrated from the Messenger of Allah (ﷺ).","reference":"Jami` at-Tirmidhi 1597, Book 21, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of mercy from Allah and His Messenger compare to self-mercy in Islamic teachings?","id":"tirmidhi-21-121"},{"hadith-eng":"\"We used to say that the participants of Badr on the Day of Badr were like the number of companions of Talut, three hundred and thirteen men.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and others reported it from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1598, Book 21, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many participants were involved in the Battle of Badr according to historical accounts?","id":"tirmidhi-21-122"},{"hadith-eng":"That the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"He said: There is a story with this Hadith[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1599, Book 21, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was the delegation from 'Abdul-Qais and what was their interaction with the Prophet (ﷺ)?","id":"tirmidhi-21-123"},{"hadith-eng":"From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.","reference":"Jami` at-Tirmidhi 1600, Book 21, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate leadership and fairness in resource management?","id":"tirmidhi-21-124"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever plunders then he is not of us.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a Hadith of Anas.","reference":"Jami` at-Tirmidhi 1601, Book 21, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the behavior of plundering affect one's association with the Muslim community?","id":"tirmidhi-21-125"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one you meets one of them in the path, then force him to its narrow portion.\"[He said:] There are narrations on this topic from Ibn 'Umar, Anas, and Abu Basrah Al-Ghifari the Companion of the Prophet (ﷺ).[Abu 'Eisa said:] This Hadith is Hasan Sahih. And regarding the meaning of this Hadith: \"Do not precede the Jews and the Christians\": Some of the poeple of knowledge said that it only means that it is disliked because it would be honoring them, and the Muslims were ordered to humiliate them. For this reason, when one of them is met on the path, then the path is not yielded for him, because doing so would amount to honoring them.","reference":"Jami` at-Tirmidhi 1602, Book 21, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should Muslims interact with Jews and Christians when encountering them on a path according to this narration?","id":"tirmidhi-21-126"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1603, Book 21, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of responding with 'Alaik' when greeted by someone with negative intentions?","id":"tirmidhi-21-127"},{"hadith-eng":"From Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"","reference":"Jami` at-Tirmidhi 1604, Book 21, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why did the Prophet (ﷺ) command that half of the blood money be given in this situation?","id":"tirmidhi-21-128"},{"hadith-eng":"Similar to the narration of Abu Mu'aqiyah (no. 1604) but he did not mention in it: \"from Jarir\" in it, and that is more correct.There is something on this topic from Samurah.[Abu 'Eisa said:] Most of the companions of Isma'il said: \"From Isma'il, from Qais bin Abu Hazim, that the Messenger of Allah (ﷺ) sent a military expedition.\" and they did not mention: \"from Jarir\" in it.Hammad bin Salamah reported similar to the narration of Abu Mu'awiyah, from Al-Hajjaj bin Artah, from Isma'il bin Abi Khalid, from Qais from Jarir[He said:] I heard Muhammad saying: \"What is correct is the narration of Qais from the Prophet (ﷺ) in Mursal form.\"Samurah bin Jundab repoted that the Prophet (ﷺ) said: \"Do not live among the idolaters, and do not assemble with them, for whoever lives among them or assembles with them then he is similar to them.\"","reference":"Jami` at-Tirmidhi 1605, Book 21, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the presence of idolaters influence a Muslim's faith and actions according to Islamic teachings?","id":"tirmidhi-21-129"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"","reference":"Jami` at-Tirmidhi 1606, Book 21, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the will of Allah influence the actions and decisions of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-130"},{"hadith-eng":"\"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1607, Book 21, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who narrated the hadith about expelling Jews and Christians from the Arabian Peninsula?","id":"tirmidhi-21-131"},{"hadith-eng":"\"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.The Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.I asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1608, Book 21, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did Abu Bakr respond to Fatimah's inquiry about inheritance?","id":"tirmidhi-21-132"},{"hadith-eng":"That Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"","reference":"Jami` at-Tirmidhi 1609, Book 21, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did Abu Bakr and 'Umar justify their stance on the inheritance issue?","id":"tirmidhi-21-133"},{"hadith-eng":"\"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.","reference":"Jami` at-Tirmidhi 1610, Book 21, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Abu Bakr respond to the request for inheritance from the family of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-134"},{"hadith-eng":"\"On the day of the Conquest of Makkah, I heard the Prophet (ﷺ) saying: 'This is not to be battled over after today, until the Day of Judgement.'\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas, Sulaiman bin Surad, and Muti'This Hadith is Hasan Sahih, and it is a narration of Zakariyya bin Abi Za'idah from Ash-Sha'bi, we do not know of it except from his narration.","reference":"Jami` at-Tirmidhi 1611, Book 21, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the implication of the statement that Makkah is not to be battled over after its conquest?","id":"tirmidhi-21-135"},{"hadith-eng":"\"I fought along with the Prophet (ﷺ), and if Fajr had begun he would wait until the sun rose, and when it rose he would fight. And if it was the middle of the daytime, he would wait until the sun passed the zenit, and when it passed the zenith he would fight until 'Asr. Then he would wait until he prayed 'Asr, then he would fight.\" He said: \"And it is used to be said during that (time) the the wind of victory was raging, and the believers would supplicate for their armies in their Salat.\"[Abu 'Eisa said:] This Hadith has been reported from An-Nu'man bin Muqarrin through a chain that is more connected that this. Qatadah did not see An-Nu'man bin Muqarrin. An-Nu'man died during the Khilafah of 'Umar.","reference":"Jami` at-Tirmidhi 1612, Book 21, Hadith 75","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the believers support their armies during battles according to Islamic teachings?","id":"tirmidhi-21-136"},{"hadith-eng":"\"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.","reference":"Jami` at-Tirmidhi 1613, Book 21, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of divine assistance manifest in battles as per Islamic tradition?","id":"tirmidhi-21-137"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"At-Tiyarah is from Shirk, and none among us (it influences) except that Allah will remove it with Tawakkul (reliance).\"[Abu 'Eisa said:] I heard Muhammad bin Isma'il saying: \"Sulaiman bin Harb used to say about this Hadith: 'And none among us (it influences) except that Allah will remove it with Tawakkul (reliance)' - Sulaiman would say: 'To me, this is a saying of 'Abdullah bin Mas'ud.'\"There are narrations on this topic from Sa'd, Abu Hurairah, Habis At-Tamimi, 'Aishah and Ibn 'Umar.This Hadith is Hasan Sahih, we do not know of it except as a narration of Salamah bin Khuail. Shu'bah also reported this Hadith from Salamah.","reference":"Jami` at-Tirmidhi 1614, Book 21, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can reliance on Allah (Tawakkul) help in overcoming superstitious beliefs?","id":"tirmidhi-21-138"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There is no 'Adwa and no Tiyarah, and I like Fa'l.\" They said: \"O Messenger of Allah! What is Fa'l?\" He said: \"A good statement.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1615, Book 21, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the concept of Fa'l or positive expectations?","id":"tirmidhi-21-139"},{"hadith-eng":"That the Prophet (ﷺ) used to like it when he set out upon an affair if he heard: \"O directed one, O successful one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1616, Book 21, Hadith 79","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet respond to hearing encouraging words before undertaking a task?","id":"tirmidhi-21-140"},{"hadith-eng":"From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith","reference":"Jami` at-Tirmidhi 1617, Book 21, Hadith 80","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should Muslims treat prisoners of war and spoils of war according to Islamic teachings?","id":"tirmidhi-21-141"},{"hadith-eng":"That the Prophet (ﷺ) would not attack except near the time of Fajr, so if he heard the Adhan he would refrain, and if not, then he would attack. So he listened one day and heard a man saying: \"Allahu Akbar, Allahu Akbar,\" so he said: \"Upon the Fitrah.\" Then he said: \"I bear witness that none has the right to be worshipped but Allah.\" So he said: \"You have departed from the Fire.\"","reference":"Jami` at-Tirmidhi 1618, Book 21, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Adhan influence the decision-making process in a military context?","id":"tirmidhi-21-142"},{"hadith-eng":"\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"","reference":"Jami` at-Tirmidhi 1548, Book 21, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #3","question":"What options were given to the Persians by Salman Al-Farisi during the siege?","id":"tirmidhi-21-143"},{"hadith-eng":"From his father and he was a Companion who said: \"When the Messenger of Allah (ﷺ) dispatched any army or battalion, he would say to them: 'If you see a Masjid, or hear someone calling the Adhan, then do not kill anyone.'\"","reference":"Jami` at-Tirmidhi 1549, Book 21, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #3","question":"What significance does the call to Adhan hold in the context of military engagement according to Islamic teachings?","id":"tirmidhi-21-144"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"","reference":"Jami` at-Tirmidhi 1550, Book 21, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance does the phrase 'Allahu Akbar' hold in the context of this event?","id":"tirmidhi-21-145"},{"hadith-eng":"\"When the Prophet (ﷺ) overtook a people he would stay at the outskirts of their city for three nights.\"","reference":"Jami` at-Tirmidhi 1551, Book 21, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What might be the reasons for the Prophet staying at the outskirts of a city for a few days?","id":"tirmidhi-21-146"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) burnt the palm trees of Bani Nadir and cut them down at Al-Buwairah. So Allah revealed: Whatever you cut down of their palm trees, or you left them standing on their trunks, then it was by the permission of Allah, and in the order to disgrace the rebellious.(59:5)\"","reference":"Jami` at-Tirmidhi 1552, Book 21, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this event teach about the concept of divine permission in Islamic actions?","id":"tirmidhi-21-147"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"","reference":"Jami` at-Tirmidhi 1553, Book 21, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the spoils of war being made lawful in Islam?","id":"tirmidhi-21-148"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"","reference":"Jami` at-Tirmidhi 1554, Book 21, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) ensure fairness in the allocation of war spoils?","id":"tirmidhi-21-149"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"This Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.","reference":"Jami` at-Tirmidhi 1555, Book 21, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the number twelve thousand relate to the strength of an army in Islamic tradition?","id":"tirmidhi-21-150"},{"hadith-eng":"That Najdah Al-Haruri wrote to Ibn 'Abbas asking if the Messenger of Allah (ﷺ) would fight along with women, and if he would fix a share of the spoils of war for them. Ibn 'Abbas wrote to him: \"You wrote to me asking me if the Messenger of Allah (ﷺ) would fight along with women. He did fight along with them, as they would treat the wounded. They received something from the spoils of war, but as for their share, then he did not fix a share for them.\"There is something on this topic from Anas and Umm 'Atiyyah.This Hadith is Hasan Sahih. This is acted upon according to most of the people of knowledge. It is the view of Sufyan Ath-Thawri and Ash-Shafi'i. Some of them said that a share is given to the woman and the boy, and this is the view of Al-Awza'i.Al-Awza'i said: The Prophet (ﷺ) gave a portion to the boys at Khaibar, and the Aimmah of the Muslims gave a portion to every child born in the land of war.\" Al-Awza'i said: \"The Prophet (ﷺ) gave a portion to the women at Khaibar, and that was followed by the Muslims after him.\" This was narrated to us by 'Ali bin Khashram (who said): \"'Eisa bin Yunus narrated this to us from Al-Awza'i.\"The meaning of his saying: \"They received something from the spoils of war\" it is said that he conferred something on them (the women) from the spoils of war.","reference":"Jami` at-Tirmidhi 1556, Book 21, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of treating the wounded in Islamic battles?","id":"tirmidhi-21-151"},{"hadith-eng":"\"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.","reference":"Jami` at-Tirmidhi 1557, Book 21, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does the hadith provide regarding the practice of Ruqyah?","id":"tirmidhi-21-152"},{"hadith-eng":"That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.","reference":"Jami` at-Tirmidhi 1558, Book 21, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the differing opinions among scholars regarding the distribution of war spoils to non-Muslims who fight alongside Muslims?","id":"tirmidhi-21-153"},{"hadith-eng":"\"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.","reference":"Jami` at-Tirmidhi 1559, Book 21, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the views of scholars regarding the distribution of shares to those who join the Muslims before the battle?","id":"tirmidhi-21-154"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.","reference":"Jami` at-Tirmidhi 1560, Book 21, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic ruling on using utensils that have been in contact with impure substances?","id":"tirmidhi-21-155"},{"hadith-eng":"\"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1561, Book 21, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different narrations regarding the distribution of spoils of war by the Prophet (ﷺ)?","id":"tirmidhi-21-156"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"[Abu 'Eisa said:] There is a story with this Hadith.","reference":"Jami` at-Tirmidhi 1562, Book 21, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of providing proof in claiming the possessions of a defeated enemy in battle?","id":"tirmidhi-21-157"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"There is something on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1563, Book 21, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the potential consequences of selling spoils of war before distribution according to Islamic principles?","id":"tirmidhi-21-158"},{"hadith-eng":"From her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.Al-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"","reference":"Jami` at-Tirmidhi 1564, Book 21, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What did 'Umar bin Al-Khattab advise regarding pregnant captives?","id":"tirmidhi-21-159"},{"hadith-eng":"From his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"[Abu 'Eisa said:] This Hadith is Hasan","reference":"Jami` at-Tirmidhi 1565, Book 21, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of avoiding uneasiness in one's heart concerning food consumption?","id":"tirmidhi-21-160"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"Whoever separates between a mother and her child, then Allah will separate between him and his beloved on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Gharib.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike separating the captives, the mother and her child, the son and the father, and brothers.","reference":"Jami` at-Tirmidhi 1566, Book 21, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of maintaining family unity in Islam?","id":"tirmidhi-21-161"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.","reference":"Jami` at-Tirmidhi 1567, Book 21, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #3","question":"What were the potential consequences of choosing to ransom the captives of Badr?","id":"tirmidhi-21-162"},{"hadith-eng":"That the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.[Abu 'Eisa said:] This Hadith is Hasan Sahih.The paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)This is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.Al-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"Ishaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"","reference":"Jami` at-Tirmidhi 1568, Book 21, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the abrogation of certain Quranic verses related to captives?","id":"tirmidhi-21-163"},{"hadith-eng":"That a woman was found killed in one of the expeditions of the Messenger of Allah (ﷺ), so the Messenger of Allah (ﷺ) rebuked that, and he prohibited killing women and children.There are narrations on this topic from Buraidah and Rabah - and they say he was Riyah - bin Ar-Rabi', Al-Aswad bin Sari', Ibn 'Abbas, and As-Sa'b bin Jaththamah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They disliked killing women and children. This is the view of Sufyan Ath-Thawri and Ash-Shafi'i.Some of the people of knowledge made an exception for killing the women who had children with them during night attacks, this is the view of Ahmad and Ishaq, they permitted it in night attacks.","reference":"Jami` at-Tirmidhi 1569, Book 21, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What exceptions, if any, were made by some scholars regarding the killing of women during night attacks?","id":"tirmidhi-21-164"},{"hadith-eng":"\"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1570, Book 21, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does Islam provide regarding the treatment of families of idolaters during battles?","id":"tirmidhi-21-165"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) sent us with an army and said: 'If you see so-and-so, and so-and-so' referring to two men from the Quraish: 'then burn them with fire.' Then, upon our departure, the Messenger of Allah (ﷺ) said: 'I ordered you to burn so-and-so, and so-and-so with fire, and indeed, none punishes with fire except Allah. So if you see them, then kill them.'\"There are narrations on this topic from Ibn 'Abbas and Hamzah bin 'Amr Al-Aslami.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. In this Hadith, Muhammad bin Ishaq mentioned a man (narrating) between Sulaiman bin Yasar and Abu Hurairah. Others reported this Hadith the same as Al-Laith reported it(here, without a man between them). The narration of Al-Laith bin Sa'd is more appropriate and more correct.","reference":"Jami` at-Tirmidhi 1571, Book 21, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this narration illustrate the concept of divine authority in administering punishment?","id":"tirmidhi-21-166"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"There are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-JuhniFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers","reference":"Jami` at-Tirmidhi 1572, Book 21, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of being free from debt in relation to entering paradise?","id":"tirmidhi-21-167"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever's soul departs from his body while he is free of three: Kanz (buried treasure), Ghulul, and debt, then he will enter paradise.\"This is how Sa'eed narrated it: \"Kanz\" while Abu 'Awanah said in his narration: \"Kibr\" and he did not mention \"from Ma'dan\" in it. But the narration of Sa'eed is more correct.","reference":"Jami` at-Tirmidhi 1573, Book 21, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of avoiding buried treasure and its implications in Islam?","id":"tirmidhi-21-168"},{"hadith-eng":"\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1574, Book 21, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of pilfering from the spoils of war in Islamic teachings?","id":"tirmidhi-21-169"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1575, Book 21, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What responsibilities did women like Umm Sulaim undertake during military expeditions in early Islamic history?","id":"tirmidhi-21-170"},{"hadith-eng":"From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.","reference":"Jami` at-Tirmidhi 1576, Book 21, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the relationship between the Prophet (ﷺ) and political leaders from this narration?","id":"tirmidhi-21-171"},{"hadith-eng":"That he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.It has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.And the implication is that this was after he used to accept from them, and then he later forbade their gifts.","reference":"Jami` at-Tirmidhi 1577, Book 21, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the acceptance or rejection of gifts relate to the acceptance of Islam?","id":"tirmidhi-21-172"},{"hadith-eng":"\"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.This is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1578, Book 21, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions did the Prophet (ﷺ) take when he was met with a happy event?","id":"tirmidhi-21-173"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1579, Book 21, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #3","question":"What does this narration imply about the role of women in providing protection?","id":"tirmidhi-21-174"},{"hadith-eng":"\"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1580, Book 21, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of violating a treaty in Islamic jurisprudence?","id":"tirmidhi-21-175"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. \nI asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"","reference":"Jami` at-Tirmidhi 1581, Book 21, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of betrayal in the afterlife as described in Islamic tradition?","id":"tirmidhi-21-176"},{"hadith-eng":"\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1582, Book 21, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the outcome of Sa'd bin Mu'adh's judgment regarding Banu Quraizah?","id":"tirmidhi-21-177"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Kill the elder men among the idolaters and spare the Sharkh amont them.\"And the Sharkh are the boys who did not begin to grow pubic hair.[Abu 'Eisa said:] This Hadith is Hasan Sahih.Hajjaj bin Artah narrated similarly from Qatadah.","reference":"Jami` at-Tirmidhi 1583, Book 21, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #3","question":"What criteria are used in Islamic law to determine who is considered a combatant?","id":"tirmidhi-21-178"},{"hadith-eng":"\"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.","reference":"Jami` at-Tirmidhi 1584, Book 21, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the views of scholars like Ahmad and Ishaq regarding the signs of reaching the age of responsibility?","id":"tirmidhi-21-179"},{"hadith-eng":"From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1585, Book 21, Hadith 47","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why is it discouraged to initiate new allegiances in Islam?","id":"tirmidhi-21-180"},{"hadith-eng":"\"I was a scribe for Jaz' bin Mu'awiyah at Manadhir when 'Umar's letter came to us (saying): 'Inspect the Zoroastrians around you to take the Jizyah from them. For indeed 'Abdur-Rahman bin 'Awf informed me that the Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Hajar.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1586, Book 21, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did scribes play in the administration of early Islamic governance?","id":"tirmidhi-21-181"},{"hadith-eng":"That 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"There is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1587, Book 21, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did 'Abdur-Rahman bin 'Awf play in influencing 'Umar's decision regarding the Zoroastrians?","id":"tirmidhi-21-182"},{"hadith-eng":"From Az-Zuhri, that Sa'ib bin Yazid said: \"The Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Bahrain, and 'Umar took it in Persia, and 'Uthman took it from the Persians.\"I asked Muhammad about this, so he said: \"It is: 'Malik from Az-Zuhri from the Prophet (ﷺ).'\"","reference":"Jami` at-Tirmidhi 1588, Book 21, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role did the Zoroastrians play in the early Islamic state?","id":"tirmidhi-21-183"},{"hadith-eng":"\"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.This Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.","reference":"Jami` at-Tirmidhi 1589, Book 21, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #3","question":"What circumstances might justify taking something by force according to Islamic teachings?","id":"tirmidhi-21-184"},{"hadith-eng":"That on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.","reference":"Jami` at-Tirmidhi 1590, Book 21, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions are encouraged when Muslims are called to participate in a battle?","id":"tirmidhi-21-185"},{"hadith-eng":"From Abu Salamah, from Jabir bin Abdullah about the statement of Allah, most High: Allah was pleased with the believers when they gave the pledge to you under the tree (48:18). that Jabir said: \"We pledged to the Messenger of Allah (ﷺ) that we would not flee, and we did not pledge to him for death.\"[He said:] There are narration on this topic from Salamah bin Al-Akwa', Ibn 'Umar, 'Ubadah, and Jarir bin 'Abdullah.[Abu 'Eisa said:] This Hadith is been reported from 'Eisa bin Yunus, from Al-Awza'i, from Yahya bin Abi Kathir who said: \"Jabir bin 'Abdullah said\" and he did not mention Abu Salamah on it.","reference":"Jami` at-Tirmidhi 1591, Book 21, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the pledge under the tree reveal about the commitment of the companions to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-186"},{"hadith-eng":"\"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1592, Book 21, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the companions demonstrate their loyalty and commitment to the Prophet Muhammad (ﷺ) during critical events?","id":"tirmidhi-21-187"},{"hadith-eng":"\"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1593, Book 21, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does it mean to obey as much as one is able in the context of Islamic obligations?","id":"tirmidhi-21-188"},{"hadith-eng":"\"We did not pledge to the Messenger of Allah (ﷺ) for death, but only that we would not flee.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, meaning both of the Ahadith are Sahih. Some of his Companions pledged to him for death, they said only: \"We will not leave from in front of you as long as we are not killed.\" While others pledged him by saying: \"We will not flee.\"","reference":"Jami` at-Tirmidhi 1594, Book 21, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different forms of pledges made by the companions to the Prophet (ﷺ)?","id":"tirmidhi-21-189"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Three will not be spoken to by Allah on the Day of Judgement, nor will they be purified, and for them is a painful torment: A man that gave a pledge to an Imam, and if he gives to him he fulfills it, and if he does not give to him he does not fulfill not fulfill it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1595, Book 21, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the failure to fulfill a pledge impact one's standing on the Day of Judgement?","id":"tirmidhi-21-190"},{"hadith-eng":"\"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came, and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. After this he (ﷺ) would not take the pledge from anyone until he asked him if he was a slave.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Jabir is Hasan Gharib Sahih, we do not know of it except as a narration of Abu Az-Zubair.","reference":"Jami` at-Tirmidhi 1596, Book 21, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration indicate about the Prophet's (ﷺ) approach to fairness and justice in transactions?","id":"tirmidhi-21-191"},{"hadith-eng":"\"I pledged to the Messenger of Allah (ﷺ) along with some women. He said to us: 'In as much as you are able and capable.' I said: 'Allah and His Messenger are more merciful to us than we are to ourselves,' then I said: 'O Messenger of Allah take the pledge from us.'\" - Sufyan (one of the narrators) said: meaning: 'shake (hands) on it with us' - \"so the Messenger of Allah (ﷺ) said: 'My statement to one hundred women is like my statement to one.'\"[He said:] There are narrations on this topic from 'Aishah, from 'Abdullah bin 'Umar, and Asma' bint Yazid.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of Muhammad bin Al-Munkadir.Sufyan Ath-Thawri, Malik bin Anas, and others reported this Hadith from Muhammad bin Al-Munkadir similarly. He said: I asked Muhammad about this Hadith and he said: \"I am not aware of a Hadith other than this from Umaimah bint Ruqaiqah.\" There is another woman named Umaimah who narrated from the Messenger of Allah (ﷺ).","reference":"Jami` at-Tirmidhi 1597, Book 21, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the phrase 'In as much as you are able and capable' imply about the expectations of religious obligations in Islam?","id":"tirmidhi-21-192"},{"hadith-eng":"\"We used to say that the participants of Badr on the Day of Badr were like the number of companions of Talut, three hundred and thirteen men.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and others reported it from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1598, Book 21, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #3","question":"Who was Talut and what is his relevance to the number of participants in the Battle of Badr?","id":"tirmidhi-21-193"},{"hadith-eng":"That the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"He said: There is a story with this Hadith[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1599, Book 21, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is the classification of a hadith as Hasan Sahih determined?","id":"tirmidhi-21-194"},{"hadith-eng":"From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.","reference":"Jami` at-Tirmidhi 1600, Book 21, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the value of patience and order from the actions of the hasty people in this narration?","id":"tirmidhi-21-195"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever plunders then he is not of us.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a Hadith of Anas.","reference":"Jami` at-Tirmidhi 1601, Book 21, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences mentioned for those who engage in plundering?","id":"tirmidhi-21-196"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one you meets one of them in the path, then force him to its narrow portion.\"[He said:] There are narrations on this topic from Ibn 'Umar, Anas, and Abu Basrah Al-Ghifari the Companion of the Prophet (ﷺ).[Abu 'Eisa said:] This Hadith is Hasan Sahih. And regarding the meaning of this Hadith: \"Do not precede the Jews and the Christians\": Some of the poeple of knowledge said that it only means that it is disliked because it would be honoring them, and the Muslims were ordered to humiliate them. For this reason, when one of them is met on the path, then the path is not yielded for him, because doing so would amount to honoring them.","reference":"Jami` at-Tirmidhi 1602, Book 21, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reasoning behind the instruction to not yield the path to Jews and Christians?","id":"tirmidhi-21-197"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1603, Book 21, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this teaching reflect the Prophet's guidance on dealing with people of other faiths?","id":"tirmidhi-21-198"},{"hadith-eng":"From Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"","reference":"Jami` at-Tirmidhi 1604, Book 21, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the phrase 'They should not see each other's campfires' imply about the relationship between Muslims and idolaters?","id":"tirmidhi-21-199"},{"hadith-eng":"Similar to the narration of Abu Mu'aqiyah (no. 1604) but he did not mention in it: \"from Jarir\" in it, and that is more correct.There is something on this topic from Samurah.[Abu 'Eisa said:] Most of the companions of Isma'il said: \"From Isma'il, from Qais bin Abu Hazim, that the Messenger of Allah (ﷺ) sent a military expedition.\" and they did not mention: \"from Jarir\" in it.Hammad bin Salamah reported similar to the narration of Abu Mu'awiyah, from Al-Hajjaj bin Artah, from Isma'il bin Abi Khalid, from Qais from Jarir[He said:] I heard Muhammad saying: \"What is correct is the narration of Qais from the Prophet (ﷺ) in Mursal form.\"Samurah bin Jundab repoted that the Prophet (ﷺ) said: \"Do not live among the idolaters, and do not assemble with them, for whoever lives among them or assembles with them then he is similar to them.\"","reference":"Jami` at-Tirmidhi 1605, Book 21, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the potential consequences of living among or assembling with idolaters in Islam?","id":"tirmidhi-21-200"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"","reference":"Jami` at-Tirmidhi 1606, Book 21, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #3","question":"What historical context might explain the Prophet's statement about expelling Jews and Christians from the Arabian Peninsula?","id":"tirmidhi-21-201"},{"hadith-eng":"\"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1607, Book 21, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the Arabian Peninsula in Islamic teachings?","id":"tirmidhi-21-202"},{"hadith-eng":"\"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.The Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.I asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1608, Book 21, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #3","question":"What was the practice of the Prophet Muhammad (ﷺ) regarding financial support for his family?","id":"tirmidhi-21-203"},{"hadith-eng":"That Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"","reference":"Jami` at-Tirmidhi 1609, Book 21, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #3","question":"What does the hadith imply about the inheritance rights of the Prophet's family?","id":"tirmidhi-21-204"},{"hadith-eng":"\"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.","reference":"Jami` at-Tirmidhi 1610, Book 21, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did 'Umar bin Al-Khattab play in resolving the dispute between 'Ali and Al-'Abbas?","id":"tirmidhi-21-205"},{"hadith-eng":"\"On the day of the Conquest of Makkah, I heard the Prophet (ﷺ) saying: 'This is not to be battled over after today, until the Day of Judgement.'\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas, Sulaiman bin Surad, and Muti'This Hadith is Hasan Sahih, and it is a narration of Zakariyya bin Abi Za'idah from Ash-Sha'bi, we do not know of it except from his narration.","reference":"Jami` at-Tirmidhi 1611, Book 21, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the prohibition of battle in Makkah relate to its sanctity in Islam?","id":"tirmidhi-21-206"},{"hadith-eng":"\"I fought along with the Prophet (ﷺ), and if Fajr had begun he would wait until the sun rose, and when it rose he would fight. And if it was the middle of the daytime, he would wait until the sun passed the zenit, and when it passed the zenith he would fight until 'Asr. Then he would wait until he prayed 'Asr, then he would fight.\" He said: \"And it is used to be said during that (time) the the wind of victory was raging, and the believers would supplicate for their armies in their Salat.\"[Abu 'Eisa said:] This Hadith has been reported from An-Nu'man bin Muqarrin through a chain that is more connected that this. Qatadah did not see An-Nu'man bin Muqarrin. An-Nu'man died during the Khilafah of 'Umar.","reference":"Jami` at-Tirmidhi 1612, Book 21, Hadith 75","grade":"Da'if(Darussalam)","question #":"question #3","question":"What significance does the time of 'Asr prayer hold in the context of battles?","id":"tirmidhi-21-207"},{"hadith-eng":"\"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.","reference":"Jami` at-Tirmidhi 1613, Book 21, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does patience play in achieving victory in battles according to Islamic teachings?","id":"tirmidhi-21-208"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"At-Tiyarah is from Shirk, and none among us (it influences) except that Allah will remove it with Tawakkul (reliance).\"[Abu 'Eisa said:] I heard Muhammad bin Isma'il saying: \"Sulaiman bin Harb used to say about this Hadith: 'And none among us (it influences) except that Allah will remove it with Tawakkul (reliance)' - Sulaiman would say: 'To me, this is a saying of 'Abdullah bin Mas'ud.'\"There are narrations on this topic from Sa'd, Abu Hurairah, Habis At-Tamimi, 'Aishah and Ibn 'Umar.This Hadith is Hasan Sahih, we do not know of it except as a narration of Salamah bin Khuail. Shu'bah also reported this Hadith from Salamah.","reference":"Jami` at-Tirmidhi 1614, Book 21, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of Tawakkul in Islamic teachings?","id":"tirmidhi-21-209"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There is no 'Adwa and no Tiyarah, and I like Fa'l.\" They said: \"O Messenger of Allah! What is Fa'l?\" He said: \"A good statement.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1615, Book 21, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the meaning of Fa'l as explained by the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-210"},{"hadith-eng":"That the Prophet (ﷺ) used to like it when he set out upon an affair if he heard: \"O directed one, O successful one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1616, Book 21, Hadith 79","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the impact of optimism on decision-making from the Prophet's behavior?","id":"tirmidhi-21-211"},{"hadith-eng":"From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith","reference":"Jami` at-Tirmidhi 1617, Book 21, Hadith 80","grade":"Sahih(Darussalam)","question #":"question #3","question":"What options should be offered to enemies before engaging in battle according to Islamic principles?","id":"tirmidhi-21-212"},{"hadith-eng":"That the Prophet (ﷺ) would not attack except near the time of Fajr, so if he heard the Adhan he would refrain, and if not, then he would attack. So he listened one day and heard a man saying: \"Allahu Akbar, Allahu Akbar,\" so he said: \"Upon the Fitrah.\" Then he said: \"I bear witness that none has the right to be worshipped but Allah.\" So he said: \"You have departed from the Fire.\"","reference":"Jami` at-Tirmidhi 1618, Book 21, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the meaning of the phrase 'Upon the Fitrah' in Islamic teachings?","id":"tirmidhi-21-213"},{"hadith-eng":"\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"","reference":"Jami` at-Tirmidhi 1548, Book 21, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #4","question":"What was the response of the Persians to the invitation to Islam and the offer of Jizyah?","id":"tirmidhi-21-214"},{"hadith-eng":"From his father and he was a Companion who said: \"When the Messenger of Allah (ﷺ) dispatched any army or battalion, he would say to them: 'If you see a Masjid, or hear someone calling the Adhan, then do not kill anyone.'\"","reference":"Jami` at-Tirmidhi 1549, Book 21, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the ethical guidelines for Muslim soldiers when encountering religious symbols or practices during warfare?","id":"tirmidhi-21-215"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"","reference":"Jami` at-Tirmidhi 1550, Book 21, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the reaction of the Jews of Khaibar reveal about their awareness of the Prophet Muhammad (ﷺ) and his mission?","id":"tirmidhi-21-216"},{"hadith-eng":"\"When the Prophet (ﷺ) overtook a people he would stay at the outskirts of their city for three nights.\"","reference":"Jami` at-Tirmidhi 1551, Book 21, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet's approach to entering a city reflect his leadership and strategy?","id":"tirmidhi-21-217"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) burnt the palm trees of Bani Nadir and cut them down at Al-Buwairah. So Allah revealed: Whatever you cut down of their palm trees, or you left them standing on their trunks, then it was by the permission of Allah, and in the order to disgrace the rebellious.(59:5)\"","reference":"Jami` at-Tirmidhi 1552, Book 21, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"How were the rebellious actions of Bani Nadir addressed by the Prophet (ﷺ)?","id":"tirmidhi-21-218"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"","reference":"Jami` at-Tirmidhi 1553, Book 21, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #4","question":"In what ways has Allah honored the Prophet Muhammad and his nation?","id":"tirmidhi-21-219"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"","reference":"Jami` at-Tirmidhi 1554, Book 21, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the distribution of spoils tell us about the role of cavalry in Islamic military strategy?","id":"tirmidhi-21-220"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"This Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.","reference":"Jami` at-Tirmidhi 1555, Book 21, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the hadith suggest about the effectiveness of a smaller army in battle?","id":"tirmidhi-21-221"},{"hadith-eng":"That Najdah Al-Haruri wrote to Ibn 'Abbas asking if the Messenger of Allah (ﷺ) would fight along with women, and if he would fix a share of the spoils of war for them. Ibn 'Abbas wrote to him: \"You wrote to me asking me if the Messenger of Allah (ﷺ) would fight along with women. He did fight along with them, as they would treat the wounded. They received something from the spoils of war, but as for their share, then he did not fix a share for them.\"There is something on this topic from Anas and Umm 'Atiyyah.This Hadith is Hasan Sahih. This is acted upon according to most of the people of knowledge. It is the view of Sufyan Ath-Thawri and Ash-Shafi'i. Some of them said that a share is given to the woman and the boy, and this is the view of Al-Awza'i.Al-Awza'i said: The Prophet (ﷺ) gave a portion to the boys at Khaibar, and the Aimmah of the Muslims gave a portion to every child born in the land of war.\" Al-Awza'i said: \"The Prophet (ﷺ) gave a portion to the women at Khaibar, and that was followed by the Muslims after him.\" This was narrated to us by 'Ali bin Khashram (who said): \"'Eisa bin Yunus narrated this to us from Al-Awza'i.\"The meaning of his saying: \"They received something from the spoils of war\" it is said that he conferred something on them (the women) from the spoils of war.","reference":"Jami` at-Tirmidhi 1556, Book 21, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the differing scholarly views on allocating shares of war spoils to women and children?","id":"tirmidhi-21-222"},{"hadith-eng":"\"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.","reference":"Jami` at-Tirmidhi 1557, Book 21, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the views of scholars like Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq on distributing war spoils to slaves?","id":"tirmidhi-21-223"},{"hadith-eng":"That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.","reference":"Jami` at-Tirmidhi 1558, Book 21, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"What criteria are considered for accepting assistance in battles according to Islamic principles?","id":"tirmidhi-21-224"},{"hadith-eng":"\"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.","reference":"Jami` at-Tirmidhi 1559, Book 21, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the Ash'ari tribe play in the context of this hadith?","id":"tirmidhi-21-225"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.","reference":"Jami` at-Tirmidhi 1560, Book 21, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"What types of animals did the Prophet Muhammad (ﷺ) prohibit for consumption?","id":"tirmidhi-21-226"},{"hadith-eng":"\"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1561, Book 21, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who are some of the companions that narrated about the distribution of spoils of war by the Prophet (ﷺ)?","id":"tirmidhi-21-227"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"[Abu 'Eisa said:] There is a story with this Hadith.","reference":"Jami` at-Tirmidhi 1562, Book 21, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"What ethical considerations are involved in the treatment of enemy possessions during warfare?","id":"tirmidhi-21-228"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"There is something on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1563, Book 21, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the prohibition of selling spoils of war before distribution reflect on the principles of fairness and justice in Islam?","id":"tirmidhi-21-229"},{"hadith-eng":"From her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.Al-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"","reference":"Jami` at-Tirmidhi 1564, Book 21, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"How is the 'Iddah period observed for free women in Islamic law?","id":"tirmidhi-21-230"},{"hadith-eng":"From his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"[Abu 'Eisa said:] This Hadith is Hasan","reference":"Jami` at-Tirmidhi 1565, Book 21, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islam address concerns about the dietary practices of Christians?","id":"tirmidhi-21-231"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"Whoever separates between a mother and her child, then Allah will separate between him and his beloved on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Gharib.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike separating the captives, the mother and her child, the son and the father, and brothers.","reference":"Jami` at-Tirmidhi 1566, Book 21, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the views of the Companions of the Prophet (ﷺ) regarding the separation of captives and family members?","id":"tirmidhi-21-232"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.","reference":"Jami` at-Tirmidhi 1567, Book 21, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the decision-making process among the Companions reflect their priorities during the Battle of Badr?","id":"tirmidhi-21-233"},{"hadith-eng":"That the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.[Abu 'Eisa said:] This Hadith is Hasan Sahih.The paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)This is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.Al-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"Ishaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"","reference":"Jami` at-Tirmidhi 1568, Book 21, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the opinion of Al-Awzai' differ regarding the treatment of captives?","id":"tirmidhi-21-234"},{"hadith-eng":"That a woman was found killed in one of the expeditions of the Messenger of Allah (ﷺ), so the Messenger of Allah (ﷺ) rebuked that, and he prohibited killing women and children.There are narrations on this topic from Buraidah and Rabah - and they say he was Riyah - bin Ar-Rabi', Al-Aswad bin Sari', Ibn 'Abbas, and As-Sa'b bin Jaththamah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They disliked killing women and children. This is the view of Sufyan Ath-Thawri and Ash-Shafi'i.Some of the people of knowledge made an exception for killing the women who had children with them during night attacks, this is the view of Ahmad and Ishaq, they permitted it in night attacks.","reference":"Jami` at-Tirmidhi 1569, Book 21, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who among the scholars permitted the killing of women with children during night attacks, and what was their reasoning?","id":"tirmidhi-21-235"},{"hadith-eng":"\"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1570, Book 21, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are the actions of horses in battle viewed in Islamic teachings when they cause unintended harm?","id":"tirmidhi-21-236"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) sent us with an army and said: 'If you see so-and-so, and so-and-so' referring to two men from the Quraish: 'then burn them with fire.' Then, upon our departure, the Messenger of Allah (ﷺ) said: 'I ordered you to burn so-and-so, and so-and-so with fire, and indeed, none punishes with fire except Allah. So if you see them, then kill them.'\"There are narrations on this topic from Ibn 'Abbas and Hamzah bin 'Amr Al-Aslami.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. In this Hadith, Muhammad bin Ishaq mentioned a man (narrating) between Sulaiman bin Yasar and Abu Hurairah. Others reported this Hadith the same as Al-Laith reported it(here, without a man between them). The narration of Al-Laith bin Sa'd is more appropriate and more correct.","reference":"Jami` at-Tirmidhi 1571, Book 21, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's decision-making process from this narration?","id":"tirmidhi-21-237"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"There are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-JuhniFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers","reference":"Jami` at-Tirmidhi 1572, Book 21, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the term 'Ghulul' refer to and why is it important to avoid it?","id":"tirmidhi-21-238"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever's soul departs from his body while he is free of three: Kanz (buried treasure), Ghulul, and debt, then he will enter paradise.\"This is how Sa'eed narrated it: \"Kanz\" while Abu 'Awanah said in his narration: \"Kibr\" and he did not mention \"from Ma'dan\" in it. But the narration of Sa'eed is more correct.","reference":"Jami` at-Tirmidhi 1573, Book 21, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the meaning of 'Ghulul' and why is it important to be free from it?","id":"tirmidhi-21-239"},{"hadith-eng":"\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1574, Book 21, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the hadith emphasize the importance of honesty and integrity in one's actions?","id":"tirmidhi-21-240"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1575, Book 21, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"How were the wounded attended to during battles in the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-241"},{"hadith-eng":"From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.","reference":"Jami` at-Tirmidhi 1576, Book 21, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #4","question":"Who was Thuwair in the chain of narrators, and what is known about him?","id":"tirmidhi-21-242"},{"hadith-eng":"That he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.It has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.And the implication is that this was after he used to accept from them, and then he later forbade their gifts.","reference":"Jami` at-Tirmidhi 1577, Book 21, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does this narration imply about the relationship between Muslims and non-Muslims regarding gift-giving?","id":"tirmidhi-21-243"},{"hadith-eng":"\"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.This is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1578, Book 21, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of Bakkar bin 'Abdul-'Aziz in the narration of this hadith?","id":"tirmidhi-21-244"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1579, Book 21, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #4","question":"How is the authenticity of a hadith determined according to Islamic scholars?","id":"tirmidhi-21-245"},{"hadith-eng":"\"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1580, Book 21, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance does Islam provide regarding the timing of military actions in relation to treaties?","id":"tirmidhi-21-246"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. \nI asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"","reference":"Jami` at-Tirmidhi 1581, Book 21, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #4","question":"What do various narrations say about the punishment for betrayal in Islam?","id":"tirmidhi-21-247"},{"hadith-eng":"\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1582, Book 21, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #4","question":"What was Sa'd bin Mu'adh's supplication to Allah regarding Banu Quraizah?","id":"tirmidhi-21-248"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Kill the elder men among the idolaters and spare the Sharkh amont them.\"And the Sharkh are the boys who did not begin to grow pubic hair.[Abu 'Eisa said:] This Hadith is Hasan Sahih.Hajjaj bin Artah narrated similarly from Qatadah.","reference":"Jami` at-Tirmidhi 1583, Book 21, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of mercy manifest in Islamic rulings related to warfare?","id":"tirmidhi-21-249"},{"hadith-eng":"\"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.","reference":"Jami` at-Tirmidhi 1584, Book 21, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (ﷺ) handle captives during the battle of Quraizah based on their physical maturity?","id":"tirmidhi-21-250"},{"hadith-eng":"From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1585, Book 21, Hadith 47","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of Islam adding gravity to pre-Islamic allegiances?","id":"tirmidhi-21-251"},{"hadith-eng":"\"I was a scribe for Jaz' bin Mu'awiyah at Manadhir when 'Umar's letter came to us (saying): 'Inspect the Zoroastrians around you to take the Jizyah from them. For indeed 'Abdur-Rahman bin 'Awf informed me that the Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Hajar.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1586, Book 21, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet Muhammad (ﷺ) contribute to the implementation of Islamic laws?","id":"tirmidhi-21-252"},{"hadith-eng":"That 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"There is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1587, Book 21, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the historical context of the Jizyah tax in Islamic governance?","id":"tirmidhi-21-253"},{"hadith-eng":"From Az-Zuhri, that Sa'ib bin Yazid said: \"The Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Bahrain, and 'Umar took it in Persia, and 'Uthman took it from the Persians.\"I asked Muhammad about this, so he said: \"It is: 'Malik from Az-Zuhri from the Prophet (ﷺ).'\"","reference":"Jami` at-Tirmidhi 1588, Book 21, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #4","question":"How did the early Islamic leaders implement the collection of Jizyah in different regions?","id":"tirmidhi-21-254"},{"hadith-eng":"\"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.This Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.","reference":"Jami` at-Tirmidhi 1589, Book 21, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role did the companions of the Prophet play in interpreting and applying his teachings?","id":"tirmidhi-21-255"},{"hadith-eng":"That on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.","reference":"Jami` at-Tirmidhi 1590, Book 21, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who are some of the companions that narrated similar teachings about Hijrah and Jihad?","id":"tirmidhi-21-256"},{"hadith-eng":"From Abu Salamah, from Jabir bin Abdullah about the statement of Allah, most High: Allah was pleased with the believers when they gave the pledge to you under the tree (48:18). that Jabir said: \"We pledged to the Messenger of Allah (ﷺ) that we would not flee, and we did not pledge to him for death.\"[He said:] There are narration on this topic from Salamah bin Al-Akwa', Ibn 'Umar, 'Ubadah, and Jarir bin 'Abdullah.[Abu 'Eisa said:] This Hadith is been reported from 'Eisa bin Yunus, from Al-Awza'i, from Yahya bin Abi Kathir who said: \"Jabir bin 'Abdullah said\" and he did not mention Abu Salamah on it.","reference":"Jami` at-Tirmidhi 1591, Book 21, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the narration describe the nature of the pledge made to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-257"},{"hadith-eng":"\"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1592, Book 21, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the dedication and bravery of the companions from their actions at Al-Hudaibiyyah?","id":"tirmidhi-21-258"},{"hadith-eng":"\"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1593, Book 21, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is the concept of hearing and obeying emphasized in Islamic tradition?","id":"tirmidhi-21-259"},{"hadith-eng":"\"We did not pledge to the Messenger of Allah (ﷺ) for death, but only that we would not flee.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, meaning both of the Ahadith are Sahih. Some of his Companions pledged to him for death, they said only: \"We will not leave from in front of you as long as we are not killed.\" While others pledged him by saying: \"We will not flee.\"","reference":"Jami` at-Tirmidhi 1594, Book 21, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does it mean to pledge not to flee in the context of Islamic teachings?","id":"tirmidhi-21-260"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Three will not be spoken to by Allah on the Day of Judgement, nor will they be purified, and for them is a painful torment: A man that gave a pledge to an Imam, and if he gives to him he fulfills it, and if he does not give to him he does not fulfill not fulfill it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1595, Book 21, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"What kind of torment is described for those who do not fulfill their pledges?","id":"tirmidhi-21-261"},{"hadith-eng":"\"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came, and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. After this he (ﷺ) would not take the pledge from anyone until he asked him if he was a slave.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Jabir is Hasan Gharib Sahih, we do not know of it except as a narration of Abu Az-Zubair.","reference":"Jami` at-Tirmidhi 1596, Book 21, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's (ﷺ) attitude towards slavery from this incident?","id":"tirmidhi-21-262"},{"hadith-eng":"\"I pledged to the Messenger of Allah (ﷺ) along with some women. He said to us: 'In as much as you are able and capable.' I said: 'Allah and His Messenger are more merciful to us than we are to ourselves,' then I said: 'O Messenger of Allah take the pledge from us.'\" - Sufyan (one of the narrators) said: meaning: 'shake (hands) on it with us' - \"so the Messenger of Allah (ﷺ) said: 'My statement to one hundred women is like my statement to one.'\"[He said:] There are narrations on this topic from 'Aishah, from 'Abdullah bin 'Umar, and Asma' bint Yazid.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of Muhammad bin Al-Munkadir.Sufyan Ath-Thawri, Malik bin Anas, and others reported this Hadith from Muhammad bin Al-Munkadir similarly. He said: I asked Muhammad about this Hadith and he said: \"I am not aware of a Hadith other than this from Umaimah bint Ruqaiqah.\" There is another woman named Umaimah who narrated from the Messenger of Allah (ﷺ).","reference":"Jami` at-Tirmidhi 1597, Book 21, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad (ﷺ) address large groups of people with a single message in Islamic tradition?","id":"tirmidhi-21-263"},{"hadith-eng":"\"We used to say that the participants of Badr on the Day of Badr were like the number of companions of Talut, three hundred and thirteen men.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and others reported it from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1598, Book 21, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the term 'Hasan Sahih' indicate about the authenticity of a hadith?","id":"tirmidhi-21-264"},{"hadith-eng":"That the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"He said: There is a story with this Hadith[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1599, Book 21, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the responsibilities of Muslims regarding the distribution of war spoils?","id":"tirmidhi-21-265"},{"hadith-eng":"From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.","reference":"Jami` at-Tirmidhi 1600, Book 21, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are animals valued and equated in terms of resources in Islamic tradition?","id":"tirmidhi-21-266"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever plunders then he is not of us.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a Hadith of Anas.","reference":"Jami` at-Tirmidhi 1601, Book 21, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the concept of belonging to the Muslim community linked to one's actions in this context?","id":"tirmidhi-21-267"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one you meets one of them in the path, then force him to its narrow portion.\"[He said:] There are narrations on this topic from Ibn 'Umar, Anas, and Abu Basrah Al-Ghifari the Companion of the Prophet (ﷺ).[Abu 'Eisa said:] This Hadith is Hasan Sahih. And regarding the meaning of this Hadith: \"Do not precede the Jews and the Christians\": Some of the poeple of knowledge said that it only means that it is disliked because it would be honoring them, and the Muslims were ordered to humiliate them. For this reason, when one of them is met on the path, then the path is not yielded for him, because doing so would amount to honoring them.","reference":"Jami` at-Tirmidhi 1602, Book 21, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do scholars interpret the instruction to not honor Jews and Christians in this context?","id":"tirmidhi-21-268"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1603, Book 21, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration suggest about the importance of being cautious in interactions with others?","id":"tirmidhi-21-269"},{"hadith-eng":"From Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"","reference":"Jami` at-Tirmidhi 1604, Book 21, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of Muslims living among non-Muslims according to this narration?","id":"tirmidhi-21-270"},{"hadith-eng":"Similar to the narration of Abu Mu'aqiyah (no. 1604) but he did not mention in it: \"from Jarir\" in it, and that is more correct.There is something on this topic from Samurah.[Abu 'Eisa said:] Most of the companions of Isma'il said: \"From Isma'il, from Qais bin Abu Hazim, that the Messenger of Allah (ﷺ) sent a military expedition.\" and they did not mention: \"from Jarir\" in it.Hammad bin Salamah reported similar to the narration of Abu Mu'awiyah, from Al-Hajjaj bin Artah, from Isma'il bin Abi Khalid, from Qais from Jarir[He said:] I heard Muhammad saying: \"What is correct is the narration of Qais from the Prophet (ﷺ) in Mursal form.\"Samurah bin Jundab repoted that the Prophet (ﷺ) said: \"Do not live among the idolaters, and do not assemble with them, for whoever lives among them or assembles with them then he is similar to them.\"","reference":"Jami` at-Tirmidhi 1605, Book 21, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important for Muslims to maintain a distinct identity and community separate from idolaters?","id":"tirmidhi-21-271"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"","reference":"Jami` at-Tirmidhi 1606, Book 21, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the Arabian Peninsula in Islamic tradition and history?","id":"tirmidhi-21-272"},{"hadith-eng":"\"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1607, Book 21, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the classification of a hadith as Hasan Sahih affect its acceptance and application in Islamic jurisprudence?","id":"tirmidhi-21-273"},{"hadith-eng":"\"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.The Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.I asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1608, Book 21, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #4","question":"Who are the individuals mentioned in the hadith that also narrated similar accounts?","id":"tirmidhi-21-274"},{"hadith-eng":"That Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"","reference":"Jami` at-Tirmidhi 1609, Book 21, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the hadith reveal about the relationship between Fatimah and the companions regarding the inheritance matter?","id":"tirmidhi-21-275"},{"hadith-eng":"\"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.","reference":"Jami` at-Tirmidhi 1610, Book 21, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration reveal about the companions' understanding of the Prophet's teachings on inheritance?","id":"tirmidhi-21-276"},{"hadith-eng":"\"On the day of the Conquest of Makkah, I heard the Prophet (ﷺ) saying: 'This is not to be battled over after today, until the Day of Judgement.'\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas, Sulaiman bin Surad, and Muti'This Hadith is Hasan Sahih, and it is a narration of Zakariyya bin Abi Za'idah from Ash-Sha'bi, we do not know of it except from his narration.","reference":"Jami` at-Tirmidhi 1611, Book 21, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the consequences of violating the sanctity of Makkah after its conquest?","id":"tirmidhi-21-277"},{"hadith-eng":"\"I fought along with the Prophet (ﷺ), and if Fajr had begun he would wait until the sun rose, and when it rose he would fight. And if it was the middle of the daytime, he would wait until the sun passed the zenit, and when it passed the zenith he would fight until 'Asr. Then he would wait until he prayed 'Asr, then he would fight.\" He said: \"And it is used to be said during that (time) the the wind of victory was raging, and the believers would supplicate for their armies in their Salat.\"[Abu 'Eisa said:] This Hadith has been reported from An-Nu'man bin Muqarrin through a chain that is more connected that this. Qatadah did not see An-Nu'man bin Muqarrin. An-Nu'man died during the Khilafah of 'Umar.","reference":"Jami` at-Tirmidhi 1612, Book 21, Hadith 75","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the role of prayer in seeking divine assistance during conflicts?","id":"tirmidhi-21-278"},{"hadith-eng":"\"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.","reference":"Jami` at-Tirmidhi 1613, Book 21, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet (ﷺ) approach battles in terms of strategy and timing?","id":"tirmidhi-21-279"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"At-Tiyarah is from Shirk, and none among us (it influences) except that Allah will remove it with Tawakkul (reliance).\"[Abu 'Eisa said:] I heard Muhammad bin Isma'il saying: \"Sulaiman bin Harb used to say about this Hadith: 'And none among us (it influences) except that Allah will remove it with Tawakkul (reliance)' - Sulaiman would say: 'To me, this is a saying of 'Abdullah bin Mas'ud.'\"There are narrations on this topic from Sa'd, Abu Hurairah, Habis At-Tamimi, 'Aishah and Ibn 'Umar.This Hadith is Hasan Sahih, we do not know of it except as a narration of Salamah bin Khuail. Shu'bah also reported this Hadith from Salamah.","reference":"Jami` at-Tirmidhi 1614, Book 21, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who are some of the companions that narrated similar teachings about At-Tiyarah?","id":"tirmidhi-21-280"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There is no 'Adwa and no Tiyarah, and I like Fa'l.\" They said: \"O Messenger of Allah! What is Fa'l?\" He said: \"A good statement.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1615, Book 21, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is a good statement considered important in Islamic teachings?","id":"tirmidhi-21-281"},{"hadith-eng":"That the Prophet (ﷺ) used to like it when he set out upon an affair if he heard: \"O directed one, O successful one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1616, Book 21, Hadith 79","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might the Prophet have preferred to hear certain phrases before starting an endeavor?","id":"tirmidhi-21-282"},{"hadith-eng":"From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith","reference":"Jami` at-Tirmidhi 1617, Book 21, Hadith 80","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of granting covenants in warfare in Islam?","id":"tirmidhi-21-283"},{"hadith-eng":"That the Prophet (ﷺ) would not attack except near the time of Fajr, so if he heard the Adhan he would refrain, and if not, then he would attack. So he listened one day and heard a man saying: \"Allahu Akbar, Allahu Akbar,\" so he said: \"Upon the Fitrah.\" Then he said: \"I bear witness that none has the right to be worshipped but Allah.\" So he said: \"You have departed from the Fire.\"","reference":"Jami` at-Tirmidhi 1618, Book 21, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the importance of the testimony of faith in Islam?","id":"tirmidhi-21-284"},{"hadith-eng":"\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"","reference":"Jami` at-Tirmidhi 1548, Book 21, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #5","question":"How long did Salman Al-Farisi persist in his efforts to call the Persians to Islam before taking military action?","id":"tirmidhi-21-285"},{"hadith-eng":"From his father and he was a Companion who said: \"When the Messenger of Allah (ﷺ) dispatched any army or battalion, he would say to them: 'If you see a Masjid, or hear someone calling the Adhan, then do not kill anyone.'\"","reference":"Jami` at-Tirmidhi 1549, Book 21, Hadith 2","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does Islamic law prioritize the protection of religious sites and individuals during conflicts?","id":"tirmidhi-21-286"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"","reference":"Jami` at-Tirmidhi 1550, Book 21, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet Muhammad's (ﷺ) approach to warfare from this incident?","id":"tirmidhi-21-287"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) burnt the palm trees of Bani Nadir and cut them down at Al-Buwairah. So Allah revealed: Whatever you cut down of their palm trees, or you left them standing on their trunks, then it was by the permission of Allah, and in the order to disgrace the rebellious.(59:5)\"","reference":"Jami` at-Tirmidhi 1552, Book 21, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned about dealing with rebellion and disobedience from this incident?","id":"tirmidhi-21-288"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"","reference":"Jami` at-Tirmidhi 1553, Book 21, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of the spoils of war being permissible for Muslims?","id":"tirmidhi-21-289"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"","reference":"Jami` at-Tirmidhi 1554, Book 21, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the allocation of shares reflect the value placed on different contributions in battle?","id":"tirmidhi-21-290"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"This Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.","reference":"Jami` at-Tirmidhi 1555, Book 21, Hadith 10","grade":"Da'if(Darussalam)","question #":"question #5","question":"How are different numbers associated with military strength and companionship in Islamic teachings?","id":"tirmidhi-21-291"},{"hadith-eng":"That Najdah Al-Haruri wrote to Ibn 'Abbas asking if the Messenger of Allah (ﷺ) would fight along with women, and if he would fix a share of the spoils of war for them. Ibn 'Abbas wrote to him: \"You wrote to me asking me if the Messenger of Allah (ﷺ) would fight along with women. He did fight along with them, as they would treat the wounded. They received something from the spoils of war, but as for their share, then he did not fix a share for them.\"There is something on this topic from Anas and Umm 'Atiyyah.This Hadith is Hasan Sahih. This is acted upon according to most of the people of knowledge. It is the view of Sufyan Ath-Thawri and Ash-Shafi'i. Some of them said that a share is given to the woman and the boy, and this is the view of Al-Awza'i.Al-Awza'i said: The Prophet (ﷺ) gave a portion to the boys at Khaibar, and the Aimmah of the Muslims gave a portion to every child born in the land of war.\" Al-Awza'i said: \"The Prophet (ﷺ) gave a portion to the women at Khaibar, and that was followed by the Muslims after him.\" This was narrated to us by 'Ali bin Khashram (who said): \"'Eisa bin Yunus narrated this to us from Al-Awza'i.\"The meaning of his saying: \"They received something from the spoils of war\" it is said that he conferred something on them (the women) from the spoils of war.","reference":"Jami` at-Tirmidhi 1556, Book 21, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the practices of distributing war spoils evolve after the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-292"},{"hadith-eng":"\"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.","reference":"Jami` at-Tirmidhi 1557, Book 21, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith reflect the treatment and rights of slaves in early Islamic society?","id":"tirmidhi-21-293"},{"hadith-eng":"That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.","reference":"Jami` at-Tirmidhi 1558, Book 21, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do Islamic teachings address the involvement of people of Adh-Dhimmah in Muslim military efforts?","id":"tirmidhi-21-294"},{"hadith-eng":"\"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.","reference":"Jami` at-Tirmidhi 1559, Book 21, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do different scholars like Al-Awza'i interpret the rules of share distribution in conquests?","id":"tirmidhi-21-295"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.","reference":"Jami` at-Tirmidhi 1560, Book 21, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of washing utensils in Islamic dietary laws?","id":"tirmidhi-21-296"},{"hadith-eng":"\"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1561, Book 21, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the hadith narrated by 'Ubadah bin As-Samit regarding spoils of war?","id":"tirmidhi-21-297"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"[Abu 'Eisa said:] There is a story with this Hadith.","reference":"Jami` at-Tirmidhi 1562, Book 21, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching reflect on the principles of justice and fairness in Islamic warfare?","id":"tirmidhi-21-298"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"There is something on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.","reference":"Jami` at-Tirmidhi 1563, Book 21, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #5","question":"What lessons can be learned about the management of communal resources from the prohibition on selling spoils of war before distribution?","id":"tirmidhi-21-299"},{"hadith-eng":"From her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.Al-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"","reference":"Jami` at-Tirmidhi 1564, Book 21, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of the hadith being classified as 'Gharib'?","id":"tirmidhi-21-300"},{"hadith-eng":"From his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"[Abu 'Eisa said:] This Hadith is Hasan","reference":"Jami` at-Tirmidhi 1565, Book 21, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does personal conviction play in making dietary choices in Islam?","id":"tirmidhi-21-301"},{"hadith-eng":"That he heard the Messenger of Allah (ﷺ) say: \"Whoever separates between a mother and her child, then Allah will separate between him and his beloved on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Gharib.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike separating the captives, the mother and her child, the son and the father, and brothers.","reference":"Jami` at-Tirmidhi 1566, Book 21, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of separation between loved ones relate to the Day of Judgement in Islamic belief?","id":"tirmidhi-21-302"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.","reference":"Jami` at-Tirmidhi 1567, Book 21, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does this narration indicate about the communication between the Prophet Muhammad (ﷺ) and his Companions?","id":"tirmidhi-21-303"},{"hadith-eng":"That the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.[Abu 'Eisa said:] This Hadith is Hasan Sahih.The paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)This is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.Al-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"Ishaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"","reference":"Jami` at-Tirmidhi 1568, Book 21, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What factors might influence the decision to ransom or kill captives according to Islamic teachings?","id":"tirmidhi-21-304"},{"hadith-eng":"That a woman was found killed in one of the expeditions of the Messenger of Allah (ﷺ), so the Messenger of Allah (ﷺ) rebuked that, and he prohibited killing women and children.There are narrations on this topic from Buraidah and Rabah - and they say he was Riyah - bin Ar-Rabi', Al-Aswad bin Sari', Ibn 'Abbas, and As-Sa'b bin Jaththamah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They disliked killing women and children. This is the view of Sufyan Ath-Thawri and Ash-Shafi'i.Some of the people of knowledge made an exception for killing the women who had children with them during night attacks, this is the view of Ahmad and Ishaq, they permitted it in night attacks.","reference":"Jami` at-Tirmidhi 1569, Book 21, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith reflect the ethical considerations in warfare according to Islamic teachings?","id":"tirmidhi-21-305"},{"hadith-eng":"\"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1570, Book 21, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of lineage in determining the status of individuals in Islamic law?","id":"tirmidhi-21-306"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) sent us with an army and said: 'If you see so-and-so, and so-and-so' referring to two men from the Quraish: 'then burn them with fire.' Then, upon our departure, the Messenger of Allah (ﷺ) said: 'I ordered you to burn so-and-so, and so-and-so with fire, and indeed, none punishes with fire except Allah. So if you see them, then kill them.'\"There are narrations on this topic from Ibn 'Abbas and Hamzah bin 'Amr Al-Aslami.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. In this Hadith, Muhammad bin Ishaq mentioned a man (narrating) between Sulaiman bin Yasar and Abu Hurairah. Others reported this Hadith the same as Al-Laith reported it(here, without a man between them). The narration of Al-Laith bin Sa'd is more appropriate and more correct.","reference":"Jami` at-Tirmidhi 1571, Book 21, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith reflect the importance of adhering to divine laws over personal commands?","id":"tirmidhi-21-307"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"There are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-JuhniFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers","reference":"Jami` at-Tirmidhi 1572, Book 21, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam emphasize the importance of honesty and integrity in financial matters?","id":"tirmidhi-21-308"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever's soul departs from his body while he is free of three: Kanz (buried treasure), Ghulul, and debt, then he will enter paradise.\"This is how Sa'eed narrated it: \"Kanz\" while Abu 'Awanah said in his narration: \"Kibr\" and he did not mention \"from Ma'dan\" in it. But the narration of Sa'eed is more correct.","reference":"Jami` at-Tirmidhi 1573, Book 21, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #5","question":"How do different narrations of a hadith affect its interpretation and understanding?","id":"tirmidhi-21-309"},{"hadith-eng":"\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1574, Book 21, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does Umar bin Al-Khattab play in conveying the message of this hadith?","id":"tirmidhi-21-310"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1575, Book 21, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"What significance does the participation of women in battles hold in Islamic history?","id":"tirmidhi-21-311"},{"hadith-eng":"From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.","reference":"Jami` at-Tirmidhi 1576, Book 21, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the classification of this hadith in terms of its authenticity?","id":"tirmidhi-21-312"},{"hadith-eng":"That he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.It has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.And the implication is that this was after he used to accept from them, and then he later forbade their gifts.","reference":"Jami` at-Tirmidhi 1577, Book 21, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the conditions under which a Muslim can accept gifts from non-Muslims?","id":"tirmidhi-21-313"},{"hadith-eng":"\"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.This is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1578, Book 21, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #5","question":"How is the reliability of a narrator assessed in the context of hadith transmission?","id":"tirmidhi-21-314"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.","reference":"Jami` at-Tirmidhi 1579, Book 21, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the term 'Hasan Gharib' indicate about the classification of a hadith?","id":"tirmidhi-21-315"},{"hadith-eng":"\"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1580, Book 21, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of retribution for a similar offense relate to treaty violations in Islam?","id":"tirmidhi-21-316"},{"hadith-eng":"The Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. \nI asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"","reference":"Jami` at-Tirmidhi 1581, Book 21, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the concept of betrayal viewed in the context of Islamic eschatology?","id":"tirmidhi-21-317"},{"hadith-eng":"\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1582, Book 21, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad (ﷺ) respond to Sa'd bin Mu'adh's judgment?","id":"tirmidhi-21-318"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Kill the elder men among the idolaters and spare the Sharkh amont them.\"And the Sharkh are the boys who did not begin to grow pubic hair.[Abu 'Eisa said:] This Hadith is Hasan Sahih.Hajjaj bin Artah narrated similarly from Qatadah.","reference":"Jami` at-Tirmidhi 1583, Book 21, Hadith 45","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the ethical considerations in Islam when dealing with young individuals in conflict situations?","id":"tirmidhi-21-319"},{"hadith-eng":"\"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.","reference":"Jami` at-Tirmidhi 1584, Book 21, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of determining the age of responsibility in Islamic law?","id":"tirmidhi-21-320"},{"hadith-eng":"From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1585, Book 21, Hadith 47","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned from the Prophet's guidance on allegiances in his Khutbah?","id":"tirmidhi-21-321"},{"hadith-eng":"\"I was a scribe for Jaz' bin Mu'awiyah at Manadhir when 'Umar's letter came to us (saying): 'Inspect the Zoroastrians around you to take the Jizyah from them. For indeed 'Abdur-Rahman bin 'Awf informed me that the Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Hajar.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1586, Book 21, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the historical context of the Jizyah tax in Islamic history?","id":"tirmidhi-21-322"},{"hadith-eng":"That 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"There is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1587, Book 21, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the acceptance of Jizyah from different religious groups reflect the Prophet's approach to interfaith relations?","id":"tirmidhi-21-323"},{"hadith-eng":"From Az-Zuhri, that Sa'ib bin Yazid said: \"The Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Bahrain, and 'Umar took it in Persia, and 'Uthman took it from the Persians.\"I asked Muhammad about this, so he said: \"It is: 'Malik from Az-Zuhri from the Prophet (ﷺ).'\"","reference":"Jami` at-Tirmidhi 1588, Book 21, Hadith 50","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be inferred about the relationship between Muslims and non-Muslims from the collection of Jizyah?","id":"tirmidhi-21-324"},{"hadith-eng":"\"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.This Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.","reference":"Jami` at-Tirmidhi 1589, Book 21, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the challenges faced by early Muslims during their travels?","id":"tirmidhi-21-325"},{"hadith-eng":"That on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.","reference":"Jami` at-Tirmidhi 1590, Book 21, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the classification of this hadith in terms of its authenticity?","id":"tirmidhi-21-326"},{"hadith-eng":"From Abu Salamah, from Jabir bin Abdullah about the statement of Allah, most High: Allah was pleased with the believers when they gave the pledge to you under the tree (48:18). that Jabir said: \"We pledged to the Messenger of Allah (ﷺ) that we would not flee, and we did not pledge to him for death.\"[He said:] There are narration on this topic from Salamah bin Al-Akwa', Ibn 'Umar, 'Ubadah, and Jarir bin 'Abdullah.[Abu 'Eisa said:] This Hadith is been reported from 'Eisa bin Yunus, from Al-Awza'i, from Yahya bin Abi Kathir who said: \"Jabir bin 'Abdullah said\" and he did not mention Abu Salamah on it.","reference":"Jami` at-Tirmidhi 1591, Book 21, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the Quranic verse 48:18 refer to in the context of this narration?","id":"tirmidhi-21-327"},{"hadith-eng":"\"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1592, Book 21, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of pledging allegiance play a role in Islamic teachings and history?","id":"tirmidhi-21-328"},{"hadith-eng":"\"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1593, Book 21, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the principle of ability affect one's religious duties in Islam?","id":"tirmidhi-21-329"},{"hadith-eng":"\"We did not pledge to the Messenger of Allah (ﷺ) for death, but only that we would not flee.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, meaning both of the Ahadith are Sahih. Some of his Companions pledged to him for death, they said only: \"We will not leave from in front of you as long as we are not killed.\" While others pledged him by saying: \"We will not flee.\"","reference":"Jami` at-Tirmidhi 1594, Book 21, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of loyalty manifest in the actions of the Prophet's (ﷺ) companions?","id":"tirmidhi-21-330"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Three will not be spoken to by Allah on the Day of Judgement, nor will they be purified, and for them is a painful torment: A man that gave a pledge to an Imam, and if he gives to him he fulfills it, and if he does not give to him he does not fulfill not fulfill it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1595, Book 21, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is it important to maintain integrity and honesty in dealings with leaders according to Islamic teachings?","id":"tirmidhi-21-331"},{"hadith-eng":"\"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came, and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. After this he (ﷺ) would not take the pledge from anyone until he asked him if he was a slave.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] The Hadith of Jabir is Hasan Gharib Sahih, we do not know of it except as a narration of Abu Az-Zubair.","reference":"Jami` at-Tirmidhi 1596, Book 21, Hadith 58","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's (ﷺ) awareness and sensitivity to social conditions?","id":"tirmidhi-21-332"},{"hadith-eng":"\"I pledged to the Messenger of Allah (ﷺ) along with some women. He said to us: 'In as much as you are able and capable.' I said: 'Allah and His Messenger are more merciful to us than we are to ourselves,' then I said: 'O Messenger of Allah take the pledge from us.'\" - Sufyan (one of the narrators) said: meaning: 'shake (hands) on it with us' - \"so the Messenger of Allah (ﷺ) said: 'My statement to one hundred women is like my statement to one.'\"[He said:] There are narrations on this topic from 'Aishah, from 'Abdullah bin 'Umar, and Asma' bint Yazid.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of Muhammad bin Al-Munkadir.Sufyan Ath-Thawri, Malik bin Anas, and others reported this Hadith from Muhammad bin Al-Munkadir similarly. He said: I asked Muhammad about this Hadith and he said: \"I am not aware of a Hadith other than this from Umaimah bint Ruqaiqah.\" There is another woman named Umaimah who narrated from the Messenger of Allah (ﷺ).","reference":"Jami` at-Tirmidhi 1597, Book 21, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of women in the early Islamic community as reflected in their interactions with the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-333"},{"hadith-eng":"\"We used to say that the participants of Badr on the Day of Badr were like the number of companions of Talut, three hundred and thirteen men.\"[He said:] There is something on this topic from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and others reported it from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1598, Book 21, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #5","question":"Who are some of the notable narrators mentioned in the transmission of this hadith?","id":"tirmidhi-21-334"},{"hadith-eng":"That the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"He said: There is a story with this Hadith[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1599, Book 21, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'Khumus' refer to in Islamic jurisprudence?","id":"tirmidhi-21-335"},{"hadith-eng":"From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.","reference":"Jami` at-Tirmidhi 1600, Book 21, Hadith 63","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be drawn about communal sharing and responsibility from this event?","id":"tirmidhi-21-336"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever plunders then he is not of us.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a Hadith of Anas.","reference":"Jami` at-Tirmidhi 1601, Book 21, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration imply about the moral and ethical standards expected of Muslims?","id":"tirmidhi-21-337"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one you meets one of them in the path, then force him to its narrow portion.\"[He said:] There are narrations on this topic from Ibn 'Umar, Anas, and Abu Basrah Al-Ghifari the Companion of the Prophet (ﷺ).[Abu 'Eisa said:] This Hadith is Hasan Sahih. And regarding the meaning of this Hadith: \"Do not precede the Jews and the Christians\": Some of the poeple of knowledge said that it only means that it is disliked because it would be honoring them, and the Muslims were ordered to humiliate them. For this reason, when one of them is met on the path, then the path is not yielded for him, because doing so would amount to honoring them.","reference":"Jami` at-Tirmidhi 1602, Book 21, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of this hadith on interfaith interactions in Islam?","id":"tirmidhi-21-338"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1603, Book 21, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith illustrate the concept of returning greetings in Islam?","id":"tirmidhi-21-339"},{"hadith-eng":"From Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"","reference":"Jami` at-Tirmidhi 1604, Book 21, Hadith 67","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this narration address the issue of mistaken identity in conflict situations?","id":"tirmidhi-21-340"},{"hadith-eng":"Similar to the narration of Abu Mu'aqiyah (no. 1604) but he did not mention in it: \"from Jarir\" in it, and that is more correct.There is something on this topic from Samurah.[Abu 'Eisa said:] Most of the companions of Isma'il said: \"From Isma'il, from Qais bin Abu Hazim, that the Messenger of Allah (ﷺ) sent a military expedition.\" and they did not mention: \"from Jarir\" in it.Hammad bin Salamah reported similar to the narration of Abu Mu'awiyah, from Al-Hajjaj bin Artah, from Isma'il bin Abi Khalid, from Qais from Jarir[He said:] I heard Muhammad saying: \"What is correct is the narration of Qais from the Prophet (ﷺ) in Mursal form.\"Samurah bin Jundab repoted that the Prophet (ﷺ) said: \"Do not live among the idolaters, and do not assemble with them, for whoever lives among them or assembles with them then he is similar to them.\"","reference":"Jami` at-Tirmidhi 1605, Book 21, Hadith 68","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the influence of one's environment on their religious beliefs and practices?","id":"tirmidhi-21-341"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"","reference":"Jami` at-Tirmidhi 1606, Book 21, Hadith 69","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do Islamic teachings address the coexistence of different religious communities?","id":"tirmidhi-21-342"},{"hadith-eng":"\"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1607, Book 21, Hadith 70","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role did Umar bin Al-Khattab play in conveying the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-21-343"},{"hadith-eng":"\"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.The Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.I asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1608, Book 21, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of Abu Bakr's adherence to the Prophet's practices in terms of financial support?","id":"tirmidhi-21-344"},{"hadith-eng":"That Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"","reference":"Jami` at-Tirmidhi 1609, Book 21, Hadith 72","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the hadith illustrate the concept of truthfulness among the companions of the Prophet?","id":"tirmidhi-21-345"},{"hadith-eng":"\"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.","reference":"Jami` at-Tirmidhi 1610, Book 21, Hadith 73","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith illustrate the importance of truthfulness and following the teachings of the Prophet (ﷺ)?","id":"tirmidhi-21-346"},{"hadith-eng":"\"On the day of the Conquest of Makkah, I heard the Prophet (ﷺ) saying: 'This is not to be battled over after today, until the Day of Judgement.'\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas, Sulaiman bin Surad, and Muti'This Hadith is Hasan Sahih, and it is a narration of Zakariyya bin Abi Za'idah from Ash-Sha'bi, we do not know of it except from his narration.","reference":"Jami` at-Tirmidhi 1611, Book 21, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the hadith reflect the finality of the Prophet's (ﷺ) actions regarding Makkah?","id":"tirmidhi-21-347"},{"hadith-eng":"\"I fought along with the Prophet (ﷺ), and if Fajr had begun he would wait until the sun rose, and when it rose he would fight. And if it was the middle of the daytime, he would wait until the sun passed the zenit, and when it passed the zenith he would fight until 'Asr. Then he would wait until he prayed 'Asr, then he would fight.\" He said: \"And it is used to be said during that (time) the the wind of victory was raging, and the believers would supplicate for their armies in their Salat.\"[Abu 'Eisa said:] This Hadith has been reported from An-Nu'man bin Muqarrin through a chain that is more connected that this. Qatadah did not see An-Nu'man bin Muqarrin. An-Nu'man died during the Khilafah of 'Umar.","reference":"Jami` at-Tirmidhi 1612, Book 21, Hadith 75","grade":"Da'if(Darussalam)","question #":"question #5","question":"How did the Prophet (ﷺ) incorporate prayer into his military strategy?","id":"tirmidhi-21-348"},{"hadith-eng":"\"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.","reference":"Jami` at-Tirmidhi 1613, Book 21, Hadith 76","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of the sun's position in determining the timing of battles in Islamic history?","id":"tirmidhi-21-349"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"At-Tiyarah is from Shirk, and none among us (it influences) except that Allah will remove it with Tawakkul (reliance).\"[Abu 'Eisa said:] I heard Muhammad bin Isma'il saying: \"Sulaiman bin Harb used to say about this Hadith: 'And none among us (it influences) except that Allah will remove it with Tawakkul (reliance)' - Sulaiman would say: 'To me, this is a saying of 'Abdullah bin Mas'ud.'\"There are narrations on this topic from Sa'd, Abu Hurairah, Habis At-Tamimi, 'Aishah and Ibn 'Umar.This Hadith is Hasan Sahih, we do not know of it except as a narration of Salamah bin Khuail. Shu'bah also reported this Hadith from Salamah.","reference":"Jami` at-Tirmidhi 1614, Book 21, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the classification of a Hadith as Hasan Sahih indicate about its authenticity?","id":"tirmidhi-21-350"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There is no 'Adwa and no Tiyarah, and I like Fa'l.\" They said: \"O Messenger of Allah! What is Fa'l?\" He said: \"A good statement.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1615, Book 21, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the rejection of 'Adwa and Tiyarah relate to Islamic beliefs in destiny and divine will?","id":"tirmidhi-21-351"},{"hadith-eng":"From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith","reference":"Jami` at-Tirmidhi 1617, Book 21, Hadith 80","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam view the treatment of children during conflicts?","id":"tirmidhi-21-352"},{"hadith-eng":"That the Prophet (ﷺ) would not attack except near the time of Fajr, so if he heard the Adhan he would refrain, and if not, then he would attack. So he listened one day and heard a man saying: \"Allahu Akbar, Allahu Akbar,\" so he said: \"Upon the Fitrah.\" Then he said: \"I bear witness that none has the right to be worshipped but Allah.\" So he said: \"You have departed from the Fire.\"","reference":"Jami` at-Tirmidhi 1618, Book 21, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the declaration of faith relate to salvation from the Fire in Islamic belief?","id":"tirmidhi-21-353"},{"hadith-eng":"\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"","reference":"Jami` at-Tirmidhi 1548, Book 21, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #6","question":"What was the outcome of the siege led by Salman Al-Farisi after his diplomatic efforts?","id":"tirmidhi-21-354"},{"hadith-eng":"That the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.[Abu 'Eisa said:] This Hadith is Hasan Sahih.The paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)This is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.Al-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"Ishaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"","reference":"Jami` at-Tirmidhi 1568, Book 21, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #6","question":"How do the views of different scholars, like Ahmad and Ishaq, vary on the issue of dealing with captives?","id":"tirmidhi-21-355"},{"hadith-eng":"\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.","reference":"Jami` at-Tirmidhi 1574, Book 21, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does this narration illustrate the criteria for entering paradise in Islam?","id":"tirmidhi-21-356"},{"hadith-eng":"\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1582, Book 21, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #6","question":"What was the significance of Sa'd bin Mu'adh's injury in the context of the battle of Al-Ahzab?","id":"tirmidhi-21-357"},{"hadith-eng":"From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith","reference":"Jami` at-Tirmidhi 1617, Book 21, Hadith 80","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the role of Taqwa in leadership and military conduct in Islam?","id":"tirmidhi-21-358"}]