[{"hadith-eng":"\"It was said, 'O Messenger of Allah, what equals Jihad?' He said: 'Verily, you (people) are not capable of it.' So they repeated it to him two or three times, each time he said, 'You (people) are not capable of it.' Then he said the third time: 'The example of the Mujahid in the path of Allah is like the one who fasts and stands (in prayer) and does not slacken from Salat, nor fasting, until the Mujahid in the cause of Allah returns.'\"There are narrations on this topic from Ash-Shifa', 'Abdullah bin Hubshi, Abu Musa', Abu Sa'eed, Umm Malik Al-Bahziyyah, and Anas.This Hadith is a Hasan Sahih. And it has been reported through more than one route from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1619, Book 22, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Jihad in Islam compared to other acts of worship?","id":"tirmidhi-22-1"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: meaning: Allah Mighty and Sublime is He says: 'The Mujahid in My cause, he has guarantee fro Me. If I I seize him, I cause him to inherit Paradise, and if I return him, I return him with a reward or spoils of war.'\"[He said:] This Hadith is Gharib Sahih from this route.","reference":"Jami` at-Tirmidhi 1620, Book 22, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of a Mujahid in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-2"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The deeds of everyone who dies are sealed. Except for the one who dies guarding the frontier from the enemy, in the cause of Allah. For indeed his actions are increased for him until the Day of Judgement, and he is secure from the tribulation of the grave.\" And I heard the Messenger of Allah (ﷺ) saying: \"The Mujahid is one who strives against his own soul.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uqbah bin 'Amir and Jabir.The Hadith is Fadalah is a Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1621, Book 22, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of deeds being sealed upon death in Islamic teachings?","id":"tirmidhi-22-3"},{"hadith-eng":"From 'Urwah [bin Az-Zubair], and Sulaiman bin Yasar, that they reported to him from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. Abu Al-Aswad's name is Muhammad bin 'Abdur-Rahman bin Nawfal Al-Asadi Al-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbah bin 'Amir, and Abu Umamah","reference":"Jami` at-Tirmidhi 1622, Book 22, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of fasting in the cause of Allah in Islamic teachings?","id":"tirmidhi-22-4"},{"hadith-eng":"That the Prophet (ﷺ) said: \"A worshipper does not fast a day in the cause of Allah except that, that day (of fasting) distances the Fire from his face by seventy autumns.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1623, Book 22, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fasting in the cause of Allah in Islam?","id":"tirmidhi-22-5"},{"hadith-eng":"That the Prophet (ﷺ) said, \"Whoever fasts a day in the cause of Allah, Allah shall put between him and the Fire a trench whose distance is like that between the heavens and the earth.\"This Hadith is Gharib as a narration of Abu Umamah.","reference":"Jami` at-Tirmidhi 1624, Book 22, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of fasting in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-6"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)","reference":"Jami` at-Tirmidhi 1625, Book 22, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of spending in the cause of Allah in Islam?","id":"tirmidhi-22-7"},{"hadith-eng":"That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1626, Book 22, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are some of the most virtuous forms of charity in Islam?","id":"tirmidhi-22-8"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The most virtuous of charitable spending is the shade of a tent in the cause of Allah, or giving a servant in the cause of Allah, or a riding camel in the cause of Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih, and it is more correct to me than the narration of Mu'awiyah bin Salih.","reference":"Jami` at-Tirmidhi 1627, Book 22, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are some of the most virtuous forms of charitable spending in Islam?","id":"tirmidhi-22-9"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever looks after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through more than one route.","reference":"Jami` at-Tirmidhi 1628, Book 22, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of supporting a fighter in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-10"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, or looks after the family of a fighter, then he has participated in a military expedition.\"[Abu 'Eisa said:]  This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1629, Book 22, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of supporting a fighter in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-11"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever watches after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1631, Book 22, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of supporting a fighter in Allah's cause according to Islamic teachings?","id":"tirmidhi-22-12"},{"hadith-eng":"\"Abayah bin Rifa'ah bin Rafi' met me while I was walking to the Friday prayer. He said: 'Have glad tidings, for indeed these footsteps of yours are in the cause of Allah. I heard Abu 'Abs say: \"The Messenger of Allah (ﷺ) said, 'Whoever get his two feet dusty in the path of Allah, then they are prohibited for the Fire.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Abu 'Abs's name is 'Abdur-Rahman bin Jabr. There are narrations on this topic from Abu Bkar and a man from the Companions of the Prophet (ﷺ).He said: Yazid bin Abi Maryam is a man from Ash-Sham. Al-Walid bin Muslim, Yahya bin Hamzah, and some others among the people of Ash-Sham report from him.Buraid bin Abi Maryam is form Al-Kufah. His father is one of the Companions of the Prophet (ﷺ) whose name was Malik bin Rabi'ah. [Buraid bin Abi Maryam heard from Anas bin Malik. Abu Ishaq Al-Hamdani, 'Ata bin As-Sa'ib, Yunus bin Abi Ishaq, and Shu'bah reported Ahadith from Buraid bin Abi Maryam].","reference":"Jami` at-Tirmidhi 1632, Book 22, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of walking to Friday prayer in Islam?","id":"tirmidhi-22-13"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.","reference":"Jami` at-Tirmidhi 1633, Book 22, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of weeping out of the fear of Allah in Islam?","id":"tirmidhi-22-14"},{"hadith-eng":"\"O Ka'b bin Murrah! Relate (something) to is from the Messenger of Allah (ﷺ), and be cautious. He said: 'I heard the Prophet (ﷺ) say: \"Whoever develops some gray hair in Islam, it shall be a light from him on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from Fadalah bin 'Ubaid and 'Abdullah bin 'Amr. The narration of Ka'b bin Murrah was reported like this from Al-A'mash, from 'Amr bin Murrah.This Hadith is been reported from Mansur, from Salim bin Abu Al-Ja'd, and he included a man between him and between Ka'b bin Murrah in the chain. He is called: \"Ka'b bin Murrah,\" and he is called: \"Murrah bin Ka'b Al-Bahzi,\" and the one known among the Companions of the Prophet (ﷺ) is Ka'b bin Murrah Al-Bahzi, he reported some Ahadith from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1634, Book 22, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #1","question":"What significance does developing gray hair have in Islam according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-22-15"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.","reference":"Jami` at-Tirmidhi 1635, Book 22, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of developing gray hair in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-16"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The forelocks of horses contain good until the Day of Judgement. The horse is for three (purposes): It is for one man a reward, and it is for one man a shelter (from poverty), and it is from one man a burden. As for the one who acquires it for the cause of Allah and then prepares it for that; it is for him a reward, nothing disappears into its stomach except that Allah writes it for him as a reward.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas narrated similar to this Hadith from Zaid bin Aslam from Abu Salih from Abu Hurairah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1636, Book 22, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different purposes for which a horse can be acquired according to Islamic teachings?","id":"tirmidhi-22-17"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"","reference":"Jami` at-Tirmidhi 1637, Book 22, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the three roles associated with an arrow that can lead to admission into Paradise?","id":"tirmidhi-22-18"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: \"Whoever shoots an arrow in the cause of Allah, then he has the reward of freeing a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Najih is 'Amr bin 'Abasah As-Sulami, and 'Abdullah bin Al-Azraq is 'Abdullah bin Zaid.","reference":"Jami` at-Tirmidhi 1638, Book 22, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of shooting an arrow in the cause of Allah in terms of reward?","id":"tirmidhi-22-19"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying, 'There are two eyes that shall not be touched by the Fire: An eye that wept from the fear of Allah, and an eye that spent the night standing on guard in the cause of Allah.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uthman and Abu Raihanah.The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it except through the narration of Shu'aib bin Ruzaiq.","reference":"Jami` at-Tirmidhi 1639, Book 22, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the two types of eyes mentioned that will be protected from the Fire?","id":"tirmidhi-22-20"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Dying in the cause of Allah expiates every sin.\" Jibril said: \"Except for debt.\" So the Messenger of Allah (ﷺ) said: \"Except the debt.\"[Abu 'Eisa said:] There are narrations on this topic from Ka'b bin 'Ujrah, Jabir, Abu Hurairah, and Abu Qatadah. This Hadith is Gharib, we do not know of it as a Hadith of Abu Bakr (a narrator) except from this Shaikh (Yahya bin Talhah)He said: I asked Muhammad bin Isma'il about this Hadith and he did not know it. He said: \"I think that he intended the Hadith of Humaid, from Anas, from the Prophet (ﷺ) that he said: 'There is none from the people of Paradise who would like to return to the world except for the martyr.'\"","reference":"Jami` at-Tirmidhi 1640, Book 22, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of martyrdom in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-22-21"},{"hadith-eng":"From his father that the Messenger of Allah (ﷺ) said: \"The souls of the martyrs are in green birds, suspended from the fruit of Paradise, or the trees of Paradise.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1641, Book 22, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the souls of martyrs in Islamic belief?","id":"tirmidhi-22-22"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1642, Book 22, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who are the first three types of people to enter Paradise according to Islamic teachings?","id":"tirmidhi-22-23"},{"hadith-eng":"That the Prophet (ﷺ), \"There is no person who dies having good (prepared for him) with Allah, who wishes to return to the world, and to have the world and all it contains, except for the martyr because of what he knows about the virtue of martyrdom. For, indeed he loves to return to the world so that he may be killed another time.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.Ibn 'Umar said: \"Sufyan bin 'Uyainah said: \"Amr bin Dinar was older than Az-Zuhri.'\"","reference":"Jami` at-Tirmidhi 1643, Book 22, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of martyrdom in Islam according to the teachings of the Prophet?","id":"tirmidhi-22-24"},{"hadith-eng":"That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"","reference":"Jami` at-Tirmidhi 1644, Book 22, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the different levels of martyrdom mentioned in Islamic teachings?","id":"tirmidhi-22-25"},{"hadith-eng":"That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.","reference":"Jami` at-Tirmidhi 1645, Book 22, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the dream of the Prophet Muhammad (ﷺ) hold in Islamic teachings?","id":"tirmidhi-22-26"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about a man who fights out of bravery, one who fights out of protection (for himself or others), and one who fought to be seen. Which of them is in the cause of Allah ? He said: 'Whoever fought so that the Word of Allah is supreme, then he is in Allah's cause.'\"[Abu 'Eisa said:] There is something on this topic from 'Umar. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1646, Book 22, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different motivations for fighting mentioned in the hadith?","id":"tirmidhi-22-27"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Deeds are but with intentions, and for the man is only what he intended. So one whose emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And one whose emigration was to the world, to attain some of it, or woman, to marry her, then his emigration was to what he emigrated.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas, Sufyan Ath-Thawri and more than one of the A'immah narrated this Hadith from Yahya bin Sa'eed. And we do not know of it except as a narration from Yahya bin Sa'eed Al-Ansari. 'Abdur Rahman bin Mahdi said: \"It is necessary that we put this Hadith in every chapter.\"","reference":"Jami` at-Tirmidhi 1647, Book 22, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of intentions in determining the value of deeds in Islam?","id":"tirmidhi-22-28"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Going out in the morning in the cause of Allah is better that the world and what is in it. And the place (the size) of a whip in Paradise is better than the world and what is in it.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Ibn 'Abbas, Abu Ayyub, and Anas.This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1648, Book 22, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of striving in the cause of Allah compared to worldly possessions?","id":"tirmidhi-22-29"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.","reference":"Jami` at-Tirmidhi 1649, Book 22, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of going out in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-30"},{"hadith-eng":"A man from the Companions of the Prophet (ﷺ) passed by ravine containing a small spring of thirst quenching water, so he was amazed by how pleasant it was. So he said: 'I should leave the people and stay in this ravine. But I will not do it until I seek permission from the Messenger of Allah (ﷺ).' So he mentioned that to the Messenger of Allah (ﷺ) and he said: 'Do not do so. For indeed one of you standing in the cause of Allah is more virtuous that his Salat in his house for seventy years. Do you not love that Allah forgive your sins and admit you into Paradise ? Then fight in the cause of Allah, for whoever fights in Allah's cause for the time it takes for two milkings of a camel, then Paradise is obligatory for him.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1650, Book 22, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission from the Prophet before making personal decisions?","id":"tirmidhi-22-31"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"To go out in the cause of Allah in the morning, or the afternoon, is better than the world and what is in it. And the space that a bow of one of you - or the space that his hand - would occupy in Paradise is better than the world and what is in it. And if a woman among the women inhabiting Paradise were to appear to the people of the earth, then she would illuminate what is between the ( the heavens and the earth), and a pleasant scent would fill up what is between them, and the scarf on her head is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1651, Book 22, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of going out in the cause of Allah compared to worldly possessions?","id":"tirmidhi-22-32"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Shall I not inform you of the best of the people ? A man who takes hold of the reins of his horse in Allah's cause. Shall I not inform you of the one who comes after him ? The man who secludes himself from the people with a small group of sheep of his, thereby fulfilling Allah's right. Shall I not inform you about the worst of the people ? A man who is asked by (the Name of) Allah, but not given by Him.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. This Hadith has been reported through other routes from Ibn 'Abbas, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1652, Book 22, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who is considered the best among people according to the teachings of Islam?","id":"tirmidhi-22-33"},{"hadith-eng":"From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.","reference":"Jami` at-Tirmidhi 1653, Book 22, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of sincerely asking Allah for martyrdom in Islam?","id":"tirmidhi-22-34"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever asks Allah to be killed in His cause sincerely from his heart, Allah shall give him the reward of martyrdom.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1654, Book 22, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of asking Allah for martyrdom with sincerity in one's heart?","id":"tirmidhi-22-35"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are three for whom it is a right upon Allah to help him: The Mujahid in the cause of Allah, the Mukatab who intends to fulfill (the Kitabah), and the one getting married who intends chastity.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1655, Book 22, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who are the three individuals for whom Allah has promised His help?","id":"tirmidhi-22-36"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None is wounded in Allah's cause - and Allah knows better about who has been injured in His cause - except that he will come on the Day of Resurrection with his wound the color of blood but its scent will be the scent of musk.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported through other routes from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1656, Book 22, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of being wounded in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-37"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever fought in the cause of Allah - a Muslim man - for the time it takes for two milkings of a camel, then Paradise is obligatory for him. And whoever suffered a wound in the cause of Allah, or he suffers from an injury, then he will come on the Day of Resurrection while (his blood will be) more copius that it ever was, its color the color of saffron, and its scent like that of musk.\"This Hadith is Sahih.","reference":"Jami` at-Tirmidhi 1657, Book 22, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of fighting in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-38"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1658, Book 22, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is considered the most virtuous deed in Islam according to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-22-39"},{"hadith-eng":"\"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"","reference":"Jami` at-Tirmidhi 1659, Book 22, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the phrase 'the gates of Paradise are under the shadows of the swords' in Islamic teachings?","id":"tirmidhi-22-40"},{"hadith-eng":"that the Messenger of Allah (ﷺ) was asked: \"Which of the people are most virtuous?\" He said: \"A man who take part in Jihad in Allah's cause.\" They said: \"Then whom?\" He said: \"Then a believer who stays in one of the mountains path out of Taqwa for his Lord, leaving the people secure from his evil.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1660, Book 22, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who are considered the most virtuous people according to Islamic teachings?","id":"tirmidhi-22-41"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None of the people of Paradise would wish to return to the world except for the martyr who indeed would love to return to the world saying that he would love to be killed ten times in Allah's cause because of what he has seen of the honor that He has given him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1661, Book 22, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of martyrdom in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-22-42"},{"hadith-eng":"] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1662, Book 22, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a hadith being classified as Hasan Sahih?","id":"tirmidhi-22-43"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1663, Book 22, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the rewards promised to a martyr according to Islamic teachings?","id":"tirmidhi-22-44"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"(Ribat) Guarding the frontier for a day in the cause of Allah is better than the world and what is in it. And an afternoon the worshipper spends in the cause of Allah - or a morning - is better than the world and what is on it. And the space occupied by the whip of one of you in Paradise is better than the world and what is on it.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1664, Book 22, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of guarding the frontier in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-45"},{"hadith-eng":"\"Salman Al-Farisi passed by Shurahbil bin As-Simt while he was in garrison in which he and his companions were suffering from difficulties. He said to him: 'Shall I narrate to you - O Ibn As-Simt - a Hadith I heard from the Messenger of Allah (ﷺ) ?' He said: 'Of course.' He said: 'I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in the cause of Allah is more virtuous\" - and perhaps he said: \"better, than fasting a month and standing (in prayer) for it. And whoever dies in it, he is protected from the trials of the grave, and his deeds (continuously) multiplied until the Day of Resurrection.[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1665, Book 22, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of guarding the frontier in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-46"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1666, Book 22, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of participating in Jihad according to Islamic teachings?","id":"tirmidhi-22-47"},{"hadith-eng":"\"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"","reference":"Jami` at-Tirmidhi 1667, Book 22, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of guarding the frontier in the path of Allah compared to other deeds?","id":"tirmidhi-22-48"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The martyr does not sense the touch of death except as one of you senses the touch of a (bug) bite.[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1668, Book 22, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the experience of death like for a martyr according to Islamic teachings?","id":"tirmidhi-22-49"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.","reference":"Jami` at-Tirmidhi 1669, Book 22, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the two drops that are most beloved to Allah according to Islamic teachings?","id":"tirmidhi-22-50"},{"hadith-eng":"\"It was said, 'O Messenger of Allah, what equals Jihad?' He said: 'Verily, you (people) are not capable of it.' So they repeated it to him two or three times, each time he said, 'You (people) are not capable of it.' Then he said the third time: 'The example of the Mujahid in the path of Allah is like the one who fasts and stands (in prayer) and does not slacken from Salat, nor fasting, until the Mujahid in the cause of Allah returns.'\"There are narrations on this topic from Ash-Shifa', 'Abdullah bin Hubshi, Abu Musa', Abu Sa'eed, Umm Malik Al-Bahziyyah, and Anas.This Hadith is a Hasan Sahih. And it has been reported through more than one route from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1619, Book 22, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) emphasize the difficulty of equating other deeds with Jihad?","id":"tirmidhi-22-51"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: meaning: Allah Mighty and Sublime is He says: 'The Mujahid in My cause, he has guarantee fro Me. If I I seize him, I cause him to inherit Paradise, and if I return him, I return him with a reward or spoils of war.'\"[He said:] This Hadith is Gharib Sahih from this route.","reference":"Jami` at-Tirmidhi 1620, Book 22, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the potential outcomes for a Mujahid as mentioned in Islamic tradition?","id":"tirmidhi-22-52"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The deeds of everyone who dies are sealed. Except for the one who dies guarding the frontier from the enemy, in the cause of Allah. For indeed his actions are increased for him until the Day of Judgement, and he is secure from the tribulation of the grave.\" And I heard the Messenger of Allah (ﷺ) saying: \"The Mujahid is one who strives against his own soul.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uqbah bin 'Amir and Jabir.The Hadith is Fadalah is a Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1621, Book 22, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are the actions of someone who dies guarding the frontier in the cause of Allah treated differently from others?","id":"tirmidhi-22-53"},{"hadith-eng":"From 'Urwah [bin Az-Zubair], and Sulaiman bin Yasar, that they reported to him from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. Abu Al-Aswad's name is Muhammad bin 'Abdur-Rahman bin Nawfal Al-Asadi Al-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbah bin 'Amir, and Abu Umamah","reference":"Jami` at-Tirmidhi 1622, Book 22, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does fasting impact one's distance from the Fire according to Islamic beliefs?","id":"tirmidhi-22-54"},{"hadith-eng":"That the Prophet (ﷺ) said: \"A worshipper does not fast a day in the cause of Allah except that, that day (of fasting) distances the Fire from his face by seventy autumns.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1623, Book 22, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does fasting impact a believer's protection from the Fire according to Islamic teachings?","id":"tirmidhi-22-55"},{"hadith-eng":"That the Prophet (ﷺ) said, \"Whoever fasts a day in the cause of Allah, Allah shall put between him and the Fire a trench whose distance is like that between the heavens and the earth.\"This Hadith is Gharib as a narration of Abu Umamah.","reference":"Jami` at-Tirmidhi 1624, Book 22, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does fasting serve as a protection against the Fire in Islamic belief?","id":"tirmidhi-22-56"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)","reference":"Jami` at-Tirmidhi 1625, Book 22, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the reward for spending in the cause of Allah quantified according to Islamic teachings?","id":"tirmidhi-22-57"},{"hadith-eng":"That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1626, Book 22, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #2","question":"How can serving in the cause of Allah be considered a form of charity?","id":"tirmidhi-22-58"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The most virtuous of charitable spending is the shade of a tent in the cause of Allah, or giving a servant in the cause of Allah, or a riding camel in the cause of Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih, and it is more correct to me than the narration of Mu'awiyah bin Salih.","reference":"Jami` at-Tirmidhi 1627, Book 22, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #2","question":"How can providing a tent be considered a form of charity in the cause of Allah?","id":"tirmidhi-22-59"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever looks after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through more than one route.","reference":"Jami` at-Tirmidhi 1628, Book 22, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is participating in a military expedition defined in terms of supporting a fighter's family?","id":"tirmidhi-22-60"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, or looks after the family of a fighter, then he has participated in a military expedition.\"[Abu 'Eisa said:]  This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1629, Book 22, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is participating in a military expedition defined in terms of supporting a fighter or their family?","id":"tirmidhi-22-61"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever watches after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1631, Book 22, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is participating in a military expedition defined in terms of supporting a fighter's family?","id":"tirmidhi-22-62"},{"hadith-eng":"\"Abayah bin Rifa'ah bin Rafi' met me while I was walking to the Friday prayer. He said: 'Have glad tidings, for indeed these footsteps of yours are in the cause of Allah. I heard Abu 'Abs say: \"The Messenger of Allah (ﷺ) said, 'Whoever get his two feet dusty in the path of Allah, then they are prohibited for the Fire.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Abu 'Abs's name is 'Abdur-Rahman bin Jabr. There are narrations on this topic from Abu Bkar and a man from the Companions of the Prophet (ﷺ).He said: Yazid bin Abi Maryam is a man from Ash-Sham. Al-Walid bin Muslim, Yahya bin Hamzah, and some others among the people of Ash-Sham report from him.Buraid bin Abi Maryam is form Al-Kufah. His father is one of the Companions of the Prophet (ﷺ) whose name was Malik bin Rabi'ah. [Buraid bin Abi Maryam heard from Anas bin Malik. Abu Ishaq Al-Hamdani, 'Ata bin As-Sa'ib, Yunus bin Abi Ishaq, and Shu'bah reported Ahadith from Buraid bin Abi Maryam].","reference":"Jami` at-Tirmidhi 1632, Book 22, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does participating in the path of Allah protect one from the Fire?","id":"tirmidhi-22-63"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.","reference":"Jami` at-Tirmidhi 1633, Book 22, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the metaphor of milk returning to the udder relate to the concept of entering the Fire?","id":"tirmidhi-22-64"},{"hadith-eng":"\"O Ka'b bin Murrah! Relate (something) to is from the Messenger of Allah (ﷺ), and be cautious. He said: 'I heard the Prophet (ﷺ) say: \"Whoever develops some gray hair in Islam, it shall be a light from him on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from Fadalah bin 'Ubaid and 'Abdullah bin 'Amr. The narration of Ka'b bin Murrah was reported like this from Al-A'mash, from 'Amr bin Murrah.This Hadith is been reported from Mansur, from Salim bin Abu Al-Ja'd, and he included a man between him and between Ka'b bin Murrah in the chain. He is called: \"Ka'b bin Murrah,\" and he is called: \"Murrah bin Ka'b Al-Bahzi,\" and the one known among the Companions of the Prophet (ﷺ) is Ka'b bin Murrah Al-Bahzi, he reported some Ahadith from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1634, Book 22, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is gray hair perceived in the context of the Day of Judgement in Islamic teachings?","id":"tirmidhi-22-65"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.","reference":"Jami` at-Tirmidhi 1635, Book 22, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is gray hair perceived in the context of one's efforts in the path of Allah?","id":"tirmidhi-22-66"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The forelocks of horses contain good until the Day of Judgement. The horse is for three (purposes): It is for one man a reward, and it is for one man a shelter (from poverty), and it is from one man a burden. As for the one who acquires it for the cause of Allah and then prepares it for that; it is for him a reward, nothing disappears into its stomach except that Allah writes it for him as a reward.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas narrated similar to this Hadith from Zaid bin Aslam from Abu Salih from Abu Hurairah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1636, Book 22, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is acquiring a horse for the cause of Allah considered a reward?","id":"tirmidhi-22-67"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"","reference":"Jami` at-Tirmidhi 1637, Book 22, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is practicing archery considered more beloved than riding according to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-22-68"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: \"Whoever shoots an arrow in the cause of Allah, then he has the reward of freeing a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Najih is 'Amr bin 'Abasah As-Sulami, and 'Abdullah bin Al-Azraq is 'Abdullah bin Zaid.","reference":"Jami` at-Tirmidhi 1638, Book 22, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the reward for shooting an arrow in the cause of Allah compared to freeing a slave?","id":"tirmidhi-22-69"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying, 'There are two eyes that shall not be touched by the Fire: An eye that wept from the fear of Allah, and an eye that spent the night standing on guard in the cause of Allah.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uthman and Abu Raihanah.The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it except through the narration of Shu'aib bin Ruzaiq.","reference":"Jami` at-Tirmidhi 1639, Book 22, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does fear of Allah influence a person's actions according to Islamic teachings?","id":"tirmidhi-22-70"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Dying in the cause of Allah expiates every sin.\" Jibril said: \"Except for debt.\" So the Messenger of Allah (ﷺ) said: \"Except the debt.\"[Abu 'Eisa said:] There are narrations on this topic from Ka'b bin 'Ujrah, Jabir, Abu Hurairah, and Abu Qatadah. This Hadith is Gharib, we do not know of it as a Hadith of Abu Bakr (a narrator) except from this Shaikh (Yahya bin Talhah)He said: I asked Muhammad bin Isma'il about this Hadith and he did not know it. He said: \"I think that he intended the Hadith of Humaid, from Anas, from the Prophet (ﷺ) that he said: 'There is none from the people of Paradise who would like to return to the world except for the martyr.'\"","reference":"Jami` at-Tirmidhi 1640, Book 22, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does dying in the cause of Allah affect a person's sins?","id":"tirmidhi-22-71"},{"hadith-eng":"From his father that the Messenger of Allah (ﷺ) said: \"The souls of the martyrs are in green birds, suspended from the fruit of Paradise, or the trees of Paradise.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1641, Book 22, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #2","question":"How are the souls of martyrs described in relation to Paradise?","id":"tirmidhi-22-72"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1642, Book 22, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #2","question":"What qualities are associated with a martyr in the context of entering Paradise?","id":"tirmidhi-22-73"},{"hadith-eng":"That the Prophet (ﷺ), \"There is no person who dies having good (prepared for him) with Allah, who wishes to return to the world, and to have the world and all it contains, except for the martyr because of what he knows about the virtue of martyrdom. For, indeed he loves to return to the world so that he may be killed another time.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.Ibn 'Umar said: \"Sufyan bin 'Uyainah said: \"Amr bin Dinar was older than Az-Zuhri.'\"","reference":"Jami` at-Tirmidhi 1643, Book 22, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might a martyr wish to return to the world despite having good prepared for them with Allah?","id":"tirmidhi-22-74"},{"hadith-eng":"That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"","reference":"Jami` at-Tirmidhi 1644, Book 22, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does faith influence the status of a martyr in Islam?","id":"tirmidhi-22-75"},{"hadith-eng":"That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.","reference":"Jami` at-Tirmidhi 1645, Book 22, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to Umm Haram's request to be among those who fight in Allah's cause?","id":"tirmidhi-22-76"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about a man who fights out of bravery, one who fights out of protection (for himself or others), and one who fought to be seen. Which of them is in the cause of Allah ? He said: 'Whoever fought so that the Word of Allah is supreme, then he is in Allah's cause.'\"[Abu 'Eisa said:] There is something on this topic from 'Umar. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1646, Book 22, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the intention behind fighting determine whether it is in the cause of Allah?","id":"tirmidhi-22-77"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Deeds are but with intentions, and for the man is only what he intended. So one whose emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And one whose emigration was to the world, to attain some of it, or woman, to marry her, then his emigration was to what he emigrated.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas, Sufyan Ath-Thawri and more than one of the A'immah narrated this Hadith from Yahya bin Sa'eed. And we do not know of it except as a narration from Yahya bin Sa'eed Al-Ansari. 'Abdur Rahman bin Mahdi said: \"It is necessary that we put this Hadith in every chapter.\"","reference":"Jami` at-Tirmidhi 1647, Book 22, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the intention behind an action affect its outcome according to Islamic teachings?","id":"tirmidhi-22-78"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Going out in the morning in the cause of Allah is better that the world and what is in it. And the place (the size) of a whip in Paradise is better than the world and what is in it.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Ibn 'Abbas, Abu Ayyub, and Anas.This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1648, Book 22, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the value of a small place in Paradise compare to the entire world and its contents?","id":"tirmidhi-22-79"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.","reference":"Jami` at-Tirmidhi 1649, Book 22, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the value of participating in the cause of Allah compare to worldly possessions?","id":"tirmidhi-22-80"},{"hadith-eng":"A man from the Companions of the Prophet (ﷺ) passed by ravine containing a small spring of thirst quenching water, so he was amazed by how pleasant it was. So he said: 'I should leave the people and stay in this ravine. But I will not do it until I seek permission from the Messenger of Allah (ﷺ).' So he mentioned that to the Messenger of Allah (ﷺ) and he said: 'Do not do so. For indeed one of you standing in the cause of Allah is more virtuous that his Salat in his house for seventy years. Do you not love that Allah forgive your sins and admit you into Paradise ? Then fight in the cause of Allah, for whoever fights in Allah's cause for the time it takes for two milkings of a camel, then Paradise is obligatory for him.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1650, Book 22, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does standing in the cause of Allah compare to performing Salat at home in terms of virtue?","id":"tirmidhi-22-81"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"To go out in the cause of Allah in the morning, or the afternoon, is better than the world and what is in it. And the space that a bow of one of you - or the space that his hand - would occupy in Paradise is better than the world and what is in it. And if a woman among the women inhabiting Paradise were to appear to the people of the earth, then she would illuminate what is between the ( the heavens and the earth), and a pleasant scent would fill up what is between them, and the scarf on her head is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1651, Book 22, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the value of a small space in Paradise described in comparison to the world?","id":"tirmidhi-22-82"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Shall I not inform you of the best of the people ? A man who takes hold of the reins of his horse in Allah's cause. Shall I not inform you of the one who comes after him ? The man who secludes himself from the people with a small group of sheep of his, thereby fulfilling Allah's right. Shall I not inform you about the worst of the people ? A man who is asked by (the Name of) Allah, but not given by Him.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. This Hadith has been reported through other routes from Ibn 'Abbas, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1652, Book 22, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #2","question":"What qualities make a person among the best in the sight of Allah?","id":"tirmidhi-22-83"},{"hadith-eng":"From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.","reference":"Jami` at-Tirmidhi 1653, Book 22, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does one's intention affect their spiritual status in the eyes of Allah?","id":"tirmidhi-22-84"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever asks Allah to be killed in His cause sincerely from his heart, Allah shall give him the reward of martyrdom.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1654, Book 22, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does sincerity in intention affect the reward of martyrdom in Islam?","id":"tirmidhi-22-85"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are three for whom it is a right upon Allah to help him: The Mujahid in the cause of Allah, the Mukatab who intends to fulfill (the Kitabah), and the one getting married who intends chastity.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1655, Book 22, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of striving in the cause of Allah in Islam?","id":"tirmidhi-22-86"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None is wounded in Allah's cause - and Allah knows better about who has been injured in His cause - except that he will come on the Day of Resurrection with his wound the color of blood but its scent will be the scent of musk.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported through other routes from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1656, Book 22, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Day of Resurrection relate to the wounds sustained in the cause of Allah?","id":"tirmidhi-22-87"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever fought in the cause of Allah - a Muslim man - for the time it takes for two milkings of a camel, then Paradise is obligatory for him. And whoever suffered a wound in the cause of Allah, or he suffers from an injury, then he will come on the Day of Resurrection while (his blood will be) more copius that it ever was, its color the color of saffron, and its scent like that of musk.\"This Hadith is Sahih.","reference":"Jami` at-Tirmidhi 1657, Book 22, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #2","question":"What reward is promised for those who fight in the cause of Allah, even for a short duration?","id":"tirmidhi-22-88"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1658, Book 22, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is faith in Allah and His Messenger ranked among good deeds?","id":"tirmidhi-22-89"},{"hadith-eng":"\"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"","reference":"Jami` at-Tirmidhi 1659, Book 22, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of martyrdom relate to the actions of the man with a ragged appearance in the narration?","id":"tirmidhi-22-90"},{"hadith-eng":"that the Messenger of Allah (ﷺ) was asked: \"Which of the people are most virtuous?\" He said: \"A man who take part in Jihad in Allah's cause.\" They said: \"Then whom?\" He said: \"Then a believer who stays in one of the mountains path out of Taqwa for his Lord, leaving the people secure from his evil.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1660, Book 22, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of participating in Jihad in the cause of Allah?","id":"tirmidhi-22-91"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None of the people of Paradise would wish to return to the world except for the martyr who indeed would love to return to the world saying that he would love to be killed ten times in Allah's cause because of what he has seen of the honor that He has given him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1661, Book 22, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might a martyr desire to return to the world despite being in Paradise?","id":"tirmidhi-22-92"},{"hadith-eng":"] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1662, Book 22, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the classification of a hadith affect its acceptance and application in Islamic teachings?","id":"tirmidhi-22-93"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1663, Book 22, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does martyrdom affect one's status in the afterlife in Islam?","id":"tirmidhi-22-94"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"(Ribat) Guarding the frontier for a day in the cause of Allah is better than the world and what is in it. And an afternoon the worshipper spends in the cause of Allah - or a morning - is better than the world and what is on it. And the space occupied by the whip of one of you in Paradise is better than the world and what is on it.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1664, Book 22, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the value of time spent in the cause of Allah compare to worldly possessions?","id":"tirmidhi-22-95"},{"hadith-eng":"\"Salman Al-Farisi passed by Shurahbil bin As-Simt while he was in garrison in which he and his companions were suffering from difficulties. He said to him: 'Shall I narrate to you - O Ibn As-Simt - a Hadith I heard from the Messenger of Allah (ﷺ) ?' He said: 'Of course.' He said: 'I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in the cause of Allah is more virtuous\" - and perhaps he said: \"better, than fasting a month and standing (in prayer) for it. And whoever dies in it, he is protected from the trials of the grave, and his deeds (continuously) multiplied until the Day of Resurrection.[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1665, Book 22, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does guarding the frontier compare to fasting and prayer in terms of virtue?","id":"tirmidhi-22-96"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1666, Book 22, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is meeting Allah without traces of Jihad perceived in Islamic belief?","id":"tirmidhi-22-97"},{"hadith-eng":"\"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"","reference":"Jami` at-Tirmidhi 1667, Book 22, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might someone hesitate to share a hadith they have heard from the Prophet (ﷺ)?","id":"tirmidhi-22-98"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The martyr does not sense the touch of death except as one of you senses the touch of a (bug) bite.[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1668, Book 22, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the sensation of death for a martyr compared to everyday experiences?","id":"tirmidhi-22-99"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.","reference":"Jami` at-Tirmidhi 1669, Book 22, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #2","question":"What significance does shedding a teardrop out of fear of Allah hold in Islam?","id":"tirmidhi-22-100"},{"hadith-eng":"\"It was said, 'O Messenger of Allah, what equals Jihad?' He said: 'Verily, you (people) are not capable of it.' So they repeated it to him two or three times, each time he said, 'You (people) are not capable of it.' Then he said the third time: 'The example of the Mujahid in the path of Allah is like the one who fasts and stands (in prayer) and does not slacken from Salat, nor fasting, until the Mujahid in the cause of Allah returns.'\"There are narrations on this topic from Ash-Shifa', 'Abdullah bin Hubshi, Abu Musa', Abu Sa'eed, Umm Malik Al-Bahziyyah, and Anas.This Hadith is a Hasan Sahih. And it has been reported through more than one route from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1619, Book 22, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is the dedication of a Mujahid described in terms of prayer and fasting?","id":"tirmidhi-22-101"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: meaning: Allah Mighty and Sublime is He says: 'The Mujahid in My cause, he has guarantee fro Me. If I I seize him, I cause him to inherit Paradise, and if I return him, I return him with a reward or spoils of war.'\"[He said:] This Hadith is Gharib Sahih from this route.","reference":"Jami` at-Tirmidhi 1620, Book 22, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Allah reward those who strive in His cause?","id":"tirmidhi-22-102"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The deeds of everyone who dies are sealed. Except for the one who dies guarding the frontier from the enemy, in the cause of Allah. For indeed his actions are increased for him until the Day of Judgement, and he is secure from the tribulation of the grave.\" And I heard the Messenger of Allah (ﷺ) saying: \"The Mujahid is one who strives against his own soul.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uqbah bin 'Amir and Jabir.The Hadith is Fadalah is a Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1621, Book 22, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What benefits does a person who dies in the cause of Allah receive according to Islamic beliefs?","id":"tirmidhi-22-103"},{"hadith-eng":"From 'Urwah [bin Az-Zubair], and Sulaiman bin Yasar, that they reported to him from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. Abu Al-Aswad's name is Muhammad bin 'Abdur-Rahman bin Nawfal Al-Asadi Al-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbah bin 'Amir, and Abu Umamah","reference":"Jami` at-Tirmidhi 1622, Book 22, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the different narrations regarding the distance from the Fire achieved by fasting for Allah's cause?","id":"tirmidhi-22-104"},{"hadith-eng":"That the Prophet (ﷺ) said: \"A worshipper does not fast a day in the cause of Allah except that, that day (of fasting) distances the Fire from his face by seventy autumns.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1623, Book 22, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reward for fasting a single day for the sake of Allah?","id":"tirmidhi-22-105"},{"hadith-eng":"That the Prophet (ﷺ) said, \"Whoever fasts a day in the cause of Allah, Allah shall put between him and the Fire a trench whose distance is like that between the heavens and the earth.\"This Hadith is Gharib as a narration of Abu Umamah.","reference":"Jami` at-Tirmidhi 1624, Book 22, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #3","question":"What metaphor is used to describe the distance between a person who fasts for Allah and the Fire?","id":"tirmidhi-22-106"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)","reference":"Jami` at-Tirmidhi 1625, Book 22, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the concept of 'seven-hundred fold' reward imply in Islamic charity?","id":"tirmidhi-22-107"},{"hadith-eng":"That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1626, Book 22, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of providing shade or a mount in the cause of Allah?","id":"tirmidhi-22-108"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The most virtuous of charitable spending is the shade of a tent in the cause of Allah, or giving a servant in the cause of Allah, or a riding camel in the cause of Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih, and it is more correct to me than the narration of Mu'awiyah bin Salih.","reference":"Jami` at-Tirmidhi 1627, Book 22, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of giving a servant in the cause of Allah as a charitable act?","id":"tirmidhi-22-109"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever looks after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through more than one route.","reference":"Jami` at-Tirmidhi 1628, Book 22, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different ways one can contribute to a military expedition in Islam?","id":"tirmidhi-22-110"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, or looks after the family of a fighter, then he has participated in a military expedition.\"[Abu 'Eisa said:]  This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1629, Book 22, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What rewards are associated with looking after the family of a fighter in Islam?","id":"tirmidhi-22-111"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever watches after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1631, Book 22, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different ways one can earn the reward of participating in a military expedition?","id":"tirmidhi-22-112"},{"hadith-eng":"\"Abayah bin Rifa'ah bin Rafi' met me while I was walking to the Friday prayer. He said: 'Have glad tidings, for indeed these footsteps of yours are in the cause of Allah. I heard Abu 'Abs say: \"The Messenger of Allah (ﷺ) said, 'Whoever get his two feet dusty in the path of Allah, then they are prohibited for the Fire.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Abu 'Abs's name is 'Abdur-Rahman bin Jabr. There are narrations on this topic from Abu Bkar and a man from the Companions of the Prophet (ﷺ).He said: Yazid bin Abi Maryam is a man from Ash-Sham. Al-Walid bin Muslim, Yahya bin Hamzah, and some others among the people of Ash-Sham report from him.Buraid bin Abi Maryam is form Al-Kufah. His father is one of the Companions of the Prophet (ﷺ) whose name was Malik bin Rabi'ah. [Buraid bin Abi Maryam heard from Anas bin Malik. Abu Ishaq Al-Hamdani, 'Ata bin As-Sa'ib, Yunus bin Abi Ishaq, and Shu'bah reported Ahadith from Buraid bin Abi Maryam].","reference":"Jami` at-Tirmidhi 1632, Book 22, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reward for getting one's feet dusty in the cause of Allah?","id":"tirmidhi-22-113"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.","reference":"Jami` at-Tirmidhi 1633, Book 22, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the relationship between dust in the cause of Allah and protection from the smoke of Hell?","id":"tirmidhi-22-114"},{"hadith-eng":"\"O Ka'b bin Murrah! Relate (something) to is from the Messenger of Allah (ﷺ), and be cautious. He said: 'I heard the Prophet (ﷺ) say: \"Whoever develops some gray hair in Islam, it shall be a light from him on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from Fadalah bin 'Ubaid and 'Abdullah bin 'Amr. The narration of Ka'b bin Murrah was reported like this from Al-A'mash, from 'Amr bin Murrah.This Hadith is been reported from Mansur, from Salim bin Abu Al-Ja'd, and he included a man between him and between Ka'b bin Murrah in the chain. He is called: \"Ka'b bin Murrah,\" and he is called: \"Murrah bin Ka'b Al-Bahzi,\" and the one known among the Companions of the Prophet (ﷺ) is Ka'b bin Murrah Al-Bahzi, he reported some Ahadith from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1634, Book 22, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of narrating hadiths with caution and accuracy?","id":"tirmidhi-22-115"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.","reference":"Jami` at-Tirmidhi 1635, Book 22, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What reward is mentioned for those who develop gray hair while striving for Allah's cause?","id":"tirmidhi-22-116"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The forelocks of horses contain good until the Day of Judgement. The horse is for three (purposes): It is for one man a reward, and it is for one man a shelter (from poverty), and it is from one man a burden. As for the one who acquires it for the cause of Allah and then prepares it for that; it is for him a reward, nothing disappears into its stomach except that Allah writes it for him as a reward.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas narrated similar to this Hadith from Zaid bin Aslam from Abu Salih from Abu Hurairah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1636, Book 22, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance do horses hold until the Day of Judgement in Islam?","id":"tirmidhi-22-117"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"","reference":"Jami` at-Tirmidhi 1637, Book 22, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What activities are considered truthful and beneficial for a Muslim man according to this narration?","id":"tirmidhi-22-118"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: \"Whoever shoots an arrow in the cause of Allah, then he has the reward of freeing a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Najih is 'Amr bin 'Abasah As-Sulami, and 'Abdullah bin Al-Azraq is 'Abdullah bin Zaid.","reference":"Jami` at-Tirmidhi 1638, Book 22, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"Who is Abu Najih As-Sulami in the context of this narration?","id":"tirmidhi-22-119"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying, 'There are two eyes that shall not be touched by the Fire: An eye that wept from the fear of Allah, and an eye that spent the night standing on guard in the cause of Allah.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uthman and Abu Raihanah.The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it except through the narration of Shu'aib bin Ruzaiq.","reference":"Jami` at-Tirmidhi 1639, Book 22, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of standing guard in the cause of Allah in Islam?","id":"tirmidhi-22-120"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Dying in the cause of Allah expiates every sin.\" Jibril said: \"Except for debt.\" So the Messenger of Allah (ﷺ) said: \"Except the debt.\"[Abu 'Eisa said:] There are narrations on this topic from Ka'b bin 'Ujrah, Jabir, Abu Hurairah, and Abu Qatadah. This Hadith is Gharib, we do not know of it as a Hadith of Abu Bakr (a narrator) except from this Shaikh (Yahya bin Talhah)He said: I asked Muhammad bin Isma'il about this Hadith and he did not know it. He said: \"I think that he intended the Hadith of Humaid, from Anas, from the Prophet (ﷺ) that he said: 'There is none from the people of Paradise who would like to return to the world except for the martyr.'\"","reference":"Jami` at-Tirmidhi 1640, Book 22, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #3","question":"What exception did Jibril mention regarding the expiation of sins through martyrdom?","id":"tirmidhi-22-121"},{"hadith-eng":"From his father that the Messenger of Allah (ﷺ) said: \"The souls of the martyrs are in green birds, suspended from the fruit of Paradise, or the trees of Paradise.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1641, Book 22, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the symbolism of green birds in the context of martyrs' souls?","id":"tirmidhi-22-122"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1642, Book 22, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #3","question":"How is the concept of 'Atif and Muta'affif significant in Islamic teachings about Paradise?","id":"tirmidhi-22-123"},{"hadith-eng":"That the Prophet (ﷺ), \"There is no person who dies having good (prepared for him) with Allah, who wishes to return to the world, and to have the world and all it contains, except for the martyr because of what he knows about the virtue of martyrdom. For, indeed he loves to return to the world so that he may be killed another time.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.Ibn 'Umar said: \"Sufyan bin 'Uyainah said: \"Amr bin Dinar was older than Az-Zuhri.'\"","reference":"Jami` at-Tirmidhi 1643, Book 22, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of martyrdom reflect on the values and beliefs of a Muslim?","id":"tirmidhi-22-124"},{"hadith-eng":"That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"","reference":"Jami` at-Tirmidhi 1644, Book 22, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of bravery and faithfulness in achieving martyrdom?","id":"tirmidhi-22-125"},{"hadith-eng":"That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.","reference":"Jami` at-Tirmidhi 1645, Book 22, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did Umm Haram bint Milhan play in the early Islamic community?","id":"tirmidhi-22-126"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about a man who fights out of bravery, one who fights out of protection (for himself or others), and one who fought to be seen. Which of them is in the cause of Allah ? He said: 'Whoever fought so that the Word of Allah is supreme, then he is in Allah's cause.'\"[Abu 'Eisa said:] There is something on this topic from 'Umar. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1646, Book 22, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does it mean to fight so that the Word of Allah is supreme?","id":"tirmidhi-22-127"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Deeds are but with intentions, and for the man is only what he intended. So one whose emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And one whose emigration was to the world, to attain some of it, or woman, to marry her, then his emigration was to what he emigrated.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas, Sufyan Ath-Thawri and more than one of the A'immah narrated this Hadith from Yahya bin Sa'eed. And we do not know of it except as a narration from Yahya bin Sa'eed Al-Ansari. 'Abdur Rahman bin Mahdi said: \"It is necessary that we put this Hadith in every chapter.\"","reference":"Jami` at-Tirmidhi 1647, Book 22, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of having worldly intentions versus spiritual intentions in one's actions?","id":"tirmidhi-22-128"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Going out in the morning in the cause of Allah is better that the world and what is in it. And the place (the size) of a whip in Paradise is better than the world and what is in it.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Ibn 'Abbas, Abu Ayyub, and Anas.This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1648, Book 22, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the rewards mentioned for going out in the morning for the cause of Allah?","id":"tirmidhi-22-129"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.","reference":"Jami` at-Tirmidhi 1649, Book 22, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What times of the day are mentioned as significant for going out in the cause of Allah?","id":"tirmidhi-22-130"},{"hadith-eng":"A man from the Companions of the Prophet (ﷺ) passed by ravine containing a small spring of thirst quenching water, so he was amazed by how pleasant it was. So he said: 'I should leave the people and stay in this ravine. But I will not do it until I seek permission from the Messenger of Allah (ﷺ).' So he mentioned that to the Messenger of Allah (ﷺ) and he said: 'Do not do so. For indeed one of you standing in the cause of Allah is more virtuous that his Salat in his house for seventy years. Do you not love that Allah forgive your sins and admit you into Paradise ? Then fight in the cause of Allah, for whoever fights in Allah's cause for the time it takes for two milkings of a camel, then Paradise is obligatory for him.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1650, Book 22, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the benefits of fighting in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-131"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"To go out in the cause of Allah in the morning, or the afternoon, is better than the world and what is in it. And the space that a bow of one of you - or the space that his hand - would occupy in Paradise is better than the world and what is in it. And if a woman among the women inhabiting Paradise were to appear to the people of the earth, then she would illuminate what is between the ( the heavens and the earth), and a pleasant scent would fill up what is between them, and the scarf on her head is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1651, Book 22, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"What impact would a woman from Paradise have if she appeared to the people of the earth?","id":"tirmidhi-22-132"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Shall I not inform you of the best of the people ? A man who takes hold of the reins of his horse in Allah's cause. Shall I not inform you of the one who comes after him ? The man who secludes himself from the people with a small group of sheep of his, thereby fulfilling Allah's right. Shall I not inform you about the worst of the people ? A man who is asked by (the Name of) Allah, but not given by Him.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. This Hadith has been reported through other routes from Ibn 'Abbas, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1652, Book 22, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions are associated with fulfilling Allah's rights according to Islamic teachings?","id":"tirmidhi-22-133"},{"hadith-eng":"From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.","reference":"Jami` at-Tirmidhi 1653, Book 22, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration imply about the reward for sincere intentions even if the physical act is not achieved?","id":"tirmidhi-22-134"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever asks Allah to be killed in His cause sincerely from his heart, Allah shall give him the reward of martyrdom.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1654, Book 22, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reward for someone who sincerely desires to be martyred in the cause of Allah?","id":"tirmidhi-22-135"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are three for whom it is a right upon Allah to help him: The Mujahid in the cause of Allah, the Mukatab who intends to fulfill (the Kitabah), and the one getting married who intends chastity.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1655, Book 22, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does Islam view the intention of fulfilling a contract or agreement?","id":"tirmidhi-22-136"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None is wounded in Allah's cause - and Allah knows better about who has been injured in His cause - except that he will come on the Day of Resurrection with his wound the color of blood but its scent will be the scent of musk.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported through other routes from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1656, Book 22, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the symbolic meaning of the scent of musk in relation to wounds sustained for Allah's cause?","id":"tirmidhi-22-137"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever fought in the cause of Allah - a Muslim man - for the time it takes for two milkings of a camel, then Paradise is obligatory for him. And whoever suffered a wound in the cause of Allah, or he suffers from an injury, then he will come on the Day of Resurrection while (his blood will be) more copius that it ever was, its color the color of saffron, and its scent like that of musk.\"This Hadith is Sahih.","reference":"Jami` at-Tirmidhi 1657, Book 22, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #3","question":"How are the wounds suffered in the cause of Allah described on the Day of Resurrection?","id":"tirmidhi-22-138"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1658, Book 22, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of Jihad in the hierarchy of virtuous deeds?","id":"tirmidhi-22-139"},{"hadith-eng":"\"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"","reference":"Jami` at-Tirmidhi 1659, Book 22, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does courage and sacrifice play in the context of this narration?","id":"tirmidhi-22-140"},{"hadith-eng":"that the Messenger of Allah (ﷺ) was asked: \"Which of the people are most virtuous?\" He said: \"A man who take part in Jihad in Allah's cause.\" They said: \"Then whom?\" He said: \"Then a believer who stays in one of the mountains path out of Taqwa for his Lord, leaving the people secure from his evil.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1660, Book 22, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does living in seclusion out of Taqwa contribute to a believer's virtue?","id":"tirmidhi-22-141"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None of the people of Paradise would wish to return to the world except for the martyr who indeed would love to return to the world saying that he would love to be killed ten times in Allah's cause because of what he has seen of the honor that He has given him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1661, Book 22, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the desire of a martyr to be killed multiple times in Allah's cause indicate about their faith and commitment?","id":"tirmidhi-22-142"},{"hadith-eng":"] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1662, Book 22, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the criteria used to determine the authenticity of a hadith?","id":"tirmidhi-22-143"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1663, Book 22, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of being protected from punishment in the grave for a martyr?","id":"tirmidhi-22-144"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"(Ribat) Guarding the frontier for a day in the cause of Allah is better than the world and what is in it. And an afternoon the worshipper spends in the cause of Allah - or a morning - is better than the world and what is on it. And the space occupied by the whip of one of you in Paradise is better than the world and what is on it.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1664, Book 22, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the reward for a worshipper who dedicates their time to the cause of Allah?","id":"tirmidhi-22-145"},{"hadith-eng":"\"Salman Al-Farisi passed by Shurahbil bin As-Simt while he was in garrison in which he and his companions were suffering from difficulties. He said to him: 'Shall I narrate to you - O Ibn As-Simt - a Hadith I heard from the Messenger of Allah (ﷺ) ?' He said: 'Of course.' He said: 'I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in the cause of Allah is more virtuous\" - and perhaps he said: \"better, than fasting a month and standing (in prayer) for it. And whoever dies in it, he is protected from the trials of the grave, and his deeds (continuously) multiplied until the Day of Resurrection.[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1665, Book 22, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the spiritual benefits for someone who dies while guarding the frontier?","id":"tirmidhi-22-146"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1666, Book 22, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of a weak chain of narration in the context of Hadith authenticity?","id":"tirmidhi-22-147"},{"hadith-eng":"\"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"","reference":"Jami` at-Tirmidhi 1667, Book 22, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of choice play a role in following different matters in Islam?","id":"tirmidhi-22-148"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The martyr does not sense the touch of death except as one of you senses the touch of a (bug) bite.[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1668, Book 22, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #3","question":"What significance does martyrdom hold in Islam regarding the experience of death?","id":"tirmidhi-22-149"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.","reference":"Jami` at-Tirmidhi 1669, Book 22, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #3","question":"How is shedding blood in Allah's cause viewed in Islamic teachings?","id":"tirmidhi-22-150"},{"hadith-eng":"\"It was said, 'O Messenger of Allah, what equals Jihad?' He said: 'Verily, you (people) are not capable of it.' So they repeated it to him two or three times, each time he said, 'You (people) are not capable of it.' Then he said the third time: 'The example of the Mujahid in the path of Allah is like the one who fasts and stands (in prayer) and does not slacken from Salat, nor fasting, until the Mujahid in the cause of Allah returns.'\"There are narrations on this topic from Ash-Shifa', 'Abdullah bin Hubshi, Abu Musa', Abu Sa'eed, Umm Malik Al-Bahziyyah, and Anas.This Hadith is a Hasan Sahih. And it has been reported through more than one route from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1619, Book 22, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the spiritual status of a Mujahid from this narration?","id":"tirmidhi-22-151"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: meaning: Allah Mighty and Sublime is He says: 'The Mujahid in My cause, he has guarantee fro Me. If I I seize him, I cause him to inherit Paradise, and if I return him, I return him with a reward or spoils of war.'\"[He said:] This Hadith is Gharib Sahih from this route.","reference":"Jami` at-Tirmidhi 1620, Book 22, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does inheriting Paradise signify for a Mujahid in Islamic belief?","id":"tirmidhi-22-152"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The deeds of everyone who dies are sealed. Except for the one who dies guarding the frontier from the enemy, in the cause of Allah. For indeed his actions are increased for him until the Day of Judgement, and he is secure from the tribulation of the grave.\" And I heard the Messenger of Allah (ﷺ) saying: \"The Mujahid is one who strives against his own soul.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uqbah bin 'Amir and Jabir.The Hadith is Fadalah is a Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1621, Book 22, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the meaning of striving against one's own soul in the context of being a Mujahid?","id":"tirmidhi-22-153"},{"hadith-eng":"From 'Urwah [bin Az-Zubair], and Sulaiman bin Yasar, that they reported to him from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. Abu Al-Aswad's name is Muhammad bin 'Abdur-Rahman bin Nawfal Al-Asadi Al-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbah bin 'Amir, and Abu Umamah","reference":"Jami` at-Tirmidhi 1622, Book 22, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #4","question":"Who are some of the companions that narrated similar hadiths about fasting in the cause of Allah?","id":"tirmidhi-22-154"},{"hadith-eng":"That the Prophet (ﷺ) said: \"A worshipper does not fast a day in the cause of Allah except that, that day (of fasting) distances the Fire from his face by seventy autumns.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1623, Book 22, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of time relate to the distance from the Fire in Islamic eschatology?","id":"tirmidhi-22-155"},{"hadith-eng":"That the Prophet (ﷺ) said, \"Whoever fasts a day in the cause of Allah, Allah shall put between him and the Fire a trench whose distance is like that between the heavens and the earth.\"This Hadith is Gharib as a narration of Abu Umamah.","reference":"Jami` at-Tirmidhi 1624, Book 22, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the reward mentioned for fasting a day in the cause of Allah?","id":"tirmidhi-22-156"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)","reference":"Jami` at-Tirmidhi 1625, Book 22, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the authenticity of a hadith impact its acceptance and practice in Islam?","id":"tirmidhi-22-157"},{"hadith-eng":"That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1626, Book 22, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #4","question":"How do different narrations and chains of transmission affect the understanding of a hadith?","id":"tirmidhi-22-158"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The most virtuous of charitable spending is the shade of a tent in the cause of Allah, or giving a servant in the cause of Allah, or a riding camel in the cause of Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih, and it is more correct to me than the narration of Mu'awiyah bin Salih.","reference":"Jami` at-Tirmidhi 1627, Book 22, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is donating a riding camel considered a virtuous charitable act in Islam?","id":"tirmidhi-22-159"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever looks after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through more than one route.","reference":"Jami` at-Tirmidhi 1628, Book 22, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"What rewards are associated with preparing a fighter for a cause in Islam?","id":"tirmidhi-22-160"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, or looks after the family of a fighter, then he has participated in a military expedition.\"[Abu 'Eisa said:]  This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1629, Book 22, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the act of preparing someone for a military expedition in the cause of Allah?","id":"tirmidhi-22-161"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever watches after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1631, Book 22, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does taking care of a fighter's family play in the context of jihad?","id":"tirmidhi-22-162"},{"hadith-eng":"\"Abayah bin Rifa'ah bin Rafi' met me while I was walking to the Friday prayer. He said: 'Have glad tidings, for indeed these footsteps of yours are in the cause of Allah. I heard Abu 'Abs say: \"The Messenger of Allah (ﷺ) said, 'Whoever get his two feet dusty in the path of Allah, then they are prohibited for the Fire.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Abu 'Abs's name is 'Abdur-Rahman bin Jabr. There are narrations on this topic from Abu Bkar and a man from the Companions of the Prophet (ﷺ).He said: Yazid bin Abi Maryam is a man from Ash-Sham. Al-Walid bin Muslim, Yahya bin Hamzah, and some others among the people of Ash-Sham report from him.Buraid bin Abi Maryam is form Al-Kufah. His father is one of the Companions of the Prophet (ﷺ) whose name was Malik bin Rabi'ah. [Buraid bin Abi Maryam heard from Anas bin Malik. Abu Ishaq Al-Hamdani, 'Ata bin As-Sa'ib, Yunus bin Abi Ishaq, and Shu'bah reported Ahadith from Buraid bin Abi Maryam].","reference":"Jami` at-Tirmidhi 1632, Book 22, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who was Abu 'Abs and what did he narrate about the path of Allah?","id":"tirmidhi-22-163"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.","reference":"Jami` at-Tirmidhi 1633, Book 22, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this hadith imply about the emotional expressions of fear and their spiritual consequences?","id":"tirmidhi-22-164"},{"hadith-eng":"\"O Ka'b bin Murrah! Relate (something) to is from the Messenger of Allah (ﷺ), and be cautious. He said: 'I heard the Prophet (ﷺ) say: \"Whoever develops some gray hair in Islam, it shall be a light from him on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from Fadalah bin 'Ubaid and 'Abdullah bin 'Amr. The narration of Ka'b bin Murrah was reported like this from Al-A'mash, from 'Amr bin Murrah.This Hadith is been reported from Mansur, from Salim bin Abu Al-Ja'd, and he included a man between him and between Ka'b bin Murrah in the chain. He is called: \"Ka'b bin Murrah,\" and he is called: \"Murrah bin Ka'b Al-Bahzi,\" and the one known among the Companions of the Prophet (ﷺ) is Ka'b bin Murrah Al-Bahzi, he reported some Ahadith from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1634, Book 22, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #4","question":"Who are some of the companions known for narrating hadiths about gray hair in Islam?","id":"tirmidhi-22-165"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.","reference":"Jami` at-Tirmidhi 1635, Book 22, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of gray hair relate to the Day of Judgement in Islamic belief?","id":"tirmidhi-22-166"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The forelocks of horses contain good until the Day of Judgement. The horse is for three (purposes): It is for one man a reward, and it is for one man a shelter (from poverty), and it is from one man a burden. As for the one who acquires it for the cause of Allah and then prepares it for that; it is for him a reward, nothing disappears into its stomach except that Allah writes it for him as a reward.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas narrated similar to this Hadith from Zaid bin Aslam from Abu Salih from Abu Hurairah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1636, Book 22, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the intention behind acquiring a horse affect its value in terms of reward or burden?","id":"tirmidhi-22-167"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"","reference":"Jami` at-Tirmidhi 1637, Book 22, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the act of making an arrow with good intentions contribute to one's spiritual reward?","id":"tirmidhi-22-168"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: \"Whoever shoots an arrow in the cause of Allah, then he has the reward of freeing a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Najih is 'Amr bin 'Abasah As-Sulami, and 'Abdullah bin Al-Azraq is 'Abdullah bin Zaid.","reference":"Jami` at-Tirmidhi 1638, Book 22, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the term 'Hasan Sahih' indicate about the authenticity of a hadith?","id":"tirmidhi-22-169"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying, 'There are two eyes that shall not be touched by the Fire: An eye that wept from the fear of Allah, and an eye that spent the night standing on guard in the cause of Allah.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uthman and Abu Raihanah.The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it except through the narration of Shu'aib bin Ruzaiq.","reference":"Jami` at-Tirmidhi 1639, Book 22, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is weeping from the fear of Allah considered virtuous in Islam?","id":"tirmidhi-22-170"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Dying in the cause of Allah expiates every sin.\" Jibril said: \"Except for debt.\" So the Messenger of Allah (ﷺ) said: \"Except the debt.\"[Abu 'Eisa said:] There are narrations on this topic from Ka'b bin 'Ujrah, Jabir, Abu Hurairah, and Abu Qatadah. This Hadith is Gharib, we do not know of it as a Hadith of Abu Bakr (a narrator) except from this Shaikh (Yahya bin Talhah)He said: I asked Muhammad bin Isma'il about this Hadith and he did not know it. He said: \"I think that he intended the Hadith of Humaid, from Anas, from the Prophet (ﷺ) that he said: 'There is none from the people of Paradise who would like to return to the world except for the martyr.'\"","reference":"Jami` at-Tirmidhi 1640, Book 22, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is debt considered an exception in the expiation of sins through martyrdom?","id":"tirmidhi-22-171"},{"hadith-eng":"From his father that the Messenger of Allah (ﷺ) said: \"The souls of the martyrs are in green birds, suspended from the fruit of Paradise, or the trees of Paradise.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1641, Book 22, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the hadith imply about the reward for martyrs in the afterlife?","id":"tirmidhi-22-172"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1642, Book 22, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the importance of sincerity in worship for a slave in relation to entering Paradise?","id":"tirmidhi-22-173"},{"hadith-eng":"That the Prophet (ﷺ), \"There is no person who dies having good (prepared for him) with Allah, who wishes to return to the world, and to have the world and all it contains, except for the martyr because of what he knows about the virtue of martyrdom. For, indeed he loves to return to the world so that he may be killed another time.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.Ibn 'Umar said: \"Sufyan bin 'Uyainah said: \"Amr bin Dinar was older than Az-Zuhri.'\"","reference":"Jami` at-Tirmidhi 1643, Book 22, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"What virtues are associated with martyrdom that make it desirable for a martyr to experience it again?","id":"tirmidhi-22-174"},{"hadith-eng":"That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"","reference":"Jami` at-Tirmidhi 1644, Book 22, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #4","question":"How are righteous deeds and sins considered in the context of martyrdom?","id":"tirmidhi-22-175"},{"hadith-eng":"That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.","reference":"Jami` at-Tirmidhi 1645, Book 22, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the hadith imply about the status of women in early Islamic expeditions?","id":"tirmidhi-22-176"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about a man who fights out of bravery, one who fights out of protection (for himself or others), and one who fought to be seen. Which of them is in the cause of Allah ? He said: 'Whoever fought so that the Word of Allah is supreme, then he is in Allah's cause.'\"[Abu 'Eisa said:] There is something on this topic from 'Umar. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1646, Book 22, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can one ensure their actions are aligned with the cause of Allah?","id":"tirmidhi-22-177"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Deeds are but with intentions, and for the man is only what he intended. So one whose emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And one whose emigration was to the world, to attain some of it, or woman, to marry her, then his emigration was to what he emigrated.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas, Sufyan Ath-Thawri and more than one of the A'immah narrated this Hadith from Yahya bin Sa'eed. And we do not know of it except as a narration from Yahya bin Sa'eed Al-Ansari. 'Abdur Rahman bin Mahdi said: \"It is necessary that we put this Hadith in every chapter.\"","reference":"Jami` at-Tirmidhi 1647, Book 22, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of intention relate to the act of emigration in Islamic context?","id":"tirmidhi-22-178"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Going out in the morning in the cause of Allah is better that the world and what is in it. And the place (the size) of a whip in Paradise is better than the world and what is in it.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Ibn 'Abbas, Abu Ayyub, and Anas.This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1648, Book 22, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration imply about the priorities a believer should have between worldly life and the hereafter?","id":"tirmidhi-22-179"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.","reference":"Jami` at-Tirmidhi 1649, Book 22, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who are the narrators associated with this hadith and what are their backgrounds?","id":"tirmidhi-22-180"},{"hadith-eng":"A man from the Companions of the Prophet (ﷺ) passed by ravine containing a small spring of thirst quenching water, so he was amazed by how pleasant it was. So he said: 'I should leave the people and stay in this ravine. But I will not do it until I seek permission from the Messenger of Allah (ﷺ).' So he mentioned that to the Messenger of Allah (ﷺ) and he said: 'Do not do so. For indeed one of you standing in the cause of Allah is more virtuous that his Salat in his house for seventy years. Do you not love that Allah forgive your sins and admit you into Paradise ? Then fight in the cause of Allah, for whoever fights in Allah's cause for the time it takes for two milkings of a camel, then Paradise is obligatory for him.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1650, Book 22, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does participating in the cause of Allah relate to the forgiveness of sins and entry into Paradise?","id":"tirmidhi-22-181"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"To go out in the cause of Allah in the morning, or the afternoon, is better than the world and what is in it. And the space that a bow of one of you - or the space that his hand - would occupy in Paradise is better than the world and what is in it. And if a woman among the women inhabiting Paradise were to appear to the people of the earth, then she would illuminate what is between the ( the heavens and the earth), and a pleasant scent would fill up what is between them, and the scarf on her head is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1651, Book 22, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the beauty and value of a woman's scarf in Paradise described?","id":"tirmidhi-22-182"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Shall I not inform you of the best of the people ? A man who takes hold of the reins of his horse in Allah's cause. Shall I not inform you of the one who comes after him ? The man who secludes himself from the people with a small group of sheep of his, thereby fulfilling Allah's right. Shall I not inform you about the worst of the people ? A man who is asked by (the Name of) Allah, but not given by Him.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. This Hadith has been reported through other routes from Ibn 'Abbas, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1652, Book 22, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #4","question":"Who is considered the worst among people in Islamic teachings?","id":"tirmidhi-22-183"},{"hadith-eng":"From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.","reference":"Jami` at-Tirmidhi 1653, Book 22, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the concept of martyrdom viewed in Islamic teachings?","id":"tirmidhi-22-184"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever asks Allah to be killed in His cause sincerely from his heart, Allah shall give him the reward of martyrdom.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1654, Book 22, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of martyrdom relate to one's intentions and desires in Islam?","id":"tirmidhi-22-185"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are three for whom it is a right upon Allah to help him: The Mujahid in the cause of Allah, the Mukatab who intends to fulfill (the Kitabah), and the one getting married who intends chastity.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1655, Book 22, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the importance of marriage and chastity in Islamic teachings?","id":"tirmidhi-22-186"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None is wounded in Allah's cause - and Allah knows better about who has been injured in His cause - except that he will come on the Day of Resurrection with his wound the color of blood but its scent will be the scent of musk.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported through other routes from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1656, Book 22, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Allah's knowledge play a role in recognizing those injured in His cause?","id":"tirmidhi-22-187"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever fought in the cause of Allah - a Muslim man - for the time it takes for two milkings of a camel, then Paradise is obligatory for him. And whoever suffered a wound in the cause of Allah, or he suffers from an injury, then he will come on the Day of Resurrection while (his blood will be) more copius that it ever was, its color the color of saffron, and its scent like that of musk.\"This Hadith is Sahih.","reference":"Jami` at-Tirmidhi 1657, Book 22, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the symbolic meaning of the color and scent of the blood of martyrs in Islam?","id":"tirmidhi-22-188"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1658, Book 22, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the importance of Hajj Mabrur in the list of commendable actions?","id":"tirmidhi-22-189"},{"hadith-eng":"\"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"","reference":"Jami` at-Tirmidhi 1659, Book 22, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the testimony of a trusted companion influence the actions of others in Islamic history?","id":"tirmidhi-22-190"},{"hadith-eng":"that the Messenger of Allah (ﷺ) was asked: \"Which of the people are most virtuous?\" He said: \"A man who take part in Jihad in Allah's cause.\" They said: \"Then whom?\" He said: \"Then a believer who stays in one of the mountains path out of Taqwa for his Lord, leaving the people secure from his evil.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1660, Book 22, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does it mean to leave people secure from one's evil in the context of Islamic virtue?","id":"tirmidhi-22-191"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None of the people of Paradise would wish to return to the world except for the martyr who indeed would love to return to the world saying that he would love to be killed ten times in Allah's cause because of what he has seen of the honor that He has given him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1661, Book 22, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is honor bestowed upon martyrs in the afterlife according to Islamic teachings?","id":"tirmidhi-22-192"},{"hadith-eng":"] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1662, Book 22, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to have multiple chains of narration for a hadith?","id":"tirmidhi-22-193"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1663, Book 22, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the 'crown of dignity' symbolize for a martyr in Islamic belief?","id":"tirmidhi-22-194"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"(Ribat) Guarding the frontier for a day in the cause of Allah is better than the world and what is in it. And an afternoon the worshipper spends in the cause of Allah - or a morning - is better than the world and what is on it. And the space occupied by the whip of one of you in Paradise is better than the world and what is on it.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1664, Book 22, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the concept of Paradise described in relation to worldly wealth and possessions?","id":"tirmidhi-22-195"},{"hadith-eng":"\"Salman Al-Farisi passed by Shurahbil bin As-Simt while he was in garrison in which he and his companions were suffering from difficulties. He said to him: 'Shall I narrate to you - O Ibn As-Simt - a Hadith I heard from the Messenger of Allah (ﷺ) ?' He said: 'Of course.' He said: 'I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in the cause of Allah is more virtuous\" - and perhaps he said: \"better, than fasting a month and standing (in prayer) for it. And whoever dies in it, he is protected from the trials of the grave, and his deeds (continuously) multiplied until the Day of Resurrection.[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1665, Book 22, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are the deeds of a person who dies while guarding the frontier affected until the Day of Resurrection?","id":"tirmidhi-22-196"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1666, Book 22, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do scholars assess the reliability of narrators in Hadith transmission?","id":"tirmidhi-22-197"},{"hadith-eng":"\"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"","reference":"Jami` at-Tirmidhi 1667, Book 22, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the term 'Ribat' refer to in Islamic teachings?","id":"tirmidhi-22-198"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The martyr does not sense the touch of death except as one of you senses the touch of a (bug) bite.[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1668, Book 22, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the hadith describe the physical sensation of death for a martyr?","id":"tirmidhi-22-199"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.","reference":"Jami` at-Tirmidhi 1669, Book 22, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the two traces that are considered beloved to Allah?","id":"tirmidhi-22-200"},{"hadith-eng":"\"It was said, 'O Messenger of Allah, what equals Jihad?' He said: 'Verily, you (people) are not capable of it.' So they repeated it to him two or three times, each time he said, 'You (people) are not capable of it.' Then he said the third time: 'The example of the Mujahid in the path of Allah is like the one who fasts and stands (in prayer) and does not slacken from Salat, nor fasting, until the Mujahid in the cause of Allah returns.'\"There are narrations on this topic from Ash-Shifa', 'Abdullah bin Hubshi, Abu Musa', Abu Sa'eed, Umm Malik Al-Bahziyyah, and Anas.This Hadith is a Hasan Sahih. And it has been reported through more than one route from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1619, Book 22, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the characteristics of a Mujahid as mentioned in the hadith?","id":"tirmidhi-22-201"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: meaning: Allah Mighty and Sublime is He says: 'The Mujahid in My cause, he has guarantee fro Me. If I I seize him, I cause him to inherit Paradise, and if I return him, I return him with a reward or spoils of war.'\"[He said:] This Hadith is Gharib Sahih from this route.","reference":"Jami` at-Tirmidhi 1620, Book 22, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the rewards mentioned for a Mujahid who returns from battle?","id":"tirmidhi-22-202"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The deeds of everyone who dies are sealed. Except for the one who dies guarding the frontier from the enemy, in the cause of Allah. For indeed his actions are increased for him until the Day of Judgement, and he is secure from the tribulation of the grave.\" And I heard the Messenger of Allah (ﷺ) saying: \"The Mujahid is one who strives against his own soul.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uqbah bin 'Amir and Jabir.The Hadith is Fadalah is a Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1621, Book 22, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does striving against one's own soul relate to the concept of Jihad in Islam?","id":"tirmidhi-22-203"},{"hadith-eng":"From 'Urwah [bin Az-Zubair], and Sulaiman bin Yasar, that they reported to him from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. Abu Al-Aswad's name is Muhammad bin 'Abdur-Rahman bin Nawfal Al-Asadi Al-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbah bin 'Amir, and Abu Umamah","reference":"Jami` at-Tirmidhi 1622, Book 22, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the term 'autumns' refer to in the context of this hadith?","id":"tirmidhi-22-204"},{"hadith-eng":"That the Prophet (ﷺ) said: \"A worshipper does not fast a day in the cause of Allah except that, that day (of fasting) distances the Fire from his face by seventy autumns.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1623, Book 22, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'seventy autumns' symbolize in the context of fasting and its spiritual benefits?","id":"tirmidhi-22-205"},{"hadith-eng":"That the Prophet (ﷺ) said, \"Whoever fasts a day in the cause of Allah, Allah shall put between him and the Fire a trench whose distance is like that between the heavens and the earth.\"This Hadith is Gharib as a narration of Abu Umamah.","reference":"Jami` at-Tirmidhi 1624, Book 22, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #5","question":"How is the concept of distance between the heavens and the earth used in Islamic teachings?","id":"tirmidhi-22-206"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)","reference":"Jami` at-Tirmidhi 1625, Book 22, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do narrators play in the transmission of hadiths in Islamic tradition?","id":"tirmidhi-22-207"},{"hadith-eng":"That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1626, Book 22, Hadith 8","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the challenges in verifying the authenticity of hadiths with varying chains of narration?","id":"tirmidhi-22-208"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The most virtuous of charitable spending is the shade of a tent in the cause of Allah, or giving a servant in the cause of Allah, or a riding camel in the cause of Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih, and it is more correct to me than the narration of Mu'awiyah bin Salih.","reference":"Jami` at-Tirmidhi 1627, Book 22, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this hadith emphasize the importance of supporting causes in the path of Allah?","id":"tirmidhi-22-209"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever looks after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through more than one route.","reference":"Jami` at-Tirmidhi 1628, Book 22, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does looking after a fighter's family equate to participating in a military expedition?","id":"tirmidhi-22-210"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, or looks after the family of a fighter, then he has participated in a military expedition.\"[Abu 'Eisa said:]  This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1629, Book 22, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the different ways one can participate in a military expedition without directly fighting?","id":"tirmidhi-22-211"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever watches after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1631, Book 22, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam view the contribution of those who support fighters indirectly?","id":"tirmidhi-22-212"},{"hadith-eng":"\"Abayah bin Rifa'ah bin Rafi' met me while I was walking to the Friday prayer. He said: 'Have glad tidings, for indeed these footsteps of yours are in the cause of Allah. I heard Abu 'Abs say: \"The Messenger of Allah (ﷺ) said, 'Whoever get his two feet dusty in the path of Allah, then they are prohibited for the Fire.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Abu 'Abs's name is 'Abdur-Rahman bin Jabr. There are narrations on this topic from Abu Bkar and a man from the Companions of the Prophet (ﷺ).He said: Yazid bin Abi Maryam is a man from Ash-Sham. Al-Walid bin Muslim, Yahya bin Hamzah, and some others among the people of Ash-Sham report from him.Buraid bin Abi Maryam is form Al-Kufah. His father is one of the Companions of the Prophet (ﷺ) whose name was Malik bin Rabi'ah. [Buraid bin Abi Maryam heard from Anas bin Malik. Abu Ishaq Al-Hamdani, 'Ata bin As-Sa'ib, Yunus bin Abi Ishaq, and Shu'bah reported Ahadith from Buraid bin Abi Maryam].","reference":"Jami` at-Tirmidhi 1632, Book 22, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do footsteps play in the cause of Allah according to Islamic teachings?","id":"tirmidhi-22-213"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.","reference":"Jami` at-Tirmidhi 1633, Book 22, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the concept of fear of Allah portrayed in Islamic teachings?","id":"tirmidhi-22-214"},{"hadith-eng":"\"O Ka'b bin Murrah! Relate (something) to is from the Messenger of Allah (ﷺ), and be cautious. He said: 'I heard the Prophet (ﷺ) say: \"Whoever develops some gray hair in Islam, it shall be a light from him on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from Fadalah bin 'Ubaid and 'Abdullah bin 'Amr. The narration of Ka'b bin Murrah was reported like this from Al-A'mash, from 'Amr bin Murrah.This Hadith is been reported from Mansur, from Salim bin Abu Al-Ja'd, and he included a man between him and between Ka'b bin Murrah in the chain. He is called: \"Ka'b bin Murrah,\" and he is called: \"Murrah bin Ka'b Al-Bahzi,\" and the one known among the Companions of the Prophet (ﷺ) is Ka'b bin Murrah Al-Bahzi, he reported some Ahadith from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1634, Book 22, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the role of light as a metaphor in Islamic eschatology?","id":"tirmidhi-22-215"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever develops some gray hair in the cause of Allah, it shall be a light for him in the Day of Judgement.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. As for Haiwah bin Shuraih, (the remainder of his name is) Ibn Yazid Al-Himsi.","reference":"Jami` at-Tirmidhi 1635, Book 22, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'light' symbolize in the context of gray hair and the Day of Judgement?","id":"tirmidhi-22-216"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The forelocks of horses contain good until the Day of Judgement. The horse is for three (purposes): It is for one man a reward, and it is for one man a shelter (from poverty), and it is from one man a burden. As for the one who acquires it for the cause of Allah and then prepares it for that; it is for him a reward, nothing disappears into its stomach except that Allah writes it for him as a reward.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas narrated similar to this Hadith from Zaid bin Aslam from Abu Salih from Abu Hurairah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1636, Book 22, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of horses in providing shelter from poverty according to Islamic teachings?","id":"tirmidhi-22-217"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"","reference":"Jami` at-Tirmidhi 1637, Book 22, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of engaging in activities like archery and horse training in Islam?","id":"tirmidhi-22-218"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) say: \"Whoever shoots an arrow in the cause of Allah, then he has the reward of freeing a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Najih is 'Amr bin 'Abasah As-Sulami, and 'Abdullah bin Al-Azraq is 'Abdullah bin Zaid.","reference":"Jami` at-Tirmidhi 1638, Book 22, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does intention play in actions performed in the cause of Allah?","id":"tirmidhi-22-219"},{"hadith-eng":"\"I heard the Messenger of Allah (ﷺ) saying, 'There are two eyes that shall not be touched by the Fire: An eye that wept from the fear of Allah, and an eye that spent the night standing on guard in the cause of Allah.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uthman and Abu Raihanah.The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it except through the narration of Shu'aib bin Ruzaiq.","reference":"Jami` at-Tirmidhi 1639, Book 22, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the rewards for those who protect and guard in the path of Allah?","id":"tirmidhi-22-220"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Dying in the cause of Allah expiates every sin.\" Jibril said: \"Except for debt.\" So the Messenger of Allah (ﷺ) said: \"Except the debt.\"[Abu 'Eisa said:] There are narrations on this topic from Ka'b bin 'Ujrah, Jabir, Abu Hurairah, and Abu Qatadah. This Hadith is Gharib, we do not know of it as a Hadith of Abu Bakr (a narrator) except from this Shaikh (Yahya bin Talhah)He said: I asked Muhammad bin Isma'il about this Hadith and he did not know it. He said: \"I think that he intended the Hadith of Humaid, from Anas, from the Prophet (ﷺ) that he said: 'There is none from the people of Paradise who would like to return to the world except for the martyr.'\"","reference":"Jami` at-Tirmidhi 1640, Book 22, Hadith 23","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the views of different narrators on the topic of martyrdom and sin expiation?","id":"tirmidhi-22-221"},{"hadith-eng":"From his father that the Messenger of Allah (ﷺ) said: \"The souls of the martyrs are in green birds, suspended from the fruit of Paradise, or the trees of Paradise.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1641, Book 22, Hadith 24","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this narration describe the connection between martyrs and the fruits or trees of Paradise?","id":"tirmidhi-22-222"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1642, Book 22, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does perfecting worship of Allah influence one's eligibility for Paradise?","id":"tirmidhi-22-223"},{"hadith-eng":"That the Prophet (ﷺ), \"There is no person who dies having good (prepared for him) with Allah, who wishes to return to the world, and to have the world and all it contains, except for the martyr because of what he knows about the virtue of martyrdom. For, indeed he loves to return to the world so that he may be killed another time.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.Ibn 'Umar said: \"Sufyan bin 'Uyainah said: \"Amr bin Dinar was older than Az-Zuhri.'\"","reference":"Jami` at-Tirmidhi 1643, Book 22, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the desire of a martyr to return to the world highlight their understanding of the afterlife?","id":"tirmidhi-22-224"},{"hadith-eng":"That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"","reference":"Jami` at-Tirmidhi 1644, Book 22, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role does unexpected death play in the classification of martyrs?","id":"tirmidhi-22-225"},{"hadith-eng":"That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.","reference":"Jami` at-Tirmidhi 1645, Book 22, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How are dreams interpreted in the context of Islamic prophecy and guidance?","id":"tirmidhi-22-226"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked about a man who fights out of bravery, one who fights out of protection (for himself or others), and one who fought to be seen. Which of them is in the cause of Allah ? He said: 'Whoever fought so that the Word of Allah is supreme, then he is in Allah's cause.'\"[Abu 'Eisa said:] There is something on this topic from 'Umar. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1646, Book 22, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of intention in determining the righteousness of an action?","id":"tirmidhi-22-227"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Deeds are but with intentions, and for the man is only what he intended. So one whose emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And one whose emigration was to the world, to attain some of it, or woman, to marry her, then his emigration was to what he emigrated.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas, Sufyan Ath-Thawri and more than one of the A'immah narrated this Hadith from Yahya bin Sa'eed. And we do not know of it except as a narration from Yahya bin Sa'eed Al-Ansari. 'Abdur Rahman bin Mahdi said: \"It is necessary that we put this Hadith in every chapter.\"","reference":"Jami` at-Tirmidhi 1647, Book 22, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is it important to assess one's intentions before performing any deed in Islam?","id":"tirmidhi-22-228"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Going out in the morning in the cause of Allah is better that the world and what is in it. And the place (the size) of a whip in Paradise is better than the world and what is in it.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Ibn 'Abbas, Abu Ayyub, and Anas.This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1648, Book 22, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the value of Paradise from this narration?","id":"tirmidhi-22-229"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.","reference":"Jami` at-Tirmidhi 1649, Book 22, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the term 'Hasan Gharib' indicate about the classification of a hadith?","id":"tirmidhi-22-230"},{"hadith-eng":"A man from the Companions of the Prophet (ﷺ) passed by ravine containing a small spring of thirst quenching water, so he was amazed by how pleasant it was. So he said: 'I should leave the people and stay in this ravine. But I will not do it until I seek permission from the Messenger of Allah (ﷺ).' So he mentioned that to the Messenger of Allah (ﷺ) and he said: 'Do not do so. For indeed one of you standing in the cause of Allah is more virtuous that his Salat in his house for seventy years. Do you not love that Allah forgive your sins and admit you into Paradise ? Then fight in the cause of Allah, for whoever fights in Allah's cause for the time it takes for two milkings of a camel, then Paradise is obligatory for him.'\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1650, Book 22, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the reward for fighting in Allah's cause for a short duration?","id":"tirmidhi-22-231"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"To go out in the cause of Allah in the morning, or the afternoon, is better than the world and what is in it. And the space that a bow of one of you - or the space that his hand - would occupy in Paradise is better than the world and what is in it. And if a woman among the women inhabiting Paradise were to appear to the people of the earth, then she would illuminate what is between the ( the heavens and the earth), and a pleasant scent would fill up what is between them, and the scarf on her head is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1651, Book 22, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration suggest about the rewards of Paradise compared to earthly life?","id":"tirmidhi-22-232"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Shall I not inform you of the best of the people ? A man who takes hold of the reins of his horse in Allah's cause. Shall I not inform you of the one who comes after him ? The man who secludes himself from the people with a small group of sheep of his, thereby fulfilling Allah's right. Shall I not inform you about the worst of the people ? A man who is asked by (the Name of) Allah, but not given by Him.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. This Hadith has been reported through other routes from Ibn 'Abbas, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1652, Book 22, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of seclusion and simplicity in one's life according to Islamic principles?","id":"tirmidhi-22-233"},{"hadith-eng":"From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.","reference":"Jami` at-Tirmidhi 1653, Book 22, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the power of intention from this narration?","id":"tirmidhi-22-234"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever asks Allah to be killed in His cause sincerely from his heart, Allah shall give him the reward of martyrdom.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1654, Book 22, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this hadith imply about the relationship between intention and reward in Islamic teachings?","id":"tirmidhi-22-235"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are three for whom it is a right upon Allah to help him: The Mujahid in the cause of Allah, the Mukatab who intends to fulfill (the Kitabah), and the one getting married who intends chastity.\"[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1655, Book 22, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of divine assistance manifest in the lives of believers?","id":"tirmidhi-22-236"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None is wounded in Allah's cause - and Allah knows better about who has been injured in His cause - except that he will come on the Day of Resurrection with his wound the color of blood but its scent will be the scent of musk.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported through other routes from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1656, Book 22, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the transformation of the wound's color and scent signify in Islamic eschatology?","id":"tirmidhi-22-237"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Whoever fought in the cause of Allah - a Muslim man - for the time it takes for two milkings of a camel, then Paradise is obligatory for him. And whoever suffered a wound in the cause of Allah, or he suffers from an injury, then he will come on the Day of Resurrection while (his blood will be) more copius that it ever was, its color the color of saffron, and its scent like that of musk.\"This Hadith is Sahih.","reference":"Jami` at-Tirmidhi 1657, Book 22, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the hadith imply about the spiritual status of those who are wounded in the cause of Allah?","id":"tirmidhi-22-238"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1658, Book 22, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of Jihad relate to other virtuous deeds in Islam?","id":"tirmidhi-22-239"},{"hadith-eng":"\"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"","reference":"Jami` at-Tirmidhi 1659, Book 22, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the importance of verifying information in the context of this narration?","id":"tirmidhi-22-240"},{"hadith-eng":"that the Messenger of Allah (ﷺ) was asked: \"Which of the people are most virtuous?\" He said: \"A man who take part in Jihad in Allah's cause.\" They said: \"Then whom?\" He said: \"Then a believer who stays in one of the mountains path out of Taqwa for his Lord, leaving the people secure from his evil.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1660, Book 22, Hadith 43","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is Taqwa related to the concept of virtue in Islam?","id":"tirmidhi-22-241"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"None of the people of Paradise would wish to return to the world except for the martyr who indeed would love to return to the world saying that he would love to be killed ten times in Allah's cause because of what he has seen of the honor that He has given him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1661, Book 22, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the rewards of martyrdom from the perspective of those who have attained it?","id":"tirmidhi-22-242"},{"hadith-eng":"] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1662, Book 22, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do narrators play in the transmission and preservation of hadiths?","id":"tirmidhi-22-243"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1663, Book 22, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of intercession by a martyr for their relatives reflect in Islamic teachings?","id":"tirmidhi-22-244"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"(Ribat) Guarding the frontier for a day in the cause of Allah is better than the world and what is in it. And an afternoon the worshipper spends in the cause of Allah - or a morning - is better than the world and what is on it. And the space occupied by the whip of one of you in Paradise is better than the world and what is on it.\"This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1664, Book 22, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration suggest about the spiritual benefits of engaging in acts of worship for the sake of Allah?","id":"tirmidhi-22-245"},{"hadith-eng":"\"Salman Al-Farisi passed by Shurahbil bin As-Simt while he was in garrison in which he and his companions were suffering from difficulties. He said to him: 'Shall I narrate to you - O Ibn As-Simt - a Hadith I heard from the Messenger of Allah (ﷺ) ?' He said: 'Of course.' He said: 'I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in the cause of Allah is more virtuous\" - and perhaps he said: \"better, than fasting a month and standing (in prayer) for it. And whoever dies in it, he is protected from the trials of the grave, and his deeds (continuously) multiplied until the Day of Resurrection.[Abu 'Eisa said:] This Hadith is Hasan.","reference":"Jami` at-Tirmidhi 1665, Book 22, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #5","question":"What protection does a person receive from the trials of the grave if they die while guarding the frontier?","id":"tirmidhi-22-246"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1666, Book 22, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the challenges in verifying the authenticity of Hadiths with disconnected chains?","id":"tirmidhi-22-247"},{"hadith-eng":"\"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"","reference":"Jami` at-Tirmidhi 1667, Book 22, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of narrating hadiths accurately and truthfully?","id":"tirmidhi-22-248"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.","reference":"Jami` at-Tirmidhi 1669, Book 22, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the importance of fulfilling obligatory duties in Islam?","id":"tirmidhi-22-249"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The forelocks of horses contain good until the Day of Judgement. The horse is for three (purposes): It is for one man a reward, and it is for one man a shelter (from poverty), and it is from one man a burden. As for the one who acquires it for the cause of Allah and then prepares it for that; it is for him a reward, nothing disappears into its stomach except that Allah writes it for him as a reward.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas narrated similar to this Hadith from Zaid bin Aslam from Abu Salih from Abu Hurairah, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1636, Book 22, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does the sustenance of a horse contribute to the reward of its owner in the sight of Allah?","id":"tirmidhi-22-250"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"","reference":"Jami` at-Tirmidhi 1637, Book 22, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does playing with one's spouse fit into the concept of truthful pastimes in Islam?","id":"tirmidhi-22-251"},{"hadith-eng":"That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"","reference":"Jami` at-Tirmidhi 1644, Book 22, Hadith 27","grade":"Da'if(Darussalam)","question #":"question #6","question":"How does the concept of martyrdom relate to one's actions and faith in Islam?","id":"tirmidhi-22-252"},{"hadith-eng":"That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.","reference":"Jami` at-Tirmidhi 1645, Book 22, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #6","question":"What can be learned from the interaction between the Prophet Muhammad (ﷺ) and Umm Haram regarding personal supplications?","id":"tirmidhi-22-253"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Shall I not inform you of the best of the people ? A man who takes hold of the reins of his horse in Allah's cause. Shall I not inform you of the one who comes after him ? The man who secludes himself from the people with a small group of sheep of his, thereby fulfilling Allah's right. Shall I not inform you about the worst of the people ? A man who is asked by (the Name of) Allah, but not given by Him.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. This Hadith has been reported through other routes from Ibn 'Abbas, from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1652, Book 22, Hadith 35","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does the refusal to give when asked in Allah's name reflect on a person's character in Islam?","id":"tirmidhi-22-254"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).","reference":"Jami` at-Tirmidhi 1658, Book 22, Hadith 41","grade":"Hasan(Darussalam)","question #":"question #6","question":"What are the key deeds highlighted by the Prophet Muhammad (ﷺ) as being of great virtue?","id":"tirmidhi-22-255"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"There are six things with Allah for the martyr. He is forgiven with the first flow of blood (he suffers), he is shown his place in Paradise, he is protected from punishment in the grave, secured from the greatest terror, the crown of dignity is placed upon his head - and its gems are better than the world and what is in it - he is married to seventy two wives along Al-Huril-'Ayn of Paradise, and he may intercede for seventy of his close relatives.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1663, Book 22, Hadith 46","grade":"Hasan(Darussalam)","question #":"question #6","question":"What is the role of Al-Huril-'Ayn in the rewards for a martyr in Paradise?","id":"tirmidhi-22-256"},{"hadith-eng":"That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.","reference":"Jami` at-Tirmidhi 1669, Book 22, Hadith 52","grade":"Hasan(Darussalam)","question #":"question #6","question":"How does participating in Allah's cause leave a trace that is beloved to Him?","id":"tirmidhi-22-257"}]