[{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1670, Book 23, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the revelation regarding those believers who are disabled?","id":"tirmidhi-23-1"},{"hadith-eng":"A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.","reference":"Jami` at-Tirmidhi 1671, Book 23, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking parental permission before participating in Jihad?","id":"tirmidhi-23-2"},{"hadith-eng":"That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: \"Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.","reference":"Jami` at-Tirmidhi 1672, Book 23, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of obeying those in authority according to Islamic teachings?","id":"tirmidhi-23-3"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.","reference":"Jami` at-Tirmidhi 1673, Book 23, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the potential dangers or risks associated with traveling alone at night?","id":"tirmidhi-23-4"},{"hadith-eng":"From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar.Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.","reference":"Jami` at-Tirmidhi 1674, Book 23, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of traveling in groups according to Islamic teachings?","id":"tirmidhi-23-5"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"War is deceit.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1675, Book 23, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of deceit in the context of war according to Islamic teachings?","id":"tirmidhi-23-6"},{"hadith-eng":"\"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1676, Book 23, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"How many battles did the Prophet Muhammad (ﷺ) participate in during his lifetime?","id":"tirmidhi-23-7"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.","reference":"Jami` at-Tirmidhi 1677, Book 23, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Battle of Badr in Islamic history?","id":"tirmidhi-23-8"},{"hadith-eng":"\"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\"[Abu 'Eisa said:] There is something on this topic from Ibn Masu'dThis Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1678, Book 23, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of supplicating to Allah during times of conflict or adversity?","id":"tirmidhi-23-9"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\"Muhammad said: \"This is the Hadith.\"[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.","reference":"Jami` at-Tirmidhi 1679, Book 23, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does the color of the Prophet's standard hold when he entered Makkah?","id":"tirmidhi-23-10"},{"hadith-eng":"the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.","reference":"Jami` at-Tirmidhi 1680, Book 23, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #1","question":"What was the color and shape of the flag of the Messenger of Allah (ﷺ) as described in the narration?","id":"tirmidhi-23-11"},{"hadith-eng":"\"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.","reference":"Jami` at-Tirmidhi 1681, Book 23, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What were the colors of the flag and standard of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-12"},{"hadith-eng":"From one who heard the Prophet (ﷺ) saying: \"If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'\"[Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1682, Book 23, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reciting specific phrases during a surprise attack according to Islamic teachings?","id":"tirmidhi-23-13"},{"hadith-eng":"That Ibn Sirin said: \"I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.","reference":"Jami` at-Tirmidhi 1683, Book 23, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of emulating the Prophet Muhammad's (ﷺ) possessions or actions in Islamic tradition?","id":"tirmidhi-23-14"},{"hadith-eng":"\"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1684, Book 23, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of breaking the fast during a military expedition in Islamic tradition?","id":"tirmidhi-23-15"},{"hadith-eng":"\"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.","reference":"Jami` at-Tirmidhi 1685, Book 23, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet's (ﷺ) relationship with his companions from his actions in this narration?","id":"tirmidhi-23-16"},{"hadith-eng":"\"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1686, Book 23, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet Muhammad's (ﷺ) bravery from this incident?","id":"tirmidhi-23-17"},{"hadith-eng":"\"The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.\" He said: \"The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.\" He said: \"So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'\" - meaning the horse.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1687, Book 23, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What qualities of the Prophet Muhammad (ﷺ) are highlighted in terms of his character and behavior?","id":"tirmidhi-23-18"},{"hadith-eng":"From Al-Bara' bin 'Azib who said: \"A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'\" He said: \"No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet  without lie, I am the son of 'Abdul-Muttalib.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1688, Book 23, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the reaction of some companions during the battle when faced with the assault of arrows?","id":"tirmidhi-23-19"},{"hadith-eng":"\"Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.","reference":"Jami` at-Tirmidhi 1689, Book 23, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What challenges did the Muslim army face during the Battle of Hunain?","id":"tirmidhi-23-20"},{"hadith-eng":"From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: \"The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.\" Talib said: \"So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'\"[Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.","reference":"Jami` at-Tirmidhi 1690, Book 23, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does the presence of gold and silver on the Prophet's sword hold in Islamic history?","id":"tirmidhi-23-21"},{"hadith-eng":"\"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"","reference":"Jami` at-Tirmidhi 1691, Book 23, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What materials were used in the construction of the Prophet Muhammad's (ﷺ) sword?","id":"tirmidhi-23-22"},{"hadith-eng":"\"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\"[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.","reference":"Jami` at-Tirmidhi 1692, Book 23, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does the Battle of Uhud hold in Islamic history?","id":"tirmidhi-23-23"},{"hadith-eng":"The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.","reference":"Jami` at-Tirmidhi 1693, Book 23, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of the Prophet's entry into Makkah during the Conquest?","id":"tirmidhi-23-24"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir.[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: \"The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1694, Book 23, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of horses in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-25"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.","reference":"Jami` at-Tirmidhi 1695, Book 23, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #1","question":"What significance does the color of a horse have in Islamic tradition?","id":"tirmidhi-23-26"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.\"","reference":"Jami` at-Tirmidhi 1696, Book 23, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #1","question":"What characteristics make a horse considered the best according to Islamic teachings?","id":"tirmidhi-23-27"},{"hadith-eng":"] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1697, Book 23, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of classifying a hadith as Hasan Gharib Sahih?","id":"tirmidhi-23-28"},{"hadith-eng":"That the Prophet (ﷺ) disliked Shikal in horses.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"","reference":"Jami` at-Tirmidhi 1698, Book 23, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of accuracy and memory in the transmission of hadiths?","id":"tirmidhi-23-29"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.","reference":"Jami` at-Tirmidhi 1699, Book 23, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of organizing horse races in Islamic tradition?","id":"tirmidhi-23-30"},{"hadith-eng":"That the Prophet (ﷺ) said: \"No stake is acceptable except in archery, racing a camel, and racing a horse.\"","reference":"Jami` at-Tirmidhi 1700, Book 23, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #1","question":"What types of competitions are considered acceptable in Islam according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-23-31"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih.Sufyan Ath-Thawri reported this from Abu Jahdam, who said: \"From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.\" He said I heard Muhammad saying: \"The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.\"","reference":"Jami` at-Tirmidhi 1701, Book 23, Hadith 32","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the three specific instructions given by the Prophet Muhammad (ﷺ) that were not given to others?","id":"tirmidhi-23-32"},{"hadith-eng":"That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1702, Book 23, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking out and supporting the weak in a community?","id":"tirmidhi-23-33"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1703, Book 23, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of angels in Islamic teachings and their interaction with humans?","id":"tirmidhi-23-34"},{"hadith-eng":"\"The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'\" He said: \"So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'\" He said: \"I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent.[Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: \"To speak against him for that.\" refers to An-Namimah.","reference":"Jami` at-Tirmidhi 1704, Book 23, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of leadership roles in Islamic military expeditions?","id":"tirmidhi-23-35"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed each of you is a shepherd and all of you will be questioned regarding your flock. The commander who is in authority over the Muslims is responsible and he will be questioned regarding his responsibility. The man is responsible over the inhabitants of his house and he is the one who will be questioned about them. The wife is responsible in her husband's house and she will be questioned about it. The slave is responsible regarding his master's property, and he will be questioned about it. Indeed each of you is a shepherd and each of you will be questioned about his flock.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Musa. The Hadith of Abu Musa is not preserved, and the Hadith of Anas is not preserved. And the Hadith of Ibn 'Umar is Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1705, Book 23, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of individual responsibility in Islam as highlighted in this narration?","id":"tirmidhi-23-36"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.","reference":"Jami` at-Tirmidhi 1706, Book 23, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having Taqwa (consciousness of Allah) in one's life according to the Prophet's teachings?","id":"tirmidhi-23-37"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1707, Book 23, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of obedience to authority in Islam, even in matters one dislikes?","id":"tirmidhi-23-38"},{"hadith-eng":"From Mujahid from Ibn 'Abbas who said: \"The Messenger of Allah (ﷺ) prohibited instigating fights between beasts.\"","reference":"Jami` at-Tirmidhi 1708, Book 23, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on instigating fights between animals?","id":"tirmidhi-23-39"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited instigating fights between beasts.\" And he did not mention \"from Ibn 'Abbas\" in it.It is said that this is more correct that the (previous) narration of Qutbah.","reference":"Jami` at-Tirmidhi 1709, Book 23, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the Islamic stance on instigating fights between animals?","id":"tirmidhi-23-40"},{"hadith-eng":"That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\"Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.","reference":"Jami` at-Tirmidhi 1711, Book 23, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #1","question":"What age was considered the transition from youth to manhood in early Islamic society?","id":"tirmidhi-23-41"},{"hadith-eng":"That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\"[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.","reference":"Jami` at-Tirmidhi 1712, Book 23, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are considered the most virtuous deeds in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-42"},{"hadith-eng":"\"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\"[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas.This Hadith is Hasan SahihSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas","reference":"Jami` at-Tirmidhi 1713, Book 23, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What instructions did the Prophet give regarding the burial of the martyrs of the Battle of Uhud?","id":"tirmidhi-23-43"},{"hadith-eng":"That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)","reference":"Jami` at-Tirmidhi 1714, Book 23, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #1","question":"What approach did the Prophet Muhammad (ﷺ) take when dealing with captives after the Battle of Badr?","id":"tirmidhi-23-44"},{"hadith-eng":"\"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"","reference":"Jami` at-Tirmidhi 1715, Book 23, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's refusal to trade with idolaters in Islamic teachings?","id":"tirmidhi-23-45"},{"hadith-eng":"\"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.","reference":"Jami` at-Tirmidhi 1716, Book 23, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of seeking guidance and support from a leader during challenging times?","id":"tirmidhi-23-46"},{"hadith-eng":"\"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.","reference":"Jami` at-Tirmidhi 1717, Book 23, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of burying the deceased in the location where they fell during a battle?","id":"tirmidhi-23-47"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1718, Book 23, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the location Thaniyyah Al-Wada' in Islamic history?","id":"tirmidhi-23-48"},{"hadith-eng":"\"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.","reference":"Jami` at-Tirmidhi 1719, Book 23, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the significance of the wealth of Banu An-Nadir in Islamic history?","id":"tirmidhi-23-49"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1670, Book 23, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Quran address the issue of equality among believers with different abilities?","id":"tirmidhi-23-50"},{"hadith-eng":"A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.","reference":"Jami` at-Tirmidhi 1671, Book 23, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam prioritize the duty towards parents in relation to other obligations?","id":"tirmidhi-23-51"},{"hadith-eng":"That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: \"Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.","reference":"Jami` at-Tirmidhi 1672, Book 23, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi and what role did he play in early Islamic history?","id":"tirmidhi-23-52"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.","reference":"Jami` at-Tirmidhi 1673, Book 23, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might it be important to avoid solitude during nighttime journeys?","id":"tirmidhi-23-53"},{"hadith-eng":"From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar.Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.","reference":"Jami` at-Tirmidhi 1674, Book 23, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the presence of multiple people affect the safety and security of travelers in Islam?","id":"tirmidhi-23-54"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"War is deceit.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1675, Book 23, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the concept of deceit in warfare viewed in Islamic jurisprudence?","id":"tirmidhi-23-55"},{"hadith-eng":"\"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1676, Book 23, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many battles did Zaid bin Arqam participate in alongside the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-56"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.","reference":"Jami` at-Tirmidhi 1677, Book 23, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) prepare his companions for battles?","id":"tirmidhi-23-57"},{"hadith-eng":"\"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\"[Abu 'Eisa said:] There is something on this topic from Ibn Masu'dThis Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1678, Book 23, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) demonstrate reliance on Allah in the face of enemies?","id":"tirmidhi-23-58"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\"Muhammad said: \"This is the Hadith.\"[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.","reference":"Jami` at-Tirmidhi 1679, Book 23, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #2","question":"How do variations in narrations affect the understanding of historical events in Islam?","id":"tirmidhi-23-59"},{"hadith-eng":"the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.","reference":"Jami` at-Tirmidhi 1680, Book 23, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #2","question":"Who was sent to inquire about the flag of the Prophet (ﷺ) and from whom did they seek information?","id":"tirmidhi-23-60"},{"hadith-eng":"\"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.","reference":"Jami` at-Tirmidhi 1681, Book 23, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance did the colors black and white have in the context of the Prophet's flags?","id":"tirmidhi-23-61"},{"hadith-eng":"From one who heard the Prophet (ﷺ) saying: \"If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'\"[Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1682, Book 23, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can one seek divine protection in times of unexpected danger?","id":"tirmidhi-23-62"},{"hadith-eng":"That Ibn Sirin said: \"I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.","reference":"Jami` at-Tirmidhi 1683, Book 23, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the authenticity and reliability of a narrator affect the acceptance of a hadith?","id":"tirmidhi-23-63"},{"hadith-eng":"\"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1684, Book 23, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) guide his companions in matters of fasting during times of conflict?","id":"tirmidhi-23-64"},{"hadith-eng":"\"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.","reference":"Jami` at-Tirmidhi 1685, Book 23, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet (ﷺ) demonstrate courage and reassurance in times of potential fear?","id":"tirmidhi-23-65"},{"hadith-eng":"\"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1686, Book 23, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to situations of fear or alarm in his community?","id":"tirmidhi-23-66"},{"hadith-eng":"\"The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.\" He said: \"The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.\" He said: \"So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'\" - meaning the horse.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1687, Book 23, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate bravery during a time of fear in Al-Madinah?","id":"tirmidhi-23-67"},{"hadith-eng":"From Al-Bara' bin 'Azib who said: \"A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'\" He said: \"No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet  without lie, I am the son of 'Abdul-Muttalib.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1688, Book 23, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) affirm his identity during the battle?","id":"tirmidhi-23-68"},{"hadith-eng":"\"Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.","reference":"Jami` at-Tirmidhi 1689, Book 23, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) react during the Battle of Hunain?","id":"tirmidhi-23-69"},{"hadith-eng":"From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: \"The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.\" Talib said: \"So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'\"[Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.","reference":"Jami` at-Tirmidhi 1690, Book 23, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #2","question":"What materials were used in the construction of the Prophet's sword according to historical narrations?","id":"tirmidhi-23-70"},{"hadith-eng":"\"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"","reference":"Jami` at-Tirmidhi 1691, Book 23, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance does the use of silver have in Islamic artifacts?","id":"tirmidhi-23-71"},{"hadith-eng":"\"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\"[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.","reference":"Jami` at-Tirmidhi 1692, Book 23, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did Talhah demonstrate his loyalty and support to the Prophet during the Battle of Uhud?","id":"tirmidhi-23-72"},{"hadith-eng":"The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.","reference":"Jami` at-Tirmidhi 1693, Book 23, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"What does the hadith indicate about the Prophet's instructions regarding Ibn Khatal?","id":"tirmidhi-23-73"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir.[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: \"The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1694, Book 23, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are rewards and spoils of war associated with horses in Islamic tradition?","id":"tirmidhi-23-74"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.","reference":"Jami` at-Tirmidhi 1695, Book 23, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are blessings associated with horses in Islamic teachings?","id":"tirmidhi-23-75"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.\"","reference":"Jami` at-Tirmidhi 1696, Book 23, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the color and markings of a horse influence its value in Islamic tradition?","id":"tirmidhi-23-76"},{"hadith-eng":"] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1697, Book 23, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the classification of hadiths affect their acceptance and application in Islamic teachings?","id":"tirmidhi-23-77"},{"hadith-eng":"That the Prophet (ﷺ) disliked Shikal in horses.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"","reference":"Jami` at-Tirmidhi 1698, Book 23, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the reliability of narrators affect the authenticity of hadiths?","id":"tirmidhi-23-78"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.","reference":"Jami` at-Tirmidhi 1699, Book 23, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How were horse races conducted during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-79"},{"hadith-eng":"That the Prophet (ﷺ) said: \"No stake is acceptable except in archery, racing a camel, and racing a horse.\"","reference":"Jami` at-Tirmidhi 1700, Book 23, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might certain activities like archery, camel racing, and horse racing be emphasized in Islamic tradition?","id":"tirmidhi-23-80"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih.Sufyan Ath-Thawri reported this from Abu Jahdam, who said: \"From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.\" He said I heard Muhammad saying: \"The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.\"","reference":"Jami` at-Tirmidhi 1701, Book 23, Hadith 32","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to perform Wudu' well according to Islamic teachings?","id":"tirmidhi-23-81"},{"hadith-eng":"That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1702, Book 23, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the well-being of the weak influence the sustenance and aid received by a community?","id":"tirmidhi-23-82"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1703, Book 23, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do dogs and bells affect the presence of angels according to Islamic beliefs?","id":"tirmidhi-23-83"},{"hadith-eng":"\"The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'\" He said: \"So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'\" He said: \"I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent.[Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: \"To speak against him for that.\" refers to An-Namimah.","reference":"Jami` at-Tirmidhi 1704, Book 23, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #2","question":"How should one respond when witnessing actions that may seem questionable in leadership?","id":"tirmidhi-23-84"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed each of you is a shepherd and all of you will be questioned regarding your flock. The commander who is in authority over the Muslims is responsible and he will be questioned regarding his responsibility. The man is responsible over the inhabitants of his house and he is the one who will be questioned about them. The wife is responsible in her husband's house and she will be questioned about it. The slave is responsible regarding his master's property, and he will be questioned about it. Indeed each of you is a shepherd and each of you will be questioned about his flock.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Musa. The Hadith of Abu Musa is not preserved, and the Hadith of Anas is not preserved. And the Hadith of Ibn 'Umar is Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1705, Book 23, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of being a 'shepherd' relate to leadership and accountability in a family setting?","id":"tirmidhi-23-85"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.","reference":"Jami` at-Tirmidhi 1706, Book 23, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should Muslims respond to leadership, regardless of the leader's background, as long as they adhere to the Book of Allah?","id":"tirmidhi-23-86"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1707, Book 23, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"Under what circumstances is a Muslim exempt from obeying orders from authority?","id":"tirmidhi-23-87"},{"hadith-eng":"From Mujahid from Ibn 'Abbas who said: \"The Messenger of Allah (ﷺ) prohibited instigating fights between beasts.\"","reference":"Jami` at-Tirmidhi 1708, Book 23, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the treatment of animals in terms of causing harm or distress?","id":"tirmidhi-23-88"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited instigating fights between beasts.\" And he did not mention \"from Ibn 'Abbas\" in it.It is said that this is more correct that the (previous) narration of Qutbah.","reference":"Jami` at-Tirmidhi 1709, Book 23, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the treatment of animals in terms of causing harm or distress?","id":"tirmidhi-23-89"},{"hadith-eng":"That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\"Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.","reference":"Jami` at-Tirmidhi 1711, Book 23, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the age of fifteen become significant in determining eligibility for military service?","id":"tirmidhi-23-90"},{"hadith-eng":"That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\"[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.","reference":"Jami` at-Tirmidhi 1712, Book 23, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #2","question":"What conditions must be met for a person killed in the cause of Allah to have their sins forgiven?","id":"tirmidhi-23-91"},{"hadith-eng":"\"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\"[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas.This Hadith is Hasan SahihSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas","reference":"Jami` at-Tirmidhi 1713, Book 23, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"How were the deceased prioritized for burial according to their knowledge of the Quran?","id":"tirmidhi-23-92"},{"hadith-eng":"That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)","reference":"Jami` at-Tirmidhi 1714, Book 23, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) involve his companions in decision-making processes?","id":"tirmidhi-23-93"},{"hadith-eng":"\"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"","reference":"Jami` at-Tirmidhi 1715, Book 23, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the authenticity of a hadith affect its acceptance in Islamic jurisprudence?","id":"tirmidhi-23-94"},{"hadith-eng":"\"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.","reference":"Jami` at-Tirmidhi 1716, Book 23, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can the concept of regrouping be applied in situations of retreat or failure?","id":"tirmidhi-23-95"},{"hadith-eng":"\"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.","reference":"Jami` at-Tirmidhi 1717, Book 23, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic tradition view the relocation of martyrs after their death?","id":"tirmidhi-23-96"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1718, Book 23, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) show their respect and eagerness upon his return from expeditions?","id":"tirmidhi-23-97"},{"hadith-eng":"\"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.","reference":"Jami` at-Tirmidhi 1719, Book 23, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) manage the spoils of war for his family and the Muslim community?","id":"tirmidhi-23-98"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1670, Book 23, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did 'Amr bin Umm Maktum play in the revelation of a specific Quranic verse?","id":"tirmidhi-23-99"},{"hadith-eng":"A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.","reference":"Jami` at-Tirmidhi 1671, Book 23, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the conditions under which a person should prioritize family responsibilities over Jihad?","id":"tirmidhi-23-100"},{"hadith-eng":"That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: \"Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.","reference":"Jami` at-Tirmidhi 1672, Book 23, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"How are military expeditions viewed in the context of Islamic obedience and authority?","id":"tirmidhi-23-101"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.","reference":"Jami` at-Tirmidhi 1673, Book 23, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the knowledge of the Prophet (ﷺ) influence the advice given about traveling alone?","id":"tirmidhi-23-102"},{"hadith-eng":"From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar.Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.","reference":"Jami` at-Tirmidhi 1674, Book 23, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the potential dangers of traveling alone as mentioned in Islamic tradition?","id":"tirmidhi-23-103"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"War is deceit.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1675, Book 23, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the ethical considerations for Muslims when engaging in warfare?","id":"tirmidhi-23-104"},{"hadith-eng":"\"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1676, Book 23, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What was the first battle that Zaid bin Arqam participated in with the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-105"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.","reference":"Jami` at-Tirmidhi 1677, Book 23, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the role of narrators in the transmission of hadiths?","id":"tirmidhi-23-106"},{"hadith-eng":"\"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\"[Abu 'Eisa said:] There is something on this topic from Ibn Masu'dThis Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1678, Book 23, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the attributes of Allah from the supplication mentioned in the hadith?","id":"tirmidhi-23-107"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\"Muhammad said: \"This is the Hadith.\"[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.","reference":"Jami` at-Tirmidhi 1679, Book 23, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the importance of verifying the chain of narrators in hadith transmission?","id":"tirmidhi-23-108"},{"hadith-eng":"the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.","reference":"Jami` at-Tirmidhi 1680, Book 23, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #3","question":"Which companions of the Prophet (ﷺ) are mentioned as having narrations on the topic of the flag?","id":"tirmidhi-23-109"},{"hadith-eng":"\"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.","reference":"Jami` at-Tirmidhi 1681, Book 23, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"How are the terms 'flag' and 'standard' used in the context of Islamic history?","id":"tirmidhi-23-110"},{"hadith-eng":"From one who heard the Prophet (ﷺ) saying: \"If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'\"[Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1682, Book 23, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do specific invocations play in achieving victory or protection in battle?","id":"tirmidhi-23-111"},{"hadith-eng":"That Ibn Sirin said: \"I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.","reference":"Jami` at-Tirmidhi 1683, Book 23, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of a hadith being classified as 'Gharib' in terms of its acceptance and use?","id":"tirmidhi-23-112"},{"hadith-eng":"\"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1684, Book 23, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the circumstances under which fasting can be broken according to Islamic teachings?","id":"tirmidhi-23-113"},{"hadith-eng":"\"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.","reference":"Jami` at-Tirmidhi 1685, Book 23, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What qualities of the horse Mandub are highlighted in this narration?","id":"tirmidhi-23-114"},{"hadith-eng":"\"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1686, Book 23, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration suggest about the speed and reliability of the horse named Mandub?","id":"tirmidhi-23-115"},{"hadith-eng":"\"The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.\" He said: \"The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.\" He said: \"So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'\" - meaning the horse.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1687, Book 23, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the description of the horse as 'quick like the sea' imply about the Prophet's experience with it?","id":"tirmidhi-23-116"},{"hadith-eng":"From Al-Bara' bin 'Azib who said: \"A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'\" He said: \"No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet  without lie, I am the son of 'Abdul-Muttalib.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1688, Book 23, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"Who was holding the reins of the Prophet's mule during the battle?","id":"tirmidhi-23-117"},{"hadith-eng":"\"Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.","reference":"Jami` at-Tirmidhi 1689, Book 23, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the reaction of the Muslim army at Hunain teach about steadfastness in difficult times?","id":"tirmidhi-23-118"},{"hadith-eng":"From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: \"The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.\" Talib said: \"So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'\"[Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.","reference":"Jami` at-Tirmidhi 1690, Book 23, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the description of the Prophet's sword contribute to our understanding of his life and times?","id":"tirmidhi-23-119"},{"hadith-eng":"\"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"","reference":"Jami` at-Tirmidhi 1691, Book 23, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"How do different narrations of a hadith affect its classification and authenticity?","id":"tirmidhi-23-120"},{"hadith-eng":"\"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\"[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.","reference":"Jami` at-Tirmidhi 1692, Book 23, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of wearing coats of mail in battles during the Prophet's time?","id":"tirmidhi-23-121"},{"hadith-eng":"The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.","reference":"Jami` at-Tirmidhi 1693, Book 23, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the historical context of the Prophet wearing a helmet during the Conquest of Makkah?","id":"tirmidhi-23-122"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir.[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: \"The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1694, Book 23, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the hadith imply about the continuity of goodness in horses until the Day of Judgement?","id":"tirmidhi-23-123"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.","reference":"Jami` at-Tirmidhi 1695, Book 23, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the classification of this hadith according to Abu 'Eisa?","id":"tirmidhi-23-124"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.\"","reference":"Jami` at-Tirmidhi 1696, Book 23, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the specific features of a black horse that are highlighted in Islamic teachings?","id":"tirmidhi-23-125"},{"hadith-eng":"] This Hadith is Hasan Gharib Sahih.","reference":"Jami` at-Tirmidhi 1697, Book 23, Hadith 28","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the different categories of hadith authenticity and their meanings?","id":"tirmidhi-23-126"},{"hadith-eng":"That the Prophet (ﷺ) disliked Shikal in horses.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"","reference":"Jami` at-Tirmidhi 1698, Book 23, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of verifying the chain of narrators in hadith transmission?","id":"tirmidhi-23-127"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.","reference":"Jami` at-Tirmidhi 1699, Book 23, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What distances were used for racing horses in the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-23-128"},{"hadith-eng":"That the Prophet (ﷺ) said: \"No stake is acceptable except in archery, racing a camel, and racing a horse.\"","reference":"Jami` at-Tirmidhi 1700, Book 23, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of allowing stakes in specific activities such as archery and racing in Islamic teachings?","id":"tirmidhi-23-129"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih.Sufyan Ath-Thawri reported this from Abu Jahdam, who said: \"From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.\" He said I heard Muhammad saying: \"The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.\"","reference":"Jami` at-Tirmidhi 1701, Book 23, Hadith 32","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of not eating from charity in Islam?","id":"tirmidhi-23-130"},{"hadith-eng":"That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1702, Book 23, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"What teachings emphasize the importance of caring for the vulnerable in society?","id":"tirmidhi-23-131"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1703, Book 23, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of having a dog or a bell in a gathering from an Islamic perspective?","id":"tirmidhi-23-132"},{"hadith-eng":"\"The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'\" He said: \"So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'\" He said: \"I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent.[Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: \"To speak against him for that.\" refers to An-Namimah.","reference":"Jami` at-Tirmidhi 1704, Book 23, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the importance of love between Allah, His Messenger, and a believer?","id":"tirmidhi-23-133"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed each of you is a shepherd and all of you will be questioned regarding your flock. The commander who is in authority over the Muslims is responsible and he will be questioned regarding his responsibility. The man is responsible over the inhabitants of his house and he is the one who will be questioned about them. The wife is responsible in her husband's house and she will be questioned about it. The slave is responsible regarding his master's property, and he will be questioned about it. Indeed each of you is a shepherd and each of you will be questioned about his flock.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Musa. The Hadith of Abu Musa is not preserved, and the Hadith of Anas is not preserved. And the Hadith of Ibn 'Umar is Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1705, Book 23, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What responsibilities does a leader have towards their community according to Islamic teachings?","id":"tirmidhi-23-134"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.","reference":"Jami` at-Tirmidhi 1706, Book 23, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the farewell sermon of the Prophet emphasize about obedience to authority?","id":"tirmidhi-23-135"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1707, Book 23, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam address the issue of obedience when it conflicts with disobedience to Allah?","id":"tirmidhi-23-136"},{"hadith-eng":"From Mujahid from Ibn 'Abbas who said: \"The Messenger of Allah (ﷺ) prohibited instigating fights between beasts.\"","reference":"Jami` at-Tirmidhi 1708, Book 23, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #3","question":"What ethical considerations are highlighted in Islam regarding the interaction with animals?","id":"tirmidhi-23-137"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited instigating fights between beasts.\" And he did not mention \"from Ibn 'Abbas\" in it.It is said that this is more correct that the (previous) narration of Qutbah.","reference":"Jami` at-Tirmidhi 1709, Book 23, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #3","question":"What ethical considerations are highlighted in Islam regarding the interaction with animals?","id":"tirmidhi-23-138"},{"hadith-eng":"That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\"Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.","reference":"Jami` at-Tirmidhi 1711, Book 23, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did 'Umar bin 'Abdul-'Aziz play in establishing age-related policies?","id":"tirmidhi-23-139"},{"hadith-eng":"That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\"[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.","reference":"Jami` at-Tirmidhi 1712, Book 23, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is patience emphasized when striving in the cause of Allah?","id":"tirmidhi-23-140"},{"hadith-eng":"\"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\"[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas.This Hadith is Hasan SahihSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas","reference":"Jami` at-Tirmidhi 1713, Book 23, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration indicate about the importance of Quranic knowledge in Islamic tradition?","id":"tirmidhi-23-141"},{"hadith-eng":"That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)","reference":"Jami` at-Tirmidhi 1714, Book 23, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the hadith suggest about the Prophet Muhammad's (ﷺ) leadership style in seeking counsel?","id":"tirmidhi-23-142"},{"hadith-eng":"\"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"","reference":"Jami` at-Tirmidhi 1715, Book 23, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #3","question":"What challenges are associated with verifying the reliability of hadith narrators?","id":"tirmidhi-23-143"},{"hadith-eng":"\"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.","reference":"Jami` at-Tirmidhi 1716, Book 23, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #3","question":"What lessons can be learned from the response of the Prophet Muhammad (ﷺ) to those who fled from battle?","id":"tirmidhi-23-144"},{"hadith-eng":"\"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.","reference":"Jami` at-Tirmidhi 1717, Book 23, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do family members play in the burial process according to Islamic teachings?","id":"tirmidhi-23-145"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1718, Book 23, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the involvement of children in community events during the time of the Prophet (ﷺ)?","id":"tirmidhi-23-146"},{"hadith-eng":"\"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.","reference":"Jami` at-Tirmidhi 1719, Book 23, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration indicate about the distribution of wealth gained without battle in Islam?","id":"tirmidhi-23-147"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1670, Book 23, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are exceptions for disabled individuals addressed in Islamic teachings?","id":"tirmidhi-23-148"},{"hadith-eng":"A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.","reference":"Jami` at-Tirmidhi 1671, Book 23, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration imply about the role of family in a Muslim's life?","id":"tirmidhi-23-149"},{"hadith-eng":"That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: \"Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.","reference":"Jami` at-Tirmidhi 1672, Book 23, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the importance of verifying the authenticity of hadiths in Islamic scholarship?","id":"tirmidhi-23-150"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.","reference":"Jami` at-Tirmidhi 1673, Book 23, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"What precautions can be taken to ensure safety while traveling at night?","id":"tirmidhi-23-151"},{"hadith-eng":"From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar.Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.","reference":"Jami` at-Tirmidhi 1674, Book 23, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why might a lone traveler be compared to a Shaitan in Islamic teachings?","id":"tirmidhi-23-152"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"War is deceit.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1675, Book 23, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do different companions of the Prophet Muhammad (ﷺ) interpret the concept of deceit in war?","id":"tirmidhi-23-153"},{"hadith-eng":"\"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1676, Book 23, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the battle of Dhat Al-Ushaira or Al-'Usaira in Islamic history?","id":"tirmidhi-23-154"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.","reference":"Jami` at-Tirmidhi 1677, Book 23, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #4","question":"How do scholars assess the reliability of hadith narrators?","id":"tirmidhi-23-155"},{"hadith-eng":"\"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\"[Abu 'Eisa said:] There is something on this topic from Ibn Masu'dThis Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1678, Book 23, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of divine intervention in overcoming challenges according to Islamic teachings?","id":"tirmidhi-23-156"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\"Muhammad said: \"This is the Hadith.\"[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.","reference":"Jami` at-Tirmidhi 1679, Book 23, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the trustworthiness of narrators impact the credibility of hadiths?","id":"tirmidhi-23-157"},{"hadith-eng":"the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.","reference":"Jami` at-Tirmidhi 1680, Book 23, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of the term 'Hasan Gharib' in the context of this narration?","id":"tirmidhi-23-158"},{"hadith-eng":"\"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.","reference":"Jami` at-Tirmidhi 1681, Book 23, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who narrated the hadith about the colors of the Prophet's flag and standard?","id":"tirmidhi-23-159"},{"hadith-eng":"From one who heard the Prophet (ﷺ) saying: \"If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'\"[Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1682, Book 23, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are different narrations of a hadith reconciled when they vary in their transmission?","id":"tirmidhi-23-160"},{"hadith-eng":"That Ibn Sirin said: \"I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.","reference":"Jami` at-Tirmidhi 1683, Book 23, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role does the memory and credibility of a narrator play in the transmission of hadiths?","id":"tirmidhi-23-161"},{"hadith-eng":"\"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1684, Book 23, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of obedience to the Prophet (ﷺ) manifest in the context of fasting and warfare?","id":"tirmidhi-23-162"},{"hadith-eng":"\"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.","reference":"Jami` at-Tirmidhi 1685, Book 23, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration suggest about the Prophet's (ﷺ) ability to assess and communicate the situation to his companions?","id":"tirmidhi-23-163"},{"hadith-eng":"\"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1686, Book 23, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role did the Prophet Muhammad (ﷺ) play in ensuring the safety and security of Al-Madinah?","id":"tirmidhi-23-164"},{"hadith-eng":"\"The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.\" He said: \"The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.\" He said: \"So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'\" - meaning the horse.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1687, Book 23, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways did the Prophet Muhammad (ﷺ) show generosity and kindness to the people around him?","id":"tirmidhi-23-165"},{"hadith-eng":"From Al-Bara' bin 'Azib who said: \"A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'\" He said: \"No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet  without lie, I am the son of 'Abdul-Muttalib.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1688, Book 23, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the statement 'I am the Prophet without lie' signify about the Prophet's character?","id":"tirmidhi-23-166"},{"hadith-eng":"\"Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.","reference":"Jami` at-Tirmidhi 1689, Book 23, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"What significance does the Battle of Hunain hold in Islamic history?","id":"tirmidhi-23-167"},{"hadith-eng":"From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: \"The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.\" Talib said: \"So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'\"[Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.","reference":"Jami` at-Tirmidhi 1690, Book 23, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the use of silver in the hand-guard of the Prophet's sword indicate about the craftsmanship of that era?","id":"tirmidhi-23-168"},{"hadith-eng":"\"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"","reference":"Jami` at-Tirmidhi 1691, Book 23, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of narrators like Anas and Qatadah in the transmission of hadiths?","id":"tirmidhi-23-169"},{"hadith-eng":"\"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\"[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.","reference":"Jami` at-Tirmidhi 1692, Book 23, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"What actions or deeds can lead to the obligation of Paradise according to Islamic teachings?","id":"tirmidhi-23-170"},{"hadith-eng":"The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.","reference":"Jami` at-Tirmidhi 1693, Book 23, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this hadith reflect the Prophet's approach to justice and punishment?","id":"tirmidhi-23-171"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir.[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: \"The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1694, Book 23, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the relationship between jihad and leadership in Islam as derived from this narration?","id":"tirmidhi-23-172"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.","reference":"Jami` at-Tirmidhi 1695, Book 23, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does the term 'Hasan Gharib' indicate about a hadith?","id":"tirmidhi-23-173"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.\"","reference":"Jami` at-Tirmidhi 1696, Book 23, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of the Kumait horse in Islamic tradition?","id":"tirmidhi-23-174"},{"hadith-eng":"That the Prophet (ﷺ) disliked Shikal in horses.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"","reference":"Jami` at-Tirmidhi 1698, Book 23, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the Prophet (ﷺ) have disliked certain characteristics in horses?","id":"tirmidhi-23-175"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.","reference":"Jami` at-Tirmidhi 1699, Book 23, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who were some of the companions involved in horse racing during the Prophet's time?","id":"tirmidhi-23-176"},{"hadith-eng":"That the Prophet (ﷺ) said: \"No stake is acceptable except in archery, racing a camel, and racing a horse.\"","reference":"Jami` at-Tirmidhi 1700, Book 23, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islamic tradition view the concept of competition and wagering in sports?","id":"tirmidhi-23-177"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih.Sufyan Ath-Thawri reported this from Abu Jahdam, who said: \"From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.\" He said I heard Muhammad saying: \"The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.\"","reference":"Jami` at-Tirmidhi 1701, Book 23, Hadith 32","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the ruling on mating a donkey with a horse in Islamic teachings?","id":"tirmidhi-23-178"},{"hadith-eng":"That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1702, Book 23, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways can supporting the weak lead to blessings and assistance from Allah?","id":"tirmidhi-23-179"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1703, Book 23, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are some other factors that might prevent angels from accompanying a group?","id":"tirmidhi-23-180"},{"hadith-eng":"\"The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'\" He said: \"So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'\" He said: \"I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent.[Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: \"To speak against him for that.\" refers to An-Namimah.","reference":"Jami` at-Tirmidhi 1704, Book 23, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of An-Namimah relate to reporting actions of others?","id":"tirmidhi-23-181"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed each of you is a shepherd and all of you will be questioned regarding your flock. The commander who is in authority over the Muslims is responsible and he will be questioned regarding his responsibility. The man is responsible over the inhabitants of his house and he is the one who will be questioned about them. The wife is responsible in her husband's house and she will be questioned about it. The slave is responsible regarding his master's property, and he will be questioned about it. Indeed each of you is a shepherd and each of you will be questioned about his flock.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Musa. The Hadith of Abu Musa is not preserved, and the Hadith of Anas is not preserved. And the Hadith of Ibn 'Umar is Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1705, Book 23, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways are spouses accountable for their roles within the household in Islamic tradition?","id":"tirmidhi-23-182"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.","reference":"Jami` at-Tirmidhi 1706, Book 23, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be inferred about the Prophet's physical appearance and demeanor during his farewell sermon?","id":"tirmidhi-23-183"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1707, Book 23, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the conditions under which a Muslim must listen and obey commands?","id":"tirmidhi-23-184"},{"hadith-eng":"From Mujahid from Ibn 'Abbas who said: \"The Messenger of Allah (ﷺ) prohibited instigating fights between beasts.\"","reference":"Jami` at-Tirmidhi 1708, Book 23, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #4","question":"What teachings of the Prophet Muhammad (ﷺ) emphasize compassion towards animals?","id":"tirmidhi-23-185"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited instigating fights between beasts.\" And he did not mention \"from Ibn 'Abbas\" in it.It is said that this is more correct that the (previous) narration of Qutbah.","reference":"Jami` at-Tirmidhi 1709, Book 23, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the implications of prohibiting animal fights in Islamic teachings?","id":"tirmidhi-23-186"},{"hadith-eng":"That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\"Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.","reference":"Jami` at-Tirmidhi 1711, Book 23, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of maturity relate to responsibilities and rights in Islamic tradition?","id":"tirmidhi-23-187"},{"hadith-eng":"That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\"[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.","reference":"Jami` at-Tirmidhi 1712, Book 23, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #4","question":"What exception is mentioned regarding the forgiveness of sins for those martyred in the cause of Allah?","id":"tirmidhi-23-188"},{"hadith-eng":"\"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\"[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas.This Hadith is Hasan SahihSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas","reference":"Jami` at-Tirmidhi 1713, Book 23, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"How were multiple individuals accommodated in a single grave during the Battle of Uhud?","id":"tirmidhi-23-189"},{"hadith-eng":"That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)","reference":"Jami` at-Tirmidhi 1714, Book 23, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #4","question":"What can be learned about the importance of consultation in Islamic leadership from this narration?","id":"tirmidhi-23-190"},{"hadith-eng":"\"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"","reference":"Jami` at-Tirmidhi 1715, Book 23, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role do scholars play in determining the strength of a hadith's chain of narration?","id":"tirmidhi-23-191"},{"hadith-eng":"\"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.","reference":"Jami` at-Tirmidhi 1716, Book 23, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the term 'Al-'Akkarun' redefine the perception of fleeing in a military context?","id":"tirmidhi-23-192"},{"hadith-eng":"\"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.","reference":"Jami` at-Tirmidhi 1717, Book 23, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the importance of following the instructions of the Prophet's callers in Islamic tradition?","id":"tirmidhi-23-193"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1718, Book 23, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the term 'Hasan Sahih' indicate about the authenticity of a hadith?","id":"tirmidhi-23-194"},{"hadith-eng":"\"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.","reference":"Jami` at-Tirmidhi 1719, Book 23, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #4","question":"How were the resources from the spoils of war utilized for the cause of Allah according to this narration?","id":"tirmidhi-23-195"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.","reference":"Jami` at-Tirmidhi 1670, Book 23, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of written documentation in the preservation of Islamic teachings?","id":"tirmidhi-23-196"},{"hadith-eng":"A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.","reference":"Jami` at-Tirmidhi 1671, Book 23, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching reflect the balance between personal ambitions and family duties in Islam?","id":"tirmidhi-23-197"},{"hadith-eng":"That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: \"Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.","reference":"Jami` at-Tirmidhi 1672, Book 23, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the chain of narration contribute to the classification of a hadith as Hasan Sahih Gharib?","id":"tirmidhi-23-198"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.","reference":"Jami` at-Tirmidhi 1673, Book 23, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What insights does this teaching provide about the importance of companionship during travel?","id":"tirmidhi-23-199"},{"hadith-eng":"From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar.Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.","reference":"Jami` at-Tirmidhi 1674, Book 23, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the recommended number of people for a traveling party in Islam?","id":"tirmidhi-23-200"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"War is deceit.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1675, Book 23, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of the statement 'War is deceit' for military strategy in Islam?","id":"tirmidhi-23-201"},{"hadith-eng":"\"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1676, Book 23, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"How are the battles of the Prophet Muhammad (ﷺ) documented in Islamic tradition?","id":"tirmidhi-23-202"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.","reference":"Jami` at-Tirmidhi 1677, Book 23, Hadith 8","grade":"Da'if(Darussalam)","question #":"question #5","question":"What challenges do scholars face in authenticating hadiths?","id":"tirmidhi-23-203"},{"hadith-eng":"\"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\"[Abu 'Eisa said:] There is something on this topic from Ibn Masu'dThis Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1678, Book 23, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of Allah as the 'Revealer of the Book' relate to seeking help in difficult situations?","id":"tirmidhi-23-204"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\"Muhammad said: \"This is the Hadith.\"[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.","reference":"Jami` at-Tirmidhi 1679, Book 23, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role do different tribes and their members play in the transmission of hadiths?","id":"tirmidhi-23-205"},{"hadith-eng":"the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.","reference":"Jami` at-Tirmidhi 1680, Book 23, Hadith 11","grade":"Hasan(Darussalam)","question #":"question #5","question":"Who is identified as the source of this particular report about the Prophet's (ﷺ) flag?","id":"tirmidhi-23-206"},{"hadith-eng":"\"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.","reference":"Jami` at-Tirmidhi 1681, Book 23, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the classification of this hadith according to Abu 'Eisa?","id":"tirmidhi-23-207"},{"hadith-eng":"From one who heard the Prophet (ﷺ) saying: \"If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'\"[Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.","reference":"Jami` at-Tirmidhi 1682, Book 23, Hadith 13","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of understanding the context and variations of hadith narrations?","id":"tirmidhi-23-208"},{"hadith-eng":"That Ibn Sirin said: \"I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.\"[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.","reference":"Jami` at-Tirmidhi 1683, Book 23, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #5","question":"How do scholars assess the reliability of narrators in the science of hadith?","id":"tirmidhi-23-209"},{"hadith-eng":"\"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1684, Book 23, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned from the Prophet's (ﷺ) instructions regarding fasting during the conquest?","id":"tirmidhi-23-210"},{"hadith-eng":"\"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.","reference":"Jami` at-Tirmidhi 1685, Book 23, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet's (ﷺ) leadership qualities?","id":"tirmidhi-23-211"},{"hadith-eng":"\"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1686, Book 23, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this incident reflect the relationship between the Prophet Muhammad (ﷺ) and the people of Al-Madinah?","id":"tirmidhi-23-212"},{"hadith-eng":"\"The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.\" He said: \"The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.\" He said: \"So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'\" - meaning the horse.[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1687, Book 23, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad (ﷺ) respond to emergencies or threats in his community?","id":"tirmidhi-23-213"},{"hadith-eng":"From Al-Bara' bin 'Azib who said: \"A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'\" He said: \"No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet  without lie, I am the son of 'Abdul-Muttalib.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.","reference":"Jami` at-Tirmidhi 1688, Book 23, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role did Abu Sufyan bin Al-Harith play during the battle?","id":"tirmidhi-23-214"},{"hadith-eng":"\"Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.","reference":"Jami` at-Tirmidhi 1689, Book 23, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith describe the loyalty of the companions to the Prophet (ﷺ) during the battle?","id":"tirmidhi-23-215"},{"hadith-eng":"From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: \"The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.\" Talib said: \"So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'\"[Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.","reference":"Jami` at-Tirmidhi 1690, Book 23, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned from the details provided about the Prophet's sword in terms of Islamic tradition and heritage?","id":"tirmidhi-23-216"},{"hadith-eng":"\"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"","reference":"Jami` at-Tirmidhi 1691, Book 23, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the classification of a hadith as Hasan Gharib impact its acceptance in Islamic teachings?","id":"tirmidhi-23-217"},{"hadith-eng":"\"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\"[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.","reference":"Jami` at-Tirmidhi 1692, Book 23, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"Who are some of the companions of the Prophet known for their bravery and support during battles?","id":"tirmidhi-23-218"},{"hadith-eng":"The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.","reference":"Jami` at-Tirmidhi 1693, Book 23, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet's leadership during the Conquest of Makkah from this narration?","id":"tirmidhi-23-219"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir.[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: \"The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 1694, Book 23, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith reflect on the role of animals in Islamic warfare and their spiritual significance?","id":"tirmidhi-23-220"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.","reference":"Jami` at-Tirmidhi 1695, Book 23, Hadith 26","grade":"Hasan(Darussalam)","question #":"question #5","question":"Who is the narrator of this hadith and what is its source?","id":"tirmidhi-23-221"},{"hadith-eng":"That the Prophet (ﷺ) said: \"The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.\"","reference":"Jami` at-Tirmidhi 1696, Book 23, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #5","question":"How are the markings on a horse's legs and face relevant in determining its quality?","id":"tirmidhi-23-222"},{"hadith-eng":"That the Prophet (ﷺ) disliked Shikal in horses.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"","reference":"Jami` at-Tirmidhi 1698, Book 23, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of 'Shikal' relate to the characteristics of horses in Islamic teachings?","id":"tirmidhi-23-223"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.","reference":"Jami` at-Tirmidhi 1699, Book 23, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the meaning of the term 'Mudammar' in the context of horse racing?","id":"tirmidhi-23-224"},{"hadith-eng":"That the Prophet (ﷺ) said: \"No stake is acceptable except in archery, racing a camel, and racing a horse.\"","reference":"Jami` at-Tirmidhi 1700, Book 23, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the ethical considerations in Islam regarding placing stakes on competitions?","id":"tirmidhi-23-225"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.\"[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih.Sufyan Ath-Thawri reported this from Abu Jahdam, who said: \"From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.\" He said I heard Muhammad saying: \"The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.\"","reference":"Jami` at-Tirmidhi 1701, Book 23, Hadith 32","grade":"Hasan(Darussalam)","question #":"question #5","question":"How do scholars verify the authenticity of a hadith when there are discrepancies in its narration?","id":"tirmidhi-23-226"},{"hadith-eng":"That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1702, Book 23, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of communal responsibility manifest in Islamic teachings?","id":"tirmidhi-23-227"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1703, Book 23, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do different narrations contribute to the understanding of this teaching in Islam?","id":"tirmidhi-23-228"},{"hadith-eng":"\"The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'\" He said: \"So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'\" He said: \"I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent.[Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: \"To speak against him for that.\" refers to An-Namimah.","reference":"Jami` at-Tirmidhi 1704, Book 23, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet's (ﷺ) reaction to complaints against his companions?","id":"tirmidhi-23-229"},{"hadith-eng":"That the Prophet (ﷺ) said: \"Indeed each of you is a shepherd and all of you will be questioned regarding your flock. The commander who is in authority over the Muslims is responsible and he will be questioned regarding his responsibility. The man is responsible over the inhabitants of his house and he is the one who will be questioned about them. The wife is responsible in her husband's house and she will be questioned about it. The slave is responsible regarding his master's property, and he will be questioned about it. Indeed each of you is a shepherd and each of you will be questioned about his flock.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Musa. The Hadith of Abu Musa is not preserved, and the Hadith of Anas is not preserved. And the Hadith of Ibn 'Umar is Hasan Sahih Hadith.","reference":"Jami` at-Tirmidhi 1705, Book 23, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration emphasize the accountability of individuals in different social roles?","id":"tirmidhi-23-230"},{"hadith-eng":"I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.","reference":"Jami` at-Tirmidhi 1706, Book 23, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be drawn from the Prophet's advice regarding leadership and governance?","id":"tirmidhi-23-231"},{"hadith-eng":"That the Messenger of Allah (ﷺ) said: \"Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1707, Book 23, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding obedience to leaders in matters of personal preference?","id":"tirmidhi-23-232"},{"hadith-eng":"\"The Prophet (ﷺ) prohibited instigating fights between beasts.\" And he did not mention \"from Ibn 'Abbas\" in it.It is said that this is more correct that the (previous) narration of Qutbah.","reference":"Jami` at-Tirmidhi 1709, Book 23, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the prohibition of instigating fights between beasts reflect on the broader principles of compassion in Islam?","id":"tirmidhi-23-233"},{"hadith-eng":"That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\"Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.","reference":"Jami` at-Tirmidhi 1711, Book 23, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #5","question":"What criteria were used to assess readiness for military service in early Islamic times?","id":"tirmidhi-23-234"},{"hadith-eng":"That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\"[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.","reference":"Jami` at-Tirmidhi 1712, Book 23, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of seeking reward influence the actions of a believer in the context of Jihad?","id":"tirmidhi-23-235"},{"hadith-eng":"\"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\"[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas.This Hadith is Hasan SahihSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas","reference":"Jami` at-Tirmidhi 1713, Book 23, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet's guidance on handling the deceased in times of battle?","id":"tirmidhi-23-236"},{"hadith-eng":"That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)","reference":"Jami` at-Tirmidhi 1714, Book 23, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the hadith illustrate the Prophet Muhammad's (ﷺ) relationship with his companions?","id":"tirmidhi-23-237"},{"hadith-eng":"\"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"","reference":"Jami` at-Tirmidhi 1715, Book 23, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #5","question":"How do scholars differentiate between strong and weak hadiths in Islamic tradition?","id":"tirmidhi-23-238"},{"hadith-eng":"\"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.","reference":"Jami` at-Tirmidhi 1716, Book 23, Hadith 50","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the importance of understanding the context and meaning behind specific terms used in hadiths?","id":"tirmidhi-23-239"},{"hadith-eng":"\"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.","reference":"Jami` at-Tirmidhi 1717, Book 23, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the trustworthiness of narrators assessed in the context of hadith transmission?","id":"tirmidhi-23-240"},{"hadith-eng":"\"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.","reference":"Jami` at-Tirmidhi 1718, Book 23, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the community react to the return of the Prophet (ﷺ) from the expedition of Tabuk?","id":"tirmidhi-23-241"},{"hadith-eng":"\"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.","reference":"Jami` at-Tirmidhi 1719, Book 23, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this hadith reveal about the financial planning of the Prophet Muhammad (ﷺ) for his household?","id":"tirmidhi-23-242"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.","reference":"Jami` at-Tirmidhi 1699, Book 23, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does the hadith describe the participation of Ibn 'Umar in the horse race?","id":"tirmidhi-23-243"},{"hadith-eng":"That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\"[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.","reference":"Jami` at-Tirmidhi 1712, Book 23, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #6","question":"What role does the intention of not fleeing play in the context of martyrdom and forgiveness of sins?","id":"tirmidhi-23-244"}]