[{"hadith-eng":"\"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2036, Book 28, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does Allah's love manifest in the life of a believer according to Islamic teachings?","id":"tirmidhi-28-1"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered upon me, while `Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (ﷺ) began eating, and `Ali ate with him. The Messenger of Allah (ﷺ) said to `Ali: 'Stop, stop, for you are still recovering.' So `Ali sat and the Prophet (ﷺ) ate.\" She said: \"I made some chard and barley for them, so the Prophet (ﷺ) said: 'O `Ali eat from this, for indeed it will be more suitable for you.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2037, Book 28, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #1","question":"What considerations should be taken into account when choosing food for someone who is recovering from an illness?","id":"tirmidhi-28-2"},{"hadith-eng":"\"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"","reference":"Jami` at-Tirmidhi 2038, Book 28, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on seeking medical treatment for illnesses?","id":"tirmidhi-28-3"},{"hadith-eng":"\"Whenever one of the wives of the Messenger of Allah (s.a.w) became (feverishly) ill, he would order that some broth be prepared. Then he would tell them to take some of the broth. And he would say: 'It firms the heart of the grieved, and it rids the worries from the heart of the ill just as one of you removes dirt from her face with water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2039, Book 28, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of broth in the context of healing and comfort according to Islamic tradition?","id":"tirmidhi-28-4"},{"hadith-eng":"\"Do not force your sick to eat, for indeed Allah, Blessed and Most High, provides them food and drink.\"(Dai'f)","reference":"Jami` at-Tirmidhi 2040, Book 28, Hadith 5","grade":"","question #":"question #1","question":"What guidance is provided regarding feeding sick individuals in Islam?","id":"tirmidhi-28-5"},{"hadith-eng":"\"Use this black seed. For indeed it contains a cure for every disease except As-Sam\" And As-Sam is death.","reference":"Jami` at-Tirmidhi 2041, Book 28, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of black seed in Islamic medicine?","id":"tirmidhi-28-6"},{"hadith-eng":"\"Drink from their milk and Urine\".","reference":"Jami` at-Tirmidhi 2042, Book 28, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance did the Prophet Muhammad (s.a.w) provide for people who were uncomfortable with the climate of Al-Madinah?","id":"tirmidhi-28-7"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.\"","reference":"Jami` at-Tirmidhi 2043, Book 28, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences of committing suicide according to Islamic teachings?","id":"tirmidhi-28-8"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2044, Book 28, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences of committing suicide according to Islamic teachings?","id":"tirmidhi-28-9"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) forbade from cures that are Khabith.\" [Abu 'Elsa said:] Meaning poison","reference":"Jami` at-Tirmidhi 2045, Book 28, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What types of cures are considered forbidden in Islam?","id":"tirmidhi-28-10"},{"hadith-eng":"\"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2046, Book 28, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on using intoxicants for medicinal purposes?","id":"tirmidhi-28-11"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud.\"(Daif)","reference":"Jami` at-Tirmidhi 2047, Book 28, Hadith 12","grade":"","question #":"question #1","question":"What are some traditional treatments mentioned for ailments in Islamic teachings?","id":"tirmidhi-28-12"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' And the best of what you use for Kuhl is Ithmid, for it clears the vision and grows the hair (eye-lashes).\" And he said:\" The Messenger of Allah (s.a.w) had a Kuhl holder with which he would apply Kuhl before sleeping three in each eye.\"","reference":"Jami` at-Tirmidhi 2048, Book 28, Hadith 13","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are some traditional treatments recommended in Islamic teachings for health and wellness?","id":"tirmidhi-28-13"},{"hadith-eng":"\"We were tested (with severe medical condition) so we were cauterized, but we did not have good results, nor was it successful for us.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2049, Book 28, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on the use of cauterization as a medical treatment?","id":"tirmidhi-28-14"},{"hadith-eng":"\"The Prophet (S.A.W) cauterized As'ad bin Zurarah for Shawkah.\"","reference":"Jami` at-Tirmidhi 2050, Book 28, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the practice of cauterization in Islamic medical treatment?","id":"tirmidhi-28-15"},{"hadith-eng":"\"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"","reference":"Jami` at-Tirmidhi 2051, Book 28, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the recommended dates for cupping according to Islamic tradition?","id":"tirmidhi-28-16"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"","reference":"Jami` at-Tirmidhi 2052, Book 28, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #1","question":"What significance does the practice of cupping hold in Islamic tradition?","id":"tirmidhi-28-17"},{"hadith-eng":"\"Ibn 'Abbas had three boys who were cuppers. He would use the proceeds from two of them for himself and his family, and one of them would cup him and his family.\" He said: \" Ibn 'Abbas said: 'The Prophet (S.A.W) said: 'How excellent is the slave who cups, letting the blood, relieving the back, and clearing the vision.\" And he said: \"Indeed the best for you to cup on are the seventeenth, the nineteenth, and the twenty-first.\" And he said: \"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.\" And indeed, The Messenger of Allah (S.A.W) was given medicine by Al-Abbas and his companions. So the The Messenger of Allah (S.A.W) said: \"Who gave me this medicine?\" All of them were silent, so he said that there shall not remain anyone in the house but he should be treated with Ladud except for his uncle Al-Abbas.'\" An-Nadr said: \"Al-Ladud is Al-Wajur.\"","reference":"Jami` at-Tirmidhi 2053, Book 28, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the benefits of cupping as mentioned in the teachings of the Prophet Muhammad (S.A.W)?","id":"tirmidhi-28-18"},{"hadith-eng":"\"There was no wound nor cut on the Messenger of Allah (S.A.W) but he would order me to put Hinna on it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2054, Book 28, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of using Hinna for treating wounds in Islamic tradition?","id":"tirmidhi-28-19"},{"hadith-eng":"\"Whoever seeks treatment by cauterization, or with Ruqyah, then he has absolved himself of At-Tawakkul (reliance upon Allah).\"","reference":"Jami` at-Tirmidhi 2055, Book 28, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of relying on Allah in the context of seeking medical treatment?","id":"tirmidhi-28-20"},{"hadith-eng":"the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2056, Book 28, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What ailments did the Prophet Muhammad (s.a.w) allow Ruqyah to be used for?","id":"tirmidhi-28-21"},{"hadith-eng":"\"No Ruqyah except for the (evil) eye and the scorpion sting.\"","reference":"Jami` at-Tirmidhi 2057, Book 28, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the specific conditions under which Ruqyah is considered permissible in Islam?","id":"tirmidhi-28-22"},{"hadith-eng":"\"The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So when they were revealed he used them and left other than them.\"","reference":"Jami` at-Tirmidhi 2058, Book 28, Hadith 23","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are Al-Mu'awwidhatain and what significance do they hold in seeking protection?","id":"tirmidhi-28-23"},{"hadith-eng":"\" I said: 'O Messenger of Allah (S.A.W)! Some of Ja'far's children have suffered from an accelerated case of the inflammation of the eye, so should I have them treated with Ruqyah?' He said: 'Yes,for indeed if there was anything that could overcome the Decree, then the evil eye would overcome it.\"","reference":"Jami` at-Tirmidhi 2059, Book 28, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Ruqyah in Islamic tradition for treating ailments?","id":"tirmidhi-28-24"},{"hadith-eng":"\"\"U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye).\" And he would say: \"It is with this that Ibrahim would seek refuge for Ishhaq and Ismail [peace be upon them].\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2060, Book 28, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeking refuge in the Perfect Words of Allah for protection?","id":"tirmidhi-28-25"},{"hadith-eng":"\"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"","reference":"Jami` at-Tirmidhi 2062, Book 28, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the evil eye in Islamic teachings?","id":"tirmidhi-28-26"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"","reference":"Jami` at-Tirmidhi 2063, Book 28, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Ruqyah in Islamic tradition and how is it performed?","id":"tirmidhi-28-27"},{"hadith-eng":"\"Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that.\" He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?'  And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'\"","reference":"Jami` at-Tirmidhi 2064, Book 28, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of hospitality in Islamic culture as demonstrated by the actions of the Bedouins?","id":"tirmidhi-28-28"},{"hadith-eng":"\"I asked the Messenger of Allah (S.A.W): 'O Messenger of Allah(S.A.W)! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves will contradict anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2065, Book 28, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the relationship between using Ruqyah and Allah's Decree?","id":"tirmidhi-28-29"},{"hadith-eng":"\"Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2066, Book 28, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the health benefits associated with consuming Al-'Ajwah dates?","id":"tirmidhi-28-30"},{"hadith-eng":"\"Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2067, Book 28, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are truffles considered to be in Islamic teachings?","id":"tirmidhi-28-31"},{"hadith-eng":"\"Truffles are the earth's smallpox.\" So the Messenger of Allah (S.A.W) said: \"Truffles are a form of manna, and its liquid is a cure for the eye. Al-'Ajwah is from Paradise, and it contains a cure for poison.\"","reference":"Jami` at-Tirmidhi 2068, Book 28, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the medicinal benefits of truffles according to Islamic teachings?","id":"tirmidhi-28-32"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah said: 'I took three truffles, or five, or seven, and pressed them. Then I put their liquid in a bottle, and I used it on the eyes of a slave girl of mine so she was cured.'\"","reference":"Jami` at-Tirmidhi 2069, Book 28, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the medicinal uses of truffles in Islamic tradition?","id":"tirmidhi-28-33"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah  said:'Ash-Shuniz is a cure for  every disease except As-Sam.'  Qatadah said: \"One takes twenty-one seeds daily, and puts them in a cloth, then infuses (water) and sniffs two drops in his right nostril, and one drop in the left. The second (day) two drops are sniffed in the left, and one drop in the right. The third (day) two drops in the right and one drop in the left.\"","reference":"Jami` at-Tirmidhi 2070, Book 28, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Ash-Shuniz in Islamic medicine?","id":"tirmidhi-28-34"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 2071, Book 28, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of prohibiting the sale of dogs in Islamic teachings?","id":"tirmidhi-28-35"},{"hadith-eng":"\"I entered upon 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani to visit him, while he had Humrah. I said:'Why don't you hang something?' He said: 'Death is better than that. The Prophet (S.A.W) said: \"Whoever hangs something, he is entrusted to it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2072, Book 28, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of relying on objects or amulets for protection in Islamic teachings?","id":"tirmidhi-28-36"},{"hadith-eng":"\"Fever is from the agitation of the Fire, so cool it with water.\"","reference":"Jami` at-Tirmidhi 2073, Book 28, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the relationship between fever and the concept of fire in Islamic teachings?","id":"tirmidhi-28-37"},{"hadith-eng":"\"Fever is from the heat of the Hell, so cool it with water.\"\n\nAnother chain reports similar narration.","reference":"Jami` at-Tirmidhi 2074, Book 28, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of using water to treat fever in Islamic teachings?","id":"tirmidhi-28-38"},{"hadith-eng":"\"For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the Great, I seek refuge with Allah the Magnificent from the evil of every gushing vein, and from the evil of the heat of the Fire)\"","reference":"Jami` at-Tirmidhi 2075, Book 28, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #1","question":"What supplication did the Prophet Muhammad (S.A.W) teach for relief from fever and pain?","id":"tirmidhi-28-39"},{"hadith-eng":"\"I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'\"","reference":"Jami` at-Tirmidhi 2076, Book 28, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is Al-Ghilah and why was there a consideration to prohibit it?","id":"tirmidhi-28-40"},{"hadith-eng":"\"I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\"","reference":"Jami` at-Tirmidhi 2077, Book 28, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is Al-Ghilah and why was there a consideration to prohibit it?","id":"tirmidhi-28-41"},{"hadith-eng":"\"The Prophet (S.A.W) would acclaim oil and Wars for (the treatment of) pleurisy.\" Qatadah said: \"And it is put in the mouth on the side which he is suffering. \"","reference":"Jami` at-Tirmidhi 2078, Book 28, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #1","question":"What natural remedies did the Prophet (S.A.W) recommend for treating pleurisy?","id":"tirmidhi-28-42"},{"hadith-eng":"\"I heard Zaid bin Arqam say: 'The Messenger of Allah (S.A.W) ordered us to use Qust Al-Bahri and oil to treat Pleurisy.'\"","reference":"Jami` at-Tirmidhi 2079, Book 28, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #1","question":"What remedy did the Prophet Muhammad (S.A.W) recommend for treating pleurisy?","id":"tirmidhi-28-43"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah (S.A.W) said: 'Rub it with your right hand seven times and say A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\" He said: \"So I did it, and Allah removed what I had, and I never ceased telling my family and others to do it.\"","reference":"Jami` at-Tirmidhi 2080, Book 28, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of using the right hand in Islamic practices for seeking healing or protection?","id":"tirmidhi-28-44"},{"hadith-eng":"\"Shubrum\" He said: \"It is hot and too strong.\" She said:\"Then I used Senna as a laxative.\" So the Prophet (S.A.W) said: \"If there was anything that would have a cure for death in it, then it would have been Senna.\"","reference":"Jami` at-Tirmidhi 2081, Book 28, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the medicinal properties of Senna according to Islamic teachings?","id":"tirmidhi-28-45"},{"hadith-eng":"\"A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.'\" He said: \"So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.'\" He said: \"The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'\"","reference":"Jami` at-Tirmidhi 2082, Book 28, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of honey in Islamic medicine according to the teachings of the Prophet (S.A.W)?","id":"tirmidhi-28-46"},{"hadith-eng":"\"There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.\"","reference":"Jami` at-Tirmidhi 2083, Book 28, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of visiting a sick person in Islam?","id":"tirmidhi-28-47"},{"hadith-eng":"\"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummashfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"","reference":"Jami` at-Tirmidhi 2084, Book 28, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of using water as a remedy for fever in Islamic teachings?","id":"tirmidhi-28-48"},{"hadith-eng":"\"While I was listening, Sahl bin Sa'd was asked: 'What were the wounds of the Messenger of Allah (S.A.W) treated with?' He said: 'None is alive who is more knowledgeable of it than I. 'Ali would come with water in his shield, and Fatimah would use it to wash his blood off,and a mat was burnt for him and his wounds were filled with it(its ashes).\"","reference":"Jami` at-Tirmidhi 2085, Book 28, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who were involved in treating the wounds of the Prophet Muhammad (S.A.W)?","id":"tirmidhi-28-49"},{"hadith-eng":"\"The parable of the ill when he is cured and becomes healthy is that of hail that falls from the heavens in its purity and its color.\"","reference":"Jami` at-Tirmidhi 2086, Book 28, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of comparing a cured ill person to hail in terms of purity and renewal?","id":"tirmidhi-28-50"},{"hadith-eng":"\"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"","reference":"Jami` at-Tirmidhi 2087, Book 28, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of offering reassurance to someone who is ill?","id":"tirmidhi-28-51"},{"hadith-eng":"\"Cheer up, for indeed Allah said: 'It is My Fire which I impose upon My sinning slave as his portion of the Fire.\" (Hasan)\n\nAl-Hasan said:\n\"They would hope that the fever that occurred at night would atone for any deficiency caused by sins.\"","reference":"Jami` at-Tirmidhi 2088, Book 28, Hadith 53","grade":"","question #":"question #1","question":"What is the significance of illness in relation to atonement for sins in Islamic teachings?","id":"tirmidhi-28-52"},{"hadith-eng":"\"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2036, Book 28, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of being prevented from worldly matters in the context of divine love?","id":"tirmidhi-28-53"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered upon me, while `Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (ﷺ) began eating, and `Ali ate with him. The Messenger of Allah (ﷺ) said to `Ali: 'Stop, stop, for you are still recovering.' So `Ali sat and the Prophet (ﷺ) ate.\" She said: \"I made some chard and barley for them, so the Prophet (ﷺ) said: 'O `Ali eat from this, for indeed it will be more suitable for you.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2037, Book 28, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate care and concern for the health of his companions?","id":"tirmidhi-28-54"},{"hadith-eng":"\"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"","reference":"Jami` at-Tirmidhi 2038, Book 28, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the relationship between diseases and their cures?","id":"tirmidhi-28-55"},{"hadith-eng":"\"Whenever one of the wives of the Messenger of Allah (s.a.w) became (feverishly) ill, he would order that some broth be prepared. Then he would tell them to take some of the broth. And he would say: 'It firms the heart of the grieved, and it rids the worries from the heart of the ill just as one of you removes dirt from her face with water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2039, Book 28, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (peace be upon him) care for his wives when they were ill?","id":"tirmidhi-28-56"},{"hadith-eng":"\"Do not force your sick to eat, for indeed Allah, Blessed and Most High, provides them food and drink.\"(Dai'f)","reference":"Jami` at-Tirmidhi 2040, Book 28, Hadith 5","grade":"","question #":"question #2","question":"How does Islam view the natural provision of sustenance by Allah for those who are ill?","id":"tirmidhi-28-57"},{"hadith-eng":"\"Use this black seed. For indeed it contains a cure for every disease except As-Sam\" And As-Sam is death.","reference":"Jami` at-Tirmidhi 2041, Book 28, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the limitations of black seed as a cure according to Islamic teachings?","id":"tirmidhi-28-58"},{"hadith-eng":"\"Drink from their milk and Urine\".","reference":"Jami` at-Tirmidhi 2042, Book 28, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"What remedy involving camels was suggested by the Prophet Muhammad (s.a.w) for certain health issues?","id":"tirmidhi-28-59"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.\"","reference":"Jami` at-Tirmidhi 2043, Book 28, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the punishment for suicide described in the afterlife in Islamic belief?","id":"tirmidhi-28-60"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2044, Book 28, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the punishment for suicide described in the afterlife in Islamic belief?","id":"tirmidhi-28-61"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) forbade from cures that are Khabith.\" [Abu 'Elsa said:] Meaning poison","reference":"Jami` at-Tirmidhi 2045, Book 28, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain substances be prohibited for use as cures in Islamic teachings?","id":"tirmidhi-28-62"},{"hadith-eng":"\"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2046, Book 28, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the use of substances that are considered harmful or intoxicating?","id":"tirmidhi-28-63"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud.\"(Daif)","reference":"Jami` at-Tirmidhi 2047, Book 28, Hadith 12","grade":"","question #":"question #2","question":"How did the companions of the Prophet respond to his illness according to Islamic tradition?","id":"tirmidhi-28-64"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' And the best of what you use for Kuhl is Ithmid, for it clears the vision and grows the hair (eye-lashes).\" And he said:\" The Messenger of Allah (s.a.w) had a Kuhl holder with which he would apply Kuhl before sleeping three in each eye.\"","reference":"Jami` at-Tirmidhi 2048, Book 28, Hadith 13","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of using Ithmid as Kuhl according to Islamic tradition?","id":"tirmidhi-28-65"},{"hadith-eng":"\"We were tested (with severe medical condition) so we were cauterized, but we did not have good results, nor was it successful for us.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2049, Book 28, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet respond to medical challenges according to Islamic teachings?","id":"tirmidhi-28-66"},{"hadith-eng":"\"The Prophet (S.A.W) cauterized As'ad bin Zurarah for Shawkah.\"","reference":"Jami` at-Tirmidhi 2050, Book 28, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was As'ad bin Zurarah and what was his significance in early Islamic history?","id":"tirmidhi-28-67"},{"hadith-eng":"\"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"","reference":"Jami` at-Tirmidhi 2051, Book 28, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #2","question":"Which areas of the body did the Prophet Muhammad (S.A.W) prefer for cupping?","id":"tirmidhi-28-68"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"","reference":"Jami` at-Tirmidhi 2052, Book 28, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why might angels emphasize the importance of cupping to the Prophet Muhammad (S.A.W)?","id":"tirmidhi-28-69"},{"hadith-eng":"\"Ibn 'Abbas had three boys who were cuppers. He would use the proceeds from two of them for himself and his family, and one of them would cup him and his family.\" He said: \" Ibn 'Abbas said: 'The Prophet (S.A.W) said: 'How excellent is the slave who cups, letting the blood, relieving the back, and clearing the vision.\" And he said: \"Indeed the best for you to cup on are the seventeenth, the nineteenth, and the twenty-first.\" And he said: \"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.\" And indeed, The Messenger of Allah (S.A.W) was given medicine by Al-Abbas and his companions. So the The Messenger of Allah (S.A.W) said: \"Who gave me this medicine?\" All of them were silent, so he said that there shall not remain anyone in the house but he should be treated with Ladud except for his uncle Al-Abbas.'\" An-Nadr said: \"Al-Ladud is Al-Wajur.\"","reference":"Jami` at-Tirmidhi 2053, Book 28, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #2","question":"On which specific days is cupping recommended according to Islamic tradition?","id":"tirmidhi-28-70"},{"hadith-eng":"\"There was no wound nor cut on the Messenger of Allah (S.A.W) but he would order me to put Hinna on it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2054, Book 28, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (S.A.W) approach the treatment of physical injuries?","id":"tirmidhi-28-71"},{"hadith-eng":"\"Whoever seeks treatment by cauterization, or with Ruqyah, then he has absolved himself of At-Tawakkul (reliance upon Allah).\"","reference":"Jami` at-Tirmidhi 2055, Book 28, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does seeking treatment through cauterization or Ruqyah relate to one's faith in divine reliance?","id":"tirmidhi-28-72"},{"hadith-eng":"the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2056, Book 28, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is Ruqyah and in what situations is it considered permissible in Islam?","id":"tirmidhi-28-73"},{"hadith-eng":"\"No Ruqyah except for the (evil) eye and the scorpion sting.\"","reference":"Jami` at-Tirmidhi 2057, Book 28, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the common ailments or afflictions for which Ruqyah is recommended?","id":"tirmidhi-28-74"},{"hadith-eng":"\"The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So when they were revealed he used them and left other than them.\"","reference":"Jami` at-Tirmidhi 2058, Book 28, Hadith 23","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (S.A.W) seek protection from the jinn and the evil eye before the revelation of Al-Mu'awwidhatain?","id":"tirmidhi-28-75"},{"hadith-eng":"\" I said: 'O Messenger of Allah (S.A.W)! Some of Ja'far's children have suffered from an accelerated case of the inflammation of the eye, so should I have them treated with Ruqyah?' He said: 'Yes,for indeed if there was anything that could overcome the Decree, then the evil eye would overcome it.\"","reference":"Jami` at-Tirmidhi 2059, Book 28, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the evil eye relate to the concept of divine decree in Islam?","id":"tirmidhi-28-76"},{"hadith-eng":"\"\"U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye).\" And he would say: \"It is with this that Ibrahim would seek refuge for Ishhaq and Ismail [peace be upon them].\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2060, Book 28, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (S.A.W) seek protection for his grandsons, Al-Hasan and Al-Husain?","id":"tirmidhi-28-77"},{"hadith-eng":"\"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"","reference":"Jami` at-Tirmidhi 2062, Book 28, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of the evil eye relate to the idea of divine decree in Islam?","id":"tirmidhi-28-78"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"","reference":"Jami` at-Tirmidhi 2063, Book 28, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"What ethical considerations are involved in accepting compensation for performing Ruqyah?","id":"tirmidhi-28-79"},{"hadith-eng":"\"Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that.\" He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?'  And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'\"","reference":"Jami` at-Tirmidhi 2064, Book 28, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can the recitation of Surat Al-Fatihah be used as a form of healing or Ruqyah?","id":"tirmidhi-28-80"},{"hadith-eng":"\"I asked the Messenger of Allah (S.A.W): 'O Messenger of Allah(S.A.W)! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves will contradict anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2065, Book 28, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #2","question":"How do treatments and protective measures relate to divine destiny in Islam?","id":"tirmidhi-28-81"},{"hadith-eng":"\"Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2066, Book 28, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the concept of manna related to truffles in Islamic teachings?","id":"tirmidhi-28-82"},{"hadith-eng":"\"Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2067, Book 28, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of manna in Islamic tradition?","id":"tirmidhi-28-83"},{"hadith-eng":"\"Truffles are the earth's smallpox.\" So the Messenger of Allah (S.A.W) said: \"Truffles are a form of manna, and its liquid is a cure for the eye. Al-'Ajwah is from Paradise, and it contains a cure for poison.\"","reference":"Jami` at-Tirmidhi 2068, Book 28, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is manna described in Islamic tradition?","id":"tirmidhi-28-84"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah said: 'I took three truffles, or five, or seven, and pressed them. Then I put their liquid in a bottle, and I used it on the eyes of a slave girl of mine so she was cured.'\"","reference":"Jami` at-Tirmidhi 2069, Book 28, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can natural remedies be used for healing according to Islamic teachings?","id":"tirmidhi-28-85"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah  said:'Ash-Shuniz is a cure for  every disease except As-Sam.'  Qatadah said: \"One takes twenty-one seeds daily, and puts them in a cloth, then infuses (water) and sniffs two drops in his right nostril, and one drop in the left. The second (day) two drops are sniffed in the left, and one drop in the right. The third (day) two drops in the right and one drop in the left.\"","reference":"Jami` at-Tirmidhi 2070, Book 28, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is Ash-Shuniz used as a remedy according to traditional practices?","id":"tirmidhi-28-86"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 2071, Book 28, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the income from fornication considered impermissible in Islam?","id":"tirmidhi-28-87"},{"hadith-eng":"\"I entered upon 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani to visit him, while he had Humrah. I said:'Why don't you hang something?' He said: 'Death is better than that. The Prophet (S.A.W) said: \"Whoever hangs something, he is entrusted to it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2072, Book 28, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam view the use of talismans or charms for healing or protection?","id":"tirmidhi-28-88"},{"hadith-eng":"\"Fever is from the agitation of the Fire, so cool it with water.\"","reference":"Jami` at-Tirmidhi 2073, Book 28, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can water be used as a remedy for fever according to Islamic tradition?","id":"tirmidhi-28-89"},{"hadith-eng":"\"Fever is from the heat of the Hell, so cool it with water.\"\n\nAnother chain reports similar narration.","reference":"Jami` at-Tirmidhi 2074, Book 28, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is fever related to the concept of Hell in Islamic belief?","id":"tirmidhi-28-90"},{"hadith-eng":"\"For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the Great, I seek refuge with Allah the Magnificent from the evil of every gushing vein, and from the evil of the heat of the Fire)\"","reference":"Jami` at-Tirmidhi 2075, Book 28, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the significance of seeking refuge in Allah's names during illness?","id":"tirmidhi-28-91"},{"hadith-eng":"\"I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'\"","reference":"Jami` at-Tirmidhi 2076, Book 28, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the practices of the Persians and Romans influence Islamic rulings on certain matters?","id":"tirmidhi-28-92"},{"hadith-eng":"\"I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\"","reference":"Jami` at-Tirmidhi 2077, Book 28, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do cultural practices of Persians and Romans influence Islamic rulings?","id":"tirmidhi-28-93"},{"hadith-eng":"\"The Prophet (S.A.W) would acclaim oil and Wars for (the treatment of) pleurisy.\" Qatadah said: \"And it is put in the mouth on the side which he is suffering. \"","reference":"Jami` at-Tirmidhi 2078, Book 28, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is oil used in the treatment of pleurisy according to Islamic tradition?","id":"tirmidhi-28-94"},{"hadith-eng":"\"I heard Zaid bin Arqam say: 'The Messenger of Allah (S.A.W) ordered us to use Qust Al-Bahri and oil to treat Pleurisy.'\"","reference":"Jami` at-Tirmidhi 2079, Book 28, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is Qust Al-Bahri and how is it used in Islamic medicine?","id":"tirmidhi-28-95"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah (S.A.W) said: 'Rub it with your right hand seven times and say A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\" He said: \"So I did it, and Allah removed what I had, and I never ceased telling my family and others to do it.\"","reference":"Jami` at-Tirmidhi 2080, Book 28, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can reciting specific supplications aid in alleviating physical pain according to Islamic teachings?","id":"tirmidhi-28-96"},{"hadith-eng":"\"Shubrum\" He said: \"It is hot and too strong.\" She said:\"Then I used Senna as a laxative.\" So the Prophet (S.A.W) said: \"If there was anything that would have a cure for death in it, then it would have been Senna.\"","reference":"Jami` at-Tirmidhi 2081, Book 28, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (S.A.W) view the use of strong laxatives like Shubrum?","id":"tirmidhi-28-97"},{"hadith-eng":"\"A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.'\" He said: \"So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.'\" He said: \"The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'\"","reference":"Jami` at-Tirmidhi 2082, Book 28, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this narration illustrate the relationship between divine guidance and human understanding in seeking cures?","id":"tirmidhi-28-98"},{"hadith-eng":"\"There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.\"","reference":"Jami` at-Tirmidhi 2083, Book 28, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many times should a specific supplication be recited for the recovery of a sick person?","id":"tirmidhi-28-99"},{"hadith-eng":"\"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummashfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"","reference":"Jami` at-Tirmidhi 2084, Book 28, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the direction of a flowing river play a role in the treatment of fever according to Islamic tradition?","id":"tirmidhi-28-100"},{"hadith-eng":"\"While I was listening, Sahl bin Sa'd was asked: 'What were the wounds of the Messenger of Allah (S.A.W) treated with?' He said: 'None is alive who is more knowledgeable of it than I. 'Ali would come with water in his shield, and Fatimah would use it to wash his blood off,and a mat was burnt for him and his wounds were filled with it(its ashes).\"","reference":"Jami` at-Tirmidhi 2085, Book 28, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #2","question":"What materials were used to treat the wounds of the Prophet Muhammad (S.A.W)?","id":"tirmidhi-28-101"},{"hadith-eng":"\"The parable of the ill when he is cured and becomes healthy is that of hail that falls from the heavens in its purity and its color.\"","reference":"Jami` at-Tirmidhi 2086, Book 28, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the metaphor of hail relate to the concept of health and recovery in Islamic teachings?","id":"tirmidhi-28-102"},{"hadith-eng":"\"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"","reference":"Jami` at-Tirmidhi 2087, Book 28, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #2","question":"How can comforting words impact the emotional state of a sick person?","id":"tirmidhi-28-103"},{"hadith-eng":"\"Cheer up, for indeed Allah said: 'It is My Fire which I impose upon My sinning slave as his portion of the Fire.\" (Hasan)\n\nAl-Hasan said:\n\"They would hope that the fever that occurred at night would atone for any deficiency caused by sins.\"","reference":"Jami` at-Tirmidhi 2088, Book 28, Hadith 53","grade":"","question #":"question #2","question":"How does the concept of divine mercy manifest in the context of a believer's suffering?","id":"tirmidhi-28-104"},{"hadith-eng":"\"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2036, Book 28, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"How can worldly deprivation be seen as a form of protection or care in Islam?","id":"tirmidhi-28-105"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered upon me, while `Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (ﷺ) began eating, and `Ali ate with him. The Messenger of Allah (ﷺ) said to `Ali: 'Stop, stop, for you are still recovering.' So `Ali sat and the Prophet (ﷺ) ate.\" She said: \"I made some chard and barley for them, so the Prophet (ﷺ) said: 'O `Ali eat from this, for indeed it will be more suitable for you.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2037, Book 28, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the Prophet Muhammad (ﷺ) advising Ali to stop eating unripe dates?","id":"tirmidhi-28-106"},{"hadith-eng":"\"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"","reference":"Jami` at-Tirmidhi 2038, Book 28, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"What exception does the Prophet Muhammad (s.a.w) mention regarding diseases that have no cure?","id":"tirmidhi-28-107"},{"hadith-eng":"\"Whenever one of the wives of the Messenger of Allah (s.a.w) became (feverishly) ill, he would order that some broth be prepared. Then he would tell them to take some of the broth. And he would say: 'It firms the heart of the grieved, and it rids the worries from the heart of the ill just as one of you removes dirt from her face with water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2039, Book 28, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the benefits of consuming broth for someone who is grieving or ill?","id":"tirmidhi-28-108"},{"hadith-eng":"\"Do not force your sick to eat, for indeed Allah, Blessed and Most High, provides them food and drink.\"(Dai'f)","reference":"Jami` at-Tirmidhi 2040, Book 28, Hadith 5","grade":"","question #":"question #3","question":"What is the significance of not forcing food upon the sick according to Islamic teachings?","id":"tirmidhi-28-109"},{"hadith-eng":"\"Use this black seed. For indeed it contains a cure for every disease except As-Sam\" And As-Sam is death.","reference":"Jami` at-Tirmidhi 2041, Book 28, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is death perceived in relation to cures in Islamic belief?","id":"tirmidhi-28-110"},{"hadith-eng":"\"Drink from their milk and Urine\".","reference":"Jami` at-Tirmidhi 2042, Book 28, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (s.a.w) utilize resources from charity to assist those in need?","id":"tirmidhi-28-111"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.\"","reference":"Jami` at-Tirmidhi 2043, Book 28, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does Islamic tradition say about the eternal state of those who commit suicide?","id":"tirmidhi-28-112"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2044, Book 28, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different methods of suicide mentioned and their respective punishments in the afterlife?","id":"tirmidhi-28-113"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) forbade from cures that are Khabith.\" [Abu 'Elsa said:] Meaning poison","reference":"Jami` at-Tirmidhi 2045, Book 28, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of avoiding harmful or impure substances in medical treatments according to Islamic principles?","id":"tirmidhi-28-114"},{"hadith-eng":"\"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2046, Book 28, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does Islam provide regarding the treatment of illnesses with substances that may cause harm?","id":"tirmidhi-28-115"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud.\"(Daif)","reference":"Jami` at-Tirmidhi 2047, Book 28, Hadith 12","grade":"","question #":"question #3","question":"What is the significance of Al-Ladud in the context of prophetic medicine?","id":"tirmidhi-28-116"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' And the best of what you use for Kuhl is Ithmid, for it clears the vision and grows the hair (eye-lashes).\" And he said:\" The Messenger of Allah (s.a.w) had a Kuhl holder with which he would apply Kuhl before sleeping three in each eye.\"","reference":"Jami` at-Tirmidhi 2048, Book 28, Hadith 13","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the use of Ithmid Kuhl benefit the eyes and eyelashes?","id":"tirmidhi-28-117"},{"hadith-eng":"\"We were tested (with severe medical condition) so we were cauterized, but we did not have good results, nor was it successful for us.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2049, Book 28, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of using medical treatments that are not successful in Islamic tradition?","id":"tirmidhi-28-118"},{"hadith-eng":"\"The Prophet (S.A.W) cauterized As'ad bin Zurarah for Shawkah.\"","reference":"Jami` at-Tirmidhi 2050, Book 28, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the views on using cauterization as a medical treatment in Islam?","id":"tirmidhi-28-119"},{"hadith-eng":"\"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"","reference":"Jami` at-Tirmidhi 2051, Book 28, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of cupping in Islamic medical practices?","id":"tirmidhi-28-120"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"","reference":"Jami` at-Tirmidhi 2052, Book 28, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #3","question":"How is the Night of Isra' connected to the practice of cupping in Islam?","id":"tirmidhi-28-121"},{"hadith-eng":"\"Ibn 'Abbas had three boys who were cuppers. He would use the proceeds from two of them for himself and his family, and one of them would cup him and his family.\" He said: \" Ibn 'Abbas said: 'The Prophet (S.A.W) said: 'How excellent is the slave who cups, letting the blood, relieving the back, and clearing the vision.\" And he said: \"Indeed the best for you to cup on are the seventeenth, the nineteenth, and the twenty-first.\" And he said: \"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.\" And indeed, The Messenger of Allah (S.A.W) was given medicine by Al-Abbas and his companions. So the The Messenger of Allah (S.A.W) said: \"Who gave me this medicine?\" All of them were silent, so he said that there shall not remain anyone in the house but he should be treated with Ladud except for his uncle Al-Abbas.'\" An-Nadr said: \"Al-Ladud is Al-Wajur.\"","reference":"Jami` at-Tirmidhi 2053, Book 28, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are some of the traditional treatments mentioned in Islamic teachings for health and well-being?","id":"tirmidhi-28-122"},{"hadith-eng":"\"There was no wound nor cut on the Messenger of Allah (S.A.W) but he would order me to put Hinna on it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2054, Book 28, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role did Salma play in the care of the Prophet Muhammad (S.A.W)?","id":"tirmidhi-28-123"},{"hadith-eng":"\"Whoever seeks treatment by cauterization, or with Ruqyah, then he has absolved himself of At-Tawakkul (reliance upon Allah).\"","reference":"Jami` at-Tirmidhi 2055, Book 28, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of using Ruqyah or cauterization on a person's trust in Allah?","id":"tirmidhi-28-124"},{"hadith-eng":"the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2056, Book 28, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic tradition view the treatment of scorpion stings and the evil eye?","id":"tirmidhi-28-125"},{"hadith-eng":"\"No Ruqyah except for the (evil) eye and the scorpion sting.\"","reference":"Jami` at-Tirmidhi 2057, Book 28, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the evil eye affect individuals according to Islamic teachings?","id":"tirmidhi-28-126"},{"hadith-eng":"\"The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So when they were revealed he used them and left other than them.\"","reference":"Jami` at-Tirmidhi 2058, Book 28, Hadith 23","grade":"Da'if(Darussalam)","question #":"question #3","question":"What changes did the Prophet Muhammad (S.A.W) make in his practice of seeking refuge after the revelation of Al-Mu'awwidhatain?","id":"tirmidhi-28-127"},{"hadith-eng":"\" I said: 'O Messenger of Allah (S.A.W)! Some of Ja'far's children have suffered from an accelerated case of the inflammation of the eye, so should I have them treated with Ruqyah?' He said: 'Yes,for indeed if there was anything that could overcome the Decree, then the evil eye would overcome it.\"","reference":"Jami` at-Tirmidhi 2059, Book 28, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the Islamic teachings regarding the treatment of eye inflammation?","id":"tirmidhi-28-128"},{"hadith-eng":"\"\"U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye).\" And he would say: \"It is with this that Ibrahim would seek refuge for Ishhaq and Ismail [peace be upon them].\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2060, Book 28, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the elements from which protection is sought in this supplication?","id":"tirmidhi-28-129"},{"hadith-eng":"\"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"","reference":"Jami` at-Tirmidhi 2062, Book 28, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions are recommended if someone believes they have been affected by the evil eye?","id":"tirmidhi-28-130"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"","reference":"Jami` at-Tirmidhi 2063, Book 28, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of seeking permission or guidance from the Prophet (S.A.W) reflect on decision-making in uncertain situations?","id":"tirmidhi-28-131"},{"hadith-eng":"\"Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that.\" He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?'  And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'\"","reference":"Jami` at-Tirmidhi 2064, Book 28, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration suggest about the permissibility of accepting compensation for performing Ruqyah?","id":"tirmidhi-28-132"},{"hadith-eng":"\"I asked the Messenger of Allah (S.A.W): 'O Messenger of Allah(S.A.W)! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves will contradict anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2065, Book 28, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on seeking protection through Ruqyah?","id":"tirmidhi-28-133"},{"hadith-eng":"\"Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2066, Book 28, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #3","question":"What remedies are suggested for poison according to Islamic tradition?","id":"tirmidhi-28-134"},{"hadith-eng":"\"Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2067, Book 28, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is the liquid of truffles used in Islamic medicine?","id":"tirmidhi-28-135"},{"hadith-eng":"\"Truffles are the earth's smallpox.\" So the Messenger of Allah (S.A.W) said: \"Truffles are a form of manna, and its liquid is a cure for the eye. Al-'Ajwah is from Paradise, and it contains a cure for poison.\"","reference":"Jami` at-Tirmidhi 2068, Book 28, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of Al-'Ajwah dates in Islamic belief?","id":"tirmidhi-28-136"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah said: 'I took three truffles, or five, or seven, and pressed them. Then I put their liquid in a bottle, and I used it on the eyes of a slave girl of mine so she was cured.'\"","reference":"Jami` at-Tirmidhi 2069, Book 28, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of Abu Hurairah's actions in the context of Islamic medicine?","id":"tirmidhi-28-137"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah  said:'Ash-Shuniz is a cure for  every disease except As-Sam.'  Qatadah said: \"One takes twenty-one seeds daily, and puts them in a cloth, then infuses (water) and sniffs two drops in his right nostril, and one drop in the left. The second (day) two drops are sniffed in the left, and one drop in the right. The third (day) two drops in the right and one drop in the left.\"","reference":"Jami` at-Tirmidhi 2070, Book 28, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the method of administering Ash-Shuniz for medicinal purposes?","id":"tirmidhi-28-138"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 2071, Book 28, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic stance on payments made to fortune-tellers?","id":"tirmidhi-28-139"},{"hadith-eng":"\"I entered upon 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani to visit him, while he had Humrah. I said:'Why don't you hang something?' He said: 'Death is better than that. The Prophet (S.A.W) said: \"Whoever hangs something, he is entrusted to it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2072, Book 28, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of entrusting oneself to objects rather than to Allah in Islamic belief?","id":"tirmidhi-28-140"},{"hadith-eng":"\"Fever is from the agitation of the Fire, so cool it with water.\"","reference":"Jami` at-Tirmidhi 2073, Book 28, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are some prophetic recommendations for treating common illnesses like fever?","id":"tirmidhi-28-141"},{"hadith-eng":"\"Fever is from the heat of the Hell, so cool it with water.\"\n\nAnother chain reports similar narration.","reference":"Jami` at-Tirmidhi 2074, Book 28, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the recommended practices for dealing with fever according to Islamic tradition?","id":"tirmidhi-28-142"},{"hadith-eng":"\"For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the Great, I seek refuge with Allah the Magnificent from the evil of every gushing vein, and from the evil of the heat of the Fire)\"","reference":"Jami` at-Tirmidhi 2075, Book 28, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the invocation relate to protection from physical ailments and spiritual harm?","id":"tirmidhi-28-143"},{"hadith-eng":"\"I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'\"","reference":"Jami` at-Tirmidhi 2076, Book 28, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the impact of cultural practices on Islamic legislation?","id":"tirmidhi-28-144"},{"hadith-eng":"\"I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\"","reference":"Jami` at-Tirmidhi 2077, Book 28, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the impact of Al-Ghilah on children from this narration?","id":"tirmidhi-28-145"},{"hadith-eng":"\"The Prophet (S.A.W) would acclaim oil and Wars for (the treatment of) pleurisy.\" Qatadah said: \"And it is put in the mouth on the side which he is suffering. \"","reference":"Jami` at-Tirmidhi 2078, Book 28, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of applying treatment on the side of the mouth where the pain is felt in pleurisy?","id":"tirmidhi-28-146"},{"hadith-eng":"\"I heard Zaid bin Arqam say: 'The Messenger of Allah (S.A.W) ordered us to use Qust Al-Bahri and oil to treat Pleurisy.'\"","reference":"Jami` at-Tirmidhi 2079, Book 28, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the use of oil complement the treatment of pleurisy according to Islamic teachings?","id":"tirmidhi-28-147"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah (S.A.W) said: 'Rub it with your right hand seven times and say A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\" He said: \"So I did it, and Allah removed what I had, and I never ceased telling my family and others to do it.\"","reference":"Jami` at-Tirmidhi 2080, Book 28, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does faith play in the effectiveness of supplications for healing in Islam?","id":"tirmidhi-28-148"},{"hadith-eng":"\"Shubrum\" He said: \"It is hot and too strong.\" She said:\"Then I used Senna as a laxative.\" So the Prophet (S.A.W) said: \"If there was anything that would have a cure for death in it, then it would have been Senna.\"","reference":"Jami` at-Tirmidhi 2081, Book 28, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of the Prophet's statement regarding a cure for death in relation to Senna?","id":"tirmidhi-28-149"},{"hadith-eng":"\"A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.'\" He said: \"So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.'\" He said: \"The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'\"","reference":"Jami` at-Tirmidhi 2082, Book 28, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lesson can be learned about persistence and faith in following prophetic advice for healing?","id":"tirmidhi-28-150"},{"hadith-eng":"\"There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.\"","reference":"Jami` at-Tirmidhi 2083, Book 28, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the recommended supplication to say when visiting someone who is ill?","id":"tirmidhi-28-151"},{"hadith-eng":"\"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummashfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"","reference":"Jami` at-Tirmidhi 2084, Book 28, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the recommended supplication to be recited while seeking a cure for fever in this context?","id":"tirmidhi-28-152"},{"hadith-eng":"\"While I was listening, Sahl bin Sa'd was asked: 'What were the wounds of the Messenger of Allah (S.A.W) treated with?' He said: 'None is alive who is more knowledgeable of it than I. 'Ali would come with water in his shield, and Fatimah would use it to wash his blood off,and a mat was burnt for him and his wounds were filled with it(its ashes).\"","reference":"Jami` at-Tirmidhi 2085, Book 28, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role did Ali and Fatimah play in the treatment of the Prophet's wounds?","id":"tirmidhi-28-153"},{"hadith-eng":"\"The parable of the ill when he is cured and becomes healthy is that of hail that falls from the heavens in its purity and its color.\"","reference":"Jami` at-Tirmidhi 2086, Book 28, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the nature of illness and recovery from the comparison to hail?","id":"tirmidhi-28-154"},{"hadith-eng":"\"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"","reference":"Jami` at-Tirmidhi 2087, Book 28, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the role of visiting the sick in Islamic teachings?","id":"tirmidhi-28-155"},{"hadith-eng":"\"Cheer up, for indeed Allah said: 'It is My Fire which I impose upon My sinning slave as his portion of the Fire.\" (Hasan)\n\nAl-Hasan said:\n\"They would hope that the fever that occurred at night would atone for any deficiency caused by sins.\"","reference":"Jami` at-Tirmidhi 2088, Book 28, Hadith 53","grade":"","question #":"question #3","question":"What role does patience play when a believer is afflicted with illness according to Islamic beliefs?","id":"tirmidhi-28-156"},{"hadith-eng":"\"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2036, Book 28, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What parallels can be drawn between caring for a sick person and Allah's treatment of His beloved servants?","id":"tirmidhi-28-157"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered upon me, while `Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (ﷺ) began eating, and `Ali ate with him. The Messenger of Allah (ﷺ) said to `Ali: 'Stop, stop, for you are still recovering.' So `Ali sat and the Prophet (ﷺ) ate.\" She said: \"I made some chard and barley for them, so the Prophet (ﷺ) said: 'O `Ali eat from this, for indeed it will be more suitable for you.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2037, Book 28, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the dietary advice given by the Prophet (ﷺ) reflect on the importance of nutrition in Islam?","id":"tirmidhi-28-158"},{"hadith-eng":"\"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"","reference":"Jami` at-Tirmidhi 2038, Book 28, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of using remedies in Islam according to the teachings of the Prophet Muhammad (s.a.w)?","id":"tirmidhi-28-159"},{"hadith-eng":"\"Whenever one of the wives of the Messenger of Allah (s.a.w) became (feverishly) ill, he would order that some broth be prepared. Then he would tell them to take some of the broth. And he would say: 'It firms the heart of the grieved, and it rids the worries from the heart of the ill just as one of you removes dirt from her face with water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2039, Book 28, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the act of removing worries from the heart relate to physical nourishment in Islamic teachings?","id":"tirmidhi-28-160"},{"hadith-eng":"\"Do not force your sick to eat, for indeed Allah, Blessed and Most High, provides them food and drink.\"(Dai'f)","reference":"Jami` at-Tirmidhi 2040, Book 28, Hadith 5","grade":"","question #":"question #4","question":"How does this teaching reflect the understanding of divine care and sustenance in Islam?","id":"tirmidhi-28-161"},{"hadith-eng":"\"Use this black seed. For indeed it contains a cure for every disease except As-Sam\" And As-Sam is death.","reference":"Jami` at-Tirmidhi 2041, Book 28, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does prophetic guidance play in traditional Islamic remedies?","id":"tirmidhi-28-162"},{"hadith-eng":"\"Drink from their milk and Urine\".","reference":"Jami` at-Tirmidhi 2042, Book 28, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of using natural remedies in Islamic tradition as demonstrated in this narration?","id":"tirmidhi-28-163"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.\"","reference":"Jami` at-Tirmidhi 2043, Book 28, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the method of suicide affect the punishment in the hereafter according to Islamic teachings?","id":"tirmidhi-28-164"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2044, Book 28, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does Islamic tradition say about the eternal consequences of taking one's own life?","id":"tirmidhi-28-165"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) forbade from cures that are Khabith.\" [Abu 'Elsa said:] Meaning poison","reference":"Jami` at-Tirmidhi 2045, Book 28, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic teaching guide the use of medicine and treatments?","id":"tirmidhi-28-166"},{"hadith-eng":"\"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2046, Book 28, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of considering something a disease rather than a cure in Islamic teachings?","id":"tirmidhi-28-167"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud.\"(Daif)","reference":"Jami` at-Tirmidhi 2047, Book 28, Hadith 12","grade":"","question #":"question #4","question":"How does the practice of cupping relate to Islamic medical practices?","id":"tirmidhi-28-168"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' And the best of what you use for Kuhl is Ithmid, for it clears the vision and grows the hair (eye-lashes).\" And he said:\" The Messenger of Allah (s.a.w) had a Kuhl holder with which he would apply Kuhl before sleeping three in each eye.\"","reference":"Jami` at-Tirmidhi 2048, Book 28, Hadith 13","grade":"Da'if(Darussalam)","question #":"question #4","question":"What practices did the Prophet Muhammad (s.a.w) follow for eye care before sleeping?","id":"tirmidhi-28-169"},{"hadith-eng":"\"We were tested (with severe medical condition) so we were cauterized, but we did not have good results, nor was it successful for us.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2049, Book 28, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance does Islam provide regarding seeking medical treatment during severe health conditions?","id":"tirmidhi-28-170"},{"hadith-eng":"\"The Prophet (S.A.W) cauterized As'ad bin Zurarah for Shawkah.\"","reference":"Jami` at-Tirmidhi 2050, Book 28, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (S.A.W) approach medical treatments for his companions?","id":"tirmidhi-28-171"},{"hadith-eng":"\"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"","reference":"Jami` at-Tirmidhi 2051, Book 28, Hadith 16","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the practice of cupping relate to the lunar calendar in Islam?","id":"tirmidhi-28-172"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"","reference":"Jami` at-Tirmidhi 2052, Book 28, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role do angels play in conveying messages about health practices in Islam?","id":"tirmidhi-28-173"},{"hadith-eng":"\"Ibn 'Abbas had three boys who were cuppers. He would use the proceeds from two of them for himself and his family, and one of them would cup him and his family.\" He said: \" Ibn 'Abbas said: 'The Prophet (S.A.W) said: 'How excellent is the slave who cups, letting the blood, relieving the back, and clearing the vision.\" And he said: \"Indeed the best for you to cup on are the seventeenth, the nineteenth, and the twenty-first.\" And he said: \"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.\" And indeed, The Messenger of Allah (S.A.W) was given medicine by Al-Abbas and his companions. So the The Messenger of Allah (S.A.W) said: \"Who gave me this medicine?\" All of them were silent, so he said that there shall not remain anyone in the house but he should be treated with Ladud except for his uncle Al-Abbas.'\" An-Nadr said: \"Al-Ladud is Al-Wajur.\"","reference":"Jami` at-Tirmidhi 2053, Book 28, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (S.A.W) respond to being given medicine without his knowledge?","id":"tirmidhi-28-174"},{"hadith-eng":"\"There was no wound nor cut on the Messenger of Allah (S.A.W) but he would order me to put Hinna on it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2054, Book 28, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are some traditional remedies mentioned in Islamic teachings for treating wounds?","id":"tirmidhi-28-175"},{"hadith-eng":"\"Whoever seeks treatment by cauterization, or with Ruqyah, then he has absolved himself of At-Tawakkul (reliance upon Allah).\"","reference":"Jami` at-Tirmidhi 2055, Book 28, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of At-Tawakkul influence decisions regarding medical interventions?","id":"tirmidhi-28-176"},{"hadith-eng":"the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2056, Book 28, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of An-Namlah in Islamic healing practices?","id":"tirmidhi-28-177"},{"hadith-eng":"\"No Ruqyah except for the (evil) eye and the scorpion sting.\"","reference":"Jami` at-Tirmidhi 2057, Book 28, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the scorpion sting in the context of Ruqyah?","id":"tirmidhi-28-178"},{"hadith-eng":"\"The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So when they were revealed he used them and left other than them.\"","reference":"Jami` at-Tirmidhi 2058, Book 28, Hadith 23","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the role of Al-Mu'awwidhatain in Islamic practices for protection against evil?","id":"tirmidhi-28-179"},{"hadith-eng":"\" I said: 'O Messenger of Allah (S.A.W)! Some of Ja'far's children have suffered from an accelerated case of the inflammation of the eye, so should I have them treated with Ruqyah?' He said: 'Yes,for indeed if there was anything that could overcome the Decree, then the evil eye would overcome it.\"","reference":"Jami` at-Tirmidhi 2059, Book 28, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the evil eye play in Islamic beliefs about health and protection?","id":"tirmidhi-28-180"},{"hadith-eng":"\"\"U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye).\" And he would say: \"It is with this that Ibrahim would seek refuge for Ishhaq and Ismail [peace be upon them].\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2060, Book 28, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this practice relate to the actions of Prophet Ibrahim for his sons Ishhaq and Ismail?","id":"tirmidhi-28-181"},{"hadith-eng":"\"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"","reference":"Jami` at-Tirmidhi 2062, Book 28, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the Islamic perspective on the power of the evil eye compared to divine will?","id":"tirmidhi-28-182"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"","reference":"Jami` at-Tirmidhi 2063, Book 28, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does negotiation play in the context of providing services in Islamic teachings?","id":"tirmidhi-28-183"},{"hadith-eng":"\"Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that.\" He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?'  And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'\"","reference":"Jami` at-Tirmidhi 2064, Book 28, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the Prophet Muhammad (S.A.W) play in validating the actions of his companions in this narration?","id":"tirmidhi-28-184"},{"hadith-eng":"\"I asked the Messenger of Allah (S.A.W): 'O Messenger of Allah(S.A.W)! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves will contradict anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2065, Book 28, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of divine decree influence the use of medical treatments in Islam?","id":"tirmidhi-28-185"},{"hadith-eng":"\"Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2066, Book 28, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of truffles in treating eye conditions in Islamic medicine?","id":"tirmidhi-28-186"},{"hadith-eng":"\"Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2067, Book 28, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"What ailments are truffles believed to cure according to Islamic teachings?","id":"tirmidhi-28-187"},{"hadith-eng":"\"Truffles are the earth's smallpox.\" So the Messenger of Allah (S.A.W) said: \"Truffles are a form of manna, and its liquid is a cure for the eye. Al-'Ajwah is from Paradise, and it contains a cure for poison.\"","reference":"Jami` at-Tirmidhi 2068, Book 28, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #4","question":"What remedies are mentioned in Islamic teachings for eye ailments?","id":"tirmidhi-28-188"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah said: 'I took three truffles, or five, or seven, and pressed them. Then I put their liquid in a bottle, and I used it on the eyes of a slave girl of mine so she was cured.'\"","reference":"Jami` at-Tirmidhi 2069, Book 28, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic tradition view the treatment of ailments with natural substances?","id":"tirmidhi-28-189"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah  said:'Ash-Shuniz is a cure for  every disease except As-Sam.'  Qatadah said: \"One takes twenty-one seeds daily, and puts them in a cloth, then infuses (water) and sniffs two drops in his right nostril, and one drop in the left. The second (day) two drops are sniffed in the left, and one drop in the right. The third (day) two drops in the right and one drop in the left.\"","reference":"Jami` at-Tirmidhi 2070, Book 28, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the exception mentioned in the effectiveness of Ash-Shuniz as a cure?","id":"tirmidhi-28-190"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 2071, Book 28, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the concept of earning money through unethical means?","id":"tirmidhi-28-191"},{"hadith-eng":"\"I entered upon 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani to visit him, while he had Humrah. I said:'Why don't you hang something?' He said: 'Death is better than that. The Prophet (S.A.W) said: \"Whoever hangs something, he is entrusted to it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2072, Book 28, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #4","question":"What alternatives does Islam offer for seeking protection or healing instead of using physical objects?","id":"tirmidhi-28-192"},{"hadith-eng":"\"Fever is from the agitation of the Fire, so cool it with water.\"","reference":"Jami` at-Tirmidhi 2073, Book 28, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of using natural elements in Islamic medicine?","id":"tirmidhi-28-193"},{"hadith-eng":"\"Fever is from the heat of the Hell, so cool it with water.\"\n\nAnother chain reports similar narration.","reference":"Jami` at-Tirmidhi 2074, Book 28, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic tradition view the physical ailments like fever in relation to spiritual concepts?","id":"tirmidhi-28-194"},{"hadith-eng":"\"For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the Great, I seek refuge with Allah the Magnificent from the evil of every gushing vein, and from the evil of the heat of the Fire)\"","reference":"Jami` at-Tirmidhi 2075, Book 28, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the benefits of using specific phrases in supplications for healing?","id":"tirmidhi-28-195"},{"hadith-eng":"\"I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'\"","reference":"Jami` at-Tirmidhi 2076, Book 28, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration suggest about the Prophet's approach to making prohibitions?","id":"tirmidhi-28-196"},{"hadith-eng":"\"I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\"","reference":"Jami` at-Tirmidhi 2077, Book 28, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration suggest about the adaptability of Islamic rulings in different cultural contexts?","id":"tirmidhi-28-197"},{"hadith-eng":"\"The Prophet (S.A.W) would acclaim oil and Wars for (the treatment of) pleurisy.\" Qatadah said: \"And it is put in the mouth on the side which he is suffering. \"","reference":"Jami` at-Tirmidhi 2078, Book 28, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role does traditional medicine play in Islamic teachings for treating ailments like pleurisy?","id":"tirmidhi-28-198"},{"hadith-eng":"\"I heard Zaid bin Arqam say: 'The Messenger of Allah (S.A.W) ordered us to use Qust Al-Bahri and oil to treat Pleurisy.'\"","reference":"Jami` at-Tirmidhi 2079, Book 28, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #4","question":"What role does prophetic medicine play in the treatment of illnesses in Islam?","id":"tirmidhi-28-199"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah (S.A.W) said: 'Rub it with your right hand seven times and say A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\" He said: \"So I did it, and Allah removed what I had, and I never ceased telling my family and others to do it.\"","reference":"Jami` at-Tirmidhi 2080, Book 28, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can sharing beneficial practices with family and others be encouraged in Islam?","id":"tirmidhi-28-200"},{"hadith-eng":"\"Shubrum\" He said: \"It is hot and too strong.\" She said:\"Then I used Senna as a laxative.\" So the Prophet (S.A.W) said: \"If there was anything that would have a cure for death in it, then it would have been Senna.\"","reference":"Jami` at-Tirmidhi 2081, Book 28, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #4","question":"How did Asma' bint 'Umais contribute to the understanding of medicinal practices in Islam?","id":"tirmidhi-28-201"},{"hadith-eng":"\"A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.'\" He said: \"So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.'\" He said: \"The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'\"","reference":"Jami` at-Tirmidhi 2082, Book 28, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this story reflect the concept of truthfulness in divine revelation versus human perception?","id":"tirmidhi-28-202"},{"hadith-eng":"\"There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.\"","reference":"Jami` at-Tirmidhi 2083, Book 28, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the role of supplication in the healing process according to Islamic teachings?","id":"tirmidhi-28-203"},{"hadith-eng":"\"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummashfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"","reference":"Jami` at-Tirmidhi 2084, Book 28, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the prescribed timing for performing the ritual to seek healing from fever?","id":"tirmidhi-28-204"},{"hadith-eng":"\"While I was listening, Sahl bin Sa'd was asked: 'What were the wounds of the Messenger of Allah (S.A.W) treated with?' He said: 'None is alive who is more knowledgeable of it than I. 'Ali would come with water in his shield, and Fatimah would use it to wash his blood off,and a mat was burnt for him and his wounds were filled with it(its ashes).\"","reference":"Jami` at-Tirmidhi 2085, Book 28, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #4","question":"How was water utilized in the treatment of the Prophet's wounds?","id":"tirmidhi-28-205"},{"hadith-eng":"\"The parable of the ill when he is cured and becomes healthy is that of hail that falls from the heavens in its purity and its color.\"","reference":"Jami` at-Tirmidhi 2086, Book 28, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #4","question":"In what ways does the imagery of hail falling from the heavens illustrate the process of healing?","id":"tirmidhi-28-206"},{"hadith-eng":"\"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"","reference":"Jami` at-Tirmidhi 2087, Book 28, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to provide hope to those who are unwell?","id":"tirmidhi-28-207"},{"hadith-eng":"\"Cheer up, for indeed Allah said: 'It is My Fire which I impose upon My sinning slave as his portion of the Fire.\" (Hasan)\n\nAl-Hasan said:\n\"They would hope that the fever that occurred at night would atone for any deficiency caused by sins.\"","reference":"Jami` at-Tirmidhi 2088, Book 28, Hadith 53","grade":"","question #":"question #4","question":"How can physical ailments be perceived as a form of spiritual purification in Islam?","id":"tirmidhi-28-208"},{"hadith-eng":"\"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2036, Book 28, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"In what ways might worldly trials be interpreted as signs of Allah's affection for a believer?","id":"tirmidhi-28-209"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) entered upon me, while `Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (ﷺ) began eating, and `Ali ate with him. The Messenger of Allah (ﷺ) said to `Ali: 'Stop, stop, for you are still recovering.' So `Ali sat and the Prophet (ﷺ) ate.\" She said: \"I made some chard and barley for them, so the Prophet (ﷺ) said: 'O `Ali eat from this, for indeed it will be more suitable for you.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2037, Book 28, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does moderation play in the dietary habits encouraged by the Prophet Muhammad (ﷺ)?","id":"tirmidhi-28-210"},{"hadith-eng":"\"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"","reference":"Jami` at-Tirmidhi 2038, Book 28, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of old age relate to the discussion of diseases and cures in Islamic teachings?","id":"tirmidhi-28-211"},{"hadith-eng":"\"Whenever one of the wives of the Messenger of Allah (s.a.w) became (feverishly) ill, he would order that some broth be prepared. Then he would tell them to take some of the broth. And he would say: 'It firms the heart of the grieved, and it rids the worries from the heart of the ill just as one of you removes dirt from her face with water.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2039, Book 28, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does food play in providing emotional and physical support in times of illness according to the hadith?","id":"tirmidhi-28-212"},{"hadith-eng":"\"Use this black seed. For indeed it contains a cure for every disease except As-Sam\" And As-Sam is death.","reference":"Jami` at-Tirmidhi 2041, Book 28, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic tradition view the concept of healing and cures?","id":"tirmidhi-28-213"},{"hadith-eng":"\"Drink from their milk and Urine\".","reference":"Jami` at-Tirmidhi 2042, Book 28, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the Prophet Muhammad's (s.a.w) approach to addressing the health concerns of his followers?","id":"tirmidhi-28-214"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.\"","reference":"Jami` at-Tirmidhi 2043, Book 28, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the instrument used in suicide in relation to the punishment described in the hadith?","id":"tirmidhi-28-215"},{"hadith-eng":"\"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2044, Book 28, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of eternal punishment relate to the act of suicide in Islam?","id":"tirmidhi-28-216"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) forbade from cures that are Khabith.\" [Abu 'Elsa said:] Meaning poison","reference":"Jami` at-Tirmidhi 2045, Book 28, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of using poison as a cure in Islamic jurisprudence?","id":"tirmidhi-28-217"},{"hadith-eng":"\"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2046, Book 28, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the prohibition of intoxicants relate to their perceived medicinal benefits in Islam?","id":"tirmidhi-28-218"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud.\"(Daif)","reference":"Jami` at-Tirmidhi 2047, Book 28, Hadith 12","grade":"","question #":"question #5","question":"What role do laxatives play in the traditional treatments mentioned in Islamic teachings?","id":"tirmidhi-28-219"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' And the best of what you use for Kuhl is Ithmid, for it clears the vision and grows the hair (eye-lashes).\" And he said:\" The Messenger of Allah (s.a.w) had a Kuhl holder with which he would apply Kuhl before sleeping three in each eye.\"","reference":"Jami` at-Tirmidhi 2048, Book 28, Hadith 13","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the benefits of cupping and laxatives as mentioned in Islamic teachings?","id":"tirmidhi-28-220"},{"hadith-eng":"\"We were tested (with severe medical condition) so we were cauterized, but we did not have good results, nor was it successful for us.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2049, Book 28, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic teaching address the effectiveness of traditional medical practices?","id":"tirmidhi-28-221"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"","reference":"Jami` at-Tirmidhi 2052, Book 28, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the recommendation of cupping reflect on the health guidance provided in Islamic teachings?","id":"tirmidhi-28-222"},{"hadith-eng":"\"Ibn 'Abbas had three boys who were cuppers. He would use the proceeds from two of them for himself and his family, and one of them would cup him and his family.\" He said: \" Ibn 'Abbas said: 'The Prophet (S.A.W) said: 'How excellent is the slave who cups, letting the blood, relieving the back, and clearing the vision.\" And he said: \"Indeed the best for you to cup on are the seventeenth, the nineteenth, and the twenty-first.\" And he said: \"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.\" And indeed, The Messenger of Allah (S.A.W) was given medicine by Al-Abbas and his companions. So the The Messenger of Allah (S.A.W) said: \"Who gave me this medicine?\" All of them were silent, so he said that there shall not remain anyone in the house but he should be treated with Ladud except for his uncle Al-Abbas.'\" An-Nadr said: \"Al-Ladud is Al-Wajur.\"","reference":"Jami` at-Tirmidhi 2053, Book 28, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of the Prophet Muhammad (S.A.W) exempting his uncle Al-Abbas from a particular treatment?","id":"tirmidhi-28-223"},{"hadith-eng":"\"There was no wound nor cut on the Messenger of Allah (S.A.W) but he would order me to put Hinna on it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2054, Book 28, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the use of natural remedies like Hinna reflect the lifestyle of the Prophet Muhammad (S.A.W)?","id":"tirmidhi-28-224"},{"hadith-eng":"\"Whoever seeks treatment by cauterization, or with Ruqyah, then he has absolved himself of At-Tawakkul (reliance upon Allah).\"","reference":"Jami` at-Tirmidhi 2055, Book 28, Hadith 20","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this narration suggest about the balance between seeking medical treatment and maintaining reliance on Allah?","id":"tirmidhi-28-225"},{"hadith-eng":"the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2056, Book 28, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the practice of Ruqyah relate to the concept of seeking protection in Islam?","id":"tirmidhi-28-226"},{"hadith-eng":"\"No Ruqyah except for the (evil) eye and the scorpion sting.\"","reference":"Jami` at-Tirmidhi 2057, Book 28, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic tradition view the practice of Ruqyah for healing purposes?","id":"tirmidhi-28-227"},{"hadith-eng":"\"The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So when they were revealed he used them and left other than them.\"","reference":"Jami` at-Tirmidhi 2058, Book 28, Hadith 23","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the revelation of specific verses influence the practices of seeking refuge in Islam?","id":"tirmidhi-28-228"},{"hadith-eng":"\" I said: 'O Messenger of Allah (S.A.W)! Some of Ja'far's children have suffered from an accelerated case of the inflammation of the eye, so should I have them treated with Ruqyah?' He said: 'Yes,for indeed if there was anything that could overcome the Decree, then the evil eye would overcome it.\"","reference":"Jami` at-Tirmidhi 2059, Book 28, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can Ruqyah be used as a remedy for the effects of the evil eye?","id":"tirmidhi-28-229"},{"hadith-eng":"\"\"U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye).\" And he would say: \"It is with this that Ibrahim would seek refuge for Ishhaq and Ismail [peace be upon them].\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2060, Book 28, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of supplication in safeguarding against harm according to Islamic teachings?","id":"tirmidhi-28-230"},{"hadith-eng":"\"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"","reference":"Jami` at-Tirmidhi 2062, Book 28, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is washing recommended in response to a request related to the evil eye?","id":"tirmidhi-28-231"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"","reference":"Jami` at-Tirmidhi 2063, Book 28, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith illustrate the importance of verifying the permissibility of actions in Islam?","id":"tirmidhi-28-232"},{"hadith-eng":"\"Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that.\" He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?'  And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'\"","reference":"Jami` at-Tirmidhi 2064, Book 28, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration illustrate the relationship between spiritual practices and physical healing in Islam?","id":"tirmidhi-28-233"},{"hadith-eng":"\"I asked the Messenger of Allah (S.A.W): 'O Messenger of Allah(S.A.W)! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves will contradict anything from Allah's Decree?' He said: 'They are from Allah's Decree.'\"","reference":"Jami` at-Tirmidhi 2065, Book 28, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of asking the Prophet about the compatibility of Ruqyah with Allah's Decree?","id":"tirmidhi-28-234"},{"hadith-eng":"\"Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2066, Book 28, Hadith 31","grade":"Hasan(Darussalam)","question #":"question #5","question":"How are foods from Paradise perceived in terms of their healing properties in Islam?","id":"tirmidhi-28-235"},{"hadith-eng":"\"Truffles are a form of manna, and its liquid is a cure for the eye.\"","reference":"Jami` at-Tirmidhi 2067, Book 28, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the relationship between natural remedies and prophetic medicine in Islam?","id":"tirmidhi-28-236"},{"hadith-eng":"\"Truffles are the earth's smallpox.\" So the Messenger of Allah (S.A.W) said: \"Truffles are a form of manna, and its liquid is a cure for the eye. Al-'Ajwah is from Paradise, and it contains a cure for poison.\"","reference":"Jami` at-Tirmidhi 2068, Book 28, Hadith 33","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic tradition view the healing properties of foods from Paradise?","id":"tirmidhi-28-237"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah said: 'I took three truffles, or five, or seven, and pressed them. Then I put their liquid in a bottle, and I used it on the eyes of a slave girl of mine so she was cured.'\"","reference":"Jami` at-Tirmidhi 2069, Book 28, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role do personal experiences play in the application of traditional remedies in Islam?","id":"tirmidhi-28-238"},{"hadith-eng":"\"It was narrated to me that Abu Hurairah  said:'Ash-Shuniz is a cure for  every disease except As-Sam.'  Qatadah said: \"One takes twenty-one seeds daily, and puts them in a cloth, then infuses (water) and sniffs two drops in his right nostril, and one drop in the left. The second (day) two drops are sniffed in the left, and one drop in the right. The third (day) two drops in the right and one drop in the left.\"","reference":"Jami` at-Tirmidhi 2070, Book 28, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the administration of Ash-Shuniz differ over a three-day period?","id":"tirmidhi-28-239"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"","reference":"Jami` at-Tirmidhi 2071, Book 28, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are some examples of prohibited earnings in Islamic law?","id":"tirmidhi-28-240"},{"hadith-eng":"\"I entered upon 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani to visit him, while he had Humrah. I said:'Why don't you hang something?' He said: 'Death is better than that. The Prophet (S.A.W) said: \"Whoever hangs something, he is entrusted to it.\"\n\nAnother chain reports a similar narration.","reference":"Jami` at-Tirmidhi 2072, Book 28, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of Tawakkul (trust in Allah) relate to the use of amulets or charms?","id":"tirmidhi-28-241"},{"hadith-eng":"\"For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the Great, I seek refuge with Allah the Magnificent from the evil of every gushing vein, and from the evil of the heat of the Fire)\"","reference":"Jami` at-Tirmidhi 2075, Book 28, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #5","question":"How can one incorporate prophetic supplications into daily life for health and well-being?","id":"tirmidhi-28-242"},{"hadith-eng":"\"I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'\"","reference":"Jami` at-Tirmidhi 2076, Book 28, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the survival of children among Persians and Romans relate to the practice of Al-Ghilah?","id":"tirmidhi-28-243"},{"hadith-eng":"\"I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\"","reference":"Jami` at-Tirmidhi 2077, Book 28, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the Prophet's consideration of prohibiting Al-Ghilah reflect on his leadership and decision-making?","id":"tirmidhi-28-244"},{"hadith-eng":"\"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah (S.A.W) said: 'Rub it with your right hand seven times and say A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\" He said: \"So I did it, and Allah removed what I had, and I never ceased telling my family and others to do it.\"","reference":"Jami` at-Tirmidhi 2080, Book 28, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of seeking refuge in Allah's might, power, and authority during times of distress?","id":"tirmidhi-28-245"},{"hadith-eng":"\"Shubrum\" He said: \"It is hot and too strong.\" She said:\"Then I used Senna as a laxative.\" So the Prophet (S.A.W) said: \"If there was anything that would have a cure for death in it, then it would have been Senna.\"","reference":"Jami` at-Tirmidhi 2081, Book 28, Hadith 46","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet's (S.A.W) knowledge of herbal medicine from this narration?","id":"tirmidhi-28-246"},{"hadith-eng":"\"A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.'\" He said: \"So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.'\" He said: \"The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'\"","reference":"Jami` at-Tirmidhi 2082, Book 28, Hadith 47","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does patience play in the process of healing as demonstrated in this account?","id":"tirmidhi-28-247"},{"hadith-eng":"\"There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.\"","reference":"Jami` at-Tirmidhi 2083, Book 28, Hadith 48","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the conditions under which a sick person is promised recovery through supplication?","id":"tirmidhi-28-248"},{"hadith-eng":"\"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummashfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"","reference":"Jami` at-Tirmidhi 2084, Book 28, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #5","question":"How many times should one submerge in water to seek a cure for fever, and what is the significance of the numbers mentioned?","id":"tirmidhi-28-249"},{"hadith-eng":"\"While I was listening, Sahl bin Sa'd was asked: 'What were the wounds of the Messenger of Allah (S.A.W) treated with?' He said: 'None is alive who is more knowledgeable of it than I. 'Ali would come with water in his shield, and Fatimah would use it to wash his blood off,and a mat was burnt for him and his wounds were filled with it(its ashes).\"","reference":"Jami` at-Tirmidhi 2085, Book 28, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #5","question":"What significance does the burning of a mat have in the treatment process described?","id":"tirmidhi-28-250"},{"hadith-eng":"\"The parable of the ill when he is cured and becomes healthy is that of hail that falls from the heavens in its purity and its color.\"","reference":"Jami` at-Tirmidhi 2086, Book 28, Hadith 51","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does this metaphor reflect the spiritual or physical transformation experienced by a person who recovers from illness?","id":"tirmidhi-28-251"},{"hadith-eng":"\"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"","reference":"Jami` at-Tirmidhi 2087, Book 28, Hadith 52","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does offering reassurance to the ill relate to the concept of empathy in Islam?","id":"tirmidhi-28-252"},{"hadith-eng":"\"Cheer up, for indeed Allah said: 'It is My Fire which I impose upon My sinning slave as his portion of the Fire.\" (Hasan)\n\nAl-Hasan said:\n\"They would hope that the fever that occurred at night would atone for any deficiency caused by sins.\"","reference":"Jami` at-Tirmidhi 2088, Book 28, Hadith 53","grade":"","question #":"question #5","question":"What is the relationship between worldly suffering and the afterlife in Islamic theology?","id":"tirmidhi-28-253"},{"hadith-eng":"\"Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud.\"(Daif)","reference":"Jami` at-Tirmidhi 2047, Book 28, Hadith 12","grade":"","question #":"question #6","question":"Why was Al-Abbas exempted from the treatment with Al-Ladud according to the narration?","id":"tirmidhi-28-254"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"","reference":"Jami` at-Tirmidhi 2063, Book 28, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #6","question":"What can be learned about the Prophet's (S.A.W) attitude towards sharing and fairness from this narration?","id":"tirmidhi-28-255"},{"hadith-eng":"\"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummashfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"","reference":"Jami` at-Tirmidhi 2084, Book 28, Hadith 49","grade":"Da'if(Darussalam)","question #":"question #6","question":"What is the role of divine permission in the healing process as described in this practice?","id":"tirmidhi-28-256"}]