[{"hadith-eng":"\"When time draws near, the dreams of a believer will hardly ever  fail  to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron  collar.\" And the interpretation of fetters is being firm in the religion\".","reference":"Jami` at-Tirmidhi 2270, Book 34, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of dreams in Islam according to the teachings of the Prophet?","id":"tirmidhi-34-1"},{"hadith-eng":"\"The dreams of the believer are a portion of the forty-six portions of Prophet-hood\".","reference":"Jami` at-Tirmidhi 2271, Book 34, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of dreams in the life of a believer?","id":"tirmidhi-34-2"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) said:\n'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'\" He(Anas) said:\"The people  were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is  Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'\"","reference":"Jami` at-Tirmidhi 2272, Book 34, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does the termination of Messenger-ship and Prophethood signify in Islam?","id":"tirmidhi-34-3"},{"hadith-eng":"I asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him.\"","reference":"Jami` at-Tirmidhi 2273, Book 34, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of righteous dreams in Islam?","id":"tirmidhi-34-4"},{"hadith-eng":"\"The most truthful of dreams are in the last hours of the night.\"","reference":"Jami` at-Tirmidhi 2274, Book 34, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the timing of dreams in Islamic teachings?","id":"tirmidhi-34-5"},{"hadith-eng":"\"[I asked]  the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.'\"","reference":"Jami` at-Tirmidhi 2275, Book 34, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the glad tidings mentioned in the life of the present world for a Muslim?","id":"tirmidhi-34-6"},{"hadith-eng":"\"Whoever saw me  (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me.\"","reference":"Jami` at-Tirmidhi 2276, Book 34, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of seeing the Prophet Muhammad in a dream according to Islamic teachings?","id":"tirmidhi-34-7"},{"hadith-eng":"\"Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him.\"","reference":"Jami` at-Tirmidhi 2277, Book 34, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of dreams in Islamic teachings?","id":"tirmidhi-34-8"},{"hadith-eng":"\" The Messenger of Allah (s.a.w)  said:\n\" The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops.\" I think he said: \" And it should not be discussed except with an intelligent one or a beloved one.\"","reference":"Jami` at-Tirmidhi 2278, Book 34, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of dreams in the life of a believer according to Islamic teachings?","id":"tirmidhi-34-9"},{"hadith-eng":"\" The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls.\"","reference":"Jami` at-Tirmidhi 2279, Book 34, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of dreams in Islam according to prophetic teachings?","id":"tirmidhi-34-10"},{"hadith-eng":"\"Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.\" And he would say: \"I like fetters and I dislike the iron collar.\" And he would say: \" Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.\" And he would say: \"The dream is not to be narrated except to a knowledgeable person or a sincere advisor.\"","reference":"Jami` at-Tirmidhi 2280, Book 34, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different types of dreams mentioned in Islamic teachings?","id":"tirmidhi-34-11"},{"hadith-eng":"\" From the Prophet(s.a.w), who said:\n\"Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 2281, Book 34, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences of lying about dreams in Islam?","id":"tirmidhi-34-12"},{"hadith-eng":"This narration is Hasan.]\nThere are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'.","reference":"Jami` at-Tirmidhi 2282, Book 34, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who are some of the companions mentioned in the narrations related to this topic?","id":"tirmidhi-34-13"},{"hadith-eng":"\"Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of  Judgment., and he will never be able to knot them together.\"","reference":"Jami` at-Tirmidhi 2283, Book 34, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the consequences of lying about dreams in Islam?","id":"tirmidhi-34-14"},{"hadith-eng":"\"While I was sleeping ,  I was brought a cup of  milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab.\" They said; \"How did you interpret it O Messenger of Allah?\" He said: \"Knowledge.\"","reference":"Jami` at-Tirmidhi 2284, Book 34, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of milk in dreams according to Islamic teachings?","id":"tirmidhi-34-15"},{"hadith-eng":"\"While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that.\" He said: \"Then 'Umar was presented before me and he was wearing  a shirt that was dragging.\" They said: \"How did you interpret that O Messenger of Allah?\" He said: \"The religion.\"","reference":"Jami` at-Tirmidhi 2285, Book 34, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of dreams in Islamic teachings and how are they interpreted?","id":"tirmidhi-34-16"},{"hadith-eng":"similar in meaning (to no. 2285).","reference":"Jami` at-Tirmidhi 2286, Book 34, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Abu Sa'eed al-Khudri in the context of hadith narration?","id":"tirmidhi-34-17"},{"hadith-eng":"\"One day the Prophet (s.a.w) said:\n\"'Who among you had a dream?' A man said: \"I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were  weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w).\"","reference":"Jami` at-Tirmidhi 2287, Book 34, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance do dreams hold in Islamic tradition and how are they interpreted?","id":"tirmidhi-34-18"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:\n'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"","reference":"Jami` at-Tirmidhi 2288, Book 34, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #1","question":"What significance do dreams hold in understanding the fate of individuals in Islamic teachings?","id":"tirmidhi-34-19"},{"hadith-eng":"\"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"","reference":"Jami` at-Tirmidhi 2289, Book 34, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the dream of the Prophet hold in Islamic tradition?","id":"tirmidhi-34-20"},{"hadith-eng":"\"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"","reference":"Jami` at-Tirmidhi 2290, Book 34, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"How can dreams be interpreted in Islamic tradition?","id":"tirmidhi-34-21"},{"hadith-eng":"\"In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad  tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan  frightens someone. So when one of  you sees what he dislikes, then he should get  up and perform Salat.\" Abu Hurairah said: \"I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.\" He said: \"The Prophet (s. a. w)  said: 'Dreams are a portion among the forty_six  portions of  Prophethood.\"","reference":"Jami` at-Tirmidhi 2291, Book 34, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of dreams in the life of a believer according to Islamic teachings?","id":"tirmidhi-34-22"},{"hadith-eng":"\"I had a dream while sleeping as if there were two gold bracelets in my hands  which bothered me very much. So it was reveled to me to blow them off. I blew them  off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.\" (sahih)","reference":"Jami` at-Tirmidhi 2292, Book 34, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of dreams in Islamic tradition and how are they interpreted?","id":"tirmidhi-34-23"},{"hadith-eng":"\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the  sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then  connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected  so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear.\"","reference":"Jami` at-Tirmidhi 2293, Book 34, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of dreams in Islamic tradition and how are they interpreted?","id":"tirmidhi-34-24"},{"hadith-eng":"\"When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'\" [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.","reference":"Jami` at-Tirmidhi 2294, Book 34, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet Muhammad (s.a.w) asking about dreams after the Fajr prayer?","id":"tirmidhi-34-25"},{"hadith-eng":"\"When time draws near, the dreams of a believer will hardly ever  fail  to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron  collar.\" And the interpretation of fetters is being firm in the religion\".","reference":"Jami` at-Tirmidhi 2270, Book 34, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are dreams categorized in Islamic teachings?","id":"tirmidhi-34-26"},{"hadith-eng":"\"The dreams of the believer are a portion of the forty-six portions of Prophet-hood\".","reference":"Jami` at-Tirmidhi 2271, Book 34, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are dreams related to the concept of prophethood in Islam?","id":"tirmidhi-34-27"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) said:\n'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'\" He(Anas) said:\"The people  were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is  Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'\"","reference":"Jami` at-Tirmidhi 2272, Book 34, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are Mubash-shirat according to Islamic teachings?","id":"tirmidhi-34-28"},{"hadith-eng":"I asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him.\"","reference":"Jami` at-Tirmidhi 2273, Book 34, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are glad tidings in the present life interpreted in Islamic teachings?","id":"tirmidhi-34-29"},{"hadith-eng":"\"The most truthful of dreams are in the last hours of the night.\"","reference":"Jami` at-Tirmidhi 2274, Book 34, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the time of night affect the truthfulness of dreams according to Islamic beliefs?","id":"tirmidhi-34-30"},{"hadith-eng":"\"[I asked]  the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.'\"","reference":"Jami` at-Tirmidhi 2275, Book 34, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are righteous dreams significant in Islam according to the teachings of the Prophet (s.a.w)?","id":"tirmidhi-34-31"},{"hadith-eng":"\"Whoever saw me  (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me.\"","reference":"Jami` at-Tirmidhi 2276, Book 34, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of Shaitan's inability to resemble the Prophet in dreams affect the interpretation of such dreams?","id":"tirmidhi-34-32"},{"hadith-eng":"\"Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him.\"","reference":"Jami` at-Tirmidhi 2277, Book 34, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one react to a disturbing dream according to Islamic guidance?","id":"tirmidhi-34-33"},{"hadith-eng":"\" The Messenger of Allah (s.a.w)  said:\n\" The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops.\" I think he said: \" And it should not be discussed except with an intelligent one or a beloved one.\"","reference":"Jami` at-Tirmidhi 2278, Book 34, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are dreams related to the concept of Prophethood in Islam?","id":"tirmidhi-34-34"},{"hadith-eng":"\" The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls.\"","reference":"Jami` at-Tirmidhi 2279, Book 34, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #2","question":"How are dreams related to the concept of prophethood in Islamic belief?","id":"tirmidhi-34-35"},{"hadith-eng":"\"Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.\" And he would say: \"I like fetters and I dislike the iron collar.\" And he would say: \" Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.\" And he would say: \"The dream is not to be narrated except to a knowledgeable person or a sincere advisor.\"","reference":"Jami` at-Tirmidhi 2280, Book 34, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should a person react if they experience a frightening dream?","id":"tirmidhi-34-36"},{"hadith-eng":"\" From the Prophet(s.a.w), who said:\n\"Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 2281, Book 34, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the act of fabricating dreams?","id":"tirmidhi-34-37"},{"hadith-eng":"This narration is Hasan.]\nThere are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'.","reference":"Jami` at-Tirmidhi 2282, Book 34, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of a narration being classified as Hasan?","id":"tirmidhi-34-38"},{"hadith-eng":"\"Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of  Judgment., and he will never be able to knot them together.\"","reference":"Jami` at-Tirmidhi 2283, Book 34, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of fabricating dreams?","id":"tirmidhi-34-39"},{"hadith-eng":"\"While I was sleeping ,  I was brought a cup of  milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab.\" They said; \"How did you interpret it O Messenger of Allah?\" He said: \"Knowledge.\"","reference":"Jami` at-Tirmidhi 2284, Book 34, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is knowledge symbolically represented in Islamic dream interpretation?","id":"tirmidhi-34-40"},{"hadith-eng":"\"While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that.\" He said: \"Then 'Umar was presented before me and he was wearing  a shirt that was dragging.\" They said: \"How did you interpret that O Messenger of Allah?\" He said: \"The religion.\"","reference":"Jami` at-Tirmidhi 2285, Book 34, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the concept of religion symbolized in dreams according to Islamic tradition?","id":"tirmidhi-34-41"},{"hadith-eng":"similar in meaning (to no. 2285).","reference":"Jami` at-Tirmidhi 2286, Book 34, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the chain of narration impact the authenticity of a hadith?","id":"tirmidhi-34-42"},{"hadith-eng":"\"One day the Prophet (s.a.w) said:\n\"'Who among you had a dream?' A man said: \"I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were  weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w).\"","reference":"Jami` at-Tirmidhi 2287, Book 34, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are the companions of the Prophet Muhammad (s.a.w) ranked in terms of their virtues and qualities?","id":"tirmidhi-34-43"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:\n'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"","reference":"Jami` at-Tirmidhi 2288, Book 34, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the concept of belief and faith in the Prophet Muhammad (s.a.w) viewed in Islam?","id":"tirmidhi-34-44"},{"hadith-eng":"\"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"","reference":"Jami` at-Tirmidhi 2289, Book 34, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are the leadership qualities of Abu Bakr and 'Umar depicted in this narration?","id":"tirmidhi-34-45"},{"hadith-eng":"\"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"","reference":"Jami` at-Tirmidhi 2290, Book 34, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance do dreams hold in the life of the Prophet Muhammad (s.a.w)?","id":"tirmidhi-34-46"},{"hadith-eng":"\"In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad  tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan  frightens someone. So when one of  you sees what he dislikes, then he should get  up and perform Salat.\" Abu Hurairah said: \"I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.\" He said: \"The Prophet (s. a. w)  said: 'Dreams are a portion among the forty_six  portions of  Prophethood.\"","reference":"Jami` at-Tirmidhi 2291, Book 34, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are dreams categorized in Islamic tradition?","id":"tirmidhi-34-47"},{"hadith-eng":"\"I had a dream while sleeping as if there were two gold bracelets in my hands  which bothered me very much. So it was reveled to me to blow them off. I blew them  off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.\" (sahih)","reference":"Jami` at-Tirmidhi 2292, Book 34, Hadith 23","grade":"","question #":"question #2","question":"Who were the two individuals referred to as liars in the context of early Islamic history?","id":"tirmidhi-34-48"},{"hadith-eng":"\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the  sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then  connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected  so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear.\"","reference":"Jami` at-Tirmidhi 2293, Book 34, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Quran symbolize delicateness and sweetness in Islamic teachings?","id":"tirmidhi-34-49"},{"hadith-eng":"\"When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'\" [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.","reference":"Jami` at-Tirmidhi 2294, Book 34, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of discussing dreams relate to the teachings of Islam?","id":"tirmidhi-34-50"},{"hadith-eng":"\"When time draws near, the dreams of a believer will hardly ever  fail  to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron  collar.\" And the interpretation of fetters is being firm in the religion\".","reference":"Jami` at-Tirmidhi 2270, Book 34, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"What should a person do if they experience a dream they dislike?","id":"tirmidhi-34-51"},{"hadith-eng":"\"The dreams of the believer are a portion of the forty-six portions of Prophet-hood\".","reference":"Jami` at-Tirmidhi 2271, Book 34, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does it mean for dreams to be a portion of prophethood?","id":"tirmidhi-34-52"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) said:\n'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'\" He(Anas) said:\"The people  were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is  Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'\"","reference":"Jami` at-Tirmidhi 2272, Book 34, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"How are dreams considered a portion of Prophethood in Islam?","id":"tirmidhi-34-53"},{"hadith-eng":"I asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him.\"","reference":"Jami` at-Tirmidhi 2273, Book 34, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role do dreams play in conveying messages to Muslims according to Islamic belief?","id":"tirmidhi-34-54"},{"hadith-eng":"\"The most truthful of dreams are in the last hours of the night.\"","reference":"Jami` at-Tirmidhi 2274, Book 34, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the characteristics of dreams that are considered truthful in Islam?","id":"tirmidhi-34-55"},{"hadith-eng":"\"[I asked]  the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.'\"","reference":"Jami` at-Tirmidhi 2275, Book 34, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the role of dreams in conveying messages or signs to a believer?","id":"tirmidhi-34-56"},{"hadith-eng":"\"Whoever saw me  (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me.\"","reference":"Jami` at-Tirmidhi 2276, Book 34, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of dreaming about the Prophet Muhammad for a believer's faith and spiritual state?","id":"tirmidhi-34-57"},{"hadith-eng":"\"Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him.\"","reference":"Jami` at-Tirmidhi 2277, Book 34, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the difference between dreams from Allah and those from Shaitan?","id":"tirmidhi-34-58"},{"hadith-eng":"\" The Messenger of Allah (s.a.w)  said:\n\" The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops.\" I think he said: \" And it should not be discussed except with an intelligent one or a beloved one.\"","reference":"Jami` at-Tirmidhi 2278, Book 34, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why is it advised to share dreams only with intelligent or beloved individuals?","id":"tirmidhi-34-59"},{"hadith-eng":"\" The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls.\"","reference":"Jami` at-Tirmidhi 2279, Book 34, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the implication of discussing dreams according to Islamic teachings?","id":"tirmidhi-34-60"},{"hadith-eng":"\"Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.\" And he would say: \"I like fetters and I dislike the iron collar.\" And he would say: \" Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.\" And he would say: \"The dream is not to be narrated except to a knowledgeable person or a sincere advisor.\"","reference":"Jami` at-Tirmidhi 2280, Book 34, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of seeing the Prophet Muhammad in a dream?","id":"tirmidhi-34-61"},{"hadith-eng":"\" From the Prophet(s.a.w), who said:\n\"Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 2281, Book 34, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of the Day of Judgement in relation to lying about dreams?","id":"tirmidhi-34-62"},{"hadith-eng":"This narration is Hasan.]\nThere are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'.","reference":"Jami` at-Tirmidhi 2282, Book 34, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the chain of narrators affect the authenticity of a hadith?","id":"tirmidhi-34-63"},{"hadith-eng":"\"Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of  Judgment., and he will never be able to knot them together.\"","reference":"Jami` at-Tirmidhi 2283, Book 34, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the punishment related to lying about dreams on the Day of Judgment?","id":"tirmidhi-34-64"},{"hadith-eng":"\"While I was sleeping ,  I was brought a cup of  milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab.\" They said; \"How did you interpret it O Messenger of Allah?\" He said: \"Knowledge.\"","reference":"Jami` at-Tirmidhi 2284, Book 34, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the act of sharing in dreams signify in Islamic tradition?","id":"tirmidhi-34-65"},{"hadith-eng":"\"While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that.\" He said: \"Then 'Umar was presented before me and he was wearing  a shirt that was dragging.\" They said: \"How did you interpret that O Messenger of Allah?\" He said: \"The religion.\"","reference":"Jami` at-Tirmidhi 2285, Book 34, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the length of a shirt symbolize in the context of religious commitment or understanding?","id":"tirmidhi-34-66"},{"hadith-eng":"similar in meaning (to no. 2285).","reference":"Jami` at-Tirmidhi 2286, Book 34, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do narrators play in preserving the teachings of the Prophet (s.a.w)?","id":"tirmidhi-34-67"},{"hadith-eng":"\"One day the Prophet (s.a.w) said:\n\"'Who among you had a dream?' A man said: \"I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were  weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w).\"","reference":"Jami` at-Tirmidhi 2287, Book 34, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of Abu Bakr, Umar, and Uthman in early Islamic history?","id":"tirmidhi-34-68"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:\n'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"","reference":"Jami` at-Tirmidhi 2288, Book 34, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the symbolism of white garments in Islamic eschatology?","id":"tirmidhi-34-69"},{"hadith-eng":"\"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"","reference":"Jami` at-Tirmidhi 2289, Book 34, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the act of drawing water symbolize in the context of this dream?","id":"tirmidhi-34-70"},{"hadith-eng":"\"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"","reference":"Jami` at-Tirmidhi 2290, Book 34, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"How are epidemics or plagues viewed in Islamic teachings?","id":"tirmidhi-34-71"},{"hadith-eng":"\"In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad  tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan  frightens someone. So when one of  you sees what he dislikes, then he should get  up and perform Salat.\" Abu Hurairah said: \"I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.\" He said: \"The Prophet (s. a. w)  said: 'Dreams are a portion among the forty_six  portions of  Prophethood.\"","reference":"Jami` at-Tirmidhi 2291, Book 34, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #3","question":"What should a person do if they experience a frightening dream?","id":"tirmidhi-34-72"},{"hadith-eng":"\"I had a dream while sleeping as if there were two gold bracelets in my hands  which bothered me very much. So it was reveled to me to blow them off. I blew them  off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.\" (sahih)","reference":"Jami` at-Tirmidhi 2292, Book 34, Hadith 23","grade":"","question #":"question #3","question":"How did the Prophet Muhammad (s.a.w) respond to troubling dreams according to Islamic teachings?","id":"tirmidhi-34-73"},{"hadith-eng":"\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the  sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then  connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected  so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear.\"","reference":"Jami` at-Tirmidhi 2293, Book 34, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the rope extending from the sky to the earth represent in Islamic symbolism?","id":"tirmidhi-34-74"},{"hadith-eng":"\"When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'\" [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.","reference":"Jami` at-Tirmidhi 2294, Book 34, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the importance of dreams in the early Islamic community?","id":"tirmidhi-34-75"},{"hadith-eng":"\"When time draws near, the dreams of a believer will hardly ever  fail  to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron  collar.\" And the interpretation of fetters is being firm in the religion\".","reference":"Jami` at-Tirmidhi 2270, Book 34, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the relationship between truthfulness in speech and the accuracy of dreams?","id":"tirmidhi-34-76"},{"hadith-eng":"\"The dreams of the believer are a portion of the forty-six portions of Prophet-hood\".","reference":"Jami` at-Tirmidhi 2271, Book 34, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"How many portions of prophethood are dreams considered to be a part of?","id":"tirmidhi-34-77"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) said:\n'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'\" He(Anas) said:\"The people  were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is  Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'\"","reference":"Jami` at-Tirmidhi 2272, Book 34, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What concerns did people have regarding the termination of Prophethood?","id":"tirmidhi-34-78"},{"hadith-eng":"I asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him.\"","reference":"Jami` at-Tirmidhi 2273, Book 34, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (s.a.w) explain the concept of glad tidings in this world?","id":"tirmidhi-34-79"},{"hadith-eng":"\"The most truthful of dreams are in the last hours of the night.\"","reference":"Jami` at-Tirmidhi 2274, Book 34, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might dreams in the last hours of the night be regarded as more truthful?","id":"tirmidhi-34-80"},{"hadith-eng":"\"[I asked]  the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.'\"","reference":"Jami` at-Tirmidhi 2275, Book 34, Hadith 6","grade":"Hasan(Darussalam)","question #":"question #4","question":"How can a Muslim interpret dreams that are seen about them or by them?","id":"tirmidhi-34-81"},{"hadith-eng":"\"Whoever saw me  (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me.\"","reference":"Jami` at-Tirmidhi 2276, Book 34, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic tradition differentiate between true dreams and those influenced by Shaitan?","id":"tirmidhi-34-82"},{"hadith-eng":"\"Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him.\"","reference":"Jami` at-Tirmidhi 2277, Book 34, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions are recommended to protect oneself from the harm of a bad dream?","id":"tirmidhi-34-83"},{"hadith-eng":"\" The Messenger of Allah (s.a.w)  said:\n\" The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops.\" I think he said: \" And it should not be discussed except with an intelligent one or a beloved one.\"","reference":"Jami` at-Tirmidhi 2278, Book 34, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the implication of discussing dreams on their potential impact or meaning?","id":"tirmidhi-34-84"},{"hadith-eng":"\" The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls.\"","reference":"Jami` at-Tirmidhi 2279, Book 34, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the metaphor of a bird's leg relate to the nature of dreams in Islam?","id":"tirmidhi-34-85"},{"hadith-eng":"\"Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.\" And he would say: \"I like fetters and I dislike the iron collar.\" And he would say: \" Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.\" And he would say: \"The dream is not to be narrated except to a knowledgeable person or a sincere advisor.\"","reference":"Jami` at-Tirmidhi 2280, Book 34, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it advised to share dreams only with knowledgeable or sincere individuals?","id":"tirmidhi-34-86"},{"hadith-eng":"\" From the Prophet(s.a.w), who said:\n\"Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 2281, Book 34, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does Islamic teaching say about honesty in sharing personal experiences like dreams?","id":"tirmidhi-34-87"},{"hadith-eng":"This narration is Hasan.]\nThere are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'.","reference":"Jami` at-Tirmidhi 2282, Book 34, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role does 'Ali play in the transmission of this narration?","id":"tirmidhi-34-88"},{"hadith-eng":"\"Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of  Judgment., and he will never be able to knot them together.\"","reference":"Jami` at-Tirmidhi 2283, Book 34, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is honesty important in sharing dreams according to Islamic teachings?","id":"tirmidhi-34-89"},{"hadith-eng":"\"While I was sleeping ,  I was brought a cup of  milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab.\" They said; \"How did you interpret it O Messenger of Allah?\" He said: \"Knowledge.\"","reference":"Jami` at-Tirmidhi 2284, Book 34, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does Umar bin Al-Khattab play in the context of this dream?","id":"tirmidhi-34-90"},{"hadith-eng":"\"While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that.\" He said: \"Then 'Umar was presented before me and he was wearing  a shirt that was dragging.\" They said: \"How did you interpret that O Messenger of Allah?\" He said: \"The religion.\"","reference":"Jami` at-Tirmidhi 2285, Book 34, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (s.a.w) interpret the vision of people wearing shirts of varying lengths?","id":"tirmidhi-34-91"},{"hadith-eng":"similar in meaning (to no. 2285).","reference":"Jami` at-Tirmidhi 2286, Book 34, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to compare similar hadiths to understand their meanings?","id":"tirmidhi-34-92"},{"hadith-eng":"\"One day the Prophet (s.a.w) said:\n\"'Who among you had a dream?' A man said: \"I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were  weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w).\"","reference":"Jami` at-Tirmidhi 2287, Book 34, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of weighing deeds or individuals relate to Islamic teachings on justice and accountability?","id":"tirmidhi-34-93"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:\n'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"","reference":"Jami` at-Tirmidhi 2288, Book 34, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islam view the fate of those who believed in the Prophet before his advent?","id":"tirmidhi-34-94"},{"hadith-eng":"\"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"","reference":"Jami` at-Tirmidhi 2289, Book 34, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the concept of forgiveness illustrated in relation to Abu Bakr in this account?","id":"tirmidhi-34-95"},{"hadith-eng":"\"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"","reference":"Jami` at-Tirmidhi 2290, Book 34, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the historical significance of Al-Madinah and Al-Juhfah in Islamic history?","id":"tirmidhi-34-96"},{"hadith-eng":"\"In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad  tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan  frightens someone. So when one of  you sees what he dislikes, then he should get  up and perform Salat.\" Abu Hurairah said: \"I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.\" He said: \"The Prophet (s. a. w)  said: 'Dreams are a portion among the forty_six  portions of  Prophethood.\"","reference":"Jami` at-Tirmidhi 2291, Book 34, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the relationship between truthfulness in speech and the accuracy of dreams?","id":"tirmidhi-34-97"},{"hadith-eng":"\"I had a dream while sleeping as if there were two gold bracelets in my hands  which bothered me very much. So it was reveled to me to blow them off. I blew them  off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.\" (sahih)","reference":"Jami` at-Tirmidhi 2292, Book 34, Hadith 23","grade":"","question #":"question #4","question":"What role do symbols, such as gold bracelets, play in the interpretation of dreams in Islam?","id":"tirmidhi-34-98"},{"hadith-eng":"\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the  sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then  connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected  so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear.\"","reference":"Jami` at-Tirmidhi 2293, Book 34, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does Abu Bakr play in interpreting dreams and seeking validation from the Prophet?","id":"tirmidhi-34-99"},{"hadith-eng":"\"When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'\" [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.","reference":"Jami` at-Tirmidhi 2294, Book 34, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the narration highlight the Prophet's (s.a.w) interaction with his companions after prayers?","id":"tirmidhi-34-100"},{"hadith-eng":"\"When time draws near, the dreams of a believer will hardly ever  fail  to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron  collar.\" And the interpretation of fetters is being firm in the religion\".","reference":"Jami` at-Tirmidhi 2270, Book 34, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is the concept of fetters interpreted in the context of dreams and religion?","id":"tirmidhi-34-101"},{"hadith-eng":"\"The dreams of the believer are a portion of the forty-six portions of Prophet-hood\".","reference":"Jami` at-Tirmidhi 2271, Book 34, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do dreams play in conveying divine messages to believers?","id":"tirmidhi-34-102"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) said:\n'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'\" He(Anas) said:\"The people  were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is  Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'\"","reference":"Jami` at-Tirmidhi 2272, Book 34, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How did the Prophet Muhammad (s.a.w) address the concerns about the end of Prophethood?","id":"tirmidhi-34-103"},{"hadith-eng":"I asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him.\"","reference":"Jami` at-Tirmidhi 2273, Book 34, Hadith 4","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the importance of asking questions to understand Quranic verses better?","id":"tirmidhi-34-104"},{"hadith-eng":"\"Whoever saw me  (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me.\"","reference":"Jami` at-Tirmidhi 2276, Book 34, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"What measures can a believer take to ensure the authenticity of their dreams about religious figures?","id":"tirmidhi-34-105"},{"hadith-eng":"\"Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him.\"","reference":"Jami` at-Tirmidhi 2277, Book 34, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the purpose of seeking refuge in Allah after experiencing a troubling dream?","id":"tirmidhi-34-106"},{"hadith-eng":"\" The Messenger of Allah (s.a.w)  said:\n\" The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops.\" I think he said: \" And it should not be discussed except with an intelligent one or a beloved one.\"","reference":"Jami` at-Tirmidhi 2278, Book 34, Hadith 9","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the metaphor of a dream being on the leg of a bird relate to its fragility or transience?","id":"tirmidhi-34-107"},{"hadith-eng":"\" The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls.\"","reference":"Jami` at-Tirmidhi 2279, Book 34, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the potential consequences of sharing dreams with others in Islamic tradition?","id":"tirmidhi-34-108"},{"hadith-eng":"\"Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.\" And he would say: \"I like fetters and I dislike the iron collar.\" And he would say: \" Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.\" And he would say: \"The dream is not to be narrated except to a knowledgeable person or a sincere advisor.\"","reference":"Jami` at-Tirmidhi 2280, Book 34, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the symbolic meaning of fetters and iron collars in dreams according to Islamic tradition?","id":"tirmidhi-34-109"},{"hadith-eng":"\" From the Prophet(s.a.w), who said:\n\"Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.\"","reference":"Jami` at-Tirmidhi 2281, Book 34, Hadith 12","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of accountability manifest in Islamic teachings about dreams?","id":"tirmidhi-34-110"},{"hadith-eng":"This narration is Hasan.]\nThere are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'.","reference":"Jami` at-Tirmidhi 2282, Book 34, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #5","question":"Why is it important to have multiple narrations on a single topic?","id":"tirmidhi-34-111"},{"hadith-eng":"\"Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of  Judgment., and he will never be able to knot them together.\"","reference":"Jami` at-Tirmidhi 2283, Book 34, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lesson can be learned about truthfulness from the consequences of lying about dreams?","id":"tirmidhi-34-112"},{"hadith-eng":"\"While I was sleeping ,  I was brought a cup of  milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab.\" They said; \"How did you interpret it O Messenger of Allah?\" He said: \"Knowledge.\"","reference":"Jami` at-Tirmidhi 2284, Book 34, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"How are dreams interpreted in Islam, particularly those involving the Prophet?","id":"tirmidhi-34-113"},{"hadith-eng":"\"While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that.\" He said: \"Then 'Umar was presented before me and he was wearing  a shirt that was dragging.\" They said: \"How did you interpret that O Messenger of Allah?\" He said: \"The religion.\"","reference":"Jami` at-Tirmidhi 2285, Book 34, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the dragging shirt of 'Umar symbolize in the dream seen by the Prophet Muhammad (s.a.w)?","id":"tirmidhi-34-114"},{"hadith-eng":"similar in meaning (to no. 2285).","reference":"Jami` at-Tirmidhi 2286, Book 34, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of referencing hadiths in Islamic literature?","id":"tirmidhi-34-115"},{"hadith-eng":"\"One day the Prophet (s.a.w) said:\n\"'Who among you had a dream?' A man said: \"I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were  weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w).\"","reference":"Jami` at-Tirmidhi 2287, Book 34, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"What might cause the Prophet Muhammad (s.a.w) to show dislike or disapproval in a given situation?","id":"tirmidhi-34-116"},{"hadith-eng":"\"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:\n'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"","reference":"Jami` at-Tirmidhi 2288, Book 34, Hadith 19","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be inferred about the afterlife of individuals based on their actions and beliefs according to Islamic teachings?","id":"tirmidhi-34-117"},{"hadith-eng":"\"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"","reference":"Jami` at-Tirmidhi 2289, Book 34, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the strength and effort of 'Umar from this dream?","id":"tirmidhi-34-118"},{"hadith-eng":"\"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"","reference":"Jami` at-Tirmidhi 2290, Book 34, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does symbolism play a role in the interpretation of dreams in Islam?","id":"tirmidhi-34-119"},{"hadith-eng":"\"In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad  tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan  frightens someone. So when one of  you sees what he dislikes, then he should get  up and perform Salat.\" Abu Hurairah said: \"I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.\" He said: \"The Prophet (s. a. w)  said: 'Dreams are a portion among the forty_six  portions of  Prophethood.\"","reference":"Jami` at-Tirmidhi 2291, Book 34, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #5","question":"How are dreams related to Prophethood in Islam?","id":"tirmidhi-34-120"},{"hadith-eng":"\"I had a dream while sleeping as if there were two gold bracelets in my hands  which bothered me very much. So it was reveled to me to blow them off. I blew them  off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.\" (sahih)","reference":"Jami` at-Tirmidhi 2292, Book 34, Hadith 23","grade":"","question #":"question #5","question":"What is the historical context of the figures Masalamah of Yamamah and Al-'ansi of San'a'?","id":"tirmidhi-34-121"},{"hadith-eng":"\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the  sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then  connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected  so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear.\"","reference":"Jami` at-Tirmidhi 2293, Book 34, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of truth and adherence to it manifest in Islamic teachings?","id":"tirmidhi-34-122"},{"hadith-eng":"\"When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'\" [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.","reference":"Jami` at-Tirmidhi 2294, Book 34, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do dreams play in Islamic tradition according to the practices of the Prophet (s.a.w)?","id":"tirmidhi-34-123"},{"hadith-eng":"\"When time draws near, the dreams of a believer will hardly ever  fail  to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron  collar.\" And the interpretation of fetters is being firm in the religion\".","reference":"Jami` at-Tirmidhi 2270, Book 34, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #6","question":"What role does the Shaithan play in influencing dreams according to Islamic teachings?","id":"tirmidhi-34-124"},{"hadith-eng":"\"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"","reference":"Jami` at-Tirmidhi 2289, Book 34, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does this narration reflect the communal aspect of leadership in Islam?","id":"tirmidhi-34-125"},{"hadith-eng":"\"In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad  tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan  frightens someone. So when one of  you sees what he dislikes, then he should get  up and perform Salat.\" Abu Hurairah said: \"I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.\" He said: \"The Prophet (s. a. w)  said: 'Dreams are a portion among the forty_six  portions of  Prophethood.\"","reference":"Jami` at-Tirmidhi 2291, Book 34, Hadith 22","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the symbolic meaning of fetters in the context of dreams and religion?","id":"tirmidhi-34-126"},{"hadith-eng":"\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the  sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then  connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected  so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear.\"","reference":"Jami` at-Tirmidhi 2293, Book 34, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the importance of not swearing in Islamic discourse as demonstrated in this narration?","id":"tirmidhi-34-127"}]