[{"hadith-eng":"the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"","reference":"Jami` at-Tirmidhi 488, Book 4, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does Friday hold in Islamic tradition?","id":"tirmidhi-4-1"},{"hadith-eng":"the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"","reference":"Jami` at-Tirmidhi 489, Book 4, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Friday in Islamic tradition?","id":"tirmidhi-4-2"},{"hadith-eng":"the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"","reference":"Jami` at-Tirmidhi 490, Book 4, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of a specific hour on Friday for Muslims seeking Allah's blessings?","id":"tirmidhi-4-3"},{"hadith-eng":"\"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"","reference":"Jami` at-Tirmidhi 491, Book 4, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does Friday hold in Islamic tradition according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-4-4"},{"hadith-eng":"the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"","reference":"Jami` at-Tirmidhi 492, Book 4, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl on Fridays in Islam?","id":"tirmidhi-4-5"},{"hadith-eng":"(Another chain) from Abdullah bin Umar from the Prophet which is similar","reference":"Jami` at-Tirmidhi 493, Book 4, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narration for a hadith?","id":"tirmidhi-4-6"},{"hadith-eng":"\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"","reference":"Jami` at-Tirmidhi 494, Book 4, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl before attending the Friday prayer?","id":"tirmidhi-4-7"},{"hadith-eng":"\"Umar [bin al-Khattab] was giving a Khutbah on Friday.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 495, Book 4, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of delivering a Khutbah on Friday in Islam?","id":"tirmidhi-4-8"},{"hadith-eng":"\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"","reference":"Jami` at-Tirmidhi 496, Book 4, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the benefits of performing Ghusl on Friday according to Islamic teachings?","id":"tirmidhi-4-9"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"","reference":"Jami` at-Tirmidhi 497, Book 4, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing Wudu on Fridays in Islam?","id":"tirmidhi-4-10"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"","reference":"Jami` at-Tirmidhi 498, Book 4, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the benefits of performing Wudu well before attending the Friday prayer?","id":"tirmidhi-4-11"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"","reference":"Jami` at-Tirmidhi 499, Book 4, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl on Friday in Islam?","id":"tirmidhi-4-12"},{"hadith-eng":"\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"","reference":"Jami` at-Tirmidhi 500, Book 4, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the consequences of neglecting the Friday prayer without a valid excuse?","id":"tirmidhi-4-13"},{"hadith-eng":"he said: \"The Prophet ordered us to attend the Friday prayer in Quba.\"","reference":"Jami` at-Tirmidhi 501, Book 4, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of attending Friday prayers in Islam?","id":"tirmidhi-4-14"},{"hadith-eng":"I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"","reference":"Jami` at-Tirmidhi 502, Book 4, Hadith 15","grade":"","question #":"question #1","question":"What is the significance of the Friday prayer in Islam?","id":"tirmidhi-4-15"},{"hadith-eng":"\"The Prophet would pray the Friday prayer when the sun was declining.\"","reference":"Jami` at-Tirmidhi 503, Book 4, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"When is the appropriate time to perform the Friday prayer according to Islamic tradition?","id":"tirmidhi-4-16"},{"hadith-eng":"from the Prophet, similarly.","reference":"Jami` at-Tirmidhi 504, Book 4, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narration for a hadith?","id":"tirmidhi-4-17"},{"hadith-eng":"\"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"","reference":"Jami` at-Tirmidhi 505, Book 4, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the crying of the date palm trunk hold in Islamic tradition?","id":"tirmidhi-4-18"},{"hadith-eng":"\"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"","reference":"Jami` at-Tirmidhi 506, Book 4, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the structure of the Friday Khutbah as practiced by the Prophet?","id":"tirmidhi-4-19"},{"hadith-eng":"\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"","reference":"Jami` at-Tirmidhi 507, Book 4, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of moderation in prayer according to Islamic teachings?","id":"tirmidhi-4-20"},{"hadith-eng":"\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.","reference":"Jami` at-Tirmidhi 508, Book 4, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reciting Quranic verses during sermons or speeches in Islam?","id":"tirmidhi-4-21"},{"hadith-eng":"\"When Allah's Messenger descending the Minbar he would face our direction.\"","reference":"Jami` at-Tirmidhi 509, Book 4, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's actions when descending the Minbar?","id":"tirmidhi-4-22"},{"hadith-eng":"\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\" Abu Eisa said: This Hadith is Hasan Sahih [It is the most correct thing about this topic.]","reference":"Jami` at-Tirmidhi 510, Book 4, Hadith 23","grade":"","question #":"question #1","question":"What is the significance of performing prayer before attending the Friday sermon?","id":"tirmidhi-4-23"},{"hadith-eng":"\"Abu Sa'eed Al-Khudri entered (the mosque) on Friday while Marwan was giving the Khutbah, so he began praying. Two guards came to make him sit down but he refused until he had prayed. When he finished he came to us and we said: 'May Allah have mercy upon you. They nearly harmed you.' He said: 'I was not going to stop performing them (the two Rak'ah) after what I saw from Allah's Messenger.' Then he mentioned that a man who appeared untidy came on Friday while the Prophet was delivering the Friday Khutbah, so he ordered him to pray two Rak'ah all the while the Prophet was delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 511, Book 4, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of performing two Rak'ah during the Friday Khutbah?","id":"tirmidhi-4-24"},{"hadith-eng":"Allah's Messenger said: \"Whoever said: 'Be quiet' while the Imam is giving the Khutbah then he has committed Laghw (useless activity).\"","reference":"Jami` at-Tirmidhi 512, Book 4, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is considered inappropriate behavior during the Friday sermon according to Islamic teachings?","id":"tirmidhi-4-25"},{"hadith-eng":"Allah's Messenger said: \"Whoever steps over the necks of the people on Friday, he has taken a bridge to Hell.\"","reference":"Jami` at-Tirmidhi 513, Book 4, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of respecting others during Friday prayers in Islam?","id":"tirmidhi-4-26"},{"hadith-eng":"\"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 514, Book 4, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of prohibiting certain actions during the Friday Khutbah?","id":"tirmidhi-4-27"},{"hadith-eng":"\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.","reference":"Jami` at-Tirmidhi 515, Book 4, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the gesture made by the Prophet during supplication?","id":"tirmidhi-4-28"},{"hadith-eng":"\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"","reference":"Jami` at-Tirmidhi 516, Book 4, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the practice of calling the Adhan during the time of the Prophet Muhammad, Abu Bakr, and Umar?","id":"tirmidhi-4-29"},{"hadith-eng":"\"Allah's Messenger would talk as necessary after descending from the Minbar.\"","reference":"Jami` at-Tirmidhi 517, Book 4, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of speaking only as necessary in Islamic teachings?","id":"tirmidhi-4-30"},{"hadith-eng":"\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"","reference":"Jami` at-Tirmidhi 518, Book 4, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet's priorities when it comes to engaging with people before prayer?","id":"tirmidhi-4-31"},{"hadith-eng":"\"Marwan left Abu Hurairah in charge of Al-Madinah and he went to Makkah. So Abu Hurairah led us in Salat in Friday, reciting Surah Al-Jumuah (in the first Rak'ah) and in the second prostration (Rak'ah): When the hypocrites come to you.\" Ubaidullah said: \"So I caught up with Abu Hurairah and said to him: 'You recited two Surah that Ali recited in Al-Kufah. Abu Hurairah said: 'Indeed I heard Allah's Messenger reciting them.'\"","reference":"Jami` at-Tirmidhi 519, Book 4, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of reciting specific Surahs during the Friday prayer?","id":"tirmidhi-4-32"},{"hadith-eng":"\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"","reference":"Jami` at-Tirmidhi 520, Book 4, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What specific Surahs did the Prophet Muhammad recite during the Fajr prayer on Fridays?","id":"tirmidhi-4-33"},{"hadith-eng":"\"The Prophet would pray two Rak;ah after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 521, Book 4, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing additional prayers after the Friday prayer?","id":"tirmidhi-4-34"},{"hadith-eng":"\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"","reference":"Jami` at-Tirmidhi 522, Book 4, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of performing additional prayers at home after the Friday prayer?","id":"tirmidhi-4-35"},{"hadith-eng":"Allah's Messenger said: \"Whoever among you is to pray after the Friday prayer, then let him pray four.\"","reference":"Jami` at-Tirmidhi 523, Book 4, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the recommended number of units (rak'ahs) to pray after the Friday prayer?","id":"tirmidhi-4-36"},{"hadith-eng":"the Prophet said: \"Whoever catches a Rak'ah of the Salat then he has caught the Salat.\"","reference":"Jami` at-Tirmidhi 524, Book 4, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of catching a Rak'ah in the context of completing a prayer?","id":"tirmidhi-4-37"},{"hadith-eng":"\"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 525, Book 4, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the routine of the companions of the Prophet regarding meals and rest on Fridays?","id":"tirmidhi-4-38"},{"hadith-eng":"the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"","reference":"Jami` at-Tirmidhi 526, Book 4, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #1","question":"What should a person do if they feel sleepy during the Friday prayer?","id":"tirmidhi-4-39"},{"hadith-eng":"\"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"","reference":"Jami` at-Tirmidhi 527, Book 4, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of attending the Friday prayer with the Prophet in Islamic tradition?","id":"tirmidhi-4-40"},{"hadith-eng":"Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"","reference":"Jami` at-Tirmidhi 528, Book 4, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of performing Ghusl on Friday for Muslims?","id":"tirmidhi-4-41"},{"hadith-eng":"(Another route for the same chain) similar in meaning.","reference":"Jami` at-Tirmidhi 529, Book 4, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of having multiple routes or chains for a hadith?","id":"tirmidhi-4-42"},{"hadith-eng":"the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"","reference":"Jami` at-Tirmidhi 488, Book 4, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"What events in the life of Prophet Adam are associated with Friday?","id":"tirmidhi-4-43"},{"hadith-eng":"the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"","reference":"Jami` at-Tirmidhi 489, Book 4, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the time after Asr on Friday considered special for supplication?","id":"tirmidhi-4-44"},{"hadith-eng":"the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"","reference":"Jami` at-Tirmidhi 490, Book 4, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the timing of prayer on Friday relate to the acceptance of supplications?","id":"tirmidhi-4-45"},{"hadith-eng":"\"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"","reference":"Jami` at-Tirmidhi 491, Book 4, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"What events related to Prophet Adam are associated with Friday in Islamic teachings?","id":"tirmidhi-4-46"},{"hadith-eng":"the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"","reference":"Jami` at-Tirmidhi 492, Book 4, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of Ghusl relate to attending Friday prayers?","id":"tirmidhi-4-47"},{"hadith-eng":"(Another chain) from Abdullah bin Umar from the Prophet which is similar","reference":"Jami` at-Tirmidhi 493, Book 4, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the reliability of narrators affect the authenticity of a hadith?","id":"tirmidhi-4-48"},{"hadith-eng":"\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"","reference":"Jami` at-Tirmidhi 494, Book 4, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Umar bin Al-Khattab emphasize the importance of Ghusl for Friday prayers?","id":"tirmidhi-4-49"},{"hadith-eng":"\"Umar [bin al-Khattab] was giving a Khutbah on Friday.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 495, Book 4, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was Umar bin al-Khattab and what role did he play in early Islamic history?","id":"tirmidhi-4-50"},{"hadith-eng":"\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"","reference":"Jami` at-Tirmidhi 496, Book 4, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does arriving early for Friday prayers impact one's spiritual rewards?","id":"tirmidhi-4-51"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"","reference":"Jami` at-Tirmidhi 497, Book 4, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does performing Ghusl compare to performing Wudu in terms of virtue?","id":"tirmidhi-4-52"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"","reference":"Jami` at-Tirmidhi 498, Book 4, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does attending the Friday prayer and maintaining silence contribute to the forgiveness of sins?","id":"tirmidhi-4-53"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"","reference":"Jami` at-Tirmidhi 499, Book 4, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of attending Friday prayers relate to the rewards one receives?","id":"tirmidhi-4-54"},{"hadith-eng":"\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"","reference":"Jami` at-Tirmidhi 500, Book 4, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #2","question":"How many consecutive times can one miss the Friday prayer before facing spiritual consequences?","id":"tirmidhi-4-55"},{"hadith-eng":"he said: \"The Prophet ordered us to attend the Friday prayer in Quba.\"","reference":"Jami` at-Tirmidhi 501, Book 4, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #2","question":"What role did the mosque of Quba play in the early Islamic community?","id":"tirmidhi-4-56"},{"hadith-eng":"I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"","reference":"Jami` at-Tirmidhi 502, Book 4, Hadith 15","grade":"","question #":"question #2","question":"Who is obligated to perform the Friday prayer according to Islamic teachings?","id":"tirmidhi-4-57"},{"hadith-eng":"\"The Prophet would pray the Friday prayer when the sun was declining.\"","reference":"Jami` at-Tirmidhi 503, Book 4, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance does the timing of the Friday prayer hold in Islam?","id":"tirmidhi-4-58"},{"hadith-eng":"from the Prophet, similarly.","reference":"Jami` at-Tirmidhi 504, Book 4, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the consistency of a hadith across different narrators affect its authenticity?","id":"tirmidhi-4-59"},{"hadith-eng":"\"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"","reference":"Jami` at-Tirmidhi 505, Book 4, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the crying of the date palm trunk?","id":"tirmidhi-4-60"},{"hadith-eng":"\"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"","reference":"Jami` at-Tirmidhi 506, Book 4, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of delivering the Friday sermon today compare to that of the Prophet's time?","id":"tirmidhi-4-61"},{"hadith-eng":"\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"","reference":"Jami` at-Tirmidhi 507, Book 4, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of moderation apply to delivering a Khutbah in Islam?","id":"tirmidhi-4-62"},{"hadith-eng":"\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.","reference":"Jami` at-Tirmidhi 508, Book 4, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who is Malik in the context of Islamic teachings and what is his role?","id":"tirmidhi-4-63"},{"hadith-eng":"\"When Allah's Messenger descending the Minbar he would face our direction.\"","reference":"Jami` at-Tirmidhi 509, Book 4, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet interact with his followers during his sermons?","id":"tirmidhi-4-64"},{"hadith-eng":"\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\" Abu Eisa said: This Hadith is Hasan Sahih [It is the most correct thing about this topic.]","reference":"Jami` at-Tirmidhi 510, Book 4, Hadith 23","grade":"","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) emphasize the importance of prayer during the Friday Khutbah?","id":"tirmidhi-4-65"},{"hadith-eng":"\"Abu Sa'eed Al-Khudri entered (the mosque) on Friday while Marwan was giving the Khutbah, so he began praying. Two guards came to make him sit down but he refused until he had prayed. When he finished he came to us and we said: 'May Allah have mercy upon you. They nearly harmed you.' He said: 'I was not going to stop performing them (the two Rak'ah) after what I saw from Allah's Messenger.' Then he mentioned that a man who appeared untidy came on Friday while the Prophet was delivering the Friday Khutbah, so he ordered him to pray two Rak'ah all the while the Prophet was delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 511, Book 4, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet react to actions that were contrary to the norms during the Friday sermon?","id":"tirmidhi-4-66"},{"hadith-eng":"Allah's Messenger said: \"Whoever said: 'Be quiet' while the Imam is giving the Khutbah then he has committed Laghw (useless activity).\"","reference":"Jami` at-Tirmidhi 512, Book 4, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to maintain silence during the Imam's Khutbah?","id":"tirmidhi-4-67"},{"hadith-eng":"Allah's Messenger said: \"Whoever steps over the necks of the people on Friday, he has taken a bridge to Hell.\"","reference":"Jami` at-Tirmidhi 513, Book 4, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the consequences of disrespectful behavior during congregational prayers?","id":"tirmidhi-4-68"},{"hadith-eng":"\"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 514, Book 4, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might specific postures or actions be discouraged during the Friday sermon?","id":"tirmidhi-4-69"},{"hadith-eng":"\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.","reference":"Jami` at-Tirmidhi 515, Book 4, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Umarah bin Rawaibah react to Bishr bin Marwan's actions during the Khutbah?","id":"tirmidhi-4-70"},{"hadith-eng":"\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"","reference":"Jami` at-Tirmidhi 516, Book 4, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"What change did Uthman introduce to the Adhan?","id":"tirmidhi-4-71"},{"hadith-eng":"\"Allah's Messenger would talk as necessary after descending from the Minbar.\"","reference":"Jami` at-Tirmidhi 517, Book 4, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the behavior of the Prophet after descending from the Minbar reflect on the importance of concise communication?","id":"tirmidhi-4-72"},{"hadith-eng":"\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"","reference":"Jami` at-Tirmidhi 518, Book 4, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet's interaction with individuals before prayer reflect his leadership style?","id":"tirmidhi-4-73"},{"hadith-eng":"\"Marwan left Abu Hurairah in charge of Al-Madinah and he went to Makkah. So Abu Hurairah led us in Salat in Friday, reciting Surah Al-Jumuah (in the first Rak'ah) and in the second prostration (Rak'ah): When the hypocrites come to you.\" Ubaidullah said: \"So I caught up with Abu Hurairah and said to him: 'You recited two Surah that Ali recited in Al-Kufah. Abu Hurairah said: 'Indeed I heard Allah's Messenger reciting them.'\"","reference":"Jami` at-Tirmidhi 519, Book 4, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the practice of leading prayers reflect the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-4-74"},{"hadith-eng":"\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"","reference":"Jami` at-Tirmidhi 520, Book 4, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of reciting certain Surahs during the Fajr prayer on Fridays?","id":"tirmidhi-4-75"},{"hadith-eng":"\"The Prophet would pray two Rak;ah after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 521, Book 4, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"How many Rak'ahs did the Prophet pray after the Friday prayer?","id":"tirmidhi-4-76"},{"hadith-eng":"\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"","reference":"Jami` at-Tirmidhi 522, Book 4, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his practice of prayer after the Friday prayer?","id":"tirmidhi-4-77"},{"hadith-eng":"Allah's Messenger said: \"Whoever among you is to pray after the Friday prayer, then let him pray four.\"","reference":"Jami` at-Tirmidhi 523, Book 4, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"What guidance did the Prophet Muhammad provide regarding prayers following the Jumu'ah prayer?","id":"tirmidhi-4-78"},{"hadith-eng":"the Prophet said: \"Whoever catches a Rak'ah of the Salat then he has caught the Salat.\"","reference":"Jami` at-Tirmidhi 524, Book 4, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does catching a Rak'ah affect the validity of one's prayer?","id":"tirmidhi-4-79"},{"hadith-eng":"\"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 525, Book 4, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the timing of the Friday prayer affect daily activities during the time of the Prophet?","id":"tirmidhi-4-80"},{"hadith-eng":"the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"","reference":"Jami` at-Tirmidhi 526, Book 4, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to change one's position if feeling sleepy during a religious gathering?","id":"tirmidhi-4-81"},{"hadith-eng":"\"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"","reference":"Jami` at-Tirmidhi 527, Book 4, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the intention behind one's actions affect their spiritual reward in Islam?","id":"tirmidhi-4-82"},{"hadith-eng":"Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"","reference":"Jami` at-Tirmidhi 528, Book 4, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does wearing perfume relate to the Friday prayer in Islamic teachings?","id":"tirmidhi-4-83"},{"hadith-eng":"(Another route for the same chain) similar in meaning.","reference":"Jami` at-Tirmidhi 529, Book 4, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the consistency in meaning across different narrations affect the authenticity of a hadith?","id":"tirmidhi-4-84"},{"hadith-eng":"the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"","reference":"Jami` at-Tirmidhi 488, Book 4, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is the Day of Judgment related to Friday according to Islamic teachings?","id":"tirmidhi-4-85"},{"hadith-eng":"the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"","reference":"Jami` at-Tirmidhi 489, Book 4, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the recommended practices for Muslims on Fridays?","id":"tirmidhi-4-86"},{"hadith-eng":"the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"","reference":"Jami` at-Tirmidhi 490, Book 4, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions should a worshipper take during the special hour on Friday to ensure their prayers are answered?","id":"tirmidhi-4-87"},{"hadith-eng":"\"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"","reference":"Jami` at-Tirmidhi 491, Book 4, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the special hour on Friday during which prayers are accepted, and how is it identified?","id":"tirmidhi-4-88"},{"hadith-eng":"the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"","reference":"Jami` at-Tirmidhi 492, Book 4, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the benefits of performing Ghusl before attending the Friday congregation?","id":"tirmidhi-4-89"},{"hadith-eng":"(Another chain) from Abdullah bin Umar from the Prophet which is similar","reference":"Jami` at-Tirmidhi 493, Book 4, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does Abdullah bin Umar play in the transmission of hadiths?","id":"tirmidhi-4-90"},{"hadith-eng":"\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"","reference":"Jami` at-Tirmidhi 494, Book 4, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the practices of the Companions regarding preparation for Friday prayers?","id":"tirmidhi-4-91"},{"hadith-eng":"\"Umar [bin al-Khattab] was giving a Khutbah on Friday.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 495, Book 4, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of narrating hadiths through reliable chains of transmission?","id":"tirmidhi-4-92"},{"hadith-eng":"\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"","reference":"Jami` at-Tirmidhi 496, Book 4, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of listening and remaining silent during the Friday sermon?","id":"tirmidhi-4-93"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"","reference":"Jami` at-Tirmidhi 497, Book 4, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the benefits associated with performing Ghusl on Fridays?","id":"tirmidhi-4-94"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"","reference":"Jami` at-Tirmidhi 498, Book 4, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of avoiding useless activities during the Friday prayer?","id":"tirmidhi-4-95"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"","reference":"Jami` at-Tirmidhi 499, Book 4, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different rewards associated with attending Friday prayers at various times?","id":"tirmidhi-4-96"},{"hadith-eng":"\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"","reference":"Jami` at-Tirmidhi 500, Book 4, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #3","question":"What does it mean for Allah to set a seal upon a person's heart?","id":"tirmidhi-4-97"},{"hadith-eng":"he said: \"The Prophet ordered us to attend the Friday prayer in Quba.\"","reference":"Jami` at-Tirmidhi 501, Book 4, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad encourage participation in communal prayers?","id":"tirmidhi-4-98"},{"hadith-eng":"I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"","reference":"Jami` at-Tirmidhi 502, Book 4, Hadith 15","grade":"","question #":"question #3","question":"How did Ahmad bin Hanbal react to the mention of a hadith about the Friday prayer?","id":"tirmidhi-4-99"},{"hadith-eng":"\"The Prophet would pray the Friday prayer when the sun was declining.\"","reference":"Jami` at-Tirmidhi 503, Book 4, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the timing of the Friday prayer relate to the position of the sun?","id":"tirmidhi-4-100"},{"hadith-eng":"from the Prophet, similarly.","reference":"Jami` at-Tirmidhi 504, Book 4, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-4-101"},{"hadith-eng":"\"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"","reference":"Jami` at-Tirmidhi 505, Book 4, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the interaction between the Prophet and the date palm trunk indicate about his relationship with nature?","id":"tirmidhi-4-102"},{"hadith-eng":"\"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"","reference":"Jami` at-Tirmidhi 506, Book 4, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the key components of the Friday sermon according to Islamic tradition?","id":"tirmidhi-4-103"},{"hadith-eng":"\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"","reference":"Jami` at-Tirmidhi 507, Book 4, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why might the Prophet's approach to prayer and Khutbah be considered a model for Muslims?","id":"tirmidhi-4-104"},{"hadith-eng":"\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.","reference":"Jami` at-Tirmidhi 508, Book 4, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of the Minbar in Islamic tradition?","id":"tirmidhi-4-105"},{"hadith-eng":"\"When Allah's Messenger descending the Minbar he would face our direction.\"","reference":"Jami` at-Tirmidhi 509, Book 4, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's behavior when concluding a sermon?","id":"tirmidhi-4-106"},{"hadith-eng":"\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\" Abu Eisa said: This Hadith is Hasan Sahih [It is the most correct thing about this topic.]","reference":"Jami` at-Tirmidhi 510, Book 4, Hadith 23","grade":"","question #":"question #3","question":"What should a person do if they arrive at the mosque during the Friday sermon without having prayed?","id":"tirmidhi-4-107"},{"hadith-eng":"\"Abu Sa'eed Al-Khudri entered (the mosque) on Friday while Marwan was giving the Khutbah, so he began praying. Two guards came to make him sit down but he refused until he had prayed. When he finished he came to us and we said: 'May Allah have mercy upon you. They nearly harmed you.' He said: 'I was not going to stop performing them (the two Rak'ah) after what I saw from Allah's Messenger.' Then he mentioned that a man who appeared untidy came on Friday while the Prophet was delivering the Friday Khutbah, so he ordered him to pray two Rak'ah all the while the Prophet was delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 511, Book 4, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned about the importance of following the Prophet's actions even in challenging situations?","id":"tirmidhi-4-108"},{"hadith-eng":"Allah's Messenger said: \"Whoever said: 'Be quiet' while the Imam is giving the Khutbah then he has committed Laghw (useless activity).\"","reference":"Jami` at-Tirmidhi 512, Book 4, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences of engaging in useless activity during the Friday sermon?","id":"tirmidhi-4-109"},{"hadith-eng":"Allah's Messenger said: \"Whoever steps over the necks of the people on Friday, he has taken a bridge to Hell.\"","reference":"Jami` at-Tirmidhi 513, Book 4, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islam view the act of stepping over people in a gathering?","id":"tirmidhi-4-110"},{"hadith-eng":"\"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 514, Book 4, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the etiquettes to be observed while the Imam is delivering the Friday sermon?","id":"tirmidhi-4-111"},{"hadith-eng":"\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.","reference":"Jami` at-Tirmidhi 515, Book 4, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's practice in raising hands during supplication?","id":"tirmidhi-4-112"},{"hadith-eng":"\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"","reference":"Jami` at-Tirmidhi 516, Book 4, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the Iqamah in the context of Salat?","id":"tirmidhi-4-113"},{"hadith-eng":"\"Allah's Messenger would talk as necessary after descending from the Minbar.\"","reference":"Jami` at-Tirmidhi 517, Book 4, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lessons can be learned about public speaking from the actions of the Prophet?","id":"tirmidhi-4-114"},{"hadith-eng":"\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"","reference":"Jami` at-Tirmidhi 518, Book 4, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the Prophet's behavior before the prayer indicate about the balance between religious duties and personal interactions?","id":"tirmidhi-4-115"},{"hadith-eng":"\"Marwan left Abu Hurairah in charge of Al-Madinah and he went to Makkah. So Abu Hurairah led us in Salat in Friday, reciting Surah Al-Jumuah (in the first Rak'ah) and in the second prostration (Rak'ah): When the hypocrites come to you.\" Ubaidullah said: \"So I caught up with Abu Hurairah and said to him: 'You recited two Surah that Ali recited in Al-Kufah. Abu Hurairah said: 'Indeed I heard Allah's Messenger reciting them.'\"","reference":"Jami` at-Tirmidhi 519, Book 4, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the importance of following the Prophet's tradition in prayer recitations?","id":"tirmidhi-4-116"},{"hadith-eng":"\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"","reference":"Jami` at-Tirmidhi 520, Book 4, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the recitation of specific Surahs during prayer reflect the practices of the Prophet Muhammad?","id":"tirmidhi-4-117"},{"hadith-eng":"\"The Prophet would pray two Rak;ah after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 521, Book 4, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the Prophet's prayer habits from this practice?","id":"tirmidhi-4-118"},{"hadith-eng":"\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"","reference":"Jami` at-Tirmidhi 522, Book 4, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from Ibn Umar's actions regarding post-Friday prayer practices?","id":"tirmidhi-4-119"},{"hadith-eng":"Allah's Messenger said: \"Whoever among you is to pray after the Friday prayer, then let him pray four.\"","reference":"Jami` at-Tirmidhi 523, Book 4, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the practice of additional prayers after Jumu'ah contribute to a Muslim's spiritual routine?","id":"tirmidhi-4-120"},{"hadith-eng":"the Prophet said: \"Whoever catches a Rak'ah of the Salat then he has caught the Salat.\"","reference":"Jami` at-Tirmidhi 524, Book 4, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does it mean to catch a Rak'ah during Salat?","id":"tirmidhi-4-121"},{"hadith-eng":"\"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 525, Book 4, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance did the Friday prayer hold in the daily schedule of the early Muslims?","id":"tirmidhi-4-122"},{"hadith-eng":"the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"","reference":"Jami` at-Tirmidhi 526, Book 4, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the etiquettes to follow during the Friday prayer to maintain attentiveness?","id":"tirmidhi-4-123"},{"hadith-eng":"\"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"","reference":"Jami` at-Tirmidhi 527, Book 4, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned about the value of prayer in comparison to other duties from this narration?","id":"tirmidhi-4-124"},{"hadith-eng":"Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"","reference":"Jami` at-Tirmidhi 528, Book 4, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #3","question":"What alternatives are suggested if a person does not have perfume for Friday?","id":"tirmidhi-4-125"},{"hadith-eng":"(Another route for the same chain) similar in meaning.","reference":"Jami` at-Tirmidhi 529, Book 4, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the role of narrators in preserving the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-4-126"},{"hadith-eng":"the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"","reference":"Jami` at-Tirmidhi 488, Book 4, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is Friday considered a special day in Islam?","id":"tirmidhi-4-127"},{"hadith-eng":"the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"","reference":"Jami` at-Tirmidhi 489, Book 4, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the time of sunset relate to the concept of an accepted hour for prayers on Friday?","id":"tirmidhi-4-128"},{"hadith-eng":"the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"","reference":"Jami` at-Tirmidhi 490, Book 4, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is the period from the beginning to the end of Friday prayer considered special for making supplications?","id":"tirmidhi-4-129"},{"hadith-eng":"\"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"","reference":"Jami` at-Tirmidhi 491, Book 4, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of being in a state of prayer extend beyond the physical act of performing Salat?","id":"tirmidhi-4-130"},{"hadith-eng":"the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"","reference":"Jami` at-Tirmidhi 492, Book 4, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is personal cleanliness emphasized in Islamic teachings, particularly on Fridays?","id":"tirmidhi-4-131"},{"hadith-eng":"(Another chain) from Abdullah bin Umar from the Prophet which is similar","reference":"Jami` at-Tirmidhi 493, Book 4, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to compare different chains of narration for the same hadith?","id":"tirmidhi-4-132"},{"hadith-eng":"\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"","reference":"Jami` at-Tirmidhi 494, Book 4, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration suggest about the understanding of Wudu and Ghusl among the early Muslims?","id":"tirmidhi-4-133"},{"hadith-eng":"\"Umar [bin al-Khattab] was giving a Khutbah on Friday.\" And he mentioned this Hadith.","reference":"Jami` at-Tirmidhi 495, Book 4, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the practice of giving a Khutbah relate to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-4-134"},{"hadith-eng":"\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"","reference":"Jami` at-Tirmidhi 496, Book 4, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the reward for attending Friday prayers compared to a year of fasting and prayer?","id":"tirmidhi-4-135"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"","reference":"Jami` at-Tirmidhi 497, Book 4, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why might Ghusl be considered more virtuous than Wudu according to Islamic teachings?","id":"tirmidhi-4-136"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"","reference":"Jami` at-Tirmidhi 498, Book 4, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the act of listening attentively during the Friday prayer impact one's spiritual state?","id":"tirmidhi-4-137"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"","reference":"Jami` at-Tirmidhi 499, Book 4, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role do angels play during the Friday prayers according to Islamic teachings?","id":"tirmidhi-4-138"},{"hadith-eng":"\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"","reference":"Jami` at-Tirmidhi 500, Book 4, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is attending the Friday prayer considered important in Islam?","id":"tirmidhi-4-139"},{"hadith-eng":"he said: \"The Prophet ordered us to attend the Friday prayer in Quba.\"","reference":"Jami` at-Tirmidhi 501, Book 4, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the benefits of attending Friday prayers for Muslims?","id":"tirmidhi-4-140"},{"hadith-eng":"I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"","reference":"Jami` at-Tirmidhi 502, Book 4, Hadith 15","grade":"","question #":"question #4","question":"What should one do if they mistakenly attribute a saying to the Prophet?","id":"tirmidhi-4-141"},{"hadith-eng":"\"The Prophet would pray the Friday prayer when the sun was declining.\"","reference":"Jami` at-Tirmidhi 503, Book 4, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the practices of the Prophet regarding the timing of the Friday prayer?","id":"tirmidhi-4-142"},{"hadith-eng":"\"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"","reference":"Jami` at-Tirmidhi 505, Book 4, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #4","question":"What lesson can be learned from the Prophet's use of the Minbar instead of the date palm trunk?","id":"tirmidhi-4-143"},{"hadith-eng":"\"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"","reference":"Jami` at-Tirmidhi 506, Book 4, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is the Friday Khutbah an important aspect of the Jumu'ah prayer?","id":"tirmidhi-4-144"},{"hadith-eng":"\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"","reference":"Jami` at-Tirmidhi 507, Book 4, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the benefits of maintaining a balanced approach in religious practices?","id":"tirmidhi-4-145"},{"hadith-eng":"\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.","reference":"Jami` at-Tirmidhi 508, Book 4, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do different companions of the Prophet contribute to the understanding of his teachings?","id":"tirmidhi-4-146"},{"hadith-eng":"\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\" Abu Eisa said: This Hadith is Hasan Sahih [It is the most correct thing about this topic.]","reference":"Jami` at-Tirmidhi 510, Book 4, Hadith 23","grade":"","question #":"question #4","question":"What does this narration teach about the Prophet's (ﷺ) approach to guiding his followers in religious practices?","id":"tirmidhi-4-147"},{"hadith-eng":"\"Abu Sa'eed Al-Khudri entered (the mosque) on Friday while Marwan was giving the Khutbah, so he began praying. Two guards came to make him sit down but he refused until he had prayed. When he finished he came to us and we said: 'May Allah have mercy upon you. They nearly harmed you.' He said: 'I was not going to stop performing them (the two Rak'ah) after what I saw from Allah's Messenger.' Then he mentioned that a man who appeared untidy came on Friday while the Prophet was delivering the Friday Khutbah, so he ordered him to pray two Rak'ah all the while the Prophet was delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 511, Book 4, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the hadith illustrate the balance between listening to the Khutbah and performing prayer?","id":"tirmidhi-4-148"},{"hadith-eng":"Allah's Messenger said: \"Whoever said: 'Be quiet' while the Imam is giving the Khutbah then he has committed Laghw (useless activity).\"","reference":"Jami` at-Tirmidhi 512, Book 4, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic tradition view interruptions during religious sermons?","id":"tirmidhi-4-149"},{"hadith-eng":"Allah's Messenger said: \"Whoever steps over the necks of the people on Friday, he has taken a bridge to Hell.\"","reference":"Jami` at-Tirmidhi 513, Book 4, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #4","question":"What actions during Friday prayers could lead to severe consequences in the hereafter?","id":"tirmidhi-4-150"},{"hadith-eng":"\"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 514, Book 4, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the prohibition of certain actions during the Khutbah reflect on the importance of attentiveness?","id":"tirmidhi-4-151"},{"hadith-eng":"\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.","reference":"Jami` at-Tirmidhi 515, Book 4, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the reaction of Umarah bin Rawaibah indicate about the importance of following the Prophet's example?","id":"tirmidhi-4-152"},{"hadith-eng":"\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"","reference":"Jami` at-Tirmidhi 516, Book 4, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the practice of Adhan evolve during the early Islamic period?","id":"tirmidhi-4-153"},{"hadith-eng":"\"Allah's Messenger would talk as necessary after descending from the Minbar.\"","reference":"Jami` at-Tirmidhi 517, Book 4, Hadith 30","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might it be important for a leader to limit their speech to what is necessary?","id":"tirmidhi-4-154"},{"hadith-eng":"\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"","reference":"Jami` at-Tirmidhi 518, Book 4, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"How might the Prophet's actions before the prayer serve as a lesson in patience and attentiveness for his followers?","id":"tirmidhi-4-155"},{"hadith-eng":"\"Marwan left Abu Hurairah in charge of Al-Madinah and he went to Makkah. So Abu Hurairah led us in Salat in Friday, reciting Surah Al-Jumuah (in the first Rak'ah) and in the second prostration (Rak'ah): When the hypocrites come to you.\" Ubaidullah said: \"So I caught up with Abu Hurairah and said to him: 'You recited two Surah that Ali recited in Al-Kufah. Abu Hurairah said: 'Indeed I heard Allah's Messenger reciting them.'\"","reference":"Jami` at-Tirmidhi 519, Book 4, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet ensure the accuracy of prayer practices?","id":"tirmidhi-4-156"},{"hadith-eng":"\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"","reference":"Jami` at-Tirmidhi 520, Book 4, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet Muhammad's prayer routine from his choice of Surahs during the Fajr prayer on Fridays?","id":"tirmidhi-4-157"},{"hadith-eng":"\"The Prophet would pray two Rak;ah after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 521, Book 4, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might additional prayers be performed after obligatory prayers in Islam?","id":"tirmidhi-4-158"},{"hadith-eng":"\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"","reference":"Jami` at-Tirmidhi 522, Book 4, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might someone choose to perform additional rak'ahs at home following the Friday prayer?","id":"tirmidhi-4-159"},{"hadith-eng":"the Prophet said: \"Whoever catches a Rak'ah of the Salat then he has caught the Salat.\"","reference":"Jami` at-Tirmidhi 524, Book 4, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is the concept of catching a Rak'ah relevant to the timing of prayer?","id":"tirmidhi-4-160"},{"hadith-eng":"\"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"","reference":"Jami` at-Tirmidhi 525, Book 4, Hadith 38","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions of the Prophet prioritize their activities around the Friday prayer?","id":"tirmidhi-4-161"},{"hadith-eng":"the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"","reference":"Jami` at-Tirmidhi 526, Book 4, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #4","question":"How can one maintain focus and alertness during religious sermons or prayers?","id":"tirmidhi-4-162"},{"hadith-eng":"\"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"","reference":"Jami` at-Tirmidhi 527, Book 4, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the timing of one's actions influence their spiritual merit according to Islamic teachings?","id":"tirmidhi-4-163"},{"hadith-eng":"Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"","reference":"Jami` at-Tirmidhi 528, Book 4, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is personal hygiene emphasized in preparation for Friday prayers?","id":"tirmidhi-4-164"},{"hadith-eng":"(Another route for the same chain) similar in meaning.","reference":"Jami` at-Tirmidhi 529, Book 4, Hadith 42","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the classification of hadiths in collections like Jami` at-Tirmidhi contribute to Islamic jurisprudence?","id":"tirmidhi-4-165"},{"hadith-eng":"the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"","reference":"Jami` at-Tirmidhi 488, Book 4, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the key events mentioned in Islamic tradition that occurred on a Friday?","id":"tirmidhi-4-166"},{"hadith-eng":"the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"","reference":"Jami` at-Tirmidhi 489, Book 4, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of seeking specific times for prayer in Islam?","id":"tirmidhi-4-167"},{"hadith-eng":"the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"","reference":"Jami` at-Tirmidhi 490, Book 4, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of a special hour on Friday reflect the importance of timing in Islamic worship?","id":"tirmidhi-4-168"},{"hadith-eng":"\"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"","reference":"Jami` at-Tirmidhi 491, Book 4, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of Abdullah bin Salam in explaining the special hour on Friday?","id":"tirmidhi-4-169"},{"hadith-eng":"the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"","reference":"Jami` at-Tirmidhi 492, Book 4, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the recommended practices for Muslims to prepare for the Friday prayer?","id":"tirmidhi-4-170"},{"hadith-eng":"\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"","reference":"Jami` at-Tirmidhi 494, Book 4, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this incident reflect the adherence to the Prophet's teachings by his Companions?","id":"tirmidhi-4-171"},{"hadith-eng":"\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"","reference":"Jami` at-Tirmidhi 496, Book 4, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What actions are recommended for Muslims to perform on Fridays to gain spiritual rewards?","id":"tirmidhi-4-172"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"","reference":"Jami` at-Tirmidhi 497, Book 4, Hadith 10","grade":"Hasan(Darussalam)","question #":"question #5","question":"What practices are recommended for Muslims to perform on Fridays for spiritual benefit?","id":"tirmidhi-4-173"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"","reference":"Jami` at-Tirmidhi 498, Book 4, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the additional reward mentioned for those who perform Wudu and attend the Friday prayer?","id":"tirmidhi-4-174"},{"hadith-eng":"Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"","reference":"Jami` at-Tirmidhi 499, Book 4, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"How is charity compared to attending Friday prayers in this context?","id":"tirmidhi-4-175"},{"hadith-eng":"\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"","reference":"Jami` at-Tirmidhi 500, Book 4, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #5","question":"What constitutes a valid excuse for missing the Friday prayer?","id":"tirmidhi-4-176"},{"hadith-eng":"he said: \"The Prophet ordered us to attend the Friday prayer in Quba.\"","reference":"Jami` at-Tirmidhi 501, Book 4, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does attending Friday prayers contribute to the sense of community among Muslims?","id":"tirmidhi-4-177"},{"hadith-eng":"I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"","reference":"Jami` at-Tirmidhi 502, Book 4, Hadith 15","grade":"","question #":"question #5","question":"What is the role of seeking forgiveness in Islamic practice when an error is made?","id":"tirmidhi-4-178"},{"hadith-eng":"\"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"","reference":"Jami` at-Tirmidhi 505, Book 4, Hadith 18","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this event reflect the emotional connection between the Prophet and his surroundings?","id":"tirmidhi-4-179"},{"hadith-eng":"\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"","reference":"Jami` at-Tirmidhi 507, Book 4, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can moderation in religious duties impact a believer's spiritual life?","id":"tirmidhi-4-180"},{"hadith-eng":"\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.","reference":"Jami` at-Tirmidhi 508, Book 4, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of calling upon Malik in the context of the afterlife according to Islamic belief?","id":"tirmidhi-4-181"},{"hadith-eng":"\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\" Abu Eisa said: This Hadith is Hasan Sahih [It is the most correct thing about this topic.]","reference":"Jami` at-Tirmidhi 510, Book 4, Hadith 23","grade":"","question #":"question #5","question":"Why is it important to perform prayer even if one arrives late to the Friday sermon?","id":"tirmidhi-4-182"},{"hadith-eng":"\"Abu Sa'eed Al-Khudri entered (the mosque) on Friday while Marwan was giving the Khutbah, so he began praying. Two guards came to make him sit down but he refused until he had prayed. When he finished he came to us and we said: 'May Allah have mercy upon you. They nearly harmed you.' He said: 'I was not going to stop performing them (the two Rak'ah) after what I saw from Allah's Messenger.' Then he mentioned that a man who appeared untidy came on Friday while the Prophet was delivering the Friday Khutbah, so he ordered him to pray two Rak'ah all the while the Prophet was delivering the Khutbah.\"","reference":"Jami` at-Tirmidhi 511, Book 4, Hadith 24","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this incident teach about the importance of adhering to the Sunnah in public gatherings?","id":"tirmidhi-4-183"},{"hadith-eng":"Allah's Messenger said: \"Whoever said: 'Be quiet' while the Imam is giving the Khutbah then he has committed Laghw (useless activity).\"","reference":"Jami` at-Tirmidhi 512, Book 4, Hadith 25","grade":"Sahih(Darussalam)","question #":"question #5","question":"What actions are discouraged while the Imam is delivering the Khutbah?","id":"tirmidhi-4-184"},{"hadith-eng":"Allah's Messenger said: \"Whoever steps over the necks of the people on Friday, he has taken a bridge to Hell.\"","reference":"Jami` at-Tirmidhi 513, Book 4, Hadith 26","grade":"Da'if(Darussalam)","question #":"question #5","question":"Why is it important to maintain decorum and respect in religious gatherings?","id":"tirmidhi-4-185"},{"hadith-eng":"\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.","reference":"Jami` at-Tirmidhi 515, Book 4, Hadith 28","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith highlight the importance of adhering to the Prophet's practices in religious rituals?","id":"tirmidhi-4-186"},{"hadith-eng":"\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"","reference":"Jami` at-Tirmidhi 516, Book 4, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the purpose of the additional call introduced by Uthman at Az-Zawra?","id":"tirmidhi-4-187"},{"hadith-eng":"\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"","reference":"Jami` at-Tirmidhi 518, Book 4, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the hadith suggest about the Prophet's approach to addressing the needs of individuals even during religious obligations?","id":"tirmidhi-4-188"},{"hadith-eng":"\"Marwan left Abu Hurairah in charge of Al-Madinah and he went to Makkah. So Abu Hurairah led us in Salat in Friday, reciting Surah Al-Jumuah (in the first Rak'ah) and in the second prostration (Rak'ah): When the hypocrites come to you.\" Ubaidullah said: \"So I caught up with Abu Hurairah and said to him: 'You recited two Surah that Ali recited in Al-Kufah. Abu Hurairah said: 'Indeed I heard Allah's Messenger reciting them.'\"","reference":"Jami` at-Tirmidhi 519, Book 4, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role did Abu Hurairah play in preserving the traditions of the Prophet?","id":"tirmidhi-4-189"},{"hadith-eng":"\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"","reference":"Jami` at-Tirmidhi 520, Book 4, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why might the Prophet Muhammad have chosen to recite these particular Surahs during the Fajr prayer on Fridays?","id":"tirmidhi-4-190"},{"hadith-eng":"\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"","reference":"Jami` at-Tirmidhi 522, Book 4, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this practice indicate about the flexibility of prayer locations in Islam?","id":"tirmidhi-4-191"},{"hadith-eng":"\"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"","reference":"Jami` at-Tirmidhi 527, Book 4, Hadith 40","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does this narration suggest about the balance between communal obligations and personal spiritual practices?","id":"tirmidhi-4-192"},{"hadith-eng":"Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"","reference":"Jami` at-Tirmidhi 528, Book 4, Hadith 41","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the recommended practices for Muslims to follow on Fridays?","id":"tirmidhi-4-193"}]