[{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"","reference":"Jami` at-Tirmidhi 2736, Book 43, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the six courtesies that a Muslim should extend to another Muslim?","id":"tirmidhi-43-1"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"","reference":"Jami` at-Tirmidhi 2737, Book 43, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the responsibilities of a believer towards another believer in times of illness?","id":"tirmidhi-43-2"},{"hadith-eng":"from Nafi: \"A man sneezed beside Ibn 'Umar and said: 'Al-Hamdulillah Was-Salamu 'Ala Rasulillah. (All praise is due to Allah, and peace upon the Messenger of Allah)'. So Ibn 'Umar said: 'I too say Al-Hamdulillah Was-Salamu 'Ala Rasulillah, but this is not what the Messenger of Allah (ﷺ) taught us. He taught us to say: \"Al-Hamdulillah 'Ala Kulli Hal (All praise is due to Allah in every circumstance).\"","reference":"Jami` at-Tirmidhi 2738, Book 43, Hadith 3","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of saying 'Al-Hamdulillah' after sneezing in Islamic tradition?","id":"tirmidhi-43-3"},{"hadith-eng":"The Jews used to sneeze in the presence of the Prophet (ﷺ) hoping that he would say: 'Yarhamukumullah (May Allah have mercy upon you).' So he said: 'Yahdikumullahu Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2739, Book 43, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What was the reaction of the Jews when they sneezed in the presence of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-4"},{"hadith-eng":"that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"","reference":"Jami` at-Tirmidhi 2740, Book 43, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the proper etiquette for responding to someone who sneezes in Islam?","id":"tirmidhi-43-5"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you sneezes let him say: 'Al-Hamdulillahi 'Ala Kulli Hal (All praise is due to Allah in every circumstance).' And let the one replying to him say: \"Yarhamukallah (May Allah have mercy upon you).' And let him say to him: 'Yahdikumullah Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2741, Book 43, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the recommended phrase to say after sneezing according to Islamic teachings?","id":"tirmidhi-43-6"},{"hadith-eng":"that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"","reference":"Jami` at-Tirmidhi 2742, Book 43, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of praising Allah after sneezing in Islamic teachings?","id":"tirmidhi-43-7"},{"hadith-eng":"from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"","reference":"Jami` at-Tirmidhi 2743, Book 43, Hadith 10","grade":"","question #":"question #1","question":"What is the significance of saying 'Yarhamukallah' when someone sneezes?","id":"tirmidhi-43-8"},{"hadith-eng":"from his mother, from her father, who said: \"The Messenger of Allah (ﷺ) said: 'Reply three times to the sneezing person. If he (sneezes) more, then if you wish reply and if you do not then do not.'\"","reference":"Jami` at-Tirmidhi 2744, Book 43, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #1","question":"How many times should one respond to a person who sneezes?","id":"tirmidhi-43-9"},{"hadith-eng":"that when the Prophet (ﷺ) would sneeze, he would cover his face with his hand or with his garment, and muffle the sound with it.","reference":"Jami` at-Tirmidhi 2745, Book 43, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the etiquette of sneezing according to Islamic teachings?","id":"tirmidhi-43-10"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]","reference":"Jami` at-Tirmidhi 2746, Book 43, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of sneezing and yawning in Islamic teachings?","id":"tirmidhi-43-11"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah loves sneezing and He dislikes the yawn. So when one of you sneezes and says 'Al-Hamdulillah (All praise is due to Allah),' then it is a right due from every one who hears him to say: 'Yarhamukallah (May Allah have mercy upon you)' As for yawning then when one of you yawns let him suppress it as much as possible and not say: \"Hah Hah' for that is only from Ash-Shaitan laughing at him.\"","reference":"Jami` at-Tirmidhi 2747, Book 43, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of saying 'Al-Hamdulillah' after sneezing in Islam?","id":"tirmidhi-43-12"},{"hadith-eng":"from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"","reference":"Jami` at-Tirmidhi 2748, Book 43, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are some actions or occurrences during prayer that are considered to be from Ash-Shaitan?","id":"tirmidhi-43-13"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2749, Book 43, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What ethical considerations should be observed when taking someone else's seat?","id":"tirmidhi-43-14"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2750, Book 43, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"What ethical considerations should be observed when taking someone's place in a gathering?","id":"tirmidhi-43-15"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man has more right to his seat. If he leaves for some need of his, then he returns, then he has more right to his seat.\"","reference":"Jami` at-Tirmidhi 2751, Book 43, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a person's right to their seat in a gathering?","id":"tirmidhi-43-16"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"","reference":"Jami` at-Tirmidhi 2752, Book 43, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before separating two individuals?","id":"tirmidhi-43-17"},{"hadith-eng":"\"There was no person more beloved to them than the Messenger of Allah (ﷺ).\" [He said:] \"And they would not stand when they saw him because they knew that he disliked that.\"","reference":"Jami` at-Tirmidhi 2754, Book 43, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does this narration indicate about the companions' love for the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-18"},{"hadith-eng":"that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"","reference":"Jami` at-Tirmidhi 2755, Book 43, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on seeking respect and honor from others?","id":"tirmidhi-43-19"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"","reference":"Jami` at-Tirmidhi 2756, Book 43, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the practices considered part of the natural disposition (Fitrah) in Islam?","id":"tirmidhi-43-20"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"","reference":"Jami` at-Tirmidhi 2757, Book 43, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the practices considered part of the natural disposition (Fitrah) in Islam?","id":"tirmidhi-43-21"},{"hadith-eng":"from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.","reference":"Jami` at-Tirmidhi 2758, Book 43, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the recommended frequency for trimming fingernails in Islam?","id":"tirmidhi-43-22"},{"hadith-eng":"\"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"","reference":"Jami` at-Tirmidhi 2759, Book 43, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the recommended grooming practices in Islam regarding personal hygiene?","id":"tirmidhi-43-23"},{"hadith-eng":"\"The Prophet (ﷺ) would pare, or take from his mustache, and Ibrahim Khalilur-Rahman would do it (as well).\"","reference":"Jami` at-Tirmidhi 2760, Book 43, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of trimming the mustache in Islamic tradition?","id":"tirmidhi-43-24"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"","reference":"Jami` at-Tirmidhi 2761, Book 43, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of grooming one's mustache in Islamic teachings?","id":"tirmidhi-43-25"},{"hadith-eng":"from his father, from his grandfather that he Prophet (ﷺ) would take from his beard; from its breadth and its length.","reference":"Jami` at-Tirmidhi 2762, Book 43, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #1","question":"What guidance does Islam provide regarding grooming and maintaining one's beard?","id":"tirmidhi-43-26"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Trim the mustache and leave the beard to grow.\"","reference":"Jami` at-Tirmidhi 2763, Book 43, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance is provided regarding the grooming of facial hair in Islam?","id":"tirmidhi-43-27"},{"hadith-eng":"that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.","reference":"Jami` at-Tirmidhi 2764, Book 43, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the grooming practices recommended for Muslim men regarding facial hair?","id":"tirmidhi-43-28"},{"hadith-eng":"from his paternal uncle, that he saw the Prophet (ﷺ) reclining in the Masjid, and placing one of his feet atop another.","reference":"Jami` at-Tirmidhi 2765, Book 43, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet's (ﷺ) behavior and demeanor in the mosque?","id":"tirmidhi-43-29"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2766, Book 43, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the specific prohibitions mentioned by the Prophet Muhammad (ﷺ) regarding certain postures or ways of sitting?","id":"tirmidhi-43-30"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2767, Book 43, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the specific prohibitions mentioned by the Prophet Muhammad (ﷺ) regarding certain postures or clothing?","id":"tirmidhi-43-31"},{"hadith-eng":"that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"","reference":"Jami` at-Tirmidhi 2768, Book 43, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of body posture in Islam according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-43-32"},{"hadith-eng":"\"My father narrated to me from my grandfather, who said: 'I said: \"O Messenger of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?\" He said: \"Protect your 'Awrah except from your wife or what your right hand possesses.\"' He said: \"What about a man with another man?\" He said: \"If you are able to not let anyone see it, then do so.\" I said: \"What about a man when he is alone?\" He said: \"Allah is most deserving of being shy from Him.\"","reference":"Jami` at-Tirmidhi 2769, Book 43, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidelines are provided for covering one's 'Awrah in the presence of others?","id":"tirmidhi-43-33"},{"hadith-eng":"\"I saw the Messenger of Allah (ﷺ) reclining upon as pillow, on his left side.\"","reference":"Jami` at-Tirmidhi 2770, Book 43, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the Prophet Muhammad's (ﷺ) habits or practices from his posture while reclining?","id":"tirmidhi-43-34"},{"hadith-eng":"\"I saw the Prophet (ﷺ) reclining upon a pillow.\"","reference":"Jami` at-Tirmidhi 2771, Book 43, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does the posture of reclining signify about the Prophet's (ﷺ) lifestyle or habits?","id":"tirmidhi-43-35"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man is not lead in his dominion, and his seat of honor in his house is not sat in without his permission.\"","reference":"Jami` at-Tirmidhi 2772, Book 43, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of respecting a person's authority in their own domain?","id":"tirmidhi-43-36"},{"hadith-eng":"\"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"","reference":"Jami` at-Tirmidhi 2773, Book 43, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #1","question":"What does this narration teach about the etiquette of offering a ride to someone?","id":"tirmidhi-43-37"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you have Anmat?\" I said: \"Where would we get Anmat from?\" He said: \"Soon you will have Anmat\" He said: \"I would say to my wife: 'Remove your Anmat from my sight.' But she would say: 'Did not the Messenger of Allah (ﷺ) say: \"Indeed you shall soon have Anmat?\" He said: \"So I left it.\"","reference":"Jami` at-Tirmidhi 2774, Book 43, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the term 'Anmat' in the context of this narration?","id":"tirmidhi-43-38"},{"hadith-eng":"from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"","reference":"Jami` at-Tirmidhi 2775, Book 43, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #1","question":"What can be inferred about the relationship between the Prophet Muhammad (ﷺ) and his grandsons, Al-Hasan and Al-Husain?","id":"tirmidhi-43-39"},{"hadith-eng":"\"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"","reference":"Jami` at-Tirmidhi 2776, Book 43, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance is provided for handling unintentional glances?","id":"tirmidhi-43-40"},{"hadith-eng":"from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"","reference":"Jami` at-Tirmidhi 2777, Book 43, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #1","question":"What guidance is given regarding controlling one's gaze in Islam?","id":"tirmidhi-43-41"},{"hadith-eng":"to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"","reference":"Jami` at-Tirmidhi 2778, Book 43, Hadith 48","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of veiling in the presence of non-mahram men in Islam?","id":"tirmidhi-43-42"},{"hadith-eng":"from the freed slave of 'Amr bin Al-'As that 'Amr bin Al-'As sent him to 'Ali seeking his permission to enter upon Asma bint Umais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr bin Al-'As asked about that, so he said: \"Indeed the Prophet (ﷺ) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\"","reference":"Jami` at-Tirmidhi 2779, Book 43, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of seeking permission before entering upon women in Islam?","id":"tirmidhi-43-43"},{"hadith-eng":"that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"","reference":"Jami` at-Tirmidhi 2780, Book 43, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is considered the most harmful trial for men according to Islamic teachings?","id":"tirmidhi-43-44"},{"hadith-eng":"that he heard Mu'awiyah giving a Khutbah in Al-Madinah, and saying: \"Where are your scholars, O people of Al-Madinah? [Indeed] I heard the Messenger of Allah (ﷺ) forbidding from these locks (of hair), and saying: 'The Children of Isra'il were only ruined when their women used them.'\"","reference":"Jami` at-Tirmidhi 2781, Book 43, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of scholars in guiding the community according to Islamic teachings?","id":"tirmidhi-43-45"},{"hadith-eng":"that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.","reference":"Jami` at-Tirmidhi 2782, Book 43, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on tattooing for women?","id":"tirmidhi-43-46"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Allah's curse is upon the woman who lengthens hair and the women who seeks to have her hair lengthened, and the woman who tattoos and the woman who seeks to have her herself tattooed.\"","reference":"Jami` at-Tirmidhi 2783, Book 43, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on altering one's physical appearance through hair extensions and tattoos?","id":"tirmidhi-43-47"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"","reference":"Jami` at-Tirmidhi 2784, Book 43, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on gender roles and imitation between men and women?","id":"tirmidhi-43-48"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed those men who behave effeminately and those women whose behavior is masculine.\"","reference":"Jami` at-Tirmidhi 2785, Book 43, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the Islamic perspective on gender roles and behavior?","id":"tirmidhi-43-49"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.","reference":"Jami` at-Tirmidhi 2786, Book 43, Hadith 58","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of modesty in Islam, particularly concerning the use of perfume by women?","id":"tirmidhi-43-50"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)","reference":"Jami` at-Tirmidhi 2787, Book 43, Hadith 59","grade":"","question #":"question #1","question":"What are the guidelines for men regarding the use of fragrance in Islam?","id":"tirmidhi-43-51"},{"hadith-eng":"\"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"","reference":"Jami` at-Tirmidhi 2788, Book 43, Hadith 61","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the characteristics of the best fragrance for men according to Islamic teachings?","id":"tirmidhi-43-52"},{"hadith-eng":"\"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"","reference":"Jami` at-Tirmidhi 2789, Book 43, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of accepting gifts in Islamic tradition?","id":"tirmidhi-43-53"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are three that are not refused: Cushions, oils [Duhn (fragrance)], and milk.\"","reference":"Jami` at-Tirmidhi 2790, Book 43, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the three items mentioned that should not be refused when offered?","id":"tirmidhi-43-54"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'When one of you is given some fragrance then do not refuse it, for indeed it comes from Paradise.\"","reference":"Jami` at-Tirmidhi 2791, Book 43, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of accepting gifts, particularly fragrance, in Islamic teachings?","id":"tirmidhi-43-55"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A woman is not to touch a woman such that she can describe her to her husband as if he is looking at her.\"","reference":"Jami` at-Tirmidhi 2792, Book 43, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance is provided regarding the privacy and modesty of women in interactions with others?","id":"tirmidhi-43-56"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a woman under one garment.'\"","reference":"Jami` at-Tirmidhi 2793, Book 43, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the guidelines in Islam regarding looking at the 'Awrah of others?","id":"tirmidhi-43-57"},{"hadith-eng":"from his father, from his grandfather, who said: \"I said: 'O Prophet of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?' He said: 'Protect your 'Awrah except from your wife or what your right hand possesses.' He said: \"I said: 'O Messenger of Allah! What about when some people are with others?' He said: 'If you are able to not let anyone see it then do not let them see it.'\" He said: \"I said: 'O Prophet of Allah! What about when one of us is alone?' He said: 'Allah is more deserving of being shy from Him than the people.'\"","reference":"Jami` at-Tirmidhi 2794, Book 43, Hadith 67","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidelines are provided for covering one's 'Awrah in the presence of others?","id":"tirmidhi-43-58"},{"hadith-eng":"about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2795, Book 43, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is considered 'Awrah for men in Islamic teachings?","id":"tirmidhi-43-59"},{"hadith-eng":"from his father, from the Prophet (ﷺ) who said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2796, Book 43, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is considered 'Awrah in Islamic teachings?","id":"tirmidhi-43-60"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2797, Book 43, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is considered 'Awrah in Islamic teachings?","id":"tirmidhi-43-61"},{"hadith-eng":"\"Ibn Jarhad informed me from his father, that the Prophet (ﷺ) passed by him while his thigh was exposed, so the Prophet (ﷺ) said: 'Cover your thigh, for indeed it is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2798, Book 43, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is considered 'Awrah in Islamic teachings for men?","id":"tirmidhi-43-62"},{"hadith-eng":"\"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"","reference":"Jami` at-Tirmidhi 2799, Book 43, Hadith 72","grade":"Da'if(Darussalam)","question #":"question #1","question":"What attributes of Allah are highlighted in this narration?","id":"tirmidhi-43-63"},{"hadith-eng":"from Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Beware of nakedness! For indeed there are with you, those who do not part from you except at the place of defecation, and when a man goes into his wife. So be shy of them and honor them.\"","reference":"Jami` at-Tirmidhi 2800, Book 43, Hadith 73","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of modesty in Islam, especially in private moments?","id":"tirmidhi-43-64"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"","reference":"Jami` at-Tirmidhi 2801, Book 43, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the guidelines for entering a Hammam according to Islamic teachings?","id":"tirmidhi-43-65"},{"hadith-eng":"from 'Aishah, that the Prophet (ﷺ) prohibitied the men and women from the Hammamat (plural of Hammam), then he permitted it for the men in Izar.\"","reference":"Jami` at-Tirmidhi 2802, Book 43, Hadith 75","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's initial prohibition of Hammamat for both men and women?","id":"tirmidhi-43-66"},{"hadith-eng":"that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"","reference":"Jami` at-Tirmidhi 2803, Book 43, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of modesty and privacy for women in Islam?","id":"tirmidhi-43-67"},{"hadith-eng":"\"I heard Abu Talhah saying: 'I heard the Messenger of Allah (ﷺ) saying: \"The angels do not enter a house in which there is a dog or an object of images.\"","reference":"Jami` at-Tirmidhi 2804, Book 43, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of angels entering a house in Islamic teachings?","id":"tirmidhi-43-68"},{"hadith-eng":"that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"","reference":"Jami` at-Tirmidhi 2805, Book 43, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of angels not entering a house with images or pictures?","id":"tirmidhi-43-69"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.","reference":"Jami` at-Tirmidhi 2806, Book 43, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of having images in a house according to Islamic teachings?","id":"tirmidhi-43-70"},{"hadith-eng":"\"A man passed by while wearing two red garments. He gave Salam to the Prophet (ﷺ) but he did not return the Salam.\"","reference":"Jami` at-Tirmidhi 2807, Book 43, Hadith 80","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of returning greetings in Islamic etiquette?","id":"tirmidhi-43-71"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited the gold ring, Al-Qassi, Al-Mitharah, and Al-Ji'ah (beer).\"","reference":"Jami` at-Tirmidhi 2808, Book 43, Hadith 81","grade":"Hasan(Darussalam)","question #":"question #1","question":"What items or practices are prohibited in Islam according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-72"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"","reference":"Jami` at-Tirmidhi 2809, Book 43, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the seven actions that the Prophet Muhammad (ﷺ) encouraged Muslims to perform?","id":"tirmidhi-43-73"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"","reference":"Jami` at-Tirmidhi 2810, Book 43, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the benefits of wearing white clothing in Islam?","id":"tirmidhi-43-74"},{"hadith-eng":"\"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"","reference":"Jami` at-Tirmidhi 2811, Book 43, Hadith 84","grade":"Da'if(Darussalam)","question #":"question #1","question":"How is the physical appearance of the Prophet Muhammad (ﷺ) described in Islamic narrations?","id":"tirmidhi-43-75"},{"hadith-eng":"\"I saw the Messenger of Allah wearing two green Burud.\"","reference":"Jami` at-Tirmidhi 2812, Book 43, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance do the colors of clothing have in Islamic tradition?","id":"tirmidhi-43-76"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) went out during the morning wearing a Mirt made of black hair.\"","reference":"Jami` at-Tirmidhi 2813, Book 43, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #1","question":"What type of clothing did the Prophet Muhammad (ﷺ) wear on certain occasions?","id":"tirmidhi-43-77"},{"hadith-eng":"that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"","reference":"Jami` at-Tirmidhi 2814, Book 43, Hadith 88","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of greeting the Prophet with 'As-Salamu 'Alaika' in Islamic tradition?","id":"tirmidhi-43-78"},{"hadith-eng":"that the Messenger of Allah (ﷺ) prohibited saffron for men.","reference":"Jami` at-Tirmidhi 2815, 2815b, Book 43, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on men wearing saffron in Islam?","id":"tirmidhi-43-79"},{"hadith-eng":"\"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"","reference":"Jami` at-Tirmidhi 2816, Book 43, Hadith 90","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the Prophet's instruction regarding the use of certain substances or items?","id":"tirmidhi-43-80"},{"hadith-eng":"from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"","reference":"Jami` at-Tirmidhi 2817, Book 43, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of abstaining from wearing silk in this world according to Islamic teachings?","id":"tirmidhi-43-81"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"","reference":"Jami` at-Tirmidhi 2818, Book 43, Hadith 92","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) handle situations where someone felt left out or overlooked?","id":"tirmidhi-43-82"},{"hadith-eng":"from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"","reference":"Jami` at-Tirmidhi 2819, Book 43, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does it mean for Allah to love seeing the results of His favors upon His slaves?","id":"tirmidhi-43-83"},{"hadith-eng":"from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"","reference":"Jami` at-Tirmidhi 2820, Book 43, Hadith 94","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of wearing Khuff in Islamic tradition?","id":"tirmidhi-43-84"},{"hadith-eng":"from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"","reference":"Jami` at-Tirmidhi 2821, Book 43, Hadith 95","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of gray hair in Islam according to the teachings of the Prophet (ﷺ)?","id":"tirmidhi-43-85"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"","reference":"Jami` at-Tirmidhi 2822, Book 43, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of seeking counsel in decision-making?","id":"tirmidhi-43-86"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'The one whose council is sought is entrusted.'\"","reference":"Jami` at-Tirmidhi 2823, Book 43, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of seeking counsel in decision-making according to Islamic teachings?","id":"tirmidhi-43-87"},{"hadith-eng":"from their father that the Messenger of Allah (ﷺ) said: \"An omen is in three: A woman, a dwelling, and a (riding) beast.\"","reference":"Jami` at-Tirmidhi 2824, 2824b, 2824c, 2824d, Book 43, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the three things mentioned as omens in the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-88"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whenever there are three of you, then let two not converse in exclusion of their companion.\"","reference":"Jami` at-Tirmidhi 2825, Book 43, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of not excluding a companion in a conversation when in a group of three?","id":"tirmidhi-43-89"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"","reference":"Jami` at-Tirmidhi 2826, Book 43, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #1","question":"What physical characteristics of the Prophet Muhammad (ﷺ) are described in this narration?","id":"tirmidhi-43-90"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"","reference":"Jami` at-Tirmidhi 2827, Book 43, Hadith 101","grade":"","question #":"question #1","question":"Who is described as resembling the Prophet Muhammad (ﷺ) the most?","id":"tirmidhi-43-91"},{"hadith-eng":"\"I did not hear the Prophet (ﷺ) mentioning both of his parents (that is including both in the saying \"May my father and mother be ransomed for you\") for anyone other than Sa'd bin Abi Waqqas.\"","reference":"Jami` at-Tirmidhi 2828, Book 43, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the phrase 'May my father and mother be ransomed for you' in Islamic tradition?","id":"tirmidhi-43-92"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not mention both of his parents for anyone except Sa'd bin Abi Waqqas. On the Day of Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot! O young man.'\"","reference":"Jami` at-Tirmidhi 2829, Book 43, Hadith 103","grade":"Da'if(Darussalam)","question #":"question #1","question":"What significance does the phrase 'may my father and mother be ransomed for you' hold in Islamic tradition?","id":"tirmidhi-43-93"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) mentioned both of his parents to me on the Day of Uhud.\"","reference":"Jami` at-Tirmidhi 2830, Book 43, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #1","question":"What significance does the mention of one's parents hold in Islamic tradition?","id":"tirmidhi-43-94"},{"hadith-eng":"that the Prophet (ﷺ) said to him: \"O my little son.\"","reference":"Jami` at-Tirmidhi 2831, Book 43, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does the term of endearment 'O my little son' signify in the context of the Prophet's teachings?","id":"tirmidhi-43-95"},{"hadith-eng":"from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).","reference":"Jami` at-Tirmidhi 2832, Book 43, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of naming a child on the seventh day in Islamic tradition?","id":"tirmidhi-43-96"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2833, Book 43, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #1","question":"What are the most beloved names to Allah according to Islamic teachings?","id":"tirmidhi-43-97"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2834, Book 43, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the most beloved names to Allah according to Islamic teachings?","id":"tirmidhi-43-98"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"","reference":"Jami` at-Tirmidhi 2835, Book 43, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the names that are discouraged in Islamic tradition according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-99"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"","reference":"Jami` at-Tirmidhi 2836, Book 43, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of naming children with certain names in Islamic tradition?","id":"tirmidhi-43-100"},{"hadith-eng":"that Abu Hurairah conveyed to him that the Prophet (ﷺ) said: \"The most despicable (Akhna) name to Allah on the Day of Judgement is that of a man named King of Kings. (Malikil-Amlak).\"","reference":"Jami` at-Tirmidhi 2837, Book 43, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of names in Islam and how can they affect one's standing on the Day of Judgement?","id":"tirmidhi-43-101"},{"hadith-eng":"that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"","reference":"Jami` at-Tirmidhi 2838, Book 43, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of changing one's name in Islam?","id":"tirmidhi-43-102"},{"hadith-eng":"that the Prophet (ﷺ) would change abhorrent names.\"","reference":"Jami` at-Tirmidhi 2839, Book 43, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of changing names in Islamic tradition?","id":"tirmidhi-43-103"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"","reference":"Jami` at-Tirmidhi 2840, Book 43, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different names of the Prophet Muhammad (ﷺ) mentioned in Islamic tradition?","id":"tirmidhi-43-104"},{"hadith-eng":"that the Prophet (ﷺ) prohibited that one use his name and his Kunyah; naming themselves Muhammad Abul-Qasim.","reference":"Jami` at-Tirmidhi 2841, Book 43, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #1","question":"Why is it discouraged to use both the name and Kunyah of the Prophet Muhammad (ﷺ) together?","id":"tirmidhi-43-105"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"","reference":"Jami` at-Tirmidhi 2842, Book 43, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of naming conventions in Islam, particularly regarding the use of certain names and titles?","id":"tirmidhi-43-106"},{"hadith-eng":"that he said: \"O Messenger of Allah (ﷺ)! If I have a son after you do you think I could name him your Kunyah?\" He said: \"Yes.\" So he said: \"So that was permitted for me.\"","reference":"Jami` at-Tirmidhi 2843, Book 43, Hadith 117","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of naming a child after someone in Islamic tradition?","id":"tirmidhi-43-107"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\"","reference":"Jami` at-Tirmidhi 2844, Book 43, Hadith 118","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of poetry in conveying wisdom in Islam?","id":"tirmidhi-43-108"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\".","reference":"Jami` at-Tirmidhi 2845, Book 43, Hadith 119","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of poetry in conveying wisdom in Islamic teachings?","id":"tirmidhi-43-109"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"","reference":"Jami` at-Tirmidhi 2846, Book 43, Hadith 120","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of poetry in defending the honor of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-110"},{"hadith-eng":"that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"","reference":"Jami` at-Tirmidhi 2847, Book 43, Hadith 122","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of poetry in Islamic tradition, especially during significant events?","id":"tirmidhi-43-111"},{"hadith-eng":"from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"","reference":"Jami` at-Tirmidhi 2848, Book 43, Hadith 123","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of poetry in the life of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-112"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"","reference":"Jami` at-Tirmidhi 2849, Book 43, Hadith 124","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the statement 'Everything aside from Allah perishes' in Islamic theology?","id":"tirmidhi-43-113"},{"hadith-eng":"\"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"","reference":"Jami` at-Tirmidhi 2850, Book 43, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet (ﷺ) interact with his companions during their discussions of poetry and pre-Islamic events?","id":"tirmidhi-43-114"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2851, Book 43, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of avoiding excessive indulgence in poetry according to Islamic teachings?","id":"tirmidhi-43-115"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2852, Book 43, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of avoiding excessive indulgence in poetry according to Islamic teachings?","id":"tirmidhi-43-116"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah detests the excessive among men, who slaps his tongue around like the cow slaps his tongue.\"","reference":"Jami` at-Tirmidhi 2853, Book 43, Hadith 128","grade":"Hasan(Darussalam)","question #":"question #1","question":"What behavior is disliked by Allah according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-117"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"","reference":"Jami` at-Tirmidhi 2854, Book 43, Hadith 129","grade":"Hasan(Darussalam)","question #":"question #1","question":"What safety precautions are advised for sleeping in elevated places?","id":"tirmidhi-43-118"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to take care of us by preaching during the days fearing that we may get bored.\"","reference":"Jami` at-Tirmidhi 2855, Book 43, Hadith 130","grade":"Sahih(Darussalam)","question #":"question #1","question":"How did the Prophet Muhammad (ﷺ) ensure that his followers remained engaged and attentive to his teachings?","id":"tirmidhi-43-119"},{"hadith-eng":"\"I asked 'Aishah and Umm Salamah about which deed did the Messenger of Allah (ﷺ) like to do most. They said: 'Whatever he could do regularly, even if it was little.'\"","reference":"Jami` at-Tirmidhi 2856, Book 43, Hadith 132","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of consistency in performing good deeds in Islam?","id":"tirmidhi-43-120"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Cover the vessels, tie the water-skins, close the doors, extinguish the torches, for indeed the mischief-makers (vermin) may drag away the wick, causing a fire for the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2857, Book 43, Hadith 134","grade":"Sahih(Darussalam)","question #":"question #1","question":"What precautions should be taken at night to ensure safety according to Islamic teachings?","id":"tirmidhi-43-121"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When you travel through fertile land, then give the camels their fill of the land, and when you travel through drought, then hasten while they are fresh, and when you camp late, then stay away from the road, for indeed it is the route of the beasts and the abode of poisonous vermin in the night.\"","reference":"Jami` at-Tirmidhi 2858, Book 43, Hadith 135","grade":"Sahih(Darussalam)","question #":"question #1","question":"What guidance is provided for traveling with camels through fertile land?","id":"tirmidhi-43-122"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"","reference":"Jami` at-Tirmidhi 2736, Book 43, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #2","question":"How important is it to greet fellow Muslims with Salam?","id":"tirmidhi-43-123"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"","reference":"Jami` at-Tirmidhi 2737, Book 43, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should a believer respond to an invitation from another believer?","id":"tirmidhi-43-124"},{"hadith-eng":"from Nafi: \"A man sneezed beside Ibn 'Umar and said: 'Al-Hamdulillah Was-Salamu 'Ala Rasulillah. (All praise is due to Allah, and peace upon the Messenger of Allah)'. So Ibn 'Umar said: 'I too say Al-Hamdulillah Was-Salamu 'Ala Rasulillah, but this is not what the Messenger of Allah (ﷺ) taught us. He taught us to say: \"Al-Hamdulillah 'Ala Kulli Hal (All praise is due to Allah in every circumstance).\"","reference":"Jami` at-Tirmidhi 2738, Book 43, Hadith 3","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did Ibn 'Umar respond to the man who added 'Was-Salamu 'Ala Rasulillah' after sneezing?","id":"tirmidhi-43-125"},{"hadith-eng":"The Jews used to sneeze in the presence of the Prophet (ﷺ) hoping that he would say: 'Yarhamukumullah (May Allah have mercy upon you).' So he said: 'Yahdikumullahu Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2739, Book 43, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"What phrase did the Prophet Muhammad (ﷺ) use to respond to the sneezes of the Jews?","id":"tirmidhi-43-126"},{"hadith-eng":"that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"","reference":"Jami` at-Tirmidhi 2740, Book 43, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #2","question":"What should a person say after sneezing according to Islamic teachings?","id":"tirmidhi-43-127"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you sneezes let him say: 'Al-Hamdulillahi 'Ala Kulli Hal (All praise is due to Allah in every circumstance).' And let the one replying to him say: \"Yarhamukallah (May Allah have mercy upon you).' And let him say to him: 'Yahdikumullah Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2741, Book 43, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"What should a person say in response to someone who has sneezed and praised Allah?","id":"tirmidhi-43-128"},{"hadith-eng":"that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"","reference":"Jami` at-Tirmidhi 2742, Book 43, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate the importance of gratitude in this situation?","id":"tirmidhi-43-129"},{"hadith-eng":"from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"","reference":"Jami` at-Tirmidhi 2743, Book 43, Hadith 10","grade":"","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to someone sneezing multiple times?","id":"tirmidhi-43-130"},{"hadith-eng":"from his mother, from her father, who said: \"The Messenger of Allah (ﷺ) said: 'Reply three times to the sneezing person. If he (sneezes) more, then if you wish reply and if you do not then do not.'\"","reference":"Jami` at-Tirmidhi 2744, Book 43, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the etiquette of responding to someone who sneezes more than three times?","id":"tirmidhi-43-131"},{"hadith-eng":"that when the Prophet (ﷺ) would sneeze, he would cover his face with his hand or with his garment, and muffle the sound with it.","reference":"Jami` at-Tirmidhi 2745, Book 43, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate modesty and consideration for others when sneezing?","id":"tirmidhi-43-132"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]","reference":"Jami` at-Tirmidhi 2746, Book 43, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is sneezing considered to be from Allah in Islamic belief?","id":"tirmidhi-43-133"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah loves sneezing and He dislikes the yawn. So when one of you sneezes and says 'Al-Hamdulillah (All praise is due to Allah),' then it is a right due from every one who hears him to say: 'Yarhamukallah (May Allah have mercy upon you)' As for yawning then when one of you yawns let him suppress it as much as possible and not say: \"Hah Hah' for that is only from Ash-Shaitan laughing at him.\"","reference":"Jami` at-Tirmidhi 2747, Book 43, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important for others to respond with 'Yarhamukallah' when someone sneezes?","id":"tirmidhi-43-134"},{"hadith-eng":"from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"","reference":"Jami` at-Tirmidhi 2748, Book 43, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does sneezing or yawning during prayer relate to spiritual distractions?","id":"tirmidhi-43-135"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2749, Book 43, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of displacing someone from their seat for personal convenience?","id":"tirmidhi-43-136"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2750, Book 43, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam emphasize respect for others' personal space and belongings in social settings?","id":"tirmidhi-43-137"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man has more right to his seat. If he leaves for some need of his, then he returns, then he has more right to his seat.\"","reference":"Jami` at-Tirmidhi 2751, Book 43, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one behave if they temporarily leave their seat in a public setting?","id":"tirmidhi-43-138"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"","reference":"Jami` at-Tirmidhi 2752, Book 43, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islamic teaching address the issue of intervening in personal interactions between people?","id":"tirmidhi-43-139"},{"hadith-eng":"\"There was no person more beloved to them than the Messenger of Allah (ﷺ).\" [He said:] \"And they would not stand when they saw him because they knew that he disliked that.\"","reference":"Jami` at-Tirmidhi 2754, Book 43, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions express their respect for the Prophet Muhammad (ﷺ) in their actions?","id":"tirmidhi-43-140"},{"hadith-eng":"that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"","reference":"Jami` at-Tirmidhi 2755, Book 43, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the desire for recognition and standing among people relate to one's spiritual well-being?","id":"tirmidhi-43-141"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"","reference":"Jami` at-Tirmidhi 2756, Book 43, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is circumcision included in the practices of Fitrah?","id":"tirmidhi-43-142"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"","reference":"Jami` at-Tirmidhi 2757, Book 43, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is maintaining personal hygiene emphasized in Islamic teachings?","id":"tirmidhi-43-143"},{"hadith-eng":"from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.","reference":"Jami` at-Tirmidhi 2758, Book 43, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #2","question":"How often should one take from the mustache according to Islamic teachings?","id":"tirmidhi-43-144"},{"hadith-eng":"\"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"","reference":"Jami` at-Tirmidhi 2759, Book 43, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is there a specified time limit for certain grooming practices in Islamic teachings?","id":"tirmidhi-43-145"},{"hadith-eng":"\"The Prophet (ﷺ) would pare, or take from his mustache, and Ibrahim Khalilur-Rahman would do it (as well).\"","reference":"Jami` at-Tirmidhi 2760, Book 43, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain his personal grooming habits?","id":"tirmidhi-43-146"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"","reference":"Jami` at-Tirmidhi 2761, Book 43, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does personal grooming relate to the identity of a Muslim according to Islamic tradition?","id":"tirmidhi-43-147"},{"hadith-eng":"from his father, from his grandfather that he Prophet (ﷺ) would take from his beard; from its breadth and its length.","reference":"Jami` at-Tirmidhi 2762, Book 43, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) maintain his beard according to Islamic tradition?","id":"tirmidhi-43-148"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Trim the mustache and leave the beard to grow.\"","reference":"Jami` at-Tirmidhi 2763, Book 43, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of trimming the mustache in Islamic teachings?","id":"tirmidhi-43-149"},{"hadith-eng":"that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.","reference":"Jami` at-Tirmidhi 2764, Book 43, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to follow the Prophet's guidance on personal grooming?","id":"tirmidhi-43-150"},{"hadith-eng":"from his paternal uncle, that he saw the Prophet (ﷺ) reclining in the Masjid, and placing one of his feet atop another.","reference":"Jami` at-Tirmidhi 2765, Book 43, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet (ﷺ) physically position himself while in the mosque according to this narration?","id":"tirmidhi-43-151"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2766, Book 43, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain ways of sitting or reclining be discouraged in Islamic teachings?","id":"tirmidhi-43-152"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2767, Book 43, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain ways of sitting or reclining be discouraged in Islamic teachings?","id":"tirmidhi-43-153"},{"hadith-eng":"that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"","reference":"Jami` at-Tirmidhi 2768, Book 43, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might certain physical positions be discouraged in Islamic teachings?","id":"tirmidhi-43-154"},{"hadith-eng":"\"My father narrated to me from my grandfather, who said: 'I said: \"O Messenger of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?\" He said: \"Protect your 'Awrah except from your wife or what your right hand possesses.\"' He said: \"What about a man with another man?\" He said: \"If you are able to not let anyone see it, then do so.\" I said: \"What about a man when he is alone?\" He said: \"Allah is most deserving of being shy from Him.\"","reference":"Jami` at-Tirmidhi 2769, Book 43, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should one behave regarding their 'Awrah when they are alone?","id":"tirmidhi-43-155"},{"hadith-eng":"\"I saw the Messenger of Allah (ﷺ) reclining upon as pillow, on his left side.\"","reference":"Jami` at-Tirmidhi 2770, Book 43, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance does the posture of reclining have in Islamic tradition or teachings?","id":"tirmidhi-43-156"},{"hadith-eng":"\"I saw the Prophet (ﷺ) reclining upon a pillow.\"","reference":"Jami` at-Tirmidhi 2771, Book 43, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet's (ﷺ) use of a pillow reflect on his approach to comfort and simplicity?","id":"tirmidhi-43-157"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man is not lead in his dominion, and his seat of honor in his house is not sat in without his permission.\"","reference":"Jami` at-Tirmidhi 2772, Book 43, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to seek permission before sitting in someone's seat of honor in their home?","id":"tirmidhi-43-158"},{"hadith-eng":"\"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"","reference":"Jami` at-Tirmidhi 2773, Book 43, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does this narration illustrate the concept of rights and ownership in Islam?","id":"tirmidhi-43-159"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you have Anmat?\" I said: \"Where would we get Anmat from?\" He said: \"Soon you will have Anmat\" He said: \"I would say to my wife: 'Remove your Anmat from my sight.' But she would say: 'Did not the Messenger of Allah (ﷺ) say: \"Indeed you shall soon have Anmat?\" He said: \"So I left it.\"","reference":"Jami` at-Tirmidhi 2774, Book 43, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the companions of the Prophet (ﷺ) respond to his prophecies or statements about future events?","id":"tirmidhi-43-160"},{"hadith-eng":"from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"","reference":"Jami` at-Tirmidhi 2775, Book 43, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #2","question":"What significance does the use of a mule have in the context of transportation during the time of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-161"},{"hadith-eng":"\"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"","reference":"Jami` at-Tirmidhi 2776, Book 43, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one react when they accidentally see something they should not?","id":"tirmidhi-43-162"},{"hadith-eng":"from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"","reference":"Jami` at-Tirmidhi 2777, Book 43, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is the first look considered permissible, but subsequent looks are not?","id":"tirmidhi-43-163"},{"hadith-eng":"to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"","reference":"Jami` at-Tirmidhi 2778, Book 43, Hadith 48","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of modesty apply to interactions between men and women in Islamic teachings?","id":"tirmidhi-43-164"},{"hadith-eng":"from the freed slave of 'Amr bin Al-'As that 'Amr bin Al-'As sent him to 'Ali seeking his permission to enter upon Asma bint Umais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr bin Al-'As asked about that, so he said: \"Indeed the Prophet (ﷺ) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\"","reference":"Jami` at-Tirmidhi 2779, Book 43, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to have the husband's permission before visiting his wife according to Islamic teachings?","id":"tirmidhi-43-165"},{"hadith-eng":"that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"","reference":"Jami` at-Tirmidhi 2780, Book 43, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the presence of women serve as a test or trial for men in Islam?","id":"tirmidhi-43-166"},{"hadith-eng":"that he heard Mu'awiyah giving a Khutbah in Al-Madinah, and saying: \"Where are your scholars, O people of Al-Madinah? [Indeed] I heard the Messenger of Allah (ﷺ) forbidding from these locks (of hair), and saying: 'The Children of Isra'il were only ruined when their women used them.'\"","reference":"Jami` at-Tirmidhi 2781, Book 43, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the consequences mentioned for a community when its women adopt certain practices?","id":"tirmidhi-43-167"},{"hadith-eng":"that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.","reference":"Jami` at-Tirmidhi 2782, Book 43, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view altering one's physical appearance for beautification?","id":"tirmidhi-43-168"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Allah's curse is upon the woman who lengthens hair and the women who seeks to have her hair lengthened, and the woman who tattoos and the woman who seeks to have her herself tattooed.\"","reference":"Jami` at-Tirmidhi 2783, Book 43, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the consequences mentioned for women who engage in practices like hair lengthening and tattooing?","id":"tirmidhi-43-169"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"","reference":"Jami` at-Tirmidhi 2784, Book 43, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might imitating the opposite gender be discouraged in Islam?","id":"tirmidhi-43-170"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed those men who behave effeminately and those women whose behavior is masculine.\"","reference":"Jami` at-Tirmidhi 2785, Book 43, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the alteration of natural gender characteristics?","id":"tirmidhi-43-171"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.","reference":"Jami` at-Tirmidhi 2786, Book 43, Hadith 58","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the concept of adultery in relation to one's actions and intentions?","id":"tirmidhi-43-172"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)","reference":"Jami` at-Tirmidhi 2787, Book 43, Hadith 59","grade":"","question #":"question #2","question":"How should women apply fragrance when leaving the home according to Islamic teachings?","id":"tirmidhi-43-173"},{"hadith-eng":"\"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"","reference":"Jami` at-Tirmidhi 2788, Book 43, Hadith 61","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the characteristics of the best fragrance for women according to Islamic teachings?","id":"tirmidhi-43-174"},{"hadith-eng":"\"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"","reference":"Jami` at-Tirmidhi 2789, Book 43, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) demonstrate his appreciation for perfume?","id":"tirmidhi-43-175"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are three that are not refused: Cushions, oils [Duhn (fragrance)], and milk.\"","reference":"Jami` at-Tirmidhi 2790, Book 43, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of accepting gifts or offerings in Islamic tradition?","id":"tirmidhi-43-176"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'When one of you is given some fragrance then do not refuse it, for indeed it comes from Paradise.\"","reference":"Jami` at-Tirmidhi 2791, Book 43, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is fragrance associated with Paradise in Islamic tradition?","id":"tirmidhi-43-177"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A woman is not to touch a woman such that she can describe her to her husband as if he is looking at her.\"","reference":"Jami` at-Tirmidhi 2792, Book 43, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this teaching address the issue of describing others to one's spouse?","id":"tirmidhi-43-178"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a woman under one garment.'\"","reference":"Jami` at-Tirmidhi 2793, Book 43, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of modesty in interactions between individuals of the same gender?","id":"tirmidhi-43-179"},{"hadith-eng":"from his father, from his grandfather, who said: \"I said: 'O Prophet of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?' He said: 'Protect your 'Awrah except from your wife or what your right hand possesses.' He said: \"I said: 'O Messenger of Allah! What about when some people are with others?' He said: 'If you are able to not let anyone see it then do not let them see it.'\" He said: \"I said: 'O Prophet of Allah! What about when one of us is alone?' He said: 'Allah is more deserving of being shy from Him than the people.'\"","reference":"Jami` at-Tirmidhi 2794, Book 43, Hadith 67","grade":"Hasan(Darussalam)","question #":"question #2","question":"How should one behave regarding their 'Awrah when they are alone?","id":"tirmidhi-43-180"},{"hadith-eng":"about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2795, Book 43, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to cover the 'Awrah in Islam?","id":"tirmidhi-43-181"},{"hadith-eng":"from his father, from the Prophet (ﷺ) who said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2796, Book 43, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of 'Awrah influence modesty in Islam?","id":"tirmidhi-43-182"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2797, Book 43, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of 'Awrah influence the dress code in Islam?","id":"tirmidhi-43-183"},{"hadith-eng":"\"Ibn Jarhad informed me from his father, that the Prophet (ﷺ) passed by him while his thigh was exposed, so the Prophet (ﷺ) said: 'Cover your thigh, for indeed it is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2798, Book 43, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to cover parts of the body considered 'Awrah in Islam?","id":"tirmidhi-43-184"},{"hadith-eng":"\"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"","reference":"Jami` at-Tirmidhi 2799, Book 43, Hadith 72","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does this narration emphasize the importance of cleanliness in Islam?","id":"tirmidhi-43-185"},{"hadith-eng":"from Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Beware of nakedness! For indeed there are with you, those who do not part from you except at the place of defecation, and when a man goes into his wife. So be shy of them and honor them.\"","reference":"Jami` at-Tirmidhi 2800, Book 43, Hadith 73","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic teaching address the concept of being aware of unseen beings in daily life?","id":"tirmidhi-43-186"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"","reference":"Jami` at-Tirmidhi 2801, Book 43, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the significance of wearing an Izar when entering a Hammam?","id":"tirmidhi-43-187"},{"hadith-eng":"from 'Aishah, that the Prophet (ﷺ) prohibitied the men and women from the Hammamat (plural of Hammam), then he permitted it for the men in Izar.\"","reference":"Jami` at-Tirmidhi 2802, Book 43, Hadith 75","grade":"Hasan(Darussalam)","question #":"question #2","question":"Under what conditions did the Prophet permit men to use Hammamat?","id":"tirmidhi-43-188"},{"hadith-eng":"that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"","reference":"Jami` at-Tirmidhi 2803, Book 43, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the act of women removing their garments outside their husband's home?","id":"tirmidhi-43-189"},{"hadith-eng":"\"I heard Abu Talhah saying: 'I heard the Messenger of Allah (ﷺ) saying: \"The angels do not enter a house in which there is a dog or an object of images.\"","reference":"Jami` at-Tirmidhi 2804, Book 43, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do dogs and images affect the presence of angels in a household?","id":"tirmidhi-43-190"},{"hadith-eng":"that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"","reference":"Jami` at-Tirmidhi 2805, Book 43, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the presence of images or pictures in a house affect its spiritual environment?","id":"tirmidhi-43-191"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.","reference":"Jami` at-Tirmidhi 2806, Book 43, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might the presence of a dog in a house be significant in Islamic tradition?","id":"tirmidhi-43-192"},{"hadith-eng":"\"A man passed by while wearing two red garments. He gave Salam to the Prophet (ﷺ) but he did not return the Salam.\"","reference":"Jami` at-Tirmidhi 2807, Book 43, Hadith 80","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the color or type of clothing affect social interactions in Islamic tradition?","id":"tirmidhi-43-193"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited the gold ring, Al-Qassi, Al-Mitharah, and Al-Ji'ah (beer).\"","reference":"Jami` at-Tirmidhi 2808, Book 43, Hadith 81","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might wearing a gold ring be discouraged in Islamic teachings?","id":"tirmidhi-43-194"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"","reference":"Jami` at-Tirmidhi 2809, Book 43, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the seven things that Muslims are forbidden from according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-195"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"","reference":"Jami` at-Tirmidhi 2810, Book 43, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is white considered a pure and clean color in Islamic teachings?","id":"tirmidhi-43-196"},{"hadith-eng":"\"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"","reference":"Jami` at-Tirmidhi 2811, Book 43, Hadith 84","grade":"Da'if(Darussalam)","question #":"question #2","question":"What significance does the comparison between the Prophet Muhammad (ﷺ) and the moon hold in Islamic tradition?","id":"tirmidhi-43-197"},{"hadith-eng":"\"I saw the Messenger of Allah wearing two green Burud.\"","reference":"Jami` at-Tirmidhi 2812, Book 43, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #2","question":"What can be inferred about the Prophet's (ﷺ) choice of clothing from this narration?","id":"tirmidhi-43-198"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) went out during the morning wearing a Mirt made of black hair.\"","reference":"Jami` at-Tirmidhi 2813, Book 43, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is a Mirt and what significance does it hold in Islamic tradition?","id":"tirmidhi-43-199"},{"hadith-eng":"that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"","reference":"Jami` at-Tirmidhi 2814, Book 43, Hadith 88","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet respond to greetings from others, and what does this teach about his character?","id":"tirmidhi-43-200"},{"hadith-eng":"that the Messenger of Allah (ﷺ) prohibited saffron for men.","reference":"Jami` at-Tirmidhi 2815, 2815b, Book 43, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain colors or materials be prohibited for men in Islamic teachings?","id":"tirmidhi-43-201"},{"hadith-eng":"\"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"","reference":"Jami` at-Tirmidhi 2816, Book 43, Hadith 90","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic teaching address the use of specific perfumes or scents?","id":"tirmidhi-43-202"},{"hadith-eng":"from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"","reference":"Jami` at-Tirmidhi 2817, Book 43, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the choice of clothing in this life relate to the rewards or consequences in the Hereafter?","id":"tirmidhi-43-203"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"","reference":"Jami` at-Tirmidhi 2818, Book 43, Hadith 92","grade":"Sahih(Darussalam)","question #":"question #2","question":"What can be learned about the Prophet's (ﷺ) approach to distributing gifts or resources among his companions?","id":"tirmidhi-43-204"},{"hadith-eng":"from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"","reference":"Jami` at-Tirmidhi 2819, Book 43, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #2","question":"How can individuals show gratitude for the blessings they receive from Allah?","id":"tirmidhi-43-205"},{"hadith-eng":"from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"","reference":"Jami` at-Tirmidhi 2820, Book 43, Hadith 94","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the practice of wiping over Khuff relate to the performance of Wudu?","id":"tirmidhi-43-206"},{"hadith-eng":"from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"","reference":"Jami` at-Tirmidhi 2821, Book 43, Hadith 95","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might plucking gray hair be discouraged in Islamic teachings?","id":"tirmidhi-43-207"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"","reference":"Jami` at-Tirmidhi 2822, Book 43, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does trust play a role when someone seeks advice from another person?","id":"tirmidhi-43-208"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'The one whose council is sought is entrusted.'\"","reference":"Jami` at-Tirmidhi 2823, Book 43, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is trust emphasized in the context of giving advice in Islam?","id":"tirmidhi-43-209"},{"hadith-eng":"from their father that the Messenger of Allah (ﷺ) said: \"An omen is in three: A woman, a dwelling, and a (riding) beast.\"","reference":"Jami` at-Tirmidhi 2824, 2824b, 2824c, 2824d, Book 43, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of omens relate to women, dwellings, and riding beasts in Islamic teachings?","id":"tirmidhi-43-210"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whenever there are three of you, then let two not converse in exclusion of their companion.\"","reference":"Jami` at-Tirmidhi 2825, Book 43, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does excluding someone from a conversation affect social relationships in a group setting?","id":"tirmidhi-43-211"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"","reference":"Jami` at-Tirmidhi 2826, Book 43, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the resemblance between Al-Hasan bin 'Ali and the Prophet Muhammad (ﷺ) highlighted?","id":"tirmidhi-43-212"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"","reference":"Jami` at-Tirmidhi 2827, Book 43, Hadith 101","grade":"","question #":"question #2","question":"What is the significance of physical resemblance to the Prophet Muhammad (ﷺ) in Islamic tradition?","id":"tirmidhi-43-213"},{"hadith-eng":"\"I did not hear the Prophet (ﷺ) mentioning both of his parents (that is including both in the saying \"May my father and mother be ransomed for you\") for anyone other than Sa'd bin Abi Waqqas.\"","reference":"Jami` at-Tirmidhi 2828, Book 43, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who was Sa'd bin Abi Waqqas and what was his importance in early Islamic history?","id":"tirmidhi-43-214"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not mention both of his parents for anyone except Sa'd bin Abi Waqqas. On the Day of Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot! O young man.'\"","reference":"Jami` at-Tirmidhi 2829, Book 43, Hadith 103","grade":"Da'if(Darussalam)","question #":"question #2","question":"Who was Sa'd bin Abi Waqqas and what was his role in the Battle of Uhud?","id":"tirmidhi-43-215"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) mentioned both of his parents to me on the Day of Uhud.\"","reference":"Jami` at-Tirmidhi 2830, Book 43, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) express his emotions or sentiments during significant events?","id":"tirmidhi-43-216"},{"hadith-eng":"that the Prophet (ﷺ) said to him: \"O my little son.\"","reference":"Jami` at-Tirmidhi 2831, Book 43, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the use of affectionate language by the Prophet influence the relationship between him and his companions?","id":"tirmidhi-43-217"},{"hadith-eng":"from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).","reference":"Jami` at-Tirmidhi 2832, Book 43, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #2","question":"What practices are recommended for a newborn on the seventh day according to Islamic teachings?","id":"tirmidhi-43-218"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2833, Book 43, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why might certain names be favored by Allah in Islam?","id":"tirmidhi-43-219"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2834, Book 43, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain names be favored by Allah in Islam?","id":"tirmidhi-43-220"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"","reference":"Jami` at-Tirmidhi 2835, Book 43, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain names be prohibited or discouraged in Islam?","id":"tirmidhi-43-221"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"","reference":"Jami` at-Tirmidhi 2836, Book 43, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might certain names be discouraged in Islamic teachings?","id":"tirmidhi-43-222"},{"hadith-eng":"that Abu Hurairah conveyed to him that the Prophet (ﷺ) said: \"The most despicable (Akhna) name to Allah on the Day of Judgement is that of a man named King of Kings. (Malikil-Amlak).\"","reference":"Jami` at-Tirmidhi 2837, Book 43, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is the name 'King of Kings' considered despicable in the sight of Allah?","id":"tirmidhi-43-223"},{"hadith-eng":"that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"","reference":"Jami` at-Tirmidhi 2838, Book 43, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the Prophet Muhammad (ﷺ) approach the concept of names and their meanings?","id":"tirmidhi-43-224"},{"hadith-eng":"that the Prophet (ﷺ) would change abhorrent names.\"","reference":"Jami` at-Tirmidhi 2839, Book 43, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) approach names that were considered inappropriate or negative?","id":"tirmidhi-43-225"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"","reference":"Jami` at-Tirmidhi 2840, Book 43, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of the name Al-Mahi in relation to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-226"},{"hadith-eng":"that the Prophet (ﷺ) prohibited that one use his name and his Kunyah; naming themselves Muhammad Abul-Qasim.","reference":"Jami` at-Tirmidhi 2841, Book 43, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of the name Muhammad in Islamic tradition?","id":"tirmidhi-43-227"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"","reference":"Jami` at-Tirmidhi 2842, Book 43, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why might it be important to avoid using specific titles or names that are associated with the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-228"},{"hadith-eng":"that he said: \"O Messenger of Allah (ﷺ)! If I have a son after you do you think I could name him your Kunyah?\" He said: \"Yes.\" So he said: \"So that was permitted for me.\"","reference":"Jami` at-Tirmidhi 2843, Book 43, Hadith 117","grade":"Hasan(Darussalam)","question #":"question #2","question":"What is the concept of Kunyah in Islamic culture?","id":"tirmidhi-43-229"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\"","reference":"Jami` at-Tirmidhi 2844, Book 43, Hadith 118","grade":"Hasan(Darussalam)","question #":"question #2","question":"How can poetry serve as a medium for imparting wisdom?","id":"tirmidhi-43-230"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\".","reference":"Jami` at-Tirmidhi 2845, Book 43, Hadith 119","grade":"Hasan(Darussalam)","question #":"question #2","question":"How can poetry serve as a medium for imparting wisdom and knowledge?","id":"tirmidhi-43-231"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"","reference":"Jami` at-Tirmidhi 2846, Book 43, Hadith 120","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) view the role of Hassan in defending him through poetry?","id":"tirmidhi-43-232"},{"hadith-eng":"that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"","reference":"Jami` at-Tirmidhi 2847, Book 43, Hadith 122","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) respond to the recitation of poetry in his presence?","id":"tirmidhi-43-233"},{"hadith-eng":"from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"","reference":"Jami` at-Tirmidhi 2848, Book 43, Hadith 123","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (ﷺ) use parables in his teachings?","id":"tirmidhi-43-234"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"","reference":"Jami` at-Tirmidhi 2849, Book 43, Hadith 124","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the concept of the impermanence of all things except Allah influence a Muslim's worldview?","id":"tirmidhi-43-235"},{"hadith-eng":"\"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"","reference":"Jami` at-Tirmidhi 2850, Book 43, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #2","question":"What was the Prophet's (ﷺ) demeanor when his companions talked about the times of ignorance?","id":"tirmidhi-43-236"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2851, Book 43, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the comparison between filling oneself with pus and poetry highlight the importance of content in one's life?","id":"tirmidhi-43-237"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2852, Book 43, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the comparison between filling one's insides with pus and poetry highlight the potential negative impact of poetry?","id":"tirmidhi-43-238"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah detests the excessive among men, who slaps his tongue around like the cow slaps his tongue.\"","reference":"Jami` at-Tirmidhi 2853, Book 43, Hadith 128","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is excessive behavior among men described in the teachings of Islam?","id":"tirmidhi-43-239"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"","reference":"Jami` at-Tirmidhi 2854, Book 43, Hadith 129","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to have a barrier when sleeping on a terrace?","id":"tirmidhi-43-240"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to take care of us by preaching during the days fearing that we may get bored.\"","reference":"Jami` at-Tirmidhi 2855, Book 43, Hadith 130","grade":"Sahih(Darussalam)","question #":"question #2","question":"What methods can be used to prevent boredom in religious education and preaching?","id":"tirmidhi-43-241"},{"hadith-eng":"\"I asked 'Aishah and Umm Salamah about which deed did the Messenger of Allah (ﷺ) like to do most. They said: 'Whatever he could do regularly, even if it was little.'\"","reference":"Jami` at-Tirmidhi 2856, Book 43, Hadith 132","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the regularity of actions impact their value in the eyes of Allah?","id":"tirmidhi-43-242"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Cover the vessels, tie the water-skins, close the doors, extinguish the torches, for indeed the mischief-makers (vermin) may drag away the wick, causing a fire for the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2857, Book 43, Hadith 134","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important to cover vessels and tie water-skins in the context of household safety?","id":"tirmidhi-43-243"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When you travel through fertile land, then give the camels their fill of the land, and when you travel through drought, then hasten while they are fresh, and when you camp late, then stay away from the road, for indeed it is the route of the beasts and the abode of poisonous vermin in the night.\"","reference":"Jami` at-Tirmidhi 2858, Book 43, Hadith 135","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should one manage travel through drought conditions according to the teachings?","id":"tirmidhi-43-244"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"","reference":"Jami` at-Tirmidhi 2736, Book 43, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of accepting invitations in Islam?","id":"tirmidhi-43-245"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"","reference":"Jami` at-Tirmidhi 2737, Book 43, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of giving Salam when meeting another believer?","id":"tirmidhi-43-246"},{"hadith-eng":"from Nafi: \"A man sneezed beside Ibn 'Umar and said: 'Al-Hamdulillah Was-Salamu 'Ala Rasulillah. (All praise is due to Allah, and peace upon the Messenger of Allah)'. So Ibn 'Umar said: 'I too say Al-Hamdulillah Was-Salamu 'Ala Rasulillah, but this is not what the Messenger of Allah (ﷺ) taught us. He taught us to say: \"Al-Hamdulillah 'Ala Kulli Hal (All praise is due to Allah in every circumstance).\"","reference":"Jami` at-Tirmidhi 2738, Book 43, Hadith 3","grade":"Hasan(Darussalam)","question #":"question #3","question":"What phrase did the Prophet Muhammad (ﷺ) teach to say after sneezing?","id":"tirmidhi-43-247"},{"hadith-eng":"The Jews used to sneeze in the presence of the Prophet (ﷺ) hoping that he would say: 'Yarhamukumullah (May Allah have mercy upon you).' So he said: 'Yahdikumullahu Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2739, Book 43, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the phrase 'Yahdikumullahu Wa Yuslihu Balakum' in Islamic teachings?","id":"tirmidhi-43-248"},{"hadith-eng":"that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"","reference":"Jami` at-Tirmidhi 2740, Book 43, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #3","question":"How should one respond to a sneeze to invoke blessings and forgiveness?","id":"tirmidhi-43-249"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you sneezes let him say: 'Al-Hamdulillahi 'Ala Kulli Hal (All praise is due to Allah in every circumstance).' And let the one replying to him say: \"Yarhamukallah (May Allah have mercy upon you).' And let him say to him: 'Yahdikumullah Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2741, Book 43, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of saying 'Yarhamukallah' in response to a sneeze?","id":"tirmidhi-43-250"},{"hadith-eng":"that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"","reference":"Jami` at-Tirmidhi 2742, Book 43, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the etiquette of sneezing from the Prophet's response?","id":"tirmidhi-43-251"},{"hadith-eng":"from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"","reference":"Jami` at-Tirmidhi 2743, Book 43, Hadith 10","grade":"","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) awareness of health conditions from his response to sneezing?","id":"tirmidhi-43-252"},{"hadith-eng":"from his mother, from her father, who said: \"The Messenger of Allah (ﷺ) said: 'Reply three times to the sneezing person. If he (sneezes) more, then if you wish reply and if you do not then do not.'\"","reference":"Jami` at-Tirmidhi 2744, Book 43, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #3","question":"What options does one have after responding to a sneeze three times?","id":"tirmidhi-43-253"},{"hadith-eng":"that when the Prophet (ﷺ) would sneeze, he would cover his face with his hand or with his garment, and muffle the sound with it.","reference":"Jami` at-Tirmidhi 2745, Book 43, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #3","question":"What actions are recommended to take when sneezing to minimize disturbance to others?","id":"tirmidhi-43-254"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]","reference":"Jami` at-Tirmidhi 2746, Book 43, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the recommended action to take when yawning according to Islamic teachings?","id":"tirmidhi-43-255"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah loves sneezing and He dislikes the yawn. So when one of you sneezes and says 'Al-Hamdulillah (All praise is due to Allah),' then it is a right due from every one who hears him to say: 'Yarhamukallah (May Allah have mercy upon you)' As for yawning then when one of you yawns let him suppress it as much as possible and not say: \"Hah Hah' for that is only from Ash-Shaitan laughing at him.\"","reference":"Jami` at-Tirmidhi 2747, Book 43, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the Islamic perspective on yawning and how should it be managed?","id":"tirmidhi-43-256"},{"hadith-eng":"from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"","reference":"Jami` at-Tirmidhi 2748, Book 43, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of physical interruptions like nosebleeds or regurgitation during prayer?","id":"tirmidhi-43-257"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2749, Book 43, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What teachings of the Prophet Muhammad (ﷺ) emphasize respect for others' personal space?","id":"tirmidhi-43-258"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2750, Book 43, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the etiquettes of seating arrangements in Islamic gatherings?","id":"tirmidhi-43-259"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man has more right to his seat. If he leaves for some need of his, then he returns, then he has more right to his seat.\"","reference":"Jami` at-Tirmidhi 2751, Book 43, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this teaching imply about respecting others' spaces and belongings?","id":"tirmidhi-43-260"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"","reference":"Jami` at-Tirmidhi 2752, Book 43, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #3","question":"What ethical considerations are involved in separating two people according to Islamic principles?","id":"tirmidhi-43-261"},{"hadith-eng":"\"There was no person more beloved to them than the Messenger of Allah (ﷺ).\" [He said:] \"And they would not stand when they saw him because they knew that he disliked that.\"","reference":"Jami` at-Tirmidhi 2754, Book 43, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet Muhammad's (ﷺ) preferences regarding public displays of respect?","id":"tirmidhi-43-262"},{"hadith-eng":"that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"","reference":"Jami` at-Tirmidhi 2755, Book 43, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the consequences of seeking admiration and standing from others in Islamic teachings?","id":"tirmidhi-43-263"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"","reference":"Jami` at-Tirmidhi 2756, Book 43, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does maintaining personal hygiene relate to Islamic teachings on Fitrah?","id":"tirmidhi-43-264"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"","reference":"Jami` at-Tirmidhi 2757, Book 43, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the practice of Siwak relate to oral hygiene in Islamic tradition?","id":"tirmidhi-43-265"},{"hadith-eng":"from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.","reference":"Jami` at-Tirmidhi 2758, Book 43, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the prescribed interval for shaving pubic hairs in Islamic tradition?","id":"tirmidhi-43-266"},{"hadith-eng":"\"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"","reference":"Jami` at-Tirmidhi 2759, Book 43, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of maintaining personal hygiene in Islam?","id":"tirmidhi-43-267"},{"hadith-eng":"\"The Prophet (ﷺ) would pare, or take from his mustache, and Ibrahim Khalilur-Rahman would do it (as well).\"","reference":"Jami` at-Tirmidhi 2760, Book 43, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #3","question":"What practices did Prophet Ibrahim (Khalilur-Rahman) follow regarding personal grooming?","id":"tirmidhi-43-268"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"","reference":"Jami` at-Tirmidhi 2761, Book 43, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of neglecting personal grooming in Islam?","id":"tirmidhi-43-269"},{"hadith-eng":"from his father, from his grandfather that he Prophet (ﷺ) would take from his beard; from its breadth and its length.","reference":"Jami` at-Tirmidhi 2762, Book 43, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of following the Prophet's (ﷺ) example in personal grooming?","id":"tirmidhi-43-270"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Trim the mustache and leave the beard to grow.\"","reference":"Jami` at-Tirmidhi 2763, Book 43, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it recommended to let the beard grow according to Islamic tradition?","id":"tirmidhi-43-271"},{"hadith-eng":"that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.","reference":"Jami` at-Tirmidhi 2764, Book 43, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of trimming the mustache in Islamic tradition?","id":"tirmidhi-43-272"},{"hadith-eng":"from his paternal uncle, that he saw the Prophet (ﷺ) reclining in the Masjid, and placing one of his feet atop another.","reference":"Jami` at-Tirmidhi 2765, Book 43, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does this narration suggest about the permissibility of certain postures in the mosque?","id":"tirmidhi-43-273"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2766, Book 43, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of modesty and decorum in Islamic etiquette as reflected in this teaching?","id":"tirmidhi-43-274"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2767, Book 43, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of modesty in Islamic dress and behavior as inferred from this teaching?","id":"tirmidhi-43-275"},{"hadith-eng":"that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"","reference":"Jami` at-Tirmidhi 2768, Book 43, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the Prophet (ﷺ) guide Muslims regarding their physical conduct and behavior?","id":"tirmidhi-43-276"},{"hadith-eng":"\"My father narrated to me from my grandfather, who said: 'I said: \"O Messenger of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?\" He said: \"Protect your 'Awrah except from your wife or what your right hand possesses.\"' He said: \"What about a man with another man?\" He said: \"If you are able to not let anyone see it, then do so.\" I said: \"What about a man when he is alone?\" He said: \"Allah is most deserving of being shy from Him.\"","reference":"Jami` at-Tirmidhi 2769, Book 43, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #3","question":"What exceptions are mentioned for exposing one's 'Awrah?","id":"tirmidhi-43-277"},{"hadith-eng":"\"I saw the Messenger of Allah (ﷺ) reclining upon as pillow, on his left side.\"","reference":"Jami` at-Tirmidhi 2770, Book 43, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the physical demeanor of the Prophet Muhammad (ﷺ) provide insight into his daily life?","id":"tirmidhi-43-278"},{"hadith-eng":"\"I saw the Prophet (ﷺ) reclining upon a pillow.\"","reference":"Jami` at-Tirmidhi 2771, Book 43, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be inferred about the social or cultural practices of the time from the Prophet (ﷺ) reclining on a pillow?","id":"tirmidhi-43-279"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man is not lead in his dominion, and his seat of honor in his house is not sat in without his permission.\"","reference":"Jami` at-Tirmidhi 2772, Book 43, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam emphasize the concept of personal space and respect for others' property?","id":"tirmidhi-43-280"},{"hadith-eng":"\"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"","reference":"Jami` at-Tirmidhi 2773, Book 43, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned about humility and respect from the interaction between the Prophet and the man?","id":"tirmidhi-43-281"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you have Anmat?\" I said: \"Where would we get Anmat from?\" He said: \"Soon you will have Anmat\" He said: \"I would say to my wife: 'Remove your Anmat from my sight.' But she would say: 'Did not the Messenger of Allah (ﷺ) say: \"Indeed you shall soon have Anmat?\" He said: \"So I left it.\"","reference":"Jami` at-Tirmidhi 2774, Book 43, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does a spouse play in reminding or reinforcing the teachings of the Prophet (ﷺ) within a household?","id":"tirmidhi-43-282"},{"hadith-eng":"from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"","reference":"Jami` at-Tirmidhi 2775, Book 43, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the presence of Al-Hasan and Al-Husain with the Prophet Muhammad (ﷺ) reflect on their status in early Islamic society?","id":"tirmidhi-43-283"},{"hadith-eng":"\"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"","reference":"Jami` at-Tirmidhi 2776, Book 43, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does Islamic teaching suggest about controlling one's gaze?","id":"tirmidhi-43-284"},{"hadith-eng":"from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"","reference":"Jami` at-Tirmidhi 2777, Book 43, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islam address the issue of modesty and self-control in relation to looking at others?","id":"tirmidhi-43-285"},{"hadith-eng":"to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"","reference":"Jami` at-Tirmidhi 2778, Book 43, Hadith 48","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the guidelines for women regarding veiling in the presence of blind men according to Islamic teachings?","id":"tirmidhi-43-286"},{"hadith-eng":"from the freed slave of 'Amr bin Al-'As that 'Amr bin Al-'As sent him to 'Ali seeking his permission to enter upon Asma bint Umais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr bin Al-'As asked about that, so he said: \"Indeed the Prophet (ﷺ) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\"","reference":"Jami` at-Tirmidhi 2779, Book 43, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the guidelines for interacting with women who are not one's mahram in Islam?","id":"tirmidhi-43-287"},{"hadith-eng":"that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"","reference":"Jami` at-Tirmidhi 2780, Book 43, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does Islam provide to men regarding the challenges posed by women?","id":"tirmidhi-43-288"},{"hadith-eng":"that he heard Mu'awiyah giving a Khutbah in Al-Madinah, and saying: \"Where are your scholars, O people of Al-Madinah? [Indeed] I heard the Messenger of Allah (ﷺ) forbidding from these locks (of hair), and saying: 'The Children of Isra'il were only ruined when their women used them.'\"","reference":"Jami` at-Tirmidhi 2781, Book 43, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #3","question":"What specific practice related to hair is mentioned as being forbidden by the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-289"},{"hadith-eng":"that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.","reference":"Jami` at-Tirmidhi 2782, Book 43, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of changing the creation of Allah in Islamic teachings?","id":"tirmidhi-43-290"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Allah's curse is upon the woman who lengthens hair and the women who seeks to have her hair lengthened, and the woman who tattoos and the woman who seeks to have her herself tattooed.\"","reference":"Jami` at-Tirmidhi 2783, Book 43, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this narration reflect the importance of adhering to natural beauty in Islam?","id":"tirmidhi-43-291"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"","reference":"Jami` at-Tirmidhi 2784, Book 43, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of a curse from the Prophet Muhammad (ﷺ) in Islamic teachings?","id":"tirmidhi-43-292"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed those men who behave effeminately and those women whose behavior is masculine.\"","reference":"Jami` at-Tirmidhi 2785, Book 43, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the consequences mentioned in Islamic teachings for men and women who adopt opposite gender behaviors?","id":"tirmidhi-43-293"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.","reference":"Jami` at-Tirmidhi 2786, Book 43, Hadith 58","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of a woman wearing perfume and passing by a gathering according to Islamic teachings?","id":"tirmidhi-43-294"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)","reference":"Jami` at-Tirmidhi 2787, Book 43, Hadith 59","grade":"","question #":"question #3","question":"What is the significance of the visibility of fragrance for women in Islamic tradition?","id":"tirmidhi-43-295"},{"hadith-eng":"\"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"","reference":"Jami` at-Tirmidhi 2788, Book 43, Hadith 61","grade":"Da'if(Darussalam)","question #":"question #3","question":"Why might the Prophet (ﷺ) have prohibited certain types of saddle cloths?","id":"tirmidhi-43-296"},{"hadith-eng":"\"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"","reference":"Jami` at-Tirmidhi 2789, Book 43, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned from Anas's behavior regarding the acceptance of perfume?","id":"tirmidhi-43-297"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are three that are not refused: Cushions, oils [Duhn (fragrance)], and milk.\"","reference":"Jami` at-Tirmidhi 2790, Book 43, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the acceptance of certain items reflect on social and cultural practices in Islam?","id":"tirmidhi-43-298"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'When one of you is given some fragrance then do not refuse it, for indeed it comes from Paradise.\"","reference":"Jami` at-Tirmidhi 2791, Book 43, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the etiquettes of receiving gifts according to Islamic teachings?","id":"tirmidhi-43-299"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A woman is not to touch a woman such that she can describe her to her husband as if he is looking at her.\"","reference":"Jami` at-Tirmidhi 2792, Book 43, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of this teaching on maintaining the dignity and respect of individuals?","id":"tirmidhi-43-300"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a woman under one garment.'\"","reference":"Jami` at-Tirmidhi 2793, Book 43, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam address the issue of privacy and personal boundaries among individuals?","id":"tirmidhi-43-301"},{"hadith-eng":"from his father, from his grandfather, who said: \"I said: 'O Prophet of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?' He said: 'Protect your 'Awrah except from your wife or what your right hand possesses.' He said: \"I said: 'O Messenger of Allah! What about when some people are with others?' He said: 'If you are able to not let anyone see it then do not let them see it.'\" He said: \"I said: 'O Prophet of Allah! What about when one of us is alone?' He said: 'Allah is more deserving of being shy from Him than the people.'\"","reference":"Jami` at-Tirmidhi 2794, Book 43, Hadith 67","grade":"Hasan(Darussalam)","question #":"question #3","question":"What exceptions are mentioned for covering the 'Awrah in intimate relationships?","id":"tirmidhi-43-302"},{"hadith-eng":"about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2795, Book 43, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of exposing the 'Awrah in a mosque setting?","id":"tirmidhi-43-303"},{"hadith-eng":"from his father, from the Prophet (ﷺ) who said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2796, Book 43, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of considering the thigh as 'Awrah in Islamic jurisprudence?","id":"tirmidhi-43-304"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2797, Book 43, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of considering the thigh as 'Awrah in terms of modesty?","id":"tirmidhi-43-305"},{"hadith-eng":"\"Ibn Jarhad informed me from his father, that the Prophet (ﷺ) passed by him while his thigh was exposed, so the Prophet (ﷺ) said: 'Cover your thigh, for indeed it is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2798, Book 43, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the concept of 'Awrah influence the dress code for Muslim men?","id":"tirmidhi-43-306"},{"hadith-eng":"\"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"","reference":"Jami` at-Tirmidhi 2799, Book 43, Hadith 72","grade":"Da'if(Darussalam)","question #":"question #3","question":"What qualities does Allah love according to this narration?","id":"tirmidhi-43-307"},{"hadith-eng":"from Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Beware of nakedness! For indeed there are with you, those who do not part from you except at the place of defecation, and when a man goes into his wife. So be shy of them and honor them.\"","reference":"Jami` at-Tirmidhi 2800, Book 43, Hadith 73","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the situations in which one should be particularly mindful of modesty according to Islamic teachings?","id":"tirmidhi-43-308"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"","reference":"Jami` at-Tirmidhi 2801, Book 43, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does belief in Allah and the Last Day influence a person's behavior regarding social gatherings where alcohol is present?","id":"tirmidhi-43-309"},{"hadith-eng":"from 'Aishah, that the Prophet (ﷺ) prohibitied the men and women from the Hammamat (plural of Hammam), then he permitted it for the men in Izar.\"","reference":"Jami` at-Tirmidhi 2802, Book 43, Hadith 75","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the role of Izar in the context of men using Hammamat?","id":"tirmidhi-43-310"},{"hadith-eng":"that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"","reference":"Jami` at-Tirmidhi 2803, Book 43, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of a woman tearing the screen between herself and her Lord according to Islamic teachings?","id":"tirmidhi-43-311"},{"hadith-eng":"\"I heard Abu Talhah saying: 'I heard the Messenger of Allah (ﷺ) saying: \"The angels do not enter a house in which there is a dog or an object of images.\"","reference":"Jami` at-Tirmidhi 2804, Book 43, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of having images in a home according to Islamic beliefs?","id":"tirmidhi-43-312"},{"hadith-eng":"that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"","reference":"Jami` at-Tirmidhi 2805, Book 43, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of having images or pictures in a home according to Islamic teachings?","id":"tirmidhi-43-313"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.","reference":"Jami` at-Tirmidhi 2806, Book 43, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions did the Prophet Muhammad (ﷺ) take to address the presence of images and a dog in his home?","id":"tirmidhi-43-314"},{"hadith-eng":"\"A man passed by while wearing two red garments. He gave Salam to the Prophet (ﷺ) but he did not return the Salam.\"","reference":"Jami` at-Tirmidhi 2807, Book 43, Hadith 80","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the possible reasons for not returning a greeting in Islamic teachings?","id":"tirmidhi-43-315"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited the gold ring, Al-Qassi, Al-Mitharah, and Al-Ji'ah (beer).\"","reference":"Jami` at-Tirmidhi 2808, Book 43, Hadith 81","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is Al-Qassi and why is it prohibited in Islam?","id":"tirmidhi-43-316"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"","reference":"Jami` at-Tirmidhi 2809, Book 43, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it important to follow the funeral and visit the ill in Islamic teachings?","id":"tirmidhi-43-317"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"","reference":"Jami` at-Tirmidhi 2810, Book 43, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of shrouding the deceased in white according to Islamic tradition?","id":"tirmidhi-43-318"},{"hadith-eng":"\"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"","reference":"Jami` at-Tirmidhi 2811, Book 43, Hadith 84","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of the Prophet Muhammad (ﷺ) wearing a red Hullah in this narration?","id":"tirmidhi-43-319"},{"hadith-eng":"\"I saw the Messenger of Allah wearing two green Burud.\"","reference":"Jami` at-Tirmidhi 2812, Book 43, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the description of the Prophet's (ﷺ) attire contribute to our understanding of his lifestyle?","id":"tirmidhi-43-320"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) went out during the morning wearing a Mirt made of black hair.\"","reference":"Jami` at-Tirmidhi 2813, Book 43, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the description of the Prophet's attire reflect the cultural or social norms of his time?","id":"tirmidhi-43-321"},{"hadith-eng":"that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"","reference":"Jami` at-Tirmidhi 2814, Book 43, Hadith 88","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's choice of clothing and its condition in this narration?","id":"tirmidhi-43-322"},{"hadith-eng":"that the Messenger of Allah (ﷺ) prohibited saffron for men.","reference":"Jami` at-Tirmidhi 2815, 2815b, Book 43, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islamic law differentiate between permissible and impermissible attire for men?","id":"tirmidhi-43-323"},{"hadith-eng":"\"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"","reference":"Jami` at-Tirmidhi 2816, Book 43, Hadith 90","grade":"Da'if(Darussalam)","question #":"question #3","question":"What actions are recommended if one is found using something deemed inappropriate in Islam?","id":"tirmidhi-43-324"},{"hadith-eng":"from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"","reference":"Jami` at-Tirmidhi 2817, Book 43, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the implications of wearing silk for men in Islamic jurisprudence?","id":"tirmidhi-43-325"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"","reference":"Jami` at-Tirmidhi 2818, Book 43, Hadith 92","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) demonstrate personal consideration and care for individuals in his community?","id":"tirmidhi-43-326"},{"hadith-eng":"from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"","reference":"Jami` at-Tirmidhi 2819, Book 43, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are some ways to demonstrate the results of Allah's favors in one's life?","id":"tirmidhi-43-327"},{"hadith-eng":"from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"","reference":"Jami` at-Tirmidhi 2820, Book 43, Hadith 94","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the conditions under which wiping over Khuff is permissible in Islam?","id":"tirmidhi-43-328"},{"hadith-eng":"from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"","reference":"Jami` at-Tirmidhi 2821, Book 43, Hadith 95","grade":"Hasan(Darussalam)","question #":"question #3","question":"How is gray hair perceived in terms of spiritual or religious symbolism in Islam?","id":"tirmidhi-43-329"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"","reference":"Jami` at-Tirmidhi 2822, Book 43, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #3","question":"What responsibilities does a person have when their counsel is sought?","id":"tirmidhi-43-330"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'The one whose council is sought is entrusted.'\"","reference":"Jami` at-Tirmidhi 2823, Book 43, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #3","question":"What responsibilities does a person have when their advice is sought in Islam?","id":"tirmidhi-43-331"},{"hadith-eng":"from their father that the Messenger of Allah (ﷺ) said: \"An omen is in three: A woman, a dwelling, and a (riding) beast.\"","reference":"Jami` at-Tirmidhi 2824, 2824b, 2824c, 2824d, Book 43, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of identifying omens in the context of Islamic belief and daily life?","id":"tirmidhi-43-332"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whenever there are three of you, then let two not converse in exclusion of their companion.\"","reference":"Jami` at-Tirmidhi 2825, Book 43, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does Islam provide regarding inclusivity in social interactions?","id":"tirmidhi-43-333"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"","reference":"Jami` at-Tirmidhi 2826, Book 43, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #3","question":"What actions did Abu Bakr take regarding the promises made by the Prophet Muhammad (ﷺ) after his passing?","id":"tirmidhi-43-334"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"","reference":"Jami` at-Tirmidhi 2827, Book 43, Hadith 101","grade":"","question #":"question #3","question":"Who was Al-Hasan bin 'Ali in relation to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-335"},{"hadith-eng":"\"I did not hear the Prophet (ﷺ) mentioning both of his parents (that is including both in the saying \"May my father and mother be ransomed for you\") for anyone other than Sa'd bin Abi Waqqas.\"","reference":"Jami` at-Tirmidhi 2828, Book 43, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #3","question":"In what context did the Prophet Muhammad (ﷺ) use the phrase involving both his parents?","id":"tirmidhi-43-336"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not mention both of his parents for anyone except Sa'd bin Abi Waqqas. On the Day of Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot! O young man.'\"","reference":"Jami` at-Tirmidhi 2829, Book 43, Hadith 103","grade":"Da'if(Darussalam)","question #":"question #3","question":"How did the Prophet Muhammad (ﷺ) express his support and encouragement to his companions during battles?","id":"tirmidhi-43-337"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) mentioned both of his parents to me on the Day of Uhud.\"","reference":"Jami` at-Tirmidhi 2830, Book 43, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the historical context of the Battle of Uhud in Islamic history?","id":"tirmidhi-43-338"},{"hadith-eng":"that the Prophet (ﷺ) said to him: \"O my little son.\"","reference":"Jami` at-Tirmidhi 2831, Book 43, Hadith 105","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the Prophet's approach to addressing younger individuals from this narration?","id":"tirmidhi-43-339"},{"hadith-eng":"from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).","reference":"Jami` at-Tirmidhi 2832, Book 43, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the purpose of removing harm from a newborn in Islamic customs?","id":"tirmidhi-43-340"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2833, Book 43, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #3","question":"What significance do the names 'Abdullah and 'Abdur-Rahman hold in Islamic tradition?","id":"tirmidhi-43-341"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2834, Book 43, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance do the names 'Abdullah and 'Abdur-Rahman hold in Islamic tradition?","id":"tirmidhi-43-342"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"","reference":"Jami` at-Tirmidhi 2835, Book 43, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of naming in Islamic culture and teachings?","id":"tirmidhi-43-343"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"","reference":"Jami` at-Tirmidhi 2836, Book 43, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #3","question":"How can the choice of a child's name affect social interactions according to Islamic guidance?","id":"tirmidhi-43-344"},{"hadith-eng":"that Abu Hurairah conveyed to him that the Prophet (ﷺ) said: \"The most despicable (Akhna) name to Allah on the Day of Judgement is that of a man named King of Kings. (Malikil-Amlak).\"","reference":"Jami` at-Tirmidhi 2837, Book 43, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of humility relate to the choice of names in Islam?","id":"tirmidhi-43-345"},{"hadith-eng":"that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"","reference":"Jami` at-Tirmidhi 2838, Book 43, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #3","question":"What impact can a name have on a person's identity in Islamic tradition?","id":"tirmidhi-43-346"},{"hadith-eng":"that the Prophet (ﷺ) would change abhorrent names.\"","reference":"Jami` at-Tirmidhi 2839, Book 43, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #3","question":"What impact can a name have on an individual's identity and perception in Islam?","id":"tirmidhi-43-347"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"","reference":"Jami` at-Tirmidhi 2840, Book 43, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the name Al-Hasir relate to the role of the Prophet Muhammad (ﷺ) in the Hereafter?","id":"tirmidhi-43-348"},{"hadith-eng":"that the Prophet (ﷺ) prohibited that one use his name and his Kunyah; naming themselves Muhammad Abul-Qasim.","reference":"Jami` at-Tirmidhi 2841, Book 43, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the cultural or religious importance of a Kunyah in Islamic society?","id":"tirmidhi-43-349"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"","reference":"Jami` at-Tirmidhi 2842, Book 43, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islamic tradition guide the naming of individuals in relation to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-350"},{"hadith-eng":"that he said: \"O Messenger of Allah (ﷺ)! If I have a son after you do you think I could name him your Kunyah?\" He said: \"Yes.\" So he said: \"So that was permitted for me.\"","reference":"Jami` at-Tirmidhi 2843, Book 43, Hadith 117","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the Prophet Muhammad (ﷺ) respond to requests regarding naming conventions?","id":"tirmidhi-43-351"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\"","reference":"Jami` at-Tirmidhi 2844, Book 43, Hadith 118","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role does poetry play in Islamic teachings and culture?","id":"tirmidhi-43-352"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\".","reference":"Jami` at-Tirmidhi 2845, Book 43, Hadith 119","grade":"Hasan(Darussalam)","question #":"question #3","question":"What role does poetry play in the cultural and spiritual life of Muslims?","id":"tirmidhi-43-353"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"","reference":"Jami` at-Tirmidhi 2846, Book 43, Hadith 120","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the role of the holy spirit (Jibril) in aiding Hassan according to the narration?","id":"tirmidhi-43-354"},{"hadith-eng":"that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"","reference":"Jami` at-Tirmidhi 2847, Book 43, Hadith 122","grade":"Hasan(Darussalam)","question #":"question #3","question":"What was Umar's reaction to the recitation of poetry in the sanctuary of Allah, and how did the Prophet (ﷺ) address it?","id":"tirmidhi-43-355"},{"hadith-eng":"from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"","reference":"Jami` at-Tirmidhi 2848, Book 43, Hadith 123","grade":"Da'if(Darussalam)","question #":"question #3","question":"Who was Ibn Rawahah and what is his connection to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-356"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"","reference":"Jami` at-Tirmidhi 2849, Book 43, Hadith 124","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does poetry play in conveying Islamic teachings and beliefs?","id":"tirmidhi-43-357"},{"hadith-eng":"\"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"","reference":"Jami` at-Tirmidhi 2850, Book 43, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #3","question":"How did the Prophet (ﷺ) respond to the recitation of poetry by his companions?","id":"tirmidhi-43-358"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2851, Book 43, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #3","question":"What might be the potential negative effects of immersing oneself in poetry as suggested by this teaching?","id":"tirmidhi-43-359"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2852, Book 43, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #3","question":"What might be the reasons for discouraging the excessive consumption of poetry in Islam?","id":"tirmidhi-43-360"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah detests the excessive among men, who slaps his tongue around like the cow slaps his tongue.\"","reference":"Jami` at-Tirmidhi 2853, Book 43, Hadith 128","grade":"Hasan(Darussalam)","question #":"question #3","question":"What analogy is used to describe the excessive use of the tongue in Islamic teachings?","id":"tirmidhi-43-361"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"","reference":"Jami` at-Tirmidhi 2854, Book 43, Hadith 129","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the potential dangers of sleeping on a terrace without protection?","id":"tirmidhi-43-362"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to take care of us by preaching during the days fearing that we may get bored.\"","reference":"Jami` at-Tirmidhi 2855, Book 43, Hadith 130","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is it important for religious leaders to be mindful of their audience's engagement levels?","id":"tirmidhi-43-363"},{"hadith-eng":"\"I asked 'Aishah and Umm Salamah about which deed did the Messenger of Allah (ﷺ) like to do most. They said: 'Whatever he could do regularly, even if it was little.'\"","reference":"Jami` at-Tirmidhi 2856, Book 43, Hadith 132","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why might small but consistent deeds be preferred over larger, irregular ones in Islamic teachings?","id":"tirmidhi-43-364"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Cover the vessels, tie the water-skins, close the doors, extinguish the torches, for indeed the mischief-makers (vermin) may drag away the wick, causing a fire for the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2857, Book 43, Hadith 134","grade":"Sahih(Darussalam)","question #":"question #3","question":"How can closing doors contribute to the safety of a household?","id":"tirmidhi-43-365"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When you travel through fertile land, then give the camels their fill of the land, and when you travel through drought, then hasten while they are fresh, and when you camp late, then stay away from the road, for indeed it is the route of the beasts and the abode of poisonous vermin in the night.\"","reference":"Jami` at-Tirmidhi 2858, Book 43, Hadith 135","grade":"Sahih(Darussalam)","question #":"question #3","question":"What precautions should be taken when camping late during travel?","id":"tirmidhi-43-366"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"","reference":"Jami` at-Tirmidhi 2736, Book 43, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to respond to a sneeze according to Islamic teachings?","id":"tirmidhi-43-367"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"","reference":"Jami` at-Tirmidhi 2737, Book 43, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #4","question":"How should a believer respond when another believer sneezes?","id":"tirmidhi-43-368"},{"hadith-eng":"from Nafi: \"A man sneezed beside Ibn 'Umar and said: 'Al-Hamdulillah Was-Salamu 'Ala Rasulillah. (All praise is due to Allah, and peace upon the Messenger of Allah)'. So Ibn 'Umar said: 'I too say Al-Hamdulillah Was-Salamu 'Ala Rasulillah, but this is not what the Messenger of Allah (ﷺ) taught us. He taught us to say: \"Al-Hamdulillah 'Ala Kulli Hal (All praise is due to Allah in every circumstance).\"","reference":"Jami` at-Tirmidhi 2738, Book 43, Hadith 3","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to adhere to the teachings of the Prophet Muhammad (ﷺ) in daily practices?","id":"tirmidhi-43-369"},{"hadith-eng":"The Jews used to sneeze in the presence of the Prophet (ﷺ) hoping that he would say: 'Yarhamukumullah (May Allah have mercy upon you).' So he said: 'Yahdikumullahu Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2739, Book 43, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the Prophet Muhammad (ﷺ) address the expectations of others in his interactions?","id":"tirmidhi-43-370"},{"hadith-eng":"that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"","reference":"Jami` at-Tirmidhi 2740, Book 43, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the significance of including one's mother in the response to a sneeze?","id":"tirmidhi-43-371"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you sneezes let him say: 'Al-Hamdulillahi 'Ala Kulli Hal (All praise is due to Allah in every circumstance).' And let the one replying to him say: \"Yarhamukallah (May Allah have mercy upon you).' And let him say to him: 'Yahdikumullah Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2741, Book 43, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the dua for guidance and rectification of affairs after someone sneezes?","id":"tirmidhi-43-372"},{"hadith-eng":"that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"","reference":"Jami` at-Tirmidhi 2742, Book 43, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the Prophet (ﷺ) choose to respond differently to two individuals in the same situation?","id":"tirmidhi-43-373"},{"hadith-eng":"from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"","reference":"Jami` at-Tirmidhi 2743, Book 43, Hadith 10","grade":"","question #":"question #4","question":"What does the response to sneezing indicate about Islamic etiquette and manners?","id":"tirmidhi-43-374"},{"hadith-eng":"from his mother, from her father, who said: \"The Messenger of Allah (ﷺ) said: 'Reply three times to the sneezing person. If he (sneezes) more, then if you wish reply and if you do not then do not.'\"","reference":"Jami` at-Tirmidhi 2744, Book 43, Hadith 14","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does this narration teach about social interactions and manners?","id":"tirmidhi-43-375"},{"hadith-eng":"that when the Prophet (ﷺ) would sneeze, he would cover his face with his hand or with his garment, and muffle the sound with it.","reference":"Jami` at-Tirmidhi 2745, Book 43, Hadith 15","grade":"Hasan(Darussalam)","question #":"question #4","question":"How can one follow the example of the Prophet (ﷺ) in daily actions such as sneezing?","id":"tirmidhi-43-376"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]","reference":"Jami` at-Tirmidhi 2746, Book 43, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does yawning relate to Ash-Shaitan in Islamic tradition?","id":"tirmidhi-43-377"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah loves sneezing and He dislikes the yawn. So when one of you sneezes and says 'Al-Hamdulillah (All praise is due to Allah),' then it is a right due from every one who hears him to say: 'Yarhamukallah (May Allah have mercy upon you)' As for yawning then when one of you yawns let him suppress it as much as possible and not say: \"Hah Hah' for that is only from Ash-Shaitan laughing at him.\"","reference":"Jami` at-Tirmidhi 2747, Book 43, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does sneezing relate to Allah's love according to Islamic teachings?","id":"tirmidhi-43-378"},{"hadith-eng":"from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"","reference":"Jami` at-Tirmidhi 2748, Book 43, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #4","question":"How is menstruation viewed in the context of spiritual practices according to Islamic teachings?","id":"tirmidhi-43-379"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2749, Book 43, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the social etiquettes related to seating arrangements in gatherings according to Islamic teachings?","id":"tirmidhi-43-380"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2750, Book 43, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can one demonstrate respect and consideration for others in communal spaces?","id":"tirmidhi-43-381"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man has more right to his seat. If he leaves for some need of his, then he returns, then he has more right to his seat.\"","reference":"Jami` at-Tirmidhi 2751, Book 43, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this guidance promote order and respect in social gatherings?","id":"tirmidhi-43-382"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"","reference":"Jami` at-Tirmidhi 2752, Book 43, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to respect the personal space and consent of others in social settings?","id":"tirmidhi-43-383"},{"hadith-eng":"\"There was no person more beloved to them than the Messenger of Allah (ﷺ).\" [He said:] \"And they would not stand when they saw him because they knew that he disliked that.\"","reference":"Jami` at-Tirmidhi 2754, Book 43, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did the companions balance their love and respect for the Prophet Muhammad (ﷺ) with his personal dislikes?","id":"tirmidhi-43-384"},{"hadith-eng":"that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"","reference":"Jami` at-Tirmidhi 2755, Book 43, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #4","question":"How should a Muslim approach the concept of humility in social interactions?","id":"tirmidhi-43-385"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"","reference":"Jami` at-Tirmidhi 2756, Book 43, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of trimming the mustache in Islamic tradition?","id":"tirmidhi-43-386"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"","reference":"Jami` at-Tirmidhi 2757, Book 43, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of grooming practices like paring the mustache and leaving the beard to grow in Islam?","id":"tirmidhi-43-387"},{"hadith-eng":"from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.","reference":"Jami` at-Tirmidhi 2758, Book 43, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is personal hygiene emphasized in Islamic teachings?","id":"tirmidhi-43-388"},{"hadith-eng":"\"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"","reference":"Jami` at-Tirmidhi 2759, Book 43, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #4","question":"How often should one trim their fingernails and pare their mustache according to Islamic guidelines?","id":"tirmidhi-43-389"},{"hadith-eng":"\"The Prophet (ﷺ) would pare, or take from his mustache, and Ibrahim Khalilur-Rahman would do it (as well).\"","reference":"Jami` at-Tirmidhi 2760, Book 43, Hadith 30","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to follow the grooming practices of the Prophets in Islam?","id":"tirmidhi-43-390"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"","reference":"Jami` at-Tirmidhi 2761, Book 43, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does maintaining one's appearance reflect on their adherence to Islamic principles?","id":"tirmidhi-43-391"},{"hadith-eng":"from his father, from his grandfather that he Prophet (ﷺ) would take from his beard; from its breadth and its length.","reference":"Jami` at-Tirmidhi 2762, Book 43, Hadith 32","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the Islamic teachings on the length and breadth of a man's beard?","id":"tirmidhi-43-392"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Trim the mustache and leave the beard to grow.\"","reference":"Jami` at-Tirmidhi 2763, Book 43, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does personal grooming relate to religious practices in Islam?","id":"tirmidhi-43-393"},{"hadith-eng":"that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.","reference":"Jami` at-Tirmidhi 2764, Book 43, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does growing a beard relate to Islamic identity and practice?","id":"tirmidhi-43-394"},{"hadith-eng":"from his paternal uncle, that he saw the Prophet (ﷺ) reclining in the Masjid, and placing one of his feet atop another.","reference":"Jami` at-Tirmidhi 2765, Book 43, Hadith 35","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet's (ﷺ) comfort and relaxation in the mosque from this account?","id":"tirmidhi-43-395"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2766, Book 43, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic guidance address the physical postures and behaviors of individuals in daily life?","id":"tirmidhi-43-396"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2767, Book 43, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic etiquette address the issue of physical postures during rest or relaxation?","id":"tirmidhi-43-397"},{"hadith-eng":"that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"","reference":"Jami` at-Tirmidhi 2768, Book 43, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are some actions or behaviors that are not loved by Allah according to Islamic teachings?","id":"tirmidhi-43-398"},{"hadith-eng":"\"My father narrated to me from my grandfather, who said: 'I said: \"O Messenger of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?\" He said: \"Protect your 'Awrah except from your wife or what your right hand possesses.\"' He said: \"What about a man with another man?\" He said: \"If you are able to not let anyone see it, then do so.\" I said: \"What about a man when he is alone?\" He said: \"Allah is most deserving of being shy from Him.\"","reference":"Jami` at-Tirmidhi 2769, Book 43, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of modesty in Islam as it relates to one's 'Awrah?","id":"tirmidhi-43-399"},{"hadith-eng":"\"I saw the Messenger of Allah (ﷺ) reclining upon as pillow, on his left side.\"","reference":"Jami` at-Tirmidhi 2770, Book 43, Hadith 40","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the simplicity or lifestyle of the Prophet Muhammad (ﷺ) from his choice of resting position?","id":"tirmidhi-43-400"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man is not lead in his dominion, and his seat of honor in his house is not sat in without his permission.\"","reference":"Jami` at-Tirmidhi 2772, Book 43, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the etiquettes of visiting someone's home according to Islamic teachings?","id":"tirmidhi-43-401"},{"hadith-eng":"\"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"","reference":"Jami` at-Tirmidhi 2773, Book 43, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does this narration reflect the Prophet's (ﷺ) consideration for others' rights?","id":"tirmidhi-43-402"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you have Anmat?\" I said: \"Where would we get Anmat from?\" He said: \"Soon you will have Anmat\" He said: \"I would say to my wife: 'Remove your Anmat from my sight.' But she would say: 'Did not the Messenger of Allah (ﷺ) say: \"Indeed you shall soon have Anmat?\" He said: \"So I left it.\"","reference":"Jami` at-Tirmidhi 2774, Book 43, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration illustrate the interaction between the Prophet (ﷺ) and his companions regarding material possessions?","id":"tirmidhi-43-403"},{"hadith-eng":"from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"","reference":"Jami` at-Tirmidhi 2775, Book 43, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration suggest about the role of companions in assisting the Prophet Muhammad (ﷺ) during his travels?","id":"tirmidhi-43-404"},{"hadith-eng":"\"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"","reference":"Jami` at-Tirmidhi 2776, Book 43, Hadith 46","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions are recommended to maintain modesty in visual interactions?","id":"tirmidhi-43-405"},{"hadith-eng":"from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"","reference":"Jami` at-Tirmidhi 2777, Book 43, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the consequences of not controlling one's gaze according to Islamic teachings?","id":"tirmidhi-43-406"},{"hadith-eng":"to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"","reference":"Jami` at-Tirmidhi 2778, Book 43, Hadith 48","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the hadith address the issue of visual interaction between men and women?","id":"tirmidhi-43-407"},{"hadith-eng":"from the freed slave of 'Amr bin Al-'As that 'Amr bin Al-'As sent him to 'Ali seeking his permission to enter upon Asma bint Umais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr bin Al-'As asked about that, so he said: \"Indeed the Prophet (ﷺ) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\"","reference":"Jami` at-Tirmidhi 2779, Book 43, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does this narration emphasize the importance of respecting marital boundaries?","id":"tirmidhi-43-408"},{"hadith-eng":"that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"","reference":"Jami` at-Tirmidhi 2780, Book 43, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways can the relationship between men and women be a source of fitnah in Islamic context?","id":"tirmidhi-43-409"},{"hadith-eng":"that he heard Mu'awiyah giving a Khutbah in Al-Madinah, and saying: \"Where are your scholars, O people of Al-Madinah? [Indeed] I heard the Messenger of Allah (ﷺ) forbidding from these locks (of hair), and saying: 'The Children of Isra'il were only ruined when their women used them.'\"","reference":"Jami` at-Tirmidhi 2781, Book 43, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the history of the Children of Isra'il serve as a warning in Islamic teachings?","id":"tirmidhi-43-410"},{"hadith-eng":"that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.","reference":"Jami` at-Tirmidhi 2782, Book 43, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of the Prophet's curse in Islamic tradition?","id":"tirmidhi-43-411"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Allah's curse is upon the woman who lengthens hair and the women who seeks to have her hair lengthened, and the woman who tattoos and the woman who seeks to have her herself tattooed.\"","reference":"Jami` at-Tirmidhi 2783, Book 43, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the cultural or religious reasons behind prohibiting certain beauty practices in Islam?","id":"tirmidhi-43-412"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"","reference":"Jami` at-Tirmidhi 2784, Book 43, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic tradition view the concept of masculinity and femininity?","id":"tirmidhi-43-413"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed those men who behave effeminately and those women whose behavior is masculine.\"","reference":"Jami` at-Tirmidhi 2785, Book 43, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of curse relate to certain behaviors in Islamic teachings?","id":"tirmidhi-43-414"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.","reference":"Jami` at-Tirmidhi 2786, Book 43, Hadith 58","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of 'every eye commits adultery' relate to personal accountability in Islam?","id":"tirmidhi-43-415"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)","reference":"Jami` at-Tirmidhi 2787, Book 43, Hadith 59","grade":"","question #":"question #4","question":"In what circumstances is it permissible for women to wear fragrant perfume according to Islamic teachings?","id":"tirmidhi-43-416"},{"hadith-eng":"\"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"","reference":"Jami` at-Tirmidhi 2788, Book 43, Hadith 61","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the significance of the color and scent of fragrances in Islamic tradition?","id":"tirmidhi-43-417"},{"hadith-eng":"\"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"","reference":"Jami` at-Tirmidhi 2789, Book 43, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might perfume hold a special place in Islamic culture and etiquette?","id":"tirmidhi-43-418"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are three that are not refused: Cushions, oils [Duhn (fragrance)], and milk.\"","reference":"Jami` at-Tirmidhi 2790, Book 43, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role do fragrances and oils play in Islamic customs and daily life?","id":"tirmidhi-43-419"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'When one of you is given some fragrance then do not refuse it, for indeed it comes from Paradise.\"","reference":"Jami` at-Tirmidhi 2791, Book 43, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might fragrance be considered a special gift in Islam?","id":"tirmidhi-43-420"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A woman is not to touch a woman such that she can describe her to her husband as if he is looking at her.\"","reference":"Jami` at-Tirmidhi 2792, Book 43, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this guidance contribute to the preservation of personal boundaries in relationships?","id":"tirmidhi-43-421"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a woman under one garment.'\"","reference":"Jami` at-Tirmidhi 2793, Book 43, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the Islamic teachings on being alone with someone under one garment?","id":"tirmidhi-43-422"},{"hadith-eng":"from his father, from his grandfather, who said: \"I said: 'O Prophet of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?' He said: 'Protect your 'Awrah except from your wife or what your right hand possesses.' He said: \"I said: 'O Messenger of Allah! What about when some people are with others?' He said: 'If you are able to not let anyone see it then do not let them see it.'\" He said: \"I said: 'O Prophet of Allah! What about when one of us is alone?' He said: 'Allah is more deserving of being shy from Him than the people.'\"","reference":"Jami` at-Tirmidhi 2794, Book 43, Hadith 67","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is it important to be mindful of one's 'Awrah even when alone?","id":"tirmidhi-43-423"},{"hadith-eng":"about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2795, Book 43, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the concept of 'Awrah relate to modesty in Islam?","id":"tirmidhi-43-424"},{"hadith-eng":"from his father, from the Prophet (ﷺ) who said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2796, Book 43, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the understanding of 'Awrah affect the dress code for Muslims?","id":"tirmidhi-43-425"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2797, Book 43, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the understanding of 'Awrah vary between different parts of the body?","id":"tirmidhi-43-426"},{"hadith-eng":"\"Ibn Jarhad informed me from his father, that the Prophet (ﷺ) passed by him while his thigh was exposed, so the Prophet (ﷺ) said: 'Cover your thigh, for indeed it is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2798, Book 43, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #4","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding modesty and covering the body?","id":"tirmidhi-43-427"},{"hadith-eng":"\"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"","reference":"Jami` at-Tirmidhi 2799, Book 43, Hadith 72","grade":"Da'if(Darussalam)","question #":"question #4","question":"How can Muslims incorporate the values of kindness and generosity in their daily lives?","id":"tirmidhi-43-428"},{"hadith-eng":"from Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Beware of nakedness! For indeed there are with you, those who do not part from you except at the place of defecation, and when a man goes into his wife. So be shy of them and honor them.\"","reference":"Jami` at-Tirmidhi 2800, Book 43, Hadith 73","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the presence of unseen beings influence the behavior of a Muslim in private settings?","id":"tirmidhi-43-429"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"","reference":"Jami` at-Tirmidhi 2801, Book 43, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of allowing one's wife to enter a Hammam in the context of Islamic beliefs?","id":"tirmidhi-43-430"},{"hadith-eng":"from 'Aishah, that the Prophet (ﷺ) prohibitied the men and women from the Hammamat (plural of Hammam), then he permitted it for the men in Izar.\"","reference":"Jami` at-Tirmidhi 2802, Book 43, Hadith 75","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the change in the Prophet's ruling on Hammamat reflect on Islamic jurisprudence?","id":"tirmidhi-43-431"},{"hadith-eng":"that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"","reference":"Jami` at-Tirmidhi 2803, Book 43, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #4","question":"What guidance does Islam provide regarding the use of public bathhouses by women?","id":"tirmidhi-43-432"},{"hadith-eng":"\"I heard Abu Talhah saying: 'I heard the Messenger of Allah (ﷺ) saying: \"The angels do not enter a house in which there is a dog or an object of images.\"","reference":"Jami` at-Tirmidhi 2804, Book 43, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the presence of a dog prevent angels from entering a house?","id":"tirmidhi-43-433"},{"hadith-eng":"that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"","reference":"Jami` at-Tirmidhi 2805, Book 43, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #4","question":"What actions can be taken to ensure that angels enter one's home?","id":"tirmidhi-43-434"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.","reference":"Jami` at-Tirmidhi 2806, Book 43, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the presence of certain objects affect the visitation of angels according to Islamic beliefs?","id":"tirmidhi-43-435"},{"hadith-eng":"\"A man passed by while wearing two red garments. He gave Salam to the Prophet (ﷺ) but he did not return the Salam.\"","reference":"Jami` at-Tirmidhi 2807, Book 43, Hadith 80","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the Prophet Muhammad (ﷺ) demonstrate social conduct through his actions?","id":"tirmidhi-43-436"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited the gold ring, Al-Qassi, Al-Mitharah, and Al-Ji'ah (beer).\"","reference":"Jami` at-Tirmidhi 2808, Book 43, Hadith 81","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is Al-Mitharah and what is its significance in Islamic prohibitions?","id":"tirmidhi-43-437"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"","reference":"Jami` at-Tirmidhi 2809, Book 43, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of replying to a sneezing person and accepting invitations in Islam?","id":"tirmidhi-43-438"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"","reference":"Jami` at-Tirmidhi 2810, Book 43, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the choice of clothing color relate to cleanliness in Islamic practice?","id":"tirmidhi-43-439"},{"hadith-eng":"\"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"","reference":"Jami` at-Tirmidhi 2811, Book 43, Hadith 84","grade":"Da'if(Darussalam)","question #":"question #4","question":"How do companions of the Prophet Muhammad (ﷺ) express their admiration for him in hadiths?","id":"tirmidhi-43-440"},{"hadith-eng":"\"I saw the Messenger of Allah wearing two green Burud.\"","reference":"Jami` at-Tirmidhi 2812, Book 43, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are Burud and what is their significance in the context of Islamic clothing?","id":"tirmidhi-43-441"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) went out during the morning wearing a Mirt made of black hair.\"","reference":"Jami` at-Tirmidhi 2813, Book 43, Hadith 87","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the simplicity or style of the Prophet's clothing from historical narrations?","id":"tirmidhi-43-442"},{"hadith-eng":"that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"","reference":"Jami` at-Tirmidhi 2814, Book 43, Hadith 88","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the cultural or symbolic significance of saffron-dyed cloths in the context of this narration?","id":"tirmidhi-43-443"},{"hadith-eng":"that the Messenger of Allah (ﷺ) prohibited saffron for men.","reference":"Jami` at-Tirmidhi 2815, 2815b, Book 43, Hadith 89","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of prohibitions in dress code for men in Islam?","id":"tirmidhi-43-444"},{"hadith-eng":"\"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"","reference":"Jami` at-Tirmidhi 2816, Book 43, Hadith 90","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does this incident teach about the importance of cleanliness and purity in Islam?","id":"tirmidhi-43-445"},{"hadith-eng":"from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"","reference":"Jami` at-Tirmidhi 2817, Book 43, Hadith 91","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of luxury and modesty in clothing reflect on one's spiritual life in Islam?","id":"tirmidhi-43-446"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"","reference":"Jami` at-Tirmidhi 2818, Book 43, Hadith 92","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this incident reveal about the relationship between the Prophet (ﷺ) and his companions?","id":"tirmidhi-43-447"},{"hadith-eng":"from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"","reference":"Jami` at-Tirmidhi 2819, Book 43, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to acknowledge and display the blessings given by Allah?","id":"tirmidhi-43-448"},{"hadith-eng":"from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"","reference":"Jami` at-Tirmidhi 2820, Book 43, Hadith 94","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the acceptance of gifts from others signify in the context of the Prophet's life?","id":"tirmidhi-43-449"},{"hadith-eng":"from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"","reference":"Jami` at-Tirmidhi 2821, Book 43, Hadith 95","grade":"Hasan(Darussalam)","question #":"question #4","question":"What are the implications of considering gray hair as a 'light' for Muslims?","id":"tirmidhi-43-450"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"","reference":"Jami` at-Tirmidhi 2822, Book 43, Hadith 96","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is it important to consider the trustworthiness of the person whose advice is being sought?","id":"tirmidhi-43-451"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'The one whose council is sought is entrusted.'\"","reference":"Jami` at-Tirmidhi 2823, Book 43, Hadith 97","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islam view the relationship between trust and seeking counsel?","id":"tirmidhi-43-452"},{"hadith-eng":"from their father that the Messenger of Allah (ﷺ) said: \"An omen is in three: A woman, a dwelling, and a (riding) beast.\"","reference":"Jami` at-Tirmidhi 2824, 2824b, 2824c, 2824d, Book 43, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #4","question":"How might the understanding of omens affect a Muslim's decision-making regarding marriage, housing, and transportation?","id":"tirmidhi-43-453"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whenever there are three of you, then let two not converse in exclusion of their companion.\"","reference":"Jami` at-Tirmidhi 2825, Book 43, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to maintain inclusivity in conversations according to Islamic teachings?","id":"tirmidhi-43-454"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"","reference":"Jami` at-Tirmidhi 2826, Book 43, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this narration indicate about the fulfillment of promises in Islam?","id":"tirmidhi-43-455"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"","reference":"Jami` at-Tirmidhi 2827, Book 43, Hadith 101","grade":"","question #":"question #4","question":"What can be inferred about the appearance of the Prophet Muhammad (ﷺ) from this narration?","id":"tirmidhi-43-456"},{"hadith-eng":"\"I did not hear the Prophet (ﷺ) mentioning both of his parents (that is including both in the saying \"May my father and mother be ransomed for you\") for anyone other than Sa'd bin Abi Waqqas.\"","reference":"Jami` at-Tirmidhi 2828, Book 43, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the use of specific phrases by the Prophet (ﷺ) highlight the status of certain companions?","id":"tirmidhi-43-457"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not mention both of his parents for anyone except Sa'd bin Abi Waqqas. On the Day of Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot! O young man.'\"","reference":"Jami` at-Tirmidhi 2829, Book 43, Hadith 103","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the expression of parental ransom indicate about the relationship between the Prophet (ﷺ) and his companions?","id":"tirmidhi-43-458"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) mentioned both of his parents to me on the Day of Uhud.\"","reference":"Jami` at-Tirmidhi 2830, Book 43, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #4","question":"How are familial relationships portrayed in the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-459"},{"hadith-eng":"from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).","reference":"Jami` at-Tirmidhi 2832, Book 43, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the 'Aqiqah and what does it involve in Islamic tradition?","id":"tirmidhi-43-460"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2833, Book 43, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #4","question":"How do names reflect one's relationship with Allah in Islam?","id":"tirmidhi-43-461"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2834, Book 43, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #4","question":"How do names reflect one's relationship with Allah in Islam?","id":"tirmidhi-43-462"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"","reference":"Jami` at-Tirmidhi 2835, Book 43, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the choice of a name reflect Islamic values and beliefs?","id":"tirmidhi-43-463"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"","reference":"Jami` at-Tirmidhi 2836, Book 43, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #4","question":"What considerations should be taken into account when naming a child in Islam?","id":"tirmidhi-43-464"},{"hadith-eng":"that Abu Hurairah conveyed to him that the Prophet (ﷺ) said: \"The most despicable (Akhna) name to Allah on the Day of Judgement is that of a man named King of Kings. (Malikil-Amlak).\"","reference":"Jami` at-Tirmidhi 2837, Book 43, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of having a name that is disliked by Allah on the Day of Judgement?","id":"tirmidhi-43-465"},{"hadith-eng":"that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"","reference":"Jami` at-Tirmidhi 2838, Book 43, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might the Prophet (ﷺ) choose to change someone's name?","id":"tirmidhi-43-466"},{"hadith-eng":"that the Prophet (ﷺ) would change abhorrent names.\"","reference":"Jami` at-Tirmidhi 2839, Book 43, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might a name be considered abhorrent or undesirable in Islamic culture?","id":"tirmidhi-43-467"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"","reference":"Jami` at-Tirmidhi 2840, Book 43, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does the name Al-'Aqib signify about the finality of prophethood in Islam?","id":"tirmidhi-43-468"},{"hadith-eng":"that the Prophet (ﷺ) prohibited that one use his name and his Kunyah; naming themselves Muhammad Abul-Qasim.","reference":"Jami` at-Tirmidhi 2841, Book 43, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the prohibition of using the Prophet's name and Kunyah together reflect respect for his status?","id":"tirmidhi-43-469"},{"hadith-eng":"that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"","reference":"Jami` at-Tirmidhi 2842, Book 43, Hadith 116","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the cultural or religious implications of naming oneself after significant religious figures in Islam?","id":"tirmidhi-43-470"},{"hadith-eng":"that he said: \"O Messenger of Allah (ﷺ)! If I have a son after you do you think I could name him your Kunyah?\" He said: \"Yes.\" So he said: \"So that was permitted for me.\"","reference":"Jami` at-Tirmidhi 2843, Book 43, Hadith 117","grade":"Hasan(Darussalam)","question #":"question #4","question":"What permissions did the Prophet Muhammad (ﷺ) grant regarding the use of his Kunyah?","id":"tirmidhi-43-471"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\"","reference":"Jami` at-Tirmidhi 2844, Book 43, Hadith 118","grade":"Hasan(Darussalam)","question #":"question #4","question":"How is wisdom perceived in the context of poetry according to Islamic tradition?","id":"tirmidhi-43-472"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\".","reference":"Jami` at-Tirmidhi 2845, Book 43, Hadith 119","grade":"Hasan(Darussalam)","question #":"question #4","question":"How is wisdom defined and recognized in the context of Islamic literature?","id":"tirmidhi-43-473"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"","reference":"Jami` at-Tirmidhi 2846, Book 43, Hadith 120","grade":"Hasan(Darussalam)","question #":"question #4","question":"What does this narration suggest about the use of artistic expression in Islamic tradition?","id":"tirmidhi-43-474"},{"hadith-eng":"that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"","reference":"Jami` at-Tirmidhi 2847, Book 43, Hadith 122","grade":"Hasan(Darussalam)","question #":"question #4","question":"What role did Abdullah bin Rawahah play during the Prophet's (ﷺ) entry into Makkah?","id":"tirmidhi-43-475"},{"hadith-eng":"from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"","reference":"Jami` at-Tirmidhi 2848, Book 43, Hadith 123","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the phrase 'News shall come to you from where you did not expect it' imply in Islamic teachings?","id":"tirmidhi-43-476"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"","reference":"Jami` at-Tirmidhi 2849, Book 43, Hadith 124","grade":"Sahih(Darussalam)","question #":"question #4","question":"Who was Labid and why is his saying considered significant in Islam?","id":"tirmidhi-43-477"},{"hadith-eng":"\"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"","reference":"Jami` at-Tirmidhi 2850, Book 43, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be inferred about the Prophet's (ﷺ) attitude towards cultural discussions among his companions?","id":"tirmidhi-43-478"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2851, Book 43, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this teaching reflect the broader Islamic perspective on the consumption of cultural and artistic content?","id":"tirmidhi-43-479"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2852, Book 43, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #4","question":"How can poetry potentially affect a person's spiritual or moral state?","id":"tirmidhi-43-480"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah detests the excessive among men, who slaps his tongue around like the cow slaps his tongue.\"","reference":"Jami` at-Tirmidhi 2853, Book 43, Hadith 128","grade":"Hasan(Darussalam)","question #":"question #4","question":"What can be inferred about the importance of moderation in speech from Islamic teachings?","id":"tirmidhi-43-481"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"","reference":"Jami` at-Tirmidhi 2854, Book 43, Hadith 129","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islamic teaching address safety in daily activities?","id":"tirmidhi-43-482"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) used to take care of us by preaching during the days fearing that we may get bored.\"","reference":"Jami` at-Tirmidhi 2855, Book 43, Hadith 130","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned from the Prophet's approach to teaching and preaching in terms of audience care?","id":"tirmidhi-43-483"},{"hadith-eng":"\"I asked 'Aishah and Umm Salamah about which deed did the Messenger of Allah (ﷺ) like to do most. They said: 'Whatever he could do regularly, even if it was little.'\"","reference":"Jami` at-Tirmidhi 2856, Book 43, Hadith 132","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned about the Prophet Muhammad's (ﷺ) approach to worship and good deeds from his preferences?","id":"tirmidhi-43-484"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Cover the vessels, tie the water-skins, close the doors, extinguish the torches, for indeed the mischief-makers (vermin) may drag away the wick, causing a fire for the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2857, Book 43, Hadith 134","grade":"Sahih(Darussalam)","question #":"question #4","question":"What potential dangers can arise from leaving torches or lamps unattended?","id":"tirmidhi-43-485"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When you travel through fertile land, then give the camels their fill of the land, and when you travel through drought, then hasten while they are fresh, and when you camp late, then stay away from the road, for indeed it is the route of the beasts and the abode of poisonous vermin in the night.\"","reference":"Jami` at-Tirmidhi 2858, Book 43, Hadith 135","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it advised to stay away from the road when camping at night?","id":"tirmidhi-43-486"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"","reference":"Jami` at-Tirmidhi 2736, Book 43, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the role of visiting the sick in fostering community bonds in Islam?","id":"tirmidhi-43-487"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"","reference":"Jami` at-Tirmidhi 2737, Book 43, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the duties of a believer towards another believer in their absence?","id":"tirmidhi-43-488"},{"hadith-eng":"from Nafi: \"A man sneezed beside Ibn 'Umar and said: 'Al-Hamdulillah Was-Salamu 'Ala Rasulillah. (All praise is due to Allah, and peace upon the Messenger of Allah)'. So Ibn 'Umar said: 'I too say Al-Hamdulillah Was-Salamu 'Ala Rasulillah, but this is not what the Messenger of Allah (ﷺ) taught us. He taught us to say: \"Al-Hamdulillah 'Ala Kulli Hal (All praise is due to Allah in every circumstance).\"","reference":"Jami` at-Tirmidhi 2738, Book 43, Hadith 3","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be learned from Ibn 'Umar's correction of the man's phrase after sneezing?","id":"tirmidhi-43-489"},{"hadith-eng":"The Jews used to sneeze in the presence of the Prophet (ﷺ) hoping that he would say: 'Yarhamukumullah (May Allah have mercy upon you).' So he said: 'Yahdikumullahu Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2739, Book 43, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be learned about the Prophet Muhammad's (ﷺ) approach to interfaith interactions from this incident?","id":"tirmidhi-43-490"},{"hadith-eng":"that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"","reference":"Jami` at-Tirmidhi 2740, Book 43, Hadith 5","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the phrases recommended by the Prophet (ﷺ) for sneezing and responding to it?","id":"tirmidhi-43-491"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When one of you sneezes let him say: 'Al-Hamdulillahi 'Ala Kulli Hal (All praise is due to Allah in every circumstance).' And let the one replying to him say: \"Yarhamukallah (May Allah have mercy upon you).' And let him say to him: 'Yahdikumullah Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"","reference":"Jami` at-Tirmidhi 2741, Book 43, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the exchange of phrases after sneezing reflect mutual supplication in Islam?","id":"tirmidhi-43-492"},{"hadith-eng":"that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"","reference":"Jami` at-Tirmidhi 2742, Book 43, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this incident teach about the conditions for receiving a response from others in Islamic tradition?","id":"tirmidhi-43-493"},{"hadith-eng":"from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"","reference":"Jami` at-Tirmidhi 2743, Book 43, Hadith 10","grade":"","question #":"question #5","question":"How does the Prophet's (ﷺ) response to sneezing reflect his concern for people's well-being?","id":"tirmidhi-43-494"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]","reference":"Jami` at-Tirmidhi 2746, Book 43, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why does Allah love sneezing and dislike yawning according to this narration?","id":"tirmidhi-43-495"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah loves sneezing and He dislikes the yawn. So when one of you sneezes and says 'Al-Hamdulillah (All praise is due to Allah),' then it is a right due from every one who hears him to say: 'Yarhamukallah (May Allah have mercy upon you)' As for yawning then when one of you yawns let him suppress it as much as possible and not say: \"Hah Hah' for that is only from Ash-Shaitan laughing at him.\"","reference":"Jami` at-Tirmidhi 2747, Book 43, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of Shaitan in the act of yawning as per Islamic belief?","id":"tirmidhi-43-496"},{"hadith-eng":"from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"","reference":"Jami` at-Tirmidhi 2748, Book 43, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #5","question":"What measures can be taken to minimize distractions during Salat?","id":"tirmidhi-43-497"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2749, Book 43, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can respecting others' seating rights contribute to harmony in a community?","id":"tirmidhi-43-498"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"","reference":"Jami` at-Tirmidhi 2750, Book 43, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"What teachings of Islam guide behavior in shared environments?","id":"tirmidhi-43-499"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man has more right to his seat. If he leaves for some need of his, then he returns, then he has more right to his seat.\"","reference":"Jami` at-Tirmidhi 2751, Book 43, Hadith 21","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of this teaching for maintaining harmony in communal settings?","id":"tirmidhi-43-500"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"","reference":"Jami` at-Tirmidhi 2752, Book 43, Hadith 22","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the potential consequences of separating two people without their consent in Islamic teachings?","id":"tirmidhi-43-501"},{"hadith-eng":"\"There was no person more beloved to them than the Messenger of Allah (ﷺ).\" [He said:] \"And they would not stand when they saw him because they knew that he disliked that.\"","reference":"Jami` at-Tirmidhi 2754, Book 43, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration reveal about the humility of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-502"},{"hadith-eng":"that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"","reference":"Jami` at-Tirmidhi 2755, Book 43, Hadith 25","grade":"Hasan(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding the behavior of leaders and those in authority?","id":"tirmidhi-43-503"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"","reference":"Jami` at-Tirmidhi 2756, Book 43, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the removal of underarm hair fit into the concept of Fitrah?","id":"tirmidhi-43-504"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"","reference":"Jami` at-Tirmidhi 2757, Book 43, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of Fitrah influence daily personal care routines for Muslims?","id":"tirmidhi-43-505"},{"hadith-eng":"from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.","reference":"Jami` at-Tirmidhi 2758, Book 43, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the grooming practices mentioned in the hadith related to personal hygiene?","id":"tirmidhi-43-506"},{"hadith-eng":"\"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"","reference":"Jami` at-Tirmidhi 2759, Book 43, Hadith 29","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the specific grooming practices mentioned in Islamic teachings for maintaining cleanliness?","id":"tirmidhi-43-507"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"","reference":"Jami` at-Tirmidhi 2761, Book 43, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the importance of personal hygiene and grooming?","id":"tirmidhi-43-508"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Trim the mustache and leave the beard to grow.\"","reference":"Jami` at-Tirmidhi 2763, Book 43, Hadith 33","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the cultural or religious reasons for maintaining a beard in Islam?","id":"tirmidhi-43-509"},{"hadith-eng":"that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.","reference":"Jami` at-Tirmidhi 2764, Book 43, Hadith 34","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the religious implications of altering one's appearance according to Islamic teachings?","id":"tirmidhi-43-510"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2766, Book 43, Hadith 36","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the potential implications of ignoring the Prophet's guidance on sitting postures?","id":"tirmidhi-43-511"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"","reference":"Jami` at-Tirmidhi 2767, Book 43, Hadith 37","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the potential reasons for prohibiting certain actions or postures in Islamic tradition?","id":"tirmidhi-43-512"},{"hadith-eng":"that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"","reference":"Jami` at-Tirmidhi 2768, Book 43, Hadith 38","grade":"Hasan(Darussalam)","question #":"question #5","question":"How can one align their physical actions with what is loved by Allah in Islam?","id":"tirmidhi-43-513"},{"hadith-eng":"\"My father narrated to me from my grandfather, who said: 'I said: \"O Messenger of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?\" He said: \"Protect your 'Awrah except from your wife or what your right hand possesses.\"' He said: \"What about a man with another man?\" He said: \"If you are able to not let anyone see it, then do so.\" I said: \"What about a man when he is alone?\" He said: \"Allah is most deserving of being shy from Him.\"","reference":"Jami` at-Tirmidhi 2769, Book 43, Hadith 39","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of shyness before Allah influence a person's behavior in private?","id":"tirmidhi-43-514"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A man is not lead in his dominion, and his seat of honor in his house is not sat in without his permission.\"","reference":"Jami` at-Tirmidhi 2772, Book 43, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching reflect on the broader principles of respect and courtesy in social interactions?","id":"tirmidhi-43-515"},{"hadith-eng":"\"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"","reference":"Jami` at-Tirmidhi 2773, Book 43, Hadith 43","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of allotting one's possessions for others in Islamic teachings?","id":"tirmidhi-43-516"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you have Anmat?\" I said: \"Where would we get Anmat from?\" He said: \"Soon you will have Anmat\" He said: \"I would say to my wife: 'Remove your Anmat from my sight.' But she would say: 'Did not the Messenger of Allah (ﷺ) say: \"Indeed you shall soon have Anmat?\" He said: \"So I left it.\"","reference":"Jami` at-Tirmidhi 2774, Book 43, Hadith 44","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the lifestyle and expectations of the early Muslim community from this narration?","id":"tirmidhi-43-517"},{"hadith-eng":"from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"","reference":"Jami` at-Tirmidhi 2775, Book 43, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #5","question":"What insights does this narration provide about the familial bonds within the household of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-43-518"},{"hadith-eng":"from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"","reference":"Jami` at-Tirmidhi 2777, Book 43, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #5","question":"How can one practice self-discipline in maintaining modesty as advised in Islamic teachings?","id":"tirmidhi-43-519"},{"hadith-eng":"to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"","reference":"Jami` at-Tirmidhi 2778, Book 43, Hadith 48","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this narration imply about the responsibilities of women in maintaining modesty?","id":"tirmidhi-43-520"},{"hadith-eng":"from the freed slave of 'Amr bin Al-'As that 'Amr bin Al-'As sent him to 'Ali seeking his permission to enter upon Asma bint Umais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr bin Al-'As asked about that, so he said: \"Indeed the Prophet (ﷺ) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\"","reference":"Jami` at-Tirmidhi 2779, Book 43, Hadith 49","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does the concept of privacy play in Islamic social interactions?","id":"tirmidhi-43-521"},{"hadith-eng":"that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"","reference":"Jami` at-Tirmidhi 2780, Book 43, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #5","question":"What measures can be taken to mitigate the fitnah of women for men in Islamic teachings?","id":"tirmidhi-43-522"},{"hadith-eng":"that he heard Mu'awiyah giving a Khutbah in Al-Madinah, and saying: \"Where are your scholars, O people of Al-Madinah? [Indeed] I heard the Messenger of Allah (ﷺ) forbidding from these locks (of hair), and saying: 'The Children of Isra'il were only ruined when their women used them.'\"","reference":"Jami` at-Tirmidhi 2781, Book 43, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do public sermons or Khutbahs play in educating the Muslim community?","id":"tirmidhi-43-523"},{"hadith-eng":"that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.","reference":"Jami` at-Tirmidhi 2782, Book 43, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam address the removal of facial hair for women?","id":"tirmidhi-43-524"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Allah's curse is upon the woman who lengthens hair and the women who seeks to have her hair lengthened, and the woman who tattoos and the woman who seeks to have her herself tattooed.\"","reference":"Jami` at-Tirmidhi 2783, Book 43, Hadith 54","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching relate to the broader Islamic principles of modesty and self-acceptance?","id":"tirmidhi-43-525"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"","reference":"Jami` at-Tirmidhi 2784, Book 43, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the potential social or spiritual consequences of imitating the opposite gender in Islam?","id":"tirmidhi-43-526"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) cursed those men who behave effeminately and those women whose behavior is masculine.\"","reference":"Jami` at-Tirmidhi 2785, Book 43, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding maintaining one's natural disposition?","id":"tirmidhi-43-527"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.","reference":"Jami` at-Tirmidhi 2786, Book 43, Hadith 58","grade":"Hasan(Darussalam)","question #":"question #5","question":"What lessons can be drawn about the influence of one's presence and actions in public spaces from this teaching?","id":"tirmidhi-43-528"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)","reference":"Jami` at-Tirmidhi 2787, Book 43, Hadith 59","grade":"","question #":"question #5","question":"How does the use of fragrance differ for men and women in Islamic teachings?","id":"tirmidhi-43-529"},{"hadith-eng":"\"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"","reference":"Jami` at-Tirmidhi 2788, Book 43, Hadith 61","grade":"Da'if(Darussalam)","question #":"question #5","question":"How do Islamic teachings differentiate between fragrances for men and women?","id":"tirmidhi-43-530"},{"hadith-eng":"\"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"","reference":"Jami` at-Tirmidhi 2789, Book 43, Hadith 62","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the acceptance of perfume relate to the broader concept of generosity and kindness in Islam?","id":"tirmidhi-43-531"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are three that are not refused: Cushions, oils [Duhn (fragrance)], and milk.\"","reference":"Jami` at-Tirmidhi 2790, Book 43, Hadith 63","grade":"Hasan(Darussalam)","question #":"question #5","question":"Why might milk be considered a significant offering in the context of this narration?","id":"tirmidhi-43-532"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'When one of you is given some fragrance then do not refuse it, for indeed it comes from Paradise.\"","reference":"Jami` at-Tirmidhi 2791, Book 43, Hadith 64","grade":"Da'if(Darussalam)","question #":"question #5","question":"What does Islamic tradition say about the refusal of gifts?","id":"tirmidhi-43-533"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"A woman is not to touch a woman such that she can describe her to her husband as if he is looking at her.\"","reference":"Jami` at-Tirmidhi 2792, Book 43, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #5","question":"What ethical considerations are highlighted in the context of sharing personal details about others?","id":"tirmidhi-43-534"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a woman under one garment.'\"","reference":"Jami` at-Tirmidhi 2793, Book 43, Hadith 66","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this hadith emphasize the importance of maintaining personal space and dignity?","id":"tirmidhi-43-535"},{"hadith-eng":"from his father, from his grandfather, who said: \"I said: 'O Prophet of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?' He said: 'Protect your 'Awrah except from your wife or what your right hand possesses.' He said: \"I said: 'O Messenger of Allah! What about when some people are with others?' He said: 'If you are able to not let anyone see it then do not let them see it.'\" He said: \"I said: 'O Prophet of Allah! What about when one of us is alone?' He said: 'Allah is more deserving of being shy from Him than the people.'\"","reference":"Jami` at-Tirmidhi 2794, Book 43, Hadith 67","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does the hadith suggest about modesty in the presence of Allah compared to people?","id":"tirmidhi-43-536"},{"hadith-eng":"about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2795, Book 43, Hadith 68","grade":"Hasan(Darussalam)","question #":"question #5","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the exposure of the thigh?","id":"tirmidhi-43-537"},{"hadith-eng":"from his father, from the Prophet (ﷺ) who said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2796, Book 43, Hadith 69","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of 'Awrah in maintaining privacy and dignity in Islam?","id":"tirmidhi-43-538"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The thigh is 'Awrah.\"","reference":"Jami` at-Tirmidhi 2797, Book 43, Hadith 70","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of modesty in Islamic teachings?","id":"tirmidhi-43-539"},{"hadith-eng":"\"Ibn Jarhad informed me from his father, that the Prophet (ﷺ) passed by him while his thigh was exposed, so the Prophet (ﷺ) said: 'Cover your thigh, for indeed it is 'Awrah.'\"","reference":"Jami` at-Tirmidhi 2798, Book 43, Hadith 71","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of exposing 'Awrah in public according to Islamic teachings?","id":"tirmidhi-43-540"},{"hadith-eng":"\"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"","reference":"Jami` at-Tirmidhi 2799, Book 43, Hadith 72","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of not resembling other religious groups in certain practices according to Islamic teachings?","id":"tirmidhi-43-541"},{"hadith-eng":"from Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Beware of nakedness! For indeed there are with you, those who do not part from you except at the place of defecation, and when a man goes into his wife. So be shy of them and honor them.\"","reference":"Jami` at-Tirmidhi 2800, Book 43, Hadith 73","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the role of shyness and honor in the context of Islamic etiquette and behavior?","id":"tirmidhi-43-542"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"","reference":"Jami` at-Tirmidhi 2801, Book 43, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islamic teaching address the issue of modesty in public bathhouses?","id":"tirmidhi-43-543"},{"hadith-eng":"from 'Aishah, that the Prophet (ﷺ) prohibitied the men and women from the Hammamat (plural of Hammam), then he permitted it for the men in Izar.\"","reference":"Jami` at-Tirmidhi 2802, Book 43, Hadith 75","grade":"Hasan(Darussalam)","question #":"question #5","question":"What can be inferred about gender-specific rulings in Islam from this narration?","id":"tirmidhi-43-544"},{"hadith-eng":"that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"","reference":"Jami` at-Tirmidhi 2803, Book 43, Hadith 76","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of a woman's privacy relate to her relationship with Allah in Islamic teachings?","id":"tirmidhi-43-545"},{"hadith-eng":"\"I heard Abu Talhah saying: 'I heard the Messenger of Allah (ﷺ) saying: \"The angels do not enter a house in which there is a dog or an object of images.\"","reference":"Jami` at-Tirmidhi 2804, Book 43, Hadith 77","grade":"Sahih(Darussalam)","question #":"question #5","question":"What actions can be taken to ensure the presence of angels in one's home?","id":"tirmidhi-43-546"},{"hadith-eng":"that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"","reference":"Jami` at-Tirmidhi 2805, Book 43, Hadith 78","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of angels in a household according to Islamic belief?","id":"tirmidhi-43-547"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.","reference":"Jami` at-Tirmidhi 2806, Book 43, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance did Jibra'il provide to the Prophet Muhammad (ﷺ) regarding household items?","id":"tirmidhi-43-548"},{"hadith-eng":"\"A man passed by while wearing two red garments. He gave Salam to the Prophet (ﷺ) but he did not return the Salam.\"","reference":"Jami` at-Tirmidhi 2807, Book 43, Hadith 80","grade":"Da'if(Darussalam)","question #":"question #5","question":"What lessons can be learned from the Prophet's response to greetings in different situations?","id":"tirmidhi-43-549"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited the gold ring, Al-Qassi, Al-Mitharah, and Al-Ji'ah (beer).\"","reference":"Jami` at-Tirmidhi 2808, Book 43, Hadith 81","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is Al-Ji'ah and why is it forbidden in Islamic teachings?","id":"tirmidhi-43-550"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"","reference":"Jami` at-Tirmidhi 2809, Book 43, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does assisting the oppressed and helping someone who made an oath reflect Islamic values?","id":"tirmidhi-43-551"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"","reference":"Jami` at-Tirmidhi 2810, Book 43, Hadith 83","grade":"Sahih(Darussalam)","question #":"question #5","question":"What guidance does Islam provide regarding the attire for the deceased?","id":"tirmidhi-43-552"},{"hadith-eng":"\"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"","reference":"Jami` at-Tirmidhi 2811, Book 43, Hadith 84","grade":"Da'if(Darussalam)","question #":"question #5","question":"What can be inferred about the Prophet Muhammad's (ﷺ) presence and demeanor from this description?","id":"tirmidhi-43-553"},{"hadith-eng":"\"I saw the Messenger of Allah wearing two green Burud.\"","reference":"Jami` at-Tirmidhi 2812, Book 43, Hadith 86","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the attire of the Prophet (ﷺ) reflect his personality and character?","id":"tirmidhi-43-554"},{"hadith-eng":"that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"","reference":"Jami` at-Tirmidhi 2814, Book 43, Hadith 88","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role do family and lineage play in the transmission of hadiths according to this narration?","id":"tirmidhi-43-555"},{"hadith-eng":"\"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"","reference":"Jami` at-Tirmidhi 2816, Book 43, Hadith 90","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the Prophet's guidance reflect on the concept of obedience in Islamic practice?","id":"tirmidhi-43-556"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"","reference":"Jami` at-Tirmidhi 2818, Book 43, Hadith 92","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can leaders today learn from the Prophet's (ﷺ) way of addressing grievances or misunderstandings?","id":"tirmidhi-43-557"},{"hadith-eng":"from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"","reference":"Jami` at-Tirmidhi 2819, Book 43, Hadith 93","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does expressing gratitude for Allah's favors impact a person's spiritual life?","id":"tirmidhi-43-558"},{"hadith-eng":"from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"","reference":"Jami` at-Tirmidhi 2820, Book 43, Hadith 94","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the practice of wiping over Khuff demonstrate the flexibility of Islamic rituals?","id":"tirmidhi-43-559"},{"hadith-eng":"from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"","reference":"Jami` at-Tirmidhi 2821, Book 43, Hadith 95","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the prohibition of plucking gray hair relate to the broader Islamic principles of natural beauty and acceptance?","id":"tirmidhi-43-560"},{"hadith-eng":"from their father that the Messenger of Allah (ﷺ) said: \"An omen is in three: A woman, a dwelling, and a (riding) beast.\"","reference":"Jami` at-Tirmidhi 2824, 2824b, 2824c, 2824d, Book 43, Hadith 98","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of associating omens with specific aspects of life in Islamic tradition?","id":"tirmidhi-43-561"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Whenever there are three of you, then let two not converse in exclusion of their companion.\"","reference":"Jami` at-Tirmidhi 2825, Book 43, Hadith 99","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the potential consequences of two people conversing privately in the presence of a third person?","id":"tirmidhi-43-562"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"","reference":"Jami` at-Tirmidhi 2826, Book 43, Hadith 100","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration reflect the leadership qualities of Abu Bakr as a Khalifah?","id":"tirmidhi-43-563"},{"hadith-eng":"that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"","reference":"Jami` at-Tirmidhi 2827, Book 43, Hadith 101","grade":"","question #":"question #5","question":"How do narrations contribute to our understanding of the Prophet Muhammad's (ﷺ) family?","id":"tirmidhi-43-564"},{"hadith-eng":"\"I did not hear the Prophet (ﷺ) mentioning both of his parents (that is including both in the saying \"May my father and mother be ransomed for you\") for anyone other than Sa'd bin Abi Waqqas.\"","reference":"Jami` at-Tirmidhi 2828, Book 43, Hadith 102","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the relationship between the Prophet (ﷺ) and Sa'd bin Abi Waqqas from this narration?","id":"tirmidhi-43-565"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) did not mention both of his parents for anyone except Sa'd bin Abi Waqqas. On the Day of Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot! O young man.'\"","reference":"Jami` at-Tirmidhi 2829, Book 43, Hadith 103","grade":"Da'if(Darussalam)","question #":"question #5","question":"In what context did the Prophet Muhammad (ﷺ) use the phrase 'Shoot! O young man' and what does it signify?","id":"tirmidhi-43-566"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) mentioned both of his parents to me on the Day of Uhud.\"","reference":"Jami` at-Tirmidhi 2830, Book 43, Hadith 104","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be learned from the interactions between the Prophet Muhammad (ﷺ) and his companions?","id":"tirmidhi-43-567"},{"hadith-eng":"from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).","reference":"Jami` at-Tirmidhi 2832, Book 43, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #5","question":"Why is the removal of hair significant in the 'Aqiqah ceremony?","id":"tirmidhi-43-568"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2833, Book 43, Hadith 107","grade":"Hasan(Darussalam)","question #":"question #5","question":"What considerations should be taken into account when choosing a name in Islam?","id":"tirmidhi-43-569"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"","reference":"Jami` at-Tirmidhi 2834, Book 43, Hadith 108","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the importance of choosing meaningful names in Islamic culture?","id":"tirmidhi-43-570"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"","reference":"Jami` at-Tirmidhi 2835, Book 43, Hadith 109","grade":"Sahih(Darussalam)","question #":"question #5","question":"What considerations should be taken into account when choosing a name in Islam?","id":"tirmidhi-43-571"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"","reference":"Jami` at-Tirmidhi 2836, Book 43, Hadith 110","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of avoiding names that may lead to negative responses in Islamic culture?","id":"tirmidhi-43-572"},{"hadith-eng":"that Abu Hurairah conveyed to him that the Prophet (ﷺ) said: \"The most despicable (Akhna) name to Allah on the Day of Judgement is that of a man named King of Kings. (Malikil-Amlak).\"","reference":"Jami` at-Tirmidhi 2837, Book 43, Hadith 111","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic teaching guide the selection of appropriate names for individuals?","id":"tirmidhi-43-573"},{"hadith-eng":"that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"","reference":"Jami` at-Tirmidhi 2838, Book 43, Hadith 112","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the criteria for selecting a suitable name in Islam?","id":"tirmidhi-43-574"},{"hadith-eng":"that the Prophet (ﷺ) would change abhorrent names.\"","reference":"Jami` at-Tirmidhi 2839, Book 43, Hadith 113","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the guidelines for choosing a suitable name in Islam?","id":"tirmidhi-43-575"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"","reference":"Jami` at-Tirmidhi 2840, Book 43, Hadith 114","grade":"Sahih(Darussalam)","question #":"question #5","question":"How do the names of the Prophet Muhammad (ﷺ) reflect his mission and role in Islam?","id":"tirmidhi-43-576"},{"hadith-eng":"that the Prophet (ﷺ) prohibited that one use his name and his Kunyah; naming themselves Muhammad Abul-Qasim.","reference":"Jami` at-Tirmidhi 2841, Book 43, Hadith 115","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of naming conventions in Islam regarding the Prophet's name?","id":"tirmidhi-43-577"},{"hadith-eng":"that he said: \"O Messenger of Allah (ﷺ)! If I have a son after you do you think I could name him your Kunyah?\" He said: \"Yes.\" So he said: \"So that was permitted for me.\"","reference":"Jami` at-Tirmidhi 2843, Book 43, Hadith 117","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does consultation with the Prophet (ﷺ) play in personal decisions in Islamic history?","id":"tirmidhi-43-578"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\"","reference":"Jami` at-Tirmidhi 2844, Book 43, Hadith 118","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the characteristics of poetry that can be considered wise?","id":"tirmidhi-43-579"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\".","reference":"Jami` at-Tirmidhi 2845, Book 43, Hadith 119","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the characteristics of poetry that make it a source of wisdom?","id":"tirmidhi-43-580"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"","reference":"Jami` at-Tirmidhi 2846, Book 43, Hadith 120","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does this narration reflect the importance of defending the Prophet Muhammad (ﷺ) in Islam?","id":"tirmidhi-43-581"},{"hadith-eng":"that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"","reference":"Jami` at-Tirmidhi 2847, Book 43, Hadith 122","grade":"Hasan(Darussalam)","question #":"question #5","question":"How can poetry be used as a form of expression in Islamic contexts?","id":"tirmidhi-43-582"},{"hadith-eng":"from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"","reference":"Jami` at-Tirmidhi 2848, Book 43, Hadith 123","grade":"Da'if(Darussalam)","question #":"question #5","question":"How did 'Aishah describe the Prophet Muhammad's (ﷺ) engagement with poetry?","id":"tirmidhi-43-583"},{"hadith-eng":"that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"","reference":"Jami` at-Tirmidhi 2849, Book 43, Hadith 124","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the belief in the eternal nature of Allah affect a Muslim's faith and actions?","id":"tirmidhi-43-584"},{"hadith-eng":"\"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"","reference":"Jami` at-Tirmidhi 2850, Book 43, Hadith 125","grade":"Sahih(Darussalam)","question #":"question #5","question":"In what ways did the Prophet (ﷺ) show his engagement or approval during conversations about Jahiliyyah?","id":"tirmidhi-43-585"},{"hadith-eng":"from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2851, Book 43, Hadith 127","grade":"Sahih(Darussalam)","question #":"question #5","question":"What lessons can be drawn about prioritizing spiritual and moral content over artistic expressions?","id":"tirmidhi-43-586"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"","reference":"Jami` at-Tirmidhi 2852, Book 43, Hadith 126","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the potential dangers of prioritizing poetry over other beneficial knowledge or practices?","id":"tirmidhi-43-587"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah detests the excessive among men, who slaps his tongue around like the cow slaps his tongue.\"","reference":"Jami` at-Tirmidhi 2853, Book 43, Hadith 128","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the behavior of excessive speech relate to the concept of humility in Islam?","id":"tirmidhi-43-588"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"","reference":"Jami` at-Tirmidhi 2854, Book 43, Hadith 129","grade":"Hasan(Darussalam)","question #":"question #5","question":"What measures can be taken to prevent accidents while sleeping in open areas?","id":"tirmidhi-43-589"},{"hadith-eng":"\"I asked 'Aishah and Umm Salamah about which deed did the Messenger of Allah (ﷺ) like to do most. They said: 'Whatever he could do regularly, even if it was little.'\"","reference":"Jami` at-Tirmidhi 2856, Book 43, Hadith 132","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can one incorporate the practice of regular good deeds into daily life according to Islamic principles?","id":"tirmidhi-43-590"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Cover the vessels, tie the water-skins, close the doors, extinguish the torches, for indeed the mischief-makers (vermin) may drag away the wick, causing a fire for the inhabitants of the house.\"","reference":"Jami` at-Tirmidhi 2857, Book 43, Hadith 134","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role do vermin play in causing household fires, and how can this be prevented?","id":"tirmidhi-43-591"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"When you travel through fertile land, then give the camels their fill of the land, and when you travel through drought, then hasten while they are fresh, and when you camp late, then stay away from the road, for indeed it is the route of the beasts and the abode of poisonous vermin in the night.\"","reference":"Jami` at-Tirmidhi 2858, Book 43, Hadith 135","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the potential dangers of camping on the road at night?","id":"tirmidhi-43-592"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"","reference":"Jami` at-Tirmidhi 2736, Book 43, Hadith 1","grade":"Da'if(Darussalam)","question #":"question #6","question":"How does following a funeral contribute to the sense of community in Islam?","id":"tirmidhi-43-593"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"","reference":"Jami` at-Tirmidhi 2737, Book 43, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #6","question":"What actions are recommended for a believer to perform when another believer passes away?","id":"tirmidhi-43-594"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]","reference":"Jami` at-Tirmidhi 2746, Book 43, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the consequence of not covering one's mouth while yawning in Islamic teachings?","id":"tirmidhi-43-595"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"","reference":"Jami` at-Tirmidhi 2756, Book 43, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #6","question":"Why is cutting the pubic hair considered a part of Fitrah in Islam?","id":"tirmidhi-43-596"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"","reference":"Jami` at-Tirmidhi 2757, Book 43, Hadith 27","grade":"Sahih(Darussalam)","question #":"question #6","question":"What are the benefits of performing Intiqas with water as part of personal cleanliness?","id":"tirmidhi-43-597"},{"hadith-eng":"that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"","reference":"Jami` at-Tirmidhi 2801, Book 43, Hadith 74","grade":"Hasan(Darussalam)","question #":"question #6","question":"What is the relationship between faith in the Last Day and personal conduct in social settings?","id":"tirmidhi-43-598"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.","reference":"Jami` at-Tirmidhi 2806, Book 43, Hadith 79","grade":"Sahih(Darussalam)","question #":"question #6","question":"What can be learned about the treatment of animals, such as dogs, in Islamic teachings from this narration?","id":"tirmidhi-43-599"},{"hadith-eng":"\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"","reference":"Jami` at-Tirmidhi 2809, Book 43, Hadith 82","grade":"Sahih(Darussalam)","question #":"question #6","question":"What are the reasons behind the prohibition of wearing gold rings and silk in Islam?","id":"tirmidhi-43-600"},{"hadith-eng":"that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"","reference":"Jami` at-Tirmidhi 2814, Book 43, Hadith 88","grade":"Da'if(Darussalam)","question #":"question #6","question":"How does the presence of a date-palm branch relate to the lifestyle or practices of the Prophet?","id":"tirmidhi-43-601"},{"hadith-eng":"from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).","reference":"Jami` at-Tirmidhi 2832, Book 43, Hadith 106","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the importance of slaughtering an animal for 'Aqiqah in Islam?","id":"tirmidhi-43-602"},{"hadith-eng":"that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"","reference":"Jami` at-Tirmidhi 2847, Book 43, Hadith 122","grade":"Hasan(Darussalam)","question #":"question #6","question":"What does this incident tell us about the Prophet's (ﷺ) leadership and decision-making in unexpected situations?","id":"tirmidhi-43-603"}]