[{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"","reference":"Jami` at-Tirmidhi 2859, Book 44, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the straight path in Islamic teachings?","id":"tirmidhi-44-1"},{"hadith-eng":"that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"","reference":"Jami` at-Tirmidhi 2860, Book 44, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the parable involving a king, a land, a house, and a table-spread in understanding the message of Islam?","id":"tirmidhi-44-2"},{"hadith-eng":"from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"","reference":"Jami` at-Tirmidhi 2861, Book 44, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the line drawn by the Prophet Muhammad (ﷺ) around Abdullah bin Mas'ud?","id":"tirmidhi-44-3"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He completed it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"","reference":"Jami` at-Tirmidhi 2862, Book 44, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #1","question":"What analogy is used to describe the relationship between the Prophet Muhammad and the previous prophets?","id":"tirmidhi-44-4"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"","reference":"Jami` at-Tirmidhi 2863, Book 44, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the five commandments that Allah instructed Yahya bin Zakariyya to follow and teach to the Children of Isra'il?","id":"tirmidhi-44-5"},{"hadith-eng":"(Another chain) with similar in meaning.","reference":"Jami` at-Tirmidhi 2864, Book 44, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narration for a hadith?","id":"tirmidhi-44-6"},{"hadith-eng":"that the Messenger of Allah (ﷺ) narrated: \"The parable of the believer who recites the Qur'an is that of a citron, its fragrance is nice and its taste is nice. The parable of the believer who does not recite the Qur'an is that of a date, it has no smell but its taste is sweet. The parable of the hypocrite who recites the Qur'an is that of basil, its fragrance is nice but its taste is bitter. The parable of the hypocrite who does not recite the Qur'an is that of the colocynth, its smell is better and its taste is bitter.'\"","reference":"Jami` at-Tirmidhi 2865, Book 44, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the characteristics of a believer who recites the Qur'an compared to one who does not?","id":"tirmidhi-44-7"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of the believer is like the plant; the wind does not stop causing it to sway, and the believer does not stop suffering trials. The parable of the hypocrite is that of a cedar tree, it does not give in until it is cut down.\"","reference":"Jami` at-Tirmidhi 2866, Book 44, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of comparing a believer to a plant in terms of facing trials?","id":"tirmidhi-44-8"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"","reference":"Jami` at-Tirmidhi 2867, Book 44, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What qualities of a believer are symbolized by the date-palm tree?","id":"tirmidhi-44-9"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"","reference":"Jami` at-Tirmidhi 2868, Book 44, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What analogy is used to describe the cleansing effect of the five daily prayers?","id":"tirmidhi-44-10"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of my Ummah is that of a rain; it is not known if its beginning is better or its end.\"","reference":"Jami` at-Tirmidhi 2869, Book 44, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of comparing the Ummah to rain in Islamic teachings?","id":"tirmidhi-44-11"},{"hadith-eng":"from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"","reference":"Jami` at-Tirmidhi 2870, Book 44, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of understanding the parable of hope and death in Islamic teachings?","id":"tirmidhi-44-12"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"","reference":"Jami` at-Tirmidhi 2871, Book 44, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"How does the comparison of different religious communities to workers illustrate the concept of divine justice and reward?","id":"tirmidhi-44-13"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"People are but like a hundred camels, a man can not find a mount (suitable to ride upon) among them.\"","reference":"Jami` at-Tirmidhi 2872, Book 44, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does the comparison of people to a hundred camels signify in terms of finding suitable companions or leaders?","id":"tirmidhi-44-14"},{"hadith-eng":"with this chain, and it is similar, but he said: \"You can find a mount among them.\" - from Salim, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"People are but like one hundred camels, you can not find a mount among them - or he said - you can not find but one mount among them.\"","reference":"Jami` at-Tirmidhi 2873, Book 44, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #1","question":"What does the comparison of people to a hundred camels signify in terms of finding reliable individuals?","id":"tirmidhi-44-15"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Parable of myself and that of my Ummah is that of a man who kindled a fire, and the flies and moths began flying into it - and I am trying to prevent you from diving into it.\"","reference":"Jami` at-Tirmidhi 2874, Book 44, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of the parable of a man kindling a fire in relation to the Prophet's role with his Ummah?","id":"tirmidhi-44-16"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"","reference":"Jami` at-Tirmidhi 2859, Book 44, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"How are the legal limitations of Allah represented in the parable of the straight path?","id":"tirmidhi-44-17"},{"hadith-eng":"that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"","reference":"Jami` at-Tirmidhi 2860, Book 44, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the vision of the Prophet Muhammad (ﷺ) relate to the concept of calling people to Islam?","id":"tirmidhi-44-18"},{"hadith-eng":"from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"","reference":"Jami` at-Tirmidhi 2861, Book 44, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #2","question":"What can be inferred about the nature of the beings that appeared to Abdullah bin Mas'ud during the night?","id":"tirmidhi-44-19"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He completed it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"","reference":"Jami` at-Tirmidhi 2862, Book 44, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the metaphor of a house with a missing brick illustrate the role of Prophet Muhammad in the line of prophets?","id":"tirmidhi-44-20"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"","reference":"Jami` at-Tirmidhi 2863, Book 44, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why is it important not to associate anything with Allah in worship?","id":"tirmidhi-44-21"},{"hadith-eng":"(Another chain) with similar in meaning.","reference":"Jami` at-Tirmidhi 2864, Book 44, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the presence of similar meanings in different narrations affect the understanding of a hadith?","id":"tirmidhi-44-22"},{"hadith-eng":"that the Messenger of Allah (ﷺ) narrated: \"The parable of the believer who recites the Qur'an is that of a citron, its fragrance is nice and its taste is nice. The parable of the believer who does not recite the Qur'an is that of a date, it has no smell but its taste is sweet. The parable of the hypocrite who recites the Qur'an is that of basil, its fragrance is nice but its taste is bitter. The parable of the hypocrite who does not recite the Qur'an is that of the colocynth, its smell is better and its taste is bitter.'\"","reference":"Jami` at-Tirmidhi 2865, Book 44, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the hypocrite who recites the Qur'an described in terms of fragrance and taste?","id":"tirmidhi-44-23"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of the believer is like the plant; the wind does not stop causing it to sway, and the believer does not stop suffering trials. The parable of the hypocrite is that of a cedar tree, it does not give in until it is cut down.\"","reference":"Jami` at-Tirmidhi 2866, Book 44, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the analogy of a cedar tree relate to the characteristics of a hypocrite?","id":"tirmidhi-44-24"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"","reference":"Jami` at-Tirmidhi 2867, Book 44, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why might the date-palm tree be compared to a believer in Islamic teachings?","id":"tirmidhi-44-25"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"","reference":"Jami` at-Tirmidhi 2868, Book 44, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"How do the five daily prayers contribute to the purification of a believer?","id":"tirmidhi-44-26"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of my Ummah is that of a rain; it is not known if its beginning is better or its end.\"","reference":"Jami` at-Tirmidhi 2869, Book 44, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the metaphor of rain relate to the qualities or characteristics of the Muslim community?","id":"tirmidhi-44-27"},{"hadith-eng":"from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"","reference":"Jami` at-Tirmidhi 2870, Book 44, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the concept of hope relate to the proximity of death in Islamic belief?","id":"tirmidhi-44-28"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"","reference":"Jami` at-Tirmidhi 2871, Book 44, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of the time period between Salat Al-'Asr and sunset in relation to the previous nations?","id":"tirmidhi-44-29"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"People are but like a hundred camels, a man can not find a mount (suitable to ride upon) among them.\"","reference":"Jami` at-Tirmidhi 2872, Book 44, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this analogy reflect on the rarity of finding trustworthy or capable individuals?","id":"tirmidhi-44-30"},{"hadith-eng":"with this chain, and it is similar, but he said: \"You can find a mount among them.\" - from Salim, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"People are but like one hundred camels, you can not find a mount among them - or he said - you can not find but one mount among them.\"","reference":"Jami` at-Tirmidhi 2873, Book 44, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does this hadith illustrate the rarity of finding trustworthy and capable individuals?","id":"tirmidhi-44-31"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Parable of myself and that of my Ummah is that of a man who kindled a fire, and the flies and moths began flying into it - and I am trying to prevent you from diving into it.\"","reference":"Jami` at-Tirmidhi 2874, Book 44, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the analogy of flies and moths relate to human behavior and spiritual guidance?","id":"tirmidhi-44-32"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"","reference":"Jami` at-Tirmidhi 2859, Book 44, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do the callers play in guiding individuals on the straight path?","id":"tirmidhi-44-33"},{"hadith-eng":"that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"","reference":"Jami` at-Tirmidhi 2860, Book 44, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the house in the parable symbolize in the context of Islamic teachings?","id":"tirmidhi-44-34"},{"hadith-eng":"from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"","reference":"Jami` at-Tirmidhi 2861, Book 44, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the hadith illustrate the concept of the Prophet's heart being awake while his eyes sleep?","id":"tirmidhi-44-35"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He completed it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"","reference":"Jami` at-Tirmidhi 2862, Book 44, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #3","question":"What significance does the missing brick hold in the context of prophetic succession?","id":"tirmidhi-44-36"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"","reference":"Jami` at-Tirmidhi 2863, Book 44, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of performing Salat without turning away?","id":"tirmidhi-44-37"},{"hadith-eng":"(Another chain) with similar in meaning.","reference":"Jami` at-Tirmidhi 2864, Book 44, Hadith 6","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of different narrators in preserving the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-44-38"},{"hadith-eng":"that the Messenger of Allah (ﷺ) narrated: \"The parable of the believer who recites the Qur'an is that of a citron, its fragrance is nice and its taste is nice. The parable of the believer who does not recite the Qur'an is that of a date, it has no smell but its taste is sweet. The parable of the hypocrite who recites the Qur'an is that of basil, its fragrance is nice but its taste is bitter. The parable of the hypocrite who does not recite the Qur'an is that of the colocynth, its smell is better and its taste is bitter.'\"","reference":"Jami` at-Tirmidhi 2865, Book 44, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #3","question":"What analogy is used to describe the believer who does not recite the Qur'an?","id":"tirmidhi-44-39"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of the believer is like the plant; the wind does not stop causing it to sway, and the believer does not stop suffering trials. The parable of the hypocrite is that of a cedar tree, it does not give in until it is cut down.\"","reference":"Jami` at-Tirmidhi 2866, Book 44, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lessons can be drawn from the resilience of a believer when faced with challenges?","id":"tirmidhi-44-40"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"","reference":"Jami` at-Tirmidhi 2867, Book 44, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the concept of shyness or hesitation appear in the context of learning and sharing knowledge?","id":"tirmidhi-44-41"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"","reference":"Jami` at-Tirmidhi 2868, Book 44, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of performing prayers regularly in Islam?","id":"tirmidhi-44-42"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of my Ummah is that of a rain; it is not known if its beginning is better or its end.\"","reference":"Jami` at-Tirmidhi 2869, Book 44, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the potential of different generations within the Ummah from this comparison?","id":"tirmidhi-44-43"},{"hadith-eng":"from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"","reference":"Jami` at-Tirmidhi 2870, Book 44, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be learned from the Prophet's use of parables to convey messages?","id":"tirmidhi-44-44"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"","reference":"Jami` at-Tirmidhi 2871, Book 44, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does this narration explain the distribution of rewards among different communities?","id":"tirmidhi-44-45"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"People are but like a hundred camels, a man can not find a mount (suitable to ride upon) among them.\"","reference":"Jami` at-Tirmidhi 2872, Book 44, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lessons can be drawn about human nature and the qualities of individuals from this analogy?","id":"tirmidhi-44-46"},{"hadith-eng":"with this chain, and it is similar, but he said: \"You can find a mount among them.\" - from Salim, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"People are but like one hundred camels, you can not find a mount among them - or he said - you can not find but one mount among them.\"","reference":"Jami` at-Tirmidhi 2873, Book 44, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lesson can be drawn about human nature from the analogy of camels in this narration?","id":"tirmidhi-44-47"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Parable of myself and that of my Ummah is that of a man who kindled a fire, and the flies and moths began flying into it - and I am trying to prevent you from diving into it.\"","reference":"Jami` at-Tirmidhi 2874, Book 44, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #3","question":"What lessons can be drawn from the Prophet's efforts to prevent his followers from harm?","id":"tirmidhi-44-48"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"","reference":"Jami` at-Tirmidhi 2859, Book 44, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the meaning of the abode of peace in the context of this parable?","id":"tirmidhi-44-49"},{"hadith-eng":"that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"","reference":"Jami` at-Tirmidhi 2860, Book 44, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does the messenger play in the parable, and how does it relate to the Prophet Muhammad (ﷺ)?","id":"tirmidhi-44-50"},{"hadith-eng":"from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"","reference":"Jami` at-Tirmidhi 2861, Book 44, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the parable mentioned by the angels, and what does it signify in terms of divine invitation and response?","id":"tirmidhi-44-51"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He completed it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"","reference":"Jami` at-Tirmidhi 2862, Book 44, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this narration highlight the completion of prophethood with Prophet Muhammad?","id":"tirmidhi-44-52"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"","reference":"Jami` at-Tirmidhi 2863, Book 44, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is fasting compared to a sachet of musk in this narration?","id":"tirmidhi-44-53"},{"hadith-eng":"that the Messenger of Allah (ﷺ) narrated: \"The parable of the believer who recites the Qur'an is that of a citron, its fragrance is nice and its taste is nice. The parable of the believer who does not recite the Qur'an is that of a date, it has no smell but its taste is sweet. The parable of the hypocrite who recites the Qur'an is that of basil, its fragrance is nice but its taste is bitter. The parable of the hypocrite who does not recite the Qur'an is that of the colocynth, its smell is better and its taste is bitter.'\"","reference":"Jami` at-Tirmidhi 2865, Book 44, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of fragrance and taste in the parables used for believers and hypocrites?","id":"tirmidhi-44-54"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of the believer is like the plant; the wind does not stop causing it to sway, and the believer does not stop suffering trials. The parable of the hypocrite is that of a cedar tree, it does not give in until it is cut down.\"","reference":"Jami` at-Tirmidhi 2866, Book 44, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways do trials and tribulations affect the life of a believer according to this analogy?","id":"tirmidhi-44-55"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"","reference":"Jami` at-Tirmidhi 2867, Book 44, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be learned from the interaction between Abdullah and his father Umar regarding expressing one's thoughts?","id":"tirmidhi-44-56"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"","reference":"Jami` at-Tirmidhi 2868, Book 44, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of cleanliness relate to spiritual purification in Islamic teachings?","id":"tirmidhi-44-57"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of my Ummah is that of a rain; it is not known if its beginning is better or its end.\"","reference":"Jami` at-Tirmidhi 2869, Book 44, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does this analogy reflect on the unpredictability of the virtues of different times in the Ummah?","id":"tirmidhi-44-58"},{"hadith-eng":"from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"","reference":"Jami` at-Tirmidhi 2870, Book 44, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the acknowledgment of Allah and His Messenger's knowledge reflect in the companions' response?","id":"tirmidhi-44-59"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"","reference":"Jami` at-Tirmidhi 2871, Book 44, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"What lesson can be learned about the nature of Allah's blessings and generosity from this analogy?","id":"tirmidhi-44-60"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"People are but like a hundred camels, a man can not find a mount (suitable to ride upon) among them.\"","reference":"Jami` at-Tirmidhi 2872, Book 44, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this saying of the Prophet (ﷺ) relate to the challenges of leadership and responsibility?","id":"tirmidhi-44-61"},{"hadith-eng":"with this chain, and it is similar, but he said: \"You can find a mount among them.\" - from Salim, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"People are but like one hundred camels, you can not find a mount among them - or he said - you can not find but one mount among them.\"","reference":"Jami` at-Tirmidhi 2873, Book 44, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does this saying of the Prophet (ﷺ) reflect on the qualities needed for leadership or responsibility?","id":"tirmidhi-44-62"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Parable of myself and that of my Ummah is that of a man who kindled a fire, and the flies and moths began flying into it - and I am trying to prevent you from diving into it.\"","reference":"Jami` at-Tirmidhi 2874, Book 44, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #4","question":"In what ways does this parable illustrate the challenges faced by the Prophet in guiding his community?","id":"tirmidhi-44-63"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"","reference":"Jami` at-Tirmidhi 2859, Book 44, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of breaching the Hudud relate to the lifting of the curtain in the parable?","id":"tirmidhi-44-64"},{"hadith-eng":"that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"","reference":"Jami` at-Tirmidhi 2860, Book 44, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the parable illustrate the consequences of responding or not responding to the call of Islam?","id":"tirmidhi-44-65"},{"hadith-eng":"from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"","reference":"Jami` at-Tirmidhi 2861, Book 44, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role do angels play in the context of this hadith and what message do they convey?","id":"tirmidhi-44-66"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He completed it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"","reference":"Jami` at-Tirmidhi 2862, Book 44, Hadith 4","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the house symbolize in the analogy used by the Prophet Muhammad?","id":"tirmidhi-44-67"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"","reference":"Jami` at-Tirmidhi 2863, Book 44, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the parable used to describe the importance of giving charity?","id":"tirmidhi-44-68"},{"hadith-eng":"that the Messenger of Allah (ﷺ) narrated: \"The parable of the believer who recites the Qur'an is that of a citron, its fragrance is nice and its taste is nice. The parable of the believer who does not recite the Qur'an is that of a date, it has no smell but its taste is sweet. The parable of the hypocrite who recites the Qur'an is that of basil, its fragrance is nice but its taste is bitter. The parable of the hypocrite who does not recite the Qur'an is that of the colocynth, its smell is better and its taste is bitter.'\"","reference":"Jami` at-Tirmidhi 2865, Book 44, Hadith 7","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the hadith differentiate between the spiritual states of believers and hypocrites?","id":"tirmidhi-44-69"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of the believer is like the plant; the wind does not stop causing it to sway, and the believer does not stop suffering trials. The parable of the hypocrite is that of a cedar tree, it does not give in until it is cut down.\"","reference":"Jami` at-Tirmidhi 2866, Book 44, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the metaphor of wind affecting a plant illustrate the experiences of a believer?","id":"tirmidhi-44-70"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"","reference":"Jami` at-Tirmidhi 2867, Book 44, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What significance does the Prophet Muhammad (ﷺ) place on the characteristics of certain trees in relation to human behavior?","id":"tirmidhi-44-71"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"","reference":"Jami` at-Tirmidhi 2868, Book 44, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the impact of regular prayer on a person's sins according to Islamic belief?","id":"tirmidhi-44-72"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The parable of my Ummah is that of a rain; it is not known if its beginning is better or its end.\"","reference":"Jami` at-Tirmidhi 2869, Book 44, Hadith 12","grade":"Da'if(Darussalam)","question #":"question #5","question":"What lessons can be drawn about humility and judgment from the comparison of the Ummah to rain?","id":"tirmidhi-44-73"},{"hadith-eng":"from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"","reference":"Jami` at-Tirmidhi 2870, Book 44, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the importance of recognizing the closeness of death in shaping one's actions and mindset?","id":"tirmidhi-44-74"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"","reference":"Jami` at-Tirmidhi 2871, Book 44, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration address the feelings of dissatisfaction among the Jews and Christians regarding their rewards?","id":"tirmidhi-44-75"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"People are but like a hundred camels, a man can not find a mount (suitable to ride upon) among them.\"","reference":"Jami` at-Tirmidhi 2872, Book 44, Hadith 15","grade":"Sahih(Darussalam)","question #":"question #5","question":"What insights does this analogy provide about the qualities one should seek in others?","id":"tirmidhi-44-76"},{"hadith-eng":"with this chain, and it is similar, but he said: \"You can find a mount among them.\" - from Salim, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"People are but like one hundred camels, you can not find a mount among them - or he said - you can not find but one mount among them.\"","reference":"Jami` at-Tirmidhi 2873, Book 44, Hadith 16","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does the metaphor of camels teach about the challenges in finding dependable people?","id":"tirmidhi-44-77"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"The Parable of myself and that of my Ummah is that of a man who kindled a fire, and the flies and moths began flying into it - and I am trying to prevent you from diving into it.\"","reference":"Jami` at-Tirmidhi 2874, Book 44, Hadith 17","grade":"Sahih(Darussalam)","question #":"question #5","question":"What does this narration suggest about the nature of temptation and the Prophet's concern for his Ummah?","id":"tirmidhi-44-78"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"","reference":"Jami` at-Tirmidhi 2859, Book 44, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #6","question":"What does the parable suggest about Allah's guidance to the straight path?","id":"tirmidhi-44-79"},{"hadith-eng":"that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"","reference":"Jami` at-Tirmidhi 2860, Book 44, Hadith 2","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the ultimate reward for those who respond to the call of the messenger in the parable?","id":"tirmidhi-44-80"},{"hadith-eng":"from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"","reference":"Jami` at-Tirmidhi 2861, Book 44, Hadith 3","grade":"Da'if(Darussalam)","question #":"question #6","question":"How does this narration emphasize the importance of responding to Allah's invitation to Paradise?","id":"tirmidhi-44-81"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"","reference":"Jami` at-Tirmidhi 2863, Book 44, Hadith 5","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does the remembrance of Allah serve as protection against Ash-Shaitan?","id":"tirmidhi-44-82"},{"hadith-eng":"that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"","reference":"Jami` at-Tirmidhi 2871, Book 44, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #6","question":"What does this narration teach about the fairness of Allah's distribution of rewards and blessings?","id":"tirmidhi-44-83"}]