[{"hadith-eng":"\"I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah.\" He said: \"He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!'\" He said: \"I said t myself: Woe is me! Perhaps something has been revealed about me!'\" He said: \"So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'\"","reference":"Jami` at-Tirmidhi 617, Book 7, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of wealth and its accountability on the Day of Judgment?","id":"tirmidhi-7-1"},{"hadith-eng":"that the Prophet said: \"When you pay the Zakat you have fulfilled what is required of you.\"","reference":"Jami` at-Tirmidhi 618, Book 7, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of paying Zakat in fulfilling one's religious obligations?","id":"tirmidhi-7-2"},{"hadith-eng":"\"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"","reference":"Jami` at-Tirmidhi 619, Book 7, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the five daily prayers required in Islam?","id":"tirmidhi-7-3"},{"hadith-eng":"the Messenger of Allah said: \"I have exempted charity on horses and slaves. So bring charity for silver, one Dirham for every forty Dirham. There is nothing for me (to collect) on one hundred and ninety Dirham, so when it reaches two hundred, then five Dirham of it (are due).\"","reference":"Jami` at-Tirmidhi 620, Book 7, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on charity for horses and slaves in Islamic teachings?","id":"tirmidhi-7-4"},{"hadith-eng":"\"The Messenger of Allah had a letter written about charity, but he had not dispatched it to his governors until he died; he kept it with him along with his sword. When he died, Abu Bakr implemented it until he died, as did Umar until he died. In it was: 'A sheep (is due) on five camels, two sheeps on ten, three sheeps on fifteen, four sheeps for twenty, a Bint Makhad on twenty-five to thirty-five. When it is more than that, then a Bint Labun, (is due, till the number of the camels reaches) forty-five. When it is more than that, then a Hiqqah until sixty. When it is more than that, then a Jadhah until seventy-five. When it is more than one hundred and twenty, then a Hiqqah on every fifty, and a Bint Labun on every forty. For sheep; one sheep (is due) for every forty sheeps until one hundred and twenty. When it is more than that, then two sheeps until two hundred. When it is more than that, then three sheeps until three hundred sheep. When it is more than three hundred sheep, then a sheep on every hundred sheep. Then there is nothing until it reaches four hundred. There is no combining the (property of) individuals nor separating the collective (property) fearing Sadaqah. And fr whatever is mixed together that two own, then they are to refer to the total. Neither an old or defective (animal) may be taken for charity.\"","reference":"Jami` at-Tirmidhi 621, Book 7, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidelines are provided for the distribution of charity on livestock in Islamic teachings?","id":"tirmidhi-7-5"},{"hadith-eng":"the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"","reference":"Jami` at-Tirmidhi 622, Book 7, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the terms 'Tabi' and 'Tabi'ah' in Islamic jurisprudence?","id":"tirmidhi-7-6"},{"hadith-eng":"\"The Prophet sent me to Yemen and ordered me to collect a Tabi or a Tabi'ah on every thirty cows, a Musinnah on every forty, a Dinar for every Halim, or its equivalent of Ma'afir.\"Abu Eisa said: This Hadith is Hasan. Some of them reported this Hadith from Sufyan, from Al-A'mash, from Abu Wa'il, from Masruq: \"The Prophet sent Mu'adh to Yemen and ordered him to take...\" and this is more authentic","reference":"Jami` at-Tirmidhi 623, Book 7, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #1","question":"What was the role of Mu'adh bin Jabal when he was sent to Yemen by the Prophet?","id":"tirmidhi-7-7"},{"hadith-eng":"Muhammad bin Ja'far narrated to us, from Shu'bah, from Amr bin Murrah who said: \"I asked Abu Ubaidah bin Abdullah: 'Did you remember anything from Abdullah?' He said, 'No'\"","reference":"Jami` at-Tirmidhi 624, Book 7, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of verifying the authenticity of a hadith through direct transmission?","id":"tirmidhi-7-8"},{"hadith-eng":"the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"","reference":"Jami` at-Tirmidhi 625, Book 7, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of inviting people to the testimony of faith in Islam?","id":"tirmidhi-7-9"},{"hadith-eng":"the Prophet said: \"There is no charity due on less than five camels, and there is no charity due on what is less than five Uqiyah (of silver), and there is no charity due on what is less than five Wasaq.\"","reference":"Jami` at-Tirmidhi 626, Book 7, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the minimum number of camels required for charity to be obligatory?","id":"tirmidhi-7-10"},{"hadith-eng":"the Prophet said (similar t Hadith no. 626).","reference":"Jami` at-Tirmidhi 627, Book 7, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Abu Sa'eed Al-Khudri in the context of hadith narration?","id":"tirmidhi-7-11"},{"hadith-eng":"the Messenger of Allah said:  \"There is no charity due from a Muslim for his horse nor his slave.\"","reference":"Jami` at-Tirmidhi 628, Book 7, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on giving charity for one's horse in Islam?","id":"tirmidhi-7-12"},{"hadith-eng":"the Messenger of Allah said: \"A Ziqq is due for every ten Ziqq of honey.\"","reference":"Jami` at-Tirmidhi 629, Book 7, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of paying a due or tax on honey in Islamic teachings?","id":"tirmidhi-7-13"},{"hadith-eng":"Nafi said: \"Umar bin Adbul-Aziz asked me about charity due on honey, so I said to him: 'We do not have honey that we could give charity from, but Al-Mughirah bin Hakim informed us that he (pbuh) said: 'There is no charity due on honey.' So Umar said: 'That is fair enough for me.' So he wrote to the people that is be lifted, meaning (the duty of paying it) from them.\"","reference":"Jami` at-Tirmidhi 630, Book 7, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on charity due on honey in Islamic jurisprudence?","id":"tirmidhi-7-14"},{"hadith-eng":"the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"","reference":"Jami` at-Tirmidhi 631, Book 7, Hadith 15","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of the passage of a full year in the context of paying Zakat on wealth?","id":"tirmidhi-7-15"},{"hadith-eng":"\"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed while it is in his possession.\"","reference":"Jami` at-Tirmidhi 632, Book 7, Hadith 16","grade":"","question #":"question #1","question":"What is the significance of the passage of a full year in relation to the obligation of paying Zakat on wealth?","id":"tirmidhi-7-16"},{"hadith-eng":"the Messenger of Allah said: \"Two Qiblahs in one land are of no benefit, and there is no Jizyah upon the Muslims.\"","reference":"Jami` at-Tirmidhi 633, Book 7, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of having only one Qiblah in a land according to Islamic teachings?","id":"tirmidhi-7-17"},{"hadith-eng":"(A similar narration as no. 633.)","reference":"Jami` at-Tirmidhi 634, Book 7, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of Ibn Abbas in the context of hadith narration?","id":"tirmidhi-7-18"},{"hadith-eng":"\"The Messenger of Allah delivered a sermon to us, and said: 'O you women! Give charity, even if it is from your jewelry, for indeed you will make up most of the people of Hell on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 635, Book 7, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of charity in Islam, especially for women?","id":"tirmidhi-7-19"},{"hadith-eng":"Zainab, the wife of Abdullah narrated similarly from the Prophet.","reference":"Jami` at-Tirmidhi 636, Book 7, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #1","question":"Who was Zainab in relation to Abdullah and what role did she play in narrating hadiths?","id":"tirmidhi-7-20"},{"hadith-eng":"that two women came to the Messenger of Allah, and they each had a bracelet of gold on their forearms. So he said to them: \"Have you paid their Zakat?\" They said, \"No.\" The Messenger of Allah said to them: \"Would you like for Allah to fashion then into two bracelets of Fire?\" They said, \"No.\" He said: \"Then pay its Zakat.\"","reference":"Jami` at-Tirmidhi 637, Book 7, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of paying Zakat on personal possessions such as jewelry?","id":"tirmidhi-7-21"},{"hadith-eng":"Mu'adh had written to the Prophet to ask him about greens - which is \"herbs\" - so he (pbuh) said, \"There is nothing due on them.\"","reference":"Jami` at-Tirmidhi 638, Book 7, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the ruling on the obligation of zakat on herbs and greens in Islam?","id":"tirmidhi-7-22"},{"hadith-eng":"the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"","reference":"Jami` at-Tirmidhi 639, Book 7, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of the Ushr in Islamic teachings regarding agriculture?","id":"tirmidhi-7-23"},{"hadith-eng":"the Messenger of Allah instituted the Ushr of what was watered by the heavens and steams, or through natural channels, and half of the Ushr for what is watered by irrigation.","reference":"Jami` at-Tirmidhi 640, Book 7, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Ushr in Islamic taxation?","id":"tirmidhi-7-24"},{"hadith-eng":"the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"","reference":"Jami` at-Tirmidhi 641, Book 7, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #1","question":"What responsibilities does a guardian have towards the wealth of an orphan?","id":"tirmidhi-7-25"},{"hadith-eng":"the Messenger of Allah said: \"The injuries caused by the animal are without liability, and mines are without liability, and wells are without liability, and the Khumus is due on Rikaz.\"","reference":"Jami` at-Tirmidhi 642, Book 7, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of injuries caused by animals in Islamic law?","id":"tirmidhi-7-26"},{"hadith-eng":"\"Sahl bin Abi Hathmah came to a gathering of ours, and he narrated that the Messenger of Allah would say: \"When you make an assessment, then take it and leave a third, if you do not leave a third, then leave a quarter.\"","reference":"Jami` at-Tirmidhi 643, Book 7, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #1","question":"What guidance does Islam provide on making assessments in transactions?","id":"tirmidhi-7-27"},{"hadith-eng":"the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"","reference":"Jami` at-Tirmidhi 644, Book 7, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #1","question":"How is the zakat on grapevines assessed according to Islamic teachings?","id":"tirmidhi-7-28"},{"hadith-eng":"\"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"","reference":"Jami` at-Tirmidhi 645, Book 7, Hadith 29","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of working in collecting charity according to Islamic teachings?","id":"tirmidhi-7-29"},{"hadith-eng":"the Messenger of Allah said: \"The one who commits transgression with charity is like the one who does not pay it.\"","reference":"Jami` at-Tirmidhi 646, Book 7, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the consequence of misusing or misappropriating charity in Islam?","id":"tirmidhi-7-30"},{"hadith-eng":"the Prophet said: \"When the charity collector comes to you, then he should not depart from you except while pleased.\"","reference":"Jami` at-Tirmidhi 647, Book 7, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of ensuring that a charity collector leaves a community feeling satisfied?","id":"tirmidhi-7-31"},{"hadith-eng":"similar (narration to no. 647 with a different chain) from the Prophet.","reference":"Jami` at-Tirmidhi 648, Book 7, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of different chains of narration in understanding hadiths?","id":"tirmidhi-7-32"},{"hadith-eng":"\"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"","reference":"Jami` at-Tirmidhi 649, Book 7, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the role of charity collectors in distributing wealth in an Islamic society?","id":"tirmidhi-7-33"},{"hadith-eng":"the Messenger of Allah said: \"Whoever begs from the people while he has what he needs, he will come on the Day of Judgment and his begging with be scratches or lacerations, or bite marks on his face.\" They said: \"O Messenger of Allah! 'How much is it that one needs?' He said: 'Fifty Dirham, or their value in gold.'\"","reference":"Jami` at-Tirmidhi 650, Book 7, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the consequences of begging without genuine need according to Islamic teachings?","id":"tirmidhi-7-34"},{"hadith-eng":"Yahya bin Adam narrated to us, Sufyan narrated this Hadith to us from Hakim bin Jubair. So Abdullah bin Uthman, the companion of Shu'bah said to him (Sufyan): \"If only someone besides Hakim had narrated this (Hadith).\" Sufyan said to him, \"So what is with Hakim; Shu'bah would not narrate from him?\" He said: \"Yes.\" So Sufyan said: \"I heard Zubaid narrating this from Muhammad bin Abdur-Rahman bin Yazid.\"","reference":"Jami` at-Tirmidhi 651, Book 7, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of verifying the reliability of narrators in the transmission of hadiths?","id":"tirmidhi-7-35"},{"hadith-eng":"the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"","reference":"Jami` at-Tirmidhi 652, Book 7, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #1","question":"Who is eligible to receive charity according to Islamic teachings?","id":"tirmidhi-7-36"},{"hadith-eng":"\"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"","reference":"Jami` at-Tirmidhi 653, Book 7, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #1","question":"What are the conditions under which begging is considered lawful in Islam?","id":"tirmidhi-7-37"},{"hadith-eng":"There is another chain with a similar narration.","reference":"Jami` at-Tirmidhi 654, Book 7, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of having multiple chains of narration in hadith literature?","id":"tirmidhi-7-38"},{"hadith-eng":"\"During the time of the Messenger of Allah, a man suffered a loss on fruits that he had sold, resulting in more debt. The Messenger of Allah said: 'Give him charity.' So the people gave him charity but it did not cover his debt. So the Messenger of Allah said to his debtors: 'Take what you have and there is nothing for you but that.'\"","reference":"Jami` at-Tirmidhi 655, Book 7, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of charity in alleviating financial distress according to Islamic teachings?","id":"tirmidhi-7-39"},{"hadith-eng":"\"When something was brought to him, the Messenger of Allah would ask: 'Is this charity or a gift?' If they said: 'Charity.' He would not eat it, and if they said, 'A gift' he would eat it.\"","reference":"Jami` at-Tirmidhi 656, Book 7, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the distinction between charity and a gift in Islamic teachings?","id":"tirmidhi-7-40"},{"hadith-eng":"the Messenger of Allah sent a man from Banu Makhzun to collect charity, so he said to Abu Rafi: \"Accompany me so that perhaps you may have some of it.\" So he said: \"Not until I ask the Messenger of Allah.\" So he went to the Prophet to ask him, and he said: \"Charity is not lawful for us, and to be the Mawda of a people to be the same as them.\"","reference":"Jami` at-Tirmidhi 657, Book 7, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on accepting charity for certain individuals in Islam?","id":"tirmidhi-7-41"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"","reference":"Jami` at-Tirmidhi 658, Book 7, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of breaking the fast with dried dates in Islamic tradition?","id":"tirmidhi-7-42"},{"hadith-eng":"she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)","reference":"Jami` at-Tirmidhi 659, Book 7, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #1","question":"What additional duties do wealthy individuals have aside from paying Zakat?","id":"tirmidhi-7-43"},{"hadith-eng":"the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"","reference":"Jami` at-Tirmidhi 660, Book 7, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #1","question":"What additional financial obligations might a Muslim have beyond paying Zakat?","id":"tirmidhi-7-44"},{"hadith-eng":"the Messenger of Allah said: \"None gives charity from Tayyib - and Allah does not accept but Tayyib - but that Ar-Rahman accepts it with His Right (Hand). Even if it is a date, it is nurtured in the Hand of Ar-Rahman until it is greater than a mountain, just as one of you nurtures his foal or young camel.\"","reference":"Jami` at-Tirmidhi 661, Book 7, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of giving charity from pure and lawful earnings in Islam?","id":"tirmidhi-7-45"},{"hadith-eng":"the Messenger of Allah said: \"Indeed Allah accepts charity, and He accepts it with His Right (Hand) to nurture it for one of you, just like one of you would nurture his foal, until the bite (of food) becomes as large as Uhud.\" The Book of Allah, the Mighty and Sublime testifies to that: 'He accepts repentance from His worshipers, and accepts charity.'And: 'Allah will destroy Riba and give increase for charity.'1And: 'Allah will destroy Riba and will give increase for charity.'2(Abu 'Eisa) said: This Hadith is (Hasan) Sahih. It has been reported from'Aishah from the Prophet similarly. More than one of the people of knowledge have spoken about this Hadith, and the narrations that resemble it about the Attributes\nand the Descent of the Lord, Blessed and Most High, every night to the lowest Heaven. They said: \"The narrations about these are affirmed and should be believed in without misinterpreting them nor saying 'how'.\" It has been reported\nlike this from Malik (bin Anas), Suf'ãn bin 'Uyainah, 'Abdullãh bin A1-Mubarak; they would say about these Hadith: They are conveyed without saying how. This is the view of the people of knowledge among Ahl As-Sunnah wal-Jama'ah. As for\nthe Jahmiyyah, they reject these narrations and they say that this is\nTashbih.3And in other places in His Book, Allah, Blessed and Most\nHigh is He, has mentioned the Hand, the Hearing, the Seeing, so the Jahmiyyah misinterpret these Ayãt and give them interpretations other than the interpretations of the people of knowledge. They say that Allah did not create Adam with His Hand, and they say the meaning of Hand is merely power. Isaq bin Ibrahim said: At-Tashbih is only when one says 'Hand; like a hand or similar to a hand' or 'Hearing; like hearing or similar to hearing.' So\nwhen one says 'Hearing; like hearing or similar to hearing' then this is the Tashbih. As for when one says as Allah (Most High) said, Hand, Hearing, Seeing, and he does not say 'how' nor say 'similar to hearing' nor 'like hearing' then this is not Tashbih. It is merely as Allah, Blessed and Most High is He said: 'There is nothing like Him, and He is the All-Hearing, the All-Seeing.'(Ash-Shüra 42:11).1: At-Tawbah 9:104.2: Al-Baqarah 2:276.3: Anthropomorphism, resembling Allah to creatures.","reference":"Jami` at-Tirmidhi 662, Book 7, Hadith 46","grade":"Abu Eisa (at-Tirmidhi) said: This Hadith is Hasan Sahih.(Darussalam)","question #":"question #1","question":"How does Allah nurture charity given by a believer according to Islamic teachings?","id":"tirmidhi-7-46"},{"hadith-eng":"the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"","reference":"Jami` at-Tirmidhi 663, Book 7, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of fasting during the month of Sha'ban in relation to Ramadan?","id":"tirmidhi-7-47"},{"hadith-eng":"the Messenger of Allah said: \"Indeed charity extinguishes the Lord's anger and it protects against the evil death.\"","reference":"Jami` at-Tirmidhi 664, Book 7, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of charity in Islam in relation to divine displeasure?","id":"tirmidhi-7-48"},{"hadith-eng":"Umm Bujaid - and she was one of those who gave the pledge to the Prophet - she said to the Messenger of Allah: \"There is a needy person who stands outside my door, but I cannot find anything to give to him.\" So the Messenger of Allah said to her: \"If you do not find anything to give him except a burnt trotter then hand it over to him.\"","reference":"Jami` at-Tirmidhi 665, Book 7, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of giving charity, even if it is a small or seemingly insignificant item?","id":"tirmidhi-7-49"},{"hadith-eng":"\"The Messenger of Allah gave to me on the Day of Hunain, and he was the most hated creature to me. But he did not stop giving to me until he was the most loved creature to me.\"","reference":"Jami` at-Tirmidhi 666, Book 7, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #1","question":"How can generosity change a person's perception of someone they initially disliked?","id":"tirmidhi-7-50"},{"hadith-eng":"\"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"","reference":"Jami` at-Tirmidhi 667, Book 7, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on performing acts of worship on behalf of a deceased person in Islam?","id":"tirmidhi-7-51"},{"hadith-eng":"Umar gave a horse to be used in the cause of Allah. Then he saw it being sold, so he wanted to buy it, but the Prophet said: \"Do not take back what you have given in charity.\"","reference":"Jami` at-Tirmidhi 668, Book 7, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the ruling on taking back something that has been given in charity?","id":"tirmidhi-7-52"},{"hadith-eng":"a man said: \"O Messenger of Allah! My mother died, will it benefit her if I give charity on her behalf?\" He said: 'Yes.' He said: 'I have a Makhraf, so bear witness that I have given it in charity on her behalf.'\"","reference":"Jami` at-Tirmidhi 669, Book 7, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #1","question":"Can giving charity on behalf of a deceased person benefit them in the hereafter?","id":"tirmidhi-7-53"},{"hadith-eng":"\"During a sermon of his in the year of the Farewell Hajj, I heard the Messenger of Allah say: 'A woman is not to spend anything from her husbands house without her husband's permission.' They said: 'O Messenger of Allah! What about food?' He said: 'That is our most virtuous wealth.'\"","reference":"Jami` at-Tirmidhi 670, Book 7, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #1","question":"What is the significance of a woman's role in managing household resources according to Islamic teachings?","id":"tirmidhi-7-54"},{"hadith-eng":"the Prophet said: \"When a woman gives in charity from her husband's house, she will get the reward for it, and for her husband is the same as that, and for the trustee is the same as that. The reward of each them will not be decreased at all by the reward of the other, for him is what he earned, and for her is what she spent.\"","reference":"Jami` at-Tirmidhi 671, Book 7, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of a woman's charity from her husband's house in Islam?","id":"tirmidhi-7-55"},{"hadith-eng":"the Messenger of Allah said: \"When a woman gives from her husband's home, with a good heart, not to spoil it, then she will get a reward similar to his, for her is the good she intended - and the same is for the trustee.\"","reference":"Jami` at-Tirmidhi 672, Book 7, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of intention in the actions of giving charity from one's household?","id":"tirmidhi-7-56"},{"hadith-eng":"\"We would give Zakat Al-Fitr - when the Messenger of Allah was among us - as a Sa of food, or a Sa of barely, or a Sa of dried dates, or a Sa of raisins, or a Sa of cheese. So we did not stop paying it (like that) until Mu'awiyah arrived in Al-Madinah and talked (about it). Among the things he addressed the people with, he said: 'I see that two Mudd of the wheat of Ash-Sham are equal to a Sa of dried dates.' So the people followed that.\" Abu Sa'eed said: \"I will not stop giving it in the manner that I had been giving it.\"","reference":"Jami` at-Tirmidhi 673, Book 7, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the different types of food items that were traditionally given as Zakat Al-Fitr during the time of the Prophet Muhammad?","id":"tirmidhi-7-57"},{"hadith-eng":"the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"","reference":"Jami` at-Tirmidhi 674, Book 7, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #1","question":"Who is obligated to give Sadaqatul-Fitr according to Islamic teachings?","id":"tirmidhi-7-58"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr an obligation upon the male and female, the free and the bondsmen, as a Sa of dried dates or a Sa of barley.\" He said: \"So the people equated that to half a Sa of wheat.\"","reference":"Jami` at-Tirmidhi 675, Book 7, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Sadaqatul-Fitr in Islam?","id":"tirmidhi-7-59"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr of Ramadan an obligation - a Sa of dried dates or a Sa of barley - required upon every free person and slave, male and female among the Muslims.\"","reference":"Jami` at-Tirmidhi 676, Book 7, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of Sadaqatul-Fitr in Islam?","id":"tirmidhi-7-60"},{"hadith-eng":"the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.","reference":"Jami` at-Tirmidhi 677, Book 7, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of paying Zakat before performing the Eid prayer on the day of Fitr?","id":"tirmidhi-7-61"},{"hadith-eng":"\"Al-Abbas asked the Messenger of Allah about paying his charity (Zakat) in advance before its time is due (by being in possession for a whole year), he permitted him to do that.\"","reference":"Jami` at-Tirmidhi 678, Book 7, Hadith 62","grade":"Da'if(Darussalam)","question #":"question #1","question":"Is it permissible to pay Zakat in advance before the completion of a full year?","id":"tirmidhi-7-62"},{"hadith-eng":"the Prophet said to Umar: \"We have taken this year's Zakat from Al-Abbas in the previous year.\"","reference":"Jami` at-Tirmidhi 679, Book 7, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #1","question":"What is the significance of collecting Zakat in advance according to Islamic teachings?","id":"tirmidhi-7-63"},{"hadith-eng":"the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"","reference":"Jami` at-Tirmidhi 680, Book 7, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #1","question":"What is the significance of self-reliance and hard work in Islam?","id":"tirmidhi-7-64"},{"hadith-eng":"the Messenger of Allah said: \"Asking is a labor that toils on a man's face, except if a man asks for something from the Sultan (ruler), or he asks for something that he cannot do without.\"","reference":"Jami` at-Tirmidhi 681, Book 7, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #1","question":"What are the implications of asking for help on a person's dignity according to Islamic teachings?","id":"tirmidhi-7-65"},{"hadith-eng":"\"I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah.\" He said: \"He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!'\" He said: \"I said t myself: Woe is me! Perhaps something has been revealed about me!'\" He said: \"So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'\"","reference":"Jami` at-Tirmidhi 617, Book 7, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the failure to pay Zakat affect a person in the hereafter?","id":"tirmidhi-7-66"},{"hadith-eng":"that the Prophet said: \"When you pay the Zakat you have fulfilled what is required of you.\"","reference":"Jami` at-Tirmidhi 618, Book 7, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does paying Zakat relate to the concept of fulfilling one's duties in Islam?","id":"tirmidhi-7-67"},{"hadith-eng":"\"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"","reference":"Jami` at-Tirmidhi 619, Book 7, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of fasting for a month in Islam?","id":"tirmidhi-7-68"},{"hadith-eng":"the Messenger of Allah said: \"I have exempted charity on horses and slaves. So bring charity for silver, one Dirham for every forty Dirham. There is nothing for me (to collect) on one hundred and ninety Dirham, so when it reaches two hundred, then five Dirham of it (are due).\"","reference":"Jami` at-Tirmidhi 620, Book 7, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the charity on silver calculated according to Islamic law?","id":"tirmidhi-7-69"},{"hadith-eng":"\"The Messenger of Allah had a letter written about charity, but he had not dispatched it to his governors until he died; he kept it with him along with his sword. When he died, Abu Bakr implemented it until he died, as did Umar until he died. In it was: 'A sheep (is due) on five camels, two sheeps on ten, three sheeps on fifteen, four sheeps for twenty, a Bint Makhad on twenty-five to thirty-five. When it is more than that, then a Bint Labun, (is due, till the number of the camels reaches) forty-five. When it is more than that, then a Hiqqah until sixty. When it is more than that, then a Jadhah until seventy-five. When it is more than one hundred and twenty, then a Hiqqah on every fifty, and a Bint Labun on every forty. For sheep; one sheep (is due) for every forty sheeps until one hundred and twenty. When it is more than that, then two sheeps until two hundred. When it is more than that, then three sheeps until three hundred sheep. When it is more than three hundred sheep, then a sheep on every hundred sheep. Then there is nothing until it reaches four hundred. There is no combining the (property of) individuals nor separating the collective (property) fearing Sadaqah. And fr whatever is mixed together that two own, then they are to refer to the total. Neither an old or defective (animal) may be taken for charity.\"","reference":"Jami` at-Tirmidhi 621, Book 7, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #2","question":"How did the early caliphs implement the Prophet's instructions on charity after his death?","id":"tirmidhi-7-70"},{"hadith-eng":"the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"","reference":"Jami` at-Tirmidhi 622, Book 7, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #2","question":"How is the zakat obligation determined for cattle in Islamic law?","id":"tirmidhi-7-71"},{"hadith-eng":"\"The Prophet sent me to Yemen and ordered me to collect a Tabi or a Tabi'ah on every thirty cows, a Musinnah on every forty, a Dinar for every Halim, or its equivalent of Ma'afir.\"Abu Eisa said: This Hadith is Hasan. Some of them reported this Hadith from Sufyan, from Al-A'mash, from Abu Wa'il, from Masruq: \"The Prophet sent Mu'adh to Yemen and ordered him to take...\" and this is more authentic","reference":"Jami` at-Tirmidhi 623, Book 7, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #2","question":"What specific instructions did the Prophet give regarding the collection of zakat on cattle?","id":"tirmidhi-7-72"},{"hadith-eng":"Muhammad bin Ja'far narrated to us, from Shu'bah, from Amr bin Murrah who said: \"I asked Abu Ubaidah bin Abdullah: 'Did you remember anything from Abdullah?' He said, 'No'\"","reference":"Jami` at-Tirmidhi 624, Book 7, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the absence of direct memory impact the transmission of hadith?","id":"tirmidhi-7-73"},{"hadith-eng":"the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"","reference":"Jami` at-Tirmidhi 625, Book 7, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #2","question":"What are the five daily prayers and why are they obligatory in Islam?","id":"tirmidhi-7-74"},{"hadith-eng":"the Prophet said: \"There is no charity due on less than five camels, and there is no charity due on what is less than five Uqiyah (of silver), and there is no charity due on what is less than five Wasaq.\"","reference":"Jami` at-Tirmidhi 626, Book 7, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #2","question":"How much silver must one possess for charity to become due?","id":"tirmidhi-7-75"},{"hadith-eng":"the Prophet said (similar t Hadith no. 626).","reference":"Jami` at-Tirmidhi 627, Book 7, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the repetition of a hadith through different chains of narration affect its authenticity?","id":"tirmidhi-7-76"},{"hadith-eng":"the Messenger of Allah said:  \"There is no charity due from a Muslim for his horse nor his slave.\"","reference":"Jami` at-Tirmidhi 628, Book 7, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #2","question":"Is there an obligation for a Muslim to pay charity for their slaves?","id":"tirmidhi-7-77"},{"hadith-eng":"the Messenger of Allah said: \"A Ziqq is due for every ten Ziqq of honey.\"","reference":"Jami` at-Tirmidhi 629, Book 7, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the concept of Zakat applied to agricultural products like honey?","id":"tirmidhi-7-78"},{"hadith-eng":"Nafi said: \"Umar bin Adbul-Aziz asked me about charity due on honey, so I said to him: 'We do not have honey that we could give charity from, but Al-Mughirah bin Hakim informed us that he (pbuh) said: 'There is no charity due on honey.' So Umar said: 'That is fair enough for me.' So he wrote to the people that is be lifted, meaning (the duty of paying it) from them.\"","reference":"Jami` at-Tirmidhi 630, Book 7, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Umar bin Abdul-Aziz respond to the information about charity on honey?","id":"tirmidhi-7-79"},{"hadith-eng":"the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"","reference":"Jami` at-Tirmidhi 631, Book 7, Hadith 15","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of Hawl relate to the obligation of Zakat in Islamic finance?","id":"tirmidhi-7-80"},{"hadith-eng":"\"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed while it is in his possession.\"","reference":"Jami` at-Tirmidhi 632, Book 7, Hadith 16","grade":"","question #":"question #2","question":"How does the concept of possession affect the calculation of Zakat on acquired wealth?","id":"tirmidhi-7-81"},{"hadith-eng":"the Messenger of Allah said: \"Two Qiblahs in one land are of no benefit, and there is no Jizyah upon the Muslims.\"","reference":"Jami` at-Tirmidhi 633, Book 7, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is it important for Muslims to have a unified direction for prayer?","id":"tirmidhi-7-82"},{"hadith-eng":"(A similar narration as no. 633.)","reference":"Jami` at-Tirmidhi 634, Book 7, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the repetition of a hadith in different narrations affect its authenticity and understanding?","id":"tirmidhi-7-83"},{"hadith-eng":"\"The Messenger of Allah delivered a sermon to us, and said: 'O you women! Give charity, even if it is from your jewelry, for indeed you will make up most of the people of Hell on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 635, Book 7, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does giving charity relate to one's fate in the afterlife according to Islamic teachings?","id":"tirmidhi-7-84"},{"hadith-eng":"Zainab, the wife of Abdullah narrated similarly from the Prophet.","reference":"Jami` at-Tirmidhi 636, Book 7, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #2","question":"What is the significance of family members of the Prophet's companions in the transmission of hadiths?","id":"tirmidhi-7-85"},{"hadith-eng":"that two women came to the Messenger of Allah, and they each had a bracelet of gold on their forearms. So he said to them: \"Have you paid their Zakat?\" They said, \"No.\" The Messenger of Allah said to them: \"Would you like for Allah to fashion then into two bracelets of Fire?\" They said, \"No.\" He said: \"Then pay its Zakat.\"","reference":"Jami` at-Tirmidhi 637, Book 7, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the consequences mentioned for not paying Zakat on wealth?","id":"tirmidhi-7-86"},{"hadith-eng":"Mu'adh had written to the Prophet to ask him about greens - which is \"herbs\" - so he (pbuh) said, \"There is nothing due on them.\"","reference":"Jami` at-Tirmidhi 638, Book 7, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #2","question":"How did the Prophet Muhammad (pbuh) respond to inquiries about agricultural produce?","id":"tirmidhi-7-87"},{"hadith-eng":"the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"","reference":"Jami` at-Tirmidhi 639, Book 7, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does the method of watering crops affect the calculation of Ushr in Islamic law?","id":"tirmidhi-7-88"},{"hadith-eng":"the Messenger of Allah instituted the Ushr of what was watered by the heavens and steams, or through natural channels, and half of the Ushr for what is watered by irrigation.","reference":"Jami` at-Tirmidhi 640, Book 7, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the method of watering crops affect the rate of Ushr?","id":"tirmidhi-7-89"},{"hadith-eng":"the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"","reference":"Jami` at-Tirmidhi 641, Book 7, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is it important to invest the wealth of an orphan rather than leaving it idle?","id":"tirmidhi-7-90"},{"hadith-eng":"the Messenger of Allah said: \"The injuries caused by the animal are without liability, and mines are without liability, and wells are without liability, and the Khumus is due on Rikaz.\"","reference":"Jami` at-Tirmidhi 642, Book 7, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islamic law address liabilities related to mines?","id":"tirmidhi-7-91"},{"hadith-eng":"\"Sahl bin Abi Hathmah came to a gathering of ours, and he narrated that the Messenger of Allah would say: \"When you make an assessment, then take it and leave a third, if you do not leave a third, then leave a quarter.\"","reference":"Jami` at-Tirmidhi 643, Book 7, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why is it important to leave a portion when making an assessment according to Islamic teachings?","id":"tirmidhi-7-92"},{"hadith-eng":"the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"","reference":"Jami` at-Tirmidhi 644, Book 7, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #2","question":"What is the method of paying zakat for grapevines as mentioned in Islamic tradition?","id":"tirmidhi-7-93"},{"hadith-eng":"\"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"","reference":"Jami` at-Tirmidhi 645, Book 7, Hadith 29","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the act of collecting charity compared to fighting in the cause of Allah?","id":"tirmidhi-7-94"},{"hadith-eng":"the Messenger of Allah said: \"The one who commits transgression with charity is like the one who does not pay it.\"","reference":"Jami` at-Tirmidhi 646, Book 7, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #2","question":"How is the act of not paying charity viewed in Islamic teachings?","id":"tirmidhi-7-95"},{"hadith-eng":"the Prophet said: \"When the charity collector comes to you, then he should not depart from you except while pleased.\"","reference":"Jami` at-Tirmidhi 647, Book 7, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should a community treat a charity collector according to Islamic teachings?","id":"tirmidhi-7-96"},{"hadith-eng":"similar (narration to no. 647 with a different chain) from the Prophet.","reference":"Jami` at-Tirmidhi 648, Book 7, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the variation in chains of narration affect the authenticity of a hadith?","id":"tirmidhi-7-97"},{"hadith-eng":"\"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"","reference":"Jami` at-Tirmidhi 649, Book 7, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam ensure the welfare of orphans through charitable practices?","id":"tirmidhi-7-98"},{"hadith-eng":"the Messenger of Allah said: \"Whoever begs from the people while he has what he needs, he will come on the Day of Judgment and his begging with be scratches or lacerations, or bite marks on his face.\" They said: \"O Messenger of Allah! 'How much is it that one needs?' He said: 'Fifty Dirham, or their value in gold.'\"","reference":"Jami` at-Tirmidhi 650, Book 7, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islam define the threshold of need that justifies begging?","id":"tirmidhi-7-99"},{"hadith-eng":"Yahya bin Adam narrated to us, Sufyan narrated this Hadith to us from Hakim bin Jubair. So Abdullah bin Uthman, the companion of Shu'bah said to him (Sufyan): \"If only someone besides Hakim had narrated this (Hadith).\" Sufyan said to him, \"So what is with Hakim; Shu'bah would not narrate from him?\" He said: \"Yes.\" So Sufyan said: \"I heard Zubaid narrating this from Muhammad bin Abdur-Rahman bin Yazid.\"","reference":"Jami` at-Tirmidhi 651, Book 7, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #2","question":"How do scholars determine the credibility of a hadith narrator?","id":"tirmidhi-7-100"},{"hadith-eng":"the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"","reference":"Jami` at-Tirmidhi 652, Book 7, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #2","question":"What are the conditions under which charity is considered lawful in Islam?","id":"tirmidhi-7-101"},{"hadith-eng":"\"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"","reference":"Jami` at-Tirmidhi 653, Book 7, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the consequences of begging without necessity according to Islamic teachings?","id":"tirmidhi-7-102"},{"hadith-eng":"There is another chain with a similar narration.","reference":"Jami` at-Tirmidhi 654, Book 7, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the presence of different narrators affect the authenticity of a hadith?","id":"tirmidhi-7-103"},{"hadith-eng":"\"During the time of the Messenger of Allah, a man suffered a loss on fruits that he had sold, resulting in more debt. The Messenger of Allah said: 'Give him charity.' So the people gave him charity but it did not cover his debt. So the Messenger of Allah said to his debtors: 'Take what you have and there is nothing for you but that.'\"","reference":"Jami` at-Tirmidhi 655, Book 7, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #2","question":"How should creditors respond when a debtor is unable to repay their debt due to unforeseen circumstances?","id":"tirmidhi-7-104"},{"hadith-eng":"\"When something was brought to him, the Messenger of Allah would ask: 'Is this charity or a gift?' If they said: 'Charity.' He would not eat it, and if they said, 'A gift' he would eat it.\"","reference":"Jami` at-Tirmidhi 656, Book 7, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #2","question":"Why did the Prophet Muhammad (ﷺ) refuse to eat from charity?","id":"tirmidhi-7-105"},{"hadith-eng":"the Messenger of Allah sent a man from Banu Makhzun to collect charity, so he said to Abu Rafi: \"Accompany me so that perhaps you may have some of it.\" So he said: \"Not until I ask the Messenger of Allah.\" So he went to the Prophet to ask him, and he said: \"Charity is not lawful for us, and to be the Mawda of a people to be the same as them.\"","reference":"Jami` at-Tirmidhi 657, Book 7, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does one determine eligibility for receiving charity in Islamic teachings?","id":"tirmidhi-7-106"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"","reference":"Jami` at-Tirmidhi 658, Book 7, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #2","question":"Why are dates considered blessed in the context of breaking the fast?","id":"tirmidhi-7-107"},{"hadith-eng":"she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)","reference":"Jami` at-Tirmidhi 659, Book 7, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the Quran define true piety and righteousness?","id":"tirmidhi-7-108"},{"hadith-eng":"the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"","reference":"Jami` at-Tirmidhi 660, Book 7, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does Islamic teaching address the responsibilities of wealth management?","id":"tirmidhi-7-109"},{"hadith-eng":"the Messenger of Allah said: \"None gives charity from Tayyib - and Allah does not accept but Tayyib - but that Ar-Rahman accepts it with His Right (Hand). Even if it is a date, it is nurtured in the Hand of Ar-Rahman until it is greater than a mountain, just as one of you nurtures his foal or young camel.\"","reference":"Jami` at-Tirmidhi 661, Book 7, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Allah nurture the charity given by a believer according to Islamic teachings?","id":"tirmidhi-7-110"},{"hadith-eng":"the Messenger of Allah said: \"Indeed Allah accepts charity, and He accepts it with His Right (Hand) to nurture it for one of you, just like one of you would nurture his foal, until the bite (of food) becomes as large as Uhud.\" The Book of Allah, the Mighty and Sublime testifies to that: 'He accepts repentance from His worshipers, and accepts charity.'And: 'Allah will destroy Riba and give increase for charity.'1And: 'Allah will destroy Riba and will give increase for charity.'2(Abu 'Eisa) said: This Hadith is (Hasan) Sahih. It has been reported from'Aishah from the Prophet similarly. More than one of the people of knowledge have spoken about this Hadith, and the narrations that resemble it about the Attributes\nand the Descent of the Lord, Blessed and Most High, every night to the lowest Heaven. They said: \"The narrations about these are affirmed and should be believed in without misinterpreting them nor saying 'how'.\" It has been reported\nlike this from Malik (bin Anas), Suf'ãn bin 'Uyainah, 'Abdullãh bin A1-Mubarak; they would say about these Hadith: They are conveyed without saying how. This is the view of the people of knowledge among Ahl As-Sunnah wal-Jama'ah. As for\nthe Jahmiyyah, they reject these narrations and they say that this is\nTashbih.3And in other places in His Book, Allah, Blessed and Most\nHigh is He, has mentioned the Hand, the Hearing, the Seeing, so the Jahmiyyah misinterpret these Ayãt and give them interpretations other than the interpretations of the people of knowledge. They say that Allah did not create Adam with His Hand, and they say the meaning of Hand is merely power. Isaq bin Ibrahim said: At-Tashbih is only when one says 'Hand; like a hand or similar to a hand' or 'Hearing; like hearing or similar to hearing.' So\nwhen one says 'Hearing; like hearing or similar to hearing' then this is the Tashbih. As for when one says as Allah (Most High) said, Hand, Hearing, Seeing, and he does not say 'how' nor say 'similar to hearing' nor 'like hearing' then this is not Tashbih. It is merely as Allah, Blessed and Most High is He said: 'There is nothing like Him, and He is the All-Hearing, the All-Seeing.'(Ash-Shüra 42:11).1: At-Tawbah 9:104.2: Al-Baqarah 2:276.3: Anthropomorphism, resembling Allah to creatures.","reference":"Jami` at-Tirmidhi 662, Book 7, Hadith 46","grade":"Abu Eisa (at-Tirmidhi) said: This Hadith is Hasan Sahih.(Darussalam)","question #":"question #2","question":"What is the significance of believing in the attributes of Allah without misinterpretation?","id":"tirmidhi-7-111"},{"hadith-eng":"the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"","reference":"Jami` at-Tirmidhi 663, Book 7, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #2","question":"Why is charity during Ramadan considered the best form of charity?","id":"tirmidhi-7-112"},{"hadith-eng":"the Messenger of Allah said: \"Indeed charity extinguishes the Lord's anger and it protects against the evil death.\"","reference":"Jami` at-Tirmidhi 664, Book 7, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does charity serve as a protection against an evil death?","id":"tirmidhi-7-113"},{"hadith-eng":"Umm Bujaid - and she was one of those who gave the pledge to the Prophet - she said to the Messenger of Allah: \"There is a needy person who stands outside my door, but I cannot find anything to give to him.\" So the Messenger of Allah said to her: \"If you do not find anything to give him except a burnt trotter then hand it over to him.\"","reference":"Jami` at-Tirmidhi 665, Book 7, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam encourage helping those in need, regardless of one's own financial situation?","id":"tirmidhi-7-114"},{"hadith-eng":"\"The Messenger of Allah gave to me on the Day of Hunain, and he was the most hated creature to me. But he did not stop giving to me until he was the most loved creature to me.\"","reference":"Jami` at-Tirmidhi 666, Book 7, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #2","question":"What impact can continuous acts of kindness have on relationships?","id":"tirmidhi-7-115"},{"hadith-eng":"\"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"","reference":"Jami` at-Tirmidhi 667, Book 7, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does inheritance affect the distribution of charity given by a deceased person?","id":"tirmidhi-7-116"},{"hadith-eng":"Umar gave a horse to be used in the cause of Allah. Then he saw it being sold, so he wanted to buy it, but the Prophet said: \"Do not take back what you have given in charity.\"","reference":"Jami` at-Tirmidhi 668, Book 7, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does Islam view the act of reclaiming a charitable donation?","id":"tirmidhi-7-117"},{"hadith-eng":"a man said: \"O Messenger of Allah! My mother died, will it benefit her if I give charity on her behalf?\" He said: 'Yes.' He said: 'I have a Makhraf, so bear witness that I have given it in charity on her behalf.'\"","reference":"Jami` at-Tirmidhi 669, Book 7, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #2","question":"What actions can be taken to benefit a deceased relative according to Islamic teachings?","id":"tirmidhi-7-118"},{"hadith-eng":"\"During a sermon of his in the year of the Farewell Hajj, I heard the Messenger of Allah say: 'A woman is not to spend anything from her husbands house without her husband's permission.' They said: 'O Messenger of Allah! What about food?' He said: 'That is our most virtuous wealth.'\"","reference":"Jami` at-Tirmidhi 670, Book 7, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #2","question":"How does Islam view the spending of household wealth by a wife without the husband's permission?","id":"tirmidhi-7-119"},{"hadith-eng":"the Prophet said: \"When a woman gives in charity from her husband's house, she will get the reward for it, and for her husband is the same as that, and for the trustee is the same as that. The reward of each them will not be decreased at all by the reward of the other, for him is what he earned, and for her is what she spent.\"","reference":"Jami` at-Tirmidhi 671, Book 7, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #2","question":"How is the reward distributed among a woman, her husband, and the trustee when she gives charity?","id":"tirmidhi-7-120"},{"hadith-eng":"the Messenger of Allah said: \"When a woman gives from her husband's home, with a good heart, not to spoil it, then she will get a reward similar to his, for her is the good she intended - and the same is for the trustee.\"","reference":"Jami` at-Tirmidhi 672, Book 7, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does a woman's act of giving from her husband's home affect her reward in Islam?","id":"tirmidhi-7-121"},{"hadith-eng":"\"We would give Zakat Al-Fitr - when the Messenger of Allah was among us - as a Sa of food, or a Sa of barely, or a Sa of dried dates, or a Sa of raisins, or a Sa of cheese. So we did not stop paying it (like that) until Mu'awiyah arrived in Al-Madinah and talked (about it). Among the things he addressed the people with, he said: 'I see that two Mudd of the wheat of Ash-Sham are equal to a Sa of dried dates.' So the people followed that.\" Abu Sa'eed said: \"I will not stop giving it in the manner that I had been giving it.\"","reference":"Jami` at-Tirmidhi 673, Book 7, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #2","question":"How did Mu'awiyah's arrival in Al-Madinah influence the practice of giving Zakat Al-Fitr?","id":"tirmidhi-7-122"},{"hadith-eng":"the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"","reference":"Jami` at-Tirmidhi 674, Book 7, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the specified amounts or types of food for Sadaqatul-Fitr?","id":"tirmidhi-7-123"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr an obligation upon the male and female, the free and the bondsmen, as a Sa of dried dates or a Sa of barley.\" He said: \"So the people equated that to half a Sa of wheat.\"","reference":"Jami` at-Tirmidhi 675, Book 7, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who is obligated to give Sadaqatul-Fitr according to Islamic teachings?","id":"tirmidhi-7-124"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr of Ramadan an obligation - a Sa of dried dates or a Sa of barley - required upon every free person and slave, male and female among the Muslims.\"","reference":"Jami` at-Tirmidhi 676, Book 7, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #2","question":"Who is obligated to give Sadaqatul-Fitr according to Islamic teachings?","id":"tirmidhi-7-125"},{"hadith-eng":"the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.","reference":"Jami` at-Tirmidhi 677, Book 7, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does the timing of Zakat payment relate to the Eid al-Fitr celebrations?","id":"tirmidhi-7-126"},{"hadith-eng":"\"Al-Abbas asked the Messenger of Allah about paying his charity (Zakat) in advance before its time is due (by being in possession for a whole year), he permitted him to do that.\"","reference":"Jami` at-Tirmidhi 678, Book 7, Hadith 62","grade":"Da'if(Darussalam)","question #":"question #2","question":"What are the conditions under which Zakat can be paid before its due time?","id":"tirmidhi-7-127"},{"hadith-eng":"the Prophet said to Umar: \"We have taken this year's Zakat from Al-Abbas in the previous year.\"","reference":"Jami` at-Tirmidhi 679, Book 7, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #2","question":"How does the concept of Zakat reflect on the financial responsibilities of Muslims?","id":"tirmidhi-7-128"},{"hadith-eng":"the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"","reference":"Jami` at-Tirmidhi 680, Book 7, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #2","question":"How does giving charity benefit an individual in Islamic teachings?","id":"tirmidhi-7-129"},{"hadith-eng":"the Messenger of Allah said: \"Asking is a labor that toils on a man's face, except if a man asks for something from the Sultan (ruler), or he asks for something that he cannot do without.\"","reference":"Jami` at-Tirmidhi 681, Book 7, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #2","question":"In what situations is it considered acceptable to ask for assistance from a ruler in Islam?","id":"tirmidhi-7-130"},{"hadith-eng":"\"I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah.\" He said: \"He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!'\" He said: \"I said t myself: Woe is me! Perhaps something has been revealed about me!'\" He said: \"So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'\"","reference":"Jami` at-Tirmidhi 617, Book 7, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of Zakat in the life of a Muslim according to Islamic teachings?","id":"tirmidhi-7-131"},{"hadith-eng":"that the Prophet said: \"When you pay the Zakat you have fulfilled what is required of you.\"","reference":"Jami` at-Tirmidhi 618, Book 7, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the implications of fulfilling the requirement of Zakat in Islamic teachings?","id":"tirmidhi-7-132"},{"hadith-eng":"\"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"","reference":"Jami` at-Tirmidhi 619, Book 7, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is Zakat an essential part of Islamic practice?","id":"tirmidhi-7-133"},{"hadith-eng":"the Messenger of Allah said: \"I have exempted charity on horses and slaves. So bring charity for silver, one Dirham for every forty Dirham. There is nothing for me (to collect) on one hundred and ninety Dirham, so when it reaches two hundred, then five Dirham of it (are due).\"","reference":"Jami` at-Tirmidhi 620, Book 7, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the minimum amount of silver that requires the payment of charity?","id":"tirmidhi-7-134"},{"hadith-eng":"\"The Messenger of Allah had a letter written about charity, but he had not dispatched it to his governors until he died; he kept it with him along with his sword. When he died, Abu Bakr implemented it until he died, as did Umar until he died. In it was: 'A sheep (is due) on five camels, two sheeps on ten, three sheeps on fifteen, four sheeps for twenty, a Bint Makhad on twenty-five to thirty-five. When it is more than that, then a Bint Labun, (is due, till the number of the camels reaches) forty-five. When it is more than that, then a Hiqqah until sixty. When it is more than that, then a Jadhah until seventy-five. When it is more than one hundred and twenty, then a Hiqqah on every fifty, and a Bint Labun on every forty. For sheep; one sheep (is due) for every forty sheeps until one hundred and twenty. When it is more than that, then two sheeps until two hundred. When it is more than that, then three sheeps until three hundred sheep. When it is more than three hundred sheep, then a sheep on every hundred sheep. Then there is nothing until it reaches four hundred. There is no combining the (property of) individuals nor separating the collective (property) fearing Sadaqah. And fr whatever is mixed together that two own, then they are to refer to the total. Neither an old or defective (animal) may be taken for charity.\"","reference":"Jami` at-Tirmidhi 621, Book 7, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the specific requirements for zakat on camels and sheep according to Islamic law?","id":"tirmidhi-7-135"},{"hadith-eng":"the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"","reference":"Jami` at-Tirmidhi 622, Book 7, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the required zakat for owning thirty cows?","id":"tirmidhi-7-136"},{"hadith-eng":"\"The Prophet sent me to Yemen and ordered me to collect a Tabi or a Tabi'ah on every thirty cows, a Musinnah on every forty, a Dinar for every Halim, or its equivalent of Ma'afir.\"Abu Eisa said: This Hadith is Hasan. Some of them reported this Hadith from Sufyan, from Al-A'mash, from Abu Wa'il, from Masruq: \"The Prophet sent Mu'adh to Yemen and ordered him to take...\" and this is more authentic","reference":"Jami` at-Tirmidhi 623, Book 7, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of collecting a Tabi or a Tabi'ah on every thirty cows?","id":"tirmidhi-7-137"},{"hadith-eng":"Muhammad bin Ja'far narrated to us, from Shu'bah, from Amr bin Murrah who said: \"I asked Abu Ubaidah bin Abdullah: 'Did you remember anything from Abdullah?' He said, 'No'\"","reference":"Jami` at-Tirmidhi 624, Book 7, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #3","question":"What challenges might arise in preserving the accuracy of hadith over generations?","id":"tirmidhi-7-138"},{"hadith-eng":"the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"","reference":"Jami` at-Tirmidhi 625, Book 7, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #3","question":"How is charity viewed in Islam, particularly in relation to wealth distribution?","id":"tirmidhi-7-139"},{"hadith-eng":"the Prophet said: \"There is no charity due on less than five camels, and there is no charity due on what is less than five Uqiyah (of silver), and there is no charity due on what is less than five Wasaq.\"","reference":"Jami` at-Tirmidhi 626, Book 7, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of the number five in determining the obligation of charity in this context?","id":"tirmidhi-7-140"},{"hadith-eng":"the Prophet said (similar t Hadith no. 626).","reference":"Jami` at-Tirmidhi 627, Book 7, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of Jami` at-Tirmidhi in the compilation of hadiths?","id":"tirmidhi-7-141"},{"hadith-eng":"the Messenger of Allah said:  \"There is no charity due from a Muslim for his horse nor his slave.\"","reference":"Jami` at-Tirmidhi 628, Book 7, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does Islam view the ownership of animals and slaves in terms of charitable obligations?","id":"tirmidhi-7-142"},{"hadith-eng":"the Messenger of Allah said: \"A Ziqq is due for every ten Ziqq of honey.\"","reference":"Jami` at-Tirmidhi 629, Book 7, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #3","question":"What does the term 'Ziqq' refer to in the context of Islamic taxation?","id":"tirmidhi-7-143"},{"hadith-eng":"Nafi said: \"Umar bin Adbul-Aziz asked me about charity due on honey, so I said to him: 'We do not have honey that we could give charity from, but Al-Mughirah bin Hakim informed us that he (pbuh) said: 'There is no charity due on honey.' So Umar said: 'That is fair enough for me.' So he wrote to the people that is be lifted, meaning (the duty of paying it) from them.\"","reference":"Jami` at-Tirmidhi 630, Book 7, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of verifying information before making a decision in Islamic governance?","id":"tirmidhi-7-144"},{"hadith-eng":"the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"","reference":"Jami` at-Tirmidhi 631, Book 7, Hadith 15","grade":"Da'if(Darussalam)","question #":"question #3","question":"What conditions must be met for wealth to be subject to Zakat according to Islamic teachings?","id":"tirmidhi-7-145"},{"hadith-eng":"\"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed while it is in his possession.\"","reference":"Jami` at-Tirmidhi 632, Book 7, Hadith 16","grade":"","question #":"question #3","question":"What are the conditions that must be met for wealth to be subject to Zakat?","id":"tirmidhi-7-146"},{"hadith-eng":"the Messenger of Allah said: \"Two Qiblahs in one land are of no benefit, and there is no Jizyah upon the Muslims.\"","reference":"Jami` at-Tirmidhi 633, Book 7, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #3","question":"What does the concept of Jizyah imply in Islamic jurisprudence?","id":"tirmidhi-7-147"},{"hadith-eng":"(A similar narration as no. 633.)","reference":"Jami` at-Tirmidhi 634, Book 7, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the role of Jami` at-Tirmidhi in the compilation of hadiths?","id":"tirmidhi-7-148"},{"hadith-eng":"\"The Messenger of Allah delivered a sermon to us, and said: 'O you women! Give charity, even if it is from your jewelry, for indeed you will make up most of the people of Hell on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 635, Book 7, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does jewelry play in the context of charity for women in Islam?","id":"tirmidhi-7-149"},{"hadith-eng":"Zainab, the wife of Abdullah narrated similarly from the Prophet.","reference":"Jami` at-Tirmidhi 636, Book 7, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the chain of narration impact the authenticity of a hadith?","id":"tirmidhi-7-150"},{"hadith-eng":"that two women came to the Messenger of Allah, and they each had a bracelet of gold on their forearms. So he said to them: \"Have you paid their Zakat?\" They said, \"No.\" The Messenger of Allah said to them: \"Would you like for Allah to fashion then into two bracelets of Fire?\" They said, \"No.\" He said: \"Then pay its Zakat.\"","reference":"Jami` at-Tirmidhi 637, Book 7, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the concept of Zakat relate to the purification of wealth in Islam?","id":"tirmidhi-7-151"},{"hadith-eng":"Mu'adh had written to the Prophet to ask him about greens - which is \"herbs\" - so he (pbuh) said, \"There is nothing due on them.\"","reference":"Jami` at-Tirmidhi 638, Book 7, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #3","question":"What can be inferred about the taxation of non-staple crops in Islamic law?","id":"tirmidhi-7-152"},{"hadith-eng":"the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"","reference":"Jami` at-Tirmidhi 639, Book 7, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #3","question":"What are the different types of irrigation mentioned in Islamic teachings and their impact on Ushr?","id":"tirmidhi-7-153"},{"hadith-eng":"the Messenger of Allah instituted the Ushr of what was watered by the heavens and steams, or through natural channels, and half of the Ushr for what is watered by irrigation.","reference":"Jami` at-Tirmidhi 640, Book 7, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different sources of water mentioned for irrigation in Islamic teachings?","id":"tirmidhi-7-154"},{"hadith-eng":"the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"","reference":"Jami` at-Tirmidhi 641, Book 7, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #3","question":"How can the wealth of an orphan be protected from being consumed by charity?","id":"tirmidhi-7-155"},{"hadith-eng":"the Messenger of Allah said: \"The injuries caused by the animal are without liability, and mines are without liability, and wells are without liability, and the Khumus is due on Rikaz.\"","reference":"Jami` at-Tirmidhi 642, Book 7, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the ruling on liabilities concerning wells in Islamic jurisprudence?","id":"tirmidhi-7-156"},{"hadith-eng":"\"Sahl bin Abi Hathmah came to a gathering of ours, and he narrated that the Messenger of Allah would say: \"When you make an assessment, then take it and leave a third, if you do not leave a third, then leave a quarter.\"","reference":"Jami` at-Tirmidhi 643, Book 7, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #3","question":"How does the concept of fairness play a role in Islamic financial transactions?","id":"tirmidhi-7-157"},{"hadith-eng":"the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"","reference":"Jami` at-Tirmidhi 644, Book 7, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the zakat for grapevines compare to the zakat for date-palms?","id":"tirmidhi-7-158"},{"hadith-eng":"\"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"","reference":"Jami` at-Tirmidhi 645, Book 7, Hadith 29","grade":"Hasan(Darussalam)","question #":"question #3","question":"What virtues are associated with truthfulness in the collection of charity?","id":"tirmidhi-7-159"},{"hadith-eng":"the Messenger of Allah said: \"The one who commits transgression with charity is like the one who does not pay it.\"","reference":"Jami` at-Tirmidhi 646, Book 7, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is the significance of fulfilling the obligation of charity in Islam?","id":"tirmidhi-7-160"},{"hadith-eng":"the Prophet said: \"When the charity collector comes to you, then he should not depart from you except while pleased.\"","reference":"Jami` at-Tirmidhi 647, Book 7, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the responsibilities of a charity collector when interacting with a community?","id":"tirmidhi-7-161"},{"hadith-eng":"similar (narration to no. 647 with a different chain) from the Prophet.","reference":"Jami` at-Tirmidhi 648, Book 7, Hadith 32","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role do narrators play in the transmission of hadiths?","id":"tirmidhi-7-162"},{"hadith-eng":"\"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"","reference":"Jami` at-Tirmidhi 649, Book 7, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of distributing charity from the rich to the poor in Islam?","id":"tirmidhi-7-163"},{"hadith-eng":"the Messenger of Allah said: \"Whoever begs from the people while he has what he needs, he will come on the Day of Judgment and his begging with be scratches or lacerations, or bite marks on his face.\" They said: \"O Messenger of Allah! 'How much is it that one needs?' He said: 'Fifty Dirham, or their value in gold.'\"","reference":"Jami` at-Tirmidhi 650, Book 7, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of having fifty Dirhams or their equivalent in gold in the context of begging?","id":"tirmidhi-7-164"},{"hadith-eng":"Yahya bin Adam narrated to us, Sufyan narrated this Hadith to us from Hakim bin Jubair. So Abdullah bin Uthman, the companion of Shu'bah said to him (Sufyan): \"If only someone besides Hakim had narrated this (Hadith).\" Sufyan said to him, \"So what is with Hakim; Shu'bah would not narrate from him?\" He said: \"Yes.\" So Sufyan said: \"I heard Zubaid narrating this from Muhammad bin Abdur-Rahman bin Yazid.\"","reference":"Jami` at-Tirmidhi 651, Book 7, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role does the chain of narration play in the authenticity of a hadith?","id":"tirmidhi-7-165"},{"hadith-eng":"the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"","reference":"Jami` at-Tirmidhi 652, Book 7, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #3","question":"Why might charity not be permissible for those who are wealthy or physically fit?","id":"tirmidhi-7-166"},{"hadith-eng":"\"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"","reference":"Jami` at-Tirmidhi 653, Book 7, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does Islam view the act of begging for those who are wealthy or physically fit?","id":"tirmidhi-7-167"},{"hadith-eng":"There is another chain with a similar narration.","reference":"Jami` at-Tirmidhi 654, Book 7, Hadith 38","grade":"Da'if(Darussalam)","question #":"question #3","question":"What role does Jami` at-Tirmidhi play in the collection and classification of hadiths?","id":"tirmidhi-7-168"},{"hadith-eng":"\"During the time of the Messenger of Allah, a man suffered a loss on fruits that he had sold, resulting in more debt. The Messenger of Allah said: 'Give him charity.' So the people gave him charity but it did not cover his debt. So the Messenger of Allah said to his debtors: 'Take what you have and there is nothing for you but that.'\"","reference":"Jami` at-Tirmidhi 655, Book 7, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #3","question":"What role does community support play in helping individuals facing financial difficulties?","id":"tirmidhi-7-169"},{"hadith-eng":"\"When something was brought to him, the Messenger of Allah would ask: 'Is this charity or a gift?' If they said: 'Charity.' He would not eat it, and if they said, 'A gift' he would eat it.\"","reference":"Jami` at-Tirmidhi 656, Book 7, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #3","question":"What can be inferred about the Prophet's (ﷺ) approach to accepting gifts?","id":"tirmidhi-7-170"},{"hadith-eng":"the Messenger of Allah sent a man from Banu Makhzun to collect charity, so he said to Abu Rafi: \"Accompany me so that perhaps you may have some of it.\" So he said: \"Not until I ask the Messenger of Allah.\" So he went to the Prophet to ask him, and he said: \"Charity is not lawful for us, and to be the Mawda of a people to be the same as them.\"","reference":"Jami` at-Tirmidhi 657, Book 7, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of seeking the Prophet's guidance before making decisions in Islamic tradition?","id":"tirmidhi-7-171"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"","reference":"Jami` at-Tirmidhi 658, Book 7, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #3","question":"What alternative is suggested if dates are not available for breaking the fast?","id":"tirmidhi-7-172"},{"hadith-eng":"she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)","reference":"Jami` at-Tirmidhi 659, Book 7, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #3","question":"What is the significance of the verse from Al-Baqarah in understanding the concept of piety?","id":"tirmidhi-7-173"},{"hadith-eng":"the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"","reference":"Jami` at-Tirmidhi 660, Book 7, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of having duties on wealth apart from Zakat in Islam?","id":"tirmidhi-7-174"},{"hadith-eng":"the Messenger of Allah said: \"None gives charity from Tayyib - and Allah does not accept but Tayyib - but that Ar-Rahman accepts it with His Right (Hand). Even if it is a date, it is nurtured in the Hand of Ar-Rahman until it is greater than a mountain, just as one of you nurtures his foal or young camel.\"","reference":"Jami` at-Tirmidhi 661, Book 7, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #3","question":"What does the nurturing of charity by Allah symbolize in terms of spiritual growth and reward?","id":"tirmidhi-7-175"},{"hadith-eng":"the Messenger of Allah said: \"Indeed Allah accepts charity, and He accepts it with His Right (Hand) to nurture it for one of you, just like one of you would nurture his foal, until the bite (of food) becomes as large as Uhud.\" The Book of Allah, the Mighty and Sublime testifies to that: 'He accepts repentance from His worshipers, and accepts charity.'And: 'Allah will destroy Riba and give increase for charity.'1And: 'Allah will destroy Riba and will give increase for charity.'2(Abu 'Eisa) said: This Hadith is (Hasan) Sahih. It has been reported from'Aishah from the Prophet similarly. More than one of the people of knowledge have spoken about this Hadith, and the narrations that resemble it about the Attributes\nand the Descent of the Lord, Blessed and Most High, every night to the lowest Heaven. They said: \"The narrations about these are affirmed and should be believed in without misinterpreting them nor saying 'how'.\" It has been reported\nlike this from Malik (bin Anas), Suf'ãn bin 'Uyainah, 'Abdullãh bin A1-Mubarak; they would say about these Hadith: They are conveyed without saying how. This is the view of the people of knowledge among Ahl As-Sunnah wal-Jama'ah. As for\nthe Jahmiyyah, they reject these narrations and they say that this is\nTashbih.3And in other places in His Book, Allah, Blessed and Most\nHigh is He, has mentioned the Hand, the Hearing, the Seeing, so the Jahmiyyah misinterpret these Ayãt and give them interpretations other than the interpretations of the people of knowledge. They say that Allah did not create Adam with His Hand, and they say the meaning of Hand is merely power. Isaq bin Ibrahim said: At-Tashbih is only when one says 'Hand; like a hand or similar to a hand' or 'Hearing; like hearing or similar to hearing.' So\nwhen one says 'Hearing; like hearing or similar to hearing' then this is the Tashbih. As for when one says as Allah (Most High) said, Hand, Hearing, Seeing, and he does not say 'how' nor say 'similar to hearing' nor 'like hearing' then this is not Tashbih. It is merely as Allah, Blessed and Most High is He said: 'There is nothing like Him, and He is the All-Hearing, the All-Seeing.'(Ash-Shüra 42:11).1: At-Tawbah 9:104.2: Al-Baqarah 2:276.3: Anthropomorphism, resembling Allah to creatures.","reference":"Jami` at-Tirmidhi 662, Book 7, Hadith 46","grade":"Abu Eisa (at-Tirmidhi) said: This Hadith is Hasan Sahih.(Darussalam)","question #":"question #3","question":"How do the people of knowledge among Ahl As-Sunnah wal-Jama'ah view the narrations about Allah's attributes?","id":"tirmidhi-7-176"},{"hadith-eng":"the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"","reference":"Jami` at-Tirmidhi 663, Book 7, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does fasting in Sha'ban honor the month of Ramadan?","id":"tirmidhi-7-177"},{"hadith-eng":"the Messenger of Allah said: \"Indeed charity extinguishes the Lord's anger and it protects against the evil death.\"","reference":"Jami` at-Tirmidhi 664, Book 7, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the spiritual benefits of giving charity according to Islamic teachings?","id":"tirmidhi-7-178"},{"hadith-eng":"Umm Bujaid - and she was one of those who gave the pledge to the Prophet - she said to the Messenger of Allah: \"There is a needy person who stands outside my door, but I cannot find anything to give to him.\" So the Messenger of Allah said to her: \"If you do not find anything to give him except a burnt trotter then hand it over to him.\"","reference":"Jami` at-Tirmidhi 665, Book 7, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #3","question":"What can be learned about the attitude towards charity from the advice given by the Prophet to Umm Bujaid?","id":"tirmidhi-7-179"},{"hadith-eng":"\"The Messenger of Allah gave to me on the Day of Hunain, and he was the most hated creature to me. But he did not stop giving to me until he was the most loved creature to me.\"","reference":"Jami` at-Tirmidhi 666, Book 7, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the act of giving influence the feelings of the recipient towards the giver?","id":"tirmidhi-7-180"},{"hadith-eng":"\"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"","reference":"Jami` at-Tirmidhi 667, Book 7, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #3","question":"Can fasting be performed on behalf of someone who has passed away and had missed obligatory fasts?","id":"tirmidhi-7-181"},{"hadith-eng":"Umar gave a horse to be used in the cause of Allah. Then he saw it being sold, so he wanted to buy it, but the Prophet said: \"Do not take back what you have given in charity.\"","reference":"Jami` at-Tirmidhi 668, Book 7, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #3","question":"What guidance does Islam provide regarding the permanence of charitable acts?","id":"tirmidhi-7-182"},{"hadith-eng":"a man said: \"O Messenger of Allah! My mother died, will it benefit her if I give charity on her behalf?\" He said: 'Yes.' He said: 'I have a Makhraf, so bear witness that I have given it in charity on her behalf.'\"","reference":"Jami` at-Tirmidhi 669, Book 7, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #3","question":"How does the intention of the giver affect the reward of charity given on behalf of someone else?","id":"tirmidhi-7-183"},{"hadith-eng":"\"During a sermon of his in the year of the Farewell Hajj, I heard the Messenger of Allah say: 'A woman is not to spend anything from her husbands house without her husband's permission.' They said: 'O Messenger of Allah! What about food?' He said: 'That is our most virtuous wealth.'\"","reference":"Jami` at-Tirmidhi 670, Book 7, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #3","question":"What is considered the most virtuous wealth in a household according to the teachings of the Prophet Muhammad (ﷺ)?","id":"tirmidhi-7-184"},{"hadith-eng":"the Prophet said: \"When a woman gives in charity from her husband's house, she will get the reward for it, and for her husband is the same as that, and for the trustee is the same as that. The reward of each them will not be decreased at all by the reward of the other, for him is what he earned, and for her is what she spent.\"","reference":"Jami` at-Tirmidhi 671, Book 7, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #3","question":"Does the act of giving charity by a woman affect the rewards of her husband in any way?","id":"tirmidhi-7-185"},{"hadith-eng":"the Messenger of Allah said: \"When a woman gives from her husband's home, with a good heart, not to spoil it, then she will get a reward similar to his, for her is the good she intended - and the same is for the trustee.\"","reference":"Jami` at-Tirmidhi 672, Book 7, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the role of a trustee in ensuring the proper distribution of charity?","id":"tirmidhi-7-186"},{"hadith-eng":"\"We would give Zakat Al-Fitr - when the Messenger of Allah was among us - as a Sa of food, or a Sa of barely, or a Sa of dried dates, or a Sa of raisins, or a Sa of cheese. So we did not stop paying it (like that) until Mu'awiyah arrived in Al-Madinah and talked (about it). Among the things he addressed the people with, he said: 'I see that two Mudd of the wheat of Ash-Sham are equal to a Sa of dried dates.' So the people followed that.\" Abu Sa'eed said: \"I will not stop giving it in the manner that I had been giving it.\"","reference":"Jami` at-Tirmidhi 673, Book 7, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #3","question":"What is the significance of Abu Sa'eed Al-Khudri's decision to continue giving Zakat Al-Fitr in the traditional manner?","id":"tirmidhi-7-187"},{"hadith-eng":"the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"","reference":"Jami` at-Tirmidhi 674, Book 7, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the obligation of Sadaqatul-Fitr apply to different categories of people such as male, female, free, or slave?","id":"tirmidhi-7-188"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr an obligation upon the male and female, the free and the bondsmen, as a Sa of dried dates or a Sa of barley.\" He said: \"So the people equated that to half a Sa of wheat.\"","reference":"Jami` at-Tirmidhi 675, Book 7, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the different types of food items mentioned for Sadaqatul-Fitr?","id":"tirmidhi-7-189"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr of Ramadan an obligation - a Sa of dried dates or a Sa of barley - required upon every free person and slave, male and female among the Muslims.\"","reference":"Jami` at-Tirmidhi 676, Book 7, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the specified items that can be given as Sadaqatul-Fitr?","id":"tirmidhi-7-190"},{"hadith-eng":"the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.","reference":"Jami` at-Tirmidhi 677, Book 7, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #3","question":"What instructions did the Prophet Muhammad give regarding Zakat al-Fitr?","id":"tirmidhi-7-191"},{"hadith-eng":"\"Al-Abbas asked the Messenger of Allah about paying his charity (Zakat) in advance before its time is due (by being in possession for a whole year), he permitted him to do that.\"","reference":"Jami` at-Tirmidhi 678, Book 7, Hadith 62","grade":"Da'if(Darussalam)","question #":"question #3","question":"How does the concept of paying Zakat in advance reflect on one's financial planning and religious obligations?","id":"tirmidhi-7-192"},{"hadith-eng":"the Prophet said to Umar: \"We have taken this year's Zakat from Al-Abbas in the previous year.\"","reference":"Jami` at-Tirmidhi 679, Book 7, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #3","question":"What are the implications of collecting Zakat from a specific individual in advance?","id":"tirmidhi-7-193"},{"hadith-eng":"the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"","reference":"Jami` at-Tirmidhi 680, Book 7, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #3","question":"Why is the act of giving considered more virtuous than receiving in Islam?","id":"tirmidhi-7-194"},{"hadith-eng":"the Messenger of Allah said: \"Asking is a labor that toils on a man's face, except if a man asks for something from the Sultan (ruler), or he asks for something that he cannot do without.\"","reference":"Jami` at-Tirmidhi 681, Book 7, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #3","question":"What are the exceptions to the general discouragement of asking for help in Islam?","id":"tirmidhi-7-195"},{"hadith-eng":"\"I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah.\" He said: \"He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!'\" He said: \"I said t myself: Woe is me! Perhaps something has been revealed about me!'\" He said: \"So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'\"","reference":"Jami` at-Tirmidhi 617, Book 7, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the consequences of neglecting obligatory charity in Islam?","id":"tirmidhi-7-196"},{"hadith-eng":"that the Prophet said: \"When you pay the Zakat you have fulfilled what is required of you.\"","reference":"Jami` at-Tirmidhi 618, Book 7, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the act of paying Zakat contribute to a Muslim's spiritual responsibilities?","id":"tirmidhi-7-197"},{"hadith-eng":"\"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"","reference":"Jami` at-Tirmidhi 619, Book 7, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the conditions under which a Muslim is required to perform Hajj?","id":"tirmidhi-7-198"},{"hadith-eng":"the Messenger of Allah said: \"I have exempted charity on horses and slaves. So bring charity for silver, one Dirham for every forty Dirham. There is nothing for me (to collect) on one hundred and ninety Dirham, so when it reaches two hundred, then five Dirham of it (are due).\"","reference":"Jami` at-Tirmidhi 620, Book 7, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #4","question":"How much charity is due when silver reaches two hundred Dirhams?","id":"tirmidhi-7-199"},{"hadith-eng":"\"The Messenger of Allah had a letter written about charity, but he had not dispatched it to his governors until he died; he kept it with him along with his sword. When he died, Abu Bakr implemented it until he died, as did Umar until he died. In it was: 'A sheep (is due) on five camels, two sheeps on ten, three sheeps on fifteen, four sheeps for twenty, a Bint Makhad on twenty-five to thirty-five. When it is more than that, then a Bint Labun, (is due, till the number of the camels reaches) forty-five. When it is more than that, then a Hiqqah until sixty. When it is more than that, then a Jadhah until seventy-five. When it is more than one hundred and twenty, then a Hiqqah on every fifty, and a Bint Labun on every forty. For sheep; one sheep (is due) for every forty sheeps until one hundred and twenty. When it is more than that, then two sheeps until two hundred. When it is more than that, then three sheeps until three hundred sheep. When it is more than three hundred sheep, then a sheep on every hundred sheep. Then there is nothing until it reaches four hundred. There is no combining the (property of) individuals nor separating the collective (property) fearing Sadaqah. And fr whatever is mixed together that two own, then they are to refer to the total. Neither an old or defective (animal) may be taken for charity.\"","reference":"Jami` at-Tirmidhi 621, Book 7, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of not combining or separating property to avoid sadaqah?","id":"tirmidhi-7-200"},{"hadith-eng":"the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"","reference":"Jami` at-Tirmidhi 622, Book 7, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the required zakat for owning forty cows?","id":"tirmidhi-7-201"},{"hadith-eng":"\"The Prophet sent me to Yemen and ordered me to collect a Tabi or a Tabi'ah on every thirty cows, a Musinnah on every forty, a Dinar for every Halim, or its equivalent of Ma'afir.\"Abu Eisa said: This Hadith is Hasan. Some of them reported this Hadith from Sufyan, from Al-A'mash, from Abu Wa'il, from Masruq: \"The Prophet sent Mu'adh to Yemen and ordered him to take...\" and this is more authentic","reference":"Jami` at-Tirmidhi 623, Book 7, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #4","question":"What does the term 'Musinnah' refer to in the context of zakat collection?","id":"tirmidhi-7-202"},{"hadith-eng":"Muhammad bin Ja'far narrated to us, from Shu'bah, from Amr bin Murrah who said: \"I asked Abu Ubaidah bin Abdullah: 'Did you remember anything from Abdullah?' He said, 'No'\"","reference":"Jami` at-Tirmidhi 624, Book 7, Hadith 8","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to have reliable narrators in the chain of hadith transmission?","id":"tirmidhi-7-203"},{"hadith-eng":"the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"","reference":"Jami` at-Tirmidhi 625, Book 7, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to avoid taking the most precious wealth of others in Islamic teachings?","id":"tirmidhi-7-204"},{"hadith-eng":"the Prophet said: \"There is no charity due on less than five camels, and there is no charity due on what is less than five Uqiyah (of silver), and there is no charity due on what is less than five Wasaq.\"","reference":"Jami` at-Tirmidhi 626, Book 7, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the minimum amount of agricultural produce required for charity to be obligatory?","id":"tirmidhi-7-205"},{"hadith-eng":"the Prophet said (similar t Hadith no. 626).","reference":"Jami` at-Tirmidhi 627, Book 7, Hadith 11","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to reference the book and hadith number when discussing a hadith?","id":"tirmidhi-7-206"},{"hadith-eng":"the Messenger of Allah said:  \"There is no charity due from a Muslim for his horse nor his slave.\"","reference":"Jami` at-Tirmidhi 628, Book 7, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #4","question":"What are the implications of this hadith on the financial responsibilities of a Muslim?","id":"tirmidhi-7-207"},{"hadith-eng":"the Messenger of Allah said: \"A Ziqq is due for every ten Ziqq of honey.\"","reference":"Jami` at-Tirmidhi 629, Book 7, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islamic law determine the amount of due on honey production?","id":"tirmidhi-7-208"},{"hadith-eng":"Nafi said: \"Umar bin Adbul-Aziz asked me about charity due on honey, so I said to him: 'We do not have honey that we could give charity from, but Al-Mughirah bin Hakim informed us that he (pbuh) said: 'There is no charity due on honey.' So Umar said: 'That is fair enough for me.' So he wrote to the people that is be lifted, meaning (the duty of paying it) from them.\"","reference":"Jami` at-Tirmidhi 630, Book 7, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the narration illustrate the process of decision-making based on hadith?","id":"tirmidhi-7-209"},{"hadith-eng":"the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"","reference":"Jami` at-Tirmidhi 631, Book 7, Hadith 15","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why is the possession of wealth for a specific duration important in determining Zakat liability?","id":"tirmidhi-7-210"},{"hadith-eng":"\"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed while it is in his possession.\"","reference":"Jami` at-Tirmidhi 632, Book 7, Hadith 16","grade":"","question #":"question #4","question":"How does the timing of Zakat payment relate to the Islamic lunar calendar?","id":"tirmidhi-7-211"},{"hadith-eng":"the Messenger of Allah said: \"Two Qiblahs in one land are of no benefit, and there is no Jizyah upon the Muslims.\"","reference":"Jami` at-Tirmidhi 633, Book 7, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the absence of Jizyah apply to Muslims in an Islamic state?","id":"tirmidhi-7-212"},{"hadith-eng":"(A similar narration as no. 633.)","reference":"Jami` at-Tirmidhi 634, Book 7, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #4","question":"How do different hadith collections contribute to Islamic jurisprudence?","id":"tirmidhi-7-213"},{"hadith-eng":"\"The Messenger of Allah delivered a sermon to us, and said: 'O you women! Give charity, even if it is from your jewelry, for indeed you will make up most of the people of Hell on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 635, Book 7, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why might women be encouraged to give charity more frequently in Islamic teachings?","id":"tirmidhi-7-214"},{"hadith-eng":"Zainab, the wife of Abdullah narrated similarly from the Prophet.","reference":"Jami` at-Tirmidhi 636, Book 7, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #4","question":"What can be inferred about the role of women in the early Islamic community from this narration?","id":"tirmidhi-7-215"},{"hadith-eng":"that two women came to the Messenger of Allah, and they each had a bracelet of gold on their forearms. So he said to them: \"Have you paid their Zakat?\" They said, \"No.\" The Messenger of Allah said to them: \"Would you like for Allah to fashion then into two bracelets of Fire?\" They said, \"No.\" He said: \"Then pay its Zakat.\"","reference":"Jami` at-Tirmidhi 637, Book 7, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the role of the Prophet Muhammad in guiding Muslims on the obligations of Zakat?","id":"tirmidhi-7-216"},{"hadith-eng":"Mu'adh had written to the Prophet to ask him about greens - which is \"herbs\" - so he (pbuh) said, \"There is nothing due on them.\"","reference":"Jami` at-Tirmidhi 638, Book 7, Hadith 22","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does Islamic jurisprudence address the issue of zakat on different types of crops?","id":"tirmidhi-7-217"},{"hadith-eng":"the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"","reference":"Jami` at-Tirmidhi 639, Book 7, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #4","question":"Why is there a distinction between natural and artificial irrigation in determining the Ushr?","id":"tirmidhi-7-218"},{"hadith-eng":"the Messenger of Allah instituted the Ushr of what was watered by the heavens and steams, or through natural channels, and half of the Ushr for what is watered by irrigation.","reference":"Jami` at-Tirmidhi 640, Book 7, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islamic law differentiate between natural and artificial irrigation in terms of taxation?","id":"tirmidhi-7-219"},{"hadith-eng":"the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"","reference":"Jami` at-Tirmidhi 641, Book 7, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #4","question":"What guidance does Islam provide for managing the financial affairs of orphans?","id":"tirmidhi-7-220"},{"hadith-eng":"the Messenger of Allah said: \"The injuries caused by the animal are without liability, and mines are without liability, and wells are without liability, and the Khumus is due on Rikaz.\"","reference":"Jami` at-Tirmidhi 642, Book 7, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of Khumus in relation to Rikaz?","id":"tirmidhi-7-221"},{"hadith-eng":"\"Sahl bin Abi Hathmah came to a gathering of ours, and he narrated that the Messenger of Allah would say: \"When you make an assessment, then take it and leave a third, if you do not leave a third, then leave a quarter.\"","reference":"Jami` at-Tirmidhi 643, Book 7, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #4","question":"What is the significance of leaving a third or a quarter in assessments as per Islamic principles?","id":"tirmidhi-7-222"},{"hadith-eng":"the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"","reference":"Jami` at-Tirmidhi 644, Book 7, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the significance of paying zakat in the form of raisins for grapevines?","id":"tirmidhi-7-223"},{"hadith-eng":"\"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"","reference":"Jami` at-Tirmidhi 645, Book 7, Hadith 29","grade":"Hasan(Darussalam)","question #":"question #4","question":"What rewards are mentioned for those who work truthfully in collecting charity?","id":"tirmidhi-7-224"},{"hadith-eng":"the Messenger of Allah said: \"The one who commits transgression with charity is like the one who does not pay it.\"","reference":"Jami` at-Tirmidhi 646, Book 7, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does Islam view the integrity of handling charitable donations?","id":"tirmidhi-7-225"},{"hadith-eng":"the Prophet said: \"When the charity collector comes to you, then he should not depart from you except while pleased.\"","reference":"Jami` at-Tirmidhi 647, Book 7, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important for a charity collector to be pleased with the community's response?","id":"tirmidhi-7-226"},{"hadith-eng":"\"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"","reference":"Jami` at-Tirmidhi 649, Book 7, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the Islamic system of charity address the needs of vulnerable individuals like orphans?","id":"tirmidhi-7-227"},{"hadith-eng":"the Messenger of Allah said: \"Whoever begs from the people while he has what he needs, he will come on the Day of Judgment and his begging with be scratches or lacerations, or bite marks on his face.\" They said: \"O Messenger of Allah! 'How much is it that one needs?' He said: 'Fifty Dirham, or their value in gold.'\"","reference":"Jami` at-Tirmidhi 650, Book 7, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the ethical implications of begging when one has sufficient means?","id":"tirmidhi-7-228"},{"hadith-eng":"Yahya bin Adam narrated to us, Sufyan narrated this Hadith to us from Hakim bin Jubair. So Abdullah bin Uthman, the companion of Shu'bah said to him (Sufyan): \"If only someone besides Hakim had narrated this (Hadith).\" Sufyan said to him, \"So what is with Hakim; Shu'bah would not narrate from him?\" He said: \"Yes.\" So Sufyan said: \"I heard Zubaid narrating this from Muhammad bin Abdur-Rahman bin Yazid.\"","reference":"Jami` at-Tirmidhi 651, Book 7, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #4","question":"Why might a scholar express concern over a particular narrator in the chain of a hadith?","id":"tirmidhi-7-229"},{"hadith-eng":"the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"","reference":"Jami` at-Tirmidhi 652, Book 7, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does physical ability impact one's eligibility to receive charity in Islam?","id":"tirmidhi-7-230"},{"hadith-eng":"\"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"","reference":"Jami` at-Tirmidhi 653, Book 7, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the significance of the Farewell Hajj in the context of this teaching?","id":"tirmidhi-7-231"},{"hadith-eng":"\"During the time of the Messenger of Allah, a man suffered a loss on fruits that he had sold, resulting in more debt. The Messenger of Allah said: 'Give him charity.' So the people gave him charity but it did not cover his debt. So the Messenger of Allah said to his debtors: 'Take what you have and there is nothing for you but that.'\"","reference":"Jami` at-Tirmidhi 655, Book 7, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #4","question":"What guidance does Islam provide for dealing with debts that cannot be fully repaid?","id":"tirmidhi-7-232"},{"hadith-eng":"\"When something was brought to him, the Messenger of Allah would ask: 'Is this charity or a gift?' If they said: 'Charity.' He would not eat it, and if they said, 'A gift' he would eat it.\"","reference":"Jami` at-Tirmidhi 656, Book 7, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #4","question":"How does the classification of an item as charity or a gift affect its permissibility for consumption by the Prophet (ﷺ)?","id":"tirmidhi-7-233"},{"hadith-eng":"the Messenger of Allah sent a man from Banu Makhzun to collect charity, so he said to Abu Rafi: \"Accompany me so that perhaps you may have some of it.\" So he said: \"Not until I ask the Messenger of Allah.\" So he went to the Prophet to ask him, and he said: \"Charity is not lawful for us, and to be the Mawda of a people to be the same as them.\"","reference":"Jami` at-Tirmidhi 657, Book 7, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does it mean to be the Mawda of a people in the context of this narration?","id":"tirmidhi-7-234"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"","reference":"Jami` at-Tirmidhi 658, Book 7, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #4","question":"How is water described in terms of its benefits when breaking the fast?","id":"tirmidhi-7-235"},{"hadith-eng":"she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)","reference":"Jami` at-Tirmidhi 659, Book 7, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of charity extend beyond the obligatory Zakat in Islam?","id":"tirmidhi-7-236"},{"hadith-eng":"the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"","reference":"Jami` at-Tirmidhi 660, Book 7, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the concept of financial duty in Islam extend beyond the obligatory charity?","id":"tirmidhi-7-237"},{"hadith-eng":"the Messenger of Allah said: \"None gives charity from Tayyib - and Allah does not accept but Tayyib - but that Ar-Rahman accepts it with His Right (Hand). Even if it is a date, it is nurtured in the Hand of Ar-Rahman until it is greater than a mountain, just as one of you nurtures his foal or young camel.\"","reference":"Jami` at-Tirmidhi 661, Book 7, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important for charity to be accepted by Allah, and what conditions must it meet?","id":"tirmidhi-7-238"},{"hadith-eng":"the Messenger of Allah said: \"Indeed Allah accepts charity, and He accepts it with His Right (Hand) to nurture it for one of you, just like one of you would nurture his foal, until the bite (of food) becomes as large as Uhud.\" The Book of Allah, the Mighty and Sublime testifies to that: 'He accepts repentance from His worshipers, and accepts charity.'And: 'Allah will destroy Riba and give increase for charity.'1And: 'Allah will destroy Riba and will give increase for charity.'2(Abu 'Eisa) said: This Hadith is (Hasan) Sahih. It has been reported from'Aishah from the Prophet similarly. More than one of the people of knowledge have spoken about this Hadith, and the narrations that resemble it about the Attributes\nand the Descent of the Lord, Blessed and Most High, every night to the lowest Heaven. They said: \"The narrations about these are affirmed and should be believed in without misinterpreting them nor saying 'how'.\" It has been reported\nlike this from Malik (bin Anas), Suf'ãn bin 'Uyainah, 'Abdullãh bin A1-Mubarak; they would say about these Hadith: They are conveyed without saying how. This is the view of the people of knowledge among Ahl As-Sunnah wal-Jama'ah. As for\nthe Jahmiyyah, they reject these narrations and they say that this is\nTashbih.3And in other places in His Book, Allah, Blessed and Most\nHigh is He, has mentioned the Hand, the Hearing, the Seeing, so the Jahmiyyah misinterpret these Ayãt and give them interpretations other than the interpretations of the people of knowledge. They say that Allah did not create Adam with His Hand, and they say the meaning of Hand is merely power. Isaq bin Ibrahim said: At-Tashbih is only when one says 'Hand; like a hand or similar to a hand' or 'Hearing; like hearing or similar to hearing.' So\nwhen one says 'Hearing; like hearing or similar to hearing' then this is the Tashbih. As for when one says as Allah (Most High) said, Hand, Hearing, Seeing, and he does not say 'how' nor say 'similar to hearing' nor 'like hearing' then this is not Tashbih. It is merely as Allah, Blessed and Most High is He said: 'There is nothing like Him, and He is the All-Hearing, the All-Seeing.'(Ash-Shüra 42:11).1: At-Tawbah 9:104.2: Al-Baqarah 2:276.3: Anthropomorphism, resembling Allah to creatures.","reference":"Jami` at-Tirmidhi 662, Book 7, Hadith 46","grade":"Abu Eisa (at-Tirmidhi) said: This Hadith is Hasan Sahih.(Darussalam)","question #":"question #4","question":"What is the stance of the Jahmiyyah regarding the narrations about Allah's attributes?","id":"tirmidhi-7-239"},{"hadith-eng":"the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"","reference":"Jami` at-Tirmidhi 663, Book 7, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #4","question":"What are the virtues associated with fasting outside of Ramadan?","id":"tirmidhi-7-240"},{"hadith-eng":"the Messenger of Allah said: \"Indeed charity extinguishes the Lord's anger and it protects against the evil death.\"","reference":"Jami` at-Tirmidhi 664, Book 7, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #4","question":"In what ways can charity impact a person's life and afterlife in Islam?","id":"tirmidhi-7-241"},{"hadith-eng":"Umm Bujaid - and she was one of those who gave the pledge to the Prophet - she said to the Messenger of Allah: \"There is a needy person who stands outside my door, but I cannot find anything to give to him.\" So the Messenger of Allah said to her: \"If you do not find anything to give him except a burnt trotter then hand it over to him.\"","reference":"Jami` at-Tirmidhi 665, Book 7, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of generosity manifest in Islamic teachings, especially when resources are limited?","id":"tirmidhi-7-242"},{"hadith-eng":"\"The Messenger of Allah gave to me on the Day of Hunain, and he was the most hated creature to me. But he did not stop giving to me until he was the most loved creature to me.\"","reference":"Jami` at-Tirmidhi 666, Book 7, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #4","question":"What role does generosity play in transforming enmity into love?","id":"tirmidhi-7-243"},{"hadith-eng":"\"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"","reference":"Jami` at-Tirmidhi 667, Book 7, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #4","question":"Is it permissible to perform Hajj on behalf of a deceased person who did not fulfill this obligation during their lifetime?","id":"tirmidhi-7-244"},{"hadith-eng":"Umar gave a horse to be used in the cause of Allah. Then he saw it being sold, so he wanted to buy it, but the Prophet said: \"Do not take back what you have given in charity.\"","reference":"Jami` at-Tirmidhi 668, Book 7, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #4","question":"What ethical considerations are involved in the act of giving and taking back charity?","id":"tirmidhi-7-245"},{"hadith-eng":"a man said: \"O Messenger of Allah! My mother died, will it benefit her if I give charity on her behalf?\" He said: 'Yes.' He said: 'I have a Makhraf, so bear witness that I have given it in charity on her behalf.'\"","reference":"Jami` at-Tirmidhi 669, Book 7, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the significance of making a public declaration when giving charity on behalf of someone?","id":"tirmidhi-7-246"},{"hadith-eng":"\"During a sermon of his in the year of the Farewell Hajj, I heard the Messenger of Allah say: 'A woman is not to spend anything from her husbands house without her husband's permission.' They said: 'O Messenger of Allah! What about food?' He said: 'That is our most virtuous wealth.'\"","reference":"Jami` at-Tirmidhi 670, Book 7, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #4","question":"What guidelines does Islam provide regarding a wife's spending from her husband's property?","id":"tirmidhi-7-247"},{"hadith-eng":"the Prophet said: \"When a woman gives in charity from her husband's house, she will get the reward for it, and for her husband is the same as that, and for the trustee is the same as that. The reward of each them will not be decreased at all by the reward of the other, for him is what he earned, and for her is what she spent.\"","reference":"Jami` at-Tirmidhi 671, Book 7, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #4","question":"What does this hadith imply about the concept of earning and spending in Islam?","id":"tirmidhi-7-248"},{"hadith-eng":"the Messenger of Allah said: \"When a woman gives from her husband's home, with a good heart, not to spoil it, then she will get a reward similar to his, for her is the good she intended - and the same is for the trustee.\"","reference":"Jami` at-Tirmidhi 672, Book 7, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the sharing of rewards between a husband and wife in charitable acts?","id":"tirmidhi-7-249"},{"hadith-eng":"\"We would give Zakat Al-Fitr - when the Messenger of Allah was among us - as a Sa of food, or a Sa of barely, or a Sa of dried dates, or a Sa of raisins, or a Sa of cheese. So we did not stop paying it (like that) until Mu'awiyah arrived in Al-Madinah and talked (about it). Among the things he addressed the people with, he said: 'I see that two Mudd of the wheat of Ash-Sham are equal to a Sa of dried dates.' So the people followed that.\" Abu Sa'eed said: \"I will not stop giving it in the manner that I had been giving it.\"","reference":"Jami` at-Tirmidhi 673, Book 7, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does the concept of equivalence in food items relate to the practice of Zakat Al-Fitr?","id":"tirmidhi-7-250"},{"hadith-eng":"the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"","reference":"Jami` at-Tirmidhi 674, Book 7, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #4","question":"What is the significance of Sadaqatul-Fitr in the context of Islamic charity?","id":"tirmidhi-7-251"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr an obligation upon the male and female, the free and the bondsmen, as a Sa of dried dates or a Sa of barley.\" He said: \"So the people equated that to half a Sa of wheat.\"","reference":"Jami` at-Tirmidhi 675, Book 7, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #4","question":"How did people equate the measurement of Sadaqatul-Fitr to wheat?","id":"tirmidhi-7-252"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr of Ramadan an obligation - a Sa of dried dates or a Sa of barley - required upon every free person and slave, male and female among the Muslims.\"","reference":"Jami` at-Tirmidhi 676, Book 7, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Sadaqatul-Fitr relate to the month of Ramadan?","id":"tirmidhi-7-253"},{"hadith-eng":"the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.","reference":"Jami` at-Tirmidhi 677, Book 7, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #4","question":"Why is it important to fulfill the obligation of Zakat before the Eid prayer?","id":"tirmidhi-7-254"},{"hadith-eng":"\"Al-Abbas asked the Messenger of Allah about paying his charity (Zakat) in advance before its time is due (by being in possession for a whole year), he permitted him to do that.\"","reference":"Jami` at-Tirmidhi 678, Book 7, Hadith 62","grade":"Da'if(Darussalam)","question #":"question #4","question":"What guidance did the Prophet Muhammad (ﷺ) provide regarding the timing of Zakat payment?","id":"tirmidhi-7-255"},{"hadith-eng":"the Prophet said to Umar: \"We have taken this year's Zakat from Al-Abbas in the previous year.\"","reference":"Jami` at-Tirmidhi 679, Book 7, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #4","question":"How does the practice of Zakat contribute to the welfare of the community?","id":"tirmidhi-7-256"},{"hadith-eng":"the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"","reference":"Jami` at-Tirmidhi 680, Book 7, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #4","question":"What is the recommended order of priority when giving charity according to Islamic teachings?","id":"tirmidhi-7-257"},{"hadith-eng":"the Messenger of Allah said: \"Asking is a labor that toils on a man's face, except if a man asks for something from the Sultan (ruler), or he asks for something that he cannot do without.\"","reference":"Jami` at-Tirmidhi 681, Book 7, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #4","question":"How does Islam view the act of asking for something one cannot do without?","id":"tirmidhi-7-258"},{"hadith-eng":"\"I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah.\" He said: \"He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!'\" He said: \"I said t myself: Woe is me! Perhaps something has been revealed about me!'\" He said: \"So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'\"","reference":"Jami` at-Tirmidhi 617, Book 7, Hadith 1","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of accountability manifest in Islamic teachings about wealth?","id":"tirmidhi-7-259"},{"hadith-eng":"that the Prophet said: \"When you pay the Zakat you have fulfilled what is required of you.\"","reference":"Jami` at-Tirmidhi 618, Book 7, Hadith 2","grade":"Hasan(Darussalam)","question #":"question #5","question":"What role does Zakat play in the overall practice of Islam?","id":"tirmidhi-7-260"},{"hadith-eng":"\"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"","reference":"Jami` at-Tirmidhi 619, Book 7, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the testimony of a Bedouin reflect the core obligations of a Muslim?","id":"tirmidhi-7-261"},{"hadith-eng":"the Messenger of Allah said: \"I have exempted charity on horses and slaves. So bring charity for silver, one Dirham for every forty Dirham. There is nothing for me (to collect) on one hundred and ninety Dirham, so when it reaches two hundred, then five Dirham of it (are due).\"","reference":"Jami` at-Tirmidhi 620, Book 7, Hadith 4","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the significance of the exemption of charity on certain items in Islam?","id":"tirmidhi-7-262"},{"hadith-eng":"\"The Messenger of Allah had a letter written about charity, but he had not dispatched it to his governors until he died; he kept it with him along with his sword. When he died, Abu Bakr implemented it until he died, as did Umar until he died. In it was: 'A sheep (is due) on five camels, two sheeps on ten, three sheeps on fifteen, four sheeps for twenty, a Bint Makhad on twenty-five to thirty-five. When it is more than that, then a Bint Labun, (is due, till the number of the camels reaches) forty-five. When it is more than that, then a Hiqqah until sixty. When it is more than that, then a Jadhah until seventy-five. When it is more than one hundred and twenty, then a Hiqqah on every fifty, and a Bint Labun on every forty. For sheep; one sheep (is due) for every forty sheeps until one hundred and twenty. When it is more than that, then two sheeps until two hundred. When it is more than that, then three sheeps until three hundred sheep. When it is more than three hundred sheep, then a sheep on every hundred sheep. Then there is nothing until it reaches four hundred. There is no combining the (property of) individuals nor separating the collective (property) fearing Sadaqah. And fr whatever is mixed together that two own, then they are to refer to the total. Neither an old or defective (animal) may be taken for charity.\"","reference":"Jami` at-Tirmidhi 621, Book 7, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #5","question":"How is shared ownership of livestock addressed in the context of zakat?","id":"tirmidhi-7-263"},{"hadith-eng":"the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"","reference":"Jami` at-Tirmidhi 622, Book 7, Hadith 6","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of zakat apply to livestock in Islam?","id":"tirmidhi-7-264"},{"hadith-eng":"\"The Prophet sent me to Yemen and ordered me to collect a Tabi or a Tabi'ah on every thirty cows, a Musinnah on every forty, a Dinar for every Halim, or its equivalent of Ma'afir.\"Abu Eisa said: This Hadith is Hasan. Some of them reported this Hadith from Sufyan, from Al-A'mash, from Abu Wa'il, from Masruq: \"The Prophet sent Mu'adh to Yemen and ordered him to take...\" and this is more authentic","reference":"Jami` at-Tirmidhi 623, Book 7, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #5","question":"How is the equivalent of a Dinar or Ma'afir determined in the context of this hadith?","id":"tirmidhi-7-265"},{"hadith-eng":"the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"","reference":"Jami` at-Tirmidhi 625, Book 7, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the supplication of the oppressed in Islamic belief?","id":"tirmidhi-7-266"},{"hadith-eng":"the Prophet said: \"There is no charity due on less than five camels, and there is no charity due on what is less than five Uqiyah (of silver), and there is no charity due on what is less than five Wasaq.\"","reference":"Jami` at-Tirmidhi 626, Book 7, Hadith 10","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic law determine the threshold for obligatory charity on livestock and wealth?","id":"tirmidhi-7-267"},{"hadith-eng":"the Messenger of Allah said:  \"There is no charity due from a Muslim for his horse nor his slave.\"","reference":"Jami` at-Tirmidhi 628, Book 7, Hadith 12","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this teaching reflect on the economic aspects of Islamic law regarding personal property?","id":"tirmidhi-7-268"},{"hadith-eng":"the Messenger of Allah said: \"A Ziqq is due for every ten Ziqq of honey.\"","reference":"Jami` at-Tirmidhi 629, Book 7, Hadith 13","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the implications of not paying the due on honey as prescribed in Islamic teachings?","id":"tirmidhi-7-269"},{"hadith-eng":"Nafi said: \"Umar bin Adbul-Aziz asked me about charity due on honey, so I said to him: 'We do not have honey that we could give charity from, but Al-Mughirah bin Hakim informed us that he (pbuh) said: 'There is no charity due on honey.' So Umar said: 'That is fair enough for me.' So he wrote to the people that is be lifted, meaning (the duty of paying it) from them.\"","reference":"Jami` at-Tirmidhi 630, Book 7, Hadith 14","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does consultation play in determining religious obligations in Islam?","id":"tirmidhi-7-270"},{"hadith-eng":"the Messenger of Allah said: \"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed (while it is in his possession).\"","reference":"Jami` at-Tirmidhi 631, Book 7, Hadith 15","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of not having to pay Zakat on newly acquired wealth immediately?","id":"tirmidhi-7-271"},{"hadith-eng":"\"Whoever acquired wealth, then there is no Zakat on it until the Hawl has passed while it is in his possession.\"","reference":"Jami` at-Tirmidhi 632, Book 7, Hadith 16","grade":"","question #":"question #5","question":"What is the role of ownership duration in determining Zakat liability on wealth?","id":"tirmidhi-7-272"},{"hadith-eng":"the Messenger of Allah said: \"Two Qiblahs in one land are of no benefit, and there is no Jizyah upon the Muslims.\"","reference":"Jami` at-Tirmidhi 633, Book 7, Hadith 17","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of having multiple Qiblahs in one land?","id":"tirmidhi-7-273"},{"hadith-eng":"(A similar narration as no. 633.)","reference":"Jami` at-Tirmidhi 634, Book 7, Hadith 18","grade":"Da'if(Darussalam)","question #":"question #5","question":"What is the importance of referencing in hadith literature?","id":"tirmidhi-7-274"},{"hadith-eng":"\"The Messenger of Allah delivered a sermon to us, and said: 'O you women! Give charity, even if it is from your jewelry, for indeed you will make up most of the people of Hell on the Day of Judgment.'\"","reference":"Jami` at-Tirmidhi 635, Book 7, Hadith 19","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the implications of being among the majority of people in Hell on the Day of Judgment in Islamic belief?","id":"tirmidhi-7-275"},{"hadith-eng":"Zainab, the wife of Abdullah narrated similarly from the Prophet.","reference":"Jami` at-Tirmidhi 636, Book 7, Hadith 20","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the relationship between narrators affect the credibility of a hadith?","id":"tirmidhi-7-276"},{"hadith-eng":"that two women came to the Messenger of Allah, and they each had a bracelet of gold on their forearms. So he said to them: \"Have you paid their Zakat?\" They said, \"No.\" The Messenger of Allah said to them: \"Would you like for Allah to fashion then into two bracelets of Fire?\" They said, \"No.\" He said: \"Then pay its Zakat.\"","reference":"Jami` at-Tirmidhi 637, Book 7, Hadith 21","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the fear of punishment influence the actions of believers in fulfilling their religious duties?","id":"tirmidhi-7-277"},{"hadith-eng":"the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"","reference":"Jami` at-Tirmidhi 639, Book 7, Hadith 23","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of Ushr reflect the principles of fairness and justice in Islamic economic practices?","id":"tirmidhi-7-278"},{"hadith-eng":"the Messenger of Allah instituted the Ushr of what was watered by the heavens and steams, or through natural channels, and half of the Ushr for what is watered by irrigation.","reference":"Jami` at-Tirmidhi 640, Book 7, Hadith 24","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of natural channels in determining the Ushr on agricultural produce?","id":"tirmidhi-7-279"},{"hadith-eng":"the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"","reference":"Jami` at-Tirmidhi 641, Book 7, Hadith 25","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the potential consequences of not managing an orphan's wealth properly?","id":"tirmidhi-7-280"},{"hadith-eng":"the Messenger of Allah said: \"The injuries caused by the animal are without liability, and mines are without liability, and wells are without liability, and the Khumus is due on Rikaz.\"","reference":"Jami` at-Tirmidhi 642, Book 7, Hadith 26","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islamic law define and treat the concept of Rikaz?","id":"tirmidhi-7-281"},{"hadith-eng":"\"Sahl bin Abi Hathmah came to a gathering of ours, and he narrated that the Messenger of Allah would say: \"When you make an assessment, then take it and leave a third, if you do not leave a third, then leave a quarter.\"","reference":"Jami` at-Tirmidhi 643, Book 7, Hadith 27","grade":"Hasan(Darussalam)","question #":"question #5","question":"How can one ensure ethical practices in trade and commerce in Islam?","id":"tirmidhi-7-282"},{"hadith-eng":"the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"","reference":"Jami` at-Tirmidhi 644, Book 7, Hadith 28","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the similarities in the assessment of zakat for grapevines and date-palms?","id":"tirmidhi-7-283"},{"hadith-eng":"\"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"","reference":"Jami` at-Tirmidhi 645, Book 7, Hadith 29","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does Islam view the role of those who manage and collect charitable contributions?","id":"tirmidhi-7-284"},{"hadith-eng":"the Messenger of Allah said: \"The one who commits transgression with charity is like the one who does not pay it.\"","reference":"Jami` at-Tirmidhi 646, Book 7, Hadith 30","grade":"Hasan(Darussalam)","question #":"question #5","question":"What are the ethical considerations in the distribution and use of charity according to Islamic principles?","id":"tirmidhi-7-285"},{"hadith-eng":"the Prophet said: \"When the charity collector comes to you, then he should not depart from you except while pleased.\"","reference":"Jami` at-Tirmidhi 647, Book 7, Hadith 31","grade":"Sahih(Darussalam)","question #":"question #5","question":"What can be inferred about the relationship between charity collectors and the community from this teaching?","id":"tirmidhi-7-286"},{"hadith-eng":"\"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"","reference":"Jami` at-Tirmidhi 649, Book 7, Hadith 33","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the responsibilities of a charity collector in the Islamic tradition?","id":"tirmidhi-7-287"},{"hadith-eng":"the Messenger of Allah said: \"Whoever begs from the people while he has what he needs, he will come on the Day of Judgment and his begging with be scratches or lacerations, or bite marks on his face.\" They said: \"O Messenger of Allah! 'How much is it that one needs?' He said: 'Fifty Dirham, or their value in gold.'\"","reference":"Jami` at-Tirmidhi 650, Book 7, Hadith 34","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the concept of accountability on the Day of Judgment relate to the act of begging?","id":"tirmidhi-7-288"},{"hadith-eng":"Yahya bin Adam narrated to us, Sufyan narrated this Hadith to us from Hakim bin Jubair. So Abdullah bin Uthman, the companion of Shu'bah said to him (Sufyan): \"If only someone besides Hakim had narrated this (Hadith).\" Sufyan said to him, \"So what is with Hakim; Shu'bah would not narrate from him?\" He said: \"Yes.\" So Sufyan said: \"I heard Zubaid narrating this from Muhammad bin Abdur-Rahman bin Yazid.\"","reference":"Jami` at-Tirmidhi 651, Book 7, Hadith 35","grade":"Da'if(Darussalam)","question #":"question #5","question":"How do differences in narrators affect the acceptance of a hadith?","id":"tirmidhi-7-289"},{"hadith-eng":"the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"","reference":"Jami` at-Tirmidhi 652, Book 7, Hadith 36","grade":"Hasan(Darussalam)","question #":"question #5","question":"What is the significance of financial status in determining eligibility for charity?","id":"tirmidhi-7-290"},{"hadith-eng":"\"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"","reference":"Jami` at-Tirmidhi 653, Book 7, Hadith 37","grade":"Da'if(Darussalam)","question #":"question #5","question":"What are the implications of begging on the Day of Judgment as described in Islamic teachings?","id":"tirmidhi-7-291"},{"hadith-eng":"\"During the time of the Messenger of Allah, a man suffered a loss on fruits that he had sold, resulting in more debt. The Messenger of Allah said: 'Give him charity.' So the people gave him charity but it did not cover his debt. So the Messenger of Allah said to his debtors: 'Take what you have and there is nothing for you but that.'\"","reference":"Jami` at-Tirmidhi 655, Book 7, Hadith 39","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of charity relate to resolving financial obligations in Islam?","id":"tirmidhi-7-292"},{"hadith-eng":"\"When something was brought to him, the Messenger of Allah would ask: 'Is this charity or a gift?' If they said: 'Charity.' He would not eat it, and if they said, 'A gift' he would eat it.\"","reference":"Jami` at-Tirmidhi 656, Book 7, Hadith 40","grade":"Hasan(Darussalam)","question #":"question #5","question":"What does this narration teach about the etiquette of giving and receiving in Islam?","id":"tirmidhi-7-293"},{"hadith-eng":"the Messenger of Allah sent a man from Banu Makhzun to collect charity, so he said to Abu Rafi: \"Accompany me so that perhaps you may have some of it.\" So he said: \"Not until I ask the Messenger of Allah.\" So he went to the Prophet to ask him, and he said: \"Charity is not lawful for us, and to be the Mawda of a people to be the same as them.\"","reference":"Jami` at-Tirmidhi 657, Book 7, Hadith 41","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration illustrate the importance of verifying actions with religious authority?","id":"tirmidhi-7-294"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"","reference":"Jami` at-Tirmidhi 658, Book 7, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the additional reward for giving charity to relatives compared to giving it to others?","id":"tirmidhi-7-295"},{"hadith-eng":"she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is in Al-Baqarah: 'It is not Al-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)","reference":"Jami` at-Tirmidhi 659, Book 7, Hadith 43","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role does the Quran play in explaining the duties of a Muslim beyond the basic obligations?","id":"tirmidhi-7-296"},{"hadith-eng":"the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\"","reference":"Jami` at-Tirmidhi 660, Book 7, Hadith 44","grade":"Da'if(Darussalam)","question #":"question #5","question":"What might be the reasons for having financial duties beyond Zakat in Islamic teachings?","id":"tirmidhi-7-297"},{"hadith-eng":"the Messenger of Allah said: \"None gives charity from Tayyib - and Allah does not accept but Tayyib - but that Ar-Rahman accepts it with His Right (Hand). Even if it is a date, it is nurtured in the Hand of Ar-Rahman until it is greater than a mountain, just as one of you nurtures his foal or young camel.\"","reference":"Jami` at-Tirmidhi 661, Book 7, Hadith 45","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the analogy of nurturing a foal or young camel relate to the growth of charity in Islam?","id":"tirmidhi-7-298"},{"hadith-eng":"the Messenger of Allah said: \"Indeed Allah accepts charity, and He accepts it with His Right (Hand) to nurture it for one of you, just like one of you would nurture his foal, until the bite (of food) becomes as large as Uhud.\" The Book of Allah, the Mighty and Sublime testifies to that: 'He accepts repentance from His worshipers, and accepts charity.'And: 'Allah will destroy Riba and give increase for charity.'1And: 'Allah will destroy Riba and will give increase for charity.'2(Abu 'Eisa) said: This Hadith is (Hasan) Sahih. It has been reported from'Aishah from the Prophet similarly. More than one of the people of knowledge have spoken about this Hadith, and the narrations that resemble it about the Attributes\nand the Descent of the Lord, Blessed and Most High, every night to the lowest Heaven. They said: \"The narrations about these are affirmed and should be believed in without misinterpreting them nor saying 'how'.\" It has been reported\nlike this from Malik (bin Anas), Suf'ãn bin 'Uyainah, 'Abdullãh bin A1-Mubarak; they would say about these Hadith: They are conveyed without saying how. This is the view of the people of knowledge among Ahl As-Sunnah wal-Jama'ah. As for\nthe Jahmiyyah, they reject these narrations and they say that this is\nTashbih.3And in other places in His Book, Allah, Blessed and Most\nHigh is He, has mentioned the Hand, the Hearing, the Seeing, so the Jahmiyyah misinterpret these Ayãt and give them interpretations other than the interpretations of the people of knowledge. They say that Allah did not create Adam with His Hand, and they say the meaning of Hand is merely power. Isaq bin Ibrahim said: At-Tashbih is only when one says 'Hand; like a hand or similar to a hand' or 'Hearing; like hearing or similar to hearing.' So\nwhen one says 'Hearing; like hearing or similar to hearing' then this is the Tashbih. As for when one says as Allah (Most High) said, Hand, Hearing, Seeing, and he does not say 'how' nor say 'similar to hearing' nor 'like hearing' then this is not Tashbih. It is merely as Allah, Blessed and Most High is He said: 'There is nothing like Him, and He is the All-Hearing, the All-Seeing.'(Ash-Shüra 42:11).1: At-Tawbah 9:104.2: Al-Baqarah 2:276.3: Anthropomorphism, resembling Allah to creatures.","reference":"Jami` at-Tirmidhi 662, Book 7, Hadith 46","grade":"Abu Eisa (at-Tirmidhi) said: This Hadith is Hasan Sahih.(Darussalam)","question #":"question #5","question":"What is the difference between Tashbih and the correct understanding of Allah's attributes?","id":"tirmidhi-7-299"},{"hadith-eng":"the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"","reference":"Jami` at-Tirmidhi 663, Book 7, Hadith 47","grade":"Da'if(Darussalam)","question #":"question #5","question":"In what ways can charity during Ramadan impact the giver and the community?","id":"tirmidhi-7-300"},{"hadith-eng":"the Messenger of Allah said: \"Indeed charity extinguishes the Lord's anger and it protects against the evil death.\"","reference":"Jami` at-Tirmidhi 664, Book 7, Hadith 48","grade":"Da'if(Darussalam)","question #":"question #5","question":"How is the concept of charity linked to the alleviation of divine anger in Islamic belief?","id":"tirmidhi-7-301"},{"hadith-eng":"Umm Bujaid - and she was one of those who gave the pledge to the Prophet - she said to the Messenger of Allah: \"There is a needy person who stands outside my door, but I cannot find anything to give to him.\" So the Messenger of Allah said to her: \"If you do not find anything to give him except a burnt trotter then hand it over to him.\"","reference":"Jami` at-Tirmidhi 665, Book 7, Hadith 49","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does intention play in the act of giving charity in Islam?","id":"tirmidhi-7-302"},{"hadith-eng":"\"The Messenger of Allah gave to me on the Day of Hunain, and he was the most hated creature to me. But he did not stop giving to me until he was the most loved creature to me.\"","reference":"Jami` at-Tirmidhi 666, Book 7, Hadith 50","grade":"Sahih(Darussalam)","question #":"question #5","question":"How can the actions of a leader influence the emotions and attitudes of others?","id":"tirmidhi-7-303"},{"hadith-eng":"\"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"","reference":"Jami` at-Tirmidhi 667, Book 7, Hadith 51","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of the reward being established for a charitable act given to a deceased person?","id":"tirmidhi-7-304"},{"hadith-eng":"Umar gave a horse to be used in the cause of Allah. Then he saw it being sold, so he wanted to buy it, but the Prophet said: \"Do not take back what you have given in charity.\"","reference":"Jami` at-Tirmidhi 668, Book 7, Hadith 52","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does the concept of charity in Islam emphasize selflessness and detachment from material possessions?","id":"tirmidhi-7-305"},{"hadith-eng":"a man said: \"O Messenger of Allah! My mother died, will it benefit her if I give charity on her behalf?\" He said: 'Yes.' He said: 'I have a Makhraf, so bear witness that I have given it in charity on her behalf.'\"","reference":"Jami` at-Tirmidhi 669, Book 7, Hadith 53","grade":"Sahih(Darussalam)","question #":"question #5","question":"What types of charitable acts are considered beneficial for the deceased in Islam?","id":"tirmidhi-7-306"},{"hadith-eng":"\"During a sermon of his in the year of the Farewell Hajj, I heard the Messenger of Allah say: 'A woman is not to spend anything from her husbands house without her husband's permission.' They said: 'O Messenger of Allah! What about food?' He said: 'That is our most virtuous wealth.'\"","reference":"Jami` at-Tirmidhi 670, Book 7, Hadith 54","grade":"Hasan(Darussalam)","question #":"question #5","question":"How does the concept of mutual consent between spouses apply to financial decisions in a marriage?","id":"tirmidhi-7-307"},{"hadith-eng":"the Prophet said: \"When a woman gives in charity from her husband's house, she will get the reward for it, and for her husband is the same as that, and for the trustee is the same as that. The reward of each them will not be decreased at all by the reward of the other, for him is what he earned, and for her is what she spent.\"","reference":"Jami` at-Tirmidhi 671, Book 7, Hadith 55","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does this narration address the issue of shared rewards in charitable acts?","id":"tirmidhi-7-308"},{"hadith-eng":"the Messenger of Allah said: \"When a woman gives from her husband's home, with a good heart, not to spoil it, then she will get a reward similar to his, for her is the good she intended - and the same is for the trustee.\"","reference":"Jami` at-Tirmidhi 672, Book 7, Hadith 56","grade":"Sahih(Darussalam)","question #":"question #5","question":"What are the conditions for a woman to receive a reward when giving from her husband's property?","id":"tirmidhi-7-309"},{"hadith-eng":"\"We would give Zakat Al-Fitr - when the Messenger of Allah was among us - as a Sa of food, or a Sa of barely, or a Sa of dried dates, or a Sa of raisins, or a Sa of cheese. So we did not stop paying it (like that) until Mu'awiyah arrived in Al-Madinah and talked (about it). Among the things he addressed the people with, he said: 'I see that two Mudd of the wheat of Ash-Sham are equal to a Sa of dried dates.' So the people followed that.\" Abu Sa'eed said: \"I will not stop giving it in the manner that I had been giving it.\"","reference":"Jami` at-Tirmidhi 673, Book 7, Hadith 57","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does local produce and availability play in determining the items given as Zakat Al-Fitr?","id":"tirmidhi-7-310"},{"hadith-eng":"the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"","reference":"Jami` at-Tirmidhi 674, Book 7, Hadith 58","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does the requirement of Sadaqatul-Fitr apply to different age groups in Islam?","id":"tirmidhi-7-311"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr an obligation upon the male and female, the free and the bondsmen, as a Sa of dried dates or a Sa of barley.\" He said: \"So the people equated that to half a Sa of wheat.\"","reference":"Jami` at-Tirmidhi 675, Book 7, Hadith 59","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of Sadaqatul-Fitr in the lives of both free individuals and bondsmen?","id":"tirmidhi-7-312"},{"hadith-eng":"\"The Messenger of Allah made Sadaqatul-Fitr of Ramadan an obligation - a Sa of dried dates or a Sa of barley - required upon every free person and slave, male and female among the Muslims.\"","reference":"Jami` at-Tirmidhi 676, Book 7, Hadith 60","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the role of Sadaqatul-Fitr in the lives of both free individuals and slaves in the Muslim community?","id":"tirmidhi-7-313"},{"hadith-eng":"the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.","reference":"Jami` at-Tirmidhi 677, Book 7, Hadith 61","grade":"Sahih(Darussalam)","question #":"question #5","question":"What role does Zakat play in the observance of Eid al-Fitr?","id":"tirmidhi-7-314"},{"hadith-eng":"\"Al-Abbas asked the Messenger of Allah about paying his charity (Zakat) in advance before its time is due (by being in possession for a whole year), he permitted him to do that.\"","reference":"Jami` at-Tirmidhi 678, Book 7, Hadith 62","grade":"Da'if(Darussalam)","question #":"question #5","question":"How does early payment of Zakat benefit both the giver and the recipient?","id":"tirmidhi-7-315"},{"hadith-eng":"the Prophet said to Umar: \"We have taken this year's Zakat from Al-Abbas in the previous year.\"","reference":"Jami` at-Tirmidhi 679, Book 7, Hadith 63","grade":"Da'if(Darussalam)","question #":"question #5","question":"What role does Zakat play in the economic system of Islam?","id":"tirmidhi-7-316"},{"hadith-eng":"the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"","reference":"Jami` at-Tirmidhi 680, Book 7, Hadith 64","grade":"Sahih(Darussalam)","question #":"question #5","question":"How does Islam view the act of asking others for help when one is capable of working?","id":"tirmidhi-7-317"},{"hadith-eng":"the Messenger of Allah said: \"Asking is a labor that toils on a man's face, except if a man asks for something from the Sultan (ruler), or he asks for something that he cannot do without.\"","reference":"Jami` at-Tirmidhi 681, Book 7, Hadith 65","grade":"Sahih(Darussalam)","question #":"question #5","question":"What is the significance of self-reliance and independence in Islamic teachings?","id":"tirmidhi-7-318"},{"hadith-eng":"\"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"","reference":"Jami` at-Tirmidhi 619, Book 7, Hadith 3","grade":"Sahih(Darussalam)","question #":"question #6","question":"What is the importance of truthfulness in fulfilling religious duties according to Islamic teachings?","id":"tirmidhi-7-319"},{"hadith-eng":"\"The Messenger of Allah had a letter written about charity, but he had not dispatched it to his governors until he died; he kept it with him along with his sword. When he died, Abu Bakr implemented it until he died, as did Umar until he died. In it was: 'A sheep (is due) on five camels, two sheeps on ten, three sheeps on fifteen, four sheeps for twenty, a Bint Makhad on twenty-five to thirty-five. When it is more than that, then a Bint Labun, (is due, till the number of the camels reaches) forty-five. When it is more than that, then a Hiqqah until sixty. When it is more than that, then a Jadhah until seventy-five. When it is more than one hundred and twenty, then a Hiqqah on every fifty, and a Bint Labun on every forty. For sheep; one sheep (is due) for every forty sheeps until one hundred and twenty. When it is more than that, then two sheeps until two hundred. When it is more than that, then three sheeps until three hundred sheep. When it is more than three hundred sheep, then a sheep on every hundred sheep. Then there is nothing until it reaches four hundred. There is no combining the (property of) individuals nor separating the collective (property) fearing Sadaqah. And fr whatever is mixed together that two own, then they are to refer to the total. Neither an old or defective (animal) may be taken for charity.\"","reference":"Jami` at-Tirmidhi 621, Book 7, Hadith 5","grade":"Hasan(Darussalam)","question #":"question #6","question":"What types of animals are exempt from being taken for charity in Islamic teachings?","id":"tirmidhi-7-320"},{"hadith-eng":"\"The Prophet sent me to Yemen and ordered me to collect a Tabi or a Tabi'ah on every thirty cows, a Musinnah on every forty, a Dinar for every Halim, or its equivalent of Ma'afir.\"Abu Eisa said: This Hadith is Hasan. Some of them reported this Hadith from Sufyan, from Al-A'mash, from Abu Wa'il, from Masruq: \"The Prophet sent Mu'adh to Yemen and ordered him to take...\" and this is more authentic","reference":"Jami` at-Tirmidhi 623, Book 7, Hadith 7","grade":"Da'if(Darussalam)","question #":"question #6","question":"What does this hadith indicate about the Prophet's approach to taxation and zakat collection?","id":"tirmidhi-7-321"},{"hadith-eng":"the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"","reference":"Jami` at-Tirmidhi 625, Book 7, Hadith 9","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does Islam address the relationship between the rich and the poor in society?","id":"tirmidhi-7-322"},{"hadith-eng":"the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"","reference":"Jami` at-Tirmidhi 658, Book 7, Hadith 42","grade":"Sahih(Darussalam)","question #":"question #6","question":"How does giving charity to relatives nurture the ties of kinship?","id":"tirmidhi-7-323"},{"hadith-eng":"the Messenger of Allah said: \"Indeed Allah accepts charity, and He accepts it with His Right (Hand) to nurture it for one of you, just like one of you would nurture his foal, until the bite (of food) becomes as large as Uhud.\" The Book of Allah, the Mighty and Sublime testifies to that: 'He accepts repentance from His worshipers, and accepts charity.'And: 'Allah will destroy Riba and give increase for charity.'1And: 'Allah will destroy Riba and will give increase for charity.'2(Abu 'Eisa) said: This Hadith is (Hasan) Sahih. It has been reported from'Aishah from the Prophet similarly. More than one of the people of knowledge have spoken about this Hadith, and the narrations that resemble it about the Attributes\nand the Descent of the Lord, Blessed and Most High, every night to the lowest Heaven. They said: \"The narrations about these are affirmed and should be believed in without misinterpreting them nor saying 'how'.\" It has been reported\nlike this from Malik (bin Anas), Suf'ãn bin 'Uyainah, 'Abdullãh bin A1-Mubarak; they would say about these Hadith: They are conveyed without saying how. This is the view of the people of knowledge among Ahl As-Sunnah wal-Jama'ah. As for\nthe Jahmiyyah, they reject these narrations and they say that this is\nTashbih.3And in other places in His Book, Allah, Blessed and Most\nHigh is He, has mentioned the Hand, the Hearing, the Seeing, so the Jahmiyyah misinterpret these Ayãt and give them interpretations other than the interpretations of the people of knowledge. They say that Allah did not create Adam with His Hand, and they say the meaning of Hand is merely power. Isaq bin Ibrahim said: At-Tashbih is only when one says 'Hand; like a hand or similar to a hand' or 'Hearing; like hearing or similar to hearing.' So\nwhen one says 'Hearing; like hearing or similar to hearing' then this is the Tashbih. As for when one says as Allah (Most High) said, Hand, Hearing, Seeing, and he does not say 'how' nor say 'similar to hearing' nor 'like hearing' then this is not Tashbih. It is merely as Allah, Blessed and Most High is He said: 'There is nothing like Him, and He is the All-Hearing, the All-Seeing.'(Ash-Shüra 42:11).1: At-Tawbah 9:104.2: Al-Baqarah 2:276.3: Anthropomorphism, resembling Allah to creatures.","reference":"Jami` at-Tirmidhi 662, Book 7, Hadith 46","grade":"Abu Eisa (at-Tirmidhi) said: This Hadith is Hasan Sahih.(Darussalam)","question #":"question #6","question":"How does the Quran testify to the acceptance of charity and repentance by Allah?","id":"tirmidhi-7-324"}]