{"number":44,"edition":"ja.japanese","ayahs":[{"number":1,"text":"ハー・ミーム。"},{"number":2,"text":"（事物を）明瞭にする，この啓典にかけて（誓う）。"},{"number":3,"text":"本当にわれは，祝福された夜，これを下して，（悪に対して不断に）警告を与え（ようとす）るものである。"},{"number":4,"text":"その（夜）には，英知に就いて凡ての事が明確にされる。"},{"number":5,"text":"わが許からの命令である。本当にわれが（何時も使徒を）遣わすのは，"},{"number":6,"text":"あなたの主からの慈悲である。本当にかれは，全聴にして全知であられ，"},{"number":7,"text":"天と地，そしてその間の凡てのものの主である。もしあなたがた（の信仰）が確かならば。"},{"number":8,"text":"かれの外に神はなく，生を授け死を授けられる。あなたがたの主，またあなたがたの祖先の主であられる。"},{"number":9,"text":"それなのにかれらは疑って，戯れている。"},{"number":10,"text":"待っていなさい，天が明瞭な煙霧を起す日まで。"},{"number":11,"text":"（それは）人びとを包む。（かれらは言う）。「これは痛ましい懲罰です。」"},{"number":12,"text":"「主よ，わたしたちからこの懲罰を免じて下さい。本当に信仰いたします。」"},{"number":13,"text":"どうして（再び）かれらに訓示があろう。かれらには公明な使徒が確かに来たのに，"},{"number":14,"text":"かれらはかれ（使徒）から背き去って，「他人に入れ智恵された者，憑かれた者です。」と言ったではないか。"},{"number":15,"text":"われが暫くの間，懲罰を解除すると，あなたがたは必ず（不信心に）戻る。"},{"number":16,"text":"われが猛襲する（審判の）日，本当にわれは，（厳正に）報復する。"},{"number":17,"text":"かれら以前にも，われはフィルアウンの民を試みた。その時かれらに尊い使徒（ムーサー）が来て，"},{"number":18,"text":"（言った。）「アッラーのしもべたち（イスラエルの子孫）を，わたしに返しなさい。本当にわたしは，あなたがたの許にやって来た誠実な使徒です。"},{"number":19,"text":"アッラーに対して，高慢であってはなりません。本当にわたしは明白な権威をもって，あなたがたの所にやって来たのです。"},{"number":20,"text":"あなたがたが（わたしを）石撃ちにするなら，わたしそしてあなたがたの主でもある御方に，救いを求めます。"},{"number":21,"text":"もしあなたがたが，わたしを信じないならば，わたしには構わないでください。」"},{"number":22,"text":"そこで，かれは主に祈っ（て言っ）た。「これらは罪深い人びとです。」"},{"number":23,"text":"（主の御答えがあった。）「あなたは夜の中に，わがしもべと共に旅立て。必ずあなたがたに追っ手がかかろう。"},{"number":24,"text":"そして海は（渡った後）分けたままにして置け。本当にかれらは，溺れてしまうことであろう。」"},{"number":25,"text":"かれらは，如何に多くの園と泉を残したか。"},{"number":26,"text":"また（豊かな）穀物の畑と，幸福な住まいを，"},{"number":27,"text":"またかれらがそこで享楽していた良い物を（残したか。）"},{"number":28,"text":"（かれらの後は）こうであった。そしてわれは，外の民に（それらを）継がせた。"},{"number":29,"text":"かれらのために，天も地も泣かず，かれらに猶予も与えられなかった。"},{"number":30,"text":"われは，イスラエルの子孫を屈辱の懲罰から救い，"},{"number":31,"text":"フィルアウンから（救い出した）。本当にかれは，高慢で無法者であった。"},{"number":32,"text":"われは思うところにより，かれらを諸民族の上に選んだ。"},{"number":33,"text":"そして明白な試練を含む，数々の印を与えた。"},{"number":34,"text":"さてこれら（マッカの偶像信者）は（愚かにも）言う。"},{"number":35,"text":"「わたしたちは最初死ねば（2度と）起こされない。"},{"number":36,"text":"もしあなたがた（の言葉）が真実なら，わたしたちの祖先を連れ戻してみなさい。」"},{"number":37,"text":"かれら（マッカの偶像信者）はトッバウの民か，またそれ以前の者たちより優れているのか。われはかれら（諸民族）を滅ぼしたのである。本当にかれらは罪を犯した者であった。"},{"number":38,"text":"われは天と地，そしてその間にある凡てのものを，戯れに創ったのではない。"},{"number":39,"text":"われは，天地とその間の凡てのものを，只真理のために創った。だが，かれらの多くは理解しない。"},{"number":40,"text":"本当に（善悪の）選別の日は，凡てのものに定められた日である。"},{"number":41,"text":"その日，友はその友のために何も役立てず，またかれらは援助も得られない。"},{"number":42,"text":"だがアッラーの御慈悲を被むった者たちは別である。本当にかれは偉力ならびなく慈悲深くあられる。"},{"number":43,"text":"本当にアッ・ザックームの木こそは，"},{"number":44,"text":"罪ある者の糧である。"},{"number":45,"text":"それは溶けた銅のように内臓の中で沸騰しよう，"},{"number":46,"text":"熱湯が滾りかえるように。"},{"number":47,"text":"（声がして言われよう。）「かれを捕えよ，燃えさかる炎の只中に，引きずり込め。"},{"number":48,"text":"それから，かれの頭の上に沸騰する湯の痛苦を浴びせよ。"},{"number":49,"text":"あなたは（これを）味わうがいい。本当にあなたは，力のある尊貴な者であった。"},{"number":50,"text":"これこそあなたがたが，疑っていたものである。」"},{"number":51,"text":"本当に，主を畏れた者は，安泰な所にいる。"},{"number":52,"text":"園と泉の間に，"},{"number":53,"text":"絹や錦を纒い，互いに向かい合って，"},{"number":54,"text":"このようにわれは，輝いた大きい目の乙女たちをかれらの配偶者にするであろう。"},{"number":55,"text":"かれらはそこで平安に，凡ての果実を求められ，"},{"number":56,"text":"最初の死の外に，そこで（再び）死を味わうことはなく，燃える炎の責め苦から守護されよう。"},{"number":57,"text":"あなたの主からの賜物，それこそは至福の成就であろ。"},{"number":58,"text":"われはこの（クルアーン）を，あなたの言葉（アラビア語）で（下し）分りやすくした。かれらは，理解し諭されるかもしれない。"},{"number":59,"text":"だからしばらく待って様子を見なさい。本当にかれらの方も様子を伺っているのだから。"}]}