{"number":78,"edition":"th.thai","ayahs":[{"number":1,"text":"พวกเขาต่างถามกันถึงเรื่องอะไร"},{"number":2,"text":"(ถาม) ถึงข่าวอันยิ่งใหญ่สำคัญ"},{"number":3,"text":"ซึ่งเป็นข่าวที่พวกเขาขัดแย้งกันอยู่"},{"number":4,"text":"เปล่าเลย พวกเขาจะได้รู้"},{"number":5,"text":"แล้วก็เปล่าเลย พวกเขาจะได้รู้"},{"number":6,"text":"เรามิได้ทำให้แผ่นดินเป็นพื้นราบดอกหรือ"},{"number":7,"text":"และมิได้ให้เทือกเขาเป็นหลักตรึงไว้ดอกหรือ"},{"number":8,"text":"และเราได้บังเกิดพวกเจ้าให้เป็นคู่ครองกัน"},{"number":9,"text":"และเราได้ทำให้การนอนของพวกเจ้าเป็นการพักผ่อน"},{"number":10,"text":"และเราได้ทำให้กลางคืนคล้ายเครื่องปกปิดร่างกาย"},{"number":11,"text":"และเราได้ทำให้กลางวันเป็นที่แสวงหาเครื่องยังชีพ"},{"number":12,"text":"และเราได้สร้างไว้เหนือพวกเจ้าสิ่งที่แข็งแรงทั้งเจ็ด (ชั้นฟ้า)"},{"number":13,"text":"และเราได้ทำให้มีดวงประทีปหนึ่งที่มีแสงสว่างจ้า"},{"number":14,"text":"และเราได้หลั่งน้ำลงมาอย่างมากมายมากเมฆฝน"},{"number":15,"text":"เพื่อว่าเราจะให้งอกเงยด้วยน้ำนั้นซึ่งเมล็ดพืช และพืชผัก"},{"number":16,"text":"และบรรดาเรือกสวนอันหนาแน่น"},{"number":17,"text":"แท้จริงวันแห่งการตัดสินนั้นเป็นเวลาที่ถูกกำหนดไว้"},{"number":18,"text":"วันที่แตรจะถูกเป่า แล้วพวกเจ้าก็จะมากันเป็นหมู่ ๆ"},{"number":19,"text":"และชั้นฟ้าจะถูกเปิดออก แล้วก็จะมีประตูหลายบาน"},{"number":20,"text":"และเทือกเขาจะถูกให้เคลื่อนออกไปแล้วก็กลายเป็นภาพลวง"},{"number":21,"text":"แท้จริงนรกญะฮันนัมนั้นเป็นที่สอดส่อง"},{"number":22,"text":"เป็นที่กลับไปสำหรับบรรดาผู้ละเมิด"},{"number":23,"text":"พวกเขาจะพำนักอยู่ในนั้นเป็นเวลานาน"},{"number":24,"text":"พวกเขาจะไม่ได้ลิ้มรสความเย็นและเครื่องดื่มใด ๆ ในนรกนั้น"},{"number":25,"text":"นอกจากน้ำเดือด และน้ำเลือดน้ำหนองเท่านั้น"},{"number":26,"text":"ทั้งนี้เป็นการตอบแทนอย่างคู่ควร"},{"number":27,"text":"เพราะพวกเขามิได้หวังว่าจะมีการชำระสอบสวน"},{"number":28,"text":"และพวกเขาปฏิเสธสัญญาณต่าง ๆ ของเราอย่างสิ้นเชิง"},{"number":29,"text":"และทุก ๆ สิ่งนั้นเราได้จารึกมันไว้อย่างครบถ้วนในบันทึก"},{"number":30,"text":"ดังนั้น พวกเจ้าจงลิ้มรส (การลงโทษ) เถิด เราจะไม่เพิ่มอันใดแก่พวกเจ้านอกจากการทรมานเท่านั้น"},{"number":31,"text":"แท้จริงสำหรับบรรดาผู้ยำเกรงนั้น จะได้รับชัยชนะ"},{"number":32,"text":"เรือกสวนหลากหลายและองุ่น"},{"number":33,"text":"และบรรดาสาววัยรุ่นที่มีอายุคราวเดียวกัน"},{"number":34,"text":"และแก้วที่มีเครื่องดื่มเต็มเปี่ยม"},{"number":35,"text":"ในสวนสวรรค์นั้นพวกเขาจะไม่ได้ยินคำพูดไร้สาระและคำกล่าวเท็จ"},{"number":36,"text":"ทั้งนี้เป็นการตอบแทนจากพระเจ้าของเจ้าเป็นการประทานให้อย่างพอเพียง"},{"number":37,"text":"พระเจ้าแห่งชั้นฟ้าทั้งหลายและแผ่นดิน และสิ่งที่อยู่ในระหว่างทั้งสอง คือพระผู้ทรงกรุณาปรานี พวกเขาไม่มีอำนาจที่จะกล่าวคำพูดใด ๆ ต่อพระองค์"},{"number":38,"text":"วันซึ่งญิบริลและมะลาอิกะฮฺจะยืนเป็นแถวเดียวกัน พวกเขาจะไม่พูด นอกจากผู้ที่พระผู้ทรงกรุณาปรานีทรงอนุญาตให้แก่เขาและเขาจะพูดแต่สิ่งที่ถูกต้องเท่านั้น"},{"number":39,"text":"นั่นคือวันแห่งความจริง ดังนั้นผู้ใดประสงค์ก็ให้เขายึดทางกลับไปสู่พระเจ้าของเขาเถิด"},{"number":40,"text":"แท้จริงเราได้เตือนพวกเจ้าแล้วถึงการลงโทษอันใกล้ วันที่มนุษย์จะมองไปยังสิ่งที่สองมือของเขาได้ประกอบไว้ และผู้ปฏิเสธศรัทธาจะกล่าวว่า โอ้..ถ้าฉันเป็นฝุ่นดินเสียก็จะดี"}]}