{"number":17,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Slavljen neka je Onaj koji je noću prenio roba Svog od Mesdžidul-harama do Mesdžidul-aksaa - onog čiju smo okolinu blagoslovili - da bi mu pokazali neke od znakova Naših. Uistinu! On, On je Onaj koji čuje, Onaj koji vidi"},{"number":2,"text":"I dali smo Musau Knjigu i učinili je Uputom sinovima Israilovim: \"Ne uzimajte mimo Mene nikakva zaštitnika"},{"number":3,"text":"Potomci su onog koga smo nosili s Nuhom. Uistinu, on je bio rob zahvalan"},{"number":4,"text":"I odredili smo sinovima Israilovim u Knjizi: \"Sigurno ćete napraviti fesad na Zemlji dva puta i sigurno ćete se uznijeti ohološću velikom"},{"number":5,"text":"Pa kad dođe obećanje prve od dvije (prijetnje), podigosmo na vas robove Naše, posjednike sile žestoke, pa su pretresali po kućama, i bijaše obećanje ispunjeno"},{"number":6,"text":"Zatim smo vam dali povrat na njih, i pomogli vas imecima i sinovima, i učinili vas većom skupinom"},{"number":7,"text":"Ako činite dobro, činite dobro za duše svoje, a ako činite zlo, pa njihovo je. Pa kad dođe obećanje druge (prijetnje) - da ožaloste lica vaša, i da uđu u Mesdžid kao što su ušli u njega prvi put, i da potpuno unište šta zauzmu"},{"number":8,"text":"Možda će Gospodar vaš da vam se smiluje. A ako ponovite, ponovićemo, a učinili smo Džehennem za nevjernike tamnicom"},{"number":9,"text":"Uistinu, ovaj Kur'an upućuje onom šta je najispravnije, i donosi radosne vijesti vjernicima koji čine dobra djela, da će oni imati nagradu veliku"},{"number":10,"text":"I da oni koji ne vjeruju u Ahiret - pripremili smo za njih kaznu bolnu"},{"number":11,"text":"I priziva čovjek dowom svojom i zlo i dobro; a čovjek je brzoplet"},{"number":12,"text":"I učinili smo noć i dan dvama znacima. Pa brišemo znak noći i činimo znak dana vidnim, da biste tražili blagodat od Gospodara svog i da znate broj godina i računanje. A svaku stvar - razložili smo je podrobno"},{"number":13,"text":"I svakom čovjeku - pričvrstićemo mu njegov znamen za vrat njegov i izvadićemo mu na Dan kijameta knjigu koju će naći otvorenu"},{"number":14,"text":"Čitaj knjigu svoju! Dovoljna je Danas duša tvoja protiv tebe obračunac"},{"number":15,"text":"Ko se upućuje - pa samo se upućuje za dušu svoju; a ko luta, pa samo luta protiv nje. I neće opterećeni nositi teret drugog. A nismo kažnjavali, dok ne bismo poslali poslanika"},{"number":16,"text":"A kad želimo da uništimo grad, naredimo u njemu raskošnicima njegovim, pa se odaju griješenju u njemu, te se ispuni na njemu Riječ, pa ga uništimo (potpunim) uništenjem"},{"number":17,"text":"I koliko smo uništili pokoljenja poslije Nuha! A dovoljno je (što je) Gospodar tvoj o grijesima robova Svojih Obaviješteni, Vidilac"},{"number":18,"text":"Ko želi ubrzano (ovog života), ubrzaćemo mu u njemu što hoćemo - kome želimo, zatim ćemo mu dodijeliti Džehennem. Pržiće se njime pokuđen, odbačen"},{"number":19,"text":"A ko želi Ahiret i zalaže se za njega trudom svojskim, a on bude vjernik - pa tim takvima će biti trud njihov pohvalan"},{"number":20,"text":"Svakom pružamo, takvima i ovakvima, iz dara Gospodara tvog. A nije dar Gospodara tvog ograničen"},{"number":21,"text":"Pogledaj kako smo ih odlikovali jedne nad drugima, a sigurno je Ahiret veći stepenima i veći odlikovanjem"},{"number":22,"text":"Ne stavljaj uz Allaha boga drugog, pa da sjedneš pokuđen, ostavljen"},{"number":23,"text":"A odredio je Gospodar tvoj, da ne obožavate, izuzev Njega, a roditeljima - dobročinstvo. Ako jedno od njih dvoje ili oboje dostigne kod tebe starost, tad im ne reci: \"Uf!\" i ne grdi ih i reci im riječ plemenitu"},{"number":24,"text":"I spusti im krilo poniznosti iz milosti, i reci: \"Gospodaru moj! Smiluj se njima dvoma, kao što su me odgajali (dok) sam bio mali"},{"number":25,"text":"Gospodar vaš je Najbolji znalac onog šta je u dušama vašim. Ako budete pravedni - pa uistinu, On je pokajanicima Oprosnik"},{"number":26,"text":"I daj bližnjem pravo njegovo, i siromahu i sinu puta, i ne rasipaj rasipnošću"},{"number":27,"text":"Uistinu! Rasipnici su braća šejtanova, a šejtan je Gospodaru svom nezahvalan"},{"number":28,"text":"A ako se okreneš od njih, tražeći milost Gospodara svog kojoj se nadaš, tad im reci riječ lahku"},{"number":29,"text":"I ne čini ruku svoju vezanom za svoj vrat, i ne pružaj je svakim pružanjem, pa da sjedneš prekoren, ogoljen"},{"number":30,"text":"Uistinu, Gospodar tvoj pruža opskrbu kome hoće i uskraćuje. Uistinu, On je o robovima Svojim Obaviješteni, Onaj koji vidi"},{"number":31,"text":"I ne ubijajte djecu svoju iz straha od siromaštva. Mi opskrbljujemo njih i vas. Uistinu, njihovo ubijanje je greška velika"},{"number":32,"text":"I ne približujte se bludu! Uistinu, to je razvrat i zao put"},{"number":33,"text":"I ne ubijte dušu koju je zabranio Allah, izuzev s pravom. A ko bude ubijen nepravedno, pa doista smo nasljedniku njegovom dali ovlaštenje, pa neka ne pretjera u ubijanju. Uistinu, on će biti pomognut"},{"number":34,"text":"I ne približujte se imetku siročeta, osim onako kako je najbolje, dok ne dostigne zrelost svoju. I ispunjavajte ugovor. Uistinu, za ugovor će se biti pitano"},{"number":35,"text":"I ispunjavajte mjeru kad mjerite, vagajte mjerilom ispravnim. To je dobro i najljepšeg ishoda"},{"number":36,"text":"I ne slijedi ono o čemu ti nemaš znanje. Uistinu, sluh i vid i srce, za svako od njih biće se pitano"},{"number":37,"text":"I ne hodaj po Zemlji likujući. Uistinu, ti nećeš probiti Zemlju, i nećeš doseći planine visinom"},{"number":38,"text":"Sve to je zlo kod Gospodara tvog, pokudno je"},{"number":39,"text":"To je od onog šta ti objavljuje Gospodar tvoj od mudrosti. I ne stavljaj uz Allaha boga drugog, pa da budeš bačen u Džehennem, prekoren, odbačen"},{"number":40,"text":"Pa zar je vas odlikovao Gospodar vaš sinovima, a uzeo od meleka ženske? Uistinu, vi govorite riječ strašnu"},{"number":41,"text":"I doista, izložili smo u ovom Kur'anu (opomene) da se pouče, a povećava im jedino izbjegavanje"},{"number":42,"text":"Reci: \"Da su uz Njega bogovi kao što govore, tad bi doista tražili Vlasniku Arša put"},{"number":43,"text":"Slavljen neka je On i Uzvišen od onog što govore - uzvišenošću velikom"},{"number":44,"text":"Slavi Ga sedam nebesa i Zemlja i ko je u njima; i nema nijedne stvari, a da ne slavi sa hvalom Njegovom. Međutim, ne razumijete slavljenje njihovo. Uistinu! On je Blagi, Oprosnik"},{"number":45,"text":"I kad učiš Kur'an, načinimo između tebe i između onih koji ne vjeruju u Ahiret, barijeru skrivenu"},{"number":46,"text":"I stavljamo na srca njihova prekrivače da ga ne razumiju, a u uši njihove gluhoću. I kad spomeneš Gospodara svog u Kur'anu - Jedinog Njega - okrenu pozadine svoje bježeći"},{"number":47,"text":"Mi smo Najbolji znalac onog šta slušaju, kad te slušaju, i kad se oni tajno dogovaraju, kad govore zalimi: \"Slijedite samo čovjeka začarana"},{"number":48,"text":"Vidi kako za tebe navode primjere pa lutaju, te ne mogu da nađu put"},{"number":49,"text":"I govore: \"Zar ćemo kad budemo kosti i komadići, - hoćemo li uistinu mi biti podignuti (kao) stvorenje novo"},{"number":50,"text":"Reci: \"Budite kamenje ili gvožđe"},{"number":51,"text":"Ili stvorenje od onog šta je veliko u grudima vašim.\" Tad će reći: \"Ko će nas povratiti?\" Reci: \"Onaj koji vas je stvorio prvi put.\" Tad će ti zatresti glavama svojim i reći: \"Kad će to?\" Reci: \"Možda je blizu"},{"number":52,"text":"Na Dan kad vas pozove, tad ćete se odazvati s hvalom Njegovom, i mislićete da ste proboravili samo malo (vremena)"},{"number":53,"text":"I reci robovima Mojim (da) govore ono što je najbolje. Uistinu, šejtan sije razdor među njima. Uistinu, šejtan je čovjeku neprijatelj otvoreni"},{"number":54,"text":"Gospodar vaš je vaš Najbolji poznavalac. Ako hoće, smilovaće vam se, a ako hoće kazniće vas. I nismo poslali tebe nad njima zaštitnikom"},{"number":55,"text":"I Gospodar tvoj je Najbolji znalac onog ko je na nebesima i Zemlji. A doista smo odlikovali vjerovjesnike jedne nad drugima, i dali smo Dawudu Zebur"},{"number":56,"text":"Reci: \"Prizivajte one koje ste držali (bogovima) mimo Njega\" - pa ne vladaju otklanjanjem nevolje od vas, niti (njenim) mijenjanjem"},{"number":57,"text":"Takvi koje oni prizivaju, traže način pristupa Gospodaru svom - koji od njih će biti najbliži - i nadaju se milosti Njegovoj i boje se kazne Njegove. Uistinu, kazna Gospodara tvog je ono čega se treba čuvati"},{"number":58,"text":"I nema nijednog naselja, a da ga Mi nećemo uništiti prije Dana kijameta ili ga kazniti kaznom žestokom. To je u Knjizi napisano"},{"number":59,"text":"A sprječava Nas da pošaljemo znakove, jedino što su ih poricali raniji. I dali smo Semudu devu jasnim (znakom), pa su joj učinili zulm. A znakove smo slali samo (kao) zastrašivanje"},{"number":60,"text":"I kad ti rekosmo: \"Uistinu, Gospodar tvoj obuhvata čovječanstvo.\" I učinili smo snoviđenje koji smo ti pokazali, jedino iskušenjem ljudima, i drvo prokleto u Kur'anu. A zastrašujemo ih, pa im (to) samo povećava pretjeranost veliku"},{"number":61,"text":"I kad rekosmo melecima: \"Padnite na sedždu Ademu!\" Tad padoše ničice, izuzev Iblisa. Reče: \"Zar da činim sedždu onome koga si stvorio od ilovače"},{"number":62,"text":"Reče: \"Vidiš li Ti ovo čemu si ukazao čast nada mnom, ako me ostaviš do Dana kijameta sigurno ću savladati potomstvo njegovo, izuzev malo (njih)"},{"number":63,"text":"(Allah) reče: \"Odlazi! Pa ko te od njih bude slijedio, pa uistinu, Džehennem će biti plaća vaša, plaća potpuna"},{"number":64,"text":"I podbodi koga možeš od njih glasom svojim, i sakupi na njih konjicu svoju i pješadiju svoju, i sudjeluj im u imecima i djeci, i obećavaj im\", a obećava im šejtan jedino obmanu"},{"number":65,"text":"Uistinu! Robovi Moji - nećeš ti imati nad njima autoritet. A dovoljan je Gospodar tvoj Zaštitnik"},{"number":66,"text":"Gospodar vaš je Taj koji goni za vas plovilo u moru, da tražite iz blagodati Njegove. Uistinu, On vam je Milosrdan"},{"number":67,"text":"I kad vas dotakne nevolja u moru, iščezne onaj koga prizivate mimo Njega. Pa pošto vas izbavi na kopno, odvratite se. A čovjek je nezahvalan"},{"number":68,"text":"Pa zar ste sigurni da neće učiniti da vas proguta obronak kopna ili poslati na vas pješčanu oluju?, potom nećete naći sebi zaštitnika"},{"number":69,"text":"Ili ste sigurni da vas neće vratiti u to drugi put, te poslati na vas uragan vjetra, pa vas potopiti što ste bili nezahvalni, zatim nećete sebi naći protiv Nas za to pristalicu"},{"number":70,"text":"A uistinu, ukazali smo čast sinovima Ademovim, i nosimo ih kopnom i morem, i opskrbili smo ih dobrim stvarima, i odlikovali ih prednošću nad mnogima od onog kog smo stvorili"},{"number":71,"text":"Na Dan kad pozovemo sve ljude s imamom njihovim - pa kome se da knjiga njegova u desnicu njegovu, pa takvi će čitati knjigu svoju i neće im se učiniti zulm žilice hurmine košpice"},{"number":72,"text":"A ko je na ovom (svijetu) slijepac, pa on će biti na Ahiretu slijepac i najodlutaliji od puta"},{"number":73,"text":"I skoro da te baš odvrate od onog šta ti objavljujemo, da bi protiv Nas izmišljao drugačije od tog, a tad bi te (oni) sigurno uzeli prijateljem"},{"number":74,"text":"I da te nismo učvrstili, skoro bi im se baš naklonuo nešto malo"},{"number":75,"text":"Tad bismo doista dali da ti iskusiš dvostruku (kaznu) života i dvostruku (kaznu) smrti, zatim ne bi sebi našao protiv Nas pomagača"},{"number":76,"text":"I zamalo da te doista preplaše iz zemlje, da te iz nje istjeraju, a tad ne bi ostali iza tebe, izuzev malo"},{"number":77,"text":"Sunnet onog kog smo poslali prije tebe od poslanika Naših, a nećeš u sunnetu Našem naći izmjenu"},{"number":78,"text":"Obavljaj salat sa naginjanjem Sunca (zapadu), do mraka noći, i Kur'an (uči) zorom. Uistinu, Kur'an zorom je svjedočen"},{"number":79,"text":"A od noći - pa probdij je nafilom za sebe. Možda će Gospodar tvoj da te uzdigne na mjesto pohvalno"},{"number":80,"text":"I reci: \"Gospodaru moj! Daj mi da uđem ulaskom istinskim, i izvedi me izvođenjem istinskim i dadni mi od Sebe snagu pomažuću"},{"number":81,"text":"I reci: \"Došla je Istina, a nestala je neistina. Uistinu, neistina je nestajuća"},{"number":82,"text":"I objavljujemo od Kur'ana ono šta je lijek i milost vjernicima, a zalimima povećava jedino gubitak"},{"number":83,"text":"I kad obdarimo čovjeka, odvrati se i udalji na svoju stranu. A kad ga dotakne zlo, bude očajan"},{"number":84,"text":"Reci: \"Svako radi na svoj način, pa Gospodar vaš je Najbolji znalac onog ko je najupućeniji putu"},{"number":85,"text":"I pitaju te o Duhu. Reci: \"Duh je po naredbi Gospodara mog, a vama je od znanja dato samo malo"},{"number":86,"text":"A da hoćemo, sigurno bismo povukli ono šta smo ti objavili, zatim ne bi sebi za to našao protiv Nas zaštitnika"},{"number":87,"text":"Osim milosti Gospodara tvog. Uistinu! Dobrota Njegova je prema tebi velika"},{"number":88,"text":"Reci: \"Kad bi se sakupilo čovječanstvo i džinni, da donesu sličan ovom Kur'anu, ne bi sličan njemu donijeli, makar oni jedni drugima bili pomagači"},{"number":89,"text":"A doista smo čovječanstvu iznijeli u ovom Kur'anu od svakog primjera (ponešto), pa većina svijeta odbija (sve), osim nevjerstva"},{"number":90,"text":"I rekoše: \"Nećemo ti vjerovati, dok ne učiniš da za nas provrije izvor iz zemlje"},{"number":91,"text":"Ili imadneš ti bašču palmi i grožđa, pa učiniš da kroz nju poteku rijeke izbijajući"},{"number":92,"text":"Ili daš da padne nebo - kao što tvrdiš - na nas u komadima, ili dovedeš Allaha i meleke sučelice"},{"number":93,"text":"Ili ti imadneš kuću od zlata; ili se popneš u nebo - a nećemo vjerovati u uspon tvoj, dok nam ne spustiš knjigu koju ćemo čitati.\" Reci: \"Slavljen neka je Gospodar moj! Jesam li (išta), osim smrtnik, poslanik"},{"number":94,"text":"A sprječavalo je ljude da vjeruju, kad bi im dolazila Uputa, samo što su govorili: \"Zar je podigao Allah smrtnika poslanikom"},{"number":95,"text":"Reci: \"Da su na Zemlji meleci koji hode smireno, sigurno bismo im spustili s neba meleka poslanikom"},{"number":96,"text":"Reci: \"Dovoljan je Allah svjedok između mene i između vas.\" Uistinu! On je o robovima Svojim Obaviješteni, Onaj koji vidi"},{"number":97,"text":"A koga uputi Allah, tad je on upućen; a koga zabludi - tad im nećeš naći zaštitnike mimo Njega. I sakupićemo ih na Dan kijameta na licima njihovim slijepe i nijeme i gluhe; sklonište njihovo biće Džehennem. Kad god se stiša, povećaćemo im seir"},{"number":98,"text":"To je plaća njihova, zato što nisu vjerovali u ajete Naše i govorili: \"Zar ćemo kad budemo kosti i komadi, uistinu mi biti podignuti stvaranjem novim"},{"number":99,"text":"Zar ne vide da je Allah, Koji je stvorio nebesa i Zemlju, kadar da stvori slične njima i dadne im rok u koji nema sumnje. Pa odbijaju zalimi - osim nevjerstvo"},{"number":100,"text":"Reci: \"Da vi vladate riznicama milosti Gospodara mog, tad biste se sigurno suzdržali zbog straha od potrošnje\"; a čovjek je škrtac"},{"number":101,"text":"I doista, dali smo Musau devet znakova, dokaza jasnih - ta pitaj sinove Israilove - kad im dođe, te reče njemu faraon: \"Uistinu, ja te smatram, o Musa, opčaranim"},{"number":102,"text":"Reče: \"Doista znaš, ove (znakove) objavljuje samo Gospodar nebesa i Zemlje, kao znamenja, a uistinu, ja te smatram, o faraone, uništenim"},{"number":103,"text":"Tad je želio da ih protjera iz zemlje, pa potopismo njega i onog ko je bio s njim, sve"},{"number":104,"text":"I rekli smo poslije njega sinovima Israilovim: \"Nastanite zemlju! Pa kad dođe obećanje Ahireta, dovešćemo vas grupisane"},{"number":105,"text":"A s Istinom smo ga spustili i s Istinom je sišao. I tebe smo poslali samo kao donosioca radosnih vijesti i opominjača"},{"number":106,"text":"A Kur'an - razdijelili smo ga, da ga učiš ljudima sa zadrškom, i spustili smo ga (postepenim) objavljivanjem"},{"number":107,"text":"Reci: \"Vjerovali (vi) u njega ili ne vjerovali! Uistinu, oni kojima je dato znanje prije njega, kad im se uči, padaju na brade ničice"},{"number":108,"text":"I govore: 'Slava neka je Gospodaru našem! Doista je obećanje Gospodara našeg izvršno"},{"number":109,"text":"I padaju na brade plačući, a (to) im povećava skrušenost"},{"number":110,"text":"Reci: \"Prizivajte Allaha\", ili \"Prizivajte Milostivog.\" Kako god zovete - pa Njegova imena su najljepša. I ne budi glasan u salatu svom, i ne priguši (glas) u njemu, i traži između toga put"},{"number":111,"text":"I reci: \"Hvala neka je Allahu Koji nije uzeo dijete i Koji nema ortaka u vlasti i Koji nema zaštitnika od poniženja;\" i veličaj Ga tekbirom"}]}