{"number":21,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Približava se ljudima obračun njihov, a oni u bezbrižnosti odvraćeni"},{"number":2,"text":"Nije im došla nijedna nova opomena od Gospodara njihovog, a da je nisu slušali i oni se zabavljali"},{"number":3,"text":"Zauzetih srca svojih. A oni koji čine zulm kriju sašaptavanje: \"Je li ovo samo smrtnik sličan vama? Pa zar ćete ići sihru, a vi vidite"},{"number":4,"text":"(Muhammed) reče: \"Gospodar moj zna govor na nebu i Zemlji, a On je Onaj koji čuje, Znalac"},{"number":5,"text":"Naprotiv, govore: \"Zbrka od snova, štaviše izmišlja ga, štaviše on je pjesnik. Pa neka nam donese znak kao što su slati raniji"},{"number":6,"text":"Nije prije njih vjerovao nijedan grad kojeg smo uništili. Pa zar će oni vjerovati"},{"number":7,"text":"A prije tebe smo slali samo ljude kojima smo objavljivali, ta pitajte sljedbenike Opomene, ako ne znate"},{"number":8,"text":"I nismo ih učinili tijelima (koja) ne jedu hranu, i nisu bili besmrtnici"},{"number":9,"text":"Zatim smo im obistinili obećanje, te spasavali njih i koga smo htjeli, a uništavali razuzdane"},{"number":10,"text":"Doista, objavili smo vam Knjigu, u njoj je zikr vaš. Pa zar ne razumijete"},{"number":11,"text":"A koliko smo gradova smrskali koji su bili zulumčarski i stvorili poslije njih narode druge"},{"number":12,"text":"Pa pošto bi osjetili silu Našu, gle! oni iz njih bježe"},{"number":13,"text":"Ne bježite i vratite se onom šta vas je raskalašilo u njemu i nastambama vašim, da biste bili pitani"},{"number":14,"text":"Rekli bi: \"O teško nama! Uistinu, mi smo bili zalimi"},{"number":15,"text":"Pa nije prestajalo to njihovo zazivanje dok ih ne bismo učinili pokošenim, ugaslim"},{"number":16,"text":"I nismo stvorili nebo i Zemlju i šta je između njih za igru"},{"number":17,"text":"Da smo željeli da uzmemo zabavu, sigurno bismo to uzeli od Nas - nismo bili (toga) činitelji"},{"number":18,"text":"Naprotiv, bacamo Istinu na neistinu, pa je poništava, tad gle: ona nestala. A jao vama zbog onog šta pripisujete"},{"number":19,"text":"I Njegov je ko je na nebesima i Zemlji. A ko je kod Njega, ne ohole se prema obožavanju Njegovom, niti umaraju"},{"number":20,"text":"Slave (Ga) noću i danju, ne malaksavaju"},{"number":21,"text":"Zar uzimaju bogove od Zemlje koji proživljuju"},{"number":22,"text":"Da ima na njima bogova osim Allaha, sigurno bi bili u neredu. Pa slava neka je Allahu, Gospodaru Arša, od onog šta pripisuju"},{"number":23,"text":"Neće biti pitan za ono što čini, a oni će biti pitani"},{"number":24,"text":"Zar mimo Njega uzimaju bogove? Reci: \"Donesite dokaz vaš.\" Ovo je opomena onom ko je sa mnom i opomena onog ko je bio prije mene.\" Naprotiv, većina njih ne zna Istinu, pa su oni odvraćeni"},{"number":25,"text":"I nismo prije tebe poslali nijednog poslanika, a da mu nismo objavili: \"Nema boga osim Mene\", zato Mene obožavajte"},{"number":26,"text":"I govore: \"Milostivi je uzeo dijete.\" Slava Njemu! Naprotiv, robovi su (to) cijenjeni"},{"number":27,"text":"Ne pretiču Ga govorom, i oni po naredbi Njegovoj rade"},{"number":28,"text":"Zna šta je pred njima i šta je iza njih. I neće (oni) posredovati, izuzev za onog s kim bude zadovoljan. A oni od straha pred Njim strepe"},{"number":29,"text":"A ko od njih kaže: \"Uistinu, ja sam bog pored Njega\", pa tog takvog ćemo platiti Džehennemom. Tako plaćamo zalime"},{"number":30,"text":"Zar oni koji ne vjeruju ne vide da su nebesa i Zemlja bili zatvorena (cjelina), pa smo ih rastrgali. A od vode smo načinili svaku živu stvar. Pa zar neće vjerovati"},{"number":31,"text":"I načinili smo na Zemlji stabilne planine, da se njima ne potresa, i načinili na njoj široke puteve, da bi se oni uputili"},{"number":32,"text":"I učinili smo nebo svodom zaštićenim; a oni su od znakova njegovih odvraćeni"},{"number":33,"text":"I On je Taj koji je stvorio noć i dan i Sunce i Mjesec: Svakoje u orbiti plovi"},{"number":34,"text":"I nismo dali smrtniku prije tebe besmrtnost. Pa hoće li, ako umreš, tad oni biti besmrtni"},{"number":35,"text":"Svakoj duši (predstoji) kušanje smrti, a iskušavamo vas zlom i dobrom kušnjom, i Nama ćete biti povraćeni"},{"number":36,"text":"A kad te vide oni koji ne vjeruju, samo te uzimaju ruglom: \"Je li ovo onaj koji spominje bogove vaše?\" A oni su na spomen Milostivog nevjernici"},{"number":37,"text":"Čovjek je stvoren od žurbe. Pokazat ću vam znakove Svoje, zato Me ne požurujte"},{"number":38,"text":"I govore: \"Kad će ovo obećanje, ako istinu govorite"},{"number":39,"text":"Da znaju oni koji ne vjeruju (vrijeme) kad neće od lica svojih otkloniti vatru, niti s leđa svojih, niti će oni biti pomognuti"},{"number":40,"text":"Naprotiv, doći će im iznenada, pa će ih preneraziti. Tad to neće moći odbiti, niti će im se odložiti"},{"number":41,"text":"A doista se izrugivalo poslanicima prije tebe, pa je one od njih koji su se rugali, pogodilo ono čemu su se rugali"},{"number":42,"text":"Reci: \"Ko vas štiti noću i danju od Milostivog?\" Naprotiv, oni su od spominjanja Gospodara svog odvraćeni"},{"number":43,"text":"Zar oni imaju bogove koji će ih zaštititi mimo Nas? Neće moći pomoći dušama svojim, niti će oni od Nas biti odbranjeni"},{"number":44,"text":"Naprotiv, dali smo da uživaju ovi i očevi njihovi, dok im nije odužio život. Pa zar ne vide da Mi dolazimo Zemlji, umanjujući je s krajeva njenih? Pa zar će oni biti pobjednici"},{"number":45,"text":"Reci: \"Samo vas opominjem Objavom.\" A gluhi ne čuju poziv, kad budu opomenuti"},{"number":46,"text":"A da ih dotakne dašak kazne Gospodara tvog, sigurno bi rekli: \"O teško nama! Uistinu, mi smo bili zalimi"},{"number":47,"text":"I postavićemo mjerila pravde za Dan kijameta, pa se duši neće učiniti zulm nimalo. I ako bude težine zrnca gorušice, iznijet ćemo ga. I dovoljni smo Mi Obračunci"},{"number":48,"text":"I doista smo dali Musau i Harunu furkan i svjetlo, i Opomenu za bogobojazne"},{"number":49,"text":"One koji se boje Gospodara svog tajno, a oni su zbog Časa brižni"},{"number":50,"text":"A ovo je Opomena blagoslovljena, spustili smo je (na zemlju); pa zar ćete vi biti njeni poricatelji"},{"number":51,"text":"I doista smo Ibrahimu dali ispravnost njegovu ranije i bili smo o njemu Znalci"},{"number":52,"text":"Kad reče ocu svom i narodu svom: \"Šta su ovi kipovi, ovi kojima ste vi privrženi"},{"number":53,"text":"Rekoše: \"Našli smo očeve svoje, njihove obožavatelje"},{"number":54,"text":"Reče: \"Doista ste vi i očevi vaši bili u zabludi očitoj"},{"number":55,"text":"Rekoše: \"Jesi li nam donio Istinu, ili si ti od zabavljača"},{"number":56,"text":"Reče: \"Naprotiv, Gospodar vaš je Gospodar nebesa i Zemlje, Onaj koji ih je stvorio; a ja sam za to od svjedoka"},{"number":57,"text":"I tako mi Allaha, sigurno ću splanirati protiv idola vaših, nakon što se udaljite okrenuvši leđa"},{"number":58,"text":"Tad ih je učinio komadićima, izuzev velikog njihovog, da bi se njemu vratili"},{"number":59,"text":"Rekoše: \"Ko ovo učini bogovima našim? Uistinu, on je od zalima"},{"number":60,"text":"Rekoše: \"Čuli smo mladića, spominje ih; on se zove Ibrahim"},{"number":61,"text":"Rekoše: \"Pa dajte ga na oči ljudima da oni svjedoče"},{"number":62,"text":"Rekoše: \"Jesi li ti ovo učinio bogovima našim o Ibrahime"},{"number":63,"text":"Reče: \"Naprotiv, učinio je to najveći njihov, ovaj, ta pitajte ih ako mogu da govore"},{"number":64,"text":"Tad se povratiše dušama svojim, pa rekoše: \"Uistinu, vi, vi ste zalimi"},{"number":65,"text":"Zatim oboriše glave svoje: \"Doista znaš, ovi ne govore"},{"number":66,"text":"(Ibrahim) reče: \"Pa zar obožavate mimo Allaha ono šta vam nimalo ne koristi, niti vam šteti"},{"number":67,"text":"Jao vama i onom što obožavate mimo Allaha! Pa zar ne shvatate"},{"number":68,"text":"Rekoše: \"Spalite ga i pomozite bogovima svojim, ako ste radini"},{"number":69,"text":"Rekosmo: \"O vatro, budi hladnoća, i spas Ibrahimu"},{"number":70,"text":"I željeli su mu varku, pa smo njih učinili najvećim gubitnicima"},{"number":71,"text":"I spasili njega i Luta u zemlju koju smo blagoslovili svjetovima"},{"number":72,"text":"I podarili smo mu Ishaka, i Jakuba (kao) unuka. A svakojeg smo učinili od dobrih"},{"number":73,"text":"I učinili smo ih imamima, (da) upućuju po naredbi Našoj, i objavili im činjenje dobrih djela, i obavljanje salata i davanje zekata; i bili su Naši obožavatelji"},{"number":74,"text":"A Lutu - dali smo mu sud i znanje i izbavili ga iz naselja koje je činilo gadosti. Uistinu, oni su bili narod zao, grješnici"},{"number":75,"text":"I dali smo da on uđe u milost Našu. Uistinu, on je bio od dobrih"},{"number":76,"text":"I Nuhu - kad je pozivao ranije, pa smo mu se odazvali, i spasili njega i porodicu njegovu od jada golemog"},{"number":77,"text":"I pomogli ga protiv ljudi koji su poricali ajete Naše. Uistinu, oni su bili narod zao, zato smo ih sve potopili"},{"number":78,"text":"I Dawudu i Sulejmanu - kad su njih dvojica sudili o usjevu, kad se u njemu noću napasao brav narodni; a bili smo suđenju njihovom Svjedoci"},{"number":79,"text":"Tad smo učinili da to razumije Sulejman; i svakojem smo dali sud i znanje. I potčinili smo brda (da) sa Dawudom slave (Allaha) i ptice; a bili smo Izvršioci"},{"number":80,"text":"I naučili smo ga proizvodnji pancira za vas, da vas zaštite od sile vaše. Pa jeste li vi zahvalni"},{"number":81,"text":"I (potčinili smo) Sulejmanu vjetar silan - puhao je po naredbi njegovoj prema onoj zemlji koju smo blagoslovili. A o svakoj stvari smo Znalci"},{"number":82,"text":"I neke šejtane koji su ronili za njega i radili posao pored toga, a bili smo njihovi Čuvari"},{"number":83,"text":"I Ejjubu - kad zovnu Gospodara svog: \"Dotakla me je nevolja, a Ti si Najmilosrdniji od milosrdnih"},{"number":84,"text":"Tad smo mu se odazvali i otklonili šta je s njim bilo od nevolje. I dali smo mu porodicu njegovu, i slične njima uz njih milošću od Nas, i Opomenu za obožavatelje"},{"number":85,"text":"I Ismailu i Idrisu i Zul-kiflu; svaki je bio od strpljivih"},{"number":86,"text":"I dali smo da oni uđu u milost Našu. Uistinu, oni su od dobrih"},{"number":87,"text":"I Zun-nunu, kad ode srdit, tad je mislio da nećemo imati nad njim moć - pa je dozivao u tminama: \"Nema boga osim Tebe, slava neka je Tebi! Uistinu, ja sam od zalima"},{"number":88,"text":"Tad smo mu se odazvali i izbavili ga iz jada. A tako spašavamo vjernike"},{"number":89,"text":"I Zekerijjaa - kad zovnu Gospodara svog: \"Gospodaru moj! Ne ostavljaj me samog, a Ti si Najbolji od nasljednika"},{"number":90,"text":"Tad smo mu se odazvali i darovali mu Jahjaa, i osposobili mu ženu njegovu. Uistinu, oni su se natjecali u dobrim djelima i zazivali Nas dragovoljno i iz straha, i bili su Nama ponizni"},{"number":91,"text":"I onu koja je sačuvala ferdž svoj, pa smo udahli u nju od Duha Našeg, i učinili nju i sina njenog znakom za svjetove"},{"number":92,"text":"Uistinu, ova vaša umma, je umma jedna, a Ja sam Gospodar vaš, zato Mene obožavajte"},{"number":93,"text":"I rastrgali su stvar svoju između sebe - (a) svi su Nama povratnici"},{"number":94,"text":"Pa ko radi dobra djela, a on je vjernik, tad nema poricanja truda njegovog. A uistinu, Mi smo njegovi Pisari"},{"number":95,"text":"I zabrana je za naselje koje smo uništili, da se oni neće povratiti"},{"number":96,"text":"Dok, kad se pusti Jedžudž i Medžudž - a oni će se sa svake uzvisine spuštati"},{"number":97,"text":"I približi se obećanje istinito, tad gle: ukočeni pogledi onih koji nisu vjerovali. \"O teško nama! Doista smo bili u nemaru prema ovom, štaviše, bili smo zalimi"},{"number":98,"text":"Uistinu! Vi i ono što ste obožavali mimo Allaha, bićete gorivo Džehennema; vi ćete biti ti koji ćete mu doći"},{"number":99,"text":"Da su ovi bili bogovi, ne bi mu došli, a svi će u njemu biti vječito"},{"number":100,"text":"Imaće oni u njemu stenjanje i oni u njemu neće čuti"},{"number":101,"text":"Uistinu, oni kojima je od Nas prethodilo najljepše - takvi će od njega biti otklonjeni"},{"number":102,"text":"Neće čuti ni najmanji šum njegov i oni će u onom šta zažele duše njihove vječno biti"},{"number":103,"text":"Neće ih brinuti strah najveći, a susretaće ih meleci: \"Ovo je vaš Dan koji vam se obećavao"},{"number":104,"text":"Dan kad savijemo nebo kao motanjem svitka za knjige. Kao što smo počeli prvo stvaranje, ponovićemo ga. Obećanje je na Nama. Uistinu, Mi ćemo biti Izvršitelji"},{"number":105,"text":"A doista smo zapisali u Zeburu nakon Opomene, da će Zemlju naslijediti robovi Moji dobri"},{"number":106,"text":"Uistinu, u ovom je poruka za narod obožavatelja"},{"number":107,"text":"I poslali smo te samo (kao) milost svjetovima"},{"number":108,"text":"Reci: \"Samo mi se objavljuje da je Bog vaš Bog Jedini! Pa jeste li vi muslimani"},{"number":109,"text":"Pa ako se odvrate, tad reci: \"Upozorio sam vas jednako, a ne znam da li je blisko ili daleko ono čime vam se prijeti"},{"number":110,"text":"Uistinu! On zna javni govor i zna šta krijete"},{"number":111,"text":"I ne znam: možda je to iskušenje za vas i uživanje do nekog vremena"},{"number":112,"text":"(Muhammed) reče: \"Gospodaru moj! Presudi s Istinom\" - a Gospodar naš je Milostivi, Onaj od kog se traži pomoć protiv onog što pripisujete"}]}