{"number":23,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Doista, uspjet će vjernici"},{"number":2,"text":"Oni koji su u salatima svojim skrušeni"},{"number":3,"text":"I oni koji su od besmisla odvraćeni"},{"number":4,"text":"I oni koji su zekata davaoci"},{"number":5,"text":"I oni koji su furudža svojih čuvari"},{"number":6,"text":"Izuzev od žena svojih ili onog šta posjeduju desnice njihove - tad oni uistinu neće biti prekoreni"},{"number":7,"text":"Pa ko traži iza toga, pa ti takvi su prestupnici"},{"number":8,"text":"I onih koji su emaneta svojih i ugovora svojih pazitelji"},{"number":9,"text":"I onih koji su salata svojih čuvari"},{"number":10,"text":"Ti takvi su nasljednici"},{"number":11,"text":"Koji će naslijediti Firdews. Oni će u njemu biti vječito"},{"number":12,"text":"A doista smo čovjeka stvorili od ekstrakta gline"},{"number":13,"text":"Zatim ga smjestili (kao) kap sjemena u boravište čvrsto"},{"number":14,"text":"Potom kap sjemena stvorili zakvačkom, pa zakvačak stvorili grudom mesa, pa grudu mesa stvorili kostima, pa zaodjenuli kosti mesom, zatim ga sazdali stvorenjem drugim. Pa blagoslovljen neka je Allah, Najbolji od stvoritelja"},{"number":15,"text":"Zatim ćete uistinu vi, poslije toga biti mrtvaci"},{"number":16,"text":"Potom ćete uistinu vi na Dan kijameta biti podignuti"},{"number":17,"text":"A doista smo iznad vas stvorili sedam putanja, i nismo Mi prema stvaranju nehajni"},{"number":18,"text":"I spuštamo s neba vodu po mjeri, pa je smještamo u Zemlju. I uistinu, Mi smo za odvođenje njeno kadri"},{"number":19,"text":"Pa smo njome za vas sazdali vrtove palmi i grožđa, imate vi u njima mnogo voća i od njega jedete"},{"number":20,"text":"I drvo - niče iz Gore Sinajske, daje ulje i začin za one koji jedu"},{"number":21,"text":"A uistinu, imate vi u stoci ibret. Napajamo vas od onog što je u trbusima njihovim. I imate vi u njima koristi mnoge, i od njih jedete"},{"number":22,"text":"I na njima i plovilima se transportujete"},{"number":23,"text":"A doista smo poslali Nuha narodu njegovom, pa reče: \"O narode moj! Obožavajte Allaha, nemate vi drugog boga sem Njega, pa zar se ne bojite"},{"number":24,"text":"Tad velikani koji nisu vjerovali iz naroda njegovog rekoše: \"Ovo je samo smrtnik sličan vama, želi da se istakne nad vama. A da je htio Allah, sigurno bi spustio meleke. Nismo za ovo čuli od naših očeva ranijih"},{"number":25,"text":"On je samo čovjek u kojem je ludost, zato ga promatrajte neko vrijeme"},{"number":26,"text":"(Nuh) reče: \"Gospodaru moj! Pomozi mi zato što me poriču"},{"number":27,"text":"Tad mu objavismo: \"Pravi lađu pod očima Našim i objavi Našoj. Pa kad dođe naredba Naša i šikne peć, tad ukrcaj u nju od svake vrste dvoje, i porodicu svoju, izuzev onog od njih kome je prethodila riječ. I ne obraćaj mi se za one koji su zulm činili. Uistinu, oni će biti potopljeni"},{"number":28,"text":"Pa kad se smjestiš ti i ko je s tobom na lađu, tad reci: \"Hvala neka je Allahu koji nas je spasio od naroda zalima"},{"number":29,"text":"I reci: 'Gospodaru moj! Spusti me na spustište blagoslovljeno, a Ti si od onih koji spuštaju, Najbolji"},{"number":30,"text":"Uistinu, u tome su znaci, i doista smo bili Iskušavatelji"},{"number":31,"text":"Zatim smo poslije njih stvorili pokoljenje drugih"},{"number":32,"text":"I među njih poslali poslanika od njih: \"Obožavajte Allaha! Nemate vi drugog boga sem Njega. Pa zar se ne bojite"},{"number":33,"text":"I uglednici iz naroda njegovog koji nisu vjerovali i poricali susret Ahireta, a raskalašili smo ih u životu Dunjaa, rekoše: \"Ovo je samo smrtnik sličan vama, jede od onog šta jedete i pije od onog šta pijete"},{"number":34,"text":"A ako poslušate smrtnika sličnog vama, uistinu ste tad gubitnici"},{"number":35,"text":"Da li vam obećava da ćete vi kad umrete i budete prah i kosti - da ćete vi biti izvedeni"},{"number":36,"text":"Daleko je daleko šta vam se obećava"},{"number":37,"text":"To je samo naš život dunjalučki; umiremo i živimo, i nećemo mi biti podignuti"},{"number":38,"text":"On je samo čovjek, izmišlja o Allahu laž, a nećemo mi njemu biti vjernici"},{"number":39,"text":"Reče: \"Gospodaru moj! Pomozi mi zato što me poriču"},{"number":40,"text":"(Allah) reče: \"Zakratko će sigurno postati pokajanici"},{"number":41,"text":"Pa je spopao njih krik s pravdom, te smo ih smetljem učinili. Pa daleko neka je narod zalima"},{"number":42,"text":"Zatim smo poslije njih stvorili pokoljenja druga"},{"number":43,"text":"Neće preteći nijedna umma rok svoj, niti će odložiti"},{"number":44,"text":"Zatim smo slali poslanike Naše redom. Kad god je ummetu došao poslanik njihov, porekli bi ga, pa smo činili da oni slijede jedni druge i činili ih pričama. Pa daleko bio narod (onih) koji ne vjeruju"},{"number":45,"text":"Zatim smo poslali Musaa i brata njegovog Haruna sa znakovima Našim i autoritetom očitim"},{"number":46,"text":"Faraonu i velikanima njegovim, pa su se uzoholili i postali narod nadmenih"},{"number":47,"text":"Pa rekoše: \"Zar da vjerujemo dvojici smrtnika sličnih nama, a narod njih dvojice nama su robovi"},{"number":48,"text":"Pa su porekli njih dvojicu i bili od uništenih"},{"number":49,"text":"I doista, dali smo Musau Knjigu, da bi se oni uputili"},{"number":50,"text":"I učinili smo sina Merjeminog i majku njegovu, znakom, i sklonili njih dvoje na brežuljak sa boravištem i izvorištem"},{"number":51,"text":"O poslanici! Jedite od dobrih stvari i činite dobro. Uistinu! Ja sam o onom šta radite Znalac"},{"number":52,"text":"I uistinu, ova umma vaša, je umma jedna! - a Ja sam Gospodar vaš, zato se bojte Mene"},{"number":53,"text":"Pa su rastrgali stvar svoju na komade. Svaka se stranka raduje s onim šta je kod njih"},{"number":54,"text":"Zato ih ostavi u zbunjenosti njihovoj neko vrijeme"},{"number":55,"text":"Misle li da tim što im pružamo od imetka i sinova"},{"number":56,"text":"Žurimo njima u dobrim djelima? Naprotiv, ne opažaju"},{"number":57,"text":"Uistinu, oni koji su iz bojazni prema Gospodaru svom brižni"},{"number":58,"text":"I oni koji u ajete Gospodara svog vjeruju"},{"number":59,"text":"I oni koji Gospodaru svom ne pridružuju"},{"number":60,"text":"I oni koji daju šta daju - a njihova srca puna straha što će oni Gospodaru svom biti povratnici"},{"number":61,"text":"Takvi žure u dobrim djelima, i oni su u njima prethodnici"},{"number":62,"text":"I ne opterećujemo dušu, osim mogućnošću njenom. A kod Nas je Knjiga, govori Istinu, i njima se neće učiniti zulm"},{"number":63,"text":"Naprotiv, srca njihova su u zbunjenosti o ovom i oni imaju poslove mimo toga koje oni rade"},{"number":64,"text":"Dok, kad raskalašene njihove kaznimo kaznom, gle: oni će kukati"},{"number":65,"text":"Ne kukajte Danas! Uistinu, vi od Nas nećete biti pomognuti"},{"number":66,"text":"Doista, bili su vam ajeti Moji učeni, pa ste na petama svojim odstupali"},{"number":67,"text":"Oholi; o njemu ste noću naklapali"},{"number":68,"text":"Pa zašto ne razmisle o Riječi? Zar im je došlo šta nije dato očevima njihovim pređašnjim"},{"number":69,"text":"Zar ne prepoznaju poslanika svog, pa su oni poricatelji njegovi"},{"number":70,"text":"Zar govore: \"U njemu je ludilo?\" Naprotiv, donio im je Istinu; a većina njih su mrzitelji Istine"},{"number":71,"text":"A ako bi Istina slijedila strasti njihove, sigurno bi došlo do fesada nebesa i Zemlje i onog ko je u njima. Naprotiv, donijeli smo im Opomenu njihovu, pa su oni od Opomene svoje odvraćeni"},{"number":72,"text":"Zar od njih tražiš nadoknadu? Pa naknada Gospodara tvog je najbolja, i On je Najbolji od opskrbljivača"},{"number":73,"text":"A uistinu, ti ih pozivaš putu pravom"},{"number":74,"text":"I uistinu, oni koji ne vjeruju u Ahiret, s puta su skrenuli"},{"number":75,"text":"I kad bismo im se smilovali i otklonili šta je s njima od nevolje, sigurno bi ustrajali u pretjeranosti svojoj, lutajući"},{"number":76,"text":"I doista smo ih dograbili kaznom, pa se ne pokoravaju Gospodaru svom, niti se ponizuju"},{"number":77,"text":"Dok, kad im otvorimo kapiju kazne žestoke, gle: oni će u njoj biti očajnici"},{"number":78,"text":"A On je Taj koji vam je sazdao sluh, i vidove i srca. Malo što zahvaljujete"},{"number":79,"text":"I On je Taj koji vas je rasuo po Zemlji, i Njemu ćete biti sabrani"},{"number":80,"text":"I On je Taj koji oživljava i umrtvljuje i Njegova je izmjena noći i dana. Pa zar nećete shvatiti"},{"number":81,"text":"Naprotiv, govore slično šta su govorili raniji"},{"number":82,"text":"Govorili su: \"Hoćemo li kad umremo i budemo prašina i kosti, uistinu mi biti podignuti"},{"number":83,"text":"Doista, obećano nam je ovo, nama i očevima našim od ranije. Ovo su samo priče ranijih"},{"number":84,"text":"Reci: \"Čija je Zemlja i ko je na njoj, ako znate"},{"number":85,"text":"Reći će: \"Allahova.\" Reci: \"Pa zar se nećete poučiti"},{"number":86,"text":"Reci: \"Ko je Gospodar nebesa sedmerih i Gospodar Arša veličanstvenog"},{"number":87,"text":"Reći će: \"Allahovo je!\" Reci: \"Pa zar se ne bojite"},{"number":88,"text":"Reci: \"Ko je taj u čijoj ruci je vlast svake stvari, i On štiti, a nema zaštite od Njega, ako znate"},{"number":89,"text":"Reći će: \"Allahovo je!\" Reci: \"Pa kako ste opčinjeni"},{"number":90,"text":"Naprotiv, donijeli smo im Istinu, a uistinu, oni su lašci"},{"number":91,"text":"Nije uzeo Allah nikakvo dijete i nema uz Njega nikakva boga; tad bi sigurno svaki bog nestao s onim šta je stvorio, i sigurno bi se neki od njih uzdizali nad drugima! Slavljen neka je Allah od onog šta pripisuju"},{"number":92,"text":"Znalac nevidljivog i vidljivog! Pa uzvišen neka je od onog šta pridružuju"},{"number":93,"text":"Reci: \"Gospodaru moj! Ako ćeš mi pokazati čime im se prijeti"},{"number":94,"text":"Gospodaru moj, tad me ne smjesti među narod zalima"},{"number":95,"text":"A uistinu, Mi da ti pokažemo čime im prijetimo - Moćni smo"},{"number":96,"text":"Odbij zlo s onim šta je najbolje. Mi smo Najbolji znalac onog šta pripisuju"},{"number":97,"text":"I reci: \"Gospodaru moj! Tražim zaštitu u Tebe od poticanja šejtana"},{"number":98,"text":"I tražim zaštitu u Tebe Gospodaru moj, da uz mene ne prisustvuju"},{"number":99,"text":"Dok, kad jednom od njih dođe smrt, kaže: \"Gospodaru moj! Povrati me"},{"number":100,"text":"Da bih ja radio dobro u onom šta sam ostavio!\" Nikako! Uistinu, to je riječ, on je govornik njen; a ispred njih je berzeh do Dana kad će podignuti biti"},{"number":101,"text":"Pa kad se puhne u sur, tad Tog dana među njima neće biti srodstava, niti će se raspitivati"},{"number":102,"text":"Pa onaj čije mjere budu teške, pa ti takvi će biti uspješni"},{"number":103,"text":"A onaj čije mjere budu lahke, pa to su oni koji su izgubili duše svoje, u Džehennemu će vječno biti"},{"number":104,"text":"Vatra će pržiti lica njihova, a oni će u njoj biti iskeženi"},{"number":105,"text":"Zar vam nisu bili ajeti Moji učeni, pa ste ih poricali"},{"number":106,"text":"Reći će: \"Gospodaru naš! Savladala nas je nesreća naša i bili smo narod zabludjelih"},{"number":107,"text":"Gospodaru naš! Izvadi nas iz nje! Pa ako bismo se povratili, tad bismo mi uistinu bili zalimi"},{"number":108,"text":"(Allah) će reći: \"Gubite se u nju (pokunjeni), i ne govorite Mi"},{"number":109,"text":"Uistinu! Bila je skupina robova Mojih, govorili su: \"Gospodaru naš! Vjerujemo, zato nam oprosti i smiluj nam se, a Ti si Najbolji od milostivih"},{"number":110,"text":"Tad ste ih uzimali ruglom, dok nisu učinili da zaboravite Opomenu Moju, a njima ste se ismijavali"},{"number":111,"text":"Uistinu! Ja sam ih nagradio Danas što su bili strpljivi, jer oni, oni su pobjednici"},{"number":112,"text":"(Allah) će reći: \"Koliko ste ostali na Zemlji, računajući godine"},{"number":113,"text":"Reći će: \"Ostali smo dan ili dio dana. Ta pitaj one koji su brojali"},{"number":114,"text":"(Allah) će reći: \"Ostali ste samo malo, kad biste znali"},{"number":115,"text":"Pa zar mislite da smo vas stvorili zaludno i da vi Nama nećete biti povraćeni"},{"number":116,"text":"Pa uzvišen neka je Allah, Vladar istinski! Nema boga osim Njega, Gospodara Arša plemenitog"},{"number":117,"text":"A ko uz Allaha priziva boga drugog - nema on dokaza za to - pa samo je obračun njegov kod Gospodara njegovog. Uistinu! Nevjernici neće uspjeti"},{"number":118,"text":"I reci: \"Gospodaru moj! Oprosti i smiluj se, a Ti si Najbolji od milosrdnih"}]}