{"number":32,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Alif. Lam. Mim"},{"number":2,"text":"Objava Knjige je - nema sumnje u to - od Gospodara svjetova"},{"number":3,"text":"Zar govore: \"Izmislio ju je?\" Naprotiv, ona je Istina od Gospodara tvog, da opominješ narod kojem nije došao nikakav opominjač prije tebe, da bi se oni uputili"},{"number":4,"text":"Allah je Taj koji je stvorio nebesa i Zemlju i ono što je između njih u šest dana, zatim se postavio na Arš. Nemate vi mimo Njega nikakva zaštitnika, niti posrednika. Pa zar se nećete poučiti"},{"number":5,"text":"Upravlja stvar od neba ka Zemlji, zatim se uspinje Njemu u danu čija je mjera hiljadu godina od onog šta računate"},{"number":6,"text":"To je Znalac nevidljivog i vidljivog, Moćni, Milosrdni"},{"number":7,"text":"Koji je uljepšao svaku stvar, stvorio je i počeo stvaranje čovjeka od ilovače"},{"number":8,"text":"Zatim je načinio potomstvo njegovo od ekstrakta tekućine prezrene"},{"number":9,"text":"Potom ga uredio i udahnuo u njega od Duha Svog; i načinio vam sluh i vidove i srca. Malo što zahvaljujete"},{"number":10,"text":"I govore: \"Zar ćemo kad se izgubimo u zemlji, uistinu mi biti u stvaranju novom?\" Naprotiv, oni su u susret Gospodara svog nevjernici"},{"number":11,"text":"Reci: \"Uzeće vas melek smrti koji vam je određen, zatim ćete Gospodaru svome biti vraćeni"},{"number":12,"text":"A da vidiš kad prestupnici objese glave svoje kod Gospodara svog: \"Gospodaru naš! Vidjeli smo i čuli, zato nas povrati: radićemo dobro. Uistinu, mi smo uvjereni"},{"number":13,"text":"A kad bismo htjeli, dali bismo sigurno svakoj duši uputu njenu, ali, obistinila se Riječ od Mene: \"Sigurno ću napuniti Džehennem džinnima i ljudima zajedno"},{"number":14,"text":"Zato kušajte što ste zaboravili na susret ovog dana svog. Uistinu, Mi smo vas zaboravili; i iskusite kaznu vječnosti zbog onog šta ste radili"},{"number":15,"text":"Jedino u Naše znakove vjeruju oni koji - kad se opomenu njima, padaju na sedždu i slave sa hvalom Gospodara svog, a oni se ne ohole"},{"number":16,"text":"Lišavaju se bokovi njihovi postelja, zazivaju Gospodara svog iz straha i nade, i od onog čim smo ih opskrbili, udjeljuju"},{"number":17,"text":"Pa ne zna duša šta je za njih skriveno od osvježenja očiju, plaća za ono šta su radili"},{"number":18,"text":"Pa zar je ko je vjernik, kao onaj ko je grješnik? Nisu isti"},{"number":19,"text":"Što se tiče onih koji vjeruju i čine dobra djela, ta imaće oni bašče skloništem. Ugošćenje za ono šta su radili"},{"number":20,"text":"A što se tiče onih koji su griješili, pa sklonište njihovo biće vatra. Kad god zažele da izađu iz nje, biće vraćeni u nju, i biće im rečeno: \"Iskusite kaznu vatrom, onu koju ste poricali"},{"number":21,"text":"I sigurno ćemo dati da oni kušaju kaznu manju, pred kaznu veću, da bi se oni povratili"},{"number":22,"text":"A ko je nepravedniji od onog ko se opomene ajetima Gospodara svog, potom se od njih odvrati? Uistinu! Mi smo prestupnicima Osvetnici"},{"number":23,"text":"I doista, dali smo Musau Knjigu. Zato ne budi u sumnji o susretu njegovom, i učinili je Uputom sinovima Israilovim"},{"number":24,"text":"I učinili smo od njih imame: upućivali su po naredbi Našoj, pošto su bili strpljivi i u ajete Naše uvjereni"},{"number":25,"text":"Uistinu, Gospodar tvoj - On će presuditi među njima na Dan kijameta o onom u čemu su se razilazili"},{"number":26,"text":"Zar ih ne upućuje (to) koliko smo prije njih uništili naraštaja - hodaju po nastambama njihovim? Uistinu! U tome su znaci! Pa zar neće oslušnuti"},{"number":27,"text":"Zar ne vide da Mi tjeramo vodu ka zemlji jalovoj, pa izvodimo njome usjev - jedu od njega, stoka njihova i duše njihove? Pa zar neće osmotriti"},{"number":28,"text":"I govore: \"Kad će ova pobjeda, ako ste istiniti"},{"number":29,"text":"Reci: \"Na Dan pobjede neće koristiti onima koji nisu vjerovali, vjerovanje njihovo, niti će im se odgoditi"},{"number":30,"text":"Zato se okreni od njih i iščekuj, uistinu, oni su čekaoci"}]}