{"number":43,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Ha. Mim"},{"number":2,"text":"Tako mi Kitaba jasnog"},{"number":3,"text":"Uistinu, Mi smo ga učinili Kur'anom na arapskom, da biste vi razumjeli"},{"number":4,"text":"A uistinu, on je u Majci-knjizi kod Nas uzvišen, mudar"},{"number":5,"text":"Pa zar da potpuno okrenemo od vas Opomenu što ste narod pretjerujućih"},{"number":6,"text":"A koliko smo vjerovjesnika poslali ranijima"},{"number":7,"text":"I nije im došao nijedan vjerovjesnik, a da mu se nisu rugali"},{"number":8,"text":"Zato smo uništavali (one) žešće od ovih u sili, i prošao bi primjer ranijih"},{"number":9,"text":"A ako ih upitaš: \"Ko je stvorio nebesa i Zemlju?\" - sigurno će reći: \"Stvorio ih je Moćni, Znalac"},{"number":10,"text":"Onaj koji je za vas Zemlju učinio ležajem, i načinio vam na njoj puteve, da biste se vi uputili"},{"number":11,"text":"I Koji iz neba spušta vodu po mjeri, pa njome proživljujemo predio mrtvi - tako ćete biti izvedeni"},{"number":12,"text":"I Koji je stvorio parove svega, i načinio vam plovila i stoku što jašete"},{"number":13,"text":"Da se smjestite na leđa njena, potom sjetite blagodati Gospodara svog kad se na njoj uspravite, i reknete: \"Slava Onom koji nam je ovo potčinio, a ne bismo mi bili njeni ukrotitelji"},{"number":14,"text":"A uistinu, mi smo Gospodaru našem povratnici"},{"number":15,"text":"I pripisuju Mu od robova Njegovih dio! Uistinu, čovjek je nezahvalnik očiti"},{"number":16,"text":"Zar uzima od onog šta stvara, kćeri, a vas odlikuje sinovima"},{"number":17,"text":"A kad se neki od njih obraduje onim šta je Milostivom navodio kao primjer, zasjeni lice njegovo crnilom, i on je pun gnjeva"},{"number":18,"text":"Zar onaj ko se podiže u nakitu, a on nije u prepirci jasan"},{"number":19,"text":"I tretiraju meleke - one koji su robovi Milostivog - ženskima. Jesu li bili svjedoci stvaranja njihovog? Zapisaće se svjedočenje njihovo i biće pitani"},{"number":20,"text":"I govore: \"Da je htio Milostivi, ne bismo ih obožavali.\" Nemaju oni o tome nikakvo znanje. Oni samo nagađaju"},{"number":21,"text":"Zar smo im dali Knjigu prije njega, pa su oni ti koji je se pridržavaju"},{"number":22,"text":"Naprotiv, govore: \"Uistinu, mi smo našli očeve naše u ummetu i uistinu, mi smo na tragove njihove upućeni"},{"number":23,"text":"I isto tako, nismo u grad poslali nijednog od opominjača, a da nije rekao raskošnik njegov: \"Uistinu, mi smo našli očeve naše u ummetu, i uistinu, mi tragove njihove slijedimo"},{"number":24,"text":"Rekao bi: \"Zar iako sam vam donio bolju Uputu od onog na čemu ste našli očeve svoje?\" Rekli bi: \"Uistinu, mi smo u ono s čim ste poslati, nevjernici"},{"number":25,"text":"Zato bismo im se osvetili, pa pogledaj kakav je bio kraj poricatelja"},{"number":26,"text":"I kad reče Ibrahim ocu svom i narodu svom: \"Uistinu, ja sam slobodan od onog šta obožavate"},{"number":27,"text":"Izuzev Onog koji me je stvorio, pa uistinu, On će me uputiti"},{"number":28,"text":"I učinio je to riječju trajnom u potomstvu svom, da bi se oni povratili"},{"number":29,"text":"Naprotiv, dao sam da uživaju ovi i očevi njihovi, dok im nije došla Istina i Poslanik jasni"},{"number":30,"text":"I pošto im je došla Istina, rekoše: \"Ovo je sihr, i uistinu, mi smo u njega nevjernici"},{"number":31,"text":"I rekoše: \"Što ovaj Kur'an nije objavljen velikom čovjeku iz dva grada"},{"number":32,"text":"Hoće li oni dijeliti milost Gospodara tvog? Mi raspodjeljujemo između njih njihova sredstva za izdržavanje u životu Dunjaa, i uzdigli ih jedne nad drugima po stepenima, da jedan od njih drugog uzima u službu. A milost Gospodara tvog je bolja od onog šta skupljaju"},{"number":33,"text":"A da ljudi neće postati jedna zajednica, sigurno bismo onom ko ne vjeruje u Milostivog, za kuće njihove načinili krovove od srebra i stepeništa uz koja se penju"},{"number":34,"text":"I za kuće njihove vrata i sofe na koje se naslanjaju"},{"number":35,"text":"I zlatne ukrase, iako je to sve užitak života Dunjaa. A Ahiret je kod Gospodara tvog za bogobojazne"},{"number":36,"text":"A ko bude slijep na sjećanje Milostivog, dodijelit ćemo mu šejtana, pa će mu on biti drug"},{"number":37,"text":"I uistinu, oni će ih odvraćati s puta, a misliće da su oni upućeni"},{"number":38,"text":"Dok, kad Nam dođe, reći će: \"O da je između mene i između tebe rastojanje dvaju istoka. O loš si drug"},{"number":39,"text":"I neće vam koristiti (ovaj) Dan - kad ste zulm činili - što ste vi u kazni saučesnici"},{"number":40,"text":"Pa zar ti da pročuješ gluhe ili uputiš slijepce i onog ko je u zabludi očitoj"},{"number":41,"text":"Pa ako uklonimo tebe, pa uistinu, Mi ćemo njima biti Osvetnici"},{"number":42,"text":"Ili ti pokažemo čime im prijetimo; pa uistinu, Mi smo nad njima Svemoćni"},{"number":43,"text":"Zato se drži onoga šta ti je objavljeno. Uistinu, ti si na putu pravom"},{"number":44,"text":"I uistinu, on je Opomena tebi i narodu tvom; a bićete pitani"},{"number":45,"text":"I pitaj onog koga smo poslali prije tebe od poslanika Naših, jesmo li učinili mimo Milostivog bogove da budu obožavani"},{"number":46,"text":"I doista smo poslali Musaa sa znakovima Našim faraonu i uglednicima njegovim, pa je rekao: \"Uistinu, ja sam poslanik Gospodara svjetova"},{"number":47,"text":"Pa pošto im dođe sa znakovima Našim, gle - oni su im se ismijavali"},{"number":48,"text":"I nismo im pokazali nijedan znak, a da on nije bio veći od sestre svoje, i dograbili smo ih kaznom, da bi se oni povratili"},{"number":49,"text":"I rekoše: \"O čarobnjače! Zovi nam Gospodara svog s onim što je s tobom sklopio. Uistinu, mi ćemo biti upućeni"},{"number":50,"text":"Pa pošto smo otklonili od njih kaznu, gle - oni prekršiše"},{"number":51,"text":"I objavi faraon u narodu svom, reče: \"O narode moj! Zar nije moja vlast Egipta, i ovih rijeka (što) teku ispod mene? Pa zar ne vidite"},{"number":52,"text":"Zar (nisam) ja bolji od ovog - njega koji je prezren i jedva jasan"},{"number":53,"text":"Pa zašto na njega nisu stavljene narukvice od zlata ili s njim došli meleci (kao) pratioci"},{"number":54,"text":"Tad učini lahkim narod svoj, te ga poslušaše. Uistinu, oni su bili narod grješnika"},{"number":55,"text":"Pa pošto su Nas rasrdili, osvetili smo im se te ih sve potopili"},{"number":56,"text":"Te ih učinili (stvari) prošlom, i primjerom kasnijima"},{"number":57,"text":"I pošto je naveden sin Merjemin kao primjer - gle! narod tvoj na to zagalami"},{"number":58,"text":"I rekoše: \"Jesu li bogovi naši bolji ili on?\" Naveli su ti ga samo radi rasprave. Naprotiv, oni su narod svađalački"},{"number":59,"text":"On je samo rob. Obdarili smo ga i učinili ga primjerom sinovima Israilovim"},{"number":60,"text":"A da smo htjeli, sigurno bismo od vas načinili meleke na Zemlji, da naslijede"},{"number":61,"text":"I uistinu, to je znanje o Času, zato nikako ne sumnjajte u to, i slijedite Mene: ovo je put pravi"},{"number":62,"text":"I neka vas nikako ne odvrati šejtan; uistinu, on vam je neprijatelj otvoreni"},{"number":63,"text":"I pošto Isa dođe sa dokazima jasnim, reče: \"Doista sam vam došao s mudrošću i da vam objasnim dio onog o čemu se razilazite. Zato se bojte Allaha i mene poslušajte"},{"number":64,"text":"Uistinu, Allah! On je Gospodar moj i Gospodar vaš, zato Njega obožavajte; ovo je put pravi"},{"number":65,"text":"Tad su se razišle partije među njima. Pa teško onima koji čine zulm, od kazne Dana bolnog"},{"number":66,"text":"Čekuju li samo Čas da im dođe iznenada, a oni ne opaze"},{"number":67,"text":"Prijatelji će Tog dana jedni drugima neprijatelji biti - izuzev bogobojaznih"},{"number":68,"text":"O robovi Moji! Nema za vas straha Danas, niti ćete vi tugovati"},{"number":69,"text":"Oni koji su vjerovali u ajate Naše i bili muslimani"},{"number":70,"text":"Uđite u Džennet vi i žene vaše, veseleći se"},{"number":71,"text":"Obilaziće se oko njih sa posudama od zlata i peharima, a u njima će biti ono šta zažele duše i naslađuju oči, a u njemu ćete vi biti vječito"},{"number":72,"text":"A to je Džennet koji vam je dat u naslijeđe zbog onog šta ste radili"},{"number":73,"text":"Imaćete u njemu mnogo voća - od njega ćete jesti"},{"number":74,"text":"Uistinu, krivci će biti u kazni Džehennema vječito"},{"number":75,"text":"Neće im se ublažiti, a oni će u njoj biti očajnici"},{"number":76,"text":"I nismo im učinili zulm, nego su oni bili zalimi"},{"number":77,"text":"I dozivat će: \"O Malik! Nek svrši s nama Gospodar tvoj.\" Reći će: \"Uistinu, vi ste ti koji ostajete"},{"number":78,"text":"Doista, donijeli smo vam Istinu, međutim, većina vas ste ti koji Istinu mrze"},{"number":79,"text":"Zar postavljaju stvar? - pa uistinu, Mi smo Ti koji postavljamo"},{"number":80,"text":"Zar misle da Mi ne čujemo tajnu njihovu i sašaptavanje njihovo? Svakako! A izaslanici Naši su kod njih - zapisuju"},{"number":81,"text":"Reci: \"Kad bi Milostivi imao dijete, pa ja bih prvi bio od obožavatelja"},{"number":82,"text":"Slavljen neka je Gospodar nebesa i Zemlje, Gospodar Arša, od onog šta pripisuju"},{"number":83,"text":"Zato ih ostavi - upuštaju se i zabavljaju, dok ne sretnu Dan njihov kojim im se prijeti"},{"number":84,"text":"A On je Taj koji je u nebu Bog i na Zemlji Bog, i On je Mudri, Znalac"},{"number":85,"text":"I neka je blagoslovljen Onaj čija je vlast nebesa i Zemlje i onog što je između njih; a kod Njega je znanje Časa i Njemu ćete biti vraćeni"},{"number":86,"text":"I ne vladaju posredništvom oni koje mimo Njega prizivaju - izuzev ko svjedoči Istinu - a oni znaju"},{"number":87,"text":"A ako ih upitaš ko ih je stvorio, sigurno će reći: \"Allah!\" Pa kako se odvraćaju"},{"number":88,"text":"I govor njegov je: \"O Gospodaru moj! Uistinu, ovi su ljudi koji ne vjeruju"},{"number":89,"text":"Pa okreni se od njih i reci: \"Selam!\" - pa saznat će"}]}