{"number":51,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Tako Mi onih koji rasijavaju vijanjem"},{"number":2,"text":"Pa onih koji teret nose"},{"number":3,"text":"Te onih koji teku lagahno"},{"number":4,"text":"Te onih koji raspodjeljuju naredbom"},{"number":5,"text":"Uistinu, ono čime vam se prijeti, Istina je"},{"number":6,"text":"I doista, Sud će se zbiti"},{"number":7,"text":"Tako Mi neba punog putanja"},{"number":8,"text":"Uistinu, vi ste u govoru različiti"},{"number":9,"text":"Odvraća se od njega ko je odvraćen"},{"number":10,"text":"Prokleti bili oni koji nagađaju"},{"number":11,"text":"Oni koji su u gamretu nemarni"},{"number":12,"text":"Pitaju: \"Kad će Dan sudnji"},{"number":13,"text":"Onog dana kad oni budu na vatri mučeni"},{"number":14,"text":"Iskusite fitneluk svoj. Ovo je ono šta ste požurivali"},{"number":15,"text":"Uistinu, bogobojazni će u bašče i izvore"},{"number":16,"text":"Uzimaće šta im da Gospodar njihov. Uistinu, oni su prije toga bili dobročinitelji"},{"number":17,"text":"Bilo je malo što su od noći spavali"},{"number":18,"text":"I ranim zorama oni su oprost tražili"},{"number":19,"text":"I u imecima njihovim je bio dio za prosjaka i lišenog"},{"number":20,"text":"A u Zemlji su znaci za uvjerene"},{"number":21,"text":"I u dušama vašim. Pa zar ne vidite"},{"number":22,"text":"I u nebu je opskrba vaša i ono čime vam se prijeti"},{"number":23,"text":"Pa tako mi Gospodara neba i Zemlje, doista je to Istina, kao što (je istina da) vi govorite"},{"number":24,"text":"Da li ti je stigao hadis o gostima Ibrahimovim časnim"},{"number":25,"text":"Kad uđoše k njemu, pa rekoše: \"Selam!\" Reče: \"Selam, ljudi neznani"},{"number":26,"text":"Tad ode do porodice svoje, te donese tele debelo"},{"number":27,"text":"Pa im ga primače. Reče: \"Zar nećete jesti"},{"number":28,"text":"Tad osjeti od njih strah. Rekoše: \"Ne boj se!\" I obradovaše ga dječakom učenim"},{"number":29,"text":"Tad priđe žena njegova u galami, pa udari lice svoje i reče: \"Starica, nerotkinja"},{"number":30,"text":"Rekoše: \"Tako je rekao Gospodar tvoj. Uistinu, On, On je Mudri, Znalac"},{"number":31,"text":"Reče: \"Pa šta je posao vaš, o izaslanici"},{"number":32,"text":"Rekoše: \"Uistinu, mi smo poslani narodu prestupnika"},{"number":33,"text":"Da na njih spustimo kamenje od gline"},{"number":34,"text":"Kod Gospodara tvog označeno za razuzdane"},{"number":35,"text":"Pa izvedosmo onog ko je u njemu bio od vjernika"},{"number":36,"text":"Ta nismo u njemu našli, osim kuću muslimana"},{"number":37,"text":"I ostavismo u njemu znak za one koji se plaše kazne bolne"},{"number":38,"text":"I u Musau, kad ga poslasmo faraonu sa autoritetom jasnim"},{"number":39,"text":"Pa se okrenu s osloncem svojim, i reče: \"Čarobnjak ili luđak"},{"number":40,"text":"Pa smo dograbili njega i vojske njegove te ih bacili u more, a on je bio prijekora vrijedan"},{"number":41,"text":"I u Adu, kad na njih poslasmo vjetar jalovi"},{"number":42,"text":"Nije poštedio ništa što je dohvatio, a da ga nije učinio kao truhlež"},{"number":43,"text":"I u Semudu, kad im je rečeno: \"Uživajte neko vrijeme"},{"number":44,"text":"Pa su se oglušili o naredbu Gospodara svog, te ih je udario grom, a oni su gledali"},{"number":45,"text":"Tad nikako nisu mogli ustati, niti se odbraniti"},{"number":46,"text":"I narodu Nuhovom od ranije. Uistinu, oni su bili narod grješnika"},{"number":47,"text":"A nebo - sazdali smo ga energijom - i uistinu, Mi smo Širitelji"},{"number":48,"text":"A Zemlju - raširili smo je - pa divni su Oni koji su (je) prostrli"},{"number":49,"text":"I od svake stvari stvorili smo par, da biste se vi poučili"},{"number":50,"text":"Zato bježite k Allahu; uistinu, ja sam vam od Njega opominjač jasni"},{"number":51,"text":"I ne stavljajte uz Allaha boga drugog. Uistinu, ja sam vam od Njega opominjač jasni"},{"number":52,"text":"Isto tako, nije došao onima prije njih nijedan poslanik, a da nisu rekli: \"Čarobnjak\" ili \"Luđak"},{"number":53,"text":"Zar su to preporučivali jedni drugima? Naprotiv, oni su bili narod prekršitelja"},{"number":54,"text":"Pa okreni se od njih, ta nećeš ti biti prekoren"},{"number":55,"text":"I opominji, pa uistinu će opomena koristiti vjernicima"},{"number":56,"text":"A stvorio sam ljude i džinne jedino da Me obožavaju"},{"number":57,"text":"Ne želim od njih nikakvu opskrbu, niti želim da Me hrane"},{"number":58,"text":"Uistinu! Allah! On je Opskrbljivač, Posjednik energije, Jaki"},{"number":59,"text":"Pa uistinu, oni koji čine zulm imaće udio slično udjelu drugova njihovih - zato neka Me ne požuruju"},{"number":60,"text":"Pa teško onima koji ne vjeruju, od Dana njihovog kojim im se prijeti"}]}