{"number":53,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Tako mi zvijezde kad zalazi"},{"number":2,"text":"Nije zalutao drug vaš, niti skrenuo"},{"number":3,"text":"I ne govori po želji"},{"number":4,"text":"To je jedino Objava - objavljuje se"},{"number":5,"text":"Uči ga Jedan žestokih sila"},{"number":6,"text":"Posjednik snage. Tad se postavio"},{"number":7,"text":"I on bio na horizontu najuzvišenijem"},{"number":8,"text":"Zatim se približio, pa spustio"},{"number":9,"text":"Pa bio na rastojanju dva luka ili bliži"},{"number":10,"text":"Te objavio (Allah) robu Svom, šta je objavio"},{"number":11,"text":"Nije poreklo srce šta je vidio"},{"number":12,"text":"Pa zar raspravljate s njim o onom što je vidio"},{"number":13,"text":"I zaista ga je vidio pri spuštanju drugom"},{"number":14,"text":"Kod Sidre krajnje"},{"number":15,"text":"Kod koje je džennetsko sklonište"},{"number":16,"text":"Kad je Sidru pokrivalo šta je pokrivalo"},{"number":17,"text":"Nije skrenuo pogled, niti prekoračio"},{"number":18,"text":"Doista je vidio od znakova Gospodara svog - najveće"},{"number":19,"text":"Pa jeste li vidjeli Lata i Uzzaa"},{"number":20,"text":"I Menat, treću, posljednju"},{"number":21,"text":"Zar vama muško, a Njemu žensko"},{"number":22,"text":"To je onda podjela nepravedna"},{"number":23,"text":"To su samo imena - nadjeli ste ih vi i očevi vaši. Nije objavio Allah za njih nikakav dokaz. Slijede samo pretpostavku i ono šta žele duše, a već im je došla Uputa od Gospodara njihovog"},{"number":24,"text":"Ili: hoće li imati čovjek šta zaželi"},{"number":25,"text":"Pa, Allahov je zadnji i prvi"},{"number":26,"text":"I koliko je meleka u nebesima čije posredovanje neće ništa koristiti, izuzev nakon što dopusti Allah kome hoće i bude zadovoljan"},{"number":27,"text":"Uistinu, oni koji ne vjeruju u Ahiret, imenuju meleke imenovanjem ženskim"},{"number":28,"text":"A nemaju oni o tome nikakvo znanje. Slijede samo pretpostavku, a uistinu, pretpostavka ništa ne koristi Istini"},{"number":29,"text":"Zato se okreni od onog ko se odvraća od Opomene Naše i samo želi život Dunjaa"},{"number":30,"text":"To je njihov domet od znanja. Uistinu, Gospodar tvoj, On je Najbolji znalac ko je odlutao s puta Njegovog, i On je Najbolji znalac onog ko se upućuje"},{"number":31,"text":"A Allahovo je šta je u nebesima i šta je na Zemlji, da bi platio one koji čine zlo, onim što rade, i platio one koji rade lijepo - lijepim"},{"number":32,"text":"One koji izbjegavaju velike grijehe i razvrate, izuzev neznatnih. Uistinu, Gospodar tvoj je sveobuhvatnog oprosta. On je vaš Najbolji poznavalac otkad vas je stvorio od zemlje, i kad ste vi bili zameci u utrobama majki vaših. Zato ne pripisujte čistotu dušama svojim. On je Najbolji znalac onog ko se boji"},{"number":33,"text":"Pa jesi li vidio onog koji se okrenuo"},{"number":34,"text":"I dao malo i zadržao"},{"number":35,"text":"Je li kod njega znanje nevidljivog, pa on vidi"},{"number":36,"text":"Zar nije obaviješten o onom što je u listovima Musaovim"},{"number":37,"text":"I Ibrahimovim, koji je ispunio"},{"number":38,"text":"Da se neće teretiti opterećeni teretom drugog"},{"number":39,"text":"I da će čovjekovo biti samo za što se potrudi"},{"number":40,"text":"I da će trud njegov vidljiv biti"},{"number":41,"text":"Zatim će za njega biti plaćen plaćom najpotpunijom"},{"number":42,"text":"I da je Gospodaru tvom kraj (svega)"},{"number":43,"text":"I da On, On zasmijava i rasplakuje"},{"number":44,"text":"I da On, On usmrćuje i oživljava"},{"number":45,"text":"I da On stvara par: muško i žensko"},{"number":46,"text":"Od kapi sjemena kada se izbaci"},{"number":47,"text":"I da je na Njemu stvaranje drugo"},{"number":48,"text":"I da je On, On Onaj koji obogaćuje i Koji pribavlja"},{"number":49,"text":"I da je On, On Gospodar Siriusa"},{"number":50,"text":"I da je On uništio Ada prvog"},{"number":51,"text":"I Semuda tad nije poštedio"},{"number":52,"text":"I narod Nuhov od ranije. Uistinu oni - bili su oni nepravedniji i više pretjerujući"},{"number":53,"text":"I Mutefiket je porušio"},{"number":54,"text":"Pa ih je pokrilo šta je pokrilo"},{"number":55,"text":"Pa o kojoj od blagodati Gospodara svog se raspravljaš"},{"number":56,"text":"Ovo je Opomena od opomena ranijih"},{"number":57,"text":"Približio se blisko"},{"number":58,"text":"Nema za njega mimo Allaha otkrivanja"},{"number":59,"text":"Pa zar se ovom hadisu iščuđujete"},{"number":60,"text":"I smijete se, a ne plačete"},{"number":61,"text":"I vi ste bezbrižni"},{"number":62,"text":"Pa padnite na sedždu Allahu i obožavajte"}]}