{"number":61,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Allaha slavi šta je u nebesima i šta je na Zemlji, a On je Moćni, Mudri"},{"number":2,"text":"O vi koji vjerujete! Zašto govorite ono što ne činite"},{"number":3,"text":"Velika je odvratnost kod Allaha što govorite ono što ne činite"},{"number":4,"text":"Uistinu! Allah voli one koji se bore na putu Njegovom u saffu, kao da su oni bedem zbijeni"},{"number":5,"text":"I kad reče Musa narodu svom: \"O narode moj! Zašto me patite, a sigurno znate da sam vam ja poslanik Allahov?\" Pa pošto skrenuše, Allah učini da skrenu srca njihova. A Allah ne upućuje narod grješnika"},{"number":6,"text":"I kad reče Isa, sin Merjemin: \"O sinovi Israilovi! Uistinu, ja sam vam poslanik Allahov, potvrđivač za ono šta je bilo prije mene od Tewrata i donosilac radosne vijesti o Poslaniku (koji) dolazi poslije mene, njegovo ime je Ahmed.\" Pa pošto im je došao s dokazima jasnim, rekoše: \"Ovo je sihr očiti"},{"number":7,"text":"A ko je nepravedniji od onog ko izmišlja protiv Allaha laž, a on se poziva Islamu? A Allah ne upućuje narod zalima"},{"number":8,"text":"Žele da ugase svjetlo Allahovo ustima svojim, a Allah je Taj koji usavršava svjetlo Svoje, makar mrzili nevjernici"},{"number":9,"text":"On je Taj koji je poslao Poslanika Svog s Uputom i Vjerom Istine, da bi učinio da ona nadvlada vjeru svaku, makar mrzili mušrici"},{"number":10,"text":"O vi koji vjerujete! Hoćete li da vam ukažem na trgovinu (koja) će vas spasiti od kazne bolne"},{"number":11,"text":"Vjerujte u Allaha i Poslanika Njegovog, i borite se na putu Allahovom imecima svojim i dušama svojim. To je bolje za vas, kad biste znali"},{"number":12,"text":"Oprostiće vam grijehe vaše i uvešće vas u bašče ispod kojih teku rijeke, i stanove ugodne u baščama Adna. To je uspjeh veličanstven"},{"number":13,"text":"I drugi kojeg volite: pomoć od Allaha i pobjedu blisku. A radosnom viješću obraduj vjernike"},{"number":14,"text":"O vi koji vjerujete! Budite pomagači Allahu, kao što je rekao Isa, sin Merjemin, hawarijjunima: \"Ko su pomagači moji Allahu?\" Rekoše hawarijjuni: \"Mi smo pomagači Allahovi.\" Pa je vjerovala skupina sinova Israilovih, a nije vjerovala skupina. Tad smo ojačali one koji vjeruju, protiv neprijatelja njihovih, pa su postali nadmoćni"}]}