{"number":67,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Blagoslovljen neka je Onaj u ruci čijoj je vlast - a On nad svakom stvari ima moć"},{"number":2,"text":"Koji je stvorio smrt i život, da vas iskuša koji je od vas bolji djelom. A On je Moćni, Oprosnik"},{"number":3,"text":"Koji je stvorio sedam nebesa slojevito. Ne vidiš u stvaranju Milostivog nikakvog nesklada. Pa povrati pogled, da li vidiš ikakve napukline"},{"number":4,"text":"Ponovo vrati pogled drugi put, povratiće ti se pogled oslabljen i biće on pomućen"},{"number":5,"text":"I zaista smo ukrasili nebo najbliže svjetiljkama i učinili ih projektilima za šejtane, a pripremili smo im kaznu seira"},{"number":6,"text":"A imaće oni koji ne vjeruju u Gospodara svog, kaznu Džehennema, a loše je dolazište"},{"number":7,"text":"Kad budu bačeni u njega, ćut će ga, hroptaće i on će vriti"},{"number":8,"text":"Skoro da prsne od srdžbe. Kad god se u njega baci skupina, upitaće ih čuvari njegovi: \"Zar vam nije dolazio opominjač"},{"number":9,"text":"Reći će: \"Svakako; diosta nam je dolazio opominjač, pa smo porekli i rekli: 'Nije Allah objavio ništa, vi ste samo u zabludi velikoj"},{"number":10,"text":"I reći će: \"Da smo slušali ili shvatali, ne bismo bili među stanovnicima seira"},{"number":11,"text":"Tad će priznati grijeh svoj. Pa daleko bili stanovnici seira"},{"number":12,"text":"Uistinu! Oni koji se boje Gospodara svog nevidljivo, imaće oni oprost i nagradu veliku"},{"number":13,"text":"I tajili vi govor vaš ili ga razglašavali, uistinu, On je Znalac onog šta je u grudima"},{"number":14,"text":"Zar ne zna Onaj koji je stvorio? A On je Fini, Obaviješteni"},{"number":15,"text":"On je Taj koji vam je Zemlju učinio podložnom, pa hodajte predjelima njenim i jedite od opskrbe Njegove, a na Njemu je proživljenje"},{"number":16,"text":"Jeste li sigurni od Onog ko je u nebu, da neće dati da vas proguta zemlja, tad kad se ona zatalasa"},{"number":17,"text":"Ili ste sigurni od Onog ko je u nebu, da ne pošalje na vas oluju? Pa saznaćete kakva je opomena Moja"},{"number":18,"text":"I zaista su poricali oni koji su bili prije njih, pa kakvo je bilo odbijanje Moje"},{"number":19,"text":"Zar ne vide ptice iznad sebe - šire krila i skupljaju ih? Drži ih jedino Milostivi. Uistinu, On je svake stvari Vidilac"},{"number":20,"text":"Ili, ko je taj ko je vojska vaša, da vam pomogne mimo Milostivog? Nevjernici su samo u iluziji"},{"number":21,"text":"Ili, ko je taj ko će vas opskrbiti, ako zadrži opskrbu Svoju? Naprotiv, ustrajavaju u prevršivanju i izbjegavanju"},{"number":22,"text":"Pa da li je ko ide ničice na licu svom upućeniji, ili ko ide pravo na putu pravom"},{"number":23,"text":"Reci: \"On je Taj koji vas je stvorio, i načinio vam sluh i vidove i srca. Malo što zahvaljujete"},{"number":24,"text":"Reci: \"On je Taj koji vas je umnožio na Zemlji, a Njemu ćete biti sabrani"},{"number":25,"text":"I govore: \"Kad će ta prijetnja, ako istinu govorite"},{"number":26,"text":"Reci: \"Znanje je jedino kod Allaha, a ja sam samo opominjač jasni"},{"number":27,"text":"Pa pošto ga ugledaju blizu, rastužiće se lica onih koji ne vjeruju, i biće rečeno: \"Ovo je to šta ste prizivali"},{"number":28,"text":"Reci: \"Vidite li? Ako uništi Allah mene i onog ko je sa mnom, ili nam se smiluje - pa ko će zaštititi nevjernike od kazne bolne"},{"number":29,"text":"Reci: \"On je Milostivi. U Njega vjerujemo i u Njega se pouzdavamo. Pa saznaćete ko je taj ko je u zabludi očitoj"},{"number":30,"text":"Reci: \"Vidite li? Ako voda vaša osvane porinuta, pa ko će vam donijeti vodu tekuću"}]}