{"number":68,"edition":"bs.mlivo","ayahs":[{"number":1,"text":"Nun. Tako mi pera i onog što pišu"},{"number":2,"text":"Ti nisi milošću Gospodara svoga lud"},{"number":3,"text":"A uistinu, ti ćeš imati nagradu neprekidnu"},{"number":4,"text":"I uistinu, ti si naravi uzvišene, divne"},{"number":5,"text":"Pa vidjećeš (Muhammede) i vidjeće"},{"number":6,"text":"Koji je od vas zaluđen"},{"number":7,"text":"Doista, Gospodar tvoj - On je Najbolji znalac onog ko je zalutao s puta Njegovog i On je Najbolji znalac upućenih"},{"number":8,"text":"Zato ne slušaj poricatelje"},{"number":9,"text":"Voljeli bi da popustiš, pa bi popustili"},{"number":10,"text":"I ne slušaj svakog zakletnika prezrenog"},{"number":11,"text":"Klevetnika, koji hoda s potvorom"},{"number":12,"text":"Sprečavatelja dobrog, prestupnika, grješnika"},{"number":13,"text":"Nasilnika, sem toga kopileta"},{"number":14,"text":"Jer je imalac bogatstva i sinova"},{"number":15,"text":"Kad mu se uče ajeti Naši, rekne: \"Priče ranijih"},{"number":16,"text":"Obilježićemo ga na surli"},{"number":17,"text":"Uistinu! Mi smo ih iskušavali kao što smo iskušavali vlasnike bašče, kad su se zakleli da će je sigurno ujutro obrati"},{"number":18,"text":"A ne zatražiše izuzeće"},{"number":19,"text":"Pa je obiđe taifun od Gospodara tvog - a oni su bili usnuli"},{"number":20,"text":"Pa osvanu kao posječena"},{"number":21,"text":"Tad su se jutrom dozivali"},{"number":22,"text":"Poranite na nasad svoj, ako ste berači"},{"number":23,"text":"Pa su otišli i oni su šaputali"},{"number":24,"text":"Neće vam danas u nju nikako ući siromah"},{"number":25,"text":"I poraniše za sprječavanje kadri"},{"number":26,"text":"Pa pošto je vidješe, rekoše: \"Doista, mi smo zalutali"},{"number":27,"text":"Naprotiv! Mi smo lišeni"},{"number":28,"text":"Reče srednji njihov: \"Zar vam nisam rekao zašto ne slavite"},{"number":29,"text":"Rekoše: \"Slava Gospodaru našem, uistinu, mi smo bili zalimi"},{"number":30,"text":"Pa oni priđoše jedan drugom, koreći se"},{"number":31,"text":"Rekoše: \"O teško nama! Uistinu, mi smo bili oni koji prevršuju"},{"number":32,"text":"Možda će Gospodar naš da nam zamijeni bolju od ove. Uistinu, mi Gospodaru svom žudimo"},{"number":33,"text":"Takva je kazna. A doista je kazna Ahireta veća - kad bi znali"},{"number":34,"text":"Uistinu, bogobojazni će imati kod Gospodara svog bašče zadovoljstva"},{"number":35,"text":"Pa hoćemo li tretirati muslimane kao prestupnike"},{"number":36,"text":"ta vam je? Kako prosuđujete"},{"number":37,"text":"Ili, imate li vi knjigu u kojoj učite"},{"number":38,"text":"Da ćete vi uistinu imati u njoj šta odaberete"},{"number":39,"text":"Ili, imate li vi zakletve od Nas dalekosežne - do Dana kijameta, da ćete uistinu imati vi šta dosudite"},{"number":40,"text":"Pitaj ih, koji od njih je tome jamac"},{"number":41,"text":"Ili imaju oni ortake? Pa neka dovedu ortake svoje, ako istinu govore"},{"number":42,"text":"Na Dan kad se otkrije potkoljenica, i pozovu na sedžde - pa ne mognu"},{"number":43,"text":"Oboreni biće pogledi njihovi, prekriće ih poniženje; a doista su oni bili pozivani na sedžde i bili su oni zdravi"},{"number":44,"text":"Pa ostavi Mene i onog ko poriče ovaj hadis Približavaćemo ih postepeno, odakle ne znaju"},{"number":45,"text":"I pustiću im, uistinu, spletka Moja je jaka"},{"number":46,"text":"Zar njih pitaš za nagradu? - pa su oni globom opterećeni"},{"number":47,"text":"Ili je kod njih nevidljivo, pa oni pišu"},{"number":48,"text":"Pa strpi se radi presude Gospodara tvog, i ne budi kao saputnik (velike) ribe, kad je povikao, a on je bio očajan"},{"number":49,"text":"I da ga nije stigla blagodat od Gospodara njegovog, doista bi bio izbačen na pusto mjesto i on bi bio prekoren"},{"number":50,"text":"Pa ga je odabrao Gospodar njegov te ga učinio (jednim) od pravednih"},{"number":51,"text":"I gotovo da oni koji ne vjeruju učine pogledima svojim da ti poklizneš pošto su čuli Opomenu, i govore: \"Doista je on luđak"},{"number":52,"text":"A on je samo Opomena svjetovima"}]}