{"number":37,"edition":"no.berg","ayahs":[{"number":1,"text":"Ved dem på rad og rekke"},{"number":2,"text":"de barskt tilrettevisende"},{"number":3,"text":"som leser opp formaningen"},{"number":4,"text":"Sannelig, deres Gud er én"},{"number":5,"text":"Herren over himlene og jorden, og det som mellom dem er, soloppgangens Herre"},{"number":6,"text":"Vi har prydet den nederste himmel med stjernenes pryd"},{"number":7,"text":"Og som et vern mot hver opprørsk Satan"},{"number":8,"text":"De kan ikke avlytte det himmelske råd, for de angripes fra alle kanter for å forjages"},{"number":9,"text":"og de har i vente en varig straff"},{"number":10,"text":"unntatt en enkelt som snapper opp litt, og så forfølges av en gnistrende flamme"},{"number":11,"text":"Be dem uttale seg: Er menneskene vanskeligere å skape, eller annet Vi har skapt? Vi skapte dem av myk leire"},{"number":12,"text":"Nei, du undrer deg, og de spotter"},{"number":13,"text":"Når de formanes, husker de ikke"},{"number":14,"text":"og når de ser et jærtegn, håner de"},{"number":15,"text":"og sier: «Dette er skjær magi"},{"number":16,"text":"Når vi er døde og er blitt jord og knokler"},{"number":17,"text":"skal vi da gjenoppvekkes, og våre henfarne fedre?»"},{"number":18,"text":"Si: «Ja, og i all underdanighet.»"},{"number":19,"text":"Det lyder bare et stort skrik, og så kan de se"},{"number":20,"text":"Og de sier: «Trøste oss, dette er dommens dag.»"},{"number":21,"text":"Dette er avgjørelsens dag, som dere holdt for løgn"},{"number":22,"text":"«Samle sammen de som handlet ondt, og deres hustruer, og det de tilbad"},{"number":23,"text":"utenom Gud, og før dem til veien til helvete"},{"number":24,"text":"Og still dem opp! De skal trekkes til regnskap"},{"number":25,"text":"Hva er i veien med dere, så dere ikke hjelper hverandre?»"},{"number":26,"text":"Nei, på denne dag kapitulerer de"},{"number":27,"text":"går hen til hverandre i samtale og sier"},{"number":28,"text":"«Dere pleide å komme til oss fra høyre side?»"},{"number":29,"text":"Disse svarer: «Nei, dere var så allikevel ikke troende"},{"number":30,"text":"Vi hadde ingen makt over dere. Nei, dere var opprørske folk"},{"number":31,"text":"Nå er Herrens ord realitet for oss, vi får smake det"},{"number":32,"text":"Vi forførte dere. Vi var selv på villstrå.»"},{"number":33,"text":"Denne dag har de alle sin del i straffen"},{"number":34,"text":"Slik gjør Vi med synderne"},{"number":35,"text":"for når man sa til dem: «Det er ingen gud utenom Gud,» viste de hovmod"},{"number":36,"text":"og sa: «Skal vi oppgi våre guder for en besatt rimsmed?»"},{"number":37,"text":"Nei, han brakte sannheten, og stadfestet sendebudene"},{"number":38,"text":"Dere skal visselig få smake den smertelige straff"},{"number":39,"text":"og ikke belønnes for annet enn det dere har gjort"},{"number":40,"text":"Unntatt er Guds oppriktige tjenere"},{"number":41,"text":"Disse har i vente den omsorg som er kunngjort"},{"number":42,"text":"frukt, og de blir gjort ære på"},{"number":43,"text":"i lykksalighetens haver"},{"number":44,"text":"på leier overfor hverandre"},{"number":45,"text":"og et drikkebeger går rundt blant dem, fylt fra en kilde"},{"number":46,"text":"rent og velsmakende for dem som drikker"},{"number":47,"text":"hvori ingen beruselse er, og de blir ikke utmattet"},{"number":48,"text":"Hos dem er storøyde jomfruer med blyge blikk"},{"number":49,"text":"de er som velbeskyttede perler"},{"number":50,"text":"De vender seg mot hverandre idet de samtaler"},{"number":51,"text":"En av dem sier: «Jeg hadde en venn, som sa"},{"number":52,"text":"’Hører du til dem som holder det for sant"},{"number":53,"text":"At når vi er døde og er blitt jord og knokler, kommer vi for dommen?’»"},{"number":54,"text":"Og han fortsetter: «Skal vi kikke ned?»"},{"number":55,"text":"Så kikker han, og ser ham midt i helvete, og sier"},{"number":56,"text":"«Ved Gud! Du var nær ved å styrte meg i fordervelsen"},{"number":57,"text":"Hadde det ikke vært for Herrens nåde, ville jeg måttet møte der"},{"number":58,"text":"Skal vi bare dø"},{"number":59,"text":"vår første død, og ikke bli straffet"},{"number":60,"text":"Det er den store seier"},{"number":61,"text":"For noe slikt må de strevende streve!»"},{"number":62,"text":"Hva er å foretrekke som gjestfrihet, dette, eller Zaqqumtreet i helvete"},{"number":63,"text":"Dette har Vi gjort til en prøvelse for de urettferdige"},{"number":64,"text":"Det er et tre som vokser opp fra helvetes grunn"},{"number":65,"text":"og dets fruktkolber ser ut som satanhoder"},{"number":66,"text":"De spiser av det, og fyller sin buk fra det"},{"number":67,"text":"og derpå får de et brygg av kokende vann"},{"number":68,"text":"Så vender de tilbake til helvetesilden"},{"number":69,"text":"De fant sine fedre på villspor"},{"number":70,"text":"Men de haster frem i deres spor"},{"number":71,"text":"Før dem fór de fleste av deres forfedre vill"},{"number":72,"text":"Vi sendte ut blant dem advarere"},{"number":73,"text":"men se, hva enden ble for de advarte"},{"number":74,"text":"Unntatt Guds oppriktige tjenere"},{"number":75,"text":"Noa ropte til Oss. Hvor utmerket er Vi som svarer"},{"number":76,"text":"Og Vi reddet ham og hans fra den store nød"},{"number":77,"text":"og Vi lot hans etterkommere bli overlevende"},{"number":78,"text":"Og Vi etterlot om ham blant senere slektledd disse ord"},{"number":79,"text":"«Fred over Noa blant all verdens mennesker.»"},{"number":80,"text":"Slik lønner Vi dem som handler vel"},{"number":81,"text":"Han er en av Våre troende tjenere"},{"number":82,"text":"Så druknet Vi resten"},{"number":83,"text":"Av hans sort var også Abraham"},{"number":84,"text":"da han kom til Herren med et rent hjerte, og"},{"number":85,"text":"sa til sin far og sitt folk: «Hva er det dere tilber"},{"number":86,"text":"Vil dere på falsk vis ha guder fremfor Gud"},{"number":87,"text":"Hva er da deres mening om all verdens Herre?»"},{"number":88,"text":"Og han kastet et blikk på stjernene, og sa"},{"number":89,"text":"«Jeg er nok syk.»"},{"number":90,"text":"Da snudde de seg rundt og gikk bort fra ham"},{"number":91,"text":"Så vendte han seg til deres guder, og sa: «Vil dere ikke spise"},{"number":92,"text":"Hva feiler det dere siden dere ikke snakker?»"},{"number":93,"text":"Så gikk han innpå dem, og slo dem med sin høyre hånd"},{"number":94,"text":"Da kom de løpende hen til ham"},{"number":95,"text":"Han sa: «Tilber dere noe som dere har meislet til"},{"number":96,"text":"skjønt det er Gud som har skapt dere og alt dere lager?»"},{"number":97,"text":"De sa: «Lag ham en ovn, og kast ham inn i ilden!»"},{"number":98,"text":"De ville prøve et knep med ham, men Vi gjorde at de selv kom til kort"},{"number":99,"text":"Abraham sa: «Jeg går hen til Herren. Han vil lede meg"},{"number":100,"text":"Herre, gi meg en sønn av de rettferdige!»"},{"number":101,"text":"Og Vi bebudet ham en mild sønn"},{"number":102,"text":"Da han var stor nok til å gå ham til hånde, sa Abraham: «Min sønn, jeg så i en drøm at jeg skal ofre deg. Tenk over hva du synes.» Han svarte: «Min far, gjør det som du er pålagt. Du vil finne meg standhaftig, om Gud vil.»"},{"number":103,"text":"Da de hadde underkastet seg påbudet, og han hadde lagt sønnen"},{"number":104,"text":"med ansiktet ned, ropte vi til ham: «Abraham"},{"number":105,"text":"Du har rettet deg etter drømmesynet! Slik lønner Vi dem som handler vel"},{"number":106,"text":"Dette var visselig en klar prøvelse.»"},{"number":107,"text":"Og Vi løste ham ut ved et opphøyet offer"},{"number":108,"text":"Vi etterlot om ham blant senere slektledd disse ord"},{"number":109,"text":"«Fred over Abraham.»"},{"number":110,"text":"Slik lønner Vi dem som handler vel"},{"number":111,"text":"Han var en av Våre troende tjenere"},{"number":112,"text":"Og Vi bebudet ham Isak, en profet, en av de rettferdige"},{"number":113,"text":"Og Vi velsignet ham og Isak. Blant deres etterkommere handler noen vel, og andre belaster seg med åpenbar urett"},{"number":114,"text":"Vi viste også godhet mot Moses og Aron"},{"number":115,"text":"og Vi reddet dem og deres folk fra den store nød"},{"number":116,"text":"og hjalp dem, så de vant seier"},{"number":117,"text":"Vi gav dem den tydelige skriften"},{"number":118,"text":"og ledet dem på rett vei"},{"number":119,"text":"Vi etterlot om dem hos senere slektledd disse ord"},{"number":120,"text":"«Fred over Moses og Aron!»"},{"number":121,"text":"Slik lønner Vi dem som handler vel"},{"number":122,"text":"De var av Våre troende tjenere"},{"number":123,"text":"Elias var også et av sendebudene"},{"number":124,"text":"da han sa til sitt folk: «Vil dere ikke vise gudsfrykt"},{"number":125,"text":"Vil dere påkalle Bal, og oppgi den beste skaper"},{"number":126,"text":"Gud, deres Herre, og deres henfarne fedres Herre?»"},{"number":127,"text":"Men de holdt ham for løgner, så de vil måtte møte for dommen"},{"number":128,"text":"Unntatt er Guds oppriktige tjenere"},{"number":129,"text":"Vi etterlot om ham hos senere slektledd disse ord"},{"number":130,"text":"«Fred over Elias!»"},{"number":131,"text":"Slik lønner Vi dem som handler vel"},{"number":132,"text":"Han var en av Våre troende tjenere"},{"number":133,"text":"Lot var også et av sendebudene"},{"number":134,"text":"da Vi reddet ham og alle hans"},{"number":135,"text":"unntatt en gammel kone som ble igjen"},{"number":136,"text":"Så utslettet Vi de andre"},{"number":137,"text":"Dere ferdes forbi dem"},{"number":138,"text":"sent og tidlig. Vil dere da ikke forstå"},{"number":139,"text":"Jonas var også et av sendebudene"},{"number":140,"text":"da han flyktet om bord i det fullastede skip"},{"number":141,"text":"og kastet lodd med mannskapet, og tapte"},{"number":142,"text":"Så slukte hvalen ham, idet han var klanderverdig"},{"number":143,"text":"Hadde han ikke vært av dem som priser Gud"},{"number":144,"text":"ville han forblitt i dens buk til oppstandelsens dag"},{"number":145,"text":"Men Vi kastet ham opp på en øde strand, og han var syk"},{"number":146,"text":"Og Vi lot vokse opp over ham en vekst"},{"number":147,"text":"Så sendte Vi ham til hundre tusen, eller mer"},{"number":148,"text":"og de ble troende. Og Vi lot dem nyte livet inntil videre"},{"number":149,"text":"Be dem uttale seg, er det slik at Herren har døtre, mens de har sønner"},{"number":150,"text":"Har Vi skapt englene av kvinnekjønn, mens de var til stede"},{"number":151,"text":"Sier de ikke i sin løgnaktighet"},{"number":152,"text":"«Gud har lagt seg til barn?» De er visselig løgnere"},{"number":153,"text":"Skulle Han foretrekke døtre fremfor sønner"},{"number":154,"text":"Hva er i veien med deres dømmekraft"},{"number":155,"text":"Vil dere ikke tenke etter"},{"number":156,"text":"Har dere noen klar autorisasjon"},{"number":157,"text":"Legg frem skriften som dere har, om dere snakker sant"},{"number":158,"text":"De har laget slektskap mellom ham og dsjinnene, skjønt dsjinnene vel vet at de må møte for dommen"},{"number":159,"text":"Ære være Gud, fjernt borte fra det de påstår"},{"number":160,"text":"Unntatt er Guds oppriktige tjenere"},{"number":161,"text":"Dere og det dere tilber"},{"number":162,"text":"dere kan ikke forføre noen mot Ham"},{"number":163,"text":"unntatt den som vil havne i Ilden"},{"number":164,"text":"Det er ingen av oss som ikke har sin bestemte plass"},{"number":165,"text":"Vi er det, som stiller opp i rad og rekke"},{"number":166,"text":"Vi er det, som priser Gud"},{"number":167,"text":"Om de nå sa"},{"number":168,"text":"«Hadde vi bare hatt en formaning fra de henfarne"},{"number":169,"text":"så skulle vi vært Guds oppriktige tjenere.»"},{"number":170,"text":"Men de forkaster den. De skal få å vite"},{"number":171,"text":"Visselig, Vårt ord er tidligere gitt til Våre tjenere, utsendingene"},{"number":172,"text":"og de er det som blir ytet hjelp"},{"number":173,"text":"Visselig, våre skarer, de vil vinne seieren"},{"number":174,"text":"Snu deg vekk fra dem inntil videre"},{"number":175,"text":"og hold øye med dem. De skal få se"},{"number":176,"text":"Ber de om å få Vår straff påskyndet"},{"number":177,"text":"Når den står for døren, blir det en ond morgen for dem som ble advart"},{"number":178,"text":"Snu deg vekk fra dem inntil videre"},{"number":179,"text":"og hold et øye. De skal få se"},{"number":180,"text":"Ære være Herren, maktens Herre, fjernt borte fra det de påstår"},{"number":181,"text":"Fred over sendebudene"},{"number":182,"text":"Lovet være Gud, all verdens Herre"}]}