{"number":43,"edition":"no.berg","ayahs":[{"number":1,"text":"Ha Mim"},{"number":2,"text":"Ved den klare skrift"},{"number":3,"text":"Vi gjorde den til en Koran på arabisk, så dere må forstå"},{"number":4,"text":"Se, den finnes i skriftens opphav, hos Oss, den er opphøyet, vis"},{"number":5,"text":"Skulle Vi forholde dere formaningen, fordi dere er et lettsindig folk"},{"number":6,"text":"Hvor mange profeter har Vi vel sendt de henfarne"},{"number":7,"text":"men det kom ingen profet til dem uten at de drev ap med ham"},{"number":8,"text":"Så Vi utslettet slike som var mer fryktinngytende enn de nålevende, og de henfarnes eksempel ble satt"},{"number":9,"text":"Om du spør dem: «Hvem skapte himlene og jorden?» Da svarer de: «Den Mektige, den Allvitende har skapt dem.»"},{"number":10,"text":"Han har gjort jorden til leie for dere, og laget fremkomstveier for dere på den, så dere må finne frem"},{"number":11,"text":"Han sender vann fra oven i tilmålt mengde. Ved det vekker Vi til liv det døde land. På samme måte vil dere bli brakt frem fra gravene"},{"number":12,"text":"Han er det, som har skapt alt parvis, og Han har gitt dere skipene, og kveg som dere rir"},{"number":13,"text":"så dere kan ta plass på deres rygg, og så komme Herrens nåde i hu, når dere har satt dere til rette, og si: «Ære være Ham, som har gjort dette underdanig for oss! Vi ville ikke greid det"},{"number":14,"text":"Vi vender oss til Herren.»"},{"number":15,"text":"Dog har de gitt Ham noen av Hans tjenere som en del av Ham selv! Mennesket er sannelig klart utakknemlig"},{"number":16,"text":"Skulle Han ha skaffet seg døtre av det Han skaper, og utsett sønnene for dere"},{"number":17,"text":"Når noen av dem får melding om nyfødte pikebarn, som han anser passende for den Barmhjertige, så formørkes hans ansikt, og han må legge bånd på seg"},{"number":18,"text":"Kanskje en som er oppfostret i velstand, og ikke er klar i argumentasjonen"},{"number":19,"text":"De har gjort englene, som er den Barmhjertiges tjenere, til kvinnelige vesener. Var de vel vitne til deres skapelse? Deres vitnemål skal bli oppskrevet, og de blir forhørt"},{"number":20,"text":"De sier også: «Om den Barmhjertige hadde villet, så ville vi ikke ha tilbedt dem.» De har ingen kunnskap om dette, de bare formoder"},{"number":21,"text":"Eller har Vi tidligere brakt dem en Bok, som de holder seg til"},{"number":22,"text":"Nei, de sier: «Vi fant at våre fedre dannet et (tros)samfunn, og vi følger i deres spor.»"},{"number":23,"text":"Således har Vi før din tid aldri sendt en advarer til noen by, uten at de som levde i vellevnet sa: «Vi fant at våre fedre dannet et (tros)samfunn, og vi følger i deres spor.»"},{"number":24,"text":"Si: «Om nå jeg kom til dere med bedre ledelse enn den dere fant at deres fedre holdt seg til?» Da vil de svare: «Vi tror ikke på det dere er sendt med.»"},{"number":25,"text":"Så rammet Vi dem med gjengjeldelse, og se hva enden ble for dem som holdt sannhet for løgn"},{"number":26,"text":"En gang sa Abraham til sin far og sitt folk: «Jeg vil ikke ha noe å gjøre med det dere tilber"},{"number":27,"text":"unntatt Han som skapte meg, og Han vil lede meg.»"},{"number":28,"text":"Og han gjorde dette til stående ord blant sine etterkommere, så de måtte vende om"},{"number":29,"text":"Ja, Jeg gav disse og deres fedre gode dager, til sannheten og et klart sendebud kom til dem"},{"number":30,"text":"Men da sannheten kom til dem, sa de: «Dette er trolldom! Vi tror ikke på det.»"},{"number":31,"text":"De sier også: «Hvorfor ble ikke denne Koran åpenbart for en mann av betydning fra en av de to byer?»"},{"number":32,"text":"Er det de som fordeler Herrens nåde? Det er Vi som har fordelt blant dem deres levemåte i jordelivet, og hevet noen over andre i rang, så noen kan sette andre i tjeneste. Men Herrens nåde er bedre enn det de samler sammen"},{"number":33,"text":"Hadde det ikke vært for at menneskene ville bli et eneste vantro folk, ville Vi gitt dem som fornekter den Barmhjertige, sølvtak på deres hus, og trapper til å stige opp"},{"number":34,"text":"og dører til deres hus, og divaner hvor de kan lene seg tilbake"},{"number":35,"text":"og forgylling. Alt dette er bare jordelivets gleder. Men det hinsidige liv hos Herren er for de gudfryktige"},{"number":36,"text":"Den som er blind for den Barmhjertiges formaning, ham tildeler vi en satan til følgesvenn"},{"number":37,"text":"De stenger dem ute fra veien, men de tror at de er ledet rett"},{"number":38,"text":"Til han kommer til Oss, og sier til sin følgesvenn: «Å, hadde det bare vært så langt mellom deg og meg som mellom øst og vest!» For en sørgelig følgesvenn"},{"number":39,"text":"Det vil ikke hjelpe dere noe denne dag, hvis dere har gjort ondt, at dere er flere om straffen"},{"number":40,"text":"Kan du få døve til å høre, eller rettlede blinde og dem som er klart på villstrå"},{"number":41,"text":"Om Vi tar deg bort, så vil Vi ramme dem med gjengjeldelse"},{"number":42,"text":"Eller Vi kan la deg se noe av det Vi har stilt dem i utsikt. Vi har makt over dem"},{"number":43,"text":"Hold fast ved det som er åpenbart for deg! Du er visselig på rett vei"},{"number":44,"text":"Det er en påminnelse til deg om ditt folk. Og dere vil bli trukket til regnskap"},{"number":45,"text":"Spør de av Våre sendebud som Vi sendte før din tid: «Har Vi gitt dem andre guder enn den Barmhjertige å tjene?»"},{"number":46,"text":"Vi sendte Moses med Våre tegn til Farao og hans råd, og han sa: «Jeg er et sendebud fra all verdens Herre.»"},{"number":47,"text":"Men da han kom med Våre tegn, så lo de av dem"},{"number":48,"text":"Og ikke et tegn viste Vi dem uten at det var større enn det foregående. Og Vi tok dem fatt med straffen, så de måtte vende om"},{"number":49,"text":"Men de sa: «Du trollmann, be til din Herre for oss ved den avtale Han har gjort med deg! Vi er på rett vei.»"},{"number":50,"text":"Men da Vi tok bort fra dem straffen, brøt de sitt ord"},{"number":51,"text":"Og Farao lot utrope til sitt folk: «Er ikke herredømmet over Egypten mitt, og disse elver, som flyter foran meg? Ser dere da ikke"},{"number":52,"text":"Er ikke jeg bedre enn denne mann, en foraktelig mann, som nesten ikke kan uttrykke seg klart"},{"number":53,"text":"Hvorfor er det ikke gitt ham armbånd av gull, og hvorfor er ikke englene kommet sammen med ham?»"},{"number":54,"text":"Slik forledet han sitt folk, og de adlød ham. De var sannelig ugudelige mennesker"},{"number":55,"text":"Så da de hadde vakt Vår bedrøvelse og indignasjon, lot Vi gjengjeldelsen ramme dem, og Vi druknet dem alle"},{"number":56,"text":"Vi gjorde dem til en forgangen slekt, og et eksempel for de senere"},{"number":57,"text":"Når Marias sønn blir nevnt som et eksempel, så skriker ditt folk opp"},{"number":58,"text":"og sier: «Er ikke våre guder like gode som han?» De nevner ham for deg bare for å krangle. Nei, de er trettekjære mennesker"},{"number":59,"text":"Han er bare en tjener som Vi har vist nåde, og Vi gjorde ham til et eksempel for Israels barn"},{"number":60,"text":"Om Vi ville, kunne Vi la engler fremstå blant dere, og overta jorden"},{"number":61,"text":"Han utgjør kunnskap om timen, så vær ikke i tvil om den, og følg meg! Dette er rett vei"},{"number":62,"text":"La ikke Satan hindre dere. Han er en klar fiende for dere"},{"number":63,"text":"Da Jesus kom med klar beskjed, sa han: «Jeg er kommet til dere med visdommen, og for å gjøre klart for dere noe av det dere strides om. Så frykt Gud, og adlyd meg"},{"number":64,"text":"Gud er min Herre og deres Herre, så tjen Ham! Dette er rett vei!»"},{"number":65,"text":"Men grupper blant dem kom i strid. Ve over dem som gjør urett, for en smertelig dags straff"},{"number":66,"text":"Kan de se frem til annet enn at timen kommer over dem, plutselig, uten at de aner noe"},{"number":67,"text":"Venner blir på denne dag fiender, unntatt de gudfryktige"},{"number":68,"text":"«Mine tjenere, frykt skal ikke hvile over dere denne dag, ei heller sorg"},{"number":69,"text":"dere som trodde på Vårt ord, og gav dere Gud i vold"},{"number":70,"text":"Gå inn i paradisets haver, dere og deres hustruer, og fryd dere!»"},{"number":71,"text":"Det sendes rundt blant dem fat og drikkebegre av gull, med alt deres hjerter begjærer, og som fryder øyet. «Der skal dere være og bli"},{"number":72,"text":"Dette er paradisets have, som dere har fått i arv for deres gjerninger"},{"number":73,"text":"Der har dere rikelig med frukt til å spise av.»"},{"number":74,"text":"Men synderne skal være og bli i helvetes straff"},{"number":75,"text":"som ikke mildnes for dem i deres fortvilelse der"},{"number":76,"text":"Vi har ikke gjort dem urett, men det var de som gjorde urett"},{"number":77,"text":"De vil rope: «Engel Malik, måtte Herren gjøre det av med oss,» og han svarer: «Dere må bli der.»"},{"number":78,"text":"Vi kom jo til dere med sannheten, men de fleste av dere mislikte sannheten"},{"number":79,"text":"Eller har de funnet på noe? Vi kan også finne på noe"},{"number":80,"text":"Eller regner de med at Vi ikke hører deres hemmelighet, og deres overlegninger? Jo, Våre utsendinger er til stede hos dem, og skriver opp"},{"number":81,"text":"Si: «Om den Barmhjertige hadde en sønn, ville jeg være den første til å tjene ham"},{"number":82,"text":"Ære være Herren over himlene og jorden, Herren over tronen, langt borte fra det de beskriver.»"},{"number":83,"text":"Så la dem prate og drive sitt spill, til de møter den dag som er stilt dem i utsikt"},{"number":84,"text":"Han er det, som er Gud i himmelen og Gud på jorden, Han er den Vise, den Allvitende"},{"number":85,"text":"Full av velsignelse er Han, som har herredømmet over himlene og jorden, og alt som mellom dem er. Hos Ham er kunnskapen om timen. Til Ham skal dere føres tilbake"},{"number":86,"text":"Det de påkaller utenom Ham, formår ikke å legge inn godt ord, bare slike som bevitner sannheten, og vet beskjed"},{"number":87,"text":"Om du spør dem: «Hvem skapte dere?» Så svarer de: «Gud.» Hvordan kan de da bli så forvridde"},{"number":88,"text":"Hans utsagn lyder: «Herre, dette er visselig vantro folk.»"},{"number":89,"text":"Så tilgi dem, og si: «Fred!» De vil få å vite"}]}