{"number":51,"edition":"no.berg","ayahs":[{"number":1,"text":"Ved dem som skrider hurtig frem"},{"number":2,"text":"de lastbærende"},{"number":3,"text":"de lett glidende"},{"number":4,"text":"de som fordeler ting"},{"number":5,"text":"Det som dere er truet med er visselig sant"},{"number":6,"text":"og dommen inntreffer for visst"},{"number":7,"text":"Ved himmelen med alle sine baner"},{"number":8,"text":"dere fører motstridende tale"},{"number":9,"text":"og noen føres i falsk lei"},{"number":10,"text":"Død over alle løgnmakere"},{"number":11,"text":"som i sin forvirring tar seg blindt til rette"},{"number":12,"text":"og spør: «Når inntreffer dommens dag?»"},{"number":13,"text":"Jo, den dag de prøves over Ilden"},{"number":14,"text":"«Smak deres prøvelse! Dette er det dere ville ha påskyndet!»"},{"number":15,"text":"De gudfryktige skal være i paradisets haver blant kilder"},{"number":16,"text":"og mottar det Herren gir dem, de handlet vel før dette"},{"number":17,"text":"brukte lite av natten til søvn"},{"number":18,"text":"og bad ved morgengry om tilgivelse"},{"number":19,"text":"og tiggere og utstøtte hadde del i det de eide"},{"number":20,"text":"På jorden er jærtegn for dem som har troens visshet"},{"number":21,"text":"og i dere selv! Kan dere ikke se"},{"number":22,"text":"I himmelen beror deres underhold, og det dere er lovet"},{"number":23,"text":"Ved himmelens og jordens Herre, det er så sant som at dere kan tale"},{"number":24,"text":"Har historien om Abrahams ærverdige gjester nådd deg"},{"number":25,"text":"Da de kom inn til ham, hilste de: «Fred,» og han svarte «Fred! Fremmede folk?»"},{"number":26,"text":"Så gikk han bort til sine husfolk, og kom med en gjøkalv"},{"number":27,"text":"satte den for dem, og sa: «Vil dere ikke spise?»"},{"number":28,"text":"Da ble han grepet av frykt for dem, men de sa: «Frykt ikke.» Og de bebudet ham en oppvakt gutt"},{"number":29,"text":"Så trådte hans hustru frem i stort opprør, slo seg i ansiktet, og sa: «En gammel, ufruktbar kone?»"},{"number":30,"text":"De sa: «Så sier Herren! Han er den Vise, den Allvitende.»"},{"number":31,"text":"Abraham sa: «Hva er så deres ærende, dere utsendinger?»"},{"number":32,"text":"De svarte: «Vi er sendt til et syndig folk"},{"number":33,"text":"for å sende over dem steiner av leire"},{"number":34,"text":"merket av Herren for de lettsindige"},{"number":35,"text":"Vi har ført ut de troende som var der"},{"number":36,"text":"men vi fant bare ett hus der med Gud hengivne.»"},{"number":37,"text":"Og vi etterlot et tegn deri for dem som frykter en smertelig straff"},{"number":38,"text":"Likeledes i Moses, da Vi sendte ham til Farao, med klar autorisasjon"},{"number":39,"text":"Men han vendte seg bort, sikker på sin makt, og sa: «En trollmann, eller en besatt!»"},{"number":40,"text":"Så tok Vi ham fatt, ham og hans hær, og kastet dem i havet, for han var klanderverdig"},{"number":41,"text":"Likeledes i Ad, da Vi sendte over dem den fortærende vind"},{"number":42,"text":"som intet etterlot av det den møtte, men gjorde det til støv"},{"number":43,"text":"Likeledes i Thamod, da det ble sagt til dem: «Nyt livet inntil videre!»"},{"number":44,"text":"Men de satte seg ut over Herrens bud, og så tok tordenskrallet dem, med åpne øyne"},{"number":45,"text":"og de kunne ikke stå imot eller finne hjelp"},{"number":46,"text":"Og Noas folk tidligere. De var folk som levde i synd"},{"number":47,"text":"Vi bygget himmelen med kraft, og Vi gjør det stort"},{"number":48,"text":"Og jorden, den har Vi bredt ut. Hvilken utmerket tilrettelegger"},{"number":49,"text":"Alt har Vi skapt parvis, så dere må komme til ettertanke"},{"number":50,"text":"Så fly hen til Gud! Jeg er en klar advarer til dere fra Ham"},{"number":51,"text":"Sett ingen annen gud ved Guds side! Jeg er en klar advarer til dere fra Ham"},{"number":52,"text":"Så har heller intet sendebud kommet til folk som levde før dem, uten at de sa: «Trollmann, eller besatt!»"},{"number":53,"text":"Har de latt det gå i arv til hverandre? De er oppsetsige mennesker"},{"number":54,"text":"Så vend deg bort fra dem, og du vil ikke bli bebreidet"},{"number":55,"text":"Og forman, for påminnelsen gagner de troende"},{"number":56,"text":"Jeg har skapt dsjinner og mennesker kun for at de skal tjene Meg"},{"number":57,"text":"Jeg ønsker ikke underhold fra dem. Jeg ønsker ikke at de skal bespise Meg"},{"number":58,"text":"Gud er Forsørgeren som har makt og er fast"},{"number":59,"text":"De urettferdige får samme lodd som deres likesinnede fikk. De trenger ikke skynde på Meg"},{"number":60,"text":"Så ve over de vantro, for deres dag som de er stilt i utsikt"}]}